[
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "santhosh-10290",
        "review_rating": "10",
        "review_title": "Jai Bhim",
        "review_detailed_main": "Excellent Movie. Everybody acted well in the movie. Songs and BGM in the movie were excellent. The movie was so interesting and thrilling. This is the Best Tamil Movie of 2021. Excellent Movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ahamedmn",
        "review_rating": "10",
        "review_title": "OSCAR LEVEL 🔥",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rosheenkan",
        "review_rating": "10",
        "review_title": "The Powerful Film",
        "review_detailed_main": "The film is based on true story which was happened 28 years ago.\n\nDespite given an 'A' rating for its strong content, the film was real and brutal what we see it is similar to Visaranai and Kavalthurai Ungal Nanban. This is one of the best and powerful legal films. Thus, it's a must.watch."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ashishpalatown",
        "review_rating": "10",
        "review_title": "Brilliant movie",
        "review_detailed_main": "The best movie i have seen in a long time. This movie should be send to Oscar , cause it really deserves an oscar for the wonderful performance . Really brilliant cast and directions .."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "cs_rahul_prasad",
        "review_rating": "10",
        "review_title": "Suriya's Jai Bhim Deserves To Get An Oscar Award For The Best Movie, And Suriya Deserves To Get The Best Actor Award !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ezhilan-79941",
        "review_rating": "10",
        "review_title": "Intense, Raw, Must Watch, Good Casting, Acting, One of the best movies. Suriya's best. This movie is based on true incident that happened in 1995.",
        "review_detailed_main": "One of the best movies. Suriya's best. This movie is based on true incident that happened in 1995. True incident movies might come out like a documentary but here the director managed it well and movie came well and its very interesting to watch. It's a movie of 2.5 hrs but we don't get boring."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "m-ramanan",
        "review_rating": "10",
        "review_title": "It could have become documentary at any point, but not....",
        "review_detailed_main": "RATED 10/10 Language: Tamil Source: Amazon Prime RECOMMENDED\n\nTribal life and their rights are cleverly delivered...at some point i forgot that i am watching movie and seeing their pain in real. The cast and locations are so real...The court room drama and the flashbacks are well balanced and at end credits makes the awe... Kudos to Jo and Surya for producing this movie... At any point this movie could become a documentary, but director brilliantly maintained the mainstream movie entertainment throughout the story telling.... Another big advantage is that you will never feel the preaching/advising tone and it is not biased.\n\nIt delivers the same pain and feeling of the movie \"Visaranai\".... Must watch."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ajaynkumar",
        "review_rating": "10",
        "review_title": "Amazing ..hard-hitting movie",
        "review_detailed_main": "Its must watch ..had hitting real story based story with amazing story and cinematography. Its amazing and mind blowing the writing and acting of evry one is just another level ..its a overall another level movie a another gem by gem surya sir."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "classicsoncall",
        "review_rating": "8",
        "review_title": "\"It will be quite an uphill battle.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sherlockholmes99",
        "review_rating": "10",
        "review_title": "Intense must watch",
        "review_detailed_main": "Very excellent Film After soorori Pottru another masterpiece from surya.\n\nThe film has an excellent story plot with good character's sketch The film successfully narrates the realistic lives in india."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "hXz0r3",
        "review_rating": "10",
        "review_title": "One of the best movie in todays era.. Splendid and worth every minute.",
        "review_detailed_main": "This was one of the best movies I have watched in recent years.. that too based on true facts.\n\nCasting, Story, Acting, Direction every small thing made a masterstroke here.\n\nSurya as leading actor lawyer and Lijo Mol Jose as Sengoni made a remarkable and splending performance.\n\nBollywood should learn from this type of movies.. or will just make a remake of same with lowest performance with high budget !!!\n\nOnce again, was very sad on checking the true facts which the movie brought in front with remarkable drama. Hats-off to all actors."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "magadalwarmayur",
        "review_rating": "7",
        "review_title": "What a great film",
        "review_detailed_main": "I'm not a native tamil speaker but I had seen the film trailer which had intrigued me.\n\nThis film is what I call raw hitting. It hits where it hurts the cast did a great job the casting director did better job of finding such cast.\n\nThe direction of this film is very grounded it never feels like cliche so does the acting of all cast member.\n\nThe cinematography of the Film is very simple which gives it more of an indie film vibe .\n\nAs an Indian you should definitely watch this film because I haven't seen more important film than this in a decade."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "RaoulCauvin-62268",
        "review_rating": "",
        "review_title": "Finally a great movie from India about the marginalized sections of the society",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "akshatmahajan",
        "review_rating": "8",
        "review_title": "South Indian Industry is rocking",
        "review_detailed_main": "This movie is much needed movie which raises questions on police, custody murders and casteism. Nowadays, South India Cinema is giving us much better movies than bollywood.\n\nStory was good, pacing and execution was also good but could have been little bit better, acting was also good (nothing looked fake or forced). Not adding songs in the movie was best choice, that could have ruined the movie. This movie was different than bollywood's legal case stories which have masala, songs and overacting.\n\nOverall, will recommend this to everyone. You must give it a try."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "jaybhakta-80095",
        "review_rating": "10",
        "review_title": "OSCAR WORTHY, read below.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ketgup83",
        "review_rating": "8",
        "review_title": "Do Yourself A Favor, Leave Everything And Watch Suriya's Hard-Hitting Drama",
        "review_detailed_main": "Jai Bhim turned out to be a hard-hitting, raw and powerful court-room drama. The purpose of cinema is not just to entertain but also educate and empower the audience. The courtroom drama based movies are always engaging as the prosecutor and defendant both fight to solve the case with solid evidences and innumerable witnesses.\n\nBollywood Films like \"Damini\", \"Jolly LLB\",\"Talvar\" \"Rustom\", \"Pink\" or even \"Section 375\" have been immensely successful in keeping the audience engaged with impeccable dialogues and fantastic screenplay but what makes Jai Bhim different is the beautiful message on morality and equality of a tribal woman who fights for the justice of her husband.\n\nJai Bhim is based on 1995 Habeas Corpus petition in which human right activist cum lawyer K. Chandru ( played by Suriya ), who takes up the case of Irular tribe couple (Rajakannu and Sengeni) where the husband is wrongly convicted by local police for stealing ornaments from village head's house.\n\nAs Jai Bhim opens, we see that cops segregating the prisoners based on their caste. Among all the caste, the tribal people becomes the easy target for the cops to clear the pending cases under the influence of their political head. We also see how Rajakannu, the main accused in the jewelry case, is forcibly taken away from his family. The film goes back in the flashback mode where life of the tribal couple is beautiful in the serene village where they hone the skills of catching rat for their bosses. As their life progresses, in one of the event Rajakannu and his brothers are caught for the crime which they did not commit. They go through extreme level of police harassment and torture which will be very hard to digest and is completely raw. Enter Chandra a.k.a Suriya who takes up the case when Sengeni narrates the entire incident and request to help find her husband who as per police, has been absconding from the jail.\n\nJai Bhim is one such hair-raising film which is definitely difficult to digest as it gives you goosebumps and eye-popping experience. Screenplay is the hero with nail-biting moments. Art direction is fine while Cinematography is excellent. Suriya is a knight in shining armor. Watch out for him in the second half when he questions the witnesses in the courtroom. It is unforgettable performance which should be lauded for its sheer brilliance. Among the actors - Manikandan and Lijomol Jose are mind-blowing with their natural performances. Prakash Raj does well as IG.\n\nJai Bhim is an experience that needs to be lauded for its impeccable direction, electrifying performances and beautiful message. Excellent 4/5."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mohamedshakir-03491",
        "review_rating": "10",
        "review_title": "No words! Undoubtedly the best movie of 2021.",
        "review_detailed_main": "We know that this movie is based on a true events. Hats off to Suriya for choosing this kind of a role. What an outstanding performer he is. Rajakannu and his wife that two characters oh my goodness, every single scenes the performance of both 👏 wowwww. I'm damn sure that this movie will take all the awards this year. Don't miss this gem of a movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "aswingsreevalsam",
        "review_rating": "10",
        "review_title": "Terrific movie",
        "review_detailed_main": "What a movie Suriya sir,all characters are best performers hates of the gnanavel the director of this beautiful film.and again thanks to Suriya sir for producing the movie and act chandru character 4 75/5."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "TreeFiddy53",
        "review_rating": "8",
        "review_title": "Brilliant, hard-hitting & a must watch.",
        "review_detailed_main": "Turns out, the movie is based on a real-life incident from 1993.\n\nIn times when being a policeman is mostly glorified in Indian cinema, I wasn't expecting a movie about police brutality, something that's usually swept under the rugs, which makes this an important film in Tamil film industry and thanks to streaming services, in Indian Cinema.\n\nThe storytelling does a great job of making you care enough for Rajakannu and Sengani (both brilliantly played, with Lijomol being the show stealer in this movie) that you empathize with them throughout the movie. Parts of the movie were brutal and hard to watch, don't be surprised if you find yourself shouting \"Okay that's enough! STOP!\" at the events that unfold. Suriya and Prakash Raj play their respective roles with just enough intensity, nothing over the top with this one. Acting by all of the support cast was very well done.\n\nAs much as this film is about police brutality, this is also about casteism, which is still prevalent in our great country. Movies, both good and bad ones, in the past on this topic have been made, but you can tell if the script is trying too hard to highlight the caste system. This one, I thought, did it just right and didn't overdo it.\n\nIf you HAVE to, you can find things wrong with the movie - some cinematic liberty, the \"comedic\" elements, some \"mass moments\", were all necessary IMO. That said, this isn't the kind of movie you find flaws in, but the kind that you watch, and learn and grown from as a person. So, I'd request that you simply appreciate the filmmaking, empathize with the characters and learn a thing or two takeaways for real life."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nidhunmoviebuff",
        "review_rating": "8",
        "review_title": "A hard-hitting courtroom drama on custodial violence!",
        "review_detailed_main": "Despite being over 2 hours and 45 minutes long, 'Jai Bhim' is an engaging, thoroughly entertaining watch backed by an astonishing real life story of custodial violence, police cover-ups and systemic corruption.\n\nSuriya plays a crusading lawyer, hell bent on revealing the truth behind three Irular (Scheduled Tribe) men who go missing while being in police custody.\n\nThe superstar turns in an impeccable performance as he fastidiously chips away at the truth, only to discover layer upon layer of lies, caste hatred and cruelty.\n\nDespite having a big name star at his disposal, director T. J. Gnanavel deserves praise for letting the story take the driver's seat, never reducing to unnecessary 'massy' sequences or masala elements to drive the narrative forward.\n\nLijimol Jose as the wife of Rajakannu (played by Manikandan) is an absolute force of nature in her role, delivering some of the best sequences in the film, turning in a performance a veteran would be proud of.\n\nPrakash Raj as usual excels in a supporting role while and Rajisha Vijayan had precious little screen time to make any sizeable impact.\n\nThe music from Seal Roldan played very significant role, helping the audience to feel the pain of the beleaguered protagonists in the beginning and that of vindication and righteousness towards the climax.\n\nJai Bhim does not rise up to the emotional highs of previous classic dramas based on custodial violence like Visaranai (2015) or Naandhi (2021) but is an immensely engrossing watch. Recommended!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "xscenex",
        "review_rating": "10",
        "review_title": "Excellent!",
        "review_detailed_main": "This is what is called as a perfect Movie. The story was good, the acting of all the characters was commendable. This is realistic but a dramatic tinted movie which was really a need of the moment when there are only the fabricated one sided masala films which only glorify the image of the cops, where as that is a rare case. This movie shows the reality. And the harsh truth. Well made."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Quinoa1984",
        "review_rating": "6",
        "review_title": "Take from an American: its a mixed bag!",
        "review_detailed_main": "I am basically in absolute agreement, without equivocation, of its main message against the rampant and wretched authority given to the police in this part of India (that I can gleam in general, not knowing much about how all the Caste systems work and just how much sub-*inspectors have in terms of power), while at the same time I bristle at the presentation - how the same hand that beats these poor peasants in the jail cell is as heavy as the director who's wielding the camera and editing software. And I know I know I know I know, these movies are what they are, but for this to be even in some part a Musical kind of undermines to me the shock and real pain and agony of the citizens here. (Just imagine like, I dunno, Kiarostami making this).\n\nJai Bhim has an important story to tell, and the actor Suryia (just Suryia far as I can tell) is very strong, often when he isnt doing anything and is just listening, as the crusading and heroic human rights lawyer leading the charge against these especially heinous acts (kind of like Law and Order but Defense not prosecution), and there are moments for the actress playing the pregnant and heartshattered wife of the man accused of stealing and on the run to show some depth of feeling past the screaming and crying imposed on her. On just a technical level, it's hard to doubt that those beating scenes are effective as a blunt instrument to get the audience into a particular frame of mind.\n\nBut liberal propaganda is still not any less the latter because it's the former, and all the good will I have for this gets tested over the not atypical 164 minute run time. On the other hand, this definitely has in the middle, once it gets into the meat and potatoes of the case, some good and rather gobsmacking procedural court scenes here (that this one decent lawyer could unravel a whole bees nest of corruption is amazing). At the same time though I almost would've been more interested in a story centered on the tribespeople and how they live and maybe learn and try to become citizens (even if all for not)."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mrkabatullah",
        "review_rating": "",
        "review_title": "What a Nice Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Xstal",
        "review_rating": "8",
        "review_title": "Tamil Tragedy, Turmoil & Torture...",
        "review_detailed_main": "This extraordinary story will leave you aghast at the injustice and corruption endemic in the constabulary of India, or at least in the state of Tamil Nadu where these events take place. Based on true events relating to prejudice and persecution, activities that still permeate these societies today, this film is best watched in Tamil with subtitles if the language is not one you own."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shaeshatriashwin",
        "review_rating": "10",
        "review_title": "Jai Bhim - Best movie Of 2021",
        "review_detailed_main": "Definite National Award Winning Movie. A great social message film with Thrilling Crime ScreenPlay. Suriya's Next Level performance after SP. Supporting Actors done extraordinadry especially by lijomoljose as sengeni & Manikandan as rajakannu stunned everyone by their national award winning perfomance. Prakashraj Comeback film. An impactful must watch film."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "WorldMovie99",
        "review_rating": "9",
        "review_title": "JAI BHIM is Real, Brutal and Thoughtful",
        "review_detailed_main": "Jai Bhim is real. No doubt about it. A real story portrayed with gripping narration. Makes you fixed on the movie. Jai Bhim is brutal. Yes, the horror of stereotyping people. It breaks your heart throughout the event. Jai Bhim is thoughtful in the sense that it will keep you thinking about who is really the culprit in today's society. Finally it will gives you a silver lining throughout the dark episode. An intellectual war between constitution and unconstitutional surpassing caste creed and divisons.\n\nNow coming to the movie, Suriya plays the role of a dedicated lawyer. He works for upliftment of the downtrodden and provides justice. He plays the part well, no nonsense behavior normally done by the protagony of south movies. The antagony is well represented. Means he is perfect outwardly but a devil inside. A genuine depiction of villains in real world. The movie progresses as a war between justice and injustice that finally gives an optimistic ending. Like a ray appearing in the dark. The message of awareness that we should cultivate rearding oppression done by law keepers is a mandatory nowadays. I shall remember movies like Jai bhim and Ardh Satya regarding the social issues. Both are good though opposed to one another in story.\n\nPrakash Raj is good to watch esp in Positive role. The performances are praiseworthy. All possible edges are covered makes you seated. The BGM is of heightened feel. It is a positive themed movie. One of the best from south. Recommended for social issues in Indian context. It's a strong point also that the movie is based upon a true story, but there is a minor political issue attached with it. It is modified so is slightly unreal with unreal vibes throughout. So a 90/100."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kishorkure",
        "review_rating": "10",
        "review_title": "Speechless 😢😢",
        "review_detailed_main": "The movie tells us the meaning of Dr Ambedkar's philosophical thoughts, Jai Bhim meaning a journey from Darkness to Light. What a movie!!! Wow!!! Just wow!!!! This movies lets us know the true meaning of fight against injustice. The brutal scenes of the movie really broke my heart many times watching the movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mysterychannel",
        "review_rating": "10",
        "review_title": "No words to describe",
        "review_detailed_main": "Wonderful 👏 Brilliant Heart touching . Everyone outperformed , Hat's off to Surya . Must watch , no words to say . Brilliant movie, 100% , emotionally shaking..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "divyapraba",
        "review_rating": "9",
        "review_title": "TERRIFIC AND GONNA LAST FOR YEARS 🔥",
        "review_detailed_main": "JAI BHIM ✊\n\nEmotional ,Hard Hitting And quite intense with No Nonsense cliches towards the entire film...\n\nTerrific Cast , Well researched & Gripping Screenplay...\n\nMusic + Artwork + Cinematography Was best as its peak 🔥\n\nSome Films May entertain us , Rare films may disturb us.. JAI BHIM ✊ was one among them & it's Most compelling film I have seen in Recent years.\n\nJAI BHIM ✊\n\nMuch Needed Applause & Watch\n\nGonna Fetch multiple accolades in the following years\n\nOn the Whole .. Tha. Se. Gnanavel Needs A Standing Applause for this film..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vluckylkv",
        "review_rating": "10",
        "review_title": "Agar kuch dekhna hai toh isko jarur dekho",
        "review_detailed_main": "What a movie!! I usually don't cry while watching movies but this movie left me in tears, Suriya and supporting cast performance is top notch. This story will force you to think about social injustice in our society and police custodial death is horrifying truth of our country. It's a must must watch film for everyone. Don't miss."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Fella_shibby",
        "review_rating": "10",
        "review_title": "Captivating, well acted n thought provoking. Not a single dull moment. Definitely deserves an Oscar.",
        "review_detailed_main": "If Atticus Finch is the greatest movie hero, then Chandru is the most underrated real life hero.\n\nThis movie is a sobering reminder of the injustice and lack of accountability that plagues my beloved India.\n\nThe poor dwellings in the mountainous forests reflected the state of deep racial problems and social injustice that still exists in my beloved India.\n\nThe guy (Suriya) who played Chandru gave an amazing performance.\n\nThis is my first film of Surya n I have become a huge fan of him.\n\nAlso this is my first film of the lead actress Lijo Mol Jose and she gave an intense performance and her character Sengkani will make even the toughest skin to feel sad.\n\nThis movie has the most brutal scenes of police brutality. More horrific than most horror films and very very frightening when u know that the movie is based on true events.\n\nThe real life judgment of Rajakannu vs State of Tamil Nadu & Ors, has Parvathi's statement on the torture that she and her husband had suffered, the reality seems far worse than art."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "arungeorge13",
        "review_rating": "7",
        "review_title": "Suriya & Co. deliver a hard-hitting social issue drama! [+73%]",
        "review_detailed_main": "It's always nice to see a star like Suriya move away from a typical masala flick for Diwali and come up with a hard-hitting courtroom drama based on actual events. In the film, he is more of a tool that helps enact justice for the oppressed victims. There's no showy entry, songs that praise him to the skies, or stock heroines who exist only to admire him. Instead, the film focuses more on the tribal characters played by Manikandan and Lijomol (both excellent) and the series of unfortunate events that they go through.\n\nPolice brutality has been a sensitive topic, touched upon by very few films and filmmakers, even when we keep hearing several such cases in the news. Films like Visaranai and Karnan paved the way for TJ Gnanavel's Jai Bhim to tell a harrowing social issue without the need to be preachy. Jai Bhim's first hour is a somewhat disturbing watch, with the cries of the oppressed both tugging at your heartstrings and coming across as slightly amplified. There's no subtlety at play. The punches are wholly felt, the screams are heard loud and clear. If you still don't, Sean Roldan's woeful score will drive the point home.\n\nBut the film gets infinitely better in its final hour. While the finale isn't exactly unpredictable, the journey of getting there is riveting. Both Suriya and Prakash Raj deliver the goods gracefully - not for once, getting in our faces with loud monologues. At a length of 2h 45m, Jai Bhim works due to its performances and topical relevance. Glad that a mainstream audience gets to see it on OTT."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "suhas-01592",
        "review_rating": "1",
        "review_title": "Another propaganda based movie !!!",
        "review_detailed_main": "I really like Suriya and his acting, from Ghajini to recent Soorarai Pottru i enjoyed his movie. But this movie was made with unwanted controversies. Movie is based on real incident... fine, then show as it happened why you change the religion? The movie tried to portray discrimination experienced by the unprivileged class of society... It's a good thought. But in the real incident (based which this movie was made) the sub inspector was a Christian but in the movie his character was modified into an upper caste man. Why Anthony Das becomes Guru here? All other main character names are retained. The original characters have been intentionally replaced to target specific communities who are against the Surya's favorite Ruling party. Only because their minority appeasement will come to stake or there will be a question mark on their so called secularism ideology. The moment I saw Periyar (person who was believed to fight against discrimination, but filled with hatred towards hindu traditions) I was disgusted. This movie is made to create hate towards certain communities which was unnecessary."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "soundarryagr",
        "review_rating": "10",
        "review_title": "Winner of best film of the year",
        "review_detailed_main": "Must watch A story inspired from true events so raw and real.\n\nSuriya proves why is the the best this man got his acting right and to produce such a bold film he is great example in tamil film industry Actors did fantastic job Everything in this film is praiseworthy."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "airjordanyk",
        "review_rating": "10",
        "review_title": "A riveting and raw legal drama with mind-blowing performances from Suriya and Lijumol",
        "review_detailed_main": "Director Gnanavel captures the raw nature of police brutality with a high degree of realism, and every scene was emotionally charged. Suriya brings another firebrand performance after SP, and delivers with his impeccable dialogue delivery and mannerism. I'm glad they didn't add any unnecessary mass/commercial scenes just because it is a Suriya film, and even the songs went along with the story instead destroying the pace. Another important mention is Lijomol Jose's performance as the Irular women who nailed it in every scene.\n\nIf I had to nitpick some minor negatives in the movie. It would be the antagonists. While they did a satisfactory job, perhaps having a more intelligent lawyer to counter Suriya would have added to more intensity, however this barely impacts the film. The runtime could have also been shortened by 10-15 minutes.\n\nJai Bhim is a fantastic movie and frankly I was more emotionally moved by it than Soorarai Pottru. The movie is an eye-opener to police brutality, but isn't over the top in its police bashing either. Instead it provides nuanced perspectives from well-meaning police officers (pay attention to Prakash Raj's role) in an attempt to support a more just legal system.\n\nRating: 9.5/10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "raghothamtarget",
        "review_rating": "10",
        "review_title": "It's not just a film , it's a lesson.",
        "review_detailed_main": "Real pain of the victim was conveyed to audience, watched the movie with the tears , brutal real incident what happened to innocent tribe just 1 story came to lights but untold stories are infinity .\n\nReal pain of the victim was conveyed to audience, watched the movie with the tears , brutal real incident what happened to innocent tribe just 1 story came to lights but untold stories are infinity .\n\nIt's not just a film , it's a lesson.\n\nJAI BHIM."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Vishnusaai",
        "review_rating": "10",
        "review_title": "Tamil industry 💥🙏",
        "review_detailed_main": "What a powerful performance by the cast & crew .... A most watch movie... Suriya sir nailed it back to back following Soorarai pottru... Other casts also fabulous acting 🙏... Blockbuster movie...."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Ketch_Rajath",
        "review_rating": "10",
        "review_title": "Super Powerful Courtroom Drama",
        "review_detailed_main": "Suriya gave 'Soorarai Pottru' last year as diwali gift & didn't forget this year also. 'Jai Bhim' is not only one of the best movies of 2021 also one of the best Engaging Courtroom Drama ever produced in this world."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sankalpoctober",
        "review_rating": "8",
        "review_title": "Masterpiece",
        "review_detailed_main": "Again suriya rocked it with his mind blowing performance 🔥. I don't know y ders no much hype for dis movie. Evry1 thinks dat dis movie is a ordinary Court drama movie, u won't understand until u watch it completely. It's based on true story.\n\nWe can say that dis is a comeback for Director Ganavel . Firstly hats off for Manikandan and Lijomol jose for their performance in the movie. Seriously their acting was mind blowing. Story, acting, songs, VFX everything was perfect⚡. Few violent scenes r disturbing.\n\nA must watch movie.\n\nMy rating would be 8/10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "saisathish-68708",
        "review_rating": "10",
        "review_title": "Vera level... Movie",
        "review_detailed_main": "Respect and justice is equal for all.\n\n\"The best work of art is to make an impact in the minds of the audience and as a result make a positive change in the community! Yesterday I saw the movie where friend @Suriya_offl lived as lawyer Chandru. The film has caused a great deal of controversy. H."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pradeep-10976",
        "review_rating": "10",
        "review_title": "Tharamana Padam 💯",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ssunny-social",
        "review_rating": "6",
        "review_title": "Indian Binary Voting",
        "review_detailed_main": "We Indians live in binaries since our votes are mostly emotionally driven. When we love a film star in the film or the cause it discusses, we are hypercharged and want to give it a 10. Just the way Vishwaroopoam was. Vishwaroopam had 9.8/10 with more than 30k votes back in 2013 when Indian films barely touched 10k votes (pre-jio era).\n\nThe same is happening with Jai Bhim, which is currently at 9.6/10 in above 70k votes. Diving a little deeper into the vote analysis, it shows 62k votes is 10/10. That would mean, the film has been voted as one of the rarest of rare flawless pieces of art to ever come out in the world of films. I think I have rated about 4 films 10/10. Not to say this does not deserve a 10/10. But the film receiving a perfect score from more than 88% of the total votes is an extreme coincidence, especially when the top 1000 voters on IMDb have a weighted average of 4/10 - not 6, not 8, only 4/10 for the film. The funny thing is, 3.5% of them have voted it 1/10 as well. Let's compare this with another fan-driven top 10 IMDb film \"The Dark Knight\". The Dark Knight has a combined percentage of 10/10 and 1/10 of 46.3% against Jai Bhim's cumulative 91.5% in 10/10 and 1/10.\n\nNot saying this could not be possible, but this clearly seems like a large section of the audience is voting on the basis of the biased emotional rush. We saw similar instances with Wanted (2008) when this had just come out. However, this has reduced by a huge margin for Salman Khan films in the last 5-6 years with growing awareness on the mediocrity of bhai's films where even the fans now feel illiterate on praising his work. But considering the Hero worship in the Tamil and the Telugu films industry combined with a cause many people strongly resonate with, I am sure many things have been overlooked while judging this particular film. We saw this happen with Baahubali as well, no doubt it is an entertaining film but not without flaws. I am sure, so is this and many other such films."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sumitarora1988",
        "review_rating": "1",
        "review_title": "Changed Rating from 10 to 1",
        "review_detailed_main": "I first gave 10 * to this movie. But post studying the actual story on which this movie is based, I found a bitter part and I am forced to amend the rating to 1.\n\nReason - why did the makers pojected the police man from Vanniyar community when his actual name was Anthony Sami."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "arunkumarak-87395",
        "review_rating": "10",
        "review_title": "Masterpeice",
        "review_detailed_main": "Hard hitting best movie of year 2021 suriya na acting mass all the crew at their best i did n't come out from movie till now.one of my fav films list this gonna to be add. Dont miss it all of you can watch must watch film."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dvishvasam",
        "review_rating": "10",
        "review_title": "Rocking",
        "review_detailed_main": "Must watchable film. Every characters selection is awesome. Fantastic acting by suriya sir. Love you. And its very hard to digest is this happened in Tamilnadu its realky ashamed."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "praveen-596-564090",
        "review_rating": "10",
        "review_title": "One of the finest movies in the recent past",
        "review_detailed_main": "Kudos to Surya and the Director Gnanavel for presenting this movie based on a true event. These are dark secrets in the Indian society that very few choose to talk and fight against. I am happy that a hero like Surya chose to do this kind of a film. A must watch movie that give voice to the voiceless in the community and to represent the unrepresented people in the society. Great work by Jai Bhim team!!!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "drvivu",
        "review_rating": "10",
        "review_title": "Reality of india",
        "review_detailed_main": "Film perfectly describes how basic human rights of minorities have been compromised even after so many years of independence.\n\nA must watch for everyone who believes in humanity and equality."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ericsaju-12403",
        "review_rating": "10",
        "review_title": "BRILLIANT MOVIE.....",
        "review_detailed_main": "One of the excellent movie from tamil industry. The story clearly tells about the incident of \" Rajakannan \" he lost his life due to theft case which he has not done but the beat him brutally to confess that he has done the theft but he never confess that he has done the theft . This happen in the year of 1995. There is court lawyer named \" \"Chandru\" who struggle against this crime and also for the \"RIGHT TO TRIBAL PEOPLE \" without any fees.\n\nOVERALL \" EXCELLENT STORY... GREAT WORK FROM WHOLE TEAM \"... \" A MUST WATCH MOVIE \""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "chandraravi-52990",
        "review_rating": "10",
        "review_title": "Suriya sir outstanding performer",
        "review_detailed_main": "One word review suriya sir is complete actor mind blowing expression in the court room drama. Content scripting is very much attractive and bgm of sean roldean is so good overall its must watch movie to all. There is social message in the movie...keep watching the movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "akhilpurakkat",
        "review_rating": "10",
        "review_title": "Absolutely Astonishing",
        "review_detailed_main": ".Jai Bhim is one of the finest films ever made in Indian history. A big star like Suriya decides to bolster the cause of the marginalised and the downtrodden and it's such a respectable action from his side."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "bhuvannram",
        "review_rating": "10",
        "review_title": "As Expected from Surya Anna",
        "review_detailed_main": "Must watch flim before you die. A real story based on the one of the judges cases, some scenes were directed even by the tribals, surya anna eyes a powerful weapon in acting."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gk303007",
        "review_rating": "7",
        "review_title": "Brutal, but reality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ksridhar-35747",
        "review_rating": "1",
        "review_title": "Targeted political alignment",
        "review_detailed_main": "If you see it as a work of art, it is a good product.but the political alignment has made the entire effort go in vain.. movies should be taken for all sections of people and shouldn't discriminate any particular group to comfort the political masters agenda."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "akkid97",
        "review_rating": "10",
        "review_title": "Story of real life hero",
        "review_detailed_main": "Brilliantly portrait the film.story,direction and acting is good.movie drama engage the audience and connect them with story. It takes guts to portray this kind of role."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "AthreyaBodhidharmar",
        "review_rating": "10",
        "review_title": "Indian cinema at it's best",
        "review_detailed_main": "Suriya is invinsible if the movie is based on true events and he strikes again with a power packed role. He lets his stardom stay at the door and gives the story the lead. Unbelievably great film filled with emotions. This film is beyond entertainment and could impact societies in useful ways.\n\nHats off Suriya to choose to tell this real story to million out there!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Feel-the-truth",
        "review_rating": "9",
        "review_title": "Jai bhim... Suriya Vs Askshay",
        "review_detailed_main": "Luckily Amazon Prime had a dubbed hindi version of this movie, the opening scene of how low caste people are treated by the police sets the scene.\n\nThis first 30 mins after the opening scene is quite a bore but then the movie kicks in and what a movie JAI Bhim, tackling social issues and police corruption head on, this is a Suriya movie all the way, his controlled anger and approach to the role is spot on.\n\nPolice corruption is on the rise globally, its time that they answer for their wrong doings,\n\nTwo big movies were realised at the same time, an over the top unrealistic glorification of the police called Sooryavanshi and a small budget, realistic portrayal of social injustices called JAI Bhim, winning movie = JAI Bhim\n\nAkshay vs Suriya, winner = Suriya everyday and twice on Sundays."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "anoopmoon",
        "review_rating": "10",
        "review_title": "Interesting movie",
        "review_detailed_main": "Awsome movie .thrilling 3 hrs,and also a good story.songs are just awsome .start to end no boring .every one must see these movie .wonderfull acting by surya and other charcters .toatally a awsome movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pspkgabbar",
        "review_rating": "10",
        "review_title": "MUST WATCH MOVIE !",
        "review_detailed_main": "Movie is based on a true story and as usual Suriya rocked it! .The court scenes are very fresh and new which are very much closer to the reality and the screenplay is also great.\n\nOverall, you get a great insight into some laws the Indian constitution and how they work.\n\nGreat movie👌👌"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mahenthiraprabu",
        "review_rating": "10",
        "review_title": "Mind blown",
        "review_detailed_main": "I can't Express the feeling I have gone through after watch this movie so happy that tamil industry had this kind of brilliant director and actor too everybody nailed it I am proudly say this is a movie from my language tamil."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "akashshaji-50713",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "Watched an amazing surya movie felt so good that this movie will last in our hearts for a long time anu mol did wonderful acting everything in this movie is top class."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "skazharuddin-26032",
        "review_rating": "10",
        "review_title": "Masterpiece Jai Bhim Must Watch",
        "review_detailed_main": "What an amazing Terrific Movie.. I have no words.. totally speechless, hat's of to all cast & crew.. blockbuster. Surya nailed it.. each & every cast crews outstanding.."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vellorerajendrabalaji",
        "review_rating": "6",
        "review_title": "A Movie that strongly talks about discrimination but Ironically discriminates a set of people!",
        "review_detailed_main": "Jai Bhim is one of the Intense thrillers with a strong message and never ending controversies in recent times!\n\nMovie opens up with hint of Caste based oppression, poverty and courtroom drama.\n\nIt keeps ticking on all the above mentioned three elements throughout the movie.\n\nThe characterisation of the roles in the movie is perfect and it makes the viewers feel the emotions of characters.\n\nIts so gripping and kindles anger against oppression in multiple scenes and even through the movie.\n\nEspecially the scenes of torture in police station, kidnapping of the female child and ill treatment to women of the tribal communities are so powerful and gripping.\n\nA perfect movie which talks about discrimination but still discriminates a particular set of people by linking the antagonist to the symbols or identities of a particular group which could have been avoided.\n\nIf it was done for the case of reality or since it was based on the true life incidents, it provokes a strong question in the minds of viewers, why the names of antagonist alone is changed in comparison to the real life incidents.\n\nIt makes viewers think what is the motive of the director, whether its to talk against discrimination or to say Eye for An Eye!\n\nIronically the movie itself discriminates against a particular group of people , through Identity politics and name changes !\n\nDiscrimination is not acceptable even if jai BHIM does it!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shonalikukreja",
        "review_rating": "1",
        "review_title": "Altered facts",
        "review_detailed_main": "I was so shocked to see the movie. Its one of the best movies ever made in India but then because its a true story, i tried to search more about it and then i realized that the film makers altered the facts which is entirely disrespectful. They changed the religion of the main culprit. He was a Christian and they showed him Hindu. Also there are few changes in the story. I'm sorry. Please don't believe everything you see in the movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shumailzafar",
        "review_rating": "9",
        "review_title": "Outstandingly Perfomed",
        "review_detailed_main": "Watched \"Jay Bheem\" Yesterday.. It's been long since I have watched such an outstanding movie. Bollywood need this type of content good story.i must say it is the most underrated movie of this year."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "b-satishma",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": "No words to describe it.. the makers needs an award for taking such a plot and showing it to the world.. suriya is brave and kind.. its a must watch.. its so disturbing as well.. its still running in my mind.."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "I_am_abhishek",
        "review_rating": "10",
        "review_title": "Excellent💯 Movie. Awesome Acting. Deserves Oscar",
        "review_detailed_main": "This is a must watch movie. From starting till end it was full of message & was really good acting. The Advocate role was very well performed. All characters performance was outstanding.\n\nThere is a goosebumps-raising moment that has a tribal woman , also the protagonist turning her back on power, refusing to bow down to the system of dominance.\n\nSo, overall, it's a must watch movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "starebishan",
        "review_rating": "10",
        "review_title": "JaiBhim Justice justified.",
        "review_detailed_main": "JaiBhim Justice justified. Salute the deserved man justicechandru. What a film can't control the tears while watching. Actorsuriya 's eyes enough to say the real pain of the truth."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "svenkatmohit",
        "review_rating": "9",
        "review_title": "A Powerful tale told by powerful performances",
        "review_detailed_main": "A must watch, hits you hard with the harsh reality Makes you think about the judiciary of our country One of the best made films of the year Leaves a scar after you watch the movie It is raw and brutal , a powerful courtroom movie with proper story and no cliches do watch it Suriya never disappoints."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nallaiah",
        "review_rating": "9",
        "review_title": "A Master piece ..",
        "review_detailed_main": "A must watch....heart warming.... A powerful movie with strong message.. Last November everyone were inspired by Soorarai potru ..this time it's Jai bhim... This movie has to be awarded as it doesn't depend upon masala factor or \"mass\"components.\n\nBoth movies made a remarkable memory as these weren't seen only as a entertainment but both are real life stories and it will remain forever in our hearts ... the struggle of a single man as well as a community..well screened.. Must watch for the real life Advocate Chandru... without this movie v couldn't have seen such a wonderful man's struggle who fought for the basic needs of a community to give them a comman man's life ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "viduthalai",
        "review_rating": "9",
        "review_title": "Out standing Movie of the year🔥🔥🔥",
        "review_detailed_main": "Screenplay excellent Different story line Strong cast & crew Best direction& music & cinimotography... Finally surya's performance great... Only slightly slow ness movie other wise best movie...."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "DUDE6178",
        "review_rating": "10",
        "review_title": "Masterpiece movie",
        "review_detailed_main": "This movie is masterpiece item, everyone should watch this movie. Every scene is much realestic and emotional. A very good movie to be watched. Don't ever think about negative parts on this movie, everything is a postive. Don't have more words, but must watch this film .."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "desikanks",
        "review_rating": "7",
        "review_title": "Engaging drama",
        "review_detailed_main": "Lijomol Jose gives an outstanding performance as Sengeni. Repetitive scenes on custodial torture dry up the initial effects created on the audience. Court room drama is quite ok. Suriya and Manikandan live upto the roles. Dialogues deserve special mention. Sharp and Blunt. Director Gnanavel has done a good job in raising voice for equality through showing the real situation of the Irular tribe. More such movies can improve the standards of Tamil films."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "thunitshiva",
        "review_rating": "1",
        "review_title": "Plot stolen from real incidents without consent and tweaked to create communal tension",
        "review_detailed_main": "Story was based on a real incident. Writer has stolen it without consent of victim. And tweaked the story by changing characters and names to disregard the help and support provided by people in real incident. Movie has clearly disrupted communal harmony due to irresponsible and greedy nature of makers and lead actor."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sriramthestranger",
        "review_rating": "8",
        "review_title": "Predictable but engaging!",
        "review_detailed_main": "The movie is predictable in many scenes but still the performance of Surya and the music keeps us engaged throughout. The characters portrayed are highly one-dimensional except Prakash Raj. That is the major flaw of the movie unlike Visaranai, where Vetrimaran's characters and story was much much better than this one. Good watch neverthless!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "abduljouhar",
        "review_rating": "10",
        "review_title": "Finest one in 2021.",
        "review_detailed_main": "It's based on real story... And Suriya, Lijomol, Prakash Raj, Manikandan and each and Everyone gave 100%. Truly Inspiring, Suspenseful, Heartbreaking Movie. #MustWatch\n\nThis movie will inspire those who loyal to their Duties and sure will bring guilty feelings for the bad people.\n\nThe best movie I've seen recently and Suriya Thank you for all the crews and actor's for this wonderful movie and letting us to know that there is a hero out there.."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "premmgor",
        "review_rating": "8",
        "review_title": "Movie Premyy honest Review",
        "review_detailed_main": "I have always loved courtroom dramas and based on a true incident, hard-hitting social message, and uncommon subject, this is surely one of my favorites. The highlights: Actors' performances, BGM, and courtroom sessions. Though execution and the first 45 minutes could have been better. Still keep you intrigued throughout. Highly recommended! ❤"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "svenkatmohit",
        "review_rating": "9",
        "review_title": "Best Indian movie of 2021",
        "review_detailed_main": "Great story great acting A great story combined with great acting Makes you think about the judicial system of India Do watch it.\n\nOscar level Great direction."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kingkathir",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "The best movie in amazon prime in recent times. Suriya's carrier best movie. Best story and screenplay of a true event, can't expect anything more from a film industry. Hope these kind of movies are encouraged and more directors should do these kind of films. Must watch film for everyone."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sunadkiran",
        "review_rating": "10",
        "review_title": "Speechless",
        "review_detailed_main": "What a movie man,......\n\nI'm not getting any words to express the joy and satisfaction I received after watching this movie. People need to watch these kind of movies to understand what's going on around them. Just their city is nothing. And the crimes done by the people with government power is unimaginable. Great it was bought up in this movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ahirjoy",
        "review_rating": "10",
        "review_title": "Bravo!!!",
        "review_detailed_main": "JAI BHIM (Hindi Movie, Amazon Prime,2021) - Bravo!!! If you have to see only one movie in 2021, watch this one. It's unsettling, shocking, real. In the era of SQUID GAME and Suryavanshi fantasies, we need such real life stories. I feel so much guilty that we are still carrying the burden of this 2500 years old rotten caste system where our fellow human beings are still treated worse than animals. As if the actors have not acted, it feels like I am watching CCTV footage! There is minimal heroism, maximum expression. There is not much court room drama, still the pace of the story is intense. The police and system which were supposed to protect us, provide everybody equal rights for survival, in reality literally killing people based on their surnames!!! :-( This movie based on a real life story on tribal rights made me sad, this movie made me hopeful too! Hats Off to all the Actor-Director-Story Writers and entire crew members. 10/10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sandeepjsamudre2009",
        "review_rating": "10",
        "review_title": "Hard-hitting",
        "review_detailed_main": "Wow, a masterpiece after soorarai....... gets everything correct in all the scenes....every time.....surprised.....how can it be....masterclass acting.....premise is a original story......Also takes on a big societal topic..... How the unprivileged are always easiest targets for the system..... Have seen some... Examples like this in recent past.......... System working for the previleged......Makes wonder if justice is same for everyone...."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nagsaptarshi",
        "review_rating": "7",
        "review_title": "Jai Bhim- Heart in the right place but...",
        "review_detailed_main": "Looks like those who have watched Jai Bheem are already divided in two groups. The ones belonging to the segment which has superliked this innocuously immature movie and are championing it to be a messiah of their lost ideology and those who are considering this as a threat to their existence. It has a rating of 9.6 on IMDB and yet to come in the top 250 list of the database provided by the site even after securing nearly 56k votes when this review is being written, a proof of the fact that something is wrong with the metrics and the effervescent rating will overcome the emotional doldrums and will stabilize soon after the initial emotions doze off. This shows how people belonging to any particular political ideology have strongly voted in favor of this movie. On the other hand, the way this movie is being slammed by some so called 'Film Pundits' or the 'Protectors of the nation' on several social media platforms show their unnecessary fear of losing their propaganda politics for a mere movie. The real metrics of IMDB will come into action when the initial zeal will die off from both the parties. Wait till that day to be too biased by any judgmental review.\n\n'Jai Bhim' is an honest endeavour to champion the spirit of protecting the rights of our indigenous people. The movie has its heart in the right place. The depiction of the brutality meted out to our innocent tribals invokes pity. But that in no way makes a movie scale the heights of greatness. In no way, Jai Bhim succeeds in being obstinate to the popular demands and reach new heights of glory in terms of movie making. It is melodramatic from the beginning to the end and even though it has its effervescent moments of greatness it fails to live with it.\n\nThe movie is a strange admixture of movie making of the present-day style of real-life storytelling and the bland, over emotional way of direction, reminiscent of the 90s style of creating a movie. The entry of the protagonist in many scenes are made to invite whistle from the audience, uncalled for a movie belonging to this genre at this age when people expect a movie with this much sincerity in its intention to be grounded, uncompromising and undeterred by the lure of commercial gains.\n\nBut the pursuits of 'Jai Bhim' are unfathomably ambitious, to an extent that it fails to be realistic in its portrayal of the plight of the tribal people. Right from the inception of the story, where a sarpanch is pressurizing the SP to catch an innocent tribal till the trial in the court in presence of a buffoonery AG of the state, the movie is bubbled to shed its earthliness and thus fails to arouse any real emotion. The torture scenes are brutal, naked yet they do not conform to the storyline and appear to be exaggerated.\n\nSurya as the protagonist is good but at times appears to be lost in agendas and a weak screenplay does not allow him to come out of the shell. Prakash Raj is hyperideologist and does not have any connection with the ground realities. The ones donning the roles of Raja and Singani are brilliant though.\n\nThe reason why communist flags are being shown again and again and those went missing while the narration was leading to a conclusive end is nebulous. Communists or their ideologies or flags have been shown as mere agenda or objects appearing only when the screenplay needed them not when the situation demanded them. The intentions of the petty police officials are unclear and why the AG is hellbent on supporting them even when he is refuting the SP is also equally hazy. The theory of monetary benefits could not be well established.\n\nOverall, this movie should be hailed for its honest intention in portraying the plight of the oppressed sections of the society. Only the execution could have been better.\n\nThe cherubic style of the little kid is the best takeaway from this movie.\n\nMy Rating- 7 out of 10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sarojbhanu",
        "review_rating": "1",
        "review_title": "False biography",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rahulkrishna-43137",
        "review_rating": "10",
        "review_title": "Must watch film",
        "review_detailed_main": "Most of them knows that this film is based on real life story. Every actor done and acted very well .i am once again say its must film for every one.🙏 🙏"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "royalmanideeppaisa",
        "review_rating": "10",
        "review_title": "Really amazing just watch it",
        "review_detailed_main": "Movie is so good You'll not see Actor Suriya in the movie it is just lawyer chandru Suriya lived in the character and the whole cast done well You can't see a hero in the film it is a character in the movie Director done a pretty good Overall the movie is worth watching Don't miss the movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kart-49680",
        "review_rating": "10",
        "review_title": "Movie making, screenplay and story telling at Genius level. Just Perfect.!",
        "review_detailed_main": "Brilliant story telling. Made with a very genuine purpose. It has the social cause and humane.\n\nAs a movie maker, they had done the story telling, screenplay at its best. Total control and dedication to the core."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "jubssss112",
        "review_rating": "10",
        "review_title": "Quality movie",
        "review_detailed_main": "After a long long time... an absolute gem of a movie..It showcases the sad reality of our poor people. I sincerely, hope this movie atleast gets nominated for Oscar or wins it.. Superb acting by Surya.\n\nPLEASE DON'T REMAKE THIS MOVIE IN HINDI (BY CASTING CANADIAN ACTOR AKSHAY KUMAR OR SUPER DESHBHAKT AJAY DEVGAN)"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Filmwalla",
        "review_rating": "9",
        "review_title": "Surprise Package!!",
        "review_detailed_main": "I'm really surprised with indian content this year.. After sardar udham i think this film is true gem and no one against about it that this film deserve a special space for movie lovers as well as indian cinematic era_ Despite of Suriya's not too top notch performance like soorarai potru this film hold attention in it's torture scenes and one sided stuff.. This film is like mirchi for those who perfectly know what type of suffering we face in India behind caste system ; film also hold good at it's narrative intense style.. Cinematic takes and grounded presentation as well as close to reality matchup.. Everyone should take a ride of this thrilling and intense yet horrific tycoon!!! Don't miss a mark."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Dr_Manoputhran",
        "review_rating": "10",
        "review_title": "JAI BHIM is an uncompromised realistic Cinema!",
        "review_detailed_main": "Hats off to Suriya and Director T. J. Gnanavel for bringing this excellent product to limelight. Jai Bhim's story and screenplay are well crafted with masterful Direction! The movie is in top form for 95% of its run time.\n\nA Laudable portrayal by Lijo Mol Jose and Manikandan, big hugs to them! Perfect acting by Prakash Raj, Rao Ramesh and others too.\n\nFor actor Suriya, Jai Bhim is definitely in his Top 10!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "surajramteke-71729",
        "review_rating": "10",
        "review_title": "Really great movie",
        "review_detailed_main": "Gripping story great acting great writing it is a really great movie to watch I am suggesting everyone to watch this movie and after that you are going to give it 10-star rating and the movie totally deserve it so just go and watch the movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "biswasarjun",
        "review_rating": "10",
        "review_title": "Another Masterpiece from Suriya",
        "review_detailed_main": "Excellent Movie,,Full Family pack Drama,, Emotional,, Superb Storyline,,,Brilliant Screenplay & Dialogue Delivery... ( Must watch Movie)👌👌👌👌 All the characters are give their best performance..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "contactvikramraj",
        "review_rating": "7",
        "review_title": "Reality of Police Brutality",
        "review_detailed_main": "Movie is inspired by true events. Movie is focused on Brutality against tribes in mid 90s.\n\nThough we can see police brutality now a days also, movie is a shout out for the rights of the people who can not raise their voices against the system.\n\nI didn't like the direction part much but story will let you stick to the screen.\n\nMust watch movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "BhaskarOffl",
        "review_rating": "1",
        "review_title": "A real life incident based movie is Jai Bhim. In this movie, projected a real life hero as Villian. So this movie trying to make castes based violences in Tamil Nadu.",
        "review_detailed_main": "Rajakkannu, a tribal from Kammapuram near Virudhachalam in Cuddalore district, was taken to the police station in 1993 on a charge of theft and was later found dead after being severely tortured by the police during interrogation.\n\nGovindan (Vanniyar Caste) - a real life hero, a member of the Marxist Communist Party who had been helping the victims for 13 years, was responsible for bringing the perpetrators to justice and the victims from the end of the case.\n\nControversy arose over the differences between the true story of the released JaiBhim movie and the storyline, as well as the fact that a particular character in the film was talking on the phone, with a 1995 Vanniyar Kalasam calendar on the back.\n\nWhy not mentioned the real life Villian's name as Anthonysamy in JaiBhim movie?\n\nWhy project the 1995's Vanniyar Kalasam calendar behind the scene?\n\nWhy mentioned Gurumoorthy as Villian name and sounding\"Guru\" in JaiBhim's movie scenes?\n\nSo JaiBhim team wants caste based violences in Tamil Nadu."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "UmeshAditya",
        "review_rating": "10",
        "review_title": "A movie that deserves all the possible awards!",
        "review_detailed_main": "An extremely well made movie based on a true story of 1995 deserves all the possible awards. Intense court room drama that makes one think seriously on the social cause of inhuman treatment of tribals! Must watch by each one.\n\nMy ratings 10/10!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dipin-bt_86",
        "review_rating": "9",
        "review_title": "DB REVIEW....Great movie..tamil film at its finest",
        "review_detailed_main": "Great movie.one of the best in suryas career .top notch performances from all the actors .realistic approach to the subject .Great direction. It doesn't feel like a film it has life .the sorrow and miseries the characters had throughout is not just for the screen .it is wholesome felt at heart .\n\nOne of the bear performance from surya .\n\nTop notch film. One of the best so far."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sreeragpdp",
        "review_rating": "10",
        "review_title": "Jaibhim ❤",
        "review_detailed_main": "A brilliant script & extraordinary acting Suriya sir .I like it this movie 🍿* Suriya Sir lived that character Chandru . Tj gnanavel a brilliant director & script writer ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sribalajibt",
        "review_rating": "10",
        "review_title": "Realistic",
        "review_detailed_main": "Unmatchable performance by suriya and other characters. No can move from the move from the moment after watching the movie. Good screenplay and good music and sound effects."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ganeshvn",
        "review_rating": "10",
        "review_title": "JaiBhim",
        "review_detailed_main": "Really a masterclass movie from Suriya sir, dir gnan direction. Leo and Manikandan such a fantastic role both of them deserved a lot of appreciation. Worth To Watch."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sangharshmaske",
        "review_rating": "10",
        "review_title": "JAI BHIM",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vjdilly",
        "review_rating": "10",
        "review_title": "Lesson",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Sleepin_Dragon",
        "review_rating": "9",
        "review_title": "It's a terrific film.",
        "review_detailed_main": "A tribal woman faces a huge battle with The Authorities to get justice for her husband who's been arrested for theft.\n\nThis is genuinely a fantastic movie, it's one I'd urge you to stick with, it is definitely worth a few hours of your time. I'm not quite sure how my Amazon algorithm works, but I always have to dig for gems like this.\n\nFor me to stick to a subtitled film, without a distraction, no phone or tablet, this was quite something.\n\nThat scene with the cobra, that was the moment that won me over, and showed me this was one to watch. After that I found myself engrossed in the storyline. The ending really did surprise me.\n\nAt two and a half hours, it is maybe a little long in parts, but it's not drawn out or padded, everything is purposeful, a quick coffee break is all that was needed.\n\nI thought the cinematography was brilliant, perfectly suited to the film, at times it's grey and harsh, and at others it's bright, loud and loaded with colour, they sure made use of the glorious landscapes.\n\nI have seen several real life shows which show the way The Indian Police work, they seem to have a very different set of methods to those used in The West, I think this film showed how tough it can be for people to get justice.\n\nI heartily recommend watching this. It's all the more impressive knowing that it's based on real life events.\n\n9/10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "IPyaarCinema",
        "review_rating": "7",
        "review_title": "Hard Hitting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ms-08178-90680",
        "review_rating": "1",
        "review_title": "Propoganda......",
        "review_detailed_main": "The inspector was a Christian but why did you changed his name and portrayed him as a hindu we all know what could have happened if you have shown the truth missionaries of South Indian would have banned this flim."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "danishali-31236",
        "review_rating": "10",
        "review_title": "Suriya movie unique concept and content",
        "review_detailed_main": "Suriya what a performance , surya ki movie kaafi meaningful Hoti hai and is movie me mass , class dono dekh ne ko Mila Mene aaj tak aisi movie nhi dekhi south industry very well work and salute to be proud Indian cinema."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nanta-02951",
        "review_rating": "10",
        "review_title": "Masterpiece 🔥🔥",
        "review_detailed_main": "Super movie.story was very nice l.screenplay too nice.manikamdan acting super.surya sir backbones this film.congrates entire team.music super and sengani acting good.she have a nice future in tamilcinema.rajisha vijayan acting was goodddd.....my English typing so bad.haha.my rating this film 10🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "jeevadk",
        "review_rating": "10",
        "review_title": "Oscar award confirm",
        "review_detailed_main": "Acting Beast Suriya.. jaibhim movie was awesome. Oscar worth movie music was terrific all actors done their role very well. Great direction. Congratulations t.g.nyanavel."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "teacpltd",
        "review_rating": "10",
        "review_title": "Fantastic",
        "review_detailed_main": "Surya the great Chandru sir the real hero. Fantastic direction and I liked it very much. All police men should watch this movie. India is the country still having attitude against humanity. Jai Bhim long live Dr. Ambedkar ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "bhishamnarayan",
        "review_rating": "10",
        "review_title": "JAI BHIM",
        "review_detailed_main": "What a movie...best court movie I ever seen...\n\nWatch it guys.....................this is reality of India for Rural people....which was shown in movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vineethbattu",
        "review_rating": "10",
        "review_title": "Moved to the core!",
        "review_detailed_main": "Extremely intense story with mesmerize execution, surya sir and all the other actor's acting is filled with pride, for sure humanity in your heart gonna be touched at the end of the movie Moved to the core, everyone must watch it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mailjotheesh",
        "review_rating": "10",
        "review_title": "Expecting atleast 2 National awards for this Movie",
        "review_detailed_main": "Excellent story and excellent acting by every one of the actors. Cinematography and music has been excellent. Best tamil movie i have watched in this year along with Vinodhaya sitham."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "surya-pratap120",
        "review_rating": "10",
        "review_title": "Showing the truth",
        "review_detailed_main": "One of the greatest movie i have watched in recent times. Suriya done an excellent job here. Storytelling also at top notch. Casteism is a problem in India. So many people have gone through this."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "6",
        "review_title": "Jai Bhim's subject is too extraordinary to be handled by such ordinary execution but Suriya's power-packed performance makes it a worth watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "anuraktss",
        "review_rating": "1",
        "review_title": "Not a real story",
        "review_detailed_main": "Not a real story. It is produced to generate hatered among society. Name of the people are changed and whole story is changed to make people believe that some casts are evil to divide Hindus. So that some people can get political benifit out of it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rehman-38960",
        "review_rating": "10",
        "review_title": "Must watch...!!!",
        "review_detailed_main": "Surya at its best in this movie. Amazing Script and Amazing performances by all the Cast.\n\nNo Additional masala Added, Looks very realistic. A must watch movie on Social Issue."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "msmcalvin",
        "review_rating": "10",
        "review_title": "Superhit",
        "review_detailed_main": "Its not awesome, Its beyond that. Its a very very interesting movie. Its really thrilling. Everyone must watch. Thanks to the directior, script-writter, actors. U guys rocked it. Best."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "BabySharkDoDoDie",
        "review_rating": "8",
        "review_title": "A No-nonsense Courtroom Drama",
        "review_detailed_main": "One of the best movies I've watched this year from South Indian cinema. Suriya was outstanding & every other supporting cast did an amazing job. The only problem is that it gets predictable but the fact that it is based on real events it never loses your interest as it is well-written, directed, acted & performed which makes it a must watch."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Alien901",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "Every indian Cops must watch this movie and understand, what's a value of every life.\n\nEvery indian Cops must watch this movie and understand, what's a value of every life.\n\nEvery indian Cops must watch this movie and understand, what's a value of every life."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Thanos_Alfie",
        "review_rating": "8",
        "review_title": "Simply amazing...",
        "review_detailed_main": "\"Jai Bhim\" is a Crime - Drama movie in which we watch a man being accused and arrested as a thief. His wife with the help of a lawyer try very hard to bring justice and find out what exactly happened.\n\nI have to admit that I did not have high expectations from this movie but soon enough I understood that it will be an amazing movie. The plot is very interesting and it contained plenty of unexpected plot twists that made it even more interesting. The interpretations of Suriya who played as Chandru and Lijo Mol Jose who played as Senggeni were very good and they made the difference. In addition to this, the direction which was made by T. J. Gnanavel who is also the writer, it was equally good and he presented very well both the plot and his main characters, something that made possible for the audience to relate to them. Lastly, I have to say that \"Jai Bhim\" is an interesting drama movie and I highly recommend everyone to watch it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "omatriksomikoron",
        "review_rating": "9",
        "review_title": "Very heart touching and one of the best..!",
        "review_detailed_main": "I've just finished watching this movie. Only Suriya has power to do this kind of movie. Became literally emotional seeing the last court room scene. South Indian cinema industry is now the new face of Indian cinema. Thanks to Amazon prime, suriya and all crew members for this masterpiece..!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "urboyfarhan",
        "review_rating": "9",
        "review_title": "The best court- room drama movie I've ever seen in my life",
        "review_detailed_main": "I've seen movies similar to this like section 375, ponmagal vandhal, nerkonda paarvai, etc but this movie is extraordinary. A brilliant masterpiece. Everyone nailed it. This movie must win a mainsail award. Best movie of 2021."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gaikwadashok-99218",
        "review_rating": "10",
        "review_title": "A Must Watch",
        "review_detailed_main": "What a masterpiece. This movie is greatly depicts the real situations of minorities in India. Based on true events .I loved this movie. Jai Bhim.\n\nInspired by writings of Great Dr. B. R. Ambedkar lawyer takes on the corrup Government. Everyone must see this movie is great. A masterpiece in cinema. A movie can't be made in Bollywood. Shame on Bollywood."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "alish-88344",
        "review_rating": "7",
        "review_title": "Not bad movie.buy not very god . I like it good movie. A good movie from India. Good acting.good direct good cinematic mode. Good story Good actor.",
        "review_detailed_main": "Not bad movie.buy not very god . I like it good movie.\n\nA good movie from India.\n\nGood acting.good direct good cinematic mode.\n\nGood story Good actor."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rophod",
        "review_rating": "1",
        "review_title": "Anthony Sami",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "harikrishnansvnce",
        "review_rating": "9",
        "review_title": "SURIYA - Pride of Indian Cinema",
        "review_detailed_main": "No words to describe this excellent masterpiece of Suriya Sir... Hatsoff to whole team of JaiBhim.. Awesome performance my Lijomol Jose, Manikandan & Prakash Raj Sir.. Well directed by TJ Gnanavel Sir.. Brilliant touching songs and BGMs by Sean Roldan.."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "najiurrahman",
        "review_rating": "10",
        "review_title": "Master Piece Movie",
        "review_detailed_main": "Really I loved this movie. Soorya has done good job. Acting, location, cast are perfect. I think it's must watch movie. Soorya good luck for your future project."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shyamkarnake",
        "review_rating": "10",
        "review_title": "Oscar",
        "review_detailed_main": "Its Oscar winning Masterpiece...there is no reason to hate these movie......You need Daring to make movie like these..... ....a gr8 movie gr8 acting by alll....gr8 execution......gr8 script made on original case."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "badaamit",
        "review_rating": "10",
        "review_title": "For true filmy",
        "review_detailed_main": "After Soorarai Pottru Suriya back with movie based on true event/incident the movie is very good for a person loving courtroom drama film & the entry of Suriya in court background music is too good clearly it is a must watch movie pls watch it....😍😍😍"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "hariharan-83045",
        "review_rating": "10",
        "review_title": "National award ready",
        "review_detailed_main": "Excellent performance from everyone. This movie scores well in each and every department. Happy to see such wonderful flim from Tamil industry after long time. Definitely this movie will get national award."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "cooldwijen",
        "review_rating": "8",
        "review_title": "Solid acting, plot and dialog",
        "review_detailed_main": "This is why southern movie industry is by far the best in India. The movie has a raw appeal and touches your core in ways you wouldn't have realized. A movie everyone should to remove the social barriers and dogmas that is plaguing our society."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kranthireddyg",
        "review_rating": "9",
        "review_title": "SENSATIONAL SURIYA.",
        "review_detailed_main": "It's been years Kollywood is exploring and producing masterpieces based on caste discrimination.\n\nYet after all these years they are finding a new way to do it with equal artistic brilliance.\n\nIt's hard to keep something up for so long without disappointing.\n\nAll actors are too good.\n\nIn these kind of movies we need a protagonist who is not too dominating yet he should look impactful.\n\nSuriya exactly fills that void.\n\nIt's like he's made for these kind of roles.\n\nHe acts as that piece which keeps everything together.\n\nIt's based on a true story that happened in 1993 yet it connects recent custodial deaths in tamilnadu.\n\nKollywood mastered the art of representing controversial and sensitive issues with utmost cinematic experience.\n\nEverything is soo good in movie writing, music, DOP, screenplay.\n\nOne of the fewest quality courtroom dramas India produced."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sachchinannam",
        "review_rating": "10",
        "review_title": "Surya!!",
        "review_detailed_main": "This movie touches extremely sensitive topic and the way it handled is phenomenal. Kudos to the director for his brave attempt and Surya for his brilliant performance."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "SimpleView1",
        "review_rating": "7",
        "review_title": "Exceptional. True. Powerful.",
        "review_detailed_main": "Extraordinary true story narrated in most grounded manner. Unbelievable situation in free India; tribal minority have no human rights - it truth they don't exist (no legal documents, education or rights).\n\nSuriya is superb and supported by superlative support cast, in particular Lijo Mol Jose (as Sengoni).; she excels in details.\n\nMr Gnanavel (writer and Director) sets us with real world examples of treatment of tribals by upper cast society members (verbal, physical,emotional) and equally allows time to share their simple dreams (home, family, education) of those forgotten.\n\nIt will force you to rethink on priorities and cherish contributions of one Mr Chandru who went beyond the cause and impacted 96,000 cases and transformed life of hundreds and thousands of tribals."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gaikwadtejassantosh",
        "review_rating": "5",
        "review_title": "Why Karl marx and communism reference and Glorification in this film?it's against Babasaheb Ambedkar also oppose Karl marx and communism.",
        "review_detailed_main": "I seriously don't understand why there is so much glorification on Karl Marx and communism, because bhimrao Ambedkar ji is against of communist ideology which is biggest threat to democracy instead of showing Karl marx statue if they show Ambedkar ji statue in film then I would give 10/10 to this film."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "biswajitdas-66832",
        "review_rating": "10",
        "review_title": "There will be less words for me about Jai Bhim movies.",
        "review_detailed_main": "Everything that is said and shown in the movie is absolutely true. Our constitution is right. But bad deeds are used more. Those who misuse the Constitution #politicians #Police #Businessman #AndMoreManyPowerfullMan."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "srisridge",
        "review_rating": "10",
        "review_title": "Definition of pain",
        "review_detailed_main": "Best movie of the decade. Surya nailed it every court scenes gives goosebumps. Must watch movie trust me u won't regret share this movie to ur friends \"jai bhim\""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vinayakmp",
        "review_rating": "10",
        "review_title": "Must watch movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "krushna-patle",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "The movie is the best portrait of caste discrimination and human rights violations happening in our country. Today still many people face a caste discrimination and we need to more awareness about the issue. The film tells the real story and everyone must watch to get an opinions about what's really happening in our society and we should stop happening this in today 21st century digital world. So please watch movie with open mind and think about it. I liked the movie very much and everyone did their best."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "achandrasekhar-36563",
        "review_rating": "10",
        "review_title": "Wow what a movie",
        "review_detailed_main": "Great court room drama Surya at best. Awesome screenplay and great penmanship. Makes us connect to each and every scene of this movie with all actors at their fullest. The crew has done beautiful job and do recommend everyone to watch it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "TheRajatShahare",
        "review_rating": "10",
        "review_title": "Show's the reality of India in many ways...",
        "review_detailed_main": "Don't go with the name of this movie. It's give the sense to understand why they name this movie \"Jay Bhim\". Excellent cinematography, production, direction and specially the acting of the actors and actresses. It literally shows the reality of the Indian police and political system. Highly recommended if you love good content movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sunilpalandurkar",
        "review_rating": "10",
        "review_title": "A story that delivered masterfully",
        "review_detailed_main": "It's an out n out masterpiece. A true but sadistic story of tribals, shows how did they suffered during the course of life. Very well executed by the director and praiseworthy performances by the lead n supporting casts that makes this film a must watch. Thank u Amazon prime for bringing out such a story."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "harshalsable",
        "review_rating": "10",
        "review_title": "SPEECHLESS. NOT FOR WEAK HEARTED.",
        "review_detailed_main": "This movie shows the power of LAW.\n\nThis movie is hard hitting MASTERPIECE.\n\nIt's long but doesn't feel like it's too long. Actors did fantastic job. Hats off too the Writers.\n\nDirection cinematography BGM is top notch.\n\nI cant watch this one one more time. Goosbumps from start to end."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "MWC-665490",
        "review_rating": "",
        "review_title": "Revolution of cinema art",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rajeshhh294",
        "review_rating": "7",
        "review_title": "Good Movie ..But 9.6 Rating is too much ..",
        "review_detailed_main": "Watchable..Suriyas performance is good and That lady acted really realistic and Lovable .Little bit slow but worth watching in the end..single line of true story made with good scenes."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "narenderrajaram",
        "review_rating": "1",
        "review_title": "Spreading Hatred towards targeted communities",
        "review_detailed_main": "The internal intension of the movie is to create communal violance between communities..No Royalty or the profit share given to Parvathi ie Rajakannu wife .. without her knowledge ( since she is not educated) this story has been stolen and so many deliberately artificially made controversial scenes has been added.."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "prakashessu",
        "review_rating": "10",
        "review_title": "Those rating it bad are actually like the vilain the story",
        "review_detailed_main": "10/10 Well made, Well shot, well shown and well DONE !! Not a movie for everyone but who love harsh reality of our society will appreciate it..This show of what calibre suriya is as an #Actor Hats off 🙂"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nischalpatel-42753",
        "review_rating": "10",
        "review_title": "Masterpiece...",
        "review_detailed_main": "I never ever seen movie this type.. extraordinary acting... intresting & emotional story.... fabulous execution ..best movie of suraya ever... masterpiece must watch...."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shashimothe",
        "review_rating": "10",
        "review_title": "Brilliant worth to watch",
        "review_detailed_main": "Suriya's performance superb Oscar level film.\n\nMovie was interesting and thrilling. Film ending makes you cry.\n\nWorth to watch this is the best tamil movie of 2021."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "anujbawa-67072",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "This is an outstanding movie. Acting of all characters are superb. We can feel the pain of tribals in this movie. It's an extraordinary movie. Superb."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "prashantbhagat-93041",
        "review_rating": "10",
        "review_title": "Jai bheem",
        "review_detailed_main": "Best movie of 2021. Film is Masterpiece. Suriya is earnest and the film is honest. Jai Bhim is yet another feather in Suriya's cap. It is raw, intense, and filled with gripping courtroom scenes. Though it takes some time to get into the main story and has no commercial aspects, the film has enough drama that will hold your attention until the end."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "anwaramaan-82861",
        "review_rating": "10",
        "review_title": "Extraordinary movie",
        "review_detailed_main": "Perfect and extraordinary movie. Everyone should watch this movie. Surya acting is mind blowing , storyline is amazing. (10/10). A must watch movie. Dont go for the negative reviews."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "janmejayapanda",
        "review_rating": "10",
        "review_title": "Masterpiece. The pride of tamil industry the pride of India.",
        "review_detailed_main": "Surya please shop it man, stop dropping masterclasses one after another. Give other stars and director to breathe man. This is so unfair on their part to compete with you man. They should file anti competitive law against you😂. You are too good and director sir you are even better than surya. I have to say way way better than surya. I really feel they should have also dubbed a English version of this movie. So that we could give the foreigners a taste of indian movies. They are not familiar with many Indians languages that's why they skip watch our film and make a bad perceptions of our movies. This movie should represent Indian movie. This should be the national movie of India."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "govind9402",
        "review_rating": "9",
        "review_title": "Equality is more important than life.",
        "review_detailed_main": "Jai Bhim ⭐⭐⭐⭐⭐⭐⭐⭐⭐9/10 What a week, my love for movies got me.\n\nTwo 9 star rated in a single week.\n\nGod bless me .\n\nJai Bhim is one of the most powerful movies I have watched , it's pungent , It's emotional it's a war between a state and a women who is determined for justice , and God send help , in form of a lawyer with a heart .\n\nLeave alone the whole movies, we can just pay for a couple of secnes and the meaning in them . I don't know what amazon paid but , this is rated at 9.7 in IMDB with over 30k ratings, what ever it is , they hit a jack pot.\n\nBut why not in theatres , why not? , I don't mind OTT, bussiness but when I am unable to watch India's top rated movie in a theatre , it's injustice.\n\n@actorsuriya , it's criminal not releasing it on the Big screen.\n\nFinally .\n\nAll men/Women are born and created equal no matter to whome and where they are born.\n\nEveryone is the same in the eyes of law, be it a king or the sweeper .\n\n#jaibhim #movie #tamil #tribal #court #drama #equality\n\nP. S. Forgot , the tribal cast is , I can't still belive it's a cast."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "manishkmr-69957",
        "review_rating": "",
        "review_title": "Surya ia the best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Aviansharath",
        "review_rating": "7",
        "review_title": "A gripping true story with one stellar performance..but sub par execution",
        "review_detailed_main": "The best Indian dramas weave together a page-turning screenplay and fantastic acting with stirring lyrical music and seamless orchestration by the director.\n\nThe former two factors drag this movie towards a 10/10.. However, the lack of the latter 2 factors drag the drama down\n\nDespite the 10/10 reviews, ( a clear issue towards the usability of the IMDB platform), this is not the best movie this year..Please view the breakup of the ratings by age and segment( how many rated 10/10 and how many rated the rest) - to get a good indication of the genuine rating for the movie It is however the best screenplay of a story that needed to be told. The issue of police brutality in the developing world gets far less global media coverage. However, the scale and scope of the havoc it plays in the lives of the downtrodden is very real.\n\nSurya's acting chops come through in every single scene. The intensity he brings puts most other performers in his shadow( a number of whom are new and cannot be faulted) - except perhaps prithviraj.\n\nLijomol, manikamdan , Rajisha and Guru are creditworthy too..\n\nHowever, the lack memorable music , with one really out of place song at the start during Supriya s introduction , shows a below par music direction(Sean Rolden).. This robs the movie of some of its potential - especially when compared to the true great films that tackled important themes like this film attempts to\n\nHowever the greatest issue is with the direction and especially the editing( assuming the burden for this is shared by the editor and director)\n\nJarring changes in tone, misjudged transitions and a general lack of unifying color - something visible from start to finish in masterpieces by the mani ratnams and imtiaz Alis of this world - pull this movie well below the usual benchmarks of great social and drama masterpieces produced before by Indian cinema\n\nA definite must see for Suriya fans.. and the stirring true story that deserves more awareness..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Stark_19",
        "review_rating": "4",
        "review_title": "Overrated",
        "review_detailed_main": "Cringy acting and the worst voice-over ever.\n\nThe story is OK.\n\nAnyway, it is the usual Indian drama. Nothing special.\n\nBut at least, it is not really that boring.\n\nThe acting of some characters is so bad. You can see that they are acting, acting bad.\n\nThey tried something rather different with the songs, but meh, waste of time.\n\nI give it a 4 for the humanitarian message, and that it is a true story."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "devinderbonding",
        "review_rating": "9",
        "review_title": "Thought provoking and hard hitting - must watch !",
        "review_detailed_main": "Outstanding film with some terrific performances. Wasn't expecting something this impactful. Thought provoking cinema that steers clear of unnecessary histrionics and over the top drama."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "surajkailase",
        "review_rating": "8",
        "review_title": "Don't miss this one",
        "review_detailed_main": "A great watch indeed. The story, the cast and acting, everything felt perfect. Don't miss this one. Such stories deserved to adapted into a film so that everyone should know about it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "lakhmanitushar",
        "review_rating": "10",
        "review_title": "Men do cry this movie proves it.",
        "review_detailed_main": "I'm in love with south indian movies being a north indian and watching salman khan antim and the very next day watching Jai bhim made me realise the difference in class the south indian are .\n\nU just can't describe this movie in words\n\nDuring watching the movie I cried a lot after a."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "stalinpottella",
        "review_rating": "10",
        "review_title": "Gun shot 💥🔫",
        "review_detailed_main": "Excellent movie that straight goes in to audience surely.we should encourage this kid d of movies, suriya's action is awesome, overall the Character ization is perfect."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vekariyavishalv",
        "review_rating": "10",
        "review_title": "Emotive",
        "review_detailed_main": "You also need to watch this movie if you don't believe in racism and have the ability to fight them.\n\nWhat is really needed now is freedom, freedom from racism, freedom from religion."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vpsubash",
        "review_rating": "10",
        "review_title": "Jai Bhim",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "iamharihara",
        "review_rating": "10",
        "review_title": "Powerfull film",
        "review_detailed_main": "Great performances and Excellent story , Must watch film. Even though there's no heroine , item song and entertainment scenes in the film , the story based on real events took the film to another level ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shammiekp",
        "review_rating": "9",
        "review_title": "Best from surya",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sammedjain",
        "review_rating": "7",
        "review_title": "Good but not great.",
        "review_detailed_main": "One time watch movie but must watch.\n\nActing 9/10 Actors 8/10 Direction 7/10 Story 8/10 Too raw and rough movie.\n\nSorry, your review is too short. It needs to contain at least 150 characters.\n\nDoes this review contain spoilers? YesNo\n\nSubmit."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "runthla",
        "review_rating": "1",
        "review_title": "NOT a 'true story'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "tarungaikwad-43211",
        "review_rating": "10",
        "review_title": "Most perfect actor",
        "review_detailed_main": "Awesome movie....the real situations of lower cast people showing in this movie which actor surya played a most adorable character of great man lawyer and most important thing Dr. Ambedkar's thoughts are mention in movie which every indian know about this."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gautamsury-58499",
        "review_rating": "10",
        "review_title": "Must watch movie in theatre",
        "review_detailed_main": "Right to equality (article 14) Acting of Surya in the movie is incredible and seems to be very genuine acting.movie is depend on a court case which was a true event and the way the police department and the ministry treat with the tribal peoples."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "deepak-nanjundaiah",
        "review_rating": "9",
        "review_title": "Jai Bhim",
        "review_detailed_main": "It's not a movie, it's a poem.. it's a speech.. it's a statement.. and after all, it's an earful to all of us who have, at some point in our lives used our power to suppress something or someone to achieve what we wanted.\n\nThe story is relatable and relevant to everyone out there as much as it was for those who have been part of it in the first place.\n\nA very touching and inspiring movie that will leave you overwhelmed with it's seriousness and the gravity of it's situation. Respect..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gauthamstunterz",
        "review_rating": "10",
        "review_title": "Blockbuster movie 🎥",
        "review_detailed_main": "The movie is really fantastic 😍 I love this movie 🍿 surely I can give 10/10 and the story was really good and the movie making was excellent..and really surya anna worked hard."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "konguthambiraj",
        "review_rating": "10",
        "review_title": "Masterpiece of tiz year!",
        "review_detailed_main": "One movie,Countless emotions. This is a story of Justice, Equality and Human Rights!! No forced romance, no song-dance, no stunts, no needless heroism! Nadippin Nayagan is 100% the Kadhaiyin Nayagan here. Immense maturity shown by the star actor to let the story take prominence and play within its boundaries! Wonderful to watch .#Lijomol, Manikandan done their best in tiz film. An unsettling testament of all the horrible injustice committed against the innocent victims of bias & casteism in our society as well as the legal system, A compelling story of injustice & the efforts of righting the wrong! Everyone should watch! No words to describe/review. Appreciate each nd everyone worked on it. Up there amongst the best films of the year!\n\n#Suriya_anna #jaibhimmovie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "3gsahil",
        "review_rating": "10",
        "review_title": "Jai Bhim as an emotion !",
        "review_detailed_main": "Truth presented , detailed .\n\nWith out going too far .\n\nCan be called as presenting a real story with proper attention .\n\nWill recommend to watch on 10/10 scale , portrayals don't let you miss anything."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Adarsh_Sachan",
        "review_rating": "10",
        "review_title": "A true story that I wish wasn't",
        "review_detailed_main": "Jai Bhim, inspired from the real life incident of the Indian state of Tamil Nadu. This movie is not about just one family or community but millions of people that face oppression from the hands of legislature, executives and judiciary even after more than 75 years of independence. Very well written and directed. Perfect casting for every role, hats off for the casting director for casting such amazing indigenous actors for each role. I don't even want to talk about acting performances because I don't think I'm quite qualified to talk about it. Suriya sir did it again after Soorarai Pottru and supporting cast deserves a special mention, TBH, they performed better than most bollywood actors. Indian cinema deserves more movies like this. Thank you Prime Video for producing such high quality movies."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "satrohanshaw",
        "review_rating": "10",
        "review_title": "Best movie ever",
        "review_detailed_main": "I love this movie because it is the truth of India. In india every corner pòor people can't get justice due to lack of knowledge, money. This movie is awesome."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Sarvan_watches",
        "review_rating": "",
        "review_title": "Must watch & movie of the year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "isaacsundaralingam",
        "review_rating": "6",
        "review_title": "This movie is an hour too long",
        "review_detailed_main": "I just don't understand why this movie gets the love it does. This just feels like a diluted \"Visaranai\", with nothing new to say to the audience. The story progresses in snail's pace and it's oh so predictable and cliche. Yes, I get it, it's based on a true story, but what matters in cinema is not what the story is, but how it is presented.\n\nJai Bhim isn't by any account a bad movie. I think it's a decent one. But like literally every legal drama movie ever made in Tamil cinema, it falls victim to overestimating its appeal. Do we really need the exaggerated slow-mo's, the over dramatic profiles and the intrusively annoying musical numbers to have effectively told this story?\n\nThe worst part about this movie is its characters. They lack an enormous amount of depth. I still wonder why the character of M S Baskhar even existed in the movie, if not to annoy us with literally every word he says, effectively bogging the movie down with him. Don't get me wrong, I love the guy and think he's an amazing actor, but he was so poorly written overall in this movie. And that is true for Suriya as well. The character has nothing to set him apart from what you might expect from an exaggerated \"goody\" lawyer.\n\nThe movie is 160-something minutes long. That is a painstakingly long time to have to sit through a movie with so little substance. If they had cut down on everything they thought would make it a commercial movie, and had stuck with only the meat of it, they could have made it into an amazing 90-100 minute experience of high spirits and emotions. But no, you just had to drag it for as long as you did.\n\nI don't hate the movie, if not for feeling like it wasted one extra hour of my attention it deserved to have. It's at least a decent one, but nothing close to the amount of praise it gets. But hey, I'm in the minority here, so who knows..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "killash-93547",
        "review_rating": "1",
        "review_title": "Villain religion changed from Christianity to hindu.",
        "review_detailed_main": "Changed the main antagonist's religion from Christianity to hindu.\n\nAnd that's how you set a narrative that hindus are bad and pee po blah blah They wanted to show the whole caste thing so badly but they Never had the real story so they made their own up Imagine being a anti hindu without any reason and then crying that how hindus hate me Saara credit le gya constitution ka reservation le liya itta fir bhi ramdirona lga rkha hai saala."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "manojmanpal",
        "review_rating": "9",
        "review_title": "Very well directed movie",
        "review_detailed_main": "Movie has a message based on true hero with fictional elements added. Surya as an actor acted above par and his acting is far better than soorarai pottru.\n\nAt initial half I felt director has little exaggerated with respect to police dropping back sengini where pariyerum perumal showed in simplistic and non biased way.\n\nOverall a must watch movie with as - truth always triumphs."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "delsoca",
        "review_rating": "9",
        "review_title": "Very good",
        "review_detailed_main": "All of the actors are good, the tribe people are all acted very well in particular.\n\nThe story kept me gripped\n\nI did nit realise it was based on a a true story, This makes it even more astonishing.\n\nDefiantly worth a watch\n\nI have not given a 10 as to say 10 would Be to say the film was perfect......... and I can't say that......but it was really good and hi lighted prejudice, violence, injustice, systematic failures/corruption and abuse faced by marginalise groups in south India."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sangavia",
        "review_rating": "8",
        "review_title": "Deep routed cast system",
        "review_detailed_main": "The caste system is so deep-rooted which no one knowledge and something many people are proud off. Till date in India, the picture of how evil humans can go in the name of caste, without human value the movie hits hard on social issues, the actors played so perfectly you have a love and hate relationship with the characters, it awesomely blends with real facts,"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shahedshanto",
        "review_rating": "10",
        "review_title": "All Time Blockbuster Movie",
        "review_detailed_main": "Jai Bheem movie story and screenplay is very different. Film editing, court room scene, location, suspense, drama everything is just brilliant. Suriya's career landmark movie. PrakashRaj Done fantastic job. Very Emotional movie. Family movie. There are no boring scene. If you are a movie lover then definitely it's a Must Watch movie for you."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rajaram-48577",
        "review_rating": "8",
        "review_title": "Good court drama,social drama",
        "review_detailed_main": "I really liked this movie very much. All actors did their job very well. Movie is about one particular group and their lifestyle and struggles. This movie is conveying very sensitive message , so adults can only watch. It has the twists and turns which required for the perfect court drama.\n\nBest part is movie will not deviate from its path and it doesn't have unnecessary songs or scenes.\n\nMovie is more than 2 and half hour, but still the movie was very much engaging.\n\nVery well executed movie..\n\nI ll be expecting more from the director in future.\n\nSuriya has given one more best performance.\n\nAll lives matter..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sauceopet",
        "review_rating": "10",
        "review_title": "Stop wasting your time on reviews just watch it dude !!!",
        "review_detailed_main": "After so much long time i get to see a movie which so powerful and impactful. It gave me goosebumps and also choked me at the end. Such a marvelous beautiful movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "yuvaraj-sarji",
        "review_rating": "10",
        "review_title": "Just class",
        "review_detailed_main": "Not thing less than Hollywood Crime drama . Amazing casting and screenplay .hats off to surya for picking such script. Every character feels real in it ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "arunmurugesan-89490",
        "review_rating": "10",
        "review_title": "INTENSE AND HARD HITTING",
        "review_detailed_main": "Full engaged with perfect casting and beautiful court room drama. Everyone fits their character and gives lots of emotional value. Suriya again he proved as a social responsible person."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rush8080",
        "review_rating": "6",
        "review_title": "ordinary movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ssuresh-81952",
        "review_rating": "1",
        "review_title": "Injustice made one more time to Parvati",
        "review_detailed_main": "When taking a movie on a real incident, then there should be limitations in changing it. Because changing story will change history. It's wrong example setting. This movie is created as a complete business and award perspective by spreading hatred and wrong story. You guys served poison on a golden plate.\n\nYoungsters and non tamil won't understand your cunningness. So you guys are getting lot of support. Which you guys are misusing. OTTs should stop getting movies from these kind of production companies."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kuttyputty",
        "review_rating": "10",
        "review_title": "How do I rate 100 ?",
        "review_detailed_main": "A Gem made to sit over the top at throne. The script core is more similar to the Netflix true series 'When they see us' but the adaptive screenplay holds us intact - A modern poltergeist- cant able to move out even after completing the movie\n\nSecond success for protagonist Surya Sivakumar after the feast of soorarai potru movie\n\nHats Off!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ringsangbordoloi",
        "review_rating": "9",
        "review_title": "Human document, Victory, victims, human right,",
        "review_detailed_main": "I want to give credential to the director, who focus such a social drama that's have a strong message. Suriya play's as K Chandu as his best. I've been watched a lot more courtroom drama but jai bhim is best till the moment."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "thefijispider",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "Excellent movie. Don't miss it. Suriya plays Chandru brilliantly. You end up applauding his every move. Gritty, yet focused in his role. Lijo Mol also plays her character really well. You feel her pain throughout the movie. Only when justice is served you feel satisfaction. Outstanding direction, overacting at times by the extras in the movie, but the overall acting by main characters is really good. Note: watch the Tamil version rather than Hindi dubbed. The original language (with subtitles) delivers the true emotion in the voice of characters."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pragyasriva",
        "review_rating": "10",
        "review_title": "The movie is beyond rating",
        "review_detailed_main": "Generally court room drama in India is full of monologues lengthy dialogues, this one is different, the movie is so real n touchy, beauty of this movie that every actor even in small roles have surpassed each other. You will see the ugly reality of caste syatem in villages."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "bharatkumarchennai-78821",
        "review_rating": "9",
        "review_title": "Much needed movie for today",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "LalithAdithya12",
        "review_rating": "10",
        "review_title": "Such a gud movie..",
        "review_detailed_main": "\"There is no caste without thieves, and the silence of the court against injustice is more dangerous than words in favor of justice\" this kind of dialogues are lit🔥There is no shortage of acting..every actors do our job perfectly in this film..must watch film..& more importantly movie's end card🔥"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "jonykirangrow",
        "review_rating": "10",
        "review_title": "Gem of a movie - - MUST WATCH",
        "review_detailed_main": "Surya sir's acting is impeccable, Movie is marvelous, Story line is Brilliant, direction and taking is awesome, a different and realistic movie then usual movies."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "lhcwdj",
        "review_rating": "10",
        "review_title": "Realistic",
        "review_detailed_main": "This movie is masterpiece... Beyond your imagination... Class acting by all cast... It's a much watch movie for all indians specially to see what's the condition of our country towards trible people.."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "zrdeen",
        "review_rating": "6",
        "review_title": "Movie is good but overly hyped",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "chits-sharma",
        "review_rating": "1",
        "review_title": "Why only Negative character's name changed from true event??",
        "review_detailed_main": "Film Jai Bheem is based on a true incident. In 1993, a tribal man named Rajakannu, falsely framed in a theft case, was brutally tortured and kiIIed by cops lead by Sub Inspector Anthony Samy. Rajakannu's wife approaches advocate Chandru who fights the case and gets justice for Rajakannu.\n\nIn the film, Chandru is Chandru, Rajakannu is Rajakannu but Anthony Samy becomes Gurumoorthy. Why? You decide.\n\n\"Our intentions weren't to hurt anyone's sentiments\", \"we took creative liberty\", \"It's just based on real life incidents, not a biopic\" are just excuses. What's stopping from fictionalizing all the names or to present them as real? Why keep almost all names same as real but fictionalize a few, that too the key name, the main convict's name? You decide. Courtesy Skin doctor."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "george_namaste",
        "review_rating": "10",
        "review_title": "Superb",
        "review_detailed_main": "Amazing, super, mind blowing.\n\nCant believe this is based on true story.\n\nSo much corruption in india.\n\nThanks for that person who had the balls to make a movie about this so that many people comes to know about this.\n\nPolice who does such acts should tougher sentences than ordinary citizens.\n\nKudos to everything in the movie!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pankajgautam-44703",
        "review_rating": "10",
        "review_title": "A masterpiece",
        "review_detailed_main": "A masterpiece showing mirror to the society.\n\nThe whole Jai Bhim team should be appreciated to make a movie like this.\n\nI don't know the name of lead actor but he has done an excellent job."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kumarullas-38983",
        "review_rating": "10",
        "review_title": "When reality and cinema gets together, A magic is born.",
        "review_detailed_main": "Movie maker always says, We are lucky to have a great audience, but today I would like to say, I am lucky to see a movie like this. I don't know any actor's name but they all were excellent. Kudos to a motion picture like this you are keeping our cinema alive and proud. Thanks and congratulations for this masterpiece. This should go for Oscars."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pranavpatodkar",
        "review_rating": "10",
        "review_title": "Outstanding!",
        "review_detailed_main": "What a film! Hats off to every member of this film. Specially Suriya sir. What an epic movie! The best I've watched in 2021. Everything about this film was awesome. Acting, Cast, Suspense was fabulous."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ahmedansariw",
        "review_rating": "10",
        "review_title": "Great story based on true incident.",
        "review_detailed_main": "I watched Jai Bhim with English subtitles, don't know tamil though I can say this is one of the best movie of Indian Cinema. The story raise a lot of genuine questions about caste discrimination, administration, law & order, politics and power.\n\nSuriya did a mindblowing act and other actors also performed well specially Lijomol Jose. Her performance was brilliant.\n\nBut my 10/10 is story-writer and storyteller, T J Gnanavel. He did an extraordinary job behind this movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "wwwchrysto",
        "review_rating": "10",
        "review_title": "\"Fantastic\" like \"Soorarai Pottru\"",
        "review_detailed_main": "Jai bhim was so thrilling to watch. Suriya has done another vareity hit.every actors in the movie done so good. 100% Recomended to watch 👌🏼👌🏼👌🏼, The movie shows different kind of emotions and feelings to audience."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "muhammedraeess",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "From many years I'm not watching hindi movies and moved to English movies and series\n\nOnly rarely I come to watch hindi movies and shows these days when I come to know they are exceptionally good, like this one\n\nI haven't watched and not interested to watch films like sooryavanshi where you only waste your time. This is a movie where you would like to invest your time and also give time to write a review on IMDb."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vasavaalpesh-73899",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "No words for this movie one word masterpiece.all cast performance next level realsitic acting storyline too good.surya done marvelous job hats off to south industry and thanks for releasing in hindi dubed too."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ashish-cooltech",
        "review_rating": "6",
        "review_title": "Well made but not a masterpiece",
        "review_detailed_main": "Jai Bhim is a well made movie but overrated.\n\nPositives: Good acting by Surya, Manikandan and most of the cast. Court proceedings are quite realistic without overdramatization. Movie provide an insight into the plight of tribal folks and could help in a change of view. Pace and construct of the movie keeps you gripped despite the story being predictable.\n\nNegatives: Movie is too long and should have been wrapped under 2 hours. Movie tries to cash on regional jingoism like the scene where a man is slapped for speaking Hindi. Police brutality is very commonly presented subject and not a new theme.\n\nOverall a well made movie but if you are hoping to see a ground breaking masterpiece going by the ratings, then sorry this is not."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "amit935240",
        "review_rating": "2",
        "review_title": "A bogus film",
        "review_detailed_main": "All characters are changed from the real story. Again the sc st and minority victim card is taken to fool audience with emotions. Actual story characters and background is totally different.\n\nNot at all recommended."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "darshannl",
        "review_rating": "10",
        "review_title": "True story and screen play both shown the reality of the story very well. Movie is inspiring all must watch",
        "review_detailed_main": "All must watch this movie . The black dots of the society and the bad mind people will hesitate to watch this movie because of caste system is truly shown in this film. All are one jai hind."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "tushar-premal",
        "review_rating": "10",
        "review_title": "Jai Bhim",
        "review_detailed_main": "An outstanding movie and mind-blowing performance.\n\nOne of the best movie I have seen so far.\n\nA wonderful experience to watch and story is heart touching."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "AMOGHREVIEWS",
        "review_rating": "10",
        "review_title": "HARD-HITTING",
        "review_detailed_main": "Jai Bhim (2021) - 100%\n\nA Courtroom Drama You Can't Afford To Miss... Suriya Is Again In Top Form After \"Soorarai Pottru\"... He Brilliantly Carries The Film On His Shoulder... Lijomol Jose Is A Revelation... She Hasn't Just Played, But Lived The Character Of 'Senggeni'... Manikandan Is Excellent As 'Rajakannu'... Overall, \"Jai Bhim\" Is A Vigorous Film Which Stays With You For A Long Time & Gives A Powerful Lesson On Equality, Justice & Human Rights... Recommended!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "bharatmax-35475",
        "review_rating": "10",
        "review_title": "Wordless 😔😔😔",
        "review_detailed_main": "I don't have anything to say. Don't listen to heaters and just watch it.\n\nEvery character was real stick. Go and watch it now.\n\nIt deserves 10 out of 10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dsouzarashmitha",
        "review_rating": "10",
        "review_title": "Jai",
        "review_detailed_main": "What a movie!!!! Acting level of every characters were beyond sky,... it's like cctv footages playing, must watch.. Do watch or else you'll be regretted..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "aniketvnagapure",
        "review_rating": "10",
        "review_title": "Get a couple of tissue papers!",
        "review_detailed_main": "The movie will make you cry. If you really feel the movie. It would let you think the how being a lower caste is a curse in this society. No doubt 2021's best movie hands down. Surya again proves himself what a performance. Even the side actors performed so well that we would forgot they are not tribals but actors. Do give a watch instead of stupid bollywood dumb movies."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "personalacc-87247",
        "review_rating": "9",
        "review_title": "Suriya delivers another Masterpiece!",
        "review_detailed_main": "Music, acting , casting , direction , screenplay was really good. Everyone did well. Applause to the whole team for bringing a good message Suriya's been giving really good quality films for Kollywood. Salute you sir."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "samabc-31952",
        "review_rating": "8",
        "review_title": "Casteism does exist in 21st century India...",
        "review_detailed_main": "There are 36 tribes in TamilNadu. Most from these tribes depend on agriculture, forests and cultivation for their livelihood. This is a story of 4 who belong to one such tribe who work for upper caste in rat infestation control and catching snakes in their homes. The oppressor and the oppressed... a habeas corpus case... court drama ... movie does succeed in portraying a heinous gruesome picture of the atrocities and systematic violence that are being committed by the police, the upper caste, the justice system and the government against these tribes. A bitter reality... in last 5 years In the last five years, a total of 300 caste-related murders have been reported in Tamil Nadu and most victims were Dalits. At least two Dalits are assaulted every hour in 21st-century India, and every day, three Dalit women are raped, two Dalits are murdered and two Dalit homes are torched on average. Over 200 million Dalits, who comprise nearly 17% of India's population, face the threat of such violence daily (Ref: Wire) The apotheosis of the protagonist and few unnecessary jail sequences however takes away the focus from the underlying tribal issue .. but it does not fail to deliver a strong message and demands one to introspect.. thought provoking, based on true story .. Surya brings the perception in story telling to an 'unfortunately a truism' .. a great watch .."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "SoumikBanerjee1996",
        "review_rating": "6",
        "review_title": "An artsy approach would have been more preferable",
        "review_detailed_main": "A politically charged social commentary that not only dare to unmask custodial malpractices and violations committed by police personnel but also exposes the darker alleys of casteism and intolerance that is still pretty persistent in our country. An issue that I believe, should be construed as a topic of discussion more often!\n\nThat being said, I'm still not fully convinced. Make no mistake, I wholeheartedly admire the cause as well as the initiative taken by the whole team but my biggest gripe is about its core treatment, which for better or worse has mostly been mass-centric. Probably due to the inclusion of superstar 'Suriya' in this narrative.\n\nNow, I do understand, why the creators might have taken such a lenient route! Their primary incentive was to reach a much broader base of the audience rather than limiting themselves to a niche category and in that regard, they went for the most reasonable choice vacant. But then again, a delicate subject like this, in my humble opinion, rather asks for an artsy & articulative way of storytelling.\n\nI'm in no way implying this was a bad attempt, not at all. On the contrary, I do appreciate the honesty and the audacity of the makers for even thinking about making such a movie that would dauntlessly question the injustices and would put a mirror on our administration and the jurisdiction for self-reflect. It's just that I beg to differ in the journeys taken not the destination it aspired to go to."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gbhxkcggj",
        "review_rating": "1",
        "review_title": "Overrated",
        "review_detailed_main": "This movies is so overrated. It's good but tbh, nothing special, and the movie lil bit slow, so its quite boring. I think there's another better movie with the same theme."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Chaudhari_M",
        "review_rating": "10",
        "review_title": "Intense & powerful",
        "review_detailed_main": "Suriya acting, and other crew members too much powerful acting. Thrill, court room drama, all captive situation everything is perfect. Afterall story based on real incident, so all star cast give a best. Go and must watch. Jai bhim."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kkhan-76641",
        "review_rating": "10",
        "review_title": "Oscar awarding movie",
        "review_detailed_main": "It's not a movies it's Oscar deserving movie... Completely masterpiece.\n\nSupervvv.\n\nIt's reality of crural police .\n\nOverall nice... Jai bhim.\n\nJai bharat."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "jojivadakara",
        "review_rating": "10",
        "review_title": "Jai bhim",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vinireddy-66708",
        "review_rating": "10",
        "review_title": "This movie deserves a National Award",
        "review_detailed_main": "Very Intense movie, we have to appreciate suriya sir for doing this movie. Second half of the movie is very engaging and interesting.\n\nAll the lead cast did a fantastic job."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nivethanin",
        "review_rating": "10",
        "review_title": "Absolutely amazing",
        "review_detailed_main": "Didn't think the last Amazon prime + Suriya movie was as good as ratings indicated... but this one had everything. Tragic story told in such a captivating way. Was on edge the entire time."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "umerubsf",
        "review_rating": "10",
        "review_title": "Cult with class",
        "review_detailed_main": "Outstanding movie what a Performance hatts of to the Director !!! Surya nailed it... Leadind actress proved that she is Jen of the movie no other actress can replace her..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rubensagar-70850",
        "review_rating": "10",
        "review_title": "Gripping with Harsh Reality",
        "review_detailed_main": "Must watch movie for everyone. These issues still exist on society.\n\nGreat Performance by everyone. Movie keeps you grip till the end. A perfect courtroom drama."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "aniyanbalu",
        "review_rating": "10",
        "review_title": "Best Indian movie of 2021!!",
        "review_detailed_main": "Great movie.. thrilling.&tearing movie.. awesome casting. Great performances from each and every one especially lijomol. Must watch and hats off to the creators."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sriram_rajendran",
        "review_rating": "7",
        "review_title": "Excellent movie",
        "review_detailed_main": "Movie i worth to watch, first 20 minutes will be boring little bit but after it goes like a roller coaster.\n\nThis movie is based on casteism (Trend in Tamil cinema like Agriculture) This movie will really make good impact in society, Tamil cinema should get more movies like this."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "bkvora",
        "review_rating": "4",
        "review_title": "Good Movie with excessive propaganda on Communism",
        "review_detailed_main": "A Very good movie with excellent acting by Surya & all others. Saw the movie in Tamil with English Sub - titles. The only problem I see is the excessive Commnunist propaganda, display of Red Flags everywhere even in Surya's Office. That is the reading I am giving a lower rating."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nprasher-92135",
        "review_rating": "10",
        "review_title": "Everyone should watch this",
        "review_detailed_main": "The movie that India needed. This movie shows the true reality of casteism in India that is there from centuries. Based on real case that happened ,indulge in small details . More then the acting it's a story that needs to be showed to everyone. And a true homage to Justice Chandru for his efforts."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "naveenkundara-89368",
        "review_rating": "10",
        "review_title": "Beat Movie Ever",
        "review_detailed_main": "Truly Suriya deserve an oscar, movie is based on the real story happened 28 years ago. Raise voice to caste discrimination, movie give supports to BR Ambedkar's dreams of caate free nation."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "abrarraza",
        "review_rating": "10",
        "review_title": "Must Watch for every Indian",
        "review_detailed_main": "Please don't miss it for any other movie. The story is not just one story but the story of the whole nation. The inequality, the brutality, and discrimation is rampant."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "neeraj2912",
        "review_rating": "10",
        "review_title": "It's not a two sentences, it's a reality - Jai Bhim",
        "review_detailed_main": "Common people are suffring from this type of behavior in country. Great performance by Surya, story, screenplay, story, everything are excellent and systematically performed. Great movie keep going. All the best for future.\n\nMany more to come."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "adasgail88",
        "review_rating": "10",
        "review_title": "Top Class Reality based social film",
        "review_detailed_main": "It is hard hitting, well narrated, superb acting and excellent direction. It depicts the ills of caste system in India, still prevailing torture of lower caste people and fight against that evil. Well Done!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dragonite_fire007",
        "review_rating": "10",
        "review_title": "Steller performances with great storyline",
        "review_detailed_main": "Watching Jai Bheem makes one realize the power of the visual medium. What movies are supposed to do to you eventually educate and you organize. Every character is well written and the people playing them to the hilt.\n\nTamil movie industry has churned out some great hard hitting movies and Jai Bheem is one of them. They didn't shy away from showing the police brutalities or show them in rosy light. And in the current political context, these truths need to be told more so now.\n\nKudos to the entire team for making such an amazing film.\n\nJai Bheem !"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "simonemasua",
        "review_rating": "10",
        "review_title": "Oscar award movie",
        "review_detailed_main": "Dont see it as its from which race, what language movie. See it as a quality film and reality film. After watching the movie the impact will stay for 3 days for sure. You will also start to do researches on tribal's, surya, director, manikandan etc."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "iffatkhatoon",
        "review_rating": "10",
        "review_title": "Excellent and eye opener for andh bhakts",
        "review_detailed_main": "Shows how people should learn humanity and leave hatred aside based on wealth, caste or religion. Something bjp hindutwa to learn who wants to spread hatred against muslims. One of the reason why bjp govt wanted to control all media so such movies are banned. Hats off to producer and people who fight for their rights. Example umar Khalid n many other political prisoners."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sujit_kumar",
        "review_rating": "7",
        "review_title": "Did not like the agenda part",
        "review_detailed_main": "It is a great movie with excellent screenplay and acting. But i did not like the Agenda driven communism part of this movie. BR Ambedkar disliked communism, so the use of his name for glorifying communism is disappointing."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "queenfairy-43318",
        "review_rating": "1",
        "review_title": "Presentation was mislead",
        "review_detailed_main": "Originally,a Christian si was the main culprit but they're so obssesed with brahmns and others higher caste so they created a misleading procedure. Baabasaheb's own review on indian constitution was that if this is being partial with any of society,I'll burn this by own.the atrocity was truly unacceptable,but the way they are presenting and promted the film was based on haterd fir higher castes.not only in Hinduism, but in other religions also castes are still present,but people always abused hindu society,and the film is provoking this agenda."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "iamchauhanmayank-83789",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "I'm thrilled by the direction and acting in this movie. Cinematography of 1995 is pretty lit too.\n\nThey have given the harsh reality of Justice System in India. You will cry, you will cheer, you will shout in this movie.\n\nSuriya stole the show. We need characters like this in Indian Cinema. Not a macho man who fights with 5 goons at one time.\n\nThank you suriya for producing this amazing class movie with a hardcore message.\n\nThis will win all the National Award for sure!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "arnabchakraborty-11871",
        "review_rating": "10",
        "review_title": "Brilliant- Darkness to Light - Jai Bhim",
        "review_detailed_main": "Really moved by this movie.. Brilliance at its epitome. Content ,/ Direction / Actors /Surya were simply awesome. Privilged to watch a movie of this stature after a pretty long time. At least we are now more aware on the Police atrocity & societies attitude towards tribal people. Hats off to the Real Chandu the lawyer."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nehalkbangadkar",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Just speechless😑 It doesn't need intimate scene to make movie superhit or to be released in theatres. I was just stunned while watching this movie.\n\nI can proudly say that I was, I am & I'll be biggest fan of South Indiam movies since my childhood."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "abhg-12117",
        "review_rating": "10",
        "review_title": "Not just a movie but a harsh truth...",
        "review_detailed_main": "What a masterpiece well deserved 10 rating movie. This movie is based on true incident. A well known case that's still been discussed by people's of South and now the whole country is talking about this movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "bvraghuuvce",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "An amazing presentation of true events. Surya has delivered a master piece by bringing the story which most never knew. The fight of a common man by a common man and taking on the system is eye opener."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "syedsohail-07843",
        "review_rating": "10",
        "review_title": "A pure Masterclass",
        "review_detailed_main": "A movie to watch for no over acting no added dramas simply best acting and mind blowing concept.\n\nDo give a try this masterclass you will be amazed after watching this But some scene are horrifying."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kumarjai-90981",
        "review_rating": "10",
        "review_title": "Salute to maker and Surya",
        "review_detailed_main": "Best movie I have seen in last 6 years, speechless, best story , superb direction... Unbeatable receipt, I wish to watch more movie like this.\n\nAgain surya proof that he is the real actor.\n\nThis movie is big slap to so called bollywood movie actor and directors."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "daddyjosemaxwell",
        "review_rating": "7",
        "review_title": "Don't watch if you're looking for a message.",
        "review_detailed_main": "This movie tries to propagate a message, but an irrelevant one. The story is based in the 90s when caste-based atrocities were more prevalent. There's rather subtle communist propaganda blended in the story.\n\nApart from that, everyone acted quite well in the movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mysnyk",
        "review_rating": "2",
        "review_title": "Worst thing I've seen",
        "review_detailed_main": "The manner of narration and techniques look so corny and boring. Pro forma Indian movie; just not enough dancing. One of those films that can be set to work in the background."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "divyakantsingh-79039",
        "review_rating": "10",
        "review_title": "Jay bhim is not related to any particular caste/tribe.jay bhim is about raising voice against casteism,unjustice and exploitation.",
        "review_detailed_main": "Great movie showing th human exploitation just because of someone born in a tribe .all th actors are very good . Surya is another level actor\n\nBollywood need to learn from tamil cinema."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sreelekshmivivek",
        "review_rating": "10",
        "review_title": "Beyond words!",
        "review_detailed_main": "Beautifully crafted movie!..... Feeling speechless, and that impact of movie which lingers is worth mentioning...... Concrete storyline with perfect casting..... Looking forward to seeing more such soulful movies in future...."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "iamdjazom",
        "review_rating": "10",
        "review_title": "A Movies Of Removing the darkness from Real Truth",
        "review_detailed_main": "After so long i have watched a movie which is such heart-Breaking just bcz its based on true events. I'm so happy to see the movie end as well . Thnaks to the filmmakers who have perfectly made it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "chandrajiths",
        "review_rating": "10",
        "review_title": "One of the best Indian Movie's",
        "review_detailed_main": "Only next to Dangal, this movie comes from my view. The judge Chandru is a remarkable character who stood by our country sri lanka who was banned his license due to that and Sooriya's acting of the judge is out of this world. This should be an oscar nomination from india, which again another amir khan's movie. Lagaan which was contested. This movie is worthy of least a representation of the Oscar as per me!!!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "umarthegem",
        "review_rating": "10",
        "review_title": "Worth of watching",
        "review_detailed_main": "The film perfectly explains the ground reality, how the power centres are messing poors life. This issue touch in the movie has been never highlighted similar way ever."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rahuluikeyji",
        "review_rating": "10",
        "review_title": "Unique",
        "review_detailed_main": "It shows the evils on which people still shy away from talking about. I am very grateful to Surya sir and his team for this masterpiece. Hope we will talk more on these evils."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ruchitagokhale",
        "review_rating": "10",
        "review_title": "Jay bhim... outstanding work by whole team",
        "review_detailed_main": "Outstanding movie ... what an amazing storyline... Reality based movies are always best... Actor Surya is excellent through out the movie...much needed movie for today's generation. Hats off to all the team of #JayBhim."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sharathyash",
        "review_rating": "10",
        "review_title": "Wah wah what a movie, excellent.",
        "review_detailed_main": "I'm kannadiga., but i like Tamilians bcoz there love towards their language,state . It's shows how upper caste people's treat low caste people's. Shame on those guys.\n\nSurya I became huge fan, what an acting what an energy, movie is brilliant. Completely awesome starting to ending it's has so many subjects, must watch guys."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dpkmrks",
        "review_rating": "6",
        "review_title": "Wasted a story about a legend",
        "review_detailed_main": "I don't understand the high ratings. The topic was very good but the execution not and the case they chose to tell the story was very weak you can't make a 2.5 hour movie on this.\n\nI hv seen this kind of story in crime petrol and Premchand Stories with much better story telling.\n\nThey put so much filmy masala and with no depth to the case and unnecessary songs and lame court scenes. I mean there was no real intense debate or speech scene b/w lawyers in the movie which makes you think.\n\nYou can skip first 1 hour easily. So much over dramatic scenes. So many tollywood like emotional scenes of poor people which you can see in their almost every other movie.\n\nAnd they also distracted from main topic in the middle (caste discrimination).\n\nThe only thing to watch to watch this movie is that it is based on a true story and the role of the wife otherwise they wasted a good story about a legend.\n\nIt's the time people should stop giving high ratings to a movie just because it is a south indian movie.\n\nLike KGF or Master or na jane kaun kaun si."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "jpyak",
        "review_rating": "1",
        "review_title": "Brilliant but a lie",
        "review_detailed_main": "Film claims to be based on true events but surprisingly changed the main character to maintain intrest of audience. Brilliant acting by the cast but does not represent true Indian society that it claims."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "farrukhan-93687",
        "review_rating": "10",
        "review_title": "A Excellent must watch movie",
        "review_detailed_main": "A Excellent Movie showcasing the plight of Millions of people suffering on the bases on Cast even in the so called modern India. The movie is heart touching and executed the idea brilliantly. It is unlike most Indian movies, with no unnecessary drama and music which makes it even more amazing."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "p_vaness-994-451200",
        "review_rating": "10",
        "review_title": "Beautifully filmed & poignant perspective for foreigners",
        "review_detailed_main": "Must watch for anyone who cares about justice and fairness.\n\nIncredible deep dive into the Indian caste system, which for westerners, isbjust impossible to imagine.\n\nThe courage and beautiful hearts depicted is awe inspiring.\n\nAnd... cherry on the cake: it ´s all a true story.\n\nBrilliantly acted, too. Wow."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Friday-6pm",
        "review_rating": "10",
        "review_title": "Apart from the violent scenes, the film is actually extremely good.",
        "review_detailed_main": "Apart from the violent scenes, the film is actually extremely good.\n\nToo much of violence actually.\n\nBut without the violance the cinema story itself will become a big zero.\n\nOverall a good movie.\n\nNo doubt if it win Oscar award!!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "arundsolomon",
        "review_rating": "10",
        "review_title": "Brilliant Movie",
        "review_detailed_main": "It's a brilliant movie and must be awarded with National Award.\n\nAfter such a long time I have seen such great direction, court room drama and such a strong story telling.\n\nIt's must watch movie for every Indian!\n\nIt's released in 5 different languages."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dmanojsdb",
        "review_rating": "10",
        "review_title": "The best movie I have ever watched",
        "review_detailed_main": "An actor goes out of his way to raise his voice for the justice for Irular community. The movie's intentional goal is not just profit but social justice. A must-watch movie in my eyes."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "isthatusidhant",
        "review_rating": "10",
        "review_title": "A must must watch!!",
        "review_detailed_main": "I recommend you to watch this masterpiece.. what a well made movie and shows how SC and ST were treated for centuries.. eye opener for me sure.. Superbly acted and great storyline.. I wish we get to see more masterpiece like this in India."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "amreeshs",
        "review_rating": "10",
        "review_title": "Excellent portray",
        "review_detailed_main": "Honest movie that portrays the atrocities done on poor, lower strata people on India. It's still being done . Hats off to the director and producers wo have guts to portray this."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "prabhu-ramkumar1",
        "review_rating": "10",
        "review_title": "It's necessary!!",
        "review_detailed_main": "This movie stresses on the fact reason why law and order exists to even this day and It's not all sold for money. A necessary hope!\n\nIn my opinion this movie did more than a movie should, in fact all that it did are pretty hard to achieve in general, like making a man realise!!!!\n\nApart from that acting, cinematography, direction etc etc all average.\n\nThe real story and events on which it's based on is more hard hitting and creates the mileage for this movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "tahska",
        "review_rating": "6",
        "review_title": "Don't know what with the high rating",
        "review_detailed_main": "Highly overrated movie. This is just an average movie with some good performances by actors. This movie is at best a 6.\n\nPropagandist coming here and giving fake reviews and rating to this average movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sundarprocsrm",
        "review_rating": "1",
        "review_title": "Not good",
        "review_detailed_main": "Waste flim of the year.i didn't expect this to be this bad everyone hyped me up very well for watching this flim but there is nothing there in the flim i will not watch this again even in gun point very very bad flim of the year award goes to this flim."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nebinjohns",
        "review_rating": "9",
        "review_title": "Excellent",
        "review_detailed_main": "Jai Bhim tells about a ture event that happened against a particular Tamilnadu tribal community in 1995. It's a court drama movie. Kerala actress Lijo mol nailed the show Jai bhim. What a performance by Lijo. Hatts of to Suriya sir for doing this movie without thinking his screen presence. Only one drawback of this movie was VFX. In some scenes VFX work is poor. But Jai Bhim is must watch movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "lansinglung-rongmei4",
        "review_rating": "10",
        "review_title": "BRILLIANT & MASTERPIECE",
        "review_detailed_main": "This movie based on true incident. I Loved this movie. Powerful message for the tribal persons. Writing, screenplay and direction is brilliant. Suriya is brilliant in his performance."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rajeev-vlal",
        "review_rating": "10",
        "review_title": "What a great movie",
        "review_detailed_main": "This movie had everything you wanted from a court ro drama. Suspense, emotion and good story. The actors did a wonderful job and also the direction. This movie deserves to win many awards. Hopefully get to see similar movies from India."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "anil-13019",
        "review_rating": "10",
        "review_title": "Thank you for making this film.",
        "review_detailed_main": "What a masterpiece. Every thing is perfect. A good casting and great acting by all the character. Film will you engage you from the beginning. It is not a political film but a court room drama. Makers has delivered a realistic story about the oppressed class problem and police brutality."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "fazil-15337",
        "review_rating": "10",
        "review_title": "Superb - Direction Acting Music Story a benchmark set in Tamil movie",
        "review_detailed_main": "Stories revolves around tribal people who are treated badly and how their lives struggles. Three tribal people where targetted for the sins which they didn't commit. Chandru a lawyer helps their family to uncover the mystery.\n\nStory - 10/10 Excellent story telling, kept us interested throughout the movie. The story evolves as the movie progress which made it really interesting.\n\nActing - 9/10 Everyone did their part extremely well, Surya's acting was great.\n\nMusic and BGM - 9.5/10 I don't find a place where I got bored with Music, BGM is quite excellent, It helps to build the tension and the struggles by the people.\n\nDirection - Director has done his job to the point. There were no scenes which were added as fillers, Every scene has an importance to it.\n\nFinal Verdict - MUST WATCH Nitpicking - Movie has more violence scenes, Viewer discretion is advised."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "bhowmikdebajyoti",
        "review_rating": "10",
        "review_title": "Tremendous...",
        "review_detailed_main": "What a superb story. Thank you very much Manish shah & Suria for making this great film. Each and every character of this film is as important as the lead role. Outstanding acting. Excellent, tremendous, outstanding."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "architectddeepika",
        "review_rating": "9",
        "review_title": "🎦Jai Bhim 2021 Review 🎦",
        "review_detailed_main": "One of the exceptional, outstanding movies of Hot Chocolate, Hot Shot, Actor Suriya (Younger Killer Looks). Court drama that is so thoroughly astonishing & engaging right from the start of the movie. Distinctively unique, even from the very first 5-10 minutes. Definitely from the lines of \"Visaranai\", I am getting used to the recent cinematic legal works such as Nerkonda Paarvai, Ponmagal Vandhal etc, these kind of thought-provoking scripts is fast catching up as a trending inspiration for all film makers.\n\nIn his Brave & Bold attempt, Director TJ Gnanavel 's Jai Bhim (2 hours, 45 minutes long) flawlessly speaks about custodial violence, police cover-up, systemic corruption at a huge level, that is so hard to logically digest or reason out the whole truth and finally there would be no end to the entire picture. The blame game is never ending.\n\nI can add to this saying that Jai Bhim is actually truly-brutally honest, clear-cut reality filled with heart-wrenching scenes, that is sure to leave you feeling that there is more bad in this world than good.\n\nOne can praise Actor Suriya for his super star performance that is so shockingly awesome, only to discover embarrassing sheets of lies, caste hatred and cruelty. Actor suriya has done a wonderful job of acting so well & so concealed, that I just forgot him in the process, being so much involved in the amazing narration of this deeply appealing, story-telling method that the writer TJ Gnanavel has crafted & adopted.\n\nHuge round of applause for the extreme level beautiful Cinematography of S. R. Kathir, which gave this movie it s core life & the element of suspense. Music by Sean Roldan is noteworthy in it s own way, made me feel pain and all kinds of emotions throughout the film. Other actors namely Prakash Raj who shines seperately as usual due to his sensible acting portions for a supporting role, while Rajisha Vijayan, Lijomol Jose, Rao Ramesh deserve a standing ovation and especially K. Manikandan who earned the merit of a special mention. One wonders how he actually did all those gruesome scenes.\n\nThe director unquestionably has to be awarded for the stupendous success of this movie which solely entertains family audiences without depending upon masala factor or \"mass\"components.\n\nI would definitely watch it again as it was based on detailed portrayal of true events & people!\n\nHats off to the entire Cast & Crew, Team of Jai Bhim! Cheers!\n\nOriginal Content By Ar Deepika Dhilip."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Johannesn",
        "review_rating": "6",
        "review_title": "Strong but too silly",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "saurabhdiwan-48401",
        "review_rating": "1",
        "review_title": "Over hyped",
        "review_detailed_main": "It is very over hyped movie. One of the movies that only revolves around agenda rather than having good storyline. Active is good, movie is long and such topics are more suitable as documentaries not as a cinema. It is wrong time for this movie if this was released in 90s then it would push a scenario relevant to the time. Now this India no longer exists."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pseudonimo",
        "review_rating": "10",
        "review_title": "Encourage such films. Very very very good",
        "review_detailed_main": "Such films should always be encouraged. The performers were very good. Felt life like and story was very heart wrenching and sorrowful. Really sad state of affairs in India with caste system. All actors were very convincing and story did not have any unusual drama like you see in indian films. I don't have more words to wrote 150. That's all I can say."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nishore25",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Incredibly powerfull pillared by an award worthy performance and succeeds well at what it sets out to do. Manikandan and Lijomol Jose both offers a huge heartfelt performance. It's the weight of history that gives so much emotional heft. T J Gnanavel does justice to the script. And Sean elevates it to another level. Suriya is the anchor of this Masterpiece! JaiBhim is a hard hitting vital and brutal film."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "meshramp-50819",
        "review_rating": "10",
        "review_title": "A fantastic piece of cinema",
        "review_detailed_main": "Suriya has nailed it with his last 2 movies. This movie too is gonna be one of the best in his filmography. Come on...give it a shot!! The movie starts with a story of tribal community who is being oppressed and punished for no reason by police. One such case happens with a women named sangini. Well, I won't tell the whole story. Just go and watch it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "krishnankrish-99915",
        "review_rating": "10",
        "review_title": "Excellent movie❤😍😍",
        "review_detailed_main": "Jaibhim is so bold, real and hard hitting. It convey the pain of oppressed and also instills the hope oo judiciary 👏👏👏pls don't miss it.\n\nActor surya's another strong character 😍"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "muhammedraeess",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "A movie which will bring tears in your eyes\n\nForget films like sooryavanshi and watch this one.\n\nI stopped watching hindi movies years ago and shifted to English cinema, only rare movies which are exceptionally good I watch, and this was one of them."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "wwwsunilk-17220",
        "review_rating": "10",
        "review_title": "What a movie just Wow Wow N Wow!",
        "review_detailed_main": "What a biography coverd by suriya amazing research and affection by director & scriptwriter and all other actors did amazing job although sanghni did unbeatable role but skills of suriya untouched."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rajanwalt",
        "review_rating": "10",
        "review_title": "Heart Touching Film",
        "review_detailed_main": "Jai Bhim is a heart touching emotional film. The story of the film is based on the real incident.\n\nThe director TJ Gnanavel made it accurately and lawfully."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "DonUltimate",
        "review_rating": "10",
        "review_title": "That's what a true biopic look like!",
        "review_detailed_main": "An excellent biopic and depiction of true events to show institutional discrimination. Some people are getting confused by the name and assuming what the story would be without watching. But go ahead and watch it, it will be worth every minute of your time!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kushalarvindsime",
        "review_rating": "6",
        "review_title": "Good movie but is a politically correct drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "lyricalashu",
        "review_rating": "1",
        "review_title": "Obsolete script",
        "review_detailed_main": "Don't know why every time with such baseless scripts directors want to create a difference between people this could also be true if you would have taken a situation of any simple person who is very much economically deprived."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "MaSaravanan",
        "review_rating": "10",
        "review_title": "Dominant fanatics how misuse the power portrayed in visual beautifully.",
        "review_detailed_main": "This film is based on a true incident happened just 20 years back. Dominant fanatics how misuse the power against voiceless and oppresssed people, portrayed in visual beautifully. Recommending for Oscar category to increase the awareness and prevent where and all, this type of atrocities happening against the oppressed people, across the world."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "chigsu",
        "review_rating": "10",
        "review_title": "Simply Mind-blowing and Fantastic",
        "review_detailed_main": "Wow what a movie. How beautifully one of the most sensitive issue in India is raised is worth an applause. Hats off to all the starcast and specially Surya Sir who has given his one of the best performance till date.\n\nYou will not feel for a single second that you are watching a movie, it will feel like everything is going on front of you.\n\n10 our of 10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "deepakchandouria",
        "review_rating": "10",
        "review_title": "Great work by suriya",
        "review_detailed_main": "This is not just a movie its a truth.\n\nExcellent work by suriya, must watch movie.\n\nThis movie hit hard on casteism.\n\nThis movie deserves theater.\n\nLove the work of hole cast."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shajahan-80530",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "Unbelievable awesome...!!!! One of the best film I ever seened.such a brilliant creation and film making...........both ideologically and cinematically 🔥"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "tapasswarnakar-19108",
        "review_rating": "10",
        "review_title": "Simply it's deserve Oscar...",
        "review_detailed_main": "Outstanding Marvelous Fantastic Masterpiece Oscars deserving.\n\nNo hesitation just Watch it.\n\nYou gonna never missed it.\n\nIt's a Oscar deserving performance by suriya."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vermaayush-78510",
        "review_rating": "10",
        "review_title": "A Must watch",
        "review_detailed_main": "Talks about stuff which is still very relevant in some parts of india.\n\nThe performance by the cast the usp of the film.\n\n\"Everyone\" acted so well in the movie.\n\nFelt some emotional scenes to be a bit melodramatic."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "siddharthjain-60725",
        "review_rating": "9",
        "review_title": "Well Written & Executed",
        "review_detailed_main": "Really an extra ordinary movie. It reveals the pain and sufferings of tribals and how they are neglected and treated by the police department. Must watch."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pawandhaminepali",
        "review_rating": "10",
        "review_title": "masterpiece",
        "review_detailed_main": "Extraordinary story, amazing natural acting and simply wow. All the characters had done justice, though movie is quite lengthy still it has capability to engage audience with every scene."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "anilinkar",
        "review_rating": "6",
        "review_title": "As a movie it is good, but its drawback is it's part of propaganda",
        "review_detailed_main": "I have no obligations about story, screenplay whatsoever. My only disappointment is when a movie is portrayed as based on true story, the makers should not hesitate to include real names of the characters. After rigorous research about the incidents shown in the movie, its clear that one community which is soft target for post colonial mindset people. This is part of propaganda. That diminishes the credibility of a wonderful movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "itsranujaiswal",
        "review_rating": "1",
        "review_title": "Remove politics from movie",
        "review_detailed_main": "I feel for bad for what happened with poor family, good that justice got served, but how it was presented in movie looked politically motivated, a commune-periyaarite release."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "chandrapant",
        "review_rating": "10",
        "review_title": "Lead actors are like omg",
        "review_detailed_main": "I am big fan of surya but now I am his biggest fan and lead actress is awesome and mind blowing and big salute to main hero of movie director and script 🙏🙏"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ranjitkrishn",
        "review_rating": "10",
        "review_title": "Suriya scores a brace with Jai Bhim",
        "review_detailed_main": "Having previously given arguably one of the greatest Tamil movie hits on OTT platform with Soorarai Potru,Suriya has scored a brace with JaiBhim. I must say these real life inspired movies are really helping his cause providing fodder for his immense acting talent. Although communal oppression and custodial violence has been portrayed in several films before, it is the raw treatment which sets this film apart. The guy who acted as Samikannu literally must be awarded an Oscar for all the abuse he took onscreen. His spouse just lived the role with her great natural acting. All the supporting actors played their part to their perfection. All in all , jai bhim is the perfect watch if u are not into so called mass superstars and mad fandom."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vivekc-43012",
        "review_rating": "10",
        "review_title": "Brilliant brilliant brilliant",
        "review_detailed_main": "Superb amazing gripping. Watch with family u will enjoy. The acting of surya is just amazing. Camerawork and all is superb. Defenitely worth to watch a movie that never makes you feel borred hold you tight on the seat to enjoy every bits of it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "vibhus-17780",
        "review_rating": "8",
        "review_title": "Must watch 💯...",
        "review_detailed_main": "Intense and hard-hitting movie . This movie is based on a real incident that took place on 1995 . Really can't imagine how tribal people were treated by the police and society . Most of the scenes were disturbing , especially Police brutality towards tribes . After Visaranai this movie majorly spoke about Police brutality . I think director done good background work on this case . Movie was not only disturbing , also interesting too , investigation sequence were very well handled . Dialogue writing was also great support to the movie hard-hitting and thought provoking dialogues . Sengani character was the highlight of the movie , Lijo Jose very well performed in that role . Suriya's performance and dialogue delivery were awesome , Prakash Raj very well supported . Manikandan had less screentime but gave a very good performance . Every cast done their job . Technical team work was good , especially makeup artists and art work . Cinematography was good . Sean Roldan music was mind blowing . Only negative I felt bit lag in few places . Atlast a emotional , intense and hard-hitting movie , a very important movie that should be watched . A must watch and highly recommend ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kp-35160",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Must watch. Story, acting excellent. Once again suriya's choice of script excellent and execution brillant. Other actors also brilliant. Really nailed it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "punipuni-68359",
        "review_rating": "10",
        "review_title": "Not a movie..it is a reallife documentary",
        "review_detailed_main": "This is not just a movie ...this movie has slapped the so called poor sturctured indian cast system... direction screenplay and acting of all small individuals has made a movie like you are watching a real case...salute to south indistires to bring such masterpiece ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "deepudp",
        "review_rating": "9",
        "review_title": "Captivating, heartwarming and moving",
        "review_detailed_main": "Incredible scenes all through. Despite the length of the movie, you will never for a while feel out of the loop. So dramatically, disturbingly true incidents enacted marvellously by each actor."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dhanrajzepherin",
        "review_rating": "10",
        "review_title": "Much Needed Movie for Society",
        "review_detailed_main": "The movie shows light towards Injustice done by the Police rowdism, Lock-up deaths. The struggle & fear for Scheduled Caste/Tribal people under the Systematic casteism hiding behind the Power & Authority of High Ranking Officers is casually shown, some scenes made me cry & others made me feel Sad & Angry for justice to be served Overall a well-made movie. Hats off to Surya & Team for such a wonderful gem in Kollywood history."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "grafixplanner",
        "review_rating": "6",
        "review_title": "A good movie with lots of plot holes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sbthapliyal",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I don't know how it got this much good ratings.\n\nWasted my time with this overhyped series.\n\nIts direction is very bad as expected from a series. The actors did really bad work. And what can i say about story line ha ha ha ha ha, it was foolish of me expect so much from this series."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "saifalikhan-47526",
        "review_rating": "10",
        "review_title": "Oscar oscar oscar",
        "review_detailed_main": "This movie really goes to Oscar.. This Movie not deserves Oscar,Oscar deserves this movie. Everything is perfect in this movie..,what oscar need in movie,this movie fullfill all requirements."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "aakaashmehra",
        "review_rating": "10",
        "review_title": "JAI BHIM - What an Epic Movie",
        "review_detailed_main": "Excellent movie with very strong social message. Screenplay was amazing and all actor done a fantastic job. Power-packed performance by Suriya and Parkash Raj Sir. India really needs such kind of movie so, all nation should know the fact of police system with tribal community. There is no equal law for poor man and rich man. They arrest poor man without any reason but they can't arrest people like Ambani's and Adani's kind of people with full of proof. Then how the law should be equal for all."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "aravindrajdeepa",
        "review_rating": "10",
        "review_title": "Excellent Courtroom Drama With Painful Story",
        "review_detailed_main": "The Character's re Lit! They Lifted the Movie on their Shoulders. Kudoos to Tha. Se. Gnanavel For Excellent Screenplay! And Dialogues. Climax Made Me Cry And Smile! Like Asuran Climax."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ananyomukherjeeslg",
        "review_rating": "9",
        "review_title": "The courage to take this as a subject and presenting it deserves standing ovation",
        "review_detailed_main": "As a mainstream movie, taking up a complex and controversial subject such as this and to portray Justice Chandru's life and struggle makes the movie a must watch. Cinematically the movie might have been made a bit more intense whereas the movie, as a biopic will remain in the history forever."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "Jewel_M",
        "review_rating": "10",
        "review_title": "Great work",
        "review_detailed_main": "An incredible movie that makes us contemplate the caste system in our country and reflect on the human in us. Also Portraying how noone is to be garlanded for helping the downtrodden and how every system is a tool towards justice."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "binayakgourishankar",
        "review_rating": "10",
        "review_title": "Extraordinary",
        "review_detailed_main": "Such a powerful performance by actors. What a movie. The justice will be served to the people, for the people, by the people. It actually shows how oppressed are being treated by the officers."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nagendraram-17416",
        "review_rating": "10",
        "review_title": "JAIBHIM",
        "review_detailed_main": "Very nice in all respects. Till now. Jaibhim. It should be watch by everyone in the world. Those who love Nature'S-Universal-Law HumanBeings's Constitution, should watch this movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "priyanshusr",
        "review_rating": "10",
        "review_title": "Great Movie.... Must watch",
        "review_detailed_main": "This movie grab your attention toward a most necessary issue.... We are living in 2021 but still in most parts of India people suffer from untouchability, discrimination which has to be stopped and here we can see a glimpse of suffering..... This movie definitely gonna change your way of perceiving this soo called good society."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kamblerajesh-72383",
        "review_rating": "7",
        "review_title": "Okay to Watch",
        "review_detailed_main": "Suppose more focus and deep content should have been revealed in the movie. Content is good, music is far okay. Court drama not much like what I was expected.\n\nSuriya acting seem realistic but it could be better if he embodiment."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "lifevision",
        "review_rating": "1",
        "review_title": "OVERRATED OVERHYPED",
        "review_detailed_main": "Nothing really exceptional. Just a common movie. There are thousands of movies like this. One time watch may be. Easily forgotton. Masala added to real story to make it movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kushalthakur-45720",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Gave him any role he nailed it every time oh surya you're just amazing one of the best actor ever produce in indian cinema, why are south indian movie is best this movie and all are actors prove it,thanks for the amazing experience all of you..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "prathmeshn1992",
        "review_rating": "10",
        "review_title": "Masterpiece!",
        "review_detailed_main": "The movie revolves around a strong plot of fighting against injustice on the Tribals of the nation. Every scene and details are brilliantly captured and filmed! On top of that, it has a brilliant BG and Music. The star cast is exceptional. Must watch."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sudhirjames",
        "review_rating": "10",
        "review_title": "Outstanding movie",
        "review_detailed_main": "First of all I would like to appreciate the real lawyer Chandru sir for being honest coming to the movie director didn't comprise at all of course some investigation scenes are compared with visaranai but they were good coming to the performances casting is perfect Surya has given outstanding performance after Soorarai potru once again Wife character lady has given stand out performance it's quite realistic music by Sean is too good overall it's worth watching."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pratikiyer",
        "review_rating": "10",
        "review_title": "Easily the best Tamil movie of 2021.",
        "review_detailed_main": "Powerful story and a brilliant work on the writing. The story grows slowly but the impact the performances give is just straight brilliance.\n\nLijo Mol Jose, Manikandan, Suriya giving their best. (in that order) Derived from many true life incidents. This movie is an emotional rollercoaster. Best on from Suriya.\n\nThank you for producing such a brilliant movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rohitji-85247",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "riturajsaikia-87363",
        "review_rating": "10",
        "review_title": "Brilliant movie and story",
        "review_detailed_main": "Must watch movie .. Surya's acting is mind blowing..And one more thing it's not just a movie or any ordinary story..This is real story these things happen with with poor peoples."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ajeeshphilip-35324",
        "review_rating": "10",
        "review_title": "Strong storyline, music lyrics 👌, performance 🙏👏",
        "review_detailed_main": "A must watch movie, having a strong story (true incident) well executed, direction was good.#mustwatchmovie.\n\nBased on the truely incident it's hard to implement to story but executed excellently."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "OnlyKSJ",
        "review_rating": "9",
        "review_title": "Watch it, Remember it.",
        "review_detailed_main": "*) K Reviews *) ( ( We already know this kind of treatment happens everywhere, everyday even now but what can we do? A horrific and truthful fact is that even now there are daily five deaths under police custody in India recorded, and this is coming from official govenment data records. This movie is fantastically eye opening, litteraly full of chills. I wish that those who are really accused for this horrible crime may treated with chilli powder in their eyes day and night."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "simhadrigogula",
        "review_rating": "7",
        "review_title": "Routine template but presented in new way",
        "review_detailed_main": "It's very funny to hear that people saying to send this movie to Oscars(with zero knowledge about films).\n\nThis Movie is all about caste with some intense court drama and poor people emotions.\n\nI'm disappointed because Indian film industry is following routine concepts, themes and templates.\n\nBut people over exaggerating because of the raw and realistic look nothing new."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "dharma-96695",
        "review_rating": "1",
        "review_title": "TruthLess Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ibrahim_mayat",
        "review_rating": "10",
        "review_title": "Excellent movie.",
        "review_detailed_main": "Surya and other cast have done tremendous job, absolutely masterpiece for a movie,. Jay Bheem needs to be shown in the schools. An ungly truth of Indian prejudice sadly. Highly recommended movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rajapradeep-81821",
        "review_rating": "10",
        "review_title": "Powerful movie actor #suriya 🔥🙌",
        "review_detailed_main": "#jaibhim #suriya A good movie to be watch 🔥💯 Goosebumps 💯💯💯 a must watch movie Suriya anna acting awesome A real treat for fans 😉 #sooraraipottru #jaibhim movie may be different But #emotions are same💯 We won maara."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kamblebala",
        "review_rating": "10",
        "review_title": "You really need to watch this masterpiece",
        "review_detailed_main": "🔥💯 there is no doubt about jai bhim movie to watch or not, you have to watch this masterpiece movie 🎥 🔥💯 this movie showing reality of India. And also rate this masterpiece movie jai Bhim 10Star....#jaibhim."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "aravinduv",
        "review_rating": "10",
        "review_title": "Wowww..!",
        "review_detailed_main": "It's Amazing flim.. Very Hard Hitting Emotions.. Based on True Events.. Brillient Team work.. Manikandan,Suriya and Lijo Jose Performance mind-blowing..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "madanmarwah",
        "review_rating": "8",
        "review_title": "Taut screenplay, stark realism and high class acting",
        "review_detailed_main": "This movie is a disturbing and traumatic watch dealing as it does with extended scenes of police brutality in the jail premises. The plot is about a tribal who is wrongfully arrested for stealing jewellery and police use third degree to force him to confess. The narrative is gripping as it first shows the police version and alternates with scenes of actually what happened.\n\nDirector TJ Gnanvel deserves credit for making a riveting movie based on a taut screenplay focusing on the oppression faced by the marginalised tribals. There is raw realism as we see them catching rats for food and struggling to make an existence with dignity. Their way of life both in the sad and happy moments are shown well. I felt that that the director has been inspired by the work of Shyam Benegal and Prakash Jha.\n\nLimo Mol Jose who has played the role of the suffering wife has done a superb job. No less impressive is actor K Manikandan as the harassed victim. Suriya plays a brave lawyer- crusader who takes on the entire police department in order to deliver justice to the pregnant wife of the tribal. Veteran Prakash Raj is impressive as IG, police. The acting of all is high class.\n\nThe courtroom scenes have been shot skillfully and are absorbing. It is clear that the self respect , dignity and human rights of the tribal community are on trial here against the all powerful police and bureaucratic state machinery. The movie has excellent cinematography and editing.\n\nDespite the scenes of excessive police brutality (custodial third degree), the movie should be on the \"must see list\" due to its overall excellence."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "abdureditz",
        "review_rating": "10",
        "review_title": "Jai Bhim Review !",
        "review_detailed_main": "Such a Wonderful Amazing Movie , One of the Best Film Of Suriya Anna. All Characters are well Choosen by Director T. J . Ganavel Sir . Sean Roldan Sir Music is Big Plus Point For this Movie. Suriya Anna Acting Nilled it !"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kalshankrishan",
        "review_rating": "10",
        "review_title": "In the film Jai Bhim, the truth of law and order has been shown and the law and order that the government has created today, all these things are visible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sugilite-51455",
        "review_rating": "10",
        "review_title": "Brutal Movie",
        "review_detailed_main": "The movie has brutally captured injustice against weak people ie people who are considered useless by the society based on there race, caste, wealth, status and fate. We were made aware about the actual incident that took place 28 years ago but we are not shown the time line of the case, which is even more horrible. It took 15 years to get justice. The good part is , being a star surya didn't steal the entire show. Liju mol Jose, Manikandan, and other supporting actors were given equal importance. Here the story, screenplay and the director are the real heroes. The movie has reflected the police attitude very strongly which hasn't changed even now."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "nikhilthemacho",
        "review_rating": "",
        "review_title": "Good story but poor acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ayanvinayak",
        "review_rating": "7",
        "review_title": "Good but overrated!",
        "review_detailed_main": "Movie is good overall but it is overrated. Unique subject backed by good story. Performances of all the actors are okay, there are some stretched scenes."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gaikwadtejassantosh",
        "review_rating": "5",
        "review_title": "Why communism and Karl Marx Glorification?",
        "review_detailed_main": "Babasaheb Ambedkar also opposed Karl Marx and communism in there time, instead of showing Karl Marx statue if there is Ambedkar statue then it's would become more epic.💯"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mohammadullahriyadarman",
        "review_rating": "10",
        "review_title": "One of The great Movie i have ever seen",
        "review_detailed_main": "Thanks to Director for give me change to seen this Movie. The history was... Superb What a movie man..,.... Just wow.. .movie nehi makkhon tha...jitna bi bolo kom hei.."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ksnavas",
        "review_rating": "10",
        "review_title": "jai bhim 🔥🔥🔥🔥",
        "review_detailed_main": "I challenge you not cry when watching this movie. Suriya anna performance 🔥manikandan i sure you deserve many award for this film 🏅. T. J. Gnanavel sir, i want to work with you sir pls give me a chance🙏. T. J. Gnanavel sir i really excited for your future projects."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "shaadjd",
        "review_rating": "10",
        "review_title": "Tears confirm and the brutality of police",
        "review_detailed_main": "Must watch film in tamil industry. After soorarai pottru surya sir has done a great job by selecting this kind of script. I hope he will do more films like this. Acting of actors was real soo good."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pnavin-46937",
        "review_rating": "10",
        "review_title": "Rationality with nationality",
        "review_detailed_main": "Jai Bheem title is no where interfering in the story but the \"stand for justice\" which is the common aspect in both the movie and the Name the title refers to, that's how movie gets the title. The screenplay is very impressive as the thrill and suspense is been carried till the end of the movie which makes worth watching."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "hetraval-62191",
        "review_rating": "10",
        "review_title": "About jai bhim",
        "review_detailed_main": "This is a must watch movie.a great work by Suriya sir. Excellent effort to make you see the real bad side of police and society.,..................\n\nMust watch Must watch Must watch\n\nThank you I end my review here."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "tonycashh",
        "review_rating": "10",
        "review_title": "Outstanding movie 👌👌👌",
        "review_detailed_main": "Outstanding movie. ⭐⭐⭐⭐⭐\n\nHats off to Manikandan. What an actor. Salute.\n\nMust watch. Movie describes how poor and schedule tribes treated very badly n Brutally by system, politicians . They don't even mark a justice.\n\nBut in front of Law everyone is equal."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "chandrulib",
        "review_rating": "10",
        "review_title": "This isn't just a movie",
        "review_detailed_main": "Well this movie is going to win most of the awards in 2021. No surprise if this receive a National Award too!! Special credits to director Gnanvel for some of those power packed dialogues which will hit you hard. Greatly delivered by all the crew!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mecami-18560",
        "review_rating": "10",
        "review_title": "Jai Bhim - no words just awesome! Must watch",
        "review_detailed_main": "Suriya, Manikandan, Lijomol Jose and each and everyone played a great role. Prakash Raj played a awesome role. Suriya played a great role. I sure without knowing you , your eyes filled with tears. Must watch movie!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "saikeerthanagangula",
        "review_rating": "7",
        "review_title": "Good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ramns-26175",
        "review_rating": "5",
        "review_title": "Overrated and True Story Manipulation",
        "review_detailed_main": "One of the reviewers from our state said in his review it is cry baby movie. Now He is facing so much hatred and cursing from politically motivated people here. This movie is being praised and rated high not because it has high standards of movie making or fresh content but only because it has some inclination towards activists here. I am no supporter of any discrimination. But what I am trying reveal you all from other states or other countries is some of the facts of original events are manipulated in this movie to satisfy some community people and some political fundamentalists. So basically this movie loses its right to claim itself a good movie."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rahulgautam-24826",
        "review_rating": "10",
        "review_title": "Must watch!",
        "review_detailed_main": "Just watch it, don't waste you time in reading reviews. Great story with perfect emotion and drama. It properly shows how discrimination lies in Indian society and how they fight it with proper reasonings. Don't waste your time just watch it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "arunvanavasi",
        "review_rating": "9",
        "review_title": "..Everyone must watch",
        "review_detailed_main": "This film is based on true events that took place in Cuddalore district in 1993. In the original story, Rajakannu, a member of the Andai Kurumbar tribe whose main occupation was making bamboo baskets and agricultural labour, was accused of stealing jewels from a house that employed him. Based on the complaint, Rajkannu was taken into police custody.\n\nAfter suffering torture at the hands of the police, Rajakannu died in custody. To cover up their crimes, the local police moved his body late into the night, disposed of it in the neighbouring Tiruchirappalli (Trichy) district and later claimed that he had escaped from custody. Rajakannu's wife Parvathi, however, did not buy this story and sought help to locate her husband. Finally, she found a lawyer of the Madras High Court, K Chandru, who joined her quest for justice.\n\nK Chandru, who would later on become a well-respected and popular judge in the Madras High Court, filed a habeas corpus petition in the same court. After a 13-year legal battle, the court adjudicated that this was a case of custodial death and the accused police officials were sentenced to 14 years of rigorous imprisonment for the murder of Rajakannu. In an interview with The News Minute, he recalls how the police attempted to bribe Parvathi and him during the case. Chandru responded by throwing out the suitcase of money and the police from his office.\n\nGetting Parvathi justice for the custodial muder of her husband, however, is only one among the many incredible contributions of Justice K Chandru for the marginalised and downtrodden.\n\nIn his six and a half years as a judge of the Madras High Court, he disposed of 96,000 cases, a remarkable feat which was only possible because of his immaculate planning and organisation."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "zainulabideenisking",
        "review_rating": "10",
        "review_title": "Revolutionary movie..jai bheem!!",
        "review_detailed_main": "It shows us the reality tribes are facing and hope it changes after this movie has reached a wider audience.. surya should be appreciated for taking this story and acting and producing it at the same time.. Hope it gets what it deserves."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "rtnchetandesai",
        "review_rating": "10",
        "review_title": "Real, Raw, Brutal, Hard hitting and thought provoking film",
        "review_detailed_main": "Watched Jai Bheem on Amazon Prime...Real, Raw, Brutal, Thought provoking, Hard hitting film...It depicts atrocities on Irula tribal people (snake catchers) of Tamilnadu...I can't fathom such cruelty exists in our society...This film will make your heart heavy...Highest rated film on IMDb ever with 9.5 rating. Directed by T. J. Gnanavel. With Suriya, Lijo Mol Jose, Manikandan, Rajisha Vijayan giving outstanding performances...A must watch...highly recommended but pls note that you will need time to come out of its impact..."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "amansingr",
        "review_rating": "10",
        "review_title": "Super movie 🍿",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "pp-40990",
        "review_rating": "10",
        "review_title": "Jai bhim",
        "review_detailed_main": "This movie teach us to help lower class people first and be humble with them And the way the film makers show us the reality is appreciable.\n\nAnd that suspenseful film i always looked for finally they make it for me Film is pack of boom."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "noebeldb",
        "review_rating": "10",
        "review_title": "Jai bhim",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "mslfextrwrk",
        "review_rating": "10",
        "review_title": "Got energy, brave, inspire to fight.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "siddikalom-32010",
        "review_rating": "7",
        "review_title": "Predictable, doesn't worth 10/10, but engaging",
        "review_detailed_main": "Spoiler: it's brutal and hard to accept.\n\nGood to watch but story was too predictable. Bitter truth of racial discrimination in India and all over the world. After readying that the story came from a true incident, I read information on Justice K. Chandru Sir! World needs many good people like you. Respect!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sukhi-44194",
        "review_rating": "1",
        "review_title": "Your typical South Indian potboiler",
        "review_detailed_main": "If this story had been handled by Hindi art film directors such as the likes of Govind Nihalini, Shyam Benegal, Tapan Sinha, Shekhar Kapur etc..and actors with better personalities, this could have been a great movie. Instead, its your typical 21st century South Indian movie, where over the top melodrama, fast & cheap thrill dialogues, otp emotions and scenes with thousands of people altogether etc...\n\nAlso on IMDb it looks like these Tamil hero worshipping crazy fans, like they do with c-grade rajnikant movies have gone on here on mass and rated this movie 10 stars deliberately, so it goes higher then classics such as Godfather and Shawshank Redemption. This movie is nowhere near those standards, infact its not even a good Indian movie. Its just another South Indian political/vote bank movie!"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "gauravkvschoudhary",
        "review_rating": "10",
        "review_title": "One more masterpiece by SURIYA after Soorarai Pottru",
        "review_detailed_main": "Just finished watching this movie. This movie was just awesome. The direction of the movie,cinematography,acting every thing was just awesome. One thing I want to tell you that the brutal scenes in the jail were just top notch. The acting of the victims and the policemen in the jail was just awesome. The acting was that good that you will start hating the policemen for their bad deeds. The acting of suriya and prakash raj was excellent.\n\nMy rating for this movie is 10/10."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ermadhan",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "Very good movie with great storyline and screen play. Surya and manikandan played their role very well and dramatization was excellent. Hope society changes in coming years."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "grvkumar-81323",
        "review_rating": "10",
        "review_title": "Badalte bharat ka real face",
        "review_detailed_main": "Such or jhut ka samna karaaya hai is movie ne 3000 se jo dalit jhel rahe hai. City ho ya fir village har jagah discrimination hai hi. Share this ishu to people and Humanity."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sunnypaaji",
        "review_rating": "8",
        "review_title": "Fantastic",
        "review_detailed_main": "Thanks Prime for the Hindi dubbing. This is a brilliant movie which keeps you on the edge all the while, makes you angry, sad, happy. Would highly recommend to watch it at it says based on true events."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "viratkapure",
        "review_rating": "10",
        "review_title": "#Jai Bhim",
        "review_detailed_main": "I Jai bhim movie watch it is very nice, surya sir acting is very good,I love this movie.surya sir very hard work in this movie,surya all movies are good but this movie is very different and loving.please watch this movie.\n\n#Thankyousuryasir...... 🙏🙏Jay bhim🙏🙏"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "adithyans-31049",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "razaulakhtarhero",
        "review_rating": "10",
        "review_title": "One of the best Indian movie of all time",
        "review_detailed_main": "This is by far one the best movies of this year, I was left by my tears in the end of the movie, the acting was exceptional primarily of Suriya's. This movie will definitely leave you in tears."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "inshaa",
        "review_rating": "7",
        "review_title": "Don't be fooled by the rating",
        "review_detailed_main": "I saw this movie just because of its high rating and man I could not have been more wrong.\n\nJust an average movie with average acting and storyline.\n\nNothing new, Nothing so amazing about it."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "tolstoyjustin",
        "review_rating": "1",
        "review_title": "Very good movie",
        "review_detailed_main": "It is a extra ordinary movie , get ready with a tissue to wipe your eyes incase you can't cry get an appointment with a psychiatrist..............................."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "sharshetty",
        "review_rating": "10",
        "review_title": "Must watch for every Indian",
        "review_detailed_main": "Jay Bhim comes up with some real hard facts happening in many parts of India. Undoubtedly the best performance given by each and every actor. Kudos to each and every member attached to this movie and I thank Suriya for giving us JAY BHIM ."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "kichujdass",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Undoubtedly must watch movie one of the top movie from tamil industry the cast performance of the movie is lit Especially lijomol she is the pillar of this film and surya he is the one of the versatile actor in indian cinema this movie tell us a discrimination of caste and peoples surely it's a worth and must watch you will never regret."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "iamlokeshbabu",
        "review_rating": "10",
        "review_title": "A nice movie",
        "review_detailed_main": "This movie attempts to say about some tribal peoples misusage nd treatment in public with third degree. If this was there in real, it should have to be condemned.\n\nOverall a very good movie ending with a word justice will.win at last."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "abelpaulattupuram",
        "review_rating": "10",
        "review_title": "A must watch movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "piyushgajbhiye",
        "review_rating": "10",
        "review_title": "JAI BHIM : A movie which no one dared to make one.",
        "review_detailed_main": "I really like movies who are based on real incidents and I saw many of them but this one is an absolute masterpiece.. The acting of all the actors specially Surya , the judgements shown in the movie, the story lineup etc everything is amazing... Can't even express everything in this review but movies like this deserves an Oscar ...\n\nJAI BHIM."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "felidaeleo",
        "review_rating": "10",
        "review_title": "Jai Bhim💙",
        "review_detailed_main": "Suriya is just too good ,plot , story everything is just another level sooo good , putting such type of real life event story and not like Charsi Bollywood suriya also help financially to tribe Suriya is a great man."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "santoshsingh-41509",
        "review_rating": "10",
        "review_title": "Emotional but True",
        "review_detailed_main": "It's a Realistic movie on true based incidents. Everyone should watch this movie because still in our country people discriminates each other on the basis of cast, religion ,etc."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ajay-kandukuri",
        "review_rating": "7",
        "review_title": "Strong subject and engaging movie but with flaws",
        "review_detailed_main": "Overall I would rate it above average for the subject, acting and screenplay. However, there is nothing extra ordinary or Unique about this movie in terms of how the story is presented."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "fucvignesh",
        "review_rating": "1",
        "review_title": "NOT a True Story",
        "review_detailed_main": "Please analyze the true story of nature ,These guys like Surya cheated us with the trading and trending civilians story, You just nailed it Surya with your performance on both screen and off screen, We just lost under your fraudulent effect ,"
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "ravi-26911-70165",
        "review_rating": "10",
        "review_title": "The best movie ever that teaches humanity a lesson",
        "review_detailed_main": "We are all the same We do not have to see small, big, poor, rich, high and low, caste. It is written in all religions that humanity is religion. We are all the same We do not have to see small, big, poor, rich, high and low, caste. It is written in all religions that humanity is religion."
    },
    {
        "movie_id": "tt15097216",
        "movie_name": "Jai Bhim",
        "movie_rating": "8.7",
        "review_username": "febinpyforinforever",
        "review_rating": "10",
        "review_title": "Wow what an epic movie.. nothing to say..it's an gem",
        "review_detailed_main": "Suriya sir you are awesome.#JaiBhim 5/5 Another MASTERPIECE From Actor Suriya, Indha Madhiri Padam Adikadi Pannunga @Suriya_offl Sir A. All Actors Performed Very Well, Especially Manikandan f. Lijo & Tamizh Performance Gud. Sean Rolden's BGM Big Plus. Dialogues MUSTWATCH."
    }
]