[
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "RebelNaina",
        "review_rating": "3",
        "review_title": "Horrible",
        "review_detailed_main": "It is one of most poorly made movies I have watched in a long time. Don't know what Sooraj Barjatya was thinking while making this one. No story, no theme, no soul, no sense, no base....what was this Sir\n\nSalman you just did Bajrangi Baijaan, which is so good. Why did you have to do such a movie. What was the football match about. So unreal, so unwanted. Sonam Kapoor I thought could act when I saw Ranjhana, guess it was just a fluke. I am so disappointed because I have always loved Sooraj Barjatya's movies. Now next time I have to be really careful before watching his movies\n\nSad and disappointed"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ketgup83",
        "review_rating": "4",
        "review_title": "Prem Ratan Dhan Payo is a big letdown with poor direction, wafer-thin plot and messy drama. If you are a die-hard fan of Salman, watch it otherwise skip it",
        "review_detailed_main": "Sooraj Barjatya have been known for making quality cinema that spawned some successful films like Maine Pyar Kiya, Hum Aapke Hain Koun.. , Hum Saath Saath Hain and Vivah boasting off the tradition and culture of Indian family with tuneful music and grandeur sets. Prem Ratan Dhan Payo, his fourth collaboration with Salman Khan and after gap of 16 years, has created hype and soared sky-high expectations. Unfortunately, the family drama disappoints and will leave you dissatisfied at the end.\n\nPrem Ratan Dhan Payo tells story of royal family of Pritampur where a plot has been hatched to assassinate the young prince (Salman Khan) by his brother (Neil Nitin Mukesh) before the coronation takes place in the royal palace. A look-a-like of the prince, Prem, steps in to save the day. However, he falls in the love with bride-to-be of the prince(Sonam Kapoor).\n\nNow Sooraj Barjatya has adapted the story from Anthony Hope's novel 'The Prisoner Of Zenda' (1894) and infused his family drama with typical song-drama routine. Master of presenting the values of Indian culture and custom on silver screen innumerable times, Sooraj Barjatya gives you a fine first half with grand opening scene of Salman Khan and introduction of each character coupled with bit humor. Till this point, the film is tolerable however the second half tumbles down the rabbit hole and refuses to pick up. The screenplay is messy with too much of things happening in quick succession and without any sensible reason. The problem is Barjatya follows the same path of his previous films ( he even borrows the sports scene from Hum Aapke Hain Koun\u0085 this time replaced by football in this one) which actually become a mockery in the end. Another issue is too many songs which is misplaced and is included in every ten minutes between the scene. The climax which should have been the highlight of the film is diluted with weak action choreography and melodrama.\n\nSooraj Barjatya ( also credited with story and screenplay) is not in form this and clearly misses the mark. Coming from the director who made some outstanding cinema previously, I was disheartened. The editing(Sanjay Sankla) is half-baked with weak dialogues that will spoil your mood leaving you unsatisfied. Cinematography (Manikandan) is spell-binding capturing the essence of Rajasthan and Gujrat. Art direction is eye-catching. Kudos to Nitin Chandrikant Desai for always innovating with unique style. Background score is jarring to ears. Music by Sanjoy Chowdhury and Himesh Reshammiya is tuneful but certainly not chart-bursting. Coming to the performances, there is only one reason to watch the film – SALMAN KHAN. The superstar is getting better with his expressions and emotes well throughout the film. He is adequately supported with fantastic performances by Anupam Kher and Deepak Dobriyal. The third and the final problem with the film is wrong casting (Vicky Sidana). Sonam Kapoor certainly does not fit to carry her part earnestly. It is high time for her to seriously take her acting lessons properly ( She is part of the industry for 8 years). I feel bad for a talent like Neil Nitin Mukesh getting wasted in half-baked character. Armaan Kohli is a letdown.\n\nOverall, Prem Ratan Dhan Payo is a big letdown with poor direction, wafer-thin plot and messy drama. If you are a die-hard fan of Salman, watch otherwise skip it. Below average 2/5\n\n– Ketan Gupta"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "allypk2000",
        "review_rating": "3",
        "review_title": "The Prisoner of Zenda with an Indian touch",
        "review_detailed_main": "Hi everyone, I never intend to offend anyone but cannot help it after viewing this title and wasting 3 hours full of nothing but sonam and salman duo working out together. I never expected this from Sooraj Batacharya, a lame copy of The Prisoner of Zenda. Here no one is drunk but the drinking factor is replaced by an accident and the ending is with an vintage Indian twist. Anupam Kher is Col. Sapt and his associate is Fritz. Sonam Kapoor (Princess Flavia), Nitin Mukesh (Black Michael) and his associate Rupert of Hentzau. Really the movie could have become owe some but something is missing or missed out. 5.6 rating is too high, I rate the title 3 for copying the novel so poorly. REGARDS"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ayushbhatt-91337",
        "review_rating": "1",
        "review_title": "Worst and Boring Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "iHammadKhan",
        "review_rating": "1",
        "review_title": "The most Boring Movie I have ever seen.",
        "review_detailed_main": "The first half of PRDP flows very slow and the story moves along boringly whilst establishing the characters. The biggest problem with the movie is that the conflict doesn't seem to be too big for it to matter later on when the conflict gets solved.Prem Dilwale's too much overacting makes the film irritate you like hell. The football match sequence and the sequence where Prem mends the relationship of Vijay with his step-sisters are completely over the top ones. There are a lot of illogicalness like the placement of a palace on the edge of a waterfall. At the end of the 160 minute duration, PRDP manages to make everyone sleep and the emotions do not work at all which should in turn make the film not work even amongst the family audiences. PRDP looks completely outdated and clearly no money has been spent on the sets and the costumes. The production design is of very low standards. The VFX work is the worst you have seen in Hindi films and the editing could have been much more tighter but as we all know, Sooraj Barjatya believes in boring cinema. Himesh Reshammiya delivers a pathetic soundtrack. None of the songs stay with the viewer. And the worst one is the title track which seems to be nowhere. Each and every actor completely overacts and the one who does the most throughout the movie is Salman himself. Prem Ratan Dhan Payo can't even be thought of to be compared with classics like 'Maine Pyaar Kiya' and 'Hum Aapke Hain Koun'. The film thoroughly bores you with dull moments all over. Sure there are a lot of silly and illogical moments. And Salman Khan puts in a terrible performance as Prem Dilwala. In the first half of the film, he irritates you over time and again. Diwali is the time when families come together and PRDP will be disliked even by families as it is the most boring movie which irritates you with overacting. This festive season, avoid it for sure. It's a 0/10 rating movie to be honest, but have to give 1/10 as 0/10 is not allowed on IMDb. Sooraj Barjatya films come once in 6-7 years and there is no director in the industry who can fill a film with as much overacting as much as the he can. Advice for the youth, don't even watch it on your on TV."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "bunnysidhu",
        "review_rating": "1",
        "review_title": "Hard to believe 'Bollywood' is still making such clichéd movies",
        "review_detailed_main": "Damn, when will we ever learn? Well even before asking this, I knew the sad answer. I could not bear to watch more than half an hour of this worthless piece of s**t. The abundantly used & reused script, the all good pauper, the double role, the unnecessary songs, the out of sync pathetic & outdated soundtrack, the forced upon villains of the film & Salman's usual overacting were too much for me to handle. This whole movie is way too outdated and seems like a movie from the late 80's. The screenplay and the coincidental scenes of blossoming love between Salman (50 year Old) & Sonam (20 Years Younger) were irritatingly naive and dated. I beg to the film makers to grow up and stop testing our I.Q. already. Please have mercy on us. But then again, why would they ever stop! It's hard to believe but true that this movie has already done Box office collections nearing 200 Cr. as of yet (i.e. today : 17th Nov). 'Bhai's' Fan following from the masses in India surely encourages them to keep making these overrated pieces of junk repeatedly. I usually check the rating and make an educated guess after reading some reviews from IMDb website. But then again, the fans of these glorified actors have infiltrated deep within IMDb too and misleading gullible movie watchers to go ahead and watch these kind of movies. The wish that the censor board rate movies on I.Q. levels too. I guess I'll stick to my thought of staying away from Bollywood movies, cause while watching such crap, I tend to get frustrated and uneasy. Rest, this is my thinking on this, you take your own call. Caution : Proceed to theaters at your own risk!!!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "Rawal_Afzal",
        "review_rating": "2",
        "review_title": "Seriously?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "theexmachina",
        "review_rating": "1",
        "review_title": "Abysmally Awful",
        "review_detailed_main": "So terrible. Even the trailer was unbearable, couldn't expect anything better from the actual movie. The better side of the picture is that I went to PVR and had a deep and interesting conversation with my friends. The popcorn wasn't too bad either.\n\nThe only good thing about the movie is that the set design and cinematography was vibrant and looked amazing. The movie is filled with unnecessary 6 minute songs but has a 2 minute paper-thin plot. I'm flabbergasted by how well this movie is doing, just cause of Bhai fun club. Congrats Bhai, you have done it again. You keep churning sh!t, every year, be it Eid or Diwali. Thenks!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "A Bit Regressive Here, a Bit Outdated There, but Innocently Endearing and Naively Charming on the Whole",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sinecostantrig",
        "review_rating": "2",
        "review_title": "Felt Like I Was Watching an Indian Serial...Terrible Even for Salman Khan",
        "review_detailed_main": "It is tough for me to even give 2/10 to this movie. The entire movie had roughly 45 minutes of content, but was 3 hours long. The movie progressed at a very slow pace, and the direction style was very similar to how serials are directed in India (yuck). Everything was overdramatized, and I'm surprised I didn't internally combust while watching this expensively made crap put on a screen. Apart from Bhajrangi Bhaijaan, all Salman Khan movies have been the same for the past 10 years, and most of them have been pretty bad. Props to Salman for doing something different than the stereotypical mindless action movies he does, but this was probably his worst movie in the past 10 years (yes even worse than his typical mindless action movies). Salman may get to a point where he can act and make good movies one day, but this will be one of the biggest stains on his record."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "dhemm-2",
        "review_rating": "8",
        "review_title": "What's wrong with a simple, feel good movie?",
        "review_detailed_main": "As has been mentioned this is a take on the Prince and the Pauper story that may not appeal to those who are into art films and like to sit around discussing and dissecting a film's philosophical nuances.\n\nIf, on the other hand, you simply like a fun story, gorgeous sets, and yes, the occasional over-the-top scene, this can be a thoroughly enjoyable tale of a man who is willing to put the woman he loves ahead of himself.\n\nI speak neither Hindi nor Punjabi, so I can only go by what I read into the English subtitles, and the first ones I had were out of sync by 20 to 60 seconds which was a bit confusing to say the least, but after obtaining a proper sub file I enjoyed the show."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "anupapu8",
        "review_rating": "7",
        "review_title": "Even an average Barjatiya film is an easy watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "yasminazazel",
        "review_rating": "1",
        "review_title": "Total Disappointment.",
        "review_detailed_main": "This is truly one of the worst Bollywood films I have ever had the misfortune to have had to watch. Having seen the trailer I was expecting a proper bollywood flick choc-a- bloc filled with culture, tradition and well...a plot! The characters are all boring and one dimensional and I found myself not caring about any of them and wishing someone would die or something so the film would hurry up and end. Nonsense, pure nonsense. The one decent song which was played in trailer was the only part of the film that was mildly entertaining. Total waste of money, I recommend waiting for the DVD release, because otherwise you'll be left feeling cheated."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sayanadhikari207",
        "review_rating": "1",
        "review_title": "Most Overrated Movie and a waste of time",
        "review_detailed_main": "If you have huge time to waste then it's a must watch movie. I can't understand how the critics (so called as per IMDb) gave it higher ratings than 1. In five days it crossed 150 Cr mark. No doubt the movie Happy New year did it almost in the same way which is also similar in quality. Action sequences were funny.Story line was boring. Emotions were fake. No proper climax was there. And last but not the least the ending was super funny (negation). Salman Khan is just wasting his carrier in it. It doesn't fall in any category of Indian movies. My advice is don't waste your money on this. The interesting fact is that it doesn't even deserve 10 lines of review (which is mandatory for IMDb)."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "abhendudubey",
        "review_rating": "1",
        "review_title": "A low IQ movie, don't believe those 10/10 fake reviews!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "lovelivedance",
        "review_rating": "1",
        "review_title": "Waste of Time And Money.Do yourself a favor and skip it.",
        "review_detailed_main": "Absolutely Disastrous to say the least. Bollywood keeps churning one crap after another. Salman seriously needs acting lessons. One of the top actors supposedly but zero acting.His dialogue delivery is weak and extremely annoying. Sonam cannot act to save her life. Instead of wasting money on brand name clothes wish she would invest in some acting classes. Waste of Time and Money. Neil nitin can act but has minimal screen presence. And I cannot fathom someone wanting to watch Armaan Kohli in a movie. Why can't a movie have someone decent who can actually act and no there because of family name? Salman,Sonam,Armaan etc need to retire."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "nareshavil09",
        "review_rating": "1",
        "review_title": "Not recommended ( This Review may contain spoilers )",
        "review_detailed_main": "PRDP is an excruciatingly painful experience. It is not recommended even for ardent fans of Salman Khan. Because, here is seen doing the same antics, which he is famous for. Nothing new like in Bajarangi Bhaijaan. Sonam's character had lot of scope for showcasing her acting skills. But, she messes up as usual. She is a total misfit for the role. Actually the director seems to have little confidence in her acting abilities. ( This Review may contain spoilers ) It is quite evident in the last scene when prem bids goodbye to sonam. The director has shot the scene using the silhouette of sonam, instead of showing her expressionless face. Obviously she could not have pulled off this scene. About Neil Nithin Mukesh & Armaan kohli, The less said, the better. Music score is very mediocre and does not suit at all. Only respite is in the form of Anupam kher, Swara Bhaskar & to some extent Deepak Dobriyal, who stand out in this messy affair. Believe me, You are going to get Migraine like Headache after watching this. Please avoid this one."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "krishnacv",
        "review_rating": "1",
        "review_title": "Extremely dumb movie",
        "review_detailed_main": "An awful movie with the dumbest ever ending. How could he come down from bajrangi bhaijaan level to such low level piece of crap within just 3 months. Sonam kapoor is just a useless heroine and she needs some acting lessons.All of the movie looks like a play written by some dumb low IQ person who doesn't have any aims in his life. Moreover the ending is so dumb that it makes you look like a 3 year old baby who doesn't know anything. I am not surprised that the movie has made 150+ crores because like any other person i also went to the movie due to some paid reviews. IF YOU WANT TO WASTE 3 HOURS OF YOUR LIFE THEN GO AHEAD WITH THE MOVIE."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "Sweet, but The Narrative Appears Outdated!",
        "review_detailed_main": "Sooraj Barjatya's 'Prem Ratan Dhan Payo' has finally arrived & is the BIG Diwali release of the year. But is it worth all the hype? The answer is, partly yes, partly no!\n\nReason? While Barjatya's story is undeniably sweet, the narrative's structure appears outdated & the excessive running-time (169-minutes), spoils the fun. However, Salman charms as Prem & enacts dual-roles, endearingly.\n\n'Prem Ratan Dhan Payo' Synopsis: After a King (Salman) is nearly killed by his jealous step-brother (Neil Nitin Mukesh), a Lookalike (Salman, Again) fills his shoes. While there, the Lookalike, now posing as the King, falls for the princess & the King's bride to be (Sonam Kapoor).\n\n'Prem Ratan Dhan Payo' is great to look at & the message of the film, that being, love should always win over hate, is heartening. But, the storytelling comes along with an Erratic Screenplay & too many songs, that, sadly, don't add much to the film. Barjatya's Screenplay is sweet & some sequences (Especially in the first-hour), hold your attention completely. The second-hour loses grip & the songs keep popping up a bit too soon & stretch the film, without adding any weight to the drama.\n\nAlso, Barjatya's Screenplay has multiple sub-plots & not all engage. The one that appeals is the one involving Salman's estranged step-sister (played by a wonderful Swara Bhaskar). The sub-plot of the villains (Neil Nitin Mukesh & Armaan Kohli), doesn't really work. In short, Barjatya's Writing appeals in bits & pieces, not entirely.\n\nBarjatya's Direction is simplistic, but has a dated vibe to it. However, He's handled a number of sequences, especially the dramatic ones, with command. V. Manikandan's Cinematography is grand. The Lensman has captured the huge canvas, wonderfully. Sanjay Sankla's Editing needed to be crisper. The film is a bit too long & could've easily been trimmed down by at least 25-minutes. Art & Costume Design are fantastic. Himesh Reshammiya's Music is good. Action-Sequences are finely choreographed.\n\nPerformance-Wise: Its Salman all the way, The Superstar is at his most endearing as Prem, the clean-hearted soul, who spreads love everywhere. Even as the King, he's done quite well. Its a delight to watch him, from start to end. Sonam Kapoor is nice & looks beautiful throughout. Anupam Kher is fantastic. His camaraderie with Salman, is fun to watch. Deepak Dobriyal is another topper. He brings in a lot of laughs, through his goofy portrayal as Prem's best friend. Swara Bhaskar is graceful, as always. Neil Nitin Mukesh & Armaan Kohli are strictly okay as the villains. Others lend adequate support.\n\nOn the whole, 'Prem Ratan Dhan Payo' isn't a wholesome entertainer, but a decent watch nonetheless."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "jaymittalagain-5",
        "review_rating": "1",
        "review_title": "Lame Ratan Dhan Payo.",
        "review_detailed_main": "There was so much hype about this movie. Sooraj Barjatya returned after 7 years. Salman Khan, Sooraj Barjatya returned after some 16 years. The songs were decent. The title song even became a hit on dubsmash. So with all this hype and high expectation we went to watch it first day first show. But it turned out to be a lame movie. Maybe we were expecting too much. They are saying that they are bringing the 90's back but sorry our 90's wasn't this lame. This is just a bad and almost 3 hours long boring movie. The songs are forced. The emotional scenes fail since you are too bored watching some illogical scenes. I think even Salman Khan fans will sleep watching this movie. The cinematography is good. The locations are very good. But that is not enough. The typical Sooraj Barjatya factor was missing in this one. Highly Disappointed."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sukhjitmatharoo",
        "review_rating": "8",
        "review_title": "Worth Watching",
        "review_detailed_main": "Some reviews don't give this film the credit it deserves, to appreciate the film you need to be able to relate to it, as everything in life, if you don't relate to it then you won't understand it. It's another film based on a character that will do whatever it takes to help out others without expecting anything in return, that in itself is something that is very rare nowadays and something every selfish person will find stupid. We live in a world where most people are have the mentality \"what's in it for me\" if you have that mentality you won't enjoy the film. If you appreciate your friends, family and even those you don't know but you can see they're unhappy and would like to see their problems go away and be happy, then this film is something that you would enjoy."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "naitikm-38927",
        "review_rating": "6",
        "review_title": "Same old storyline but a fairly good family entertainer",
        "review_detailed_main": "Prem Ratan Dhan Payo, which is directed by Sooraj Barjatya. What all can you accept from such movie. Same family based emotional storyline which is not at all appealing in these times.\n\nThe songs, performances and cinematography are a good pull of the movie with some over the top melodramatic scenes which thus make it an average holiday family entertainer."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "haiderfarwah",
        "review_rating": "1",
        "review_title": "Awful... 2+ hours torture...",
        "review_detailed_main": "I cannot believe that bollywood is making such bad movies these days.\n\nNo proper story, poor screenplay, lifeless comedy, very awkward pairing (Salman and Sonam), boring songs, we were prayng every minute for songs not to come ever 4 minutes.\n\nHuge fan of Salman Khan but was disappointment and was unable to finish the whole movie.. very lengthy torture. I wish I could forward half of the movie or some one had warned me so I could have saved my 3 hours of my life.\n\nI cannot believe that the movie already made 200 crores.\n\nMy advise to families to save money and don't watch this movie in theaters.\n\nSave that money and have a nice meat at a nice restaurant with your family or do something else with your family.\n\nHope this helps...."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "info-37313",
        "review_rating": "1",
        "review_title": "Horrible torturous long musical movie",
        "review_detailed_main": "I went to see movie as it was promoted as family movie. The movie bored me to death in just 10 minute, and then 2 hour 47 minute seems like a year. Sonam Kapoor was bad and rest of the cast had no role. Music, acting, story, direction everything failed in this movie. Family movie doesn't have to be illogical, long and boring. This is one of the worst movie I have ever seen in my life. Villain of this movie looks joker and they hardly have any role. Choreographer have come up with such pathetic dance step that no student should ever watch it. Music is unbearable and old. This movie is late by 100 century. Completely avoid this movie and save your money."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "lsubashwriter",
        "review_rating": "1",
        "review_title": "These 10/10 are paid reviews don't believe them.See review patterns",
        "review_detailed_main": "Some of the good comments and reviews for this movie here definitely seems to be planted or done by some paid services. The movie was released yesterday afternoon and see the pattern how the reviews done yesterday are rated 10/10 with rot praise where was real reviews done today are 1/10 (almost all). Plus see how 1/10 is up voted where as 10/10 reviews has 0 vote. These Bollywood movies now a days invest bigger money, large portion of budget in this kind of advertisement, buys spots in media, make reviewer write good comments and claim their movie earned lots of movie arousing enthusiasm in other and make lots of money. This movie is one of them. Pathetic movie but with big brand and lots of money and all marketing rather than story. So many illogical flaws, story is child fairy tales, overacting, poor acting. It thinks people are fool and watch what ever is given paying money. I am not alone just see the other comments from real viewers who has watched the movie you will know it. I liked earlier Salman's movie but this one is definitely thumbs down. 0.5/10 10/10 are paid reviews(to increase overall rating) don't believe it Don't believe watch movie yourself and write a review here..."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ritzz234",
        "review_rating": "1",
        "review_title": "Don't even expect the usual Rajshri family sanskar overdose",
        "review_detailed_main": "PRDP doesn't make you laugh, cry, think ... it will just make you wait for the remaining time to get over, esp the second half.\n\nThe movie starts with the usual Rajshri way of making a song and dance about a noble person, Salman-1 (Prem Dilwale, what a name!), who is the owner of a drama company in Ayodhya. He admires Sonam Kapoor (Rajkumari Maithili) who travels in a chopper to do charity for flood affected areas. He goes to meet her in a fabled place, Pritampura, only to find that the person she is about to get engaged to, soon to be coroneted Rajkumar Ajay(Salmon-2), has gone though a regicide attempt and has been saved by some of the loyal supporters of the late king. these supporters want him to play king for sometime to fool the people, the rajkumar's enemy and \"maitili's\" family. There starts Salman's attempt to voo the entire kingdom, starting with the bethroted princess to the king's sibling's to the people.\n\nMeanwhile the actually king recovers and is then kidnapped by the enemy. Finally family peace regains and the princess chooses her husband.\n\nThe movie boasts of illogical sibling relationships, extremely clichéd and unintelligent conversation , bad visuals used to create places like a crystal palace which floats besides a huge waterfall and has mirror mazes and all, surreal places like a garden where flowers continuously keep falling, unmemorable and non-catchy music and a very irritating and amateurish performance by Sonam kapoor (what else could we have expected.) Salman Khan although irritating and illogical at some place is at least pleasant to look at.\n\nThe movie is so predictable that in some of the early scenes you'd guess what the fight sequence would be in the end.\n\nI might not have related to all Rajshri fairy tale family dramas, but have at least been absorbed while watching them. This one is an exception through and through."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "Rehan7",
        "review_rating": "1",
        "review_title": "If you have an IQ of a retard, you will like this",
        "review_detailed_main": "The amount of money this movie has made just shows you how retarded the masses are. People who liked this movie either have zero IQ or have never seen the real world or have never watched something decent or are utterly delusional. Wonder what they smoked while making this movie? a 4 year old could have written a better script and an 8 year old could have done better as a director. If this is the standard of movies making money now then forget about watching any quality stuff in the near future. Just when you thought Bollywood was turning a corner, it has gone back to the dark ages and then some. An yes you are a RETARD if you like this movie, you should see a psychiatrist if you actually thought this was anything but an utter waste of time, money and everything."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sunildaswaney-63642",
        "review_rating": "1",
        "review_title": "An awful movie",
        "review_detailed_main": "It's a major pity that S.Bharjatiya who gave us two gems in \"Hum Saath Saath Hain\"and Hum Aapke Hai Kaun gave us such a damp squib in \"Prem Ratan Dhan Payo\".This nearly 3hr long movie was bad in every way viz.very very very poor script,direction,and acting.They were many many unwanted songs which were all very bad.Like his ex-girlfriend Katrina Kaif,Salman Khan is a non-actor who for some strange non-explainable reason is able to churn out hit after hit with his horrible movies.Every single person in the movie including Anupam Kher acted very poorly.All in all it's a long, boring, dreary,tedious,cumbersome and awful movie,which I fear,yet again will be a major box office hit because of Salman Khan and Salman Khan"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "binducherungath",
        "review_rating": "7",
        "review_title": "Prem Ratan Dhan Payo is indeed an entertainer.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "kaustubhdharme",
        "review_rating": "1",
        "review_title": "Prem Ratan Dhan Khayo!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "Snootz",
        "review_rating": "10",
        "review_title": "Incredibly Beautiful Movie-- in Scope and Emotion",
        "review_detailed_main": "I almost didn't watch this movie due to the repetitive negative reviews here on IMDb. Usually I find reviews here fairly spot-on. But in this case I am convinced we are living in a generation of viewers who have been raised on so much schlock, sex, violence, blood and foul language that they wouldn't recognize a prime movie if it whacked them with a hammer. Either that or we have a set of the most bogus witch-hunt reviews ever.\n\nI could count the number of films I would give 10 stars and still have some toes left. This film has everything-- terrific cinematography, good acting (yes, a little hokey in places: intentionally so), a script that if one has a heart at all should bring tears to the eyes repeatedly, humorous moments, fun moments, bad decisions, sacrifice, redemption, hundreds of supporting actors, the most incredibly huge set I have ever seen in any film (they built an entire palace!) -- as well as the full gamut of drama mixed with comedy, music and dance.\n\nMany others have discussed the merits of the movie itself; they have done well enough that I don't have to re-hash. What I will focus on is the incredible number of negative reviews present here. We notice a large number of the reviews are similar or identical in writing style. That stands out very clearly-- which is highly suspect. Secondly, a large number of those reviews claim to be written from differing cities in India, yet are all in perfect, pristine English. \"Most boring movie I've ever seen.\" We see this phrase repeatedly, in almost identical words.\n\nThere are too many people giving this 7+ stars and even 10 stars (unusual to see on IMDb) to believe the legitimacy of the number of 1-star \"worst movie ever\" reviews. Such paradox is simply difficult to accept as valid.\n\nAll I know is I'm in the U.S., I and my sister watched the movie together, and we both loved it. I can be very critical of films and for sure I have seen some real stinkers in my day-- but this movie definitely is not one of them. This has song, dance, a delightful story... and touches the heart more than once. Have your hanky ready.\n\nPlease, feel free to consider the negative reviews as suspect (at the very least)-- and give this film a try. The best and most valid review is your own."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "harnoor_517",
        "review_rating": "7",
        "review_title": "Well a nice Family entertainer it is!",
        "review_detailed_main": "Isn't it actually funny the way people are just giving negative reviews about this film!? Yes Sooraj Barjatya made a film in 2015 without any kiss, without any intimate scene, minus foul language! Is this the reason that today's generation couldn't accept this movie! For me this movie has proved to be a great entertainer, one can watch with his/her family without any moment of awkwardness! Sooraj Barjatya gets the 90s effect back in this decade! Family values, love everything is back on screen after about 15-20 years! And we have Salman Khan back as Prem once again! Yes makes you laugh, makes you wanting to be as responsible as him! The Prem effect gets back on the screen after so long!Sonam Kapoor looks could, and she could have looked better if she could have acted a bit better! But yes, she delivers aptly what she could have! Swara Bhaskar, Neil Nitin Mukesh, Anupam Kher all of them have delivered a good performance!\n\nNow talking about the negative part of the movie, the movie is 2 hours and 56 mins long! Few scenes are dragged and quite a few of them weren't even required in the film! The action scenes in the end were a bit too much! But yes they were required.\n\nMusic of the film is quite average. 2 or 3 songs are good. On the whole, Prem Ratan Dhan Payo is a good (not great) family entertainer! Go watch it with your family!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "anshshr",
        "review_rating": "1",
        "review_title": "Awful...wanted to rate this movie as 0 but IMDb doesn't have it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "coolqasim123",
        "review_rating": "1",
        "review_title": "Its Rajshri worst movie",
        "review_detailed_main": "Sonam looked gorgeous and hot but acted worse, failed miserably\n\nSalman as Vijay was really bad, not convinced with his dialogue delivery. Failed to impress here\n\nWhile he's was really good as Prem Dilwala. Very sweet though it's very rare to find someone like him in today's world :P I liked him\n\nIn shesh mahal scene, they were using sword where did the gun come from?\n\nAnd one more thing, the background music was real bad. Though the direction of the scenes were beautiful, very well executed .:)\n\nThis has to be worst movie of Rajshri"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sunshine-34467",
        "review_rating": "1",
        "review_title": "total waste of time and money",
        "review_detailed_main": "Hoped they had a 0 or even minus rating!! this is also same as 'BADI DUKAAN FIKA PHAKWAN'' THE WRITER AND DIRECTOR HAD MADE THIS MOVIE WITH A PRESUMPTION THAT Indian AUDIENCE HAS AN IQ OF AN 8 YEAR OLD!!!! ONLY THERE ARE SOME REASONS TO WATCH THIS- 1. if you r not satisfied with your air conditioner at home and want to have a good sleep of 2-3 hours 2. if you have a girl friend but not a room (you know what I mean) 3. if you are fed up from your life and YOU want a killer method to kill yourself AND ALSO 'sone par suhaga'Neil the unannounced some times remains to be unannounced.I would better recommend to watch batman at home and enjoy your holidays and festival.May you not waste your holidays"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "shaktisinghmcom",
        "review_rating": "1",
        "review_title": "Totally boring movie",
        "review_detailed_main": "PRDP is let down by bad script, story and unnecessary songs. movie starts with ram leela with prem leel song. There are a string of non sense scenes giving fake look as sonam is quite a rich lady who used to land from a helicopter to distribute the essentials to flood victims. Movie is composed more of stupid songs rather than a script. 3 songs within half an hour irritates too much! Sonam's absurd acting, Neil Nitin Mukesh's show off role make you laugh.. It is simply a boring movie which does not hit the heart chords of audience. Just a wastage of time comprehensively to watch it. It was expected to be a romantic movie, but it gives completely drowsy feel. Not able to understand what makes \"prdp\" is an apt title for him."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "danny_anju",
        "review_rating": "3",
        "review_title": "A Well picturize movie for no sense - such a non sense ( in other words )",
        "review_detailed_main": "First of all to those who rated this movie very nicely I could not understand what you guys seen in this movie. There was no second thing in this film ( first being Salman Khan ),to watch. The movie has no story play or the plot to stick to the seats. I would recommend the future seekers of the movie to save their precious time. Salman with Sonam seems like Lion Cat couple, and Sonam Kapoor really didn't play well with this one. The story line was complete mixed up as the things has no logic. Even the director would be confused as what way he should give the climax of the film. A village boy started acting as a Royal Mate in matter of hours was really not a greet to watch. Sonam Kapoor wearing sunglasses all the time was much more irritating then anything. The only part movie played good is making you sleep for lovely 2 hours ( after 1 hour of watch ). Thanks"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "bilal406111",
        "review_rating": "2",
        "review_title": "Utter Boring",
        "review_detailed_main": "I expected a lot from this movie as Sooraj Barjatya and Salman khan are coming together after a gap of 16 years.But its a massive let down.Sooraj direction is really sloppy.Never expected such a bad movie from the duo.Story is also very outdated and poor.The movie is very lavish but very slow paced and boring.Acting from lead actors is average.Now Sooraj Barjatya has adapted the story from Anthony Hope's novel 'The Prisoner Of Zenda' (1894) and infused his family drama with typical song-drama routine. Master of presenting the values of Indian culture and custom on silver screen innumerable times, Sooraj Barjatya gives you a fine first half with grand opening scene of Salman Khan and introduction of each character coupled with bit humor. Till this point, the film is tolerable however the second half tumbles down the rabbit hole and refuses to pick up. The screenplay is messy with too much of things happening in quick succession and without any sensible reason. The problem is Barjatya follows the same path of his previous films ( he even borrows the sports scene from Hum Aapke Hain Koun\u0085 this time replaced by football in this one) which actually become a mockery in the end. Another issue is too many songs which is misplaced and is included in every ten minutes between the scene. The climax which should have been the highlight of the film is diluted with weak action choreography and melodrama.The movie created a lot of hype and unsurprisingly grossed 40 crores on first day but the film story failed to match its expectations.Screenplay is very poor and it is Sooraj Barjatya worst film till date. Only watch it if you are die-hard Salman fan but even Salman fans will be disappointed with this boring movie."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ravi-unadkat",
        "review_rating": "7",
        "review_title": "An outdated drama presented in grand manner, but very much likable",
        "review_detailed_main": "Let me put it this way. how do you want to spend your day; roaming around an amusement park with lots of sci-fi rides and fun which is totally techno made or would you like to roam around a beautiful garden with colorful roses and natural aroma. If your taste is natural beauty then this movie is for you.\n\nLet me put this way as well, this entire movie has less CGI compared to the trailer of Dilwale just released.\n\nIt's all natural, back to 90s were technology was not so advanced and making grand and glorious sets was only fort of Badjatya. He is indeed in that in 2015 too. Welcome to dances which has 100 dancers wearing same dress and running around in perfect rhythm with each beat. These is all pleasing to eyes. There is a freshness in air, there are less mobiles or selfies or laptops. There is a simplicity, there is an acting. there is a family.\n\nSalman Khan is the khan we have as of now. No other hero comes near him. His charisma is such strong that you will carry him with you when you leave theater. Sonam Kapoor obviously looks younger than Khan but I guess her make-up and clothes give her some age so as a pair they look very cute. And yes she is taller than him and it's evident in quite a few scenes.\n\nAnumap Kher does best, only he could have done justice to this role. However as a royal loyal guard I also felt Mr Bachhan also could have added another layer to this film.\n\nNeil Nitin Mukesh, is treated like a side-liner in this movie, it is sad to see talent like him is given such treatment. Loved him in Johny Gaddar & New York. Arman Kohli bags a good role but in entire movie he constantly gives same facial expression.\n\nRest of the characters does well to keep movie running.\n\nFew Negatives :\n\n1) Story - outdated is the only word. 2) Climax - big let down 3) Loopholes - too many and quite visible\n\nEnjoy with your family because such movies do not come every year, this should be treat to Rajshree production fans, Salman fans and also India families will love this movie.\n\nYes this movie has potential to spoil Ranbeer's next movie Tamasha which comes two weeks later, this has such a power to eat that movie's probable business.\n\nPromotion of Dilwale is also on in this movie, suddenly from the middle of the movie Prem turned into Prem Dilwale and from that point he is addressed only as Dilwale :)"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "jaymittalagain-2",
        "review_rating": "1",
        "review_title": "Ekta Kapoor's Daily Soaps on sleeping pills.",
        "review_detailed_main": "This is the most boring movie I have seen in years. What were the makers thinking? It was like watching Ekta Kapoor's serials on sleeping pills. With a little more budget and bigger star cast. The first half was slow. The ending was just pathetic. There are some illogical scenes. The football scene will insult your intelligence. Salman talks with a camel. This is only for Salman Khan fans. Sonam Kapoor is not that good. She only looks good. Barjatya makes good family movies.This was supposed to be a family movie. But it is the worst movie of Sooraj Barjatya. Watched it with my family and wasted 3 hours. Please don't waste your money on this snooze fest."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "beingraj",
        "review_rating": "10",
        "review_title": "blockbuster Jodi back again",
        "review_detailed_main": "so the blockbuster Jodi is back again . we all know that rajshree productions always have family audience in their mind while making a movie.yet again they are successful in making a good family movie . movie is well made with mix of comedy , emotion and family drama . movie is getting mix reviews as per from our critics but as per our public reviews are concerned ..they are tremendous in favour of prem ratan dhan payo . this is a story which will make every person think about their relationship with their family . Yet again sooraj barjatya showed why he is best director in family genre. the public which are giving their money to watch prem ratan dhan payo will enjoy their time in the movie theatre. so at last i wanna say don't leave the opportunity to watch such a wonderful movie at big screen ..go for it ..its a sure shot blockbuster."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "samunsuman",
        "review_rating": "6",
        "review_title": "After a long time, Salman can be seen in the double role..",
        "review_detailed_main": "The film is Salman's fourth venture with the Rajshri banner. Prior to this, the superstar has delivered three blockbusters with the Barjatyas. 'Maine Pyar Kiya', 'Hum Aapke Hain Koun!' and 'Hum Saath Saath Hain' have been complete family entertainers. And Prem Ratan Dhan Payo (PRDP) will certainly be no different.\n\nThe first half of the film is entertaining and full of fun while the second half comes with various mysteries and stories. The movie is bit longer than the normal scripts of 2 hours which make it boring many a times.\n\nThe movie is good in the beginning but goes a little faded during the middle of the movie, the end of the movie is up to expectation and very interesting.\n\nAfter a long time, Salman can be seen in the double role where his duplicate copy is a simple and a common man and the original was a king who loves his people and charitable in nature. Despite having everything with him, the king wants to lead a normal life and the contrary is, his elder brother also wants to steal out all the wealth from him. The names of Salman's Cast are Prem and Vijay respectively.\n\nThe movie was shoot on a larger scale in an obviously bigger than ever sets. One of the eye-catching parts of the movie is the royal celebrations which took place at different occasion.6.5/10"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "dineshprakash",
        "review_rating": "4",
        "review_title": "Unbalanced mixture of family emotions, action and thrill",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "laddeepesh",
        "review_rating": "1",
        "review_title": "A complete boring movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "mbchem",
        "review_rating": "1",
        "review_title": "piece of headache pa yo",
        "review_detailed_main": "Hindi cinema at it worst once again.no story no sense ..just a garage &it is also super hit.Hindi cinema is known as cheap cinema all over the world due to this kind of rubbishes.rather watch Bengali Telugu movie..rather commit suicide watching this movie.pathetic acting ,dialog everything in this movie is pathetic..live free or die-hard don't watch it.after watching BB..i was started thinking that at least salmon khan can act somewhat.most superstar movies are nonsense.they are totally focused on stardom rather than story dialog script but this movie have nothing in his cylinder. after watching this i was feeling the days of 80's when most of the movie were non sense.save yourself and avoid this kind of movie.."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rahulbit-shrivastava",
        "review_rating": "4",
        "review_title": "Outdated star-movie",
        "review_detailed_main": "Age old story mould of Rajshree. Stale dialogs teaching family values will let you clinch your fist and say arghhh... OK towards the end but is a torture most of the time. Reminds me of Hindi daily soaps.\n\nBut I will not complain this as all this could be easily seen coming in the promos. Liked it as an opportunity of family outing during festive times.\n\nDirection, i would say is expectedly usual. The movie doesn't demand much of acting from anyone, no actor is brilliant either. Salman Khan back as a demonstrator of relationship values and does well. Sets and costumes are grand, giving the feel of just-a-star movie under a big banner; highly marketed and hyped to become another top grosser."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "delhiguy_puneet",
        "review_rating": "1",
        "review_title": "Review ----Full of Spoilers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "lpkapil",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "I have tried to watch the movie. But i couldn't seriously worst movie. No good movies like old time from real actors. Remember border movie and make a movie like about our soldiers and for good causes. Movie doesn't means to entertainment always, There should be a good cause of message in movie or a real life story that can inspire peoples.\n\nI will suggest some real life cases, old age homes why we need them ? Why people live in these or why child put there parents in these homes. You can checkout and find the truth behind this and make a story and movie that will spread at least a message to everyone and a chance to change the mentality of peoples."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "vimarshmunsif",
        "review_rating": "7",
        "review_title": "Prem Ratan Dhan Payo: - An Addition To The Current Season Of Old Is Gold",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "gobindsingh",
        "review_rating": "4",
        "review_title": "A Total waste of time",
        "review_detailed_main": "I am actually not shocked to see Salman's another baseless story movie. I have seen it before. But It was a total waste of time. Before interval, it is still a little bit interesting. But after interval, this movie is bore as hell. I couldn't tolerate Sonam's overacting during romance. Salman is not made for this type of roles. And Football match scene was dumbest scene in this movie. Good to see Armaan Kohli back in action but the acting could have been better. Director could have presented Salman's role in better way. Surprised to see Sonam's and Neil Nitin Mukesh's poor acting. Overall, Don't spend money on this movie."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "chuwawah-919-385097",
        "review_rating": "10",
        "review_title": "Feeling all Loved up!",
        "review_detailed_main": "'All the darkness's that were there around me, they have all gone.. I also earned the value of all the dreams and all the relations.. I understood love... no one cared for me like you did.. when your color touched me, I became a wonder\n\nFilm: Prem Ratan Dhan Payo (Bollywood) Cast: Salman Khan, Sonam Kapoor, Neil Nitin Mukesh, Swara Bhaskar, Anupam Kher, Armaan Kohli, Deepak Dobriyal Director: Sooraj Barjatyatoo.\n\nWith what was happening outside in the world I decided I wanted to escape from the horrible reality that I woke up to and indulge myself in some of Salman Khan's motto 'Being Human' and fantasize about how the world should be.\n\nPrem Ratan Dhan Payo (PRDP) is definitely a tear jerker but are they tears of joy? This film is a case of a 'doppelgänger' - any person who physically or behaviorally resembles another person. You've guessed it 2 for the price of one! A tale with a twist - The Prince and the Pauper . One is a suave and sophisticated prince and the other is a simple, generous man. Without giving too much away I have to say I really enjoyed PRDP it was light hearted, funny, colorful, sensitive, a family film that would not offend anybody.\n\nThis film was a Royal treat not just with all the Laddoo's and Jalebi's on display due to Diwali but because of the message that was clear and to the point -Family is important , any differences should be put aside for the sake of humanity,I came out feeling all hopeful and loved up!\n\nMs Safirah Irani Twitter@Safirah63"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "pranayjalvi",
        "review_rating": "6",
        "review_title": "Rajshri has a decent work in this Salman movie",
        "review_detailed_main": "Sooraj Barjatiya-Salman khan duo has given all superhit films in 90s and after a decade they are back with PRDP. First of all, the movie starts with usual Salman's dramatic entrance. The movie had content, a little bit story but not so good acting. The movie is no doubt a family movie but would have been more better if was supported by good acting. The songs were good enough to fit in the conditions for the movie. I still don't know why Sonam was selected as the lead for the movie but however she managed to act her part anyway. The same old Salman useless dialogues, poor dance of him makes the movie a bit shabby. Overall the movie was a decent watch as It is a family entertainer. I would go with 3/5 for this new Salman starrer."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ankitjains",
        "review_rating": "1",
        "review_title": "#PremIsBack and Why????",
        "review_detailed_main": "I mean why? Thats the feeling that has been raging inside me ever since I watched this movie last night. Why make this movie? why I ever went on to watch it? Why was Anupam Kher ever there and ever agreed to do this masterpiece? there are many whys with this movie!\n\nFirst of all.. no story at all..! if only Barjatiyas have invested little time and have thought though the story, this could have been at least watch-able!\n\nsecondly the charter built up was way too poor! none of the character justified its existence.\n\nthirdly, the chemistry.. between each and every character is non- existent. Worse still, emotions, which are high points of barjatyas is severely missing through out.\n\nthen the all existent flaws.. the depiction of royal families, royal guests, royal security, its all flawed and poorly displayed... even the Royal grandeur which could have been easily shown was very shady!\n\nand who could even bear so much bad songs with all except one actually making sense (jalte diye).. all songs were placed in the movie for just placement.. no connect to story.. this is the first time i started disliking songs of a movie after watching the movie! otherwise songs were just fine!\n\nover all.. its a pathetic movie..! Pls save your money!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ebsgoa",
        "review_rating": "1",
        "review_title": "A big No for dis movie",
        "review_detailed_main": "**Dis review can be a spoiler**\n\nDue to Hype created by high promotion people turned out for movie but a bis disappointment. Bollywood is losing grip over creative movies..\n\nStop fooling us common people.\n\nActing of Salman is average whereas Sonam Kapoor acting is disaster. Please don't waste money watching dis movie as i did. I slept for second half as had no option to leave due to friends.\n\nYou can later watch dis movie on DVD. Last movie i enjoyed was Bajrangi bhaijaan which was too good.\n\nA big NO for movie."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "calldharm",
        "review_rating": "1",
        "review_title": "Nothing worse can be made with such big actors, director, production and money.",
        "review_detailed_main": "Way below expectations set up by to combination of such big guns.Bad acting, non connecting story, bad dialogue delivery, un organized story, full injustice to fans expectations and their money.Diwala on Diwali. Sonam a wrong choice. It seem like people making spoof on Internet are much entertaining than the movie. Check social media its full of bad reviews and hurting spoof. We are Bollywood fans, we have contribution in making hits like Bajangi bhaijan, HAHK. We are not spreading negativity, but are hut and expressing our concerns which is our right.\n\nWatch my full review on YouTube- HTTPS://YouTube.bb/svphXrqHMJI"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "SumanShakya",
        "review_rating": "4",
        "review_title": "Not worth the wait......",
        "review_detailed_main": "Rajhshree Productions has made a reputation of giving nice family oriented movies. The expectations were high following \"Maine Pyar Kiya,\" \"Hum Aapke Hain Koun,\" \"Vivaah,\" and \"Hum Saath Saath Hain.\" But this time the expectations haven't been met, and the film just backfires and leaves you cheated. A weak adaptation of \"The Prince and the Pauper\", the story is too dramatic which feels silly at times and way the things are resolved just highlights the weakness in story telling. The film fails to create the time period of the plot. Besides, the performances are also mediocre. Salman's role is not different than that in \"Bajrangi Bhaijan,\" with the similar diction and dialogues which becomes adequate. Actually, his characterization looks a bit tailor made and has glibness. Neil Nitin Mukesh and Sonam Kapoor are both mediocre in terms of roles and performances. Anupam Kher looks surprisingly good in his role. If there is anything to adore in the film, it's the beautiful sets and few good songs, which doesn't make the film a total let down.\n\nRating: 1 star out of 4"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "aniruddha-madduri",
        "review_rating": "1",
        "review_title": "What did I get into???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "adnanmurad-39899",
        "review_rating": "3",
        "review_title": "Barjatya's Labour of Love!",
        "review_detailed_main": "Salman-Barjatya collaboration has once again gifted a family treat to the audiences, which is both visually enticing and aesthetically pleasant. The writing of 'Prem Ratan Dhan Payo' is the real winner, which at some instances gets brisk while meanders at a point or two. Overall, it is infectious and will suck you into a traditional Barjatya realm.\n\nSalman Khan gives another performance tantamount to his brilliance in 'Bajrangi Bhaijaan'. However, Sonam Kapoor comes as the real revelation in the role of Maithili. She has less dialogues to offer but her presence is contagious. She is the walking miracle in Prem Ratan who links the family together. Stupendous!\n\nSwara Bhaskar is good as usual. Neil Nitin Mukesh is adequate in a half-baked role. Armaan Kohli seems out of place. Deepak Dobriyal is brilliant. It is Anupam Kher who stands out in the supporting cast as the well-wisher of the royal family. The veteran remains the strongest link of the movie - performance wise.\n\nMusic is pleasing to the ears. 'Prem Ratan Dhan Payo', 'Jalte Diye', 'Aaj Unse Milna Hai' and 'Jab Tum Chaho' are the best numbers that will make the audience swoon with the proceedings.\n\nOverall, Barjatya has done a fine job that is pleasing to the sensibilities of mature audiences. It is a family extravaganza that holds 'respect for elders' as its most venerable strength. Kudos!\n\nI am going with three and a half stars for this family fair that is bound to bring a smile on your face this Diwali.\n\nRating: ★★★½\n\nFull review here: http://uk.blastingnews.com/entertainment/2015/11/prem-ratan-dhan- payo-review-salman-khan-and-sonam-kapoor-s-triumph-00649631.html"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sohomp",
        "review_rating": "6",
        "review_title": "90s Movie Lovers will love it. Good for one time watch.",
        "review_detailed_main": "Prem Ratan Dhan Payo is soundly grounded in family values. You will instantly visit 90s era. Even the songs & background score will remind you of 90s. This film is like a old wine served in new bottle. Those who like 90s style of films will definitely like it.\n\nSooraj Barjatya has stayed true to his roots. Simple story told beautifully but is a bit predictable. The scale is very huge & is visually stunning.\n\nAmong all actors, Salman was best & he carried the film almost single- handedly on his shoulder. Rest were mediocre. The length & number of songs could have been shortened. The action in climax was too old- fashioned. The film is filled with a lot of loopholes, which are needed to be ignored.\n\nWill give it 3/5. Its an one time watch movie.\n\nNOTE :- Watch the film with your family and not your friends, as PRDP is best enjoyed with your entire family.\n\n(PS - ‪Dilwale‬ trailer looked so good in big screens. Even Salman was called Dilwale throughout the film.)"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "iiamakn",
        "review_rating": "1",
        "review_title": "If Bajrangi Was Salman's Best Then PRDP Would Be His WORST",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "nicutvali",
        "review_rating": "10",
        "review_title": "Best movie off all,RESPECT SALMAN KHAN,wait more movies like this one!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "monilhariya",
        "review_rating": "6",
        "review_title": "PREM RATAN DHAN PAYO (Title with Deep Meaning)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "parasphadke",
        "review_rating": "2",
        "review_title": "complete mess!",
        "review_detailed_main": "first of all i must say salman is not a very good actor !!so any flaws in his performance aren't much ringing !! .\n\nstill the movie is so crap that u eventually ask urself a question : whay am ii here in the theaaatre !!.\n\n. the film is all about a family going through problem and problem resolving affterwards.\n\n!! reminds us of 90s !! simply waste of money and waste of time !! i give 2 only for neil nitin mukesh and production and set design thats all and only watchable material in this crap!!.\n\n.. >> >> one more thing sonam kapoor has achieved new heights of overacting !!congrats to her !!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "devasisc-531-196294",
        "review_rating": "2",
        "review_title": "Copy Cat Ate A Rat... Sooraj R Barjatya.. so badly copied this movie.. no originality",
        "review_detailed_main": "Director Sooraj R. Barjatya's claim that he wrote the story of this movie is a complete hoax. He simply copied it ( very Very BADLY copied ) from a Bengali Movie - Jhinder Bandi made in 1961 (directed by Tapan Sinha ). Readers interested can look at Jhinder Bandi's storyline published in IMDb itself through the link below or can read the synopsis below.\n\nhttp://www.imdb.com/title/tt1073122/?ref_=fn_al_tt_1\n\nThe story of Jhinder Bandi is as narrated ( as available in IMDb ) - \"A person comes to meet with Gauri Shankar Roy (Uttam Kumar) living in Kolkata. He introduces himself as a 'fauji Sardar' of Jhind, Jhind being a small kingdom in Madhya Pradesh. He says that the to- be king of Jhind, Shankar Singh, is found missing from the kingdom right before his 'abhishek'(oath taking of a king) and this is apparently a conspiracy by his own brother Udit Singh, who wants the kingdom for himself. Earlier too there were two occasions when abhishek was arranged but both the times the king was found missing. Udit is a cruel hearted man, unfit to be a good king. Shankar Singh has his vices too but is a kind hearted person who would care for his citizens and is thus worthy to be the king. Now, coincidentally, Gauri has exactly the same appearance as Shankar Singh(also played by Uttam Kumar). This being the last hope, Sardar requests him to enact the role of the King for the abhishek until he finds the real king. Gauri agrees.The two set off for Jhind. Things aren't easy at the Palace in Jhind. Despite the great luxury of kingly life, Gauri is constantly threatened by Udit and his friend, the dashingly handsome but evil Mayurvahan (Soumitra Chatterjee). The abhishek however takes place successfully in the occasion of which the king is also engaged to Rani Kasturi Bai (Arundhati Devi). While the atmosphere gets more and more tensed, the life of king is at stake, there is also a blooming romance between Kasturi Bai and Gauri. A secret agent unfolds that the king is hidden in the fortress owned by Udit who will murder him as soon as he gets rid of Gauri. Sardar then reveals to Gauri in secret that Gauri deserves the throne as much as Shankar or Udit because they were all the sons of the then- Dewan of Jhind,Kali Shankar Roy. The then-king being issue less, adopted Shankar and Udit as sons. Planning a secret entry to the fortress where king was held prisoner, Gauri fights a battle with Mayurvahan, finally killing him as well as surprising and killing Udit. As he approaches his look-alike Shankar Singh, he has a momentary desire to kill the king, gaining the kingdom himself, he being as deserving by his blood as was Shankar Singh, but his humanity wins over and he approaches the king addressing him as \"Your Highness\". He then bids a last goodbye to Kasturi Bai and rides a horse, heading back to Kolkata...................\"\n\nEven Jhinder Bandi was a copy / adaptation of Anthony Hope Hawkins' novel The Prisoner of Zenda. The novel - The Prisoner of Zenda is made in to movies or TV serials for at least 10 times in English, and in to once in Bengali in 1961 ( \"Jhinder Bandi\" ).\n\nMore :\n\n1. The copy of the storyline (PRDP) was not only very weak and boring but fraught with predictability.\n\n2. Too many unmemorable songs.\n\n3. Plot Blooper - When the injured prince Vijay was kept at the secret chamber of the fort how the sophisticated life saving machines were working? Where was the electricity? Because if the power was available then why the room was illuminated through traditional flambeaus.\n\nMoral of the critique - Don't take the audience for a ride and make false claims."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "toxicrajya-84021",
        "review_rating": "2",
        "review_title": "Not Again!!!",
        "review_detailed_main": "Prem Ratan Dhan Payo is a typical Sooraj Barjatya film full of annoying songs and unbaked roles.I must say that some of the dialogues are powerful and leave an impact but most of the jokes are senseless but sometimes enjoyable.This Prem is undoubtedly the best Prem and the differentiation in both the prems is well visible.The plot is predictable and the actors appointed for the roles make it more easy for us to predict the upcoming twists.\n\nThis is a complete family drama with the lead actors doing complete justice and the supporting actors also meeting the role demands. Somewhere it may seem nonsense or you may even laugh at it. Sooraj Barjatya does sprinkle his well tried and appreciated masala in this film which works many a times.\n\nOverall,it will be a bearable experience for a family if you are used to films like Vivah,Main Prem Ki Diwani Hoon,Hum Aapke Hain Koun, etc.\n\nAt the end I'll say you may leave this movie because \"The flaws counts\"."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "giteckm",
        "review_rating": "1",
        "review_title": "Worst Movie of the year!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rajsippy",
        "review_rating": "5",
        "review_title": "good movie but story is very weak. ....",
        "review_detailed_main": "It's nice movie to watch with family but if you expect from this movie some extraordinary then you are extremely wrong, story writing is very weak by Suraj bharjatiya, only good is that Salman khan took the film to the end very neatly but except Salman all other characters acting wasn't justified by director\n\nAfter 1st Half the film's story scarterd & came to down, but if you are fan of Salman then it's must watch movie for you because his acting in the movie is very good but the problem is due to poor storyline & incidences the film failed to score, also very much songs in the film make boruge peoples, some unimportant scence very long in the movie makes interrupt pepoles, after all film is nice to enjoy as family"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "lifeloveandu",
        "review_rating": "1",
        "review_title": "Money+Time+Common sense... it eats up all of it!",
        "review_detailed_main": "A must watch if you have about 3 hours of your life to waste. Clichés are aplenty, logic has no existence in this land where this movie is set, excess of drama, emotion & hamming is set in each scene.\n\nI struggled with sleep in the first half & by the second I felt suffocated sinking deep into my chair with each extra minute spent in the theater. Sooraj Barjatya lives in the 90s & his sense of song & family time comes from an even archaic earlier era. Even though this movie strangles you with overdose of maryada & parampara & what not in name of culture & tradition, the romantic scenes between Salman & Sonam & the choice of dialogues makes you wonder if there is a hint of softporn... all in all, an utterly unrealistic, non sensical, over- hyped movie which takes you in a world of illogical & irrational people where crying for two minutes can absolve you of all your sins.\n\nMore than the money, I want my time & sanity back :("
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "agnihotribhaskar",
        "review_rating": "6",
        "review_title": "Sorry Not Impressed....",
        "review_detailed_main": "I have been a fan of Rajshri Films long before Salman Khan and Sooraj Barjatya made their debut in 1989 blockbuster Maine Pyar Kiya.I have witnessed the growth of Sooraj Barjatya and unfortunately after Hum Apke Hain Kaun he seems to be loosing his Midas touch.Most of his films after HAHK have been struck in a time wrap as the stories and treatment have not been done according to the present times.Vivaah was more bearable as it had some good music but PRDP lacks vision,story,treatment and memorable songs Rajshri's have been famous for.The story and screenplay was so ordinary that at times it seemed as if we were watching a film from the 60s.Sooraj Barjatya and Salman Khan have a cult following which may bail out this expensive movie from Rajshri but it is not a patch on their previous works.The chemistry between Sonam Kapoor and Salman Khan was totally missing and I really fail to understand the reason of casting her.I hope Sooraj Barjatya works on his stories more carefully and makes a film in a couple of years before the audience totally rejects and forgets his kind of cinema."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "silvan-desouza",
        "review_rating": "3",
        "review_title": "Old Wine in New Bottle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "qazibasit",
        "review_rating": "10",
        "review_title": "Above average fantasy movie with family politics and values",
        "review_detailed_main": "Well it is easily visible after Sonam's \"abhi tu party shrooh hoi hai\" she is comfortable in the fantasy world where she like to portray as ordinary.\n\nI actually liked the movie for many reasons, the colors were pretty, sets were amazing, story is a common one but it is always good to see different actors playing the same part. Salman's innocence in prem dil wala was too unnatural. Sonam Kapoors acting is getting mature, even in front of a big star like Salman Khan she was acting between the lines.\n\nCinematography was amazing, but then again so many unwanted scenes, instead of which there could be some added drama.\n\nIn summary whatever the downs of this movie are, Saloo bhai is always entertaining and I always loved watching his movies. I like the end after so much efforts finally the prem got the mahrani. Sometimes it feels good to be lost in fantasies. This is one such movie."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ishiffa",
        "review_rating": "7",
        "review_title": "One that should be watched in theaters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "vronpc",
        "review_rating": "3",
        "review_title": "The movie is about how to waste our money and time in cinemas.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "asfandkhaliq",
        "review_rating": "1",
        "review_title": "Seriously Skip that please",
        "review_detailed_main": "What the hell was that Sonam Kapoor was bad and rest of the cast had no role. Music, acting, story, direction everything failed in this movie. Family movie doesn't have to be illogical, long and boring. This is one of the worst movie I have ever seen in my life. Villain of this movie looks joker and they hardly have any role. Choreographer have come up with such pathetic dance step that no student should ever watch it. Music is unbearable and old. This movie is late by 100 century. Completely avoid this movie and save your money . WhAT was that seriously is that the standard left of India i think they are getting more immature with the passage of time and Salomon khan should see himself what is he doing with his career."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "saqlainaali",
        "review_rating": "4",
        "review_title": "Its a rotten fruit served on a gold plate with gold spoon.!!",
        "review_detailed_main": "Starting with story,it was boring and very simple.There was nothing new,just old Sooraj Barjatiya kind of movie.Acting is worse by everyone. (leaving Swara Bhaskar)It is a very outdated and stupid to be made movie.I cannot understand how could someone make this kind of movie.Sooraj Barjatiya needs to understand that its not 90s and that we are in 21st century.Leave 90s or 21st century,this movie would have been worse at 90s also. This movie will earn only due to Salman Khan and nothing else.There is not much to say about it but i should just say that its a waste of your time and money.It will give you a very bad headache.So please don't watch it,please."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "devasisc",
        "review_rating": "2",
        "review_title": "Copy Cat Ate A Rat...",
        "review_detailed_main": "Salman Khan's Prem Ratan Dhan Payo (PRDP) is a COPY. A very bad COPY.\n\nDirector Sooraj R. Barjatya's claim that he wrote the story is a complete hoax. He simply copied it from a Bengali Movie - Jhinder Bandi made in 1961 (directed by Tapan Sinha ). Readers interested can look at Jhinder Bandi's storyline published in IMDb itself through the link below or can read the synopsis below.\n\nhttp://www.imdb.com/title/tt1073122/?ref_=fn_al_tt_1\n\nThe story of Jhinder Bandi is as below ( as available in IMDb ) - \"A person comes to meet with Gauri Shankar Roy (Uttam Kumar) living in Kolkata. He introduces himself as a 'fauji Sardar' of Jhind, Jhind being a small kingdom in Madhya Pradesh. He says that the to- be king of Jhind, Shankar Singh, is found missing from the kingdom right before his 'abhishek'(oath taking of a king) and this is apparently a conspiracy by his own brother Udit Singh, who wants the kingdom for himself. Earlier too there were two occasions when abhishek was arranged but both the times the king was found missing. Udit is a cruel hearted man, unfit to be a good king. Shankar Singh has his vices too but is a kind hearted person who would care for his citizens and is thus worthy to be the king. Now, coincidentally, Gauri has exactly the same appearance as Shankar Singh(also played by Uttam Kumar). This being the last hope, Sardar requests him to enact the role of the King for the abhishek until he finds the real king. Gauri agrees.The two set off for Jhind. Things aren't easy at the Palace in Jhind. Despite the great luxury of kingly life, Gauri is constantly threatened by Udit and his friend, the dashingly handsome but evil Mayurvahan (Soumitra Chatterjee). The abhishek however takes place successfully in the occasion of which the king is also engaged to Rani Kasturi Bai (Arundhati Devi). While the atmosphere gets more and more tensed, the life of king is at stake, there is also a blooming romance between Kasturi Bai and Gauri. A secret agent unfolds that the king is hidden in the fortress owned by Udit who will murder him as soon as he gets rid of Gauri. Sardar then reveals to Gauri in secret that Gauri deserves the throne as much as Shankar or Udit because they were all the sons of the then- Dewan of Jhind,Kali Shankar Roy. The then-king being issue less, adopted Shankar and Udit as sons. Planning a secret entry to the fortress where king was held prisoner, Gauri fights a battle with Mayurvahan, finally killing him as well as surprising and killing Udit. As he approaches his look-alike Shankar Singh, he has a momentary desire to kill the king, gaining the kingdom himself, he being as deserving by his blood as was Shankar Singh, but his humanity wins over and he approaches the king addressing him as \"Your Highness\". He then bids a last goodbye to Kasturi Bai and rides a horse, heading back to Kolkata...................\"\n\nEven Jhinder Bandi was a copy / adaptation of Anthony Hope Hawkins' novel The Prisoner of Zenda. The novel - The Prisoner of Zenda is made in to movies or TV serials for at least 10 times in English, and in to a Bengali movie by celebrated director Tapan Sinha in Bangali in 1961 ( \"Jhinder Bandi\" ).\n\nMore :\n\n1. The copy of the storyline (PRDP) was not only very weak and boring but fraught with predictability.\n\n2. Too many unmemorable songs.\n\n3. Plot Blooper - When the injured prince Vijay was kept at the secret chamber of the fort how the sophisticated life saving machines were working? Where was the electricity? Because if the power was available then why the room was illuminated through traditional flam-beaus.\n\nMoral of the critique - Don't take the audience for a ride and make false claims."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ashu-rulez",
        "review_rating": "1",
        "review_title": "Horrible...wasted opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "soumyakants",
        "review_rating": "4",
        "review_title": "Double Salman but not double the fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ichowdhury-05026",
        "review_rating": "7",
        "review_title": "It's not that bad",
        "review_detailed_main": "The social media has made a mess of this film but in reality its not that bad. Although there are quite a few crappy songs which lowers the tempo of the movie but still worth watching. A bit boring during the start of second half but overall a good story. Specially there is a sword fighting scene between Salman and Niel Nitin Mukesh which is beautifully choreographed. The film has a bit of twist which is really good but I m not spoiling your experience. So overall you get good romantic drama filled with some action. If your family is getting bored, then buy tickets of PRDP. A complete family film. The ending of the film is on happy note. If the film length was a bit less then it would have been more enjoying. Never mind its a good flick."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "shahannoorani",
        "review_rating": "2",
        "review_title": "Not The Sooraj Barjatya Type of Movie We Have Come to Love and Cherish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "misbaur",
        "review_rating": "10",
        "review_title": "Masterpiece from sooraj n Salman. SALMAN KHAN is on another level right now",
        "review_detailed_main": "One of the best movies I've seen so far this, Salman Khan was just outstanding, top performance from him. He's at his best once again. Sonam was so pretty, 👌👌👌 acted really well. Really recommend to everyone who want to see a clean movie Others are pretty good too, The chemistry between salman n sonam was something else, totally loved it. There were some fun moments with salman, anu(virgin) lol n deepak which was lovely songs are good as well Watch it with family, bet you'll love it. Overall it was fun ride with some beautiful emotional moments at the end which will move you for sure. The massage you get from the movie we should not forget in life. Have a beautiful day people 😊 Keep smiling And go for the movie"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "yajurkochhar-156-94138",
        "review_rating": "6",
        "review_title": "Salman saves another sinking ship..",
        "review_detailed_main": "Over and over again, Salman Khan has to step in and rescue his big budget movies. Prem Ratan Dhan Payo (PRDP) is no different!\n\nThe movie, which runs for a painful 175 Min's has done the same mistake most of the family drama movies do. Too many songs, predictable twist and turns and a lackluster performance by the supporting cast.\n\nHowever, its the films hero 'Prem Dilwala' that pulls out this ship for drowning and makes you smile (and even cry!) every time he comes on the screen. Witty dialogues, some well-written emotional scenes and the typical Salman style makes PRDP a watchable affair.\n\nGo watch it .. not for Sanskaar.. but for Salman!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rajatbiswal",
        "review_rating": "1",
        "review_title": "Terrible movie by Salman Khan & his team",
        "review_detailed_main": "Such a worst movie. Seems like they didn't get a better story now. Investing a lot on other sides, while not investing a good amount on story is too bad. Wasted a lot of time & money for watching this movie. Did a large mistake to watch the movie before checking IMDb reviews. This movie doesn't even deserve 10 lines of review. This is a lame copy of The Prisoner of Zenda. This is another 3rd class movie by so called Salman. We need to replace people from south India for Bollywood movies. I'm saying as I'm from east not from south. I like Bahuballi like movies. I am also not surprised that the movie has made 150+ crore, because like any other person i also went to the movie due to some paid reviews."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "Yasmin_07",
        "review_rating": "2",
        "review_title": "Good music. Awful story",
        "review_detailed_main": "I thoroughly enjoyed the music and was so happy when the soundtrack was released. However the story was a joke. Why is Bollywood pushing their agenda onto the masses? Why do they promote ageism against females? It has been 2 decades since Hum apke hain koun, the legendary classic! Why couldn't salman act with Madhuri or a female HIS age? Is it too hard to do that? These people who are at the top of these industries know nothing about what movie goers want.\n\nWe want realistic love with no ulterior motives. Salman looked like the creepy uncle who returned for a child bride in my opinion (and of many other's). The movie is so overrated. Sonam herself doesn't even have any talent nor can she make expressions. It is hard to watch properly.\n\nFor once I though Bollywood was going to give people what they wanted by returning to better stories, music and putting people of the same age together. The music is lovely and I will continue to listen to it. But I would NOT recommend this movie because it is stale. It seems like Salman is acting with someone younger every year (oops I forgot the creepy school girl relationship he had in lucky no time for love) while the actresses fade out.\n\nBollywood really needs to change how they work. Hollywood too."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "abhinavgr",
        "review_rating": "2",
        "review_title": "Too Boring",
        "review_detailed_main": "Prem ratan Dhan payo is another movie of Salman khan which is quite similar to his earlier movies. Director Sooraj has same story line and same songs. The character just differ a bit. Definitely not excited for this movie. Sonam doesn't add anything up for this movie. Too boring. The trailer looks like from the 90's.Talking about the film The entire concept of the movie is again the same double role movie, salman khan acting is the best and sonam kappor oh my god I mean how do people take such actress in the movie no expression at all , anupam kher was the other actor because of which the film was watchable.but overall i can say the movie is not a paisa vasool."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "spipalia",
        "review_rating": "4",
        "review_title": "Waste of time",
        "review_detailed_main": "Story line could have been much better, ending was horribly rushed. Some scenes were good, but nothing that we haven't seen before. I wouldn't mind paying ridiculous amounts for drinks and popcorn they sell there, had it been a good enough movie. I feel bad about wasting money on the movie and pay ridiculous pricing on popcorn and drinks, would like a refund please, thanks for wasting my marriage anniversary and Diwali!! I hope Salman makes better movies than this next time. Apart from songs there is not much in this movie worth watching. Learn from the South Indian Industry, go and watch Bahubali instead. Much better than wasting money on this."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "anubhavduttamusic",
        "review_rating": "3",
        "review_title": "Garbage",
        "review_detailed_main": "A totally waste of time. Every 10-15 minutes, songs are played which continue for next 5-7 minutes and even the songs aren't good at all. There is no .Unwatchable movie. Even the message they wish to spread is not conveyed the way it should have been. There aren't any good . Acting work is nothing exceptional. However, the shooting sets are beautiful and expensive. I suggest do not go for this movie. After a Superb movie, Salman Khan decided to do this disappointing movie. Story is unrealistic. The Fighting and action scenes which are Salman's signature are not much exciting. Sonam Kapoor's work is quite unsatisfactory. None of the sings are good."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rahulmailsonix",
        "review_rating": "3",
        "review_title": "This time, it's boring also. And highly patriarchal. And lame.",
        "review_detailed_main": "Salman Khan movies might have been lame, they might have been dumb, but one thing they never were, boring. This time, it bigger, sweeter, and a new low even by 'bhai' standards, plainly boring, to the point of being irritating.\n\nI have personally loved Rajshri's brand of cinema, especially the 90's decade, which more or less established Salman as the noble, humble, heartthrob 'Prem'- on the shoulders of Sooraj Barjatya. They single handedly set marriage trends – whether it be musical chairs, long lavish melodious premarriage celebrations in Hum Apke Hain Kaun, or be it ladies 'sangeet' introducing family members in bollywood style in Huma Saath Saath Hain, while being inclusive and politically correct. But they were always enriched with beautiful songs, brilliant supporting cast, a believable story and decent A- stars.\n\nSooraj and his Salman-Prem should have worked again. Prem should have been back. Legally and critically. At nearly 3 hours of lecturing about various topics – brother-sister relationship, property settlement, a football match between men in kurtas and women in sarees – with not a single whistle-podu moment or digestible one-liner, this was unbearable. The only appreciable thing I can find is the set and art-direction.\n\nWhile Sooraj Barjatya stayed ahead of his times, assimilating the will of the youth and traditions of the established during his outing in the last 2 decades, his recent films don't have that charm that invites you to watch them again. I can watch Maine Pyaar Kiya again and again; Hum Apke Hain Kaun is still a staple on Diwali every year on TV. But the rigidity on traditions, and political correctness make it plainly unbearable (along with the irritating lyrics – aayo, paayo, laayo b#$).\n\nNevertheless, Bhai, just like his characters on-screen, is never wrong."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sanjubhat",
        "review_rating": "6",
        "review_title": "A Salman film all the way !!",
        "review_detailed_main": "Salman Khan and Sooraj Barjatya coming together after over two decades should have definitely been a momentous occasion for all fans but unfortunately it is not. The film is not bad but there is something missing as compared to the earlier Barjatya movies like Maine Pyar Kiya and Hum Aapke Hain Kaun.\n\nStory: Prem Ratan Dhan Payo (PRDP) has a simple plot and tells the story of a royal family, family feuds, power struggle among siblings, illegitimate children fathered by kings etc.\n\nThe film has Salman Khan in a double role, which should certainly enhance its box office collections since you get 2 Salman's for the price of one (we could have done with a third one too if the plot had permitted !!!! )\n\nIn one of his two roles, Salman is a Ramleela actor who, along with a friend (Deepak Dobriyal), finds himself in the middle of a plot to eliminate a righteous prince (also played by Salman) who is days away from his coronation. The would-be king has enemies in the palace. So a trusted minister (Anupam Kher) hatches a plot to save him by installing a lookalike in his place.\n\nThe efforts put in by the lookalike in order to bring together the real prince's estranged family comprising of brother Neil Nitin Mukesh, 2 step sisters and his beautiful fiancée , Sonam Kapoor forms the crux of the plot.\n\nCast: Salman plays both the roles earnestly namely: 1)Ramleela actor, Prem Dilwale who provides the much required comic relief in the film with his witty one-liners. 2)The righteous Prince Vijay who suffers a vicious attack on his life just days before his coronation.\n\nSonam Kapoor: Looks great as she always does. Decent job done.\n\nNeil Nitin Mukesh: Looks great as the prince's estranged brother, but there are very few scenes where he can actually show his acting prowess. His role has either suffered at the editing table or it hasn't been properly etched out.\n\nArman Kohli: Looks great for a change as the antagonist, but again like Neil Nitin Mukesh, does not have a role which can create an impact.\n\nRest of the cast namely Anupam Kher, Swara Bhaskar, Deepak Dobriyal and others do a decent job. Sanskari Babuji (Alok Nath is sorely missed in the film!!)\n\nSongs: Too many of them in the film, apart from the lead number, all others are passable.\n\nDirection: Barjatya does a good job but has to remain in tune with the times as plot is stale and seems dated especially with scenes like the Price traveling on a horse carriage and the princess traveling in an ordinary train. VFX is used to create a magnificent Sheesh-Mahal at the edge of a menacing waterfall.\n\nYou have to give him credit though for the tasteful recreation of Rajasthan's royalty which is enhanced by the great locales.\n\nSee this movie if :\n\n1) you are a die hard Salman Khan fan\n\n2) a true Sooraj Barjatya fan\n\n3) Dimaag baju main rakhkar picture dekhne ki aadat hai. A normal trait seen among Salman fans .\n\nMy Verdict :\n\n3 Stars ( 2 and a half for the movie and an additional half star for Prem Dilwale's earnestness)"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "pujanano",
        "review_rating": "1",
        "review_title": "Wyak acting of Sonam Kapoor. I don't feel like to watch it.",
        "review_detailed_main": "Sonam Kapoor don't know acting it makes me to puke."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "pori-61738",
        "review_rating": "10",
        "review_title": "Excellent movie!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "w-55185",
        "review_rating": "7",
        "review_title": "Not your typical Sooraj Barjatya Salman Khan film",
        "review_detailed_main": "I went to watch this film on Diwali as it is a tradition to do so in my family. I must have watched the songs and seen the trailer 10-15 times as well as all the promotional videos by the actors before walking into the theater. Having said all that, I did not have a very high expectation of this film as I did for Hum Aapke Hain Koun and Hum Saath Saath Hain (which both lived up to them). The film is watchable for sure and having it release on Diwali really helps as you are in family mode and craving a nice family film which it is. The songs are nice, cinematography is wonderful, acting is overdone, sets are elaborate, and the storyline is missing. Sooraj Barjatya still pulls it off because he has Salman Khan.. any other actor could not pull 3 hours of poor acting off like Salman. Overall I liked it and I have seen every SB film with Salman and think this is one that you get your monies worth if you go when it is half price."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "vasanivrajgopal",
        "review_rating": "4",
        "review_title": "Rajshri film if u love their taste then you will like it's not that bad like people are trolling.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "praveendpt",
        "review_rating": "1",
        "review_title": "Writing a review is favour on selmon",
        "review_detailed_main": "People should be given compensation to watch this movie. This another proof that ' leave ur brain outside the theatre before watching selmons movie.😂😂😂"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "bkvora",
        "review_rating": "2",
        "review_title": "Worst Acting",
        "review_detailed_main": "This is one of the worst actings of Salman Khan and Sonam. For that matter I think Sonam cannot act at all and no expressions.\n\nI am a fan of Bharjatiya films but was disappointed with this one."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sharmaas",
        "review_rating": "1",
        "review_title": "Hindi television series ka movie adaptation",
        "review_detailed_main": "Film is overdramatic,loose script,cantain annoing song. Movie much look like SAS bahu serials. Sooraj Barjatya should stop making movie like this in time of era"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "hardik0117",
        "review_rating": "1",
        "review_title": "THIS IS THE WORST MOVIE EVER MADE",
        "review_detailed_main": "Shouldn't have even bothered to go on a free ticket.\n\nStory - HORRIBLE Acting - They did their best Dialogue - STUPEFYING\n\nAll in all, I lost 3 hours of my life to this garbage"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "chrishna-83467",
        "review_rating": "1",
        "review_title": "This is the worst movie",
        "review_detailed_main": "This is the worst movie, every actors are doing over acting specially Salman khan"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "aksg-92877",
        "review_rating": "7",
        "review_title": "AWESOME DIWALI FAMILY VENTURE FROM CINEMA",
        "review_detailed_main": "Salman khan and all stars had doing well ,sonam is killer,nil is awsm badass,armaan cool, visuals and music fav those diwali time.firecracker at box office ..favourite movie of 2015"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "heetvarma",
        "review_rating": "1",
        "review_title": "WHY ????",
        "review_detailed_main": "The movie is so bad and torturing that it feels like the IQ of makers is less than the room temperature."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "arora-pawan1",
        "review_rating": "10",
        "review_title": "Sooraj Barjatya - Salman Khan The Perfect Combination.",
        "review_detailed_main": "The Movie, unlike any other Sooraj Barjatya Movie gives Something Different than any other Bollywood movie.....Family, Emotions, Ups-Downs, Togetherness and PREM ;)\n\nSalman Khan is Always at his best and his movies Keeps on getting better one by one, He can make even a bad story fun by his presence and here we had a Great one\n\nSonam Kapoor show's perfect image of herself as a Princess\n\nTalent's like Swara Bhaskar, Anupam Kher, Deepak Dobriyal, Armaan Kohli, Niel Nitin Mukesh also made gave a good Charisma over their roles throughout the movie\n\nDon't Know what Critics are gonna say but one thing is sure, This Movie Gonna Touch Heart of Audience and Break Records.\n\nPREM IS BACK....!!!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "Okabe_yagami",
        "review_rating": "1",
        "review_title": "Salman khan chappri fans",
        "review_detailed_main": "This is worst film . No story , bad acting by wort actors( salman khan &sonam kapoor ) whoever giving this movie more than 3 stars really need to go mental hospital . Salman khan chhapri /rickshawala fans make this movie hit"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "nikinusa",
        "review_rating": "1",
        "review_title": "Garbage!!!!",
        "review_detailed_main": "Not worth a watch.....surprised mr. Barjatya same up with this kind of a story line and then usual over acting of Salman....."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rishis-28921",
        "review_rating": "1",
        "review_title": "If you wants to see why some people hate Indian films, watch this.",
        "review_detailed_main": "Some movies are so bad they are funny and thus in a weird way entertaining. Birdemic is one of these films.\n\nOthers are so bad they want to make you cry and vomit at the same time. Prem Ratan Dhan Payo is one of these films.\n\nA motto of Bollywood is \"Wholesome Family Entertainment\". This film tries so so so hard to be that, but fails so spectacularly, with every cliché, bad joke, ultra-soppy ending, ridiculous music, sweaty camera angles, the 'whoOPS!' sound effect whenever someone slips up, a Heroic Hero and a Damsel In Distress, evil villains and the prevailing theme of Love. The hero of the film is literally named Prem (Love in Hindi). CRINGE.\n\nIt's pretty much a 2 and a half our long soap opera with plots and settings which don't even make sense (\"There's a Prince in 21st century India\", \"Salman Khan plays two separate roles\" \"People break into song and dance for no reason at this point\"). Khan is a bad actor as it is: we don't need to magnify that by giving him two roles to play. And Sonam Kapoor is just a more S**t Priyanka Chopra with half the acting talent (if you can imagine such a thing). Her sole purpose is to stand there and let the airbrushing department do their work.\n\nI can see very clearly why for some people this will be the last Hindi film they will ever see. Personally, I hope that they make a Redux version with an extra 15 minutes in which all the characters kill themselves, because by the end of this movie I was waiting for sweet sweet death to come and take me away."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "amitjodha99",
        "review_rating": "5",
        "review_title": "Its imperfect, but a necessity of current time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "chouhan-69924",
        "review_rating": "1",
        "review_title": "Boring like old serial",
        "review_detailed_main": "Overacting... Boring.. Poor story..... And poor graphics..... People think families coming for watching this 3rd class movie.. Now way time is change... Need some strong actors and strong story.."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "akshay-ak-kumar",
        "review_rating": "5",
        "review_title": "Too Long and Too Sweet !!",
        "review_detailed_main": "Sooraj Barjatya and Ekta Kapoor are two sides of one coin. Where Barjatya's movies have all lovable and caring characters barring one bad guy, Ekta Kapoor is exactly opposite. One good character and the rest scheming. There is no grey in their world.\n\nSo PRDP is one too sweet and too long film. Barjatya creates one fictional world which is not reality. Thats fine but he tends to over do it. And this time, he gets Salman with him with whom he gave monstrous hits a few decades back.\n\nThe movie is remake of a English book called 'The Prisoner of Zenda' and could have been a decent film had Barjatya not sugar coated it and let the editor did his job. The film is at least half hour too long. To make matters worse, baring one or two songs, none are melodious and that slows down the film. HAHK worked because of its melodious songs but here it falls flat.\n\nSalman is in fine form and is comfortable playing the double role of a Prince and a commoner. And he under plays it well and rarely goes over the top. However his fans must be disappointed because of the staple of comedy action films he has feed us up with. I would also blame Barjatya here for not using Salman's comic timing to use. He and Deepak Dobriyal would have lit the screen on fire with their comic timing something similar to Salman and Nawazuddin in Bajrangi Bhaijaan.\n\nSonam is again disappointing. She lacks the innocence of Bhagyashree and Amrita Rao, the maturity of Tabu and Sonali Bendre and the playfulness of Karishma Kapoor. And I don't want her to compare with Madhuri because I'll be committing a crime by doing so. And worse, she cannot create her own brand of a Barjatya heroine.\n\nAnupam Kher, Doobriyal, Niel Mukesh and Swara Bhaskar do well in their roles though Neil starts to ham a bit. And Arman Kohli is good as the villain.\n\nFinally, Salman saves the day but Mr. Barjatya, please change the style before its too late."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "Puroo",
        "review_rating": "3",
        "review_title": "I wasn't even expecting anything and yet I'm disappointed",
        "review_detailed_main": "Let's make this absolutely clear. I hate Sooraj Barjatya. He's the reason why family gatherings look so campy. And just when we were relieved we shall never have to see his atrocious movies again, he struck back with this. THIS! And no, he didn't even maintain that level. He stooped it even lower.\n\nEverything about this movie is bad. Just straight up bad. Salman Khan looks ugly, the dialogues are atrocious, the story is poor, the acting is terrible, the music brings tears to my eyes (because I can't stand the torture), the visuals are unoriginal. I have no idea how on earth does this movie have a higher budget than Baahubali.\n\nAnd of course there are the fillers. Because it's a Sooraj Barjatya movie. How can we not have Salman Khan playing football with all the guests who are divided in the teams of men and women? And there's literally a song in which Salman Khan is singing whether he should take spinach for the princess or carrots. I literally rolled my eyes when that song played.\n\nThe only good thing about this movie is Neil Nitin Mukesh. And you know how bad your film has to be when he's the best thing about it. If this film wasn't free on Hotstar I'd have never watched it. After Bajrangi Bhaijaan this was a huge letdown. I'd say skip it."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "thakkerdhawal",
        "review_rating": "10",
        "review_title": "Touches various type of relationship",
        "review_detailed_main": "It touches various type of relationship - brother and sister, employee and employers, husband and wife, humanity - with love, kindness and feel to share.\n\nOne would only appreciate the film if they appreciate relationship in their life and if you are not one of them then don't waste your time. Also, one would only appreciate relationship if they are contained.\n\nFilm also offers beautiful unique settings, colorful and amazing styles ....\n\nIn all its a good movie.\n\nI have to say salman has changed his theme on movie selection for better and is helping him to bring out best of him and portraits him as much better person which he is."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ahsanulaudri",
        "review_rating": "2",
        "review_title": "awful!!!!",
        "review_detailed_main": "I should have given 0, but 2 for only lovely Sonam Kapoor"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "aratip",
        "review_rating": "1",
        "review_title": "Yuck!",
        "review_detailed_main": "Worst movie. Old man Salman Khan romancing nepo actress Sonam.."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rehmaanfatahu",
        "review_rating": "4",
        "review_title": "One of the worst movie in Salman Khan's career",
        "review_detailed_main": "I just watch PRDP, The movie was good to an extent but if you watch the movie as an overall, it was kind of disappointing and it was a terrible movie. It was Bakwaas (nonsense) and illogical movie. The direction wasn't so great. Especially the story, I was expecting something else, I wasn't expected a full at drama movie. Normally when you watch the movie, you get more appealing and more attractive and interested to watch the rest of the movie. You know like you get attracted, OK we get excited to watch the movie. But I wasn't feeling that at all in this one. The plus point and the good parts of the film is the cinematography, I was very well shot and they spend a lot of time for the money and the locations. Another good part is Salman Khan, so Salman Khan did a great job. As you could see that he's playing a dual role, one is a prince and the other is an lover and romantic person. He was excellent in this film. And the Sonam Kapoor is good, she was superb, her acting was good, she playing almost like a princess and lover in this film. The character was well design, There are some portions, they was showing her side that it was not believable which means like you felt like OK she is not actually a princess. She's like a shy and innocent person. So they could have done a bit better characterization for Sonam Kapoor. The negative parts and the mindless point is the story, the story is a big big letdown, it spoiled with too much drama, there is too much drama in this movie. Especially the first half was boring, towards the second half could have been better, again there is too much emotional in this film. It makes you boring and sleep all the time. You don't get captivating to watch this movie. The emotional sequence doesn't work at all, it was not well made and it did not fulfilled in this film. Towards the climax, where they was an action sequence, that's totally unnecessary, they need to cut that scene, its just dragging the movie even more. The only thing which I like is the football sequence and the music. The football scene where they was an song was funny and hilarious. It was very well done. And the music by Himesh Reshammiya was also good, there are some songs was very good and some songs was OK. With the family audiences, i think they felt like boring and tired to watch this movie. For me, when I watch the movie, I was so bored at theaters, I was like let's finished the movie very quick. Because it was just draggy. So the story could have been a lot better to get interesting to watch the movie. I heard that it has a big budget movie as well because of the VFX was terrible and so poor. It has a poor execution. I don't know there is something wrong or it's because of the post production and we don't able to see the vision of Sooraj Barjatya. This is turned out to be the mistake of Sooraj Barjatya did. He hasn't recreate the magic of classic films like Maine Pyar Kiya, Hum Aapke Hain Koun and Hum Saath Saath Hain. Even i was expecting a much more fascinating and much more captivating story line. But it was not there in this film, it was missing. the film could have been the biggest romantic film ever but overall, PRDP is basic movie. There is nothing special in this movie. You guys can watch this film with your family without expectations. But in my opinion, its one time watch movie that's gonna come out probably 1 or 2 or 3 years. Its very hard to writing the story and executed the film. We should appreciated their effort at least this movie but even through the story was not appealing to me and the family audiences. We should encourage them to make such a movie with different story. Even through Sooraj Barjatya spend a lot of time to write the story and post production, just trying your best to make a big movie and better story line."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "shivamt25",
        "review_rating": "3",
        "review_title": "Big mistake is what it is!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "maniac-56086",
        "review_rating": "1",
        "review_title": "Waste of time!",
        "review_detailed_main": "Have no words to describe this garbage. Save your time. Take a nap."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "faleshdewangan",
        "review_rating": "1",
        "review_title": "1* rating for Swara",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "london-fanboy",
        "review_rating": "5",
        "review_title": "Salman gets his 'Prestige' back",
        "review_detailed_main": "As the folklore goes, Salman Khan was so impressed with The Prestige that he gave its DVD to Sanjay Leela Bhansali(SLB) in the hope that SLB would cast him in its remake. Well, SLB made Guzaarish - which was a pretty lame adaptation of The Prestige and didn't cast Salman in it.\n\nSo angered was Salman by this insult that he publicly announced that 'Koi Kutta bhi Guzaarish dekhne nahin gaya'.\n\nAt the same time Salman kept his hopes alive. Though with Dhoom 3, Aaamir khan also stole some bits from The Prestige. With PRDP, Salman hit the jackpot. Although, not a copy of The Prestige, Salman stole the double role bit.\n\nSonam Kapoor is another actress who hasn't had a lot of luck with SLB after her debut with him in Saanwariya. For both Salman and Sonam, it was their last movie with SLB.\n\nAnother thing to be noted about Dhoom 3 and PRDP is that in both the movies, audience came to know about the secret about the double role pretty soon. Quite unlike The Prestige where the audience had to wait almost till the end.\n\nLast observation is that it's the second time Salman Khan has turned Rajput Savior in a movie, first one being Veer. On the other hand, Aamir Khan loves to play a Rajput."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "zeeby",
        "review_rating": "10",
        "review_title": "Good Movie",
        "review_detailed_main": "This movie is good but not as good as the previous Sooraj barjatya movies, I have seen bad reviews of this movie but to be honest this movie is an entertainer, I mean sometimes you have watch a movie like this as you won't get HAHK every time, I really enjoyed this movie, the good thing about this film was the background score as it was heart touching, the character wer superb even thought we did see deepak all the time as he is a character and a half, the story line we have seen before but the way the have shot the movie it's fantastic, as far as I know Vivah was better than Prem ratan as it had more depth in the storyline, Arman kohli was fantastic but his role was not as big as I expected, this movie was titled Bade Bhaiyya but was then changed as Sooraj wanted a long title, Maine pyar kiya was a great movie after HAHK then HSSH, the only flop movie for Sooraj was MPKD"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "arjunkapadiasanju",
        "review_rating": "1",
        "review_title": "TERRIBLE",
        "review_detailed_main": "One of the worst movies of 2015. Just disappointed."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "kumaravinashkumaravinash",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "This is the worst movie ever...after watching this I stopped watching bollywood movie.."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "moviebuff-13663",
        "review_rating": "2",
        "review_title": "poor acting ... poorer script!",
        "review_detailed_main": "Bollywood mediocrity is alive and well ... acting (lack of it) of Sonam Kapoor is very disappointing to say the least."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "bobbysing",
        "review_rating": "4",
        "review_title": "Wasn't expecting such a weak and badly written film from the reputed makers.",
        "review_detailed_main": "Strangely, what Sooraj delivers in his much talked about and awaited PREM RATAN DHAN PAYO after a gap of nine years, turns out to be nothing even comparable to his cult films, straight away reminding you of the two mistakes made in the past as HUM SAATH SAATH HAIN and MAIN PREM KI DIWANI HOON, clearly indicating towards no lessons learned from their big failures at all in a highly ignorant and casual manner.\n\nGiving you the clear picture, nothing works in this latest venture of Rajshri-Sooraj-Salman, nothing whatsoever\u0085\u0085except the man\u0085 Salman Khan, taking two steps backward from his last mega-hit BAJRANGI BHAIJAAN. The film neither has some great characterizations in its shockingly routine screenplay, nor any memorable well written sequences or simplistic dialogues continuing the tradition started by MAINE PYAR KIYA. Above all in PREM RATAN DHAN PAYO, the team comes up with such pathetically overused, clichéd storyline that makes you wonder that how confidently they keep on making films on the same stories again & again assuming the people to be dumb enough to keep on accepting them year after year with closed eyes without any complains as such. Yes, at times even the same stories become hugely entertaining due to the writer/director's exceptional novel treatment & presentation. But sadly that is not visible anywhere in this film that unexpectedly even starts boring the viewers in its second half.\n\nRecalling the experience of watching it in the theater, I was really surprised to see simply nothing executed on screen with the backing of some solid writing (post the decent opening Ramlila sequence) and the film progressing so casually without incorporating any kind of much needed suspense or enjoyable tension involving the double role. In fact, a few catchy songs and comic scenes remain the only relief moments in its first half, with the second turning out to be so painfully long that you keep looking at your mobile/watch repeatedly as if it's already gone beyond 3 hours shattering all kinds of expectations raised.\n\nThe cast ensemble including a couple of forgotten names, seem to be only interested in carelessly completing their given jobs establishing no emotional connect with their ultimate viewers, contributing 'nothing'. And the names include veterans like Anupam Kher followed by Swara Bhaskar, Sonam Kapoor, Neil Nitin Mukesh and the snake-man Arman Kohli. To be fair, there is only one person who randomly makes you laugh in his few scenes and he is Deepak Dobriyal who sadly remains under-utilized in the entire film displaying a shocking lack of vision.\n\nRephrasing the above, in PREM RATAN DHAN PAYO we have two lovers but no loving chemistry between them despite the hit tracks, brothers and sisters with no depth in their vaguely written characters placed just to get united again, villains with no emphasis given on their evil intentions or villainy and many deliberately inserted sequences like the unexciting football match post interval lacking the much- desired universal appeal and joy. Moreover except a couple of catchy compositions, both the lyricist and composer desperately keep trying to get into the Ravindra Jain/Ram Laxman mood making a conscious effort.\n\nRuining it further, it was hard to understand the director's obsession with the highly outdated mirror sequences towards the end that had no charm at all reminding you of the famous climax sequence of Bruce Lee's ENTER THE DRAGON. Besides the never-ending final hour of the film becomes so tough to bear, exactly like watching the last few overs of a one day cricket match that has already been lost in its 40th over.\n\nTo be honest, in the entire film I kept wondering that,\n\nA. Was this the story Sooraj R Barjatya kept searching for since 2006 which is clearly a take-off from famous novels such as \"The Prisoner of Zenda\" and \"The Prince and the Pauper\" (with the shades of BAWARCHI), already adapted several times in the West as well as in numerous Hindi films changing the theme from Kings to Dons since the mid of last century? Ironically even Rajshri had earlier made a film on the same subject as RAKTA BANDHAN in the 80s.\n\nB. Was this the film Salman approved of - full of old time obsolete feel, based on a ridiculously stereotyped theme, having only a few engaging moments, at your face brand promotion, lackluster background score, unimpressive 'big-empire' grandeur (that only worked in the promos) and loads of full length songs thrown in just like that, assuming that the viewers are still living somewhere in the 90s?\n\nC. Or Was this a mess, wherein Sooraj was not allowed to do what he was willing to, with the major suggestions/interventions coming from the now much bigger STAR with no intentions of breaking through his own comfort zone?\n\nIn all, a big unexpected let-down, PREM RATAN DHAN PAYO actually has nothing Rajshri, Sooraj and Salman together are known for, not even the emotional warmth they used to offer in their earlier films."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rathorerohit003",
        "review_rating": "1",
        "review_title": "Worst movie of 2015...",
        "review_detailed_main": "This is Indian box office goes down The first half of PRDP flows very slow and the story moves along boringly whilst establishing the characters. The biggest problem with the movie is that the conflict doesn't seem to be too big for it to matter later on when the conflict gets solved.Prem Dilwale's too much overacting makes the film irritate you like hell. The football match sequence and the sequence where Prem mends the relationship of Vijay with his step- sisters are completely over the top ones. There are a lot of illogicalness like the placement of a palace on the edge of a waterfall. At the end of the 160 minute duration, PRDP manages to make everyone sleep and the emotions do not work at all which should in turn make the film not work even amongst the family audiences. PRDP looks completely outdated and clearly no money has been spent on the sets and the costumes. The production design is of very low standards. The VFX work is the worst you have seen in Hindi films and the editing could have been much more tighter but as we all know, Sooraj Barjatya believes in boring cinema. Himesh Reshammiya delivers a pathetic soundtrack. None of the songs stay with the viewer. And the worst one is the title track which seems to be nowhere. Each and every actor completely overacts and the one who does the most throughout the movie is Salman himself. Prem Ratan Dhan Payo can't even be thought of to be compared with classics like 'Maine Pyaar Kiya' and 'Hum Aapke Hain Koun'. The film thoroughly bores you with dull moments all over. Sure there are a lot of silly and illogical moments. And Salman Khan puts in a terrible performance as Prem Dilwala. In the first half of the film, he irritates you over time and again. Diwali is the time when families come together and PRDP will be disliked even by families as it is the most boring movie which irritates you with overacting. This festive season, avoid it for sure. It's a 0/10 rating movie to be honest, but have to give 1/10 as 0/10 is not allowed on IMDb. Sooraj Barjatya films come once in 6-7 years and there is no director in the industry who can fill a film with as much overacting as much as the he can. Advice for the youth, don't even watch it on your on TV."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "badshaanik",
        "review_rating": "1",
        "review_title": "Bad acting, Flop story",
        "review_detailed_main": "Bad acting by Salman Khan. Very disappointed. Salman was in his old flop avatar. STORY was like 90s flop story."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "annisasafanta",
        "review_rating": "5",
        "review_title": "100 percent for Prem Dilwale",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "kokulwar-nilesh",
        "review_rating": "10",
        "review_title": "Yet Again Salman Impresses with His Acting...Loved \"Prem Dilwala\"!!!!!",
        "review_detailed_main": "Don't Worry about rating Most of rating is done by his Haters regardless of movie.. Yes U heard it right... Salman at his best in it..\"Complete Family Entertainer\" Very Melodramatic,A Pure Touch of Romance as Expected From Sooraj Barjatya...Yeah Some Songs Could Have Skipped but No problem...It helped us Witness Salman Khan's Charm...Sonam Kapoor Boosts Her Acting Talent with Swara Bhaskar, Anupam Kher Needs no Review he is best as Always...What Mesmerizes is At age of 49 Salman Khan Looks like an 30 yr Old Man...Movie Gives Some Moral Values which are nowadays lacking in Youth... Finally, I would just Say Just Go and See the Movie as Nowadays Such Movies are not being made..Absolute Visual Treat and Family Entertainment"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "JosephCurwenJr",
        "review_rating": "3",
        "review_title": "not entertaining and funny like I expected",
        "review_detailed_main": "I've been a fan of Salman and Sonam a long time, and hoped for some funny and entertaining movie. The result is far from that, I guess some moments work, like when Sonam convinces the sisters to give Vijay a chance, but already the characters don't catch your interest, it's Salman and Sonam so you don't stop the movie right now, but they don't develop as they should as characters that hold your breath until the end of the movie. The story (once the swap with the prince is done) gets boring fast, and the action scenes are not remarkable. Potential spoiled as I'm sure Salman/Sonam can bring good moments together."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "yashsm-35834",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "The acting of supporting actoress are much better ..but lead actor and actresses both are pathetic .\n\nAnd even story line garbage."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "mujaffarbanadar",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Warning this movie can cause harm to your brain. Totally waste of time"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sheilakaursheila",
        "review_rating": "2",
        "review_title": "Sexist lyrics but catchy tunes",
        "review_detailed_main": "The title song was disempowering to females and masked as a love song. It's a shame such movies are still being made."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "vksukla",
        "review_rating": "10",
        "review_title": "family entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "fallenangelal",
        "review_rating": "8",
        "review_title": "Its really not a bad movie!!!",
        "review_detailed_main": "I feel that the movie is really not as underrated as some say. Its pretty decent with has a lot of emotions flowing throughout the movie, nice songs and lyrics throughout as well. As usual Salman has done it again with his brilliant acting as double roles with different characters. The ending was very touching and it would be a life lesson to some with family issues. There are some lessons to learn out of this movie actually. And if there was 1 complaint that i could make, it would be that the movie is a bit too long...apart from that, give it a go and watch it..because to some it may not be good but for the majority would say that its a pretty good movie!!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "neerajvishw",
        "review_rating": "10",
        "review_title": "Must Watch Movie With Your Family",
        "review_detailed_main": "Prem Ratan Dhan Payo is simply the Bigget movie in the history of Indian cinema. before this the actor Salman Khan and Director sooraj bharjatya made three films which were all time blockbuster in the history. this movie is way bigger than those films simply mindblowing for family.MUST WATCH Salman khan is the most popular star of India. he has mass followers. he is simply brilliant in acting the latest example is his movie BAJRANGI BHAIJAAN brokes all the records and collected 630cr net worldwide.So guys i suggest u to watch this movie because if you want to see a family values in movie ,emotions, drama and some message then definitely GO n SEE FILM U WILL NEVER BE Disappointed"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "strawberryesha",
        "review_rating": "8",
        "review_title": "Amazing Movie for Family..!!!",
        "review_detailed_main": "The movie is awesome. Simple storyline and beautifully shown. Aspects of Family and siblings love has been shown amazingly. A fairytale love story between Prem and Maithali.\n\nAll actors fitted in the role completely. Anupam kher, Salman khan was best..\n\nSonam did act very gracefully. Swara and Deepak again amazing.\n\nJust go with Family and you will enjoy it and listen to songs first then when they come in movie it gives better understanding.\n\nSooraj- Salman combo again delivered a movie for family and all thanks to them to make such movie.\n\nDon't go by negative reviews.. If u are family person then this movie is for you..!!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "bipintulo",
        "review_rating": "10",
        "review_title": "This is An Excellent Family Story & Superb Entertainment Movie",
        "review_detailed_main": "Just want to tell you to Must watch the movie . The love between brothers and sister is the key. The flow of story is awesome. Yes there is a happy ending. Actor Salman Khan is awesome. His appearance and dialog delivery is fantastic. Music & song is just mind blowing. Himesh Reshemiya You done an Excellent Job. Moreover the screenplay is gives a beautiful environment to the screen. I bet that you love the screen selection. Mainly this is a cinema which is based on raja & maharaja. So many beautiful palaces are there in the cinema. Every song is pictured in different style. Yes there is a double role of Salman Khan. But this is the best point of the film. Better you watch on theater to get the full entertainment.\n\nOverall a Out standing Movie with put standing acting."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "pragnamohapatra",
        "review_rating": "10",
        "review_title": "Either u like it or u will hate it",
        "review_detailed_main": "In today's fast paced world u need a little slowness appreciate this movie.requires a lot of life's experience to understand the scene around family values.one has to believe in fairy tale love stories to see a dude falling in love with a princess.gone are the days when we used to see lot of back ground dancers larger than life sets. Salman so convincing in both the characters and sonam makes u believe that she is a princess. If u r a strong believer of Internet love and don't believe in fairy tales this is not a movie for\n\nyou. Thanks RAJ shree to bring back the classic way of story telling. The romantic scenes involving sonam and salman is so beautifully crafted. Yes there will be lot of songs come on it is a rajshree movie after all."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "Another classic Rajshri family film. Salman Khan's Prem Dilwala character will become iconic.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "indianature",
        "review_rating": "8",
        "review_title": "Fairy Tale Entertainment : Not Bad",
        "review_detailed_main": "Only Salman Khan with his twinkling mischievous eyes and tongue in cheek style of acting can make such plots enjoyable.\n\nThis is a fairy tale feel good love story with lavish sets, stunning scenery, exotic costumes and a plot that doesn't pretend to be anything other than entertainment.\n\nSalman as the look alike of the prince is of course typical Salman, making this movie eminently watchable. He has a knack of making the viewer enjoy the most slapstick and the most ridiculous of themes. Well done Salman!\n\nSonam Kapoor was charming, essaying the role of a sweet young princess rather well. She gets a lot of flak for her acting and obsession with fashion but I feel she is good in roles like this, in Bhag Milkha Bhag, Dolly ki Doli, Ranjhana and similar. Sonam gives the impression of being sweet natured in real life too. At this age if one is not fashion conscious especially being a film actress, then when should one be? Nothing wrong in that at all.\n\nAnupam Kher is a class actor and expectedly portrayed his role as the late Maharaja's trusted Dewan saheb very well indeed.\n\nPrem Ratan Dhan Payo does not pretend to be an art movie. It is out and out fairly tale entertainment with lavish sets, beautiful costumes and plenty of song and dance sequences. If anything, I found the songs too many but as I was watching on DVD I had the luxury of the fast forward button :)\n\nThe them song Prem Ratan Dhan Payo is catchy and superb. I've been humming it for quite some time and yesterday while watching the movie I cranked up the volume real high when the song played.\n\nAll in all worth a watch, though not necessarily the effort of going to the theatre. Its showing on TV on Feb 14th Valentine's Day. How apt."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "imajay-83320",
        "review_rating": "10",
        "review_title": "Movie is Very Nice",
        "review_detailed_main": "Guys always expecting a action movie from Salman is not good.There is also some love story & family stories in this world every thing should be explored. This movie might have sorted lots of family issue of real life. Movie contains same issues as we have in our real family. Prem roll cannot be played by anyone except Salman. Director tried to explore the love among the families.Yes Sonam is not fit with salman roll as a co-star but her acting was good. she performed well in her roll. There are very less family movies left in bollywood. So do not miss such kind of movies. Please go for this movie and learn how to live with family."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sandipbiswasyahoo",
        "review_rating": "10",
        "review_title": "It's all about your family",
        "review_detailed_main": "Nothing to say too much; PRDP is all about your family connections and emotions. You need not to use your brain too much to understood or to figure out the why and what answers. Its festive time, so just loose your pocket for your sisters and enjoy the Salman magic. The cinematography is great, the sets and locations are awesome. Deepak Dobriyal & Swara Bhaskar, yet again great performances. A great platform for Arman Kohli to start his second innings. And Mr. Himesh Reshammiya; great support with is music, pure melody after a long time. In this occasion, I have to mention the name of Mr. Irshad Kamil, who provide such a nice lyrics for the film. Last but not the list, the captain himself Mr. Sooraj R. Barjatya; the passion of creating a family movies is all around. He took the plot and nourish that according to him. Hat's off for him for showing such a courage in 21'st century where we all are loosing our family bonding's and rituals. The film is not for those audiences who wants to find the logic behind every scene or wants to use brains in every 5 min's; the film is all about love and heart; no space for your brain to judge too much. In one word; spread love and enjoy your time with family and watch Prem Ratan Dhan Payo."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "drjumokeojo",
        "review_rating": "8",
        "review_title": "Lovely movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sanyyasir",
        "review_rating": "10",
        "review_title": "It is Awesome and best family movie",
        "review_detailed_main": "It's my first review and i know i am posting after long time.I was like you peoples who always watch movies on review or rating basis.Because of bad reviews and against reviews, i never wanted to watch itbut affection for salman khan, made me watch this movie. After watching, i was really shocked because of reviews against this movie. It is one of the best movie of salman khan. It is must watch movie specially for families or those who watch movies with family. I recommend everyone to watch this movie and don't go for the wrong reviews. It has great love,harmony and Mutuality story. A great acting by salman khan and sonam kapoor. Sooraj you Rock man !"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "pavandhuppe",
        "review_rating": "10",
        "review_title": "Lovely film 💯",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "beretta9",
        "review_rating": "8",
        "review_title": "Thumbs up!",
        "review_detailed_main": "I really enjoyed this movie, it's not for everyone but I dont understand why so many people dump on it.\n\nWill definitely see it again"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "GypsiB",
        "review_rating": "8",
        "review_title": "Action, Romance and Family",
        "review_detailed_main": "This retelling of the Prisoner of Zenda is a thoroughly enjoyable Diwali film full of action, romance, and family. Salman Kahn did an admirable job of playing the dual roles, but Sonam Kapoor was a bit stilted. The supporting cast was good, the music fun, and the classic plot a pleasure."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "kunald-76307",
        "review_rating": "10",
        "review_title": "A complete family entertainer !",
        "review_detailed_main": "In these modern times when people rarely value the importance of family, this film came as a fresh breath of air. All the pure love and emotions in this film with a wonderful storyline and lovely songs just took my heart away.\n\nPairing of Salman and Sonam looked just ethereal. The supporting starcast was wonderful as well."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "vipuldhingra1990",
        "review_rating": "10",
        "review_title": "Some people just enjoy hating a beautiful movie",
        "review_detailed_main": "Well, besides other positive reviews, I can also confirm that this brought tears to my eyes, at least twice. The brother sister bond during the coronation ceremony is greatly and finely directed. Don't be critical of the script and just enjoy the positive emotions and the feel the love of having a family. We need at least one such joyful and emotionally stimulating film each year on Diwali. Last but not the least, the sound tracks are awesome. My favorite stress buster even in 2022."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sherofkings",
        "review_rating": "10",
        "review_title": "This film is very good!!!",
        "review_detailed_main": "Having watched this film I found it full of emotion, funny, witty, colourful and a good story line to match. What were the people who gave it negative reviews watching? Were they asleep from over working? Were the critics so full of themselves that they cant see past there noses anymore? It was a lighthearted story, not overly complicated, simple to follow with good songs with catchy lyrics and music. The story is about princely step brothers and sisters, two boys, two girls but one father the King. Their is a love interest through Sonam Kapoor. The story revolves around an attempted assassination on Salman Khan the oldest. The princess who is due in the palace a few days later cannot be told the truth. A double role of Salman Khan steps in and takes over the story from there. I do not wish to give to much away. For those who have not watched it please do. You will enjoy it. Just loosen up a little and dont be too serious, enjoy."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "syed_jay",
        "review_rating": "9",
        "review_title": "A very good movie",
        "review_detailed_main": "I just love this movie .it is so romantic . thank you sanam kapoor for this movie , specially for Jalte diye song"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "beingparvezshaikh",
        "review_rating": "10",
        "review_title": "A comment family entertainer...",
        "review_detailed_main": "What a movie.. Super job by the master Sooraj Barjatya. Beautiful story. Superb performances. Nice music. superb screenplay. Engaging plot. This movie make you laugh,cry,clap. All in one package.\n\nstory of a man who changes the life of a family with the power of love.\n\nA film that should be enjoyed with family & friends.\n\nOnly Rajshri Production can make such a beautiful film.\n\nA film which teach you how to love your family... how brothers & sisters should love & respect each other.\n\nA perfect film on occasion of Diwali to celebrate with whole family.\n\nso go & enjoy it with whole family."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "riasru",
        "review_rating": "10",
        "review_title": "PREM RATAN DHAN PAYO Amazing Movie & Must watch",
        "review_detailed_main": "PREM RATAN DHAN PAYO has opulence in every single frame and one presumes, it's Rajshri/Sooraj's most expensive film to date. What remains consistent, however, is the intent of providing unadulterated entertainment, seamlessly merging romance, conflict, action and dollops of emotions. The supremely talented storyteller, who knows the pulse of Indian moviegoers, promises to offer a complete package in this almost 3-hour magnum opus too.\n\nIt's sacrilegious to envision any other actor enacting the part of Prem in a Sooraj R. Barjatya movie. When the reels unfold, you don't see Salman, you see Prem and that is one of the biggest strengths of the film. This time around, Salman is cast in a dual role -- while he takes to Prem, the simpleton, like a fish takes to water, he's equally competent as Vijay, the prince. What's interesting is, the two characters are as diverse as chalk and cheese, but it is Prem that's winsome and endearing and Salman makes sure he interprets it brilliantly. This is a Salman show from Scene A to Z.\n\nSonam Kapoor is earnest. She looks stunning, but more importantly, she carries her part effortlessly. Initially, her pairing opposite Salman did raise eyebrows, but when you watch the goings-on, you realize that Salman and Sonam do make a lovely on-screen couple.\n\nAwesome review by taran adarsh. Must Watch.!!\n\nPREM RATAN DHAN PAYO Amazing Movie & Must watch, if you like traditional culture and family values in this era."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "prettysavy",
        "review_rating": "9",
        "review_title": "heart warming film .",
        "review_detailed_main": "Loved the movie. If you want to run away from your daily tough schedule then go and watch this movie. You will love it . The movie is about sibling rivalry and the way it tackled very nice. Romance is not old school modernized but very deeply taken in your heart. Definitely a must watch. Sonam looks ethereal and Salman khan nailed it. The breath taking sets and locations take you back .\n\nthe nostalgia factor definitely a positive impact. The movie surrounds comedy,romance,humor and action. Action and climax ate again applause worthy. The only bugging point is length.the length could have shorten .the songs are melodious,hummable and pictures well. Acting is really good. Salman khan,son-am ,Deepak, and well done job ."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "shreyasgb",
        "review_rating": "8",
        "review_title": "Prem Ratan Dhan Payo is an Indian family drama",
        "review_detailed_main": "Prem Ratan Dhan Payo is an Indian family drama. In this film Salman Khan plays in two roles(Prem & Vijay). Salman(Prem),a king, wants to lead a normal life far away from his responsibilities and his step brother wants to grab the position from him. Salman(Prem) finds another Salman(Vijay), who is a common man and they swap their identities temporarily to explore the other side of the world. Sonam Kapoor(Maithili) is a gorgeous princess who helps people. Prem Ratan Dhan Payo is cool and the film is visual delight.The movie is full of emotions, love, action, drama and animations. You can experience the real feelings of love."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "mdsr-ali",
        "review_rating": "10",
        "review_title": "10 on 10 for me",
        "review_detailed_main": "Sonam Kapoor showed people that she is an accomplished actress who can play drama as well as comedy (check out her performance in 'Khoobsurat'), but she really sparkles in romantic movies like this one, and she is absolutely perfect for the role Maithili. She makes Maithili a very real person, and through her we can empathize with Prem's situation, as she enables and allows the audience to experience what she is feeling right along with her. Sonam, through her character, makes that emotional involvement possible, and it's one of the strengths of the film. And like Salman with Prem, Sonam makes Maithili a character you're going to remember.'Prem Ratan Dhan Payo' is a film that offers a multitude of rewards if you are simply willing to reach out and open yourself up to it. All you have to do is to let it in. Do it, and you'll be glad you did, guaranteed. It's the magic of the movies. I rate this one 10/10."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sachisonu",
        "review_rating": "10",
        "review_title": "Must Watch Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ruhulaminseason",
        "review_rating": "10",
        "review_title": "Prem Ratan Dhan Payo",
        "review_detailed_main": "Excellent movie. Awesome performance by Salman Khan. Screenplay,Cinematography, direction, all are excellent. Nice work done by Sooraj R Barjatya. It's a pure family entertainment movie. The pure Indian culture, values and respects are there. After a long time we can feel the flavor of 90's. The Salman-Sooraj combo. The magical family bond created by Rajshri. The music is excellent. Story is strong enough to touch your heart. You will be a better man after come back watching the movie in theater. The character 'prem' creates the magic of innocence and love again. It's the best work done by Salman Khan till date. Its a must watch movie for all."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "jvikas-96250",
        "review_rating": "8",
        "review_title": "\"Rajshri Back to Business\"",
        "review_detailed_main": "Post their last outing – 'Samrat & Co.' – an experiment which failed miserably, Rajshri are back to their principles ! To give the much needed impetus, Barjatiyas have banked on Salman – the \"Prem\" and the magic works !!! PRDP is a clean family entertainer with a good mix of everything one can think of – family drama & relationships, family emotions (extremes of enmity and love), romance, heartbreaks, a pinch of comedy and action, and good traditional feel music to back them all. The story is descent and borrows principles and feel of the epic - Ramayana, though it is predictable at times reminding of something similar which we may have seen in the past. One may find few loopholes and over-stretched scenes in the script, but they are tolerable when you compare with the overall impact created. Cinematography & graphics – the sets are lavish and visually appealing; moments are well captured & worth appreciating. Screenplay, editing & direction – sensibly thought and executed, could have been more crispier considering that it is a 3 hour long flick, nonetheless it is engaging and the length doesn't bother you too much. Dialogues – it is one of the highlights (a teaser – \"har family me problem hai, par wo khushnaseeb hai jiski family hoti hai\"). Music – HR's traditional compositions are a big plus; all songs are aptly placed and the lyrics plus music carries the mood and story forward. Performances – With Bhajrangi Bhaijaan behind and now this one, Salman's message is loud and clear – don't come to theaters for my brand, I will give you substance. Really, it is Salman as \"Prem dilwale\" all the way with his amazing screen presence, comedy and emotions. In fact, there are many goose-bump moments created by him. Sonam is pretty and has done fair justice. All side characters are excellent with special reference to the oldie – Anupam. To sum up, amidst overdose of commercial movies in recent times, this one stands out and touches you, though giving a 80's-90's feel.\n\nBottomline: \"A perfect Diwali gift for traditional cine goers\" Rating: 3.75/5"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ankitsinghalrocks",
        "review_rating": "10",
        "review_title": "Suraj Barjatya is BacK and back with a bang!!",
        "review_detailed_main": "Complete premises of the movie is absolutely gem and the visuals are stunning. Suraj Barjatya has done it again with his direction and he completely achieves what he tries to show. Believe me, I didn't find a single disappointing moment in the movie and the movie is a complete package of roller coaster ride full of entertainment, fun, emotions, happy moments etc etc. I mean this movie has everything which makes it the best movie of the year or may be last five years.\n\nComing on to the performances, Salman Khan and Sonam Kapoor have done their part very well along with all the other supporting cast. First Bajrangi Bhaijaan and now Prem Ratan Dhan Payo, Salman Khan is turning the heat on with his acting guys. Go watch the movie , its a sure shot BLOCKBUSTER.\n\nI give it 10/10."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "vishnupv",
        "review_rating": "10",
        "review_title": "Good fantasy story with excellent visuals and songs and poetry.",
        "review_detailed_main": "This movie is Fantasy story of a Queen, a Wounded bed ridden King, and his lookalike, a villager who plays his role in his absence. The man enters a dilemma when he receives love from the queen for the love he showed, but he doesn't deserve it. Can he make everything right?. Will the King come back in his full health?. He decides, he shouldn't do anything for which he will regret in future. He plays the role of the king even better than him. He brings together the families which were apart. He builds Happiness and strengthen family values. And when king is back, he returns to his humble village. But the King surprises him with a gift, the queen. After all,it is him she wanted.\n\n(This story line is similar to Singh Is King where the King don is bed ridden, the villager takes his seat and brings back peace and harmony. And loves the girl who belonged to someone else. He gives her away but she choses to be with him.)\n\nThe dresses, choreography and songs are awesome. There are plenty of songs. There is no single unwanted pixel in this movie.\n\nThis movie is the best I watched in 2015. I have seen most users complaining story is not being realistic. This is a fantasy story. If someone wants an intelligent storyline, there is 'Ex Machina'. Those who look for 'New wine' in love stories, there is 'Premam' This movie is not rediscovering any intellectual content. It portrays love, morale and beauty in its own unique way. I am sure the director has achieved everything he intended. This year in Bollywood, cheap story lines like Happy New Year succeeded and good love story like Dawat E Ishq flopped. So I wouldn't wonder if this couldn't become massive hit of the year."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "dilawar-26033",
        "review_rating": "8",
        "review_title": "Entertaining movie! Must watch with your Family :) Worth it! Trust me!",
        "review_detailed_main": "I went to see Perm Ratan Dhan Payo! I am Salman fan ! The movie was really good! If you were born in 90's i am sure u would love it! I m not sure todays generation would like it or not. This was full on family movie! Full entertaining. It shows importance of family relations instead of money / status! Salman did pretty well as well! Now coming to the music U will find melody in the movie soundtrack ! Which is hard to find these days All songs had actual lyrics(meaningful) The title track was really very soothing n melodious ! It looked beautiful on Screen (cinema) . The visual effects was pretty good. Action was also good. Salman as Prem did an outstanding acting, Comedy and He looked really cute and lovable. though some might find the music disturbing but its not. it suits the scene. Please stop degrading such movies! Overall 8/10"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "meeshum",
        "review_rating": "8",
        "review_title": "Loved it!!",
        "review_detailed_main": "Great Entertainer!! Must watch, simple light hearted movie. Love all the characters in it, Salman was good! I don't see why people would rate this movie bad, after watching movies like Chennai Express become a super hit!! (Eyes rolling).. definitely a LOT better than that!!!\n\nLots of songs, but I didn't mind them! Love all the colors, beautiful costumes and the back drops in the movie as well.\n\nStory is not exactly new, but has been carried out well. Salman has pulled off another hit, with his acting skills this time! Barjatya's did well, after a LONG time. I hated Hum saath saath hain, specially Salman's role in it..so unreal! This one is way better, funny in bits and pieces too."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ahmedzaman-39750",
        "review_rating": "10",
        "review_title": "Not a regular Salman khan film",
        "review_detailed_main": "Although i am not a huge fan of nsooraj barjatya movies but when it comes to salman khan iam one of his blind fans so If you know anything about sooraj barjatya previous four films, and enjoyed any of them, then I would expect you to enjoy this film very much a chilling classic nicely driven by whole cast the first half was very charming though the climax was little boring but it is a package of full family entertainment with nice background score brilliant pieces of direction and some of the terrific performances and u don't want to miss salman khan in his double role avatar vijay and prem i like this movie so much and hop you to like it as well as far as box office collection is concerned i think its gonna blow up all the records and will create history."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ajinkyavilla",
        "review_rating": "10",
        "review_title": "PREM RATAN DHAN PAYO is the perfect Diwali entertainer for the entire family",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sanketsatbhai",
        "review_rating": "9",
        "review_title": "Review",
        "review_detailed_main": "You might want to keep off those Diwali sweets if you intend to watch Prem Ratan Dhan Payo. Indulging in both could lead to the kind of sugar overload that your doctor would most certainly disapprove of. Hum Aapke Hain Koun director Sooraj Barjatya's latest is a familiar tale that involves setting right the wrong, reuniting estranged families, and conquering hearts with basic human goodness. These are formulas he's employed to great success in previous films, but the tropes have gotten rusty, the emotions seldom feel genuine, and the writing is strictly surface level. Good thing then that the film's got Salman Khan as leading man, his abundant charisma glossing over many of its flaws.In Pritampur, an estate in North India that didn't get the memo on the abolishment of the monarchy and royal practices, Yuvraj Vijay Singh (Salman Khan) is injured in an attack by disgruntled family just days before his coronation and the arrival of his fiancée, Princess Maithili (Sonam Kapoor). While the prince recuperates in a secret chamber within the royal fort, his lookalike Prem, a small-time entertainer from a nearby town, is discreetly recruited to take his place so the formalities can go off without a hitch.It's a testament to the star power of Salman Khan that Prem Ratan Dhan Payo is never unwatchable despite its old- fashioned story, its frankly laughable scenarios (the climax takes place in a palace of mirrors built on top of a waterfall), and its failure to flesh out characters adequately. The film revisits many of Barjatya's favorite themes – the importance of family, the enduring bond of brotherhood, and the power of forgiveness – but it has nothing particularly new to say that might justify making this film in 2015.Pre-intermission the film coasts along breezily, buoyed by the humor in the interactions between Prem and the loyal palace diwan (Anupam Kher), who's trying desperately to rein this man-child in. But melodrama reaches fever pitch in the film's shrill second half, in which an angry half-sister (Swara Bhaskar) and a conniving half- brother (Neil Nitin Mukesh) must be won over, and a trouble- making relative (Armaan Kohli) must be defeated. Meanwhile, the romantic track between Maithili and Prem packs some nice moments, including a running joke about not getting 'cozy' until they're married.Alas, the predictable plotting and the lazy characterization never really allow you to be invested in any of the film's characters or to even care for them. Make no mistake, Salman Khan is the sole draw of this film, and he works hard for his top billing. The actor is in good form – terrific in the comic scenes, and earnest in the emotional ones – turning on the charm to help you survive, and even enjoy, this nearly 3 hour film that's crammed with songs, and over-styled to a fault.I'm going with two-and-a-half stars plus an additional half star for Salman Khan, which makes it three out of five for Prem Ratan Dhan Payo. Get ready for a sugar rush."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "IamAdeel",
        "review_rating": "10",
        "review_title": "A HEART Touching Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "a_kapat",
        "review_rating": "8",
        "review_title": "Best work of sooraj salman combo if not dragged too much and filled with too much music",
        "review_detailed_main": "First of all to all the haters....keep in mind that the director is sooraj barjatya....if you know that then you must know that how the movie type is going to be....so don't say outdated storyline or excess family melodrama. I loved the film very much especially the first half...the visuals are ecstatic and heavenly...salman is awesome in looks and acting both....sonam is gorgeous too and all the co actors did justice to their role.....everything was in rajshri style. I can't give 10 out of 10 because the second half seemed boring at certain point of time....music is sweet and melodious but as you know excess eating of sweets taste bitter. The songs took the pace off the movie and let me yawn. But as time goes the sword fight scene put some energies into it. Above all you can't miss the movie because it is a treat to your eye and trip to your heart with the touch of family in salman style."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "nitesh-karwa68",
        "review_rating": "10",
        "review_title": "A True Family Masterpiece In Every Sense",
        "review_detailed_main": "There is no spoiler for this film but a Caution. Watch this film with your family then with friends and Please don't compare it with Bajrangi Bhaijaan. These two are totally different genre.\n\nTalking about the Huge Plus points of the film. SALMAN KHAN is Super Entertainer. He will literally blow your mind away.. Like never seen before. Loved the way he came back again as PREM. He is one man show. Sonam Kapoor is flawlessly beautiful..not a perfect Rajshri Heroien but Loved her too. Swara Bhaskar is as usual Terrific. Neil was Surprisingly Amazing. Armaan Kohli is Badass. Anupam Kher is Excellent. His Chemistry with Salman was amazing. Deepak Dobriyal is as usual Amazing.\n\nThere is hardly any Negative point about the film except that it is a Family entertainer not a mass entertainer. But a Person with family is Surely going to love it.\n\nGO WATCH!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "bhaijansalman",
        "review_rating": "10",
        "review_title": "Prem",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "misbahahmed",
        "review_rating": "9",
        "review_title": "Its a must watch movie full on entertainment and family values. Prem is a delight to watch.",
        "review_detailed_main": "I have watched 'Prem Ratan Dhan Payo' today, though planning to watch from first day but couldn't watched it earlier due to non- availability of tickets. Everyone here is going gaga over this beautiful family entertainer full on high moral and family values. The story, screenplay, dialogues, direction and music were outstanding. Sooraj Barjatya, hence proved that he cannot go wrong whenever he plans to direct Salman Khan. The acting performances were excellent especially \"Prem\" the role played by Salman Khan is a delight to watch.He was in full form and spread happiness throughout the film. He was also good in the character of \"Vijay\" but it has smaller screen time. Anupam Kher, Swara Bhaskar and Neil Nitin Mukesh did the superb job. And guys I was surprised to watch the role of \"Maithili\" astonishingly well played by Sonam Kapoor. Believe me its her best performance till date. Plus she was also a visual delight. Moreover the stunning visuals, grandeur of sets and colorful costumes were the plus point of the film. Guys go for it. You will surely love it."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ssbangs007",
        "review_rating": "10",
        "review_title": "Nice family entertainer",
        "review_detailed_main": "After long a great family movie.. A perfect blend of drama , emotions and action .... Action only when n where needed.. .emotions a lot more than romance ... this one deserve to turn a hit....\n\nThough songs are a lot more than they should be ... There s a nice story than being baseless like Dabang(1 n 2) n wanted ...... Sonam kapoor back with overacting, best part is her dialogues are less... Salman khan highlight of movie and controls the screen ... Niel nitin mukesh even did a nice job ...\n\nStory line and movie is nice More than just watchable movie ...not a boring one rather an entertainer..."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "devens-04699",
        "review_rating": "10",
        "review_title": "Wonderful cinematic journey to your sibling days",
        "review_detailed_main": "Excellent script, production values and acting. Forget the trolls and head out with family to watch this epic. Love the movie and its message.... Salman hits the right chord and the support cast steps up. Its not your typical action and cheap comedy from Bollywood. Its about the values and family that we all were raised around and came to respect. The trolls these days have lost all respect to the Indian values and ADHT does not let them watch any sensible movie. So cut to the chase and go get yourselves some Indian family entertainer that you will remember.. I saw this FDFS and was surprised to see such a clean and entertaining movie from Bollywood."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "manishathaku",
        "review_rating": "10",
        "review_title": "Prem Ratan Dhan Payo is an awesome soulful movie with outstanding visuals!",
        "review_detailed_main": "Prem Ratan Dhan Payo is a soulful movie, I enjoyed every moment of it, I truly respect the sincere intention behind the movie, Salman Khan is at his best and is extremely adorable as Prem! He touched my heart yet again! The visuals are spectacular, it looks so beautiful, Sheesh Mahal and palaces are absolutely gorgeous! Everyone should watch this movie with their families in theaters , My sister and I loved it, and we are so glad that we both understand and feel the movie the same way. I've requested my elders to watch it too, they really should, because I believe this movie can change people and their way of looking at issues and solving them! It's not at all preachy, it's a very simple, subtle, meaningful and fun movie! The family problems are very real in today's world, and love & fun is the only solution to fix these problems and move past them, Love is bigger than anything else and that's all the movie is about. Prem's way of dealing with them is outstanding, If all of us are like Prem then we would have happy families and relations! Hats off to Sooraj B to attempt something like this in today's time, and he did it because he wants people to love each other, That's very noble! He has put his heart and soul into it. People who are saying that they don't like it, I can't really understand why, the only problem that makes sense is people have lost touch with their emotions, everyone needs to watch this movie with their heart, if it doesn't touch people's heart then trust me there is something wrong with those people not the movie. Movie is perfect and very much needed in today's time! And it takes guts to make a movie like this in today's time when people have diluted love so much. Today people are so out of touch with these emotions, it's all the more reason to watch this with movie with family. Please do yourself a favor and watch it with your heart! It's hearts job to see the love and purity, mind often reduces the value and sanctity of pure soulful things! I'm going to watch it again and again."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "saurabh-pande51",
        "review_rating": "9",
        "review_title": "Needs to be watched by Every Generation at least once",
        "review_detailed_main": "Am not surprised by all the negative reviews put around this movie, which has kind of become a norm for all the Salman starred movies. But let me tell you this, most of these negative reviews are pre- conceived and based on many other assumptions.\n\nLet me ask you when was the last time you went to see a Bollywood movie with your family? At least this movie is an attempt to be an occasion to be enjoyed and savored with entire family. Agreed, that not all of us enjoy family drama in the same taste like we do other masala Bollywood flicks and there could have been better attempt at editing for some of the parts.\n\nThis movie talks about family togetherness, brother sister bonding and reminds us about many other small aspects of family values that contribute to a strong family, which is something being forgotten slowly in the busy walks of our lives. In fact such movies need to be seen by every young generation at least once as a refresher of our strong culture and traditions.\n\nWe all still mesmerize our times when we remember going to \"Hum Aapke Hai Kaun\" and \"Hum Saath Saath Hain\" with our families. I wish every parents offer this legacy to their upcoming generation.\n\nGive it a watch at least once."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "mohanmr-46369",
        "review_rating": "10",
        "review_title": "Blockbuster Movie",
        "review_detailed_main": "Nice screenplay with known story.watching thika mobile is a hage gjk."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "ramkumar-28288",
        "review_rating": "9",
        "review_title": "A perfect family entertainer",
        "review_detailed_main": "A Sooraj Barjataya classical ride. A film which you can watch with your whole family"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "zeynabhoseiny1994",
        "review_rating": "8",
        "review_title": "Gorgeous...",
        "review_detailed_main": "This movie is a visual pleasure. I'm so disappointed that people seem to favor garbage movies over heartfelt amazing movies like this one these days. Every single aspect of this movie is masterfully made. Salman khan and suraj are a force to be reckoned with."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "nasiflabib-03468",
        "review_rating": "10",
        "review_title": "Best Family Drama movie with Romance and plot",
        "review_detailed_main": "One of the best drama film I've ever seen. Clearly Salman proves it again. This movies deserves to be one of the best bollywood film ever. I've really enjoyed it and if you want to live the moment of the screen you should watch it. Ps. Don't watch if you only want to see logic and necessity of scenes, then it's your problem not the film's. Thank you!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "barcacatalunia",
        "review_rating": "9",
        "review_title": "Prem is Back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "salemali-86587",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "Ajwhhwjfift7r7r7de7d7dufigofifududufufifififififogwysd8susjsjsjsjsjjsksskskskkssksjjssjsjjsehehehehehheherhhrhehehehehehejeshwjwjjewheehherhejekkwoqjrrhthgt."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "tristanwever",
        "review_rating": "10",
        "review_title": "Back in India",
        "review_detailed_main": "Wonderfull movie. Feels like being back in India. Such a wonderfull vibe!"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "gawadedurga",
        "review_rating": "9",
        "review_title": "Family entertainer",
        "review_detailed_main": "Good movie Nice songs Nice acting direction is good"
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "sjashton",
        "review_rating": "8",
        "review_title": "Cute Bollywood version of The Prisoner of Zenda",
        "review_detailed_main": "I'm writing this because there are so many ridiculously low (1-star) ratings for this film dragging it down for no reason other than pettiness. 1 star, to me, is an unfathomably bad, extremely low-budget production, where the film crew is amateur and the writing is excruciatingly bad. That is not what this film is. From what I can tell, the extremely low ratings are just people complaining because they're used to a different style of movie from this director, but just because it's not his normal style doesn't make it BAD.\n\nI truly did enjoy this movie. Someone mentioned it being a version of The Prince and the Pauper, which is not far off, but it would be more accurate to say this is a retelling of The Prisoner of Zenda, a delightful story (in my opinion) in which a look-alike fills in for a prince and must deal with the prince's love interest while thwarting the bad guys.\n\nWhile I know nothing about the director, I thoroughly enjoyed Salman Khan's performance in this role (or, I should say, dual-role, although the look-alike is the main character). From what I can remember, the music was enjoyable, the changes to the plot interesting and cute. It's faults are it's length and a rather confusing, lengthy flashback in which the character's backstories are explained in a very strange and impossible-to-believe setting.\n\nIs it high drama? No. Is the premise believable? No. But it's cute and fun, and just about as good as Dave (another Prisoner of Zenda retelling that I love)."
    },
    {
        "movie_id": "tt3595298",
        "movie_name": "Prem Ratan Dhan Payo",
        "movie_rating": "4.4",
        "review_username": "rbijshy",
        "review_rating": "",
        "review_title": "Unbelievable",
        "review_detailed_main": ""
    }
]