[
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "nathanurag",
        "review_rating": "7",
        "review_title": "Excellent Watch for all boys!",
        "review_detailed_main": "I am not a fan of Bollywood movies, but Pyaar Ka Panchnama is definitely a must watch. The movie depicts the real condition of boys who are on the hook. The first half is amusing but the second part is boring and I felt a little frustrated at times looking at the condition of the boys. Just like other Bollywood movies i thought sooner or later these boys are going to teach the girls a bitter lesson, but the end was not dramatic as i expected. The dialogues are well written and the timing is perfect. The new actors have done well. \"Ishq na kariyo kake\" and \"Bann gya Kutta...\" are enjoyable songs.\n\nA copy of this movie i Will always keep with me. Definitely an out performer for Bollywood."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "AishFan",
        "review_rating": "8",
        "review_title": "Awesome!",
        "review_detailed_main": "This movie is terrific! The comedy (about 3/4 of the film) is an absolute laugh riot. Direction and performances of the entire cast is top-notch. Screenplay is superb. Dialogues are to die for!! I have never heard so many clever, witty lines combined into one film. Liquid's monologues are always power-packed. The innocent character of the three gives a monologue filled with frustration building up over time--by far, the best performance and scene of the film! The annoying girlfriends also did a fantastic job. The incidents and events in the film are real slices of life. You must have heard it happening somewhere, if you haven't been through it yourself!"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "Einsicht2010",
        "review_rating": "7",
        "review_title": "Recommended to all guys out there",
        "review_detailed_main": "A story of three bachelors or May I say, three carefree wolves. Guys, this one is strictly for men and for those women who can agree with the movie.\n\nRajat a.k.a Rajjo (Kartikeya Tiwari), Vikrant (Raayo Bakhirta)& Nishant (Divyendu Sharma)are three bachelors who live together as flat mates and face a lot of funny and emotional challenges in the coming months as they get into relationships with Neha (Nushrat Bharucha) , Rhea(Sonalli Sehgal) & Charu (Ishita Sharma) respectively.\n\nThe chemistry between the guys is amazing. The way they converse with each other is hilarious and easy to connect to as most bachelors live the way they do. The character of a frustrated IT professional played by Divyendu is the funniest of all. His portrayal of the character is side- splitting as you can actually relate to the level of aggravation. Apart from him, Nushrat Bharucha plays the role of a nagging and obsessive girlfriend with quite a lot of perfection. Her role in LSD was totally contradictory to what she played in PKP and she did manage to inspire hatred for the character with her acting skills.\n\nThe background score in the movie is nice and the songs fit well in situations. However, the second half of the movie is way too lengthy and the level of emotional drama depicted is way too much to be quoted as 'Bearable'. The movie shouldn't have been this long and a duration of 120 mins would have been more than sufficient to tell a story which is as simple as this. But, yeah the director and the actors have done a pretty smooth job during the first half. Recommended to all guys out there!!!!"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "tanujroy",
        "review_rating": "10",
        "review_title": "Brilliant movie but only for Guys",
        "review_detailed_main": "Such a movie has never been made in bollywood which is so accurate with todays life of youngsters in big cities, it deals with women, boys the weakness of men towards women, friendship. It accurately depicts how much guys are desperate nowadays and sadly its true, the three friends portrayed in the movie reminds every guy of himself and his college friends, every one can so easily relate to the way they live, the way they talk etc its just so accurate and the way they fall in love and have to go through the relationship just brilliant, although all 3 are excellent but \"Liquid\" steals the show with his excellent spontaneous dialogues, family audience will not like the movie due to adult language but guys will enjoy the movie, its 10/10 from me, must see movie for all guys."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "rohit_itm",
        "review_rating": "10",
        "review_title": "Awesome Movie - Explains Real Life Girl Friends",
        "review_detailed_main": "I have seen this movie 5 times in 3 days....every time I got carried away by the solid punches, superb acting (especially by Liquid) and emotional turning points ..\n\nThis movie depicts the situations same as in real life..\n\nThe movie very well do the justice with its name \"Pyaar ka punchnama\"..explains each thread of so called love.\n\nSongs are very well written(great lyrics) and put in the movie as according to the ongoing situations.\n\nSimply put, this is one of the finest films I've ever seen. I don't say that lightly, I don't exaggerate when it comes to talking about movies - - but everything about this one, from the acting to the writing, to the camera work and background music is grade A.\n\nDirection of the movie is flawless,this movie is almost perfect in all the departments.I hardly found any mistake in the movie.\n\nThe story deals with deep matters hidden inside every heart, and it does so one step at a time, with a plot that moves steadily forward, gathering force, substance and intensity.\n\nOverall it is a great entertaining movie...\n\nI give it 10 out of 10."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "yakuzastringer",
        "review_rating": "",
        "review_title": "*****thumbs up....but!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "sribornagain-394-460163",
        "review_rating": "7",
        "review_title": "All single guys out there , reason why you should stay single..!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "technology-guy-ab",
        "review_rating": "10",
        "review_title": "Just Awesome",
        "review_detailed_main": "To me the movie was just awesome. I did not know anything about the plot of the movie before watching it. At the start just felt like the cliché friendship story with youngsters and stuff, but, to my surprise it was not. The movie had a totally different message, it was truly a masterpiece, had a totally different concept and the acting was superb too. At first i was reluctant to watch the movie because all the faces were new but boy o boy they did a great job better than many known faces would have done it. The only thing I would have liked to see more was the after effects after the end of the current movie, what i mean to say is they should have discarded the songs in between (the first one was good) and then add something to the end. Overall the guys did a great job and a great movie to watch"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "A mostly enjoyable journey into the women psyche but could have been much better in a shorter version.",
        "review_detailed_main": "In most of the cases, friends reading this review may not have heard of this film before and hence must have an uncaring kind of response to its silent release this Friday. But surprises do get delivered at regular intervals from our dear Bollywood and PYAAR KA PUNCHNAMA is surely one of those pleasant ones. Though the film offers nothing new in its content and neither is it based on any path-breaking plot which you have never seen before. But still it can be seen along with your group (preferably boys), for its superbly written, realistic dialogues and the new kid on the block Divyendu playing \"Liquid\" in the film. And why he is called \"Liquid\", that's because \"Woh Failta Bahut Zyada Hai\u0085.\"! Quite hilarious!\n\nNo doubt PKP is all based on the same old formulas of three friends falling for different girls, hanging out in Goa and then calling it off after some ego fights. And it even reminds you of films such as the cult American Comedy American PIE, or our own classic DIL CHAHTA HAI and the most recent DIL TO BACHHA HAI JI. But still it makes a decent impact due to its brilliantly written dialogues which are exactly similar to the spoken language of the today's youth with the mixture of intellectual self-made terms and abusives used in an explosive blend. In fact I think this might be a movie in which you hear the BEEP sound in its conversations more than ever before.\n\nHowever the best part of the PKP remains it initial 30 minutes, which are immensely likable from the very first scene with the funky entry of Liquid. In the later reels, as usual due to some highly avoidable sequences the pace drops and the film starts to drag. But even then the saving grace of the film, Liquid keeps entertaining you at regular intervals with his sharp and witty statements on a boy-girl relationship. The debut writer-director Luv Ranjan shows his hold on the medium especially in the dialogue department but if only he had been more strict on the editing table, the film could have been an instant winner. Because in its present version, it is too long and becomes repetitive post interval, leading to boredom.\n\nAnother worth mentioning point of the film is that its purely been made from the boys perspective and has everything written keeping in view the trauma faced by the men in an affair. So for all the ladies it may not be an amusing fair at all. At times the female gender may also find it too offensive as the girls in the movie are shown to be too clever, shrewd, self-centered, manipulative and playful when it comes to their love affairs. And they all shamelessly use sex as a means to get what they want from the silly boys. So looking from that point of view, PKP would be more enjoyable for all the males and not the other way round.\n\nPerhaps it may also be called as a well attempted journey into the \"Women Mind\" or an attempt to know what the girls actually have in their thoughts while flirting or having multiple affairs at the same time. But the fact remains that in a more shorter version it would have been a thoroughly entertaining affair for all. Still if you like the few merits of the movie mentioned above then go for it especially to watch Divyendu as Liquid. The boy is really fabulous in his honest portrayal of a shy boy not having a girlfriend. Kartik and Raayo as the two other friends in the group also look confident on the screen with Raayo scoring a bit better than Kartik. Also Raayo definitely has the best on screen presence among the three but the film largely depends upon their exclusive scenes together. Among the girls, Nushrat tops them all with a bigger role and looks hot too. Ishita is the second best in the girls department whereas Sonali looks are perfect for the kind of role she had to play.\n\nIn the soundtrack I really liked the composition and arrangement of the song \"Ban Gaya Kutta\" (Luv Ranjan) and also \"Ishq Na Kareyo Kaake\" (Clinton Cerejo). But here comes the sad thing associated with the tracks and with that I mean the degraded, shameless and sick lyrics of these songs. Truly speaking, when we normally listen to a song then we don't really pay attention to the lyrics after its initial hook lines and just keep on enjoying it. But from the last few months the kind of lyrics we are being served with, are not only low standards but they even look like taken straight from a cheap road side sex book. For instance if you are really interested then just take a piece of paper and write down the lyrics of the song \"Ban Gaya Kutta\" as the song is played and then read it after the song is over. You will feel like voiceless while reading it with your eyes down feeling the shame. And it's indeed an important matter of concern for all the responsible film- makers as well as the Censor Board.\n\nSumming up, I would like to say that yes, its not a masterpiece with anything fresh or out of the box. Yet it has the potential to entertain you in bits and parts. So if possible watch it with your band of boys especially for the performance of \"Liquid\"."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "mishra-abhijeet28",
        "review_rating": "10",
        "review_title": "Awesome !!",
        "review_detailed_main": "The movie made me laugh right from the first scene hilarious dialogues and superb words by the writer\n\nThe beauty with which these new comers have played their characters is simply marvelous I loved the way and passion with which the male leads throw their dialogues at a stretch for minutes together\n\nenjoyed every scene in the movie specially the way the life of these three friends are knitted together ... A real depiction of what LOVE is in this modern era\n\na sure watch this summer guys please please please don't miss this one ...\n\ntotal entertainer ..... completely worth your time and penny"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "batraman87",
        "review_rating": "7",
        "review_title": "Pyaar ka Puchnama started on a high but couldn't maintain that",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "muddassar-mirza",
        "review_rating": "10",
        "review_title": "G0d amazing fact this m0vie was",
        "review_detailed_main": "To me the movie was just awesome. I did not know anything about the plot of the movie before watching it. At the start just felt like the cliché friendship story with youngsters and stuff, but, to my surprise it was not. The movie had a totally different message, it was truly a masterpiece, had a totally different concept and the acting was superb too. At first i was reluctant to watch the movie because all the faces were new but boy o boy they did a great job better than many known faces would have done it. The only thing I would have liked to see more was the after effects after the end of the current movie, what i mean to say is they should have discarded the songs in between (the first one was good) and then add something to the end. Overall the guys did a great job and a great movie to watch... Guys this m0vie is a real fact ab0ut h0w the girls 0f t0day treat b0ys...HATS OFF!!!!!!!!!!!"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "rhitwick",
        "review_rating": "7",
        "review_title": "Most of the punches fall in places...",
        "review_detailed_main": "There were so much talk on this movie I had to watch it. I had only fear of it showing everything extreme and I found to be true.\n\nConcept: Three friends who work in software firms stay together in a rented house in Delhi. Three guys are of three diff. characteristics. One is emo, another is nerd and another is apt for being a playboy. They live life like most bachelors do. Playing games in spare time, drinking till u vomit and in a very dirty and scattered room. Eventually they all fall in love and how the girls (not love; generally movies are shown how love changed someone's life) changed their life is the movie.\n\nDirecting: This movie could have been slick and crisp. But ended up being boring and lengthy at certain times. Crying scene of \"Rajjo\" was so hammed that I fast forwarded it and a few like this. Most of the cast acted as they should; girls being too girly and boys being, well, just themselves. Not very much impressed by directing. Kind of lame directing as like Sajid Khan. Shines but the shine of a tin not gold.\n\nCast: Three guys and three gals. And few side characters who just happened to be there because someone had to be there. Of all Divyendu Sharma as Liquid was awesome. Only his role is explored much, has got much screen time and has all the great punchlines. And, he gets to swear Again the office and work related environment is much more shown with him too. So, if you are a s/w engineer you might find resemblance with him (till certain level)\n\nRest of the two characters are not that explored, so they don't leave that much impression on you when movie ends. And, you have seen them in all other movies but not \"Liquid\" I bet. He is an unique character as \"D. Santosh\" of \"Rocket Singh\"\n\nGirls. Well only one actor Nushrat Bharucha got much more screen time. She had to, she is the nagging one. And does justice to her role. Really gets on to your nerve. Ishita Sharma get to play the *****. She just had to exploit Liquid's desperation in her use and she did it by book. Not much acting used (eye movement, lips etc body language are not captured either intentionally or the director forgot these subtleties). Then there is Rhea played by Sonali Shehgal and she is the weakest character of them all. Weakly portrayed and stiff acting.\n\nScreenplay: Tries to cover three diff. types of character and their reaction to three diff. types of extreme gals. So there were lots to do but only few characters are properly explored. Still, good attempt.\n\nEditing: Only section of the movie that outright sucks. Made the movie slow at times and few scenes are stretched too much.\n\nCinematography: Lots of color. And nothing special to mention here.\n\nVerdict: One time watch. Has some genuine moments. You would enjoy it, if not whole movie but at least 3/4th of it sure.\n\nP.S. Songs sucks"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "bajpaianuradha",
        "review_rating": "5",
        "review_title": "Title should be 3 b!tches & their slaves",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "preetoberoi8",
        "review_rating": "10",
        "review_title": "this is the best there is",
        "review_detailed_main": "this by far and i mean by far the greatest comedy of the past decade.if you have bin in a relationship ever in Ur life . this movie is one you could easily relate to.it has a very strong script to compliment some great direction . the background score also does it for me and also the theme song i.e \"ban gaya kutta\" is quite brilliantly used. i would recommend this movie for all of you out there. 210 minutes of real ENTERTAINMENT.each of the characters is easy to relate to. when my cousin suggested this movie to me i was reluctant.the fact that the starcast was new. i had not evenheard of the movie before.and i had no idea what the movie was about.but believe me i thank him for making me watch this exceptional movie. this movie is a tribute to all guys around the world."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "psyk007",
        "review_rating": "8",
        "review_title": "Awesome",
        "review_detailed_main": "Well i describe in short The whole direction, editing & acting in this movie is great.\n\nI congratulate the whole cast & crew member whomsoever involved in the making of the movie.\n\nThe Story of the movie is Outspoken and overly critical Nishant Agarwal meets gorgeous new co-worker, Charu, offers his help, assists her financially, and they become close friends. His room-mates, Rajat and Vikrant, are pleased with this outcome as they already have girlfriends in Neha and Rhea respectively. But both the relationships are not as harmonious, as Rajat feels Neha is self-centered and demanding, while Rhea appears to be withdrawn and aloof. Missing their meetings and bar-hopping, the trio decide to take a time-out and be by themselves. All three women, however, find out and decide to accompany them to the beach where they eventually mingle. The trio do not know that soon misunderstandings will crop up - and it will take a lot of effort and understanding to resolve them.\n\nKartikeya Tiwari, Nushrat Bharucha, Divyendu Sharma, Ishita Sharma, Raayo Bakhirta & Sonalli Sehgal I will congratulate all of you guys for your hard work.\n\nlooking forward to see u all in future best of luck everybody."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "abhimeddy",
        "review_rating": "",
        "review_title": "Love or another cliché",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "crazyayush",
        "review_rating": "7",
        "review_title": "Pay for the first half",
        "review_detailed_main": "I went for this movie with a friend of mine, with no vague idea of how the plot in the movie.\n\nFor the first 30 minutes, the movie was just awesome. The punches were good, actors were doing their best and the story moving with a good pace. We had a good laugh and i could hear few claps from random corners of the theater.\n\nAfter the intermission, it got pathetically slow. I was wondering why i was paying for the second half at all. The actors lost their form too.\n\nAll in all, i would suggest you to go for this one with your pals on a not so busy weekend. The soundtracks were nice and the babes are hot ;-), which is the only nicest thing apart from the very well timed dialogues of this movie.\n\nEnjoy..."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "dharmu_india",
        "review_rating": "8",
        "review_title": "pyar ka punchnama, bible of every youth",
        "review_detailed_main": "oh god what a movie!! i think it should be made Bible for every new generation youth. when i was watching the movie it was like i was watching some characters of my college. Dhaba, babbar sher, do not move to open door, i thought these things were known to we only but secrets are wide open now. thnxs Luv Ranjan for such a fantastic movie. keep it up dude. Liquid was superb in his role. saali rajjo was little weak and choudhary was really a guy you do not want mess with. overall you must watch this movie. i am sure you will watch it again and again. its the story of 3 working guys. they were living happily with each other. life was simple until some girls entered in their life. from then they start bumpy ride of their life."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "ajay_ramaseshan",
        "review_rating": "7",
        "review_title": "Good Comedy . one of the best 'Bachelors' movie",
        "review_detailed_main": "I had seen the long speech about girls on Youtube, thus wanted to see this movie, The dialogues were very funny and cheesy, though it may appeal only to the male populace, but still it should be treated as a good comedy.\n\nnice acting by new faces, the best acting was by Divyendu sharma playing the character of 'Liquid'. The female leads, were just okay, Rayo was below par in the movie and most of the time was either expressionless or showing his muscles throughout the film. He was the least impressive among the cast.\n\nThe second half of the movie, was however boring, because the same kind of jokes and clichés keep repeating, and it staggers toward an emotional melodramatic end. Thus I felt the movie could have been 30-40 mins shorter.\n\nOverall, I would rate the movie 7 out of 10. Not worth spending your money on it in the theatre, and please guys do not take your girlfriends to this movie, :)"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "funkyguru-905-164995",
        "review_rating": "9",
        "review_title": "Contemporary Story for the right time",
        "review_detailed_main": "Most of the stories, be it the great Hollywood, the bright Bollywood or good old novels, usually start and stay focused on the the issues of how a woman is usually the victim. It is about emotional exploitation or tragedy associated with a woman. How she is tormented and how she suffers and all that. At the most the pendulum swings half way and delivering a happy ending. For the first time, so honestly a story been told of how men too are a total emotional wreck.\n\nLet's face it boys. We are definitely susceptible and there is absolutely no harm in accepting it. I enjoyed the movie for it's so realistic believable story, characters and even the details like the behaviour of each individuals in given situation. Contrary to what the film critics may say, I give this film 9/10. There is no over dose of over acting and false emotions. There is no useless car chase or gun fights or 'action' per say.\n\nMy key word for this movie is, 'believable'. The story definitely reflects a lot of the modern day men (or boys). Those who are objecting and finding it offensive and playing the feminist harp hear, please don't waste your time ladies. You have had more then your fair share of the sympathy. Now let the boys tell their side of the story.\n\nBoys, go watch it. Enjoy it and definitely learn from it. I strongly recommend this movie, not with your girl friend, but with other boys. Have fun."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "ayaanbhojani",
        "review_rating": "7",
        "review_title": "Entertaining Different Storyline Slow Pace",
        "review_detailed_main": "Gave it a watch for the 1st time since it's release way back in 2011, the film was good and entertaining with a relatable storyline doesn't make u feel it's from a different era even now. The whole star cast is impressive in their 1st film, the exhausting part of the movie is the slow pace and some things being stretched out that makes the film a bit boring though overall an entertaining watch. I rate PKP 6.7/10."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "mustafa-saify",
        "review_rating": "8",
        "review_title": "melancholy of every committed guy!!",
        "review_detailed_main": "yes movie is a complete resemblance of guys in a relationship. i know personally i have been in shoes of all three guys and know we can't do much about it. relationship is a chewing gum u can't throw neither u can sallow it. though i don't want to conclude that every relationship suffers same trauma. but in some way or other i feel guys have to go through all this! On serious note heart and soul of the movie is script and dialogues are. the punches are so comic that i burst into a laughter riot. A well done research on relationships and life styles of software engineers. A matured description of their professional life on screen. starting had gr8 impact depicting frustration of every SE. the pace of story is too nice never felt bore though it was 2 and half hour stretched. only thing which lost 3 points was too dramatic in last half n hour. the one more thing was the movie is not a cliché its an original with the feeling of next door story intertwined with lot of humor.\n\nsome of the scenes where so natural that i felt yes hey!! this what actually happens and the guy is speaking on behalf of me. and the 5 minutes of frustration of rajat(Kartikeya Tiwari) after her girl friend comes to vikram(Raayo Bakhirta) was the best thing in the movie. i know girls will protest that its bit harsh on them because the 3 actresses were shown was a bit over done.\n\ndirection was good. all leads were fresh and totally depicting the generation(gosh!cant imagine amir khan in 3 idiots) the acting was nice from all debutant but Divyendu Sharma(Nishant Agarwal) stood out among them playing a typical agitated SE who never had a girl but saws coll with his pals but when he got he fell badly.. reminds me some of my classmates.. music was good and fits completely wherever it was needed. life sahi hai has great lyrics which made me listen it twice.\n\nall n all please guys go n watch too sympathize injustice inflicted on us.. and girls please don't take it personally try to realize how u people treat as like dogs(ban gay kutta).\n\np.s. for my girlfriend- please sweetheart don't take this review and movie seriously you know how much i love u!!!!"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "Jini-B",
        "review_rating": "6",
        "review_title": "Surprisingly Great!",
        "review_detailed_main": "I have heard tons of things about this movie and one opinion was common: this movie was fun! The first half had some great jokes and relatable humor about relationships and how men are sometimes affected. Yes, this felt a little one-sided with only the male characters' stories being shown, but I couldn't really disagree with the fact that some of these things happen quite often in real life.\n\nThe actors were great in their respective roles: Kartik was awesome, especially in the 5 minute long monologue of his, Raayo was pretty believable as the guy who is super protective about his friends, and Divyendu was so good in his role as the frustrated friend-zoned guy. The girls were good too but Nushrat was the best among them.\n\nThe music was okay, with Kutta being the best one. The story was well-structured and really depicted love stories in modern time. A fun watch!"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "scarlatti90",
        "review_rating": "1",
        "review_title": "Really...is this what Indian cinema has come to?",
        "review_detailed_main": "I actually have to take time to review this atrocity to give an insight into what i think Indian Cinema has come to. This facade of so called \"hipness\" the movie forces down our throats has got to be the worst movie premises i have ever seen put to film. First of all id like to state i tried, I really tried to like this. Unfortunately asking for a decent movie from Bollywood nowadays an event rarer than the blue moon.\n\nLets begin from the top. The characters. i cannot imagine which fortunate lady broke the director's heart so badly that he had to commit to film a note of hatred to the female race in general. Speaking as a guy in his early 20's i find myself appalled by the level of hatred a woman is depicted in. The three female characters are shown as manipulative pardon my french Whores. I get it, that yes there are women out there that are like the ones shown in the movie, yet why do i feel that the movie wants to tell us that those are the ONLY types of women out there? The three male characters are two dimensional idiots who have practically no purpose in life than to be trodden on by these women. It actually hurts by brain on how stupidly these guys handle these situations.\n\nI haven't gotten to the main problem of the movie itself. Nope it isn't the horrendous acting, It also isn't the vulgar comments and unfunny sexual puns. Its the story or lack thereof. Movie 101 guys, There is a Sub Plot and a Main Plot. What this movie does is make the subplot the main plot making the whole movie a string of quarrels between the characters. Oh boy a movie clocking in at 2 hours comprised solely of quarrels between idiotic half brained couples is pretty much the whole movie. If you want to see a movie about men who have been scorned please watch something like 500 days of summer much more worth your time and money. Oh the ending...no one learns anything and both sets of groups go back to their original states not having learnt one lesson out of the whole ordeal. Please for the love of god do not watch this movie it is not as good as the trailers would lead you to believe. intelligent people of India hear my plea. DO NOT WATCH THIS MOVIE\n\nTL;DR DO NOT WATCH THIS FOR THE FEAR OF LOSING VITAL BRAIN CELLS."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "sansupercool",
        "review_rating": "10",
        "review_title": "Luv Ranjan deserves an award",
        "review_detailed_main": "excellent movie, and its the truth , that's how girls are after a relationship...Luv Ranjan has shown the truth and reality of how females are not just in Indian culture but all the cultures around the world.\n\nEvery guy should take his girlfriend to watch this movie or show this movie before they tie a node of relationship like a marriage...\n\nSo if girls quarrels proving herself that she is not like those one in the movie shoe might be of some other kinda then spend most of your time in a relationship know her better than later regretting and feeling screwed .."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "omshrim786",
        "review_rating": "10",
        "review_title": "Brilliant movie",
        "review_detailed_main": "I loved watching this movie. I read some negative reviews/comments, they are just lame, don't worry about them. Watch this movie if you get the opportunity. Dialogues and monologues are just superb. The character of Nishant Agrawal was very well played. Charu bashing up Nishant was a very intense scene (real fireworks). Nishat took the punches very well. These days' real life love stories are lust and power driven (materialistic), this is very well depicted in this movie. Most of the time guys while dealing with attractive female put their brain between their legs, with lots of blood following in the wrong direction the heart becomes soft and then falling in trouble is easy. You can't expect guys to be smart (emotionally balanced) at everything when their primary focus is on career. The Director got the best out the actors/actresses. Very well written and directed. Songs were just fine. I don't think it can be done better. Well done Luv Ranjan and Team."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "beautywithoutbrains",
        "review_rating": "",
        "review_title": "an over rated movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "darpantikiya",
        "review_rating": "7",
        "review_title": "Punches above it's weight...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "vicky-singh-iitm",
        "review_rating": "10",
        "review_title": "Just watch it...you will come out laughing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: New Age Heartfelt Romcom!!",
        "review_detailed_main": "Pyaar Ka Punchnama. Means the funeral of love. Actually it's a biased movie which only shows that the how few girls without heart make friends and turn them into boy friends (read puppets!!) but all this is showcased with such a sweet comic timing, the lingo that real people use in real world, amazing performances and a fantastic back ground score. All actors are fresh faces but they play their characters with panache. Choudhary, Rajat, Neha all these names remain with you long after the movie ends. But here show stealer is the character Liquid or Nishant played by new bee Divyendu. He gets all meaty and funny dialogs and delivers them with a funny face. He even gets the most emotional scenes, watch him when he breaks down in second half, you won't be able to stop your tears. Movie has all ingredients to strike a chord with today's youth and will go down in history as cult movie and some sort of Geeta for boys getting lost in the name of love."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "murtazaaly84",
        "review_rating": "8",
        "review_title": "Young male generation its for you !!",
        "review_detailed_main": "Excellent story, brilliant script, good acting.\n\na BIG well done to the entire team of Pyar ka Panchnama. I normally don't watch a lot of bollywood movies and if i do it would be horror or crime / gangster movies but this movie was strongly recommended to me by one of my friend and i decided to watch it.. and tell you what.. it was one of the best i have seen in \"comedy / romance\" genre.. it is so true every scene seems like something i have seen before happening to someone in real life.Brilliant acting from all the new guys and i think the casting was excellent too. The music could have been better but it can be easily ignored. To me its a complete entertainment package and you will come out smiling after watching this and hopefully all you young guys out there might learn a thing or two..\n\nIf you think you can't take 2hrs and 30 mins out for this movie, i would strongly suggest to think again.\n\nYou 've got to watch it!!!\n\nAnd yes \"Liquid\" was too good.."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "grvmehra09",
        "review_rating": "5",
        "review_title": "too long to watch, its irritating...watch it on DVD with fast forward button",
        "review_detailed_main": "the movie starts with excitement which looks good, the first track in movie is nice but slowly as the movie goes on its becomes boring and illogical too....and all the other tracks in movie are unnecessary that's brought me frustration. At the interval it looks like i am watching movie from past 3 hours.\n\nThere are some amazing great dialogues in movie but it doesn't help in pace of the movie and the climax is also disappointing.\n\nNothing much happens for a very long time.Divyendu and Kartikeya even manage to infuse some emotional heft into the proceedings but finally, this script proves to be too high a hurdle to clear."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "dpithadia94",
        "review_rating": "9",
        "review_title": "A movie you'll remember...",
        "review_detailed_main": "I don't normally watch Bollywood movies, but thought i will make an exclusion to this since it looked quite different...and am i glad i did watch it!\n\nAs i'm not so keen on the whole Bollywood scene, i figured i wouldn't like this movie. I started watching it without knowing anything about it, all i knew was as much as i had seen in a 5 minute clip, which in reality revealed nothing about the movie's plot. It's almost as you would expect from a very good quality movie, it has the mix of comedy and seriousness without ever making anything too far far-fetched, which, in my opinion, made this movie \"Pyaar Ka Punchnama\", one amazing watch! The first half of the movie is rather the funnier side, but nonetheless there are some serious 'issues' that are suggested. The second half (or even final quarter) was a huge contrast as it dealt with explaining the plot to the audience in a very realistic and serious manner.\n\nIn terms of cast, i was reluctant to judge this movie simply because of the new upcoming actors that were chosen to star in this movie, since i have seen many films that have had great success but have used unknown actors. However, in 'Pyaar Ka Punchnama', the line up is perfect! all the characters match up very well making the audience feel connected with the on screen visuals.\n\nThe story/plot may, at first, seem a little too familiar, but don't be fooled since 'Pyaar Ka Punchnama' has defied conventional movies that are based around the youth of today. It has a completely new take onto how we view people and relationships between one another.\n\nA must watch! Even if you don't understand Hindi then make sure you have subtitles, as this movie is worth watching no matter what your taste is. It is completely refreshing and i'll quite easily be watching this film at least once more in the next few weeks."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "usman-mir70",
        "review_rating": "10",
        "review_title": "Not a True story but true in every aspect",
        "review_detailed_main": "I came to know about this movie from my cousin while we were hanging out at his place and i was reading out the names of the movies he had in his computer. At the name of this movie he said and i quote \"this movie should be included in the course taken in any school, college and university\" because of its authenticity and i was like OK it cant be that true. Not being a fan of love stories i considered it to be a big slob However i started watching this movie and in the start i thought it to be like every other movie as Indian makes, a typical love story of young generation with a slight Delhi Belly mixture in it but after seeing the first thirty minutes of this movie i was glued to my Television, the reason being that this movie portrays the relationship stages so well that after every other scene i was having nostalgic memories which reminded me my time in a relationship. Every story in this movie was based on actual stages that comes in a normal boy's relationship, the start being happy and filled with excitement, then comes the trouble when you start expecting more from your better half and then the boy comes to face the ugly truth of a relationship, how women use every other argument in their favor when it is supporting them and ignoring it when it comes in favor of the boys. The fact that this movies represents all the boys and their problem is reinforced by the fact that girls do not generally tend to like this movie because they again think from their own perspective. This movie has drama, emotion, gentle comedy and all in all a complete entertainer. A must watch."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "thakur-abhi72",
        "review_rating": "10",
        "review_title": "true story.....",
        "review_detailed_main": "pyar ka panchnama, a movie presenting the real story of this generation. some people may believe that this is an attack on women but let me tell you, even girls agree on this being a true story. it is a comedy filled with reality. or you may say reality with a light hearted comedy. its not exactly romantic but yeah it is a love based movie. luv ranjan's work is really nice. he made this movie closely related to reality. actors were fine too. kartik as rajjo is also good but did a phenomenal job in his 5 minutes single dialogue. script is the power of this story. this is like the most legendary movie ever made in Indian cinema presenting the general situations at a given time. must watch...."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "CriticGirl91",
        "review_rating": "8",
        "review_title": "Very Fresh",
        "review_detailed_main": "Things I liked about the film: -Very fresh approach to making a film -No unnecessary drama, quite realistic - Interesting Storyline -Excellent, realistic acting -A very different concept -Good humor\n\nOn the downside: -Very long, gets boring - Nothing special about the music -Seems a little far fetched at times\n\nI loved that there were no stereotypical characters in the film. The turnabout from dominating men to women is interesting. Divyendu Sharma is the pick of the cast for me. Superlative acting by him. After seeing so much mundane, and cliché stuff on television and in films, films like these are a breath of fresh air and should be encouraged."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "A_Voice",
        "review_rating": "9",
        "review_title": "Possibly the best presentation of old tried and tested content !",
        "review_detailed_main": "Before I express my opinion, I feel its my duty to tell you that every girl and every guy are not like the ones depicted here. There certainly are bad guys and good girls. A girl might not be at fault always, see Chalte Chalte for instance. Though the story of the 6 in the movie certainly is a mirror for the masses.\n\nStory offers nothing you haven't seen before, though a brilliantly written screenplay, tight direction and excellent performances makes up for it. As I said it is possibly the best \"adaptation\" to a previously explored idea. It is a story of three best friends/roommates who fall in love and start to re think their decisions. The song \"Ban Gaya Kutta\" pretty much sums up the movie. So an advice, rather not listen to the track or watch the trailer before the movie, they give too much away.\n\nThe movie moves at a right and healthy pace, the two and a half hours are almost unnoticeable. After depicting the strong bond between the friends it takes no time to shift towards the \"love story\" track. Despite so many positives there were few elements of the movie which could have been improved upon. Firstly, the movie is made keeping in mind only the \"male perspective\" and largely drifts to being a \"female chauvinist\" film depicting the aggrieved males. As I said earlier, it is not always the same, but similar. The female actions could have been better explained. The climax (females) could have been a little different, as it might offend girls. But I guess that would have spoiled the overall effect of the film and would have elongated it unnecessarily. A time skip could have been the best choice. Secondly, the song \"Ban Gaya Kutta\" could have been better lyric-ed, as it is too abusive and unnecessarily so. Whereas, slang in the movie were the soul of it and were a necessity. These are completely ignorable, especially for the male audience.\n\nDirection: Couldn't have been better.\n\nStory/Screenplay: An outstanding screenplay. The direction and screenplay rejuvenate the overly-exploited topic of \"life after relationship\".\n\nActing:- Divyendu is a talented new find in the Indian cinema, a path breaking performance by him. Rayoo and Karthik completely fit their characters. Same goes for Nusharat and Ishita. Riya however, wasn't as promising as others.\n\nMusic: The background music is superb and extremely fitting. Soundtrack is a driver for the movie rather than an unnecessary hindrance.\n\nOverall, a highly relate-able laugh riot, a must watch!"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "usamazaka-71034",
        "review_rating": "1",
        "review_title": "Boring af, one of the worst I've ever seen",
        "review_detailed_main": "Uninteresting plot and pathetic comedy... Even the actors have not done their part as required. Don't know how it got a 7 star rating for me it deserves 0."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "shaziyaabdullah",
        "review_rating": "10",
        "review_title": "Pyar Ka Punchnama",
        "review_detailed_main": "super movie for guys to see difference between Indian girls using boys, many guys have dumped their girlfriends after this picture, its a huge hit in UK also, but only on DVD which is not available easily. this movie applies universally to all girls and boys. when is part 2 coming ? do worldwide release so we can watch on big screen. good actors in the movie, very talented. watch it WITH YOUR GIRLFRIEND PLEASe. then realise all girls are not same, though some are like in the movie. best part is all new actors are cute, and choudhry is very hot and liquid is cute.both good actors and babu is good. youth films are good and better than old bollywood style movies, some bollywood film people are making good new youth movies like this. India is doing good now."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "ayushseek",
        "review_rating": "10",
        "review_title": "masterpiece :))",
        "review_detailed_main": "No more words. Excellent dialogues,excellent cast,excellent plot.The movie is for any age and specially for youngsters.A must watch that you can watch over and over again and never get bored.Kudos to great film :)) A hall of fame exclusive that is unparalleled.WOW WOWW OWWOWW OWWOWWOW ......... ...... .............. ........ .................WOWW OWWO WWO WWOWW,,,,,,,,,,,,, ,,,,,,,,,, ,,,,,,,,, ,,,,,,,,,,,,,,,,,,,OWWOWWOW WOWWOW.. BAN GYA KUTTA ,BAN GYA PATHA........................... ........... ..... ................ BAN GYA KUTTA ,BAN GYA PATHA.......................... ................. ........... ............ BAN GYA KUTTA ,BAN ............................... .............. ............GYA PATHA BAN GYA KUTTA ,BAN GYA PATHA BAN GYA KUTTA ,BAN GYA PATHA..WOW."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "caiged",
        "review_rating": "",
        "review_title": "Plenty of Pyaar but lacked the final punch!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "tushargupta-27286",
        "review_rating": "10",
        "review_title": "Reality for girls",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "nitishkumarmohanta",
        "review_rating": "9",
        "review_title": "BOYZ- Just Go For it, And that too ALONE😂 (not with GF or Wife)",
        "review_detailed_main": "Ha ha what to say! It's brilliant and way ahead of it's time as well. What's exactly happening in today's time is the plot of this movie ; that too written before a decade, which is brilliant guys!\n\nThe Screenplay, Acting, Songs, Moments are properly executed in this entire movie.\n\nI can say it's a Gem. And I will love to see lots and lots movies like this in upcoming days, but sadly I couldn't find any movies like this masterpiece. Just go for it guys...\n\nI am going with 9 Out of 10 Stars for it and will tell you to avoid watching with family members,even with GFs and Wifes as well.. You'll know it after watching.. It's an Eye Opener and you must go for it."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "maychat",
        "review_rating": "10",
        "review_title": "still az fresh as it was",
        "review_detailed_main": "One of my all time fav comedies so relatable still so fresh even after watching it umpteenth time waiting for pkp3"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "ddddishaaaa",
        "review_rating": "1",
        "review_title": "Not a good team and Why make such movies? overrated crap!",
        "review_detailed_main": "Normally I know every film is made with lot of efforts but I just don't see why such garbage needs to be created. Garbage ! It is just busy taking jab on women. Full of sexist joke and women hate. Men who laugh on it is worse as they are being brainwashed to hate women."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "arpankarpan",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "Harshithnagraj",
        "review_rating": "10",
        "review_title": "Reality",
        "review_detailed_main": "One of the best romance drama in hindi. Made on complications of today's generation youth with comedy. Really it deserves a 10 Stars"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "ups-36964",
        "review_rating": "9",
        "review_title": "Can't believe this was made in bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "vishaal811",
        "review_rating": "8",
        "review_title": "A Refreshing Movie suitable for the youth!!",
        "review_detailed_main": "Pyaar ka Punchnama yearns to be different from the usual fare, and it manages to succeed to an extent as it showcases the everyday life of young guys living on their own without any help from their parents.\n\nThe film focuses on the life of three men who are desperately trying to get into a relationship. Despite not having any well-known actors, the relatively inexperienced cast does a wonderful job with all the roles being memorable. During the second half of the movie, there is an almost five-minute long monologue magnificently delivered on the various problems that occur during relationships.\n\nThe first half breezes along at a good pace and raises the expectation of the movie. However, the second half features some needless melodrama that dampens the overall impact of the movie.\n\nA major flaw in Pyaar ka Punchnama is the misogynistic tone. All of the women in the movie are portrayed as villains and are completely one-dimensional. The lack of empathy and courtesy shown by the female characters seems unrealistic.\n\nApart from certain shortfalls, Pyaar ka Punchnama delivers an entertaining movie that is different from the mindless Masala movies that are offered by Bollywood. The acting, direction and dialogs are the highlights of this must-watch movie."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "tegrazero",
        "review_rating": "10",
        "review_title": "finally a good movie!",
        "review_detailed_main": "Amazing acting by that lad. this was very refreshing. it's very groundrooted movie"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "ujjusaab",
        "review_rating": "4",
        "review_title": "Had a potential, but script gets weak",
        "review_detailed_main": "Well.. I happened to see this movie by a recommendation of our infamous Dhruv Rathee as he called this a 'cult' film in one of his videos .... Also had some expectation since the portrayal of men stuck in toxic relationships mostly had a comical angle in mainstream Indian cinema and this one would be more satirical take on it especially in a post modern era where women's any choices are considered 'vulnerable to questions' by our media\n\n... but but but ...\n\nthe reality is film doesnt give any sort of engaging factor to it.. the characters are neither authentic nor convincing in any way... the male characters are okayish with the performances over writing but coming to females its entirely blunder.. the females in this film are just extended version of 'irritating girlfriend stereotypes' which we have seen in movies like Dil Chahta Hain.. there aren't any nuances or anything positive about them which doesn't make us reasonate with them, and eventually makes us think \"why do these fellas hang on to these damsels ?\" Kartik Aryan, Raayo and Divyendu Sharma are pretty impressive in their roles and the friendship angle is brilliantly portrayed. Coming to female counterparts, sorry to say, are just eyecandies with mindless toxicness. Music is pretty forgettable (ban gaya kutta is ok).\n\nMonologue part is well written and presented. I didn't feel it as a sexist as it is just an outburst of a young man doomed in a situation.\n\nEnd note : I am not of the typical feminist argument this is a hardcore sexist movie. It would be pretty hypocritical if we are feeling 'pity' for Preeti staying with Kabir after the whole ruckus and 'joyful' when Murad (gully boy) still in with Safeena after seeing flaws of both their sides. But the thing is that these movies had a convincing factor which makes the situations non questionable, but PKP doesnt create the expected impact."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "vikassinghvs-70220",
        "review_rating": "9",
        "review_title": "Rewatched and liked it even more",
        "review_detailed_main": "I watched this movie in the theaters in ~2011/12 and I really liked the movie. The movie had overall good performances and Amazing act by Liquid. The monologue by Rajjo created laughters in the theaters. It was all a very good watch.\n\nCut to 2022 , I thought of watching this again partly to see if I remember any part of the movie and partly to check if I still like the movie given that It has been 11 years and I am in a different phase of life and whether I would find it good or silly or awesome. I had just joined office when the movie released. One more reason of watching this movie was to see how this movie is criticized by some so called top critics as patriarchal .\n\nThis time when I watched the movie it brought nostalgia on how friends use to live in a flat with just work ,friendships and drinks- foods in their life . How they used to eat at Dhabas and how the life used to give little more spark to them when a girl entered their life. The movie is more or less about the same but it tends to show how the life is affected adversely when you don't find the right partner. This time rather than comedy performance I could relate to all the three characters of the movie and how each one of them is dealing or stuck in a relationship or phase. Also, from a boy's perspective it is quite true shown in the film regarding the choice the characters make and May be they made it because of love or because of the fact that it is very hard to be in a relationship for a guy because of obvious reasons and it is also true that every person watching the film could relate to a movie in one way or the other.\n\nHaving said that the movie is not an eye opener nor it should be seen that way neither the movie depicts all women in bad light . It just shows a journey of three friends who came into relationship that didn't suit them.\n\nRecommend everyone to watch regardless of age."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "MuviFan73",
        "review_rating": "9",
        "review_title": "Nice take on certain ill category of girls!",
        "review_detailed_main": "This is one of the movies which shows take of certain girls who are into relationship. I am sure that most of the girls will show hatred towards movie but who knows if they are real. I being a guy enjoyed a movie sooooo\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085..\u0085 much. Even watching it many times, you would not get bored.\n\nEvery guy character has laid down their own specialty, Nishant (Liquid's) dialogue in general and regarding union of boys against girls, Long dialogue acted by Kartik (Rajat) and general acting by Raayo (Vikrant)."
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "jdicctv",
        "review_rating": "10",
        "review_title": "Moral",
        "review_detailed_main": "Better use and leave girls. If u love them they will screw ur life"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "aaryananellu",
        "review_rating": "9",
        "review_title": "BETTER THAN IT'S SEQUEL",
        "review_detailed_main": "The film is phenomenal. First of all, i would like to appreciate the cast, Divyendu as Nishant/Liquid never bores you and keeps you laughing with his sense of humor, Kartik and Rayo too play their roles with great efficiency, Nushrat Bharucha, Ishita Raj Sharma and Sonali Segall play the antagonists in this film and are perfectly fit for the roles. The film however gets slow in the second half, which focuses on how the relationships have turned out for the 3 main characters, only one star cut for the same, otherwise the movie is ahead of the time it was released in and director Luv Ranjan's new concept is impressive. Waiting for it's third part and I hope they cast Divyendu again"
    },
    {
        "movie_id": "tt1926313",
        "movie_name": "Pyaar Ka Punchnama",
        "movie_rating": "7.6",
        "review_username": "sanjanapatnaik",
        "review_rating": "1",
        "review_title": "Worst thing I've seen in a few decades",
        "review_detailed_main": "The movie falls short in almost every aspect, making it a regrettable viewing experience. If you relate to this movie, you need a breakup and therapy. It's hard to find a redeeming quality in any of the characters, as they lack depth and relatability. The humor feels forced, lacking the cleverness and wit expected from a comedy. The second half of the film becomes a tedious slog, seemingly prolonging scenes unnecessarily to pad out the runtime. Instead of investing time in this lackluster film, there are countless other options available on platforms like Netflix that offer more engaging and enjoyable content. One commendable aspect, however, is Kartik Aaryan's ability to deliver a lengthy monologue with precision and charisma, showcasing his talent amidst an otherwise disappointing production. Overall, the movie is best avoided, as it fails to offer anything substantial or entertaining."
    }
]