[
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ckaran80",
        "review_rating": "9",
        "review_title": "As good as blood diamond and green zone...",
        "review_detailed_main": "Madras Cafe is a political thriller which although claimed fictional, is inspired by real events. Its tells the conspiracy behind the assassination of ex-prime minister of India and the War situation in Baffna region of Sri Lanka...The movie is fast paced and is so intriguing and well-crafted that it can be easily this years best...\n\nWith zero publicity stunts, Madras Cafe director Shoojit Sircar tries to go out of conventions and comes up with this masterpiece...Political thrillers are ones which people in bollywood rarely attempt, and Shoojit does it bravely...Right from the start, the plot involves you in such a way that it is hard to come out of it.The pace of the movie, entangled characters,series of events, unveiling of conspiracies and then finally the climax- all are up to mark and hence make this movie a spectacle to watch...\n\nThe Screenplay is fabulous- it divides the movie in two parts efficiently. First, the war conditions in Baffna and then the assassination plot.In between shocking plots are revealed and it covers a vast script in its runtime.The reason why i compare this with Hollywood masterpieces like blood diamond and green zone is not because of the similarity, but due to the fact that Madras Cafe maintains the originality of facts while imbibing the fast paced and thrilling plot.\n\nJohn Abraham plays the lead role and this could be his best performance after dhoom, and does total justice to his role.Nargis Fakhri is the surprise package and shows that she can be versatile...The supporting cast is totally naive but they give their very best...\n\nThe only drawback or error you can say is relatively average editing.Its cliché and too short for many scenes...\n\nBut as a whole, Madras Cafe is a sinister, evil political thriller which is supported by intense acting and direction and the plot is simply ravishing.Its a sign that bollywood has started making sensible movies on a large scale.\n\nMadras Cafe is not for crowd who like Chennai Express,Rowdy Rathore or Dabang, but it for those who acknowledge movies like A Wednesday, Shanghai and Rang De Basanti. This one wouldn't be watched on a large scale, won't gross in hundreds of crores,will not receive flurry of awards...but for me its simply one the best that bollywood has ever produced..."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rajanahuja4",
        "review_rating": "9",
        "review_title": "Probably the best movie of it's genre from the Indian sub continent",
        "review_detailed_main": "Probably the best movie of it's genre(spy/espionage/war/politics) from the Indian sub continent ever. Well researched, scripted and dramatized with a gripping pace and thrilling twists. Indian commercial movies normally have very faint reflection of reality or they go overboard in their desire to please all with more than a pinch of spice, item songs, super hero justifications and other indispensable Indian commercial considerations. But this one beats it all and yet retains the charm of a commercial flick. A perfect balance and a fine confluence of commerce and art,rarely seen in Indian cinema. A very strong script with probably the first ever peep into the working of Indian Intelligence Agencies and a panoramic capture of serious geopolitical subject with utmost honesty. A movie which remains true to the core yet maintains a edge of the seat drama through out. Not to be missed for the lovers of good Indian cinema, meaningful & superbly entertaining."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "nevilpachani",
        "review_rating": "9",
        "review_title": "Worth a Watch!!",
        "review_detailed_main": "Madras Cafe is a wonderful representation of Sri Lankan civil war from the viewpoint of India. Critics state that it fails to capture the emotional aspect of the war but it was never meant to be viewed from the Lankan point of view.\n\nIt is a non Bollywoodish movie where we find no songs, dancing etc. There is no stupid romantic crap in the movie which other Indian political movies show. Relationship of John and Nargis is strictly professional(the way it should be).\n\nOne of the best Indian movies of the year after probably D Day and Ranjhaana. WATCH IT PEOPLE!!!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "shubh_328-471-817687",
        "review_rating": "10",
        "review_title": "Wow!!!... Intellectual, Gallant and a Brave Factual work of Cinema... Caution: Miss This At Your Own Risk.!!!",
        "review_detailed_main": "It took 3 films and 7 years for Shoorjit Sircar (director) to deliver us with undoubtedly the best political thriller we can savor ourselves over a long time. 'Madras Cafe' is unarguably a gem of a movie that belongs to a rare genre of Bollywood cinema and deserves much more attention and applause than what it's being receiving.\n\nThe film is based on the backdrop of the Sri Lankan civil war in the late 1980's and early 1990's. It crosses its path with the plotting and execution of the then, Indian Prime Minster, whom we understandably can make out as Late Mr. Rajiv Gandhi. This film is so well crafted; it was not possible to find out a loophole in the entire plot.\n\nJohn Abraham (Producer), who plays as a RAW Officer has done a 100% justice to his character Vikram Singh. There are noticeable fluent and honest performances from Siddharth Basu and Nargis Fakhri (Rockstar) on the other hand as well. If you want to know more about what's inside, you have to go and watch it yourself. Although just do a bit of homework on the Lankan civil war events that occurred in the late 80's. You would not regret it.\n\nThere was one drawback of the movie though. The movie had an end. But as they say 'All good things comes to an end'. So, I guess it to be that way.\n\nMadras Café is a slap on the faces of all the directors and also on the ignorant and bogged down movie goers who are ardent worshipers of senseless commercial cinema that has plagued Hindi movie industry over the last year and half. John Abraham here has to be appreciated immensely for the effort he has put in out of the movie, since; there was no one who was ready to produce this movie earlier until he accepted this project to invest in.\n\nThank you John Abraham and Shoorjit Sircar.\n\nWithout any second thoughts, being thankful and much obliged with this Intelligent and brave cinema,.. I'm going with an esteem ★★★★★★★★★✩ (9.1/10) for Shoorjit Sircar's Madras Café. This one is a Must Watch.\n\nWatch and BE ENLIGHTENED..\n\nCheers"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "RebelRavindra",
        "review_rating": "10",
        "review_title": "One of the best Political Conspiracy Thrillers... AWESOME !!!",
        "review_detailed_main": "Madras Cafe is super awesome, totally moved by this conspiracy thriller. The movie had no regular commercial elements, no songs, no romance, no sh*t. It was bang on target since the first frame of the movie. The whole content of the movie is totally legitimate. Director Shoojit Sircar should be appreciated for a brave attempt on showcasing the political conspiracy involved in the assassination. The direction was great, specially the scene involving the assassination. That was the best scene of the movie.\n\nScreenplay of the movie is very tight, It was fast paced, though there are no entertainment elements, The movie will not bore you. My a** got glued to the seat and eyes on the screen. John Abraham did a great job by selecting such kind of a movie. He did extremely well.\n\nWill definitely have a re re re re watch for this movie... LOVED IT !!!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "iruled16",
        "review_rating": "10",
        "review_title": "John and Shoojit team is much better than Ajay and Rohit Shetty.No fake actions no stupid jokes",
        "review_detailed_main": "Madras Cafe is not only one of the best releases but the only best release in this recent time. John is no more expression less actor.HE worked extremely hard in his recent projects and proved him.And he is at his best in Madras Cafe. Talking about Nargis her accent is good but should have done hard work on her acting skills. Thank God no Lungi dance at the end but a beautiful song called Maula sun mere. And then the Assassination. As we all know the end but it keeps us on the edge of our seat till the last scene Credits to Shoojit Sircar. Very realistic,great performances by everyone and great direction. They killed him .We lost him for no mistake.He was so young. This touches everyone Hearts......"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "cyberundertakor",
        "review_rating": "10",
        "review_title": "Kudos to Indian Cinema",
        "review_detailed_main": "Rather than writing a long review explaining the Pros and Cons this is Indian Cinema which now is evolved.\n\nRather than pleasing the masses they have now gone ahead and showed the truth.\n\nThe beauty is that even when the audience knows that what has to happen in the end The director still holds us to the movie.\n\nIt can be said now that filmmakers in India can boldly make real-life stories without fear of controversy or censorship, this may be the best way to approach important stories that must be told.\n\nA Must Watch film and good job by Shoojit Sircar.\n\nWell Done Team of Madras Cafe."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "lediscipledessocrates",
        "review_rating": "7",
        "review_title": "Choose Madras over Chennai. It is Crisp, Clean and Clear.",
        "review_detailed_main": "There is absolutely no reason why you should not watch this movie. It is by all means a pretty decent thriller. Utterly devoid of the superfluities and terse to the point of being of labelled as \"un-bollywoodish\" the movie represents all that is desirable in an entertainer.\n\nMy brother quite ably put it into words when he declared that the charm of the movie lay in it's abstinence from over indulgence.\n\nJohn Abraham does a commendable job (except for , may be a few scenes, where it is his bad make up and hair do which need to be blamed more than him) .\n\nHe is supported by an able cast of actors who deliver credible performances.\n\nThe script isn't circumlocutory and the Director isn't shy of laying down facts and opinions in an unequivocal and objective manner.\n\nThe absence of songs , does wonders for the health of the audience and the movie too. Needless to say there is no parallel romantic plot disturbing the flow of the narrative.\n\nIn fact the movie checks itself every time there a temptation beckoning it over do things.\n\nThe Director is honest and doesn't mince his words when describing the situation as as he sees it.\n\nIf you have stepped out for a movie and are thinking about catching the last express to chennai , believe me , you ought to change your itinerary and catch a cup of coffee in the café."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: What a Cafe to be in!!",
        "review_detailed_main": "Madras Cafe is a kind of political and espionage thriller that Bollywood never tried before. First half requires your patience. It is a mix of striking visuals, haunting sound design, introduction of key characters, their motives and the felling that something is not right. Second half is a piece of cinematic perfection where characters gets meaty dialogs, feel of danger keeps growing and finally in the climax you feel helpless like our hero. Based on actual events mixed with fictitious characters, Madras Cafe becomes a very important movie that should be watched by every Indian. Acting is top-notch. You won't be able to forget the imagery of first half and tension of second half long after the end credit starts. Director Shoojit Sarkar provides the ample conviction and uniqueness to whole idea and surprises you with his versatility (he directed Vicky Donor before). The movie has little flaws like packing too much information in first half and few key details not described clearly. But I can say with full comfort that it would be a mistake if you give this movie a miss."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "SivakumarBalachandran",
        "review_rating": "6",
        "review_title": "Reality Cinema about an important history of Indian politics with no commercial adulteration",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "namashi_1",
        "review_rating": "9",
        "review_title": "A Solid Political Espionage Thriller!",
        "review_detailed_main": "Set in the late 1980s and early '90s, during the time of Indian intervention in the Sri Lankan civil war, 'Madras Cafe' is A Solid Political Espionage Thriller by Director Shoojit Sircar. Its brilliantly directed, sharply written & commendably acted. Surely, among the finest films from 2013!\n\n'Madras Cafe' Synopsis: An Indian Intelligence agent journeys into a war torn coastal island, to break a resolute rebel group. He deftly maneuvers his resources to make significant breakthroughs, amidst a scenario where the enemy has no face and the only counsel is 'Don't get caught.' The story unfolds as his quest for the truth reveals a deeper conspiracy, by a faceless enemy, united to seize a common nemesis.\n\n'Madras Cafe' begins & ends, superbly. The twists & turns in the narrative are simply terrific, while the drama moves on a super fast-pace. In fact, 'Madras Cafe' gets better with each passing scene. The raw & brutal approach, along-with a nail-biting culmination, take this critically acclaimed film to dizzy heights.\n\nSomnath Dey, Shubendu Bhattacharya & Juhi Chaturvedi's Screenplay narrates a brutal human tragedy, sharply. Shoojit Sircar's Direction is brilliant. He deserves distinction marks for executing this rather difficult film, with such precision. Cinematography is excellent. Editing is pretty crisp. Action-Sequences are effectively done. Music & Background Score by Shantanu Moitra, are top-notch.\n\nPerformance-Wise: John Abraham delivers a convincing performance. Nargis Fakhri is first-rate. Rashi Khanna steals the show. She enacts a complex part, with wonderful control. Siddhartha Basu leaves a mark. Others lend good support.\n\nOn the whole, 'Madras Cafe' is a must watch."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "suvopyne49",
        "review_rating": "7",
        "review_title": "Well directed, well shot, but not well acted.",
        "review_detailed_main": "Often come films that are terrible yet has its cast performing extra- ordinarily. The rare ones are where the film is superbly directed with a fine story, but let down by the cast. Madras Café is an example of the latter ones.\n\nThis espionage thriller is set in Sri Lanka during the 80s and 90s, while the country was torn in Civil War. The ethnic clash claimed number of innocent lives. The-Assassination-of-Rajiv-Gandhi-inspired incident served as the central point, around which the story is spun. When the conflict reached its zenith though rebel group of Tamil ethnicity, LTF (based on LTTE), India decided to intervene and send a peace force. This is where, our protagonist, Vikram Singh was sent to the war zone to ensure the operation of Peace Force does not fall through.\n\nBased on this promising premise, the story moves in considerably apt pace, weaving more threads, that culminated the cloth of the grand conspiracy. The screenplay deviated from the traditional three-act structure of storytelling; and it suited the narrative. The credit goes to director Shoojit Sircar for his relentless grasp on the film. There was barely a moment when the intensity of the film falters or the tone gets shifted. The documentary-style depiction of war casualties helped the cause of the film.\n\nThe two lieutenants for 'captain' Sircar would be Kamaljeet Negi and Shantanu Moitra. Negi's cinematography is remarkable, making some of the frames look like work of art. Moitra's background score set up the tone of the proceedings that were happening on the screen. For a Bollywood film, there is a scarcity of songs (read unnecessary songs), but when there is a song, it just drives home the point of the film.\n\nOn the negative side, as mentioned earlier, the cast was a letdown. That is why, it seemed, director had to compromise with the character development. Granted, an espionage political thriller does not require much of a character study. But, when your protagonist undergoes plenty of different scenarios, it should yield at least one or two not-so- similar emotions. Perhaps, John Abraham's acting prowess forced Sircar to make his lead character a one-dimensional one. Also, the out-of-sync conversations between Nargis Fakhri (a British Journalist) and Abraham often were cringe-worthy. Having Fakhri delivering all lines in English hardly improved what she could have delivered in Hindi. The support cast, barring a decent Siddharth Basu, did not support either.\n\nIt is a well-directed, well-shot film with a very good story. Just the same cannot be said about the acting of the cast. Notwithstanding that, this is an indication that Bollywood is slowly moving towards maturity and quality after a long time. Good political thrillers are hard to come by in our industry, and this one definitely worth a watch."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "claus-50",
        "review_rating": "4",
        "review_title": "Trying hard, but ...",
        "review_detailed_main": "I'm a stranger to Indian cinema, other than being familiar with the usual clichés of Bollywood-style song, dance and drama.\n\nI read some reviews here, recommending this movie, and calling it a genuine political thriller. Well, it is. Sort of.\n\nIt's hard to describe what I feel is wrong with the movie. The plot is believable, and you want to see more. Not being intimately familiar with the horrible history of the Tamils, and having read only scattered articles here and there, I did not have any way to determine whether the movie was true to facts or not, and for this I apologize.\n\nSo, what's wrong? Well, it feels like there is an entire plot here. There is. But it feels like someone sat down, wrote a list of \"what makes western political thrillers good\", came up with 10-12 key scenes, and made those. Without really bothering too much with tying them together. It feels not so much rushed as uncohesive. And that's a shame, because ..\n\nThe visuals are nothing short of stunning. Excellent camera-work, glorious colors, scenery, and almost worth watching for this alone.\n\nBut ultimately, for me, the story is where the substance is. And in this one - perhaps this is due to me being unfamiliar with Indian cinema - it just feels cut to pieces and abrupt. Key events just \"happen\" from one scene to the next, and if you want to keep up with who's who, and who's pulling what strings, don't blink for a second.\n\nGiven that I don't know the material intimately, like I would with say a WWII movie, or a typical cold-war spy movie, and the actors were all unfamiliar to me, this movie was hard to follow. Perhaps for a more local audience, it would be infinitely more enjoyable. I do hope so, because it is a gorgeous movie, and I desperately wanted to like it."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vikramsamal",
        "review_rating": "9",
        "review_title": "Best movie of the year: Well almost",
        "review_detailed_main": "Madras Cafe: A realistic take on the life of spies and RAW agents. Its not really as stylish and bed of roses as depicted by Bond et al. And they don't always win. And it must be scary to know that one wrong movie on your part, the country's defense can be compromised. Madras Cafe is a tale of the Tamil surge in SriLanka, rise of LTTE and the subsequent side effects ending in the assassination of Rajiv Gandhi. Its a docudrama, showing most true incidents that happened behind one of India's most tragic events. A taut script, fantastic BG score and wonderful direction makes Madras Cafe nearly the best movie of the year. And after somewhile I really enjoyed a John Abraham performance. More than anything, hats off to John for producing this movie. All Kashyaps, Motwanes watch out, cause Shoojit Sircar really knows how to make serious topics in mainstream. And his Journo background must have held him in good stead while making this.\n\nMy entry into the Oscars this year.\n\n9/10"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "grande_illusion",
        "review_rating": "8",
        "review_title": "Objective portrayal of LTTE struggle",
        "review_detailed_main": "The political opponents of this film have been proved wrong. Politicians and their sidekicks should first watch the movie before they start screaming \"ban, ban\"! The film manages to take a cleverly done objective stance of the LTTE fight for Tamil Eelam in Sri Lanka and the circumstances that led to the killing of former India PM Rajiv Gandhi. The film could have a better impact if it used names of the real people they trying to portray instead of resorting to semantics to camouflage their identities, while at the same time making it so obvious as to who the characters represent. However, overall it is a thriller which works well unlike Kamaal Haasan's \"Vishwaroopam\" released few months ago, with a similar theme."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rickbarni-233-509919",
        "review_rating": "8",
        "review_title": "Perfectly blended Coffee .... Well served Madras Cafe !!",
        "review_detailed_main": "Madras Cafe serves you the best Political thriller of Bollywood so far. It gives an inside, one man perspective view of the crisis that India faced over late eighties and early nineties. A National crisis to which the Nation was ignorant (other than South elm) until their Prince was assassinated.\n\nIndo-Sri Lanka Peace Accord in late eighties turned into our own Vietnam (mentioned in the movie too !!) when the Peace keepers suffered the brutal violence. Inexperienced in Jungle Guerilla warfare , low on intel, Indian Regular Army took way more heat than the pre-estimate.\n\nThis movie takes you right there, when strategies were been compromised, missions failed and search for mole began. And continuing on a thriller ride, it throws you to the conspiring plot of Rajiv Gandhi assassination.\n\nPros: Authentic, very much detailing in the story line. Fast paced thriller.\n\nRAW never looked so smart, their equipments never looked so real and so do their men. John Abraham didn't become John Rambo neither James Bond.\n\nLead actress (portraying an NRI journalist) didn't utter a Hindi word in a commercial Bollywood movie. Big Kudos to the Director !!\n\nCombat scenes were gore, short & realistic and not exaggerated. Bullet effects,gun recoil, soldier's positions these usually overlooked areas were been paid full attention.\n\nGood budget brings helicopter long shot, brilliant location and areal photography.\n\nCons: Only major flaw I felt - Too much shaky camera movement. Dolly tracks are hardly been used. I actually got a headache after leaving the theater.\n\n\"Where the mind is without fear and the head is held high\" ... Soojit Sircar fearlessly just not presented one of the worst Indian political blunder but also held his head high above the commercial, controversial pressure. He has shown the guts to stay away from masala pricks (not even a single back ground song comes to hinder the pace till very last, no parallel love story building up within the lead pair)\n\nIndo-Pak war / tension even RAW covert missions have been featured in Bollywood for many and in recent times. Its a safe segment to have your audience with a patriotic breeze. But Soojit did not hesitate to read out those chapters which are not very much welcomed in Indian History. This movie may not do good in the box office which is ruled by all the Circus stuffs. But it has set another benchmark in Bollywood, and that will be real hard to reach."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "amit_jha11",
        "review_rating": "9",
        "review_title": "best movie of 2013 so far !",
        "review_detailed_main": "madras café : 4 stars\n\nMadrasCafe best movie of 2013 so far ... Enjoy and promote good cinemas\n\nThank God!!! After such a long time some good work will be at the box office's. Bollywood should at least learn something from people like Sircar. It's not about songs , dance & b-grade comedy \" Don't underestimate the power of a common man\". However not only the makers are to be blamed here for poor films for the whole year, it's the viewers who make a garbage throwaway.When masala trash of greedy producers holds back the Indian cinema from making a decent piece of work, movies like Madras Cafe catapults it in to the 21st century cinema. Great work. riously, it's time now to get off the \"Chennai Express\" and get into \"Madras Cafe\" for a cup of the compelling,well scripted film.and overcoming the so called 100 core tamasha. Really got bored of daily listening to the account balance sheet of Chennai express\n\n*dont compare movie beauty with price"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rightwingisevil",
        "review_rating": "",
        "review_title": "Wrong cast and bad script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vishal_khanna",
        "review_rating": "6",
        "review_title": "Could have been much better",
        "review_detailed_main": "Madras Cafe's only winning point is its excellent screenplay. Though the film is based on Rajiv Gandhi's assassination, but if the writers did not have access to too much intelligence information, then they have done an outstanding job conjuring up the script.\n\nWhat fails for the film, primarily, are Shoojit Sircar's direction and Kamaljeet Negi's cinematography. Sircar's direction is at best - average. He is incapable of extracting good performances from his actors. His storytelling and treatment lack lucidity. The cinematography in the first half of the film is very jerky and 'random'; with excessive use of track trolley in scenes shot inside the bureau.\n\nThe film's pace has been kept so fast that it's hard to keep up with the overflow of information. The on screen subtitles and supers seem to be put in as a mere formality. The film also has several anachronisms - most of them being John Abraham's costumes; others in sets and props.\n\nAlthough the film is a surrogate retelling of Rajiv Gandhi's assassination plot, not once does it mention his name. In fact, that particular character doesn't even have a name in the film. This is a major let down.\n\nThankfully, the second half has been shot much better and the film ends very organically - again a victory only for the writers. This film is definitely a one-time watch, although for me, it is definitely not a landmark film in Indian cinema."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "kulkarni-ajay-a",
        "review_rating": "9",
        "review_title": "Plot is gripping",
        "review_detailed_main": "Its a political/war movie and the story line is very strong.The first half feels a bit disconnected with short scenes. The movie is very fast and sometimes you lose the plot. Feels like they had a lot of content and wanted to fit everything in a two hour movie which was actually a good Idea. Length of the movie was just perfect.\n\nThe second half is extremely gripping and connects all lose ends. In the end everything connects very well and everything makes sense.\n\nActing wise John was OK. Nothing exceptional about him. None of the characters actually standout. There are some emotional scenes but none of them actually make you cry. Its hard to imagine John Abraham make you emotional purely on the basis of this acting.\n\nTo me the true winner over here was the story line which is extremely gripping and makes up for everything. In the end its a good watch and leaves you wondering about a lot of things. Personally I loved it.\n\nNote: does not contain any Bollywood masala."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "akash_sebastian",
        "review_rating": "6",
        "review_title": "Tight and Gripping Account on the Sri Lankan Civil War and Rajiv Gandhi Assassination.",
        "review_detailed_main": "Shoojit Sircar's 'Madras Cafe' is a tight and gripping account on the Sri Lankan Civil war and Rajiv Gandhi assassination. I'm amazed it took over 20 years for someone to approach such an important part of the subcontinent's post-independence history. But I can understand the reluctance due to the highly-sensitive nature of the different groups in our country, and Sircar's blend of fiction & non-fiction may have been the right way to tackle it.\n\nIt's different from the typical run-of-the-mill Bollywood action movies; it has an intelligent story, backed up by facts and actual incidents, with no romance, songs or melodrama. The characters are real and intriguing, each unique in its own way. The acting is commendable.\n\nPeople looking for a simple bombastic action thriller won't enjoy this. Only people aware of the subcontinent's political history and turmoil can thoroughly enjoy this movie, and what a treat it is, right up to inevitable but well-shot climatic assassination scene which leaves you paralyzed.\n\nAfter their thought-provoking and entertaining comedy 'Vicky Donor', with this movie it seems like Sircar and John (who produced Donor too) are here to change the ways stories are told in Bollywood - it's quite a welcome change!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "suite92",
        "review_rating": "8",
        "review_title": "Well-directed political thriller concerning the turmoil in 1990s Sri Lanka.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "DjMokksha",
        "review_rating": "7",
        "review_title": "Riveting, Exciting, Watchable!",
        "review_detailed_main": "How was Madras Cafe? Well it was riveting, fast paced, exciting, turbulent, keeps the viewer at the edge of his seat till the very end. The final moments of the assassination are well executed too. Excellent Cinematography lend an air of thrill and uniqueness to the film. The characters are very convincing. The movie paces well and ensures there is never a boring moment. Great to see a movie with no silly item songs or cheap Ranbir Kapoor nakedness on screen. Just the raw power of John Abraham at the helm of it all.\n\nMy realization in the last 5 minutes: The film is undoubtedly excellent and well executed. A first of it's type for Indian cinema. But the final 5 minutes clearly indicate that this film is very possibly part of Congress (read as \"UPA\") propaganda keeping in mind the upcoming elections. The aim is very clearly to push public sentiments towards the fact that Rajiv Gandhi loved the people of India and gave his life for the country and it's only the Congress in power that can take the country in the right direction, foreseen by Rajiv Gandhi during his life time. It's not loud, the message is given very subtly towards the end, through the scenes and dialogues. Very cleverly done as the elections are coming soon .. a tactic similar to what the Obama regimen did by getting something like \"Zero Dark Thirty\" subtly released to garner support before the elections. Definitely a political agenda behind the movie, nevertheless excellently done if you look at it from the artistic angle (and steer clear of its historical accuracy)!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "joshipoonam",
        "review_rating": "5",
        "review_title": "UKAsian Review: Madras Cafe. A Complex Conflict reduced to a Cops 'N Robbers Shoot 'Em Up!",
        "review_detailed_main": "The events leading up to the assassination of Rajiv Gandhi, India's ex-PM whilst he was campaigning for re-election in Sriperumbudur District, near Chennai in south India on 21 May 1991 by 'Dhanu', a female suicide 'Tamil Tiger', is the subject of this latest attempt at gritty political Bollywood cinema.\n\nTold largely in flashback, we follow Indian army officer Major Vikram Singh (John Abraham) who is appointed by the Research and Analysis Wing ('RAW'), the Indian equivalent of the CIA, to conduct covert operations in the then on-going civil war in Sri Lanka in the late 1980s.\n\nPatriotic Vikram ('My country's security is my responsibility!') leaves his teary but dutiful 'army' wife Ruby (Rashi Khanna, in her debut) and travels by boat from south India to the war-torn 'island of jewels'.\n\nEn-route, he encounters a no-nonsense (she smokes!) British journalist, Jaya (Nargis Fakhri, last seen in 'Rockstar'), who speaks with an inexplicable American twang.\n\nBoth are on the search for Anna (Ajay Bhaskaran) the leader of LFT which is clearly modelled on the real Liberation Tigers of Tamil Eelam ('Tamil Tigers') who are fighting for a separate Tamil 'Eelam' ('homeland') for the Tamil minority away from the rest of the largely Sinhalese majority.\n\nVikram wants to eliminate Anna; Jaya simply wants a scoop! A plot to assassinate the ex-Indian PM is discovered ('decoded') but will Vikram be able to save the day and more importantly, did 'RAW' and the then Indian government do enough to prevent their ex-PM being blown to bits? With the exception of some pre-credit titles explaining about the then on-going civil war in Sri Lanka, the film is not interested in any meaningful attempt at a socio-historical-political explanation of the bloody civil war which had been brewing since the 1950s and, up to the cease fire in the early 2000s, claimed hundreds of thousands of innocent lives.\n\nInstead director Shoojit 'Vicky Donor' Sircar is intent on making an unapologetic, almost propaganda piece with the clear intent of absolving the Indian authorities of any mismanagement in the build up to and the prevention of the assassination. This has been a contentious issue in India: a 1992 Commission Report concluded that security arrangements for Rajiv were adequate but blamed local Congress leaders for disrupting and breaching these arrangements.\n\nNo subsequent action was taken of the Report's recommendations but it looks like Sircar and his lead man (the film is co-produced by Abraham and there is an unconfirmed rumour it is funded by Sonia Gandhi!) have taken it upon themselves to dispute this finding. This cinematic liberty could be forgiven if the film itself was not so shallow with the complex conflict reduced to a straight 'cops n robbers shoot-em-up'. Sircar is clearly influenced by 'Apocalypse Now' with its iconic helicopters against the sun shot reproduced at one point.\n\nCharacterisation is also dosa-thin with Abraham's damaged victim persona conveyed via a bearded unshaven look. With the exception of the aforementioned 'Dhanu' (who did a lot!), the women have little to do. Sircar incorporates an unnecessary and clumsy 'kiss n sex' scene.\n\nSome dialogue ('this is going to be a long war!, 'the first causalities are always innocent civilians', 'this conversation never happened!', 'You cannot give up on the system!', and my favourite: 'He got honey trapped!\"), often repeated, is cringe worthy.\n\nThe film ends with Abraham reciting a famous Rabindranath Tagore poem ('When the mind knows no fear') but by this time you probably will not care.\n\nIf you are looking for Indian films which address, inter alia, events leading up to this sad event, it's probably worth seeking out Santosh Sivan's sensitive Tamil film 'The Terrorist' (1998), Mani Ratnam's moving Tamil hit 'Kannathil Mutthamittal' (2002) and even the Malayalam Mammooty potboiler 'Mission 90 Days' (2007).\n\nIt's welcome that Bollywood is experimenting with new bold controversial subjects like this.\n\nIt's a pity then that it gets it so wrong again.\n\nEven so, its fundamental flaws can even be forgiven (especially as there are no songs or 'item' numbers!). So, if you are interested in this aspect of history retold Bollywood simplistic-style, it may just be worth popping into this Madras Café."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "MehdiRizvi-7867",
        "review_rating": "10",
        "review_title": "One Of The Best Movie Of John Abraham",
        "review_detailed_main": "\"MADRAS CAFE\". The climax could have been better by extending till the arrests of terrorists in Indiranagar, Bangalore.\n\nScreenplay was crisp and outstanding. Climax is 75% to actual.\n\nPlease watch Rajiv Gandhi assassination investigation & RAW double agents videos in Youtube to understand this movie easily.\n\nOne dialogue touched me \" Kaun Jeetha..?\"\n\nNo doubt this is an excellent movie which is concluded in 2Hrs.\n\nEvery citizen was seen crying but not Sonia Gandhi, so sad of Rajiv..!\n\nPrakash Belwadi entry dialogue was ultimate.\n\nThis Movie Is A Blockbuster I Really Love It Soojit Sircar Is The Best Director."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "sushilrattan",
        "review_rating": "10",
        "review_title": "A Tale Well Told: superb movie by Shoojit Sircar.",
        "review_detailed_main": "Shoojit Sircar﻿'s MADRAS CAFE is perhaps the first movie to come out of Indian film industry that has has no actors, just characters, including the well known star John Abraham. Their roles were so ingrained in the tale that every face in every frame was there, to move forward the story. Vikram, Jaya, Bala, RD, Sree were the names one remembers, not who played them. Therefore, the viewer does not get a chance to judge/comment whether a particular actor did a good job or not ! This speaks volumes of the director's capability to tell the tale without making any person more important than the story !\n\nThroughout the 2 hours and 10 minutes of the film, one does not feel comfortable..although everyone knows the end. Shoojit was helped in his endeavor by excellent script, dialogues, cinematography, editing and music, all of superb quality. Persons responsible deserve all the kudos, but the biggest compliment goes the person at the helm. Shoojit Sircar has made a superbly crafted movie; and has jumped miles ahead of his contemporaries to become the best director of this generation.\n\nFor the audience who want quality cinema, here it is...go out in hordes and watch it, for \"Madras..\" deserves it much more than the poor cousin, \"Chennai...\", to show everyone you care for quality and not only for Express enjoyment that does not last."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "cybershotbook",
        "review_rating": "9",
        "review_title": "Madras Cafe the reality of another War",
        "review_detailed_main": "Someone who wanted to get good idea about regional terror activities and banality of them should watch Madras Café, It is really good to keep balanced judgment and image about what was happened in past with dark clouds of terrorism in Sri Lanka, and Acting of John is really brilliant,without any doubt Madras café is one of the greatest war film that there has ever been,and as a director Shoojit Sircar has done his best to this movie,\n\nSo it is very pleasure to watch this movie from start to end. Specially he talks about feelings of relatives whose are on field soldiers and their life risks & difficulties.\n\nI recommend to all who want to get some idea about past civil war in Sri Lanka and commonly to get real conditions of all wars without bounds to watch this fantastic movie."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ajit2106",
        "review_rating": "8",
        "review_title": "A Challenging & Brave Espionage Political Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "chndn",
        "review_rating": "6",
        "review_title": "One would like it if you been tortured by recent Bollywood movies",
        "review_detailed_main": "IMO it deserves a 6. Movie has a good screenplay(may be terrific as per Bollywood standard) and a good story/history to put forward to audience. I don't remember if there was a movie made on similar subject in Bollywood. It definitely was better than what I expected, was entertained. That's about it.\n\n* Cinematography was fine. Not great. I could get sense that its been heavily inspired by other Hollywood war movies.\n\n* Acting was sub par. Although I did not expect great acting.\n\nI have no clue why people have been rating it 9 or 10. It might be one of the few sensible movies that Bollywood produces, or people have a notion that only Bollywood produces movies and they haven't watched other good movies produced elsewhere."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "koustavavc",
        "review_rating": "9",
        "review_title": "The movie that reveals the the truth of Ex PM's assassination",
        "review_detailed_main": "The assassination of Rajiv Gandhi is known to every one. Very few people know about how the plan is executed. There is no book, no encyclopedia, no experts who can answer this question but the answer is available in MADRAS CAFE. The research work by Shoojit Sircar to reveal the truth through fictional way is must appreciable. The movie contain all the positive and negative aspects that occurred during Rajiv Gandhi's period. The most important part that is to watch out is Tamil issues in Srilanka during that period. The killings of Tamil people through LTTE soldiers will just make you stunned. There is no negative part in the film. Crystal clear work. The first half which is full of suspense will make you not to leave the seat. The answers are all revealed in the second half. After a long time Shantunu Moitra presented his master piece music. The lines from geetanjali at the end makes the film a fulfilled master piece.\n\nJohn's acting is must appreciable. His acting skills had developed a lot and Shoojit Sircar made the full utilization of it.\n\nOne word to describe..... Masterpiece Watch it for you worth it."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "advaitkamat",
        "review_rating": "7",
        "review_title": "Startling and compelling.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "kunder-akshay3",
        "review_rating": "10",
        "review_title": "Madras Cafe You beauty, Not everyone's coffee!!!",
        "review_detailed_main": "With an unusual kind of start , the movie then triggers back to reverse gear and shows the happenings during the lankan civil war. Madras Cafe is short, fast paced and crisp piece of an offbeat cinema with a solid background music. Very well technically crafted. Casting is pitch perfect with special mention for Bangalore theater actor Prakash Belawadi who essayed the role of Bala. With every movie this year,John ends up with career best performance. Nargis lives up to expectation this time and débutant Reena's performance is very moving even though a brief one. Siddharth Basu is flawless.\n\nPolitically, there have been many protests on this movie about taking sides but if you watch it as viewer,Madras Cafe is one of the best movies to come out in Bollywood because of its different style of portraying the scenario. You are going to witness a very powerful cinema which is not for weak hearted."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "nairtejas",
        "review_rating": "6",
        "review_title": "Stereotypically Modified-Original Story, Standing On Crooked Roots. ♦ 55%",
        "review_detailed_main": "Madras Cafe attempts to do to Bollywood what D-Day (2013), Agent Vinod (2012) failed to do. It is a perfect example of spy-action-thriller in the backdrop of politics, revolution & patriotism. It provides hope to the Indian janta that movies in the lines of spy-crime genres of international is possible... finally!\n\nI am stunned by the story being so pure in its rawness. But am equally terrified by the ridiculous off-show narration. The editing is awful, so is the cinematography. Direction & music is well-taken care of. Special appreciation to the newcomers & forgotten/shadowed thespians like Siddharth Basu & Piyush Pandey as supporting cast. The theme which the movie slides itself is very deep & ubiquitous.\n\nJohn Abraham looks crude in his portrayal & is fine as the desi covert operation guy, Nargis Fakhri's accent truly supports her as a journalist; her role is one of the most important. The one man army idea & relationship tension are what I mean by stereotypes. Thank heavens, there is no pesky item songs or melodrama.\n\nAction is dull, due to the editing blunder. Setup is average as the first half focuses on action & prologue. Second half starts flat but emerges as a shiner giving its viewers enough food for thought about war, terrorism & revolution.\n\nWe have only heard about Operations & Intelligence. Madras Cafe serves it out with proper description. A humble 5.5 out of 10 for a good attempt. The credit song is fine, all right! And I was convinced enough to forget two goofs & one plot hole.\n\nBOTTOM LINE: Many reasons to grab a seat in that nearby theater. And it wouldn't be fair not telling you that the 130 minutes of screenplay slightly does go off bounds, which MAY bore you. Watching it with like- minded partner or group will nullify this factor. Recommended!\n\nCan be watched with a typical Indian family? YES\n\nProfanity/Vulgarity: No | Sex/Foreplay: Implied | Mouth-Kiss: Very Mild | Nudity: Mild | Violence/Gore: Critical | Alcohol: Mediocre | Smoking: No | Drugs: No | Porn: Very Mild"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "alexwdoss",
        "review_rating": "1",
        "review_title": "'Madras Cafe' Racially and Politically Motivated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "slither911",
        "review_rating": "9",
        "review_title": "A great effort and a gem just one week after Chennai Express.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ketgup83",
        "review_rating": "10",
        "review_title": "Heart-wrenching political thriller which is sure to give you goose bumps",
        "review_detailed_main": "Indian Cinema has not divulged much into the subject of political thriller which generally leads to controversy as it is a sensitive issue exposing important people in the process. Classic example being controversial Hollywood film JFK starring Kevin Costner and Gary Oldman which paved a way to lot of speculation. Madras Cafe has its own share of story which has been blunt and hard-hitting and yet hair-raising.\n\nSet in 90's , Madras Cafe debriefs the true story of planning and assassination of Indian ex-prime minister Rajiv Gandhi by LTTE suicide bomber which shocked the entire world and led to a Indian politics letdown.\n\nFrom critical acclaim films like Yahaan and Vicky Donor , Shoojit Sircar explores a new area which I guess no other Indian filmmaker has attempted till now and gives heart-wrenching political thriller which is sure to give you a goose bumps. It is sad to know that Indian Government was aware of Rajiv Gandhi's assassination but could not do much as he was already on his death path. The best part of the film is the crucial historical background narrated by Sircar rising to the conflict between Indian government and LTTE force in SriLanka. Every frame has been captured exotically and accurately. The best of all the scene is astonishing and well-shot assassination scene which had my heart pounding for a minute. Hats off to the Shoojit Sircar for directing it so well. Applaud for the cinematography for exclusive camera work. Art direction needs special mention. Editing is crispy. Script is the hero of the film. Once you are into the film , you will not know how the time flew. John Abraham completely surprises with his brilliant portrayal of Vikram Singh. He is sure to get acclaim for his riveting performance. Watch for him in climax scene. Siddharth Basu , Nargis Fakhri and other star cast lends a good support.\n\nOverall , Madras Cafe is heart-wrenching , reality-based political thriller that is going to get goose bumps. Brilliant 4.5/5"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "harshjalan-495-828328",
        "review_rating": "10",
        "review_title": "One of the best Movies from Bollywood..",
        "review_detailed_main": "It was a superb movie.. and for sure one of a kind movie in Bollywood.. story line was excellent, performance wise every one was good.. More over John Abrahim was a one man show. Action sequences were shot well, from passing bullets to explosions .. it was all done well .. movie was a narrative style and good part was details were very good, you will not find the narrator telling telling anything which he couldn't have known. Unlike other Bollywood movies their was no Singing and Dancing, strong story line and amazing performance will set new benchmark for other movie makers.\n\nOver all an excellent movie on a previously never been told story."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "gagan_mani90",
        "review_rating": "9",
        "review_title": "Well Scripted and well executed",
        "review_detailed_main": "After a long time, I have seen a movie that is so much well framed. You can't take your eyes off even for a second. The movie is not only a theatrical drama but also informative. Rajiv Gandhi assassination and role of LTTE are very well explained. All characters in the movie played well. Hats off to such a great direction and script.\n\nJohn as Vikram is an Army man who steps into Srilanka following his seniors orders and then come to know about the internal leak in his own force. He keeps travelling to India and other countries to collect the information. Due to his course to liberate Tamil people from the terror, he encounters several adventures. The movie ends up with Ex-PM assassination."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "7",
        "review_title": "It made me revisit Vardi Waala Gunda on celluloid",
        "review_detailed_main": "Madras Cafe can be contrasted with a Hindi bestseller novel - Vardi Waala Gunda which was published first in the year 1992 and based on the assassination of our ex-premier, Rajiv Gandhi which had taken place just one year back (in 1991). Popular Hindi novelist Ved Prakash Sharma had written it and partly due to the hot theme and its brilliant treatment and partly due to the per-publication hype generation for it, the novel proved to be a bestseller Hindi novel in the pulp-fiction category. Though its author (Ved Prakash Sharma) has lost his sheen in the field of writing over the past few years, Vardi Waala Gunda (a goon in uniform) is still considered as one of his best works till date whose central character was a corrupt cop who masterminded the killing of the high profile politician of India who had attempted to bring about peace in the nation's neighbourhood but lost his own life in that.\n\nIn my humble opinion, neither the highly educated filmmakers nor the sophisiticated modern movie reviewers read Hindi novels, especially the pulp fiction stuff which is looked upon derogatorily. Hence I suppose that Shoojit Sircar, John Abraham and the various high profile reviewers writing reviews of this movie have not read this novel. But the quantum of similarity between the two is astonishing though the movie has been made by keeping a positive character at the nucleus of the story unlike the novel whose hero himself is actually the villain.\n\nAll the same, this is a very very well made one and deserves a lot of accolades for paying attention to the fine details, the realistic settings as well as the overall realistic approach in presentation, the excellent casting of actors for different characters (following the principle of horses for courses), creating that aura on the screen to mesmerize the audience for more than two hours and above all, establishing the futility of violence in a touching manner.\n\nThe story belongs to the ethnic trouble in Sri Lanka, the peace accord between the top political authorities of India and Sri Lanka, sending of IPKF (Indian Peace Keeping Force) to Sri Lanka and finally, the assassination of Rajiv Gandhi who was no longer the prime minister of India then. The story has been written by showing an Indian intelligence officer (John Abraham) at the centre of the various happenings, his pious intentions and sincere efforts for converting the dream of Rajiv Gandhi (of bringing peace to the island) into reality and most importantly, their failures. And when such things move on, double cross seems to be an unwritten rule of the game creating suspense for those who are in as well as for those who just watch.\n\nThe script-writer and the director has utilized the first half for the build-up of the main theme which takes the centre-stage in the second half only. However I opine that both the halves are equally important and well-presented. It's a brilliant blend of fact and fiction and it's utterly difficult for a layman like me to decide as to how much is the percentage of fiction in whatever is shown on the screen. The percentage may actually be high but the filmmaker has been successful in rendering a feeling to the audience that the greater amount is that of fact only. The flawed functioning style of the Indian bureaucracy has also been exposed very well.\n\nThe complete supporting cast has been selected with perfection and all have performed brilliantly. Simply superb. Utterly real in looks and behaviour. I have been a great admirer of quiz-master Siddharth Basu and it's a sheer delight to see him as an actor (the RAW chief). Nargis Fakhri (the British journalist) has improved since her debut in Rockstar (2011). Almost everybody is well in place with the sole exception of Raashi Khanna in her insignificant and unidimensional role of the hero's wife.\n\nNow for the hero-cum-producer John Abraham. In my humble opinion, he is not a versatile actor and his range is limited to certain kinds of expressions and roles. However he has a great screen presence and a highly impressive masculine personality. Since he is quite proficient in action-oriented intense roles, this role is tailor-made for him and he has excelled like anything. We can consider this performance of his as his best till date.\n\nMadras Cafe is not for the regular entertainment-seekers because this profound movie is low on entertainment quotient. It is for those who take interest in watching meaningful and realistic movies containing a great substance in the story."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "siddhartha-gunti191",
        "review_rating": "9",
        "review_title": "Great work. Must watch thriller",
        "review_detailed_main": "I think the movie topped in many crafts - direction, acting, story, screenplay, cinematography, sound effects...\n\nAbsolutely loved it and probably the only Indian movie in recent times I want to watch again in theater.\n\nThe theme revolves around Srilankan Civil War. It expects you to be attentive and takes on a trip to serious study of an important chapter in Indian history.\n\nAs I read somewhere, The film deserves an audience and may be the best political conspiracy thriller in Indian cinema.\n\nKudos to the Madras Cafe team for making an impactful cinema."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "Jini-B",
        "review_rating": "7",
        "review_title": "Packs A Punch!",
        "review_detailed_main": "I was skeptical about this movie considering the fact that the lead actors weren't necessarily the kind of actors that guarantee a good film. I procrastinated on this movie a lot, despite getting multiple recommendations, but John Abraham was quite decent in this. The supporting cast was especially good and did the job really well. I was not privy to this story since it was before my time so it took a while to get into the nitty-gritty of it and the first half especially left me in a bit of a tizzy because of the info-dump. There were a lot of details and the violence was also a little difficult to stomach but the second half more than made up for it. It was thrilling and the background score made things even better. No unnecessary songs, although there were a couple clichés here and there. I liked the way the subject was handled, with complete objectivity. Kudos to Shoojit Sircar. The man can deal with any kind of story, it seems. The second half gave a different kind of depth to the film and the countdown to the assassination was both scary and gripping. Recommended for conspiracy theorists and thriller enthusiasts."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "manishnagi",
        "review_rating": "10",
        "review_title": "Good attempt of thriller by Indian Industry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "Seriously Good Spy Thriller",
        "review_detailed_main": "Reviewed by: Dare Devil Kid (DDK) Rating: 3.6/5 stars\n\nWow! Bollywood has suddenly awoken from decades of slumber. Another great political espionage film after \"D-Day\". While it might not be as gripping, suspenseful, or action-packed as the \"D-Day\" (to be fair, this was never meant to be an action film), it certainly scores plenty of points for its realistic depiction of one of the most ghastly periods of Sri Lankan history and India's relation and unfortunate outcome with that period.\n\nThe film also needs praise for its accurate depiction of covert operations (again like \"D-Day\", this aspect is on par with the best spy films of international cinema), as also its brilliant technical achievements, especially the Cinematography and production design. Performance wise, John Abraham and Nargis Fakhri have certainly gone through the grind and come out as more than decent.\n\nShoojit Sircar has carved a grueling and gut-wrenching tale from actual facts with \"Madras Cafe\", that shouldn't be missed by any Indian."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "UKAsian",
        "review_rating": "3",
        "review_title": "UKAsian Review: Madras Cafe. A Complex Conflict reduced to a Cops 'N Robbers Shoot 'Em Up!",
        "review_detailed_main": "The events leading up to the assassination of Rajiv Gandhi, India's ex-PM whilst he was campaigning for re-election in Sriperumbudur District, near Chennai in south India on 21 May 1991 by 'Dhanu', a female suicide 'Tamil Tiger', is the subject of this latest attempt at gritty political Bollywood cinema.\n\nTold largely in flashback, we follow Indian army officer Major Vikram Singh (John Abraham) who is appointed by the Research and Analysis Wing ('RAW'), the Indian equivalent of the CIA, to conduct covert operations in the then on-going civil war in Sri Lanka in the late 1980s.\n\nPatriotic Vikram ('My country's security is my responsibility!') leaves his teary but dutiful 'army' wife Ruby (Rashi Khanna, in her debut) and travels by boat from south India to the war-torn 'island of jewels'.\n\nEn-route, he encounters a no-nonsense (she smokes!) British journalist, Jaya (Nargis Fakhri, last seen in 'Rockstar'), who speaks with an inexplicable American twang.\n\nBoth are on the search for Anna (Ajay Bhaskaran) the leader of LFT which is clearly modelled on the real Liberation Tigers of Tamil Eelam ('Tamil Tigers') who are fighting for a separate Tamil 'Eelam' ('homeland') for the Tamil minority away from the rest of the largely Sinhalese majority.\n\nVikram wants to eliminate Anna; Jaya simply wants a scoop! A plot to assassinate the ex-Indian PM is discovered ('decoded') but will Vikram be able to save the day and more importantly, did 'RAW' and the then Indian government do enough to prevent their ex-PM being blown to bits? With the exception of some pre-credit titles explaining about the then on-going civil war in Sri Lanka, the film is not interested in any meaningful attempt at a socio-historical-political explanation of the bloody civil war which had been brewing since the 1950s and, up to the cease fire in the early 2000s, claimed hundreds of thousands of innocent lives.\n\nInstead director Shoojit 'Vicky Donor' Sircar is intent on making an unapologetic, almost propaganda piece with the clear intent of absolving the Indian authorities of any mismanagement in the build up to and the prevention of the assassination. This has been a contentious issue in India: a 1992 Commission Report concluded that security arrangements for Rajiv were adequate but blamed local Congress leaders for disrupting and breaching these arrangements.\n\nNo subsequent action was taken of the Report's recommendations but it looks like Sircar and his lead man (the film is co-produced by Abraham and there is an unconfirmed rumour it is funded by Sonia Gandhi!) have taken it upon themselves to dispute this finding. This cinematic liberty could be forgiven if the film itself was not so shallow with the complex conflict reduced to a straight 'cops n robbers shoot-em-up'. Sircar is clearly influenced by 'Apocalypse Now' with its iconic helicopters against the sun shot reproduced at one point.\n\nCharacterisation is also dosa-thin with Abraham's damaged victim persona conveyed via a bearded unshaven look. With the exception of the aforementioned 'Dhanu' (who did a lot!), the women have little to do. Sircar incorporates an unnecessary and clumsy 'kiss n sex' scene.\n\nSome dialogue ('this is going to be a long war!, 'the first causalities are always innocent civilians', 'this conversation never happened!', 'You cannot give up on the system!', and my favourite: 'He got honey trapped!\"), often repeated, is cringe worthy.\n\nThe film ends with Abraham reciting a famous Rabindranath Tagore poem ('When the mind knows no fear') but by this time you probably will not care.\n\nIf you are looking for Indian films which address, inter alia, events leading up to this sad event, it's probably worth seeking out Santosh Sivan's sensitive Tamil film 'The Terrorist' (1998), Mani Ratnam's moving Tamil hit 'Kannathil Mutthamittal' (2002) and even the Malayalam Mammooty potboiler 'Mission 90 Days' (2007).\n\nIt's welcome that Bollywood is experimenting with new bold controversial subjects like this.\n\nIt's a pity then that it gets it so wrong again.\n\nEven so, its fundamental flaws can even be forgiven (especially as there are no songs or 'item' numbers!). So, if you are interested in this aspect of history retold Bollywood simplistic-style, it may just be worth popping into this Madras Café."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vishal657",
        "review_rating": "8",
        "review_title": "You can not afford to miss this Cafe.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ahwaan_padhee",
        "review_rating": "9",
        "review_title": "Madras Cafe : Intercept this truth !",
        "review_detailed_main": "From spine-chilling promos to stupendous campaigns, everything was so well crafted for Madras Cafe. This brings together the hit combo of director Shoojit Sircar and actor-producer John Abraham who wowed their detractors with the sleeper hit of 2012 -Vicky Donor.With Madras café, touted as one of the most compelling political thriller of recent times,Sircar examines the inexorable assassination of our Ex-PM, Rajiv Gandhi against the backdrop of the deadliest ethnic crisis which engulfed Srilanka during the 80's.\n\nRight from the outset, Sircar arrests your attention with the gritty and gloomy portrayal of the Srilankan civil war, the terrorist outfits and the responsive action by the Indian government to curb the growing violence. John Abraham plays Vikram Singh,an Intelligence officer,Ex- Indian Army man who is deployed by his senior RD(Siddharth Basu,in a towering performance)to the war-torn coastal island to break a resolute group , LTF headed by Anna Bhaskaran (Ajay Ratnam)modeled closely after the LTTE Chief,Prabhakaran.With the help of a British journalist,Jaya Sahni ( Nargis Fakhri in a de-glam role),Vikram uncovers a deeper conspiracy of terrifying proportion and ramifications involving political figures, bureaucrats and economic 'hitmen'.\n\nSuspenseful, sweeping and piercingly intimate, this is a complex web weaved by Sircar and his team of writers Shubhendu Bhattacharya and Somnath Dey which rapidly shuttles between our capital, Singapore, Bangkok and Kerela.There is a lot of clumsy high-powered conversations, coded messages, intercepts and bloody betrayals on the ground which might irk the viewer.DOP,Kamaljit Negi effervescently captures the moribund civilization of Jaffna and the war belt where humanity is endangered. The flabby second half shifts its focus to the machinations behind the assassination plot in a nail-biting thriller mode with a self-effacing background track(Shantanu Moitra)before settling in for a shocking explosion.\n\nWitnessing character outweigh the star persona in mainstream cinema is a rarity, but I did experience this with John Abraham's performance as the RAW agent. He effortlessly sinks into the character as the tough guy who is good with his guns in the mission, however could have done better in the emotional sequences involving his wife(ably played by Raasi Khanna).Sircar introduces some familiar faces like Siddharth Basu, Piyush Pandey who deliver as competently as the dichotomous superior of John, Bala(Prakash Belawadi).\n\nMadras Café is indeed a commendable effort , considering its bold subject and the controversies and sensitivities built around it. A tour de force and an instant classic, this is Shoojit Sircar at the height of his dazzling repertoire."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "mustafa-saify",
        "review_rating": "9",
        "review_title": "A parallel fiction to the real event",
        "review_detailed_main": "This movie is a rare attempt by Bollywood cinema where actual events are subtly intertwined with fiction to bring a plausible conspiracy theory. LTF creation,peace force deployment,role of RAW and final assassination was perfectly brought on screen through the glass of RAW agent (though a fictional character you can't distinguish when fiction turns to reality, thanks to intelligent story telling).\n\nThe screenplay and cinematography was dot to the time frame. Linguistic dialogue were according to characters and situation which gives movie a feel of what it should be. Bringing out character of Bhaskaran (as pointed out by Jaya-Nargis Fakhri \"A man dedicated to cause and cannot be bought\") was crucial to the movie. So the final verdict is its a very apt political thriller encapsulating the actual historical event. Only thing boggles me is the the title \"Madras Cafe\" doesn't justify though i understand its a sensitive movie. Anyway everything else is just pure.\n\nJohn Abraham earned respect by investing (as producer and actor)in such risky (both in terms of money and subject) venture."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "dipaklawande",
        "review_rating": "10",
        "review_title": "Madras Cafe deserves an audience",
        "review_detailed_main": "At its running time of two hours, ten minutes, Shoojit Sircar's Madras Cafe is a swift, smart and serious study of an inglorious chapter of political history. It doesn't take names but doesn't hold back either. Even if it packs in classic stereotypes of this genre and the climax is something we all know and vividly remember, the horridness of it continues to startle.\n\nAfter experiencing back-to-back idiocy on big screen, it's refreshing to return to the theaters for a film that expects you to be educated, informed and attentive. Give it a chance, Madras Cafe deserves an audience."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "nadkarnisumeet",
        "review_rating": "7",
        "review_title": "Well executed political drama.",
        "review_detailed_main": "Madras Cafe review:\n\nThe film, narrated in a docu- drama format, deserves praise for its impressive performances from the entire cast (particularly John), in depth research and detailing of the Srilanka political crisis. Shoojit Sircar's competent direction is its major positive.\n\nThough a tad confusing at times (especially first half), Madras Cafe comes as a breather after the mindless and senseless Chennai Express and Once upon a time...dobaaras we had to endure in the past few weeks. This one makes you think and actually tests your intelligence which is a rarity in bollywood.\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "virajssk",
        "review_rating": "9",
        "review_title": "Treat which awakens your senses !!! simply outstanding political thriller....",
        "review_detailed_main": "Madras Cafe Treat which awakens your senses !!! simply outstanding.... **** 1)If you are looking for a class movie... 2)You are bored enough by hearing record slashing news of masala movies 3)You are a John fan and was waiting for his \"real\" movie where he could act... and 4) if you simply love political thrillers which have real special agent stories... then you must visit this cafe.... Screen play acts as a glue and you keep your jaws open for thrilling visuals which seem so real and possible. when you have action man like John , you always fear for unrealistic stunts , super hero fights and WIN WIN JAI India show.... but don't worry . this is not another Ek Tha Tiger. This movie has woven a brilliant script around a real incident and though you know what was happened ... then also it is greatness of #shoojitsircar which never makes it predictable. It is surely John' best movie considering his stone faced movie-history . John has got a gem called Shoojit sircar who has again amazed everybody with his second wonderful movie. It is hard to believe that same man have made a movie called Vicky Donor !!! Sircar has shown he is versatile and you can surely expect another different genre from him in future. All actors have done a fabulous job. Nargis Fakhri has not so big but impact giving role. No big stars were required for such movie when your movie is a big star. Unwanted songs , melodrama , love stories were away. You really need courage, confidence and belief to keep all masala away that \"public\" demands. It's not bad to watch masala entertainer but it's your duty to support such movies as they define our industry.\n\nSpend your valuable time i this cafe... and I promise it will be more valuable after watching it."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "anuvesh-kumar",
        "review_rating": "6",
        "review_title": "acting and play out suffers",
        "review_detailed_main": "While the story is splendid, and plot is solid but some major actor (John Abraham(a model after all) slipped up in acting at many points simply reading straight from scripts at times. The story could hit you, the conspiracy might seem suspenseful but... it was all so obvious from the beginning. I feel that the director mistakes in showing that side of story that should've been hidden till the end.. and should come up hitting you straight on your face \"shit john knew everything and it's just the lack of political assistance that led to the death of Sri Lankan prime minister bla bla\". Back stabbers, double crosses, political corruption, the movie has it all, just not present the right way. ANd that steals the points. Nargis Fakhri as always looks beautiful, John Abraham handsome, but it's a movie and not a fashion show so no browniee points for that. OK plus 1 for Nargis. One time watch (if you can stand mediocre acting and directing)"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "murtaza_mma",
        "review_rating": "8",
        "review_title": "A Potpourri of Vestiges Review: Indian filmmaker Shoojit Sircar's Intelligent Political Thriller",
        "review_detailed_main": "Madras Cafe is a 2013 political thriller film directed by Indian filmmaker Shoojit Sircar, starring John Abraham as an undercover Research and Analysis Wing (RAW) agent and Nargis Fakhri as an international war correspondent. Madras Cafe presents a whole new perspective on the tragic Rajiv Gandhi assassination, believed to have been carried under the orders of the now deceased Liberation Tigers of Tamil Eelam (LTTE) chief Velupillai Prabhakaran, underpinning a whole new conspiracy angle to it.\n\nSo, what exactly is a conspiracy theory? Generally, whenever someone famous is assassinated (or, for that matter, in the occurrence of any other controversial event of national or international importance) the grapevine floods with loads of conspiracy theories. While every such theory is backed up by some sort of evidence, it is rarely concrete. Besides, if we were to go by the proponents of conspiracy theories, there are always powerful lobbies exercising their influence to keep such \"truths\" buried forever.\n\nWhile the genre is infantile when it comes to Hindi cinema, it's quite a successful formula in Hollywood. The fact that Madras Cafe is the first of its kind in India makes its success considerably important from cinematic point of view. Choosing to make a film on the sensitive and divisive subject of the LTTE takes courage, let aside realising a film that revolves around the Rajiv Gandhi assassination and throws in a brand new conspiracy theory angle to it. And the fact that films based on real-life sensitive issues and historical events in a country like India are believed to stir up political tension and cause chaos makes their effort even more commendable.\n\nOverall, Madras Cafe proves to be a great viewing experience for the serious audience. The film touches upon themes that are often considered quite challenging and difficult to tackle in Indian cinema parlance. The movie is at par with any Hollywood product on the technical front. The acting ranges from average to good. While Nargis Fakhri appears to be quite comfortable in her role, John Abraham undoubtedly delivers his best performance ever. Though he may not be as toned down as he himself claims to be, he seems to fit into the shoes of the character quite well and even manages to bring in a much needed element of realism and machismo to his part. While the movie doesn't appear to be taking any sides, its detractors may criticise it for implicitly creating a wave of sympathy for one political group in particular, especially with India's general elections fast approaching. Madras Cafe is a thinking man's espionage-cum-political thriller and is most likely to disappoint those on the lookout for voyeurism and masala entertainment. But, it's a movie that every serious film-goer must watch. 8/10\n\nA more in-depth review can be read at:\n\nhttp://www.apotpourriofvestiges.com/"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "arupghose",
        "review_rating": "7",
        "review_title": "Real content always wins! Madras Cafe is excellent.",
        "review_detailed_main": "Hats off to Indian cinema for making such a film! Madras Cafe goes down to the raw truth of the Sri Lankan civil war and shows that India can make real films with real story lines\n\nMadras Cafe is a John Abraham film throughout! He dominates and takes his role to new heights. John's found his niche with roles like Force and now Madras Cafe. Nargis is pleasant in her role (perhaps as she did not have to speak Hindi), and isn't annoying like she was in Rockstar. All supporting actors do their job perfectly well.\n\nOne big problem with Madras Cafe is that if you're not political clued up, or necessarily find it interesting then you might lose interest in this film quite early. However, just like I did please go and watch until the end, especially for the climax scene as it is truly fantastic and teaches the younger generation like myself history about our great country India!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vikbans",
        "review_rating": "1",
        "review_title": "Lost me",
        "review_detailed_main": "Intelligence agencies do not walk and talk the way it has been depicted in the movie. Dialogues , tone and style fail to convey the stress and emergency. Poorly edited. No proper build up of the plot. It is implied several times in the movie \"you are questioning the loyalty of a senior person, you better be right\". In fact, questioning and frequently verifying the loyalty of everybody in intelligence agencies is routine and frequent.\n\nMovie leaves many why s and how s undealt"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "magadalwarmayur",
        "review_rating": "9",
        "review_title": "Probably best spy espionage thriller since Munich",
        "review_detailed_main": "This movie is good at every aspect yes this movie falls under category of watch it before you for"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "tahaejaz",
        "review_rating": "8",
        "review_title": "Must watch movie!!",
        "review_detailed_main": "Reflection of a past Tamil massacre was very precisely told in a bold way. Storyline was good. Acting upto the mark."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ruvinda21",
        "review_rating": "9",
        "review_title": "film making at it best.......",
        "review_detailed_main": "Basing a movie on real historical facts and getting it right is not a easy task because if the facts are wrong there is a possibility it will mislead the audience.Madras Cafe is a perfect example to show how a movie based on real facts should be made.After watching this movie it was obvious to me that the director have done his best to get the facts right and he has succeeded. I strongly believe that any person who watched this movie will generate a new found respect for Indian cinema.The movie is directed in such a way which can only be described as masterful.The use of strong imagery to show the consequences and horror of war is the most impressive feature in this movie which can even effect the most emotionally controlled person.To achieve this the camera work or the cinematography has been used in a really smart way which has added more depth to the images of war. I am not a fan of actors and actresses in Indian cinema however it has to be said that John Abraham and the supporting cast provide impressive performances which maintained the high quality of the movie. Overall this movie is a 1 st class movie which shows that the Indian cinema has gone to a level which is Oscar worthy."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "achraj",
        "review_rating": "9",
        "review_title": "Pure masterpiece",
        "review_detailed_main": "It's never easy to make and release a historic fictional movie in India where the majority of the audience spends money to watch dim-witted and romantic movies. The director and the actors have to be very competent and proficient to portray some historical events that still stir up jingoism among the people. Many Indians today are oblivious to the events and the reasons that ended up in the assassination of our former Prime Minister, Rajiv Gandhi but Madras Cafe has successfully thrown some light on this tragedy that is seldom heard of.\n\nMajor Vikram Singh, played by John Abraham is appointed by the RAW to handle the covert operations of the Indian Military at Jaffna and resolve the ongoing crisis created by the LTF resulting in genocide of the innocent people. The story is built upon the political tension that kept the Indian Ministry involved intensely to establish peace in Jaffna during the civil war. What we see in Madras Cafe is totally gripping- when Vikram Singh and Jaya, a foreign journalist exchange some significant and confidential information about the LTF and the leak in the Indian intelligence agency that actually results in a total transformation in the set of international events.\n\nJohn Abraham has acted exceptionally well in the character- who tries his best to embark upon the precarious struggle going on in Sri Lanka. Nargis Fakhri has shown some tremendous improvement in her acting and the 'No-Romantic loop' between them seems to work superbly for the movie. The movie moves very swiftly and the audience is engrossed for the entire duration of the movie. The cinematography is noteworthy and it is a well-scripted political suspense. For a story we already know, Madras Cafe is one of those that excels at creating a thriller, in a breath-taking manner.\n\nMadras Cafe definitely elevates John both as an actor and a director to a higher level. Shoojit Sircar hits the right strides and blends facts and fiction terrifically. The writers had done their research well. Debutante Rashi Khanna makes an impact in a brief but significant appearance as the army man's wife.\n\nMadras Cafe is a must watch for all those who want to know about the history behind the assassination of Rajiv Gandhi, the LTTE etc. In two hours. It's effective and grim unlike the ludicrous drama and item numbers that incite cheers in the theater. It's definitely a brave move on the part of the director to come with such a movie and Madras Cafe is certainly a trend setter."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "talkthegsk",
        "review_rating": "6",
        "review_title": "Not must watch yet somewhat it is",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "silvan-desouza",
        "review_rating": "9",
        "review_title": "Simply astounding",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "Niaz_Morshed",
        "review_rating": "7",
        "review_title": "a sensitive story was told in a fantastic way!",
        "review_detailed_main": "undoubtedly one of the better films from bollywood in the recent times. probably the best political thriller in a long time. 'Madras Cafe' is unarguably a film that belongs to a rare genre of Bollywood cinema and it really deserves a little more attention and appreciation than what it's actually receiving.\n\nThe film is based on the backdrop of the Sri Lankan civil war in the late 1980's and early 1990's. It crosses its path with the plotting and assassination of the then, Indian Prime Minster, whom we understandably can make out as Late Mr. Rajiv Gandhi. This film is so well crafted; there was no visible loophole in the plot. a sensitive story was told in a fantastic way.\n\nfrom critical aspect, i thought the film lacked intensity the whole time. the kind of strong story it had, it could have been much much better. and casting was poor to some extent, specially some very lousy acting from some vital characters ruined some critical scenes. thanks to the director for not spoiling it with unnecessary songs!\n\noverall it was okay. comparing with other mindless masala-bolly films, its actually very good! john did his part, nargis fakhri was good. its the director's second film after vicky donor. so far so good."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "hani_78696",
        "review_rating": "8",
        "review_title": "Best Indian espionage spy thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "pruthvishrathod",
        "review_rating": "7",
        "review_title": "Appreciative effort but not anything more..",
        "review_detailed_main": "First of all, I'm glad that someone cared to make a film on such subject. Premise is really interesting and promises something different. This espionage drama/political thriller has decent story but screenplay is not up to the mark. Somewhere between historical timeline and a political conspiracy, it fails to maintain its coherence. It is somehow misses the elements which hold it together. That is the reason why it tastes your patience but fails to reward it. After the end, I felt it would have worked better as a documentary since characters fail to create an emotional bond. Even with such a realistic scenario and forcing elements, it does not create any tensed atmosphere or thrill.\n\nBut still it is at least an appreciative effort because of its subject and sincerity towards it. John Abraham tries his best. He and director Shoojit Sircar should be acknowledged. However, film does not stand tall on the basis of film-making."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "anandharaj008",
        "review_rating": "1",
        "review_title": "A film which shows the racism on tamizh in India",
        "review_detailed_main": "Some sections of the Indian media may be going gaga over the 'realistic', 'non-dramatic' film 'Madras Cafe' of Shoojit Sircar. Some have, rather shamelessly, compared it to Zero Dark Thirty – in reality, GI Joe: Retaliation is a more gripping watch. While the poor sense of aesthetics of these pseudo-critics is lamentable, their contempt for history as it happened leaves much to question.\n\nSelective history, grand conspiracy theory, not-so-subtle Indian patriotism all go into the making of a movie that principally exonerates India from all culpability of the brutal war crimes committed against the Tamils by the IPKF. From the start till the end, the subtext of the movie is to project India, a nuclear power state with the fourth largest army in the world, as a victim of the LTTE. For the record, at the height of the IPKF-LTTE war, over 100000 Indian soldiers armed to the teeth confronted about 3000 LTTE cadres. Despite this, India lost.\n\n\"They were powerful. In this game, we lost our prime minister, and the Lankan Tamils, their future,\" confesses RAW agent Vikram Singh (played by John Abraham) to a Christian priest. The entire movie is the confession of Vikram to the priest, from his activities as a RAW agent in IPKF occupied Jaffna, to the failure of the RAW to break the LTTE, to their failure to stop Rajiv Gandhi's assassination.\n\nThe numerous atrocities suffered by the Eelam Tamils under the IPKF, the murders, tortures, rapes and disappearances, do not form part of his confession. Thus, no mention of the same in the film. On the other hand, the reel LTTE are shown as fanatics, who even murder the wife of Vikram in India in their attempts to get to him. I am yet to hear of a single case where the real LTTE has deliberately targeted the family of officers or soldiers of even the genocidal Sri Lankan military.\n\nThe LTTE, shown in the film as Liberation of Tamils Front (LTF), are shown as some intransigent armed rebel group that has support of the local population. Why did the armed struggle come about, what did the Sinhala state do to create such a situation, why did the Tigers oppose the Indian solution of 13th Amendment, why did the Tamil people stand with the 'rebel group', and what did the IPKF actually do in the course of its intervention – these are questions not even considered by the filmmaker. But the words \"provincial council elections\" are repeated to the point of being a slogan throughout the movie. Contrast this with the bare minimal usage of the word 'Sinhalese' in the movie – it is as if they had no role to play at all. The tagline for the movie was \"Intercept the truth\"."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "subhasish-dreams",
        "review_rating": "8",
        "review_title": "now thats high stuffs",
        "review_detailed_main": "This was beyond my expectation really. When I first saw the trailer I was less interested. All of a sudden I saw the movie without any plan and what a Goosebumps I get just cant explain. The story is based on the assassination of former prime minister Rajiv Gandhi by the Tamil tigers and its about the whole conspiracy lies in between. Shoojit Sircar is the most underrated directors in Bollywood i must say. He knows the exact flow of a movie and to push it in which direction, in which way. John Abraham is very much realistic, and the other characters too. The background music, the screenplay, the photography each and everything is just perfect. the story is the main hero in this movie, so I don't want to compare it with my all time favourite Bourne series. But I must admit, this is India and we have a pathetic sensor board for whom The neo realism is absent in most of the Bollywood movies. I would like to thank the whole team of Madras Cafe for making such a bold film. Forget the usual craps of Bollywood and go watch this epic to taste something very much alike Hollywood, something very much fresh and solid without any hazy make up.\n\nAnd last but not the least, The poetry of Tagore \"Where the mind is without fear....\" respect. respect. respect."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "bornsupermacy511",
        "review_rating": "10",
        "review_title": "one of the best offering from b town in recent time",
        "review_detailed_main": "well you need a big heart and courage to make film with such a volatile content and theme especially when you are dealing in India.\n\nwhatever the history or truth may have been........i don't care .......but as a movie MC do not disappointed at any point of time.\n\nits very sad that some of sick mentality people are trying to make unnecessary political, racial and ethnic issue out the movie.\n\nperformance wise Jhon has delivered his best performance till date. supporting staff is excellent as casting team need special applaud for it.\n\nShoojit Sircar has again proved his ability to deal these offbeat topics and has done complete justice with his own talent.\n\ncinematography, editing is crisp, location and action sequences seems all realistic.\n\nwell done Cafe Team,,,,,,**********"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "asha-albert",
        "review_rating": "9",
        "review_title": "A story just waiting to be told...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "manavrai92",
        "review_rating": "9",
        "review_title": "Get ready to be served at this CAFE..............",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "illidian-74757",
        "review_rating": "6",
        "review_title": "Readymade copy of Oliver Stone's JFK with Desi plot",
        "review_detailed_main": "Oliver Stone's JFK is one of the unique movie ever been made because of its gripping storytelling and direction style. Shoojit Sircar ditto copied the style and the beauty of Oliver Stone's JFK is that you can put any assassination plot right into it.\n\n6 starts for the acting and gripping story telling. The actual history is quite different what it has been showed in the movie. Loved the poem of Tagore at the end."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "feverbaba123",
        "review_rating": "10",
        "review_title": "Best political thriller of bollywood ever",
        "review_detailed_main": "just back from madras cafe.one of the films of the year so far. brilliant direction. i am not a fan of political thrillers but this has got to be the best in bollywood.fast paced, excellent casting, good acting and no songs.if you liked 16 December, you will love this. shoojit sircar is one of the talents to look forward to. cant believe he is the same guy who directed the lousy vicky donor\n\njohn is good. nargis is also good in her role. but the casting of the LTTE members is just brilliant.the biggest plus of the film is the direction. he has kept the movie at a very fast pace, if you don't keep up, you will lag behind.the photography and all technical details look perfect\n\nthe best thing about the direction is you know what is going to happen in the end and still you are excited to see whats gonna happen.that is the victory of the director."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "MADRAS CAFE - A well shot, focused attempt to make a fine political thriller which strictly lacks a lot for the common man.",
        "review_detailed_main": "Post a decent YAHAAN (2005) and a stalled project with Amitabh Bachchan called SHOEBITE, director Shoojit Sircar came up with a brilliant VICKY DONOR made on an unexpectedly bold yet highly entertaining subject widely acclaimed all over in the year 2012. So after such a confident success, planning his next movie as an intense spy thriller was indeed a very bold and daring step, for the kind of audience who are not really known to appreciate this particular genre in a big way since decades.\n\nSo at one end, MADRAS CAFE has some notable merits to its credit worth praising. It fairly adds to the bright welcome change ignited by the recent success of D-DAY exploring the rarely attempted genre of spy thrillers. It is no doubt a courageous (as well as risky) choice of subject for John Abraham as one of the producers. The film talks about an important, shattering assassination of an ex-Indian Prime Minister never depicted on the screen before. It has been written and directed with a completely focused vision without inserting any thrown in love angle, an untimely song (it's a song less movie as it should be) or spoon feeding as normally seen in the routine Hindi films. It very aptly points towards the money lobby working behind all the major drastic events of the world. The performances don't care about their short or long lengths and try to do full justice to their respective roles. It has a splendid cinematography (great civil war sequences) and a fine background score reminding you of many foreign spy movies made in the realistic style. And with a sharp, intelligent editing it never gives you any dragging moment in its more than 2 hours of duration and has an engaging climax conceived well.\n\nHowever on the other hand, MADRAS CAFE hasn't got that pace, thrills and shocking twists essentially required as the key features of such political thrillers. It keeps progressing in a documentary style without taking any sides like a well researched feature. But the facts incorporated in its script are sure going to face some hard criticism from different section of viewers as it seems. The film begins impressively and keeps explaining its basic premise of the Sri Lankan conflict for too long. As a result the viewers sitting in the theater expecting some high paced action-adventure from John Abraham start getting disappointed. Moreover with no deliberate build up for the main wanted man authorities are looking for, the excitement is missing and one doesn't find himself pulled in any chase or attack sequences quite frankly.\n\nPost intermission when it all become clear about the big historical assassination the film is heading towards, suddenly the suspense is all lost since we already know what is going to happen next and there is no guessing left for the viewers. And further when it all happens exactly like it is expected too, one walks out of the theater with an impression of having seen something good & well attempted but nothing exceptional in terms of return for the ticket bought. Hence its pretty obvious that MADRAS CAFE is strictly not for the smaller centers and is going to struggle at the single screens theaters for sure. Plus it may also get a mixed kind of response at the multiplexes too as there are not many who would be willing to buy a costly ticket for a political thriller made on the Sri Lankan conflict. So where a particular section of viewers may find themselves praising the movie a lot, many others are not going to consider it worth their time and money spent. And that's exactly why I would like to call it as a film not really for 'the common man', a phrase used by Shahrukh in his latest money grosser.\n\nRegarding performances, MADRAS CAFE has John Abraham honestly putting all his efforts to fulfill the director's requirements but I seriously found his confession in the get up of a lost (retarded kind of) bearded man quite weird and unexplainable since there was no fault of his in all those tragic incidents. Nargis Fakhri perfectly plays the role of a foreign war correspondent and the move of using her complete dialogues in English (with Hindi subtitles) is sure going to prove as a big downer in the centers other than the metros. Sidhhartha Basu plays the media expert superbly and Prakash Belawadi is impressive as the cunning mole working against the government. Rashi Khanna doesn't get much to do as John's wife and Ajay Ratnam fails to make any solid terrifying impact as Anna.\n\nIn all, MADRAS CAFE is a good watch if you are really fed up with the usual Bollywood stuff repetitively being served by the big names. Its unarguably one of the better attempts to make an enlightening political thriller, but could have been a lot more with some high paced, engaging and unpredictable twists used in its basic structure. At times a little dramatization of the real life happenings add to the overall impact hugely and completely refraining from them makes the end product quite raw and tasteless. And I personally missed that delightful taste sitting in Shoojit's MADRAS CAFE this Friday but still would like to recommend it to all thoughtful viewers strongly."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "kajalrahul",
        "review_rating": "9",
        "review_title": "Hollywood in Bollywood",
        "review_detailed_main": "You have to keep your mind awake all the time to understand the plot. You will not feel anywhere that you are watching a Bollywood movie. No fake action or flying cars. All actions in the movie are completely natural. No boring part, you will thoroughly enjoy the movie. Movie is inspired by a real incident. Unlike Hollywood it is difficult to make movies on real incidents in Bollywood. But the work done is exceptionally great. Unlike other movies there is no dancing or singing. The complete focus is given to the story line. John Abraham is in the lead role and he has performed it very well. The female lead role is done by Nargis Fakhri, she has also done it very well."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "sohansurag",
        "review_rating": "7",
        "review_title": "Intense!",
        "review_detailed_main": "John Abraham produced and acted Madras Cafe had been the talk of the town much before it was released, and much of the talk arising from the sensitive and controversial theme it had.\n\nShoojit Sircar, who previously directed the critically acclaimed Yahaan and the over-rated Vicky Donnor helms Madras Cafe. Thankfully, Sircar handles Madras Cafe with utmost care not to overdo the war or the assassination finale. It was indeed a bold move. The movie's first half packs a punch and a lot had been squeezed into it, be it the civil war or the politics that was in play behind all the events. And the same had been narrated via cut shots and collages. The pacing too was brisk leaving no time to take in breath, inducing a kind of grim feel consistently till the end. It essentially had that Hollywood vibe thanks to the brilliant cinematography by Kamaljeeth Negi.\n\nThe first half of the movie was concentrated on the dreary happenings of Sri Lanka and it did have a huge impact on me as a viewer though the second half was focused more on the Rajiv Gandhi Assassination which took off some of tension that was built up in the first half. I do know that it was inevitable but much of my interests were invested on events we had not known about than a tragedy which we were familiar with.\n\nGlad to see John Abraham playing a no-frills-attached espionage agent and felt he'd done justice to the role without the usual bells and whistles of a Bollywood hero. Total thumbs down to Nargis Farkhri. All she did was pout and brung nothing to what could have been an otherwise prominent role. Special mentions include Sidhartha Basu's impeccably portrayed Robin Dutt aka RD and Prakash Belawadi's Bala. Being a Mallu it'd be iniquitous if I don't mention Dinesh Nair a multi-talented actor who played the role of Rajasekharan. Debutante Rashi Khanna makes a mark on the audience playing a charming Ruby who comes off as a bit more adept than Nargis Fakhri.\n\nA more reminiscent comparison would be Santhosh Sivan's Theeviravaathi: The Terrorist which managed to depict a very violent theme in a non- violent and subtle manner bringing in the same kinda grim feel throughout. While it was the terrorists inner conflicts that was shown there, here we have a look at the nuances of an agent stranded amidst personal tragedies and obligations towards his nation.\n\nWhat Madras Cafe does best is the visualization of war and makes a point where its not always guns and action. There are casualties of course but apart from that there are also the dreaded memories of events leading to and following a war which forever scars a nation, a continent and the world."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "merchantcowboy",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "By far, Madras Cafe is one of the worst movie of its kind. With poor acting, and translations of English subtitles, this is also a historically incorrect film. It reminds me of the numerous Vietnam war movies of the 80s, where the hero takes on a hundred people at once. Bollywood should stick to song and dance musicals. Apart from that, the film does a great disservice to the Tamil population in Sri Lanka's Northeast who have undergone great sufferings at the hands of both Indian and Sri Lankan Governments. Bollywood stars are poor actors, at best, they are a bunch of phonies. Further, they should focus on subject matters they are good at such as comedy, and cheap love stories."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "srgclub",
        "review_rating": "8",
        "review_title": "Madras Cafe is one of those rare movies which has its scenes inspired from a great movie and an inspiration in itself as well",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "atulsjoshi",
        "review_rating": "10",
        "review_title": "Intelligent, gripping and a raw thriller, A must watch for everyone.",
        "review_detailed_main": "My expectation where very high with this one. Vicky donor was a pleasant surprise but this one blew me. John working as RAW agent with undercover operation in Sri Lanka during the Tamil crises. The movie start off with a normal pace but as John narrates the story alone it picks up the pace.The movie overall is a very sleek spy thriller but looks real on screen. Even though the movie is based on true events the story, screenplay is the true hero and well supported by all the actors specially John, Nargis and Siddarth Basu ( refreshing to see him after a long time).\n\nHats off to John and Shoojit for making this great thriller, made under Rs 10 crores.\n\nGo enjoy a riveting thrilling and gripping 130 mins of Madras Cafe."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rsabnis1",
        "review_rating": "8",
        "review_title": "Thumbs up to Sircar's sincere effort !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "animesh303",
        "review_rating": "10",
        "review_title": "Madras Cafe is superbly refreshing",
        "review_detailed_main": "Madras Cafe is political-action movie released on perfect time when bollywood audience was pathetically bored by both Shahrukh and Salman with monkey comedy and style. John Abraham gave his best performance and proved many of his critics including me wrong. Producers in bollywood complain over the lack of script, but this movie can teach others to fetch events based on history - weather it is a tragedy or happy ending movies. You need not act funny to make up for bad scripts in movies. Shoojit Sircar had a clear direction, pace of movie to narrate this sequence of events that led to one of the biggest disaster in Indian politics and its relation to Sri Lankan civil war. Politics, patriotism, action, betrayal, conspiracy, espionage - all form a essential ingredients to make this movie a great entertainer which leaves an lasting impression in viewers mind. The movie lacks any memorable song which most bollywood movies would usually have. I personally feel stories and song should be separate.\n\nMust watch for all."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "shashank-mishra2008",
        "review_rating": "7",
        "review_title": "If Movies will be made like this in India, I'll stop watching Hollywood",
        "review_detailed_main": "Watched Madras Cafe 2day...never felt that i wasted my time watching this movie.\n\nWithout wasting any time on LOVE-ROMANCE-ANY HUMOUR COMEDY MOMENT-OR PUNCH LINE.....This Movie was a FAST ride from staring till the end. Although sometimes it felt as if we watched 2 movies in 2 halfs(before & after interval) & felt that d movie went in another direction after interval...but it wasn't actually that way.\n\nThis is the 1st Bollywood movie which has such a great & extraordinary CINEMATOGRAPHY scene after scene. The beauty is that even when the audience knows that what has to happen in the end The director still holds us to the movie.\n\nIt can be said now that filmmakers in India can boldly make real-life stories without fear of controversy or censorship, this may be the best way to approach important stories that must be told."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "mrinaldutta90",
        "review_rating": "8",
        "review_title": "First real Espionage Thriller from India",
        "review_detailed_main": "Madras Café ,directed by Shoojit Sircar ,whose Vicky Donor won the hearts of both the audiences and the critics, which is a really difficult job to do in our country. He, with Madras Café steers into difficult waters .Espionage thrillers are rare in Hindi, and the ones made do not even deserve to be called thrillers. Here he not only manages to deliver a gritty espionage thriller, but does that with non-actors like John Abraham and Nargis Fakhri. Rajiv Gandhi's assassination serves as a vantage point in this film and the build up to the event is shown in its gritty reality. The film starts off with Vikram (John) visiting a church in Kasauli and doing a confession there, and in the process acts as a narrator to this film.The backdrop of sectarian politics in Sri Lanka is explained ,the crimes against the minority Tamils by the ruling Sinhalese is shown with shocking reality. Then the film goes on from one point to another.Indian politics is shown inside out.Nargis acts out the role of a war journalist. The occasional tribute to Apocalypse Now was fantastic for the film lover. Acting wise ,only Siddhartha Basu 's role was noteworthy."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "jhashyam",
        "review_rating": "7",
        "review_title": "Courageous effort by John Abraham",
        "review_detailed_main": "To produce a movie like Madras café, one needs lot of guts and courage. In India it is not easy to make political espionage thriller based on certain true event. John Abraham surely needs many pats on his back for producing movie like Vicky donor and Madras Cafe. Brilliance of this movie lies in its grand canvas and realistic backdrop. This is perhaps first Indian movie which is very near to any war movie of Hollywood, as far approach is concern. Script is near perfect. Most of the actors have performed well. John Abraham has suited the role perfectly.Controlled direction, Good cinematography and tight editing add to the mood of this movie. Over all fantastic one from JA."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "tatai_bose",
        "review_rating": "9",
        "review_title": "Bollywood Grows Up",
        "review_detailed_main": "Don't know about Indian audience but Indian Film Makers are surely maturing in terms of story telling. Madras Cafe is one of the rare gems in Bollywood which depicts fast pace revelation of events coupled with engrossing plot and apt acting. This movie reminded me of the Bourne Series more than once and pays silent tribute to Hollywood style film making. Talking from acting point of view, it seems John has kept his best for 2013. After Shoutout at Wadala, John undoubtedly provides his career best performance with this one. Well then again the role of the RAW agent was tailor made for him. Siddhartha Basu deserves special mention as the the guy with the brains provides the sense of calmness in this fast paced assassination plot.Nagris Fakhri seemed at ease with her British English Accent though a lot of improvement is still required as per her acting abilities. Last but not least, hats off to Soojit Sarcar for pulling this off. Golden Times Ahead."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vivekmoka45",
        "review_rating": "7",
        "review_title": "Well written ,well executed ,poorly acted..!",
        "review_detailed_main": "Madras café is undoubtedly this year's best work so far..It has a certain realism to it which D-day lacked. John Abraham was expressionless as always.But at least he tried to act in this film unlike in other films where he just gives a pose.\n\nThe best thing about this movie is...even though we already know how its going to end ,we still hold on to the movie biting our nails. Especially the 2nd half of this movie is so gripping to the core.\n\nsoojit sircar did a terrific job . kudos to him for picking this subject and perfectly executing it. The only thing that bothered me is John's acting..He was kinda okayish .But this dude certainly have some good taste in films, Vicky Donar and now this.He deserves some appreciation for producing such films..He is turning out to be Ben Afflek of Indian films(if you know what i mean)....films like this restore my belief in Indian cinema."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vinodiyer24",
        "review_rating": "4",
        "review_title": "Content is there, but falls short on execution",
        "review_detailed_main": "It is an excellent topic to pick up - assassination of a leading political figure. Bollywood, sadly, feels the need to balance its traditional need for glamour with realism demanded by the script. This is where Madras Cafe falls short.\n\nPositives - Good concept, an honest attempt to make realistic cinema, no song and dance (as demanded by the script), good pace Negatives - Sheer lack of homework (Sri Lankans speaking Tamil with Chennai accent, English woman speaking in American accent,Army officer reporting at Head Office unshaven, wearing glamorous clothes while undercover) Poor acting - John Abraham is wooden and cannot go beyond stock expressions. Nargis Fakhri is terrible. Neither does the role offer much glam quotient and nor does she act. She sticks out like a sore thumb. Editing - Too sketchy; especially in the meeting scenes. Frames move very fast without any pauses for thinking.\n\nSummary - For regular cinema goers who prefer good cinema but end up watching slapsticks or poorly made movies, Madras Cafe will come across as a quality watch - a definite upgrade on the Golmaals and Singams of the world. For those who are more selective with their movies, this will disappoint."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "alwaysplanb",
        "review_rating": "10",
        "review_title": "One Word: Ultimate!",
        "review_detailed_main": "This is frankly one of the best movies made this year. Very fast paced and realistic thriller.\n\nOne of the problems I see in Bollywood is EVERY movie involves escapist cinema. While such over the top action/comedy movies are nice to be savored once in a while, every other movie being made in the same fashion makes it stale.\n\nNow Shoojit Sircar (director of Vicky Donor) gives us another mind blowing movie with Madras Cafe. Its down to earth approach and realistic blend of fact + fiction (regarding Rajiv Gandhi assassination) leaves cinema goers like me extremely satisfied. I have seen such carefully nuanced film making in 'Body of Lies', 'Green Zone' and 'Bourne' movies. But never have I seen such a fine political thriller in Bollywood (Shanghai was close though!). I was really anxious as to whether the movie would live up-to the expectations. Or if the director would Bollywood-ize the movie for the sake of box office. Thankfully, the movie steered clear of such typical Bollywood clichés; and delivered a thriller that's gracefully raw and appealing.\n\nJohn Abraham gives the best performance till date. Nargis Fakhri also gives a nice performance as a foreign-based Indian reporter. I must commend the director for giving 100% English dialogs (with Hindi Subtitles) to Nargis who carried it out perfectly. However, it's Prakash Belawadi who leaves an impression as John's superior Bala.\n\nAll in all, the movie is very swift and well made, and also throws some light on the ambiguous relation Indian maintained with Sri-Lanka. If you are looking for a masala movie, this movie is not for you. Devoid of even a single comic moment, this movie is strictly for viewers who like taut political thrillers. If you liked Green Zone, Body of Lies and Blood Diamond, this is must go for you as you'll see Bollywood like never before."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "niraj-ju41",
        "review_rating": "9",
        "review_title": "Best Hindi movie i ever watched",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "abhishekdas2006",
        "review_rating": "10",
        "review_title": "sensible movie lovers delight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vallabhiaf",
        "review_rating": "10",
        "review_title": "Goosebumps",
        "review_detailed_main": "Showing the truth with such cinematic way is the right direction for bollywood to grow"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vinay_payyapilly",
        "review_rating": "6",
        "review_title": "100 for attempt. 50 for execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "tarun-rajput-engineer",
        "review_rating": "10",
        "review_title": "Very well written and directed movie",
        "review_detailed_main": "The movie links the Shrilanka's Civil war, started in 1980s for Tamil people's human rights, to India's Ex PM's assassination. The movie shows the whole investigation and India's efforts to give peaceful solution during Shrilanka's Civil war.\n\nThe whole movie has nailed the truth of huge political conspiracy. The whole direction of the movie is excellent. Actors have done great job.\n\nThe movie shows the Indian cinema has started evolving now. The script of the movie is fantastically written and executed.\n\nBut, the movie is not any popcorn movie which is seen for fun. So, watch it only when you want to see really some interesting and realistic movie.\n\nFor me it is 10/10...\n\nCheers for the whole team of the movie."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vishaal811",
        "review_rating": "7",
        "review_title": "Bold Movie let down by the Acting",
        "review_detailed_main": "Madras Cafe is one of the very few Bollywood movies that is based on a true historical event. The producers must be applauded for taking the chance and Madras Cafe is a tight movie with some good editing. However, the main problem is the performance of John Abraham, who is playing an Army Soldier. The acting leaves a lot to be desired and it is one of the disappointing aspects of this movie. It is nice to see movies that are not mindless and require the viewer to be attentive. There are no songs that break out of nowhere which is a relief. The action sequences could have been better considering the number of killings that occurred in Sri Lanka during the period. My overall rating of this movie is 7/10 and I recommend this to those who like movies having a storyline instead of the usual Masala Movies that are dominant in Bollywood."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "daminigaur87",
        "review_rating": "8",
        "review_title": "A genre that has never been worked before in India....",
        "review_detailed_main": "Simple justification to a portion of nutritious meal for the grey stuff of India. Shoojit Sarcar's third release , after his charming comedy Vicky Donor; has more in common with Sarcar's first one, Yahaan which was set in Kashmir. Seems like Indian cinema is finally taking a leap over pragmatic evolution with the film to be set in the 1980s in the backdrop of the Tamil civil war in Sri Lanka. Right dozes of thrill and politics are tried to be brewed up by Shubendu and Somnath (scriptwriters) to create the chapter. Lush rain forests and twilit helicopter flights in the world are synchronized with the subject. The only gaping hole to some extent is that the script feels simultaneously convoluted and simplistic sometimes. There is a sense of loss in interest in the actual content of Sinhala-Tamil politics. However script is rightly sorted and filtered attempt in order to make a daring creative move to acknowledge Hindi cinema with a messy civil war tale that most Hindi film viewers know a little about. Courage of its unusual political subject, non heroic antics and attempted realism are the points to be feted over and about. Nargis Fakhri clearly act businesslike journo and John portrays a somewhat flatly emotional RAW agent. Thankfully the oldest trick of Hindi movie book - star crossed romance is kept far away. Vikram's wife Ruby, seems a promising actor, but we learn nothing about her except that she's anxious about her husband's safety. Ruby is a one-note character and her departure goes un-lamented. Familiar faces from the Delhi theatre world have done due justice – Avijit Dutt, Sudhanva Deshpande, Jayanta Das and Swaroopa Ghosh (both of whom also acted in Vicky Donor, as Yami Gautam's father and pishi respectively) and most interestingly, Siddharth Basu. Basu as Vikram's super-boss Robin Dutt and Kannada theatre person Prakash Belawade as the hard-drinking agent Bala are the only ones to leave anything close to an impression. What really makes this film fall flat is the vagueness of its central dramatic thread – Tamils in Madras Café die as innocents and kill as guerrillas, but what are they dying and fighting for? That is never really explored, politically or emotionally. At the end of the film, Vikram is still going on about how he could have saved \"our Prime Minister\"."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "tushargupta-27286",
        "review_rating": "6",
        "review_title": "Real story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "iboymuthu",
        "review_rating": "1",
        "review_title": "it is full of lie! it is against of Tamil",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "postsenthil",
        "review_rating": "8",
        "review_title": "A VERY VERY GOOD WATCH !!",
        "review_detailed_main": "When I was first introduced to fiction from Fredrick Forsyth and his many peers who have written some delightful political thrillers based on real life events, I was enthralled by their detailing and real life political setting as well as the oft blurred lines between fact and fiction, so much so, I used to refer to them FACTion and not mere fiction. While Hollywood and international cinema churn out political thrillers and dramas based on real life events in regular intervals, the best we ever get from mainstream Bollywood and regional language movies are the occasional biopics. Dramas or thrillers based on real life political events have been an arena where contemporary Indian cinema had clearly feared to tread.\n\nDirector Shoojit Sircar's Madras Cafe ventures into such a sphere and presents an interesting thriller set in the background of civil war in Sri Lanka during the late eighties and the early nineties. It weaves a fictionalised account of the political conspiracy that eventually culminated in the assassination of the former prime minister Rajiv Gandhi.\n\nThe movie has a quirky beginning with a dishevelled, dazed and drunk John Abraham in a hill station recounting the events to a priest which unfold as a flashback. John plays Vikram Singh, an army officer working with Reasearch & Analysis Wing (RAW). It is the late eighties when India had signed a peace accord with the island nation and had sent in the Indian Peace Keeping Force (IPKF) to Sri Lanka to restore peace and assist in a peaceful political transition in the Tamil areas of the north and the east by disarming the rebels. However, they have to confront the powerful Tamil rebel group called LTF headed by the Anna Bhaskaran (an aptly cast Ajay Ratnam) who is keen to continue the armed struggle for an independent Tamil homeland, for he fears that if they accept disarming, the locals will be decimated after the withdrawal of IPKF. Vikram is sent to the Jaffna to work under Bala (Belawade) to ensure that the peace process succeeds and there is a peaceful political transition through popular elections. To this end, he tries to weaken Anna's & LTF's stranglehold over the region by providing covert support to outsiders as well as dissenters within the LTF. Vikram is helped by Jaya Sahni (Nargis Fakhri), a London based war correspondent who provides him with some vital clues. However, he is ignorant of the many undercurrents of betrayal at play and is forced to return to India after a failed operation. Consequently, Anna and LTF eliminate all their opponents and emerge the strongest force in the region. Shift in political dynamics in India & Sri Lanka result in an ignominious exit of the IPKF from Sri Lanka. However, when the political winds of change blowing in India indicate the return to power of the former prime minister, whom Anna fears could jeopardise his ongoing struggle, he resorts to pre-empt that situation and conspires to assassinate him. There is also an element of international conspiracy that seeks to profit by perpetuating strife in the region. The rest of the movie is a race against time where Vikram and his colleagues unravel the conspiracy and attempt to foil the plans of Anna and his assasins.\n\nThe movie takes some time to set up the context and these early portions lack in pace and are listless. However, the movie finds it soon after the scene shifts to Sri Lanka and some tighter scripting and crisp editing sets up a pulsating second half which is set as a race against time. The cinematography is excellent throughout and provides an authentic feel to the unfolding events. Shantanu Moitra's score sets an apt tone for the proceedings and elevates the intensity of the events in the second half.\n\nJohn Abraham has done a good job in the role that requires a restrained performance. Nargis Fakhri seems adequate in a cameo of an English speaking international war corrspondent. The other roles have been aptly cast - be it Ajay Ratnam as Anna or Sidhartha Basu as Robin Dutt, the RAW chief or Belavade as Bala - and their performances are competent.\n\nOn the flip side, the movie appears a bit muddled in some portions where the events appear to unfold in a haze. Also, the portions between John and his wife (Rashi Khanna), though included to portray him as a normal person, could have been edited out as they slacken the pace without adding any significant heft. Also, Vikam's retelling of the events as a flashback to a priest in a hill station appear to serve no useful purpose.\n\nNevertheless, John Abraham as a producer as well as the lead and Shoojit Sircar deserve much credit for the mere fact that they chose to make such a movie and explore an hitherto unexplored terrain for Indian mainstream cinema. It is also no mean feat that they have managed to pull off this ambitious enterprise quite successfully without succumbing to the several cliched compromises of Bollywood such as making the hero to pull off Bond/Bourne like stunts (Ek tha Tiger or Agent Vinod), jarring jingoism which paints the other side as pure evil (Gadar, Border, et al).\n\nDespite being a movie set in the background of a war, Madras Cafe does not take sides; Nor is it a movie that overly focuses on its main lead. The protagonist here is merely one of the key players in the plot which has several layers of intrigues that he has to grapple with. The unfolding political conspiracy remains the unflinching focus of the movie and it underlines the theme of futility war which begets devastates both winners and losers.\n\nOverall, Madras Cafe, despite a few flaws, is an audacious venture and presents a taut thriller which is authentic in equal measure. Both, John Abraham as producer and Shoojit Sircar as the director deserve plaudits for such back-to-back (after Vicky Donor) projects which raise the bar for Indian cinema. If only, we, as a nation, could grow to appreciate and encourage such efforts without expressing umbrage, we can hope to see more such meaningful entertainers. If only ...."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "leebathomas-96496",
        "review_rating": "9",
        "review_title": "A good thrilling watch",
        "review_detailed_main": "I appreciate this kind of apt and crisp movie with no nonsense drama mostly seen in big banners like Karan Johar etc. Overall a gripping story line and nice execution."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rajukumar-earth",
        "review_rating": "10",
        "review_title": "One of the best movie's of Bollywood.",
        "review_detailed_main": "One of the best movie's of Bollywood.Every Indian should know the facts that has been shown in this movie. Shoojit Sircar's Madras Cafe starring John Abraham and Nargis Fakhri is not just another typical Bollywood masala flick but is a thought provoking, heart touching political drama. It's a film that will keep you and your eyes glued to the seat and the screen, effortlessly. Sircar has given meaty roles to all his characters and not just the leads.\n\nThe opening scene of Madras Cafe showcases khoon kharaba and merciless killing of innocent people. The scene then effectively moves on to the present where we see John in despair trying to overcome his sorrows with alcohol. Our hunkalicious drunken John Abraham (Vikram Singh) then visits a church where he recalls the blood-curdling tales of the Lankan wars and then the flashback begins. From here, the film takes us back to the 1980's and is set against the backdrop of Sri Lankan wars.\n\nJohn Abraham is a military officer who's ordered to carry out covert operations in Sri Lanka during the rise of Anna Bhaskaran (played by Ajay Rathnam ), the leader of a fictitious rebel group LTF. On John's arrival in the war struck country, he meets Nargis Fakhri (Jaya) who is a British war correspondent. No, there isn't any filmy style 'love at first sight' that evolves between the two. We're glad that Sircar has delivered his film with practicality. What we notice is that, while John speaks in Hindi, Nargis responds in English. Maybe she could've delivered at least one Hindi dialogue, but we aren't complaining. We guess the Rockstar babe got her acting right because she spoke a language that she's well-versed with\u0085 Moving on, during John's stay in Sri Lanka a lot unfolds including a tragic death, followed by double crossing, kidnapping and many more twists.\n\nWhile being engaged in the politics involved, it's quite apparent that Sircar hasn't ignored the importance of relationships in a person's life. Newbie Rashi Khanna (Ruby Singh), who plays John's wife in the film doesn't have a lot of screen presence but all the same she serves her purpose. Sircar has delicately portrayed the kind of relationship that a military officer has with his wife and how the love for our own country overshadows any other kind of love\u0085\n\nThroughout the film, we're aware that there's going to be an assassination. Despite knowing it's going to happen, we still dread the scene and hope against hope that John saves the day. However, Shoojit knows what he's doing and ensures that John only plays a hero and not some larger-than-life superhero in the film. We love the way Sircar has facilely designed a realistic fiction film!\n\nThe cinematography is mind blowing with terrific visualisations and sound effects. Nothing is overdone in the film. Madras Cafe sticks to its genre and remains a political thriller throughout the film without romance, item numbers, vulgarity and unnecessary skin show. Music by Shantanu Moitra is pleasing to the ears. The film isn't force-filled with unnecessary naach gaana just to add a romantic factor and we totally love that!\n\nThe film ends with an intriguing thought, who really won the war. It keeps us pondering for a while that nobody gains at the end of a war, there's only loss\u0085 As the narration ends, the beautiful track Maula Sun Le Re starts playing. Hmmm\u0085 Is John asking the Lord to listen to his pleas for his film to work? He surely doesn't need that for this film to work as it's the best political thriller that Bollywood has ever se"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "sohambasak1996",
        "review_rating": "10",
        "review_title": "I wish it had more stars",
        "review_detailed_main": "Movies come and go but this type of movies remain in our mind for long time. After 'A Wednesday' i think that this is one movies which i would give stars beyond limit. A harsh reality is that people just for their benefits shout that this film hurts their sentiments but this movie contains no such. Such a shame that for politics and to not expose our secrets we don't even let such movies come in theaters also. Once again hats off to Shoojit sircar for his awesome directing and the roles played by all the characters were all very good. Wish this film is nominated and awarded for the best thriller of the year. Political melodrama, corruption, conspiracy and war all a total pack worth your hard earned money."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "akshatsheth08",
        "review_rating": "9",
        "review_title": "Shoojit Sir & John back with a bang...",
        "review_detailed_main": "Story: Vikram Singh is deployed on a covert oppression to Jaffna. After India and Sri Lanka signed the peace accord in the mid 1980s, India took it as their mission to help its neighbors relieve themselves from the ethnic strife between the Sinhalese and the Tamils. Hatching a plot to bring down Anna, a popular Tamil leader in the zone, Vikram begins with trying to team up with Anna's opponents in the beginning.\n\nFalling prey to a leak, he loses his first shot with Anna and gets kidnapped by his forces! However, now hell bent on getting Anna to bow down, he teams with Anna's own men and manages to ambush his army. However, Anna manages to survive and returns even more powerful by eradicating Indian forces off Jaffna and Lanka.\n\nPlotting ways to kill the former Indian Prime Minister fearing that he will return to power, the film is a tussle between the war makers to safeguard their interests! And for Vikram, it is the story about how India lost its Prime Minister in an assassination which the nation has still not forgotten!\n\nPerformances: John Abraham as Vikram Singh topples all his previous performances. He isn't a very flattering actor but his clever choice of role and wicked acting surely shows a remarkable improvement. He isn't the John who couldn't emote. He is the John who isn't afraid to take up challenging roles and carry them out gracefully.\n\nNargis Fakhri with her British accent is pitch perfect. She may not be a show stealer but does her bit with élan retaining the correct persona for it.\n\nSiddhartha Basu is quite a natural as he smoothly slips in the role of R.D. His intelligence shows in his eyes, and he manages to command respect in his character! Never stepping a wrong stone, the man should have taken up acting long back!\n\nThe supporting actors are all impressive but in the end, this film is more about its intent and plot than about its actors!\n\nDirection,editiong,screenplay & music:Shoojit Sircar is back after a long hiatus since Vicky Donor. He strings into the same plot, the emotional wreckage and physical devastation of war to emphatically put forth the futility of it all. In the climax, Shoojit concludes with, \"One man's revolutionary is another one's villain!\" followed by a few stellar lines of Tagore! Truly, in the clashes of mindsets the only people who suffer are commoners who seek only peace and happiness from their lives.\n\nAs Lankan leader Anna strives to garner power and Indian Government attempts to achieve their political motive of maintaining monopoly in the subcontinent by maintaining friendly relations with Lanka to obtain access into the South East Asia, Sircar wonderfully relates the story of anarchy, bloodshed and meaningless war which continued for 27 long years killing thousands. In the end, he does squeeze out a potent message about the nugatory nightmare of the wrath of war! Shoojit intelligently executes a crisply written story which is executed breathtakingly. The editing of the film is quite well done, as the docu-drama style doesn't stir up any boredom. Shantanu Moitra's music is pristine and haunting as the climax wraps up with Papon crooning Maula Re.\n\nThe last word: Madras Café is a hypnotically created masterpiece which thrives in the freshness of its conception. Using history with drama to build a persuasive tapestry of enthralling action, energetic plot and skillful narration of the grim phase of Lankan War, Shoojit Sircar astonishes with this fascinating docu style dramatic movie. I am going flatly with a 9/10 this triumphed work of passionate and compelling cinema."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "Amazing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "anish-7",
        "review_rating": "5",
        "review_title": "\"Rajiv Gandhi Dhaba\" trying to pass itself off as \"Madras Cafe\"",
        "review_detailed_main": "Let's get one thing out of the way before I delve into that half baked dish called \"Madras Cafe\" ; its a commendable effort coming from mainstream Bollywood that needs to watched and encouraged and yadda yadda yadda.......\n\nNow this is where Bollywood goes and shoots itself in the foot. They set out with this grand and lofty ambition of making a different kind of a movie, not a 3 hour mindless song, dance and dishum dishum spectacle, a political thriller no less, and yet predictably end up with egg all over their face . Entirely because they neither have the required competency in story telling nor in story enacting, the two vital components which Hollywood has mastered when it comes to war movies/political thrillers (think Argo, Platoon, Z, The Manchurian Candidate etc).\n\nShoojit Sircar's \"Madras Cafe\" is a stupidly simplistic, glossing over the facts, adolescent comic book take on the vexed, complicated, multi layered, half a century old Tamil – Sinhala strife in SriLanka. Oh did I say Tamil – Sinhala strife? I am so sorry; the move couldn't care less about that at all. What the movie cares about is how the civil war was actually fought between the good guys - RAW (Research and Analysis Wing) of India vs the bad guys - LTTE (rechristened as Tamil Liberation Front, TLF, in the movie) of SriLanka in which \"innocents\" like Rajiv Gandhi were simply collateral damage. This is where the script writers Shubhendu Bhattacharya & Somnath Dey must take all the flak. Their joint venture script is so amateurish, so full of loop holes and loose ends that it almost reads like a dumbed down Facebook status update that a school going teenager might put up on the Srilankan civil war.\n\nCinematographer, Kamaljeet Negi, appears to be under strict instructions to give the war scenes of the film close resemblance to those of \"Apocalypse Now\", \"Platoon\" and \"The Thin Red line\".\n\nAdd to it, the unimaginative direction of Sircar (he falls back upon the background voice over narrative ever so often for the sake of us imbecilic audiences ) whereby he thinks he is being clever but ends being too convoluted for his own good. However, clearly the worst part of the movie is rank bad acting all around with lead actor John Abraham taking the cake. Abraham is so flat, monotonous and stiff that even when he hugs his wife passionately you think a mannequin could have done it better. Siddharth Basu, as the RAW chief acts like he is still the quizmaster shooting questions at the hapless contestants. If I have to admit that the undisputed Queen of bad acting, Nargis Fakhri, is the most outstanding act of this movie you get the extent of poor histrionics this movie has to offer.\n\n\"Madras Cafe\" is an intellectually vapid and dishonest film masquerading as a political thriller while it would have easily passed off as a pro Rajiv Gandhi propaganda film made by the Congress party in an election year."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "raja-mishra7",
        "review_rating": "9",
        "review_title": "GOOD WATCH, Perhaps the best movie of the year",
        "review_detailed_main": "MADRAS CAFE Rating: 8.7/10\n\nAbsolute Delight! I have never seen such skillful handling of a Political/Military Plot by any Indian Director for the Indian Audience, its a wake-up call to grow up to quality films, this one\n\nThe set-up seemed a little too up-to-date to resemble a scenario of late 80s (we can take inspiration from SPECIAL 26 for a better background set-up)\n\nA lot of elements were kept in ambiguity, but i would take it that those were intentionally done to spice-up the plot.\n\nJohn Abrahm and Nargis were both handled by the director delicately keeping in mind their respective limitation. John though is turning out to be a revolutionary figure in Indian Film\n\nCould have stretched the Assassination part a bit to make more logical.\n\nI found some glitch with regards to the timelines- in a few parts, the timeline seemed to be too ambiguous, but for such a brave and brilliant attempt this was a very minor miss.\n\nOnly issue was every other Sri Lankan and even the Thai people could speak Suddh Hindi, but come on this is far better that what we pay and see."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rlvkprasad",
        "review_rating": "10",
        "review_title": "And I say that This is my All time Fav thriller and it is for sure ....",
        "review_detailed_main": "i think i have seen this movie 10 times and yet it wont bore me...don't know if the story is true or made up...John Abrahm has done a masterpiece.. a matured attempt to show that India is serious about quality movies....i think shoojit had been burning his A** out to make some thing very very different from the usual bollywood masala types... SHOOJIT i Bow you my friend...thanks for this brilliant movie...\n\nits a simple movie in fact its a kind of documentary and may not be of interest to non indians...but the way the movie was directed is worth watching again and again....\n\nbest scene to watch for is ...\n\nBALA : you are doing good work, you report directly to me ...."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "kumar-neelesh1996",
        "review_rating": "8",
        "review_title": "Overall a great Political Thriller in recent times!",
        "review_detailed_main": "Shoojit Sircar, known for directing unconventional movies(Vicky Donor, Yahaan) has come with his new outing \"Madras Cafe\". Movie was in buzz from the day it was announced creating controversies all around it. Is it that Controversial to get banned? Well let me say, many people have different opinions on this film, but the fact is THIS FILM HAS SHOWN THE TRUTH! Shoojit has perfectly blended fiction with true events. And the most interesting part is that its not FICTION but The TRUTH which has created this much controversies. Set in mid 1980's, this film is based on Civil War in Srilanka, LTTE's role in assassinating Ex-PM Rajiv Gandhi. John Abraham, actor-producer, has done a fantastic job playing R&AW agent. He has proved that he can act in mainstream Cinema as well. Nargis Fakhri, as journalist, is efficient. Screenplay is aptly done. But plot holes are there. And the major one can be a blunder! John knows about the plastic bomb through the scientist in a scene, but he doesn't informs about the bomb to RD! This plot-hole must have been avoided. Well many of them may not have noticed that as the screenplay is so tight that you will sit at the edge of the seat till the conclusion! This film is all the way better than many political thrillers! I will love to say that you should enter this café and see the history in the most stylish way ever. RECOMMENDED!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "charuhas01",
        "review_rating": "8",
        "review_title": "general",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "acidrosesrijit",
        "review_rating": "8",
        "review_title": "Killing is the name...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "tihska-grag",
        "review_rating": "8",
        "review_title": "What could have been one of the best political thrillers, ends up being a different story with too many holes.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rajendranr7",
        "review_rating": "1",
        "review_title": "Wrong story plot against innocent tamils!",
        "review_detailed_main": "This movie is filmed intentionally to degrade the Pure Freedom struggle of innocent Tamils who fought bravely for their basic needs and humanity.\n\nIndia is the key nation who deceived the Tamils of Lanka from the beginning. This movie intentionally plotted to show them as terrorists. Whole world knows the truth. Please if you are not supporting separate nation please don't disturb us to get the same.\n\nWe are worshiping our Leader. Please Indians don't give more pain like taking movies like this hiding the truth that happened.\n\n~~~~~~~தமிழர்களின் தாகம் தமிழீழ தாயகம்~~~~~~~~~~"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "shkamath-01355",
        "review_rating": "8",
        "review_title": "Riveting! Tragic! Thoughtful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "Harshithnagraj",
        "review_rating": "9",
        "review_title": "One of the best film",
        "review_detailed_main": "I think of the best film which revolves around conspiracy and it is also a best spy thriller and direction is imaginable and I think best. And John sir's acting is superb and cinematography is awesome and I think gem of Indian cinema"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ahirjoy",
        "review_rating": "9",
        "review_title": "Must Watch!",
        "review_detailed_main": "\"Madras Cafe\" (2013) Review - What an exceptional thriller - 4.5/5! You will never realize how 2 hours 30 mins will fly. It is great that it is close to 50 cr mark, one sixth of the business of the \"Chennai Express\", only it is six times better movie than that! I also didn't realize why it was so much hue and cry around this great movie, can't we call a terrorist organization simply a \"terrorist organization\" which carried out the assassination of one of our country's PM whatever their belief is? Politics have become so cheap! Hats-Off to Shoojit Sircar, for being realistic and not crafting another superman fantasy about RAW agents. He was so brave that one of the most important characters(Nargis) playing a journalist spoke \"fluent English\" all through the movie which is exact match for an NRI journalist. It is unbelievable in the era of \"Item Number\" and \"Silly Jokes\" the movie doesn't have one single song, except the concluding one. John was good, specially his expressionless expression on the account of his personal tragedy was touching, it reminded me of Ajay Devgan in \"Zaakham\" or \"Hum Dil De Chukay Sanam\". But the real hero of the movie is the \"Script\", it was so intense, you can hardly relax your eyes looking elsewhere other than the screen! Must watch! I am hoping \"Satyagraha\" will be even better, review coming soon."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "abhi07",
        "review_rating": "9",
        "review_title": "madras café is very astonishing..........",
        "review_detailed_main": "I was really impressed by this movie still i voted it 9 out of 10 because this movie is near to complete perfection but in this world nothing is perfect .... still Madras Cafe is super awesome, totally moved by this conspiracy thriller, The Screenplay is fabulous- it divides the movie in two parts efficiently. First, the war conditions in Jaffna and then the assassination plot.In between shocking plots are revealed and it covers a vast script in its run time. Talking about Nargis her accent is good but should have done hard work on her acting skills and presentation, John is no more expression less actor.HE worked extremely hard in his recent projects and proved him.And he is at his best in Madras Cafe, It is a non Bollywood style movie where we find no songs, dancing and other commercial boring stuff etc. There is no stupid romantic situation in the movie which other Indian political movies show. hats off to Soojit Sircar for pulling this off, i highly recommend this movie to all and i am glad that, this movie is going to be tax free, I will thank to this movie creative team which done a fabulous job to make every sec. of this movie interesting.. it is a 130 min of mind blowing drama and unexpected thriller which is a good thing, go enjoy \"MADRAS CAFE\". And witness Bollywood like never before........."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "docs-manju",
        "review_rating": "9",
        "review_title": "Finest documentary",
        "review_detailed_main": "This is one of the few documentaries movies made India. All the credit goes to the director and producer (john himself) for bringing out wonderful movie, we are not sure about the facts as many have criticized saying that all the views were not expressed..But lets leave those apart and try to see how the things have happened during those crunch times. John has to be credited more for choosing such a subject to produce and act in it. His career took another turn after this movie. Truly now everyone takes him seriously rather than earlier times. soorjit right from his first movie..than came Vicky donor(unconventional subject for Indian market but it worked wonders) This is the first documentary which reminded me of Green zone, hurt locker experience while watching..Nargis (super accent to start with)if she had debuted with this movie in Bollywood it would have been the best decision nevertheless awesome movie, superb performance and shot extremely well."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "chitragoldy",
        "review_rating": "9",
        "review_title": "Must watch",
        "review_detailed_main": "A movie with all the necessary minute details which will make you sit back and concentrate."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "debojyoti-sarker",
        "review_rating": "5",
        "review_title": "Could be skipped",
        "review_detailed_main": "Could never understand why the name was selected a Madras Cafe. The end of the movie could have been anticipated well in advance. Expressionless acting from John & Rashi. John has no emotions, not sure why he was selected for the role. Story line for the movie is weak , no wonder why the film was a flop in the box office. Nargis Fakhri had no major role in the movie. Cinematography is quite strong. I expected a lot from Shoojit Sarkar but in the end it was a serious let down. I feel I just wasted 2 hrs of my time which could be have utilized to watch something else. Also wonder why the movie have 7.9 ratings on IMDb."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "mazumdar-abhilash1993",
        "review_rating": "9",
        "review_title": "Bollywood One Step Ahead Now...!!!",
        "review_detailed_main": "The terrifying Srilankan Civil War that lasted about 25 years was perfectly scripted and executed. Hats off to the makers for creating such a display on the canvas. Shoojit Sircar is a director who is now in the league of one of the directors to watch out in the future.\n\nWhat's Good : Well researched and scripted story. Creating the situations of war and the execution is perfect. What's Bad : I think too much use of English dialogues may offend Indian viewers..\n\nPerformances: John Abraham lives to expectations. He may not be exceptional, but he has done a very good job. Non Professional actors such as Siddhartha Basu and Dibang are terrific. Nargis Fakhri really delivers a good performance with her British accent. Supporting Cast is also really good.\n\nDirection : Now what can I say Shoojit Sircar is really a man to watch. From a film like Vicky Donor to now Madras Cafe he has proved himself. I can bet he can touch every genre with near perfection. He has done a award winning work with this film. He is a very creative man.\n\nLast word : Its a must watch movie... So don't waste time go and watch it!!!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "hotshot696",
        "review_rating": "10",
        "review_title": "A movie worth spending money",
        "review_detailed_main": "The year 2013 has seen a lot of sensible movies releasing alongside some of the most insensible ones. Madras Cafe, no wonder tops the list of the sensible ones. The year started with Special Chabbis and continued the trend with Bhaag Milkha Bhaag which evidently did go on to become an entrant into the 100cr INR club. However just when you thought it couldn't get any better Madras Cafe comes to prove you wrong. Set in a time when different sections of people had different views and opinions regarding terrorism, this well crafted movie has by far outdone any other movie in this genre. An engaging movie without any songs, it sure doesn't allow you to miss the songs, as it has you totally engaged in the movie right from the start to the end. With the recent trend of Intelligent movies getting a good share of market, this movie is sure to go places."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "sanmitro07",
        "review_rating": "9",
        "review_title": "Madras Cafe: \"Where the mind is without fear & the head is held high\"",
        "review_detailed_main": "\"Where the mind is without fear and the head is held high\"...with those famous lines by Tagore, this amazing movie called Madras Cafe ends on a positive note in spite of the fact that it shows bloodshed, human genocide, political conspiracy and an stirring assassination pre climax scene. Without revealing anything about the well written, extremely engaging story, I would recommend this movie to every 'quality cinema' lovers and trust me you will come out stirred, engaged in thoughts, sympathy for your neighboring country and for a national figure. The movie is visually stunning,the background music, the locations, the texture all adds to the flavour of the movie. All said and done, all the actors gave their best especially John Abraham who has shut the mouth of his critics with this offering. Kudos to Madras Cafe, you deserve a bow. Pls don't miss this movie on the big screen, you will regret it later..."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "janmejayapanda",
        "review_rating": "10",
        "review_title": "brilliant stuff just watch this movie and you will remember this movie for life time",
        "review_detailed_main": "This is a gem of a indian movie.after watching this I really admire Mr Rajiv gandhi the ex-prime minister of India."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ambarpax",
        "review_rating": "8",
        "review_title": "Madras café is high in caffeine;in right sense.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "avanindrajain",
        "review_rating": "9",
        "review_title": "Waiting for next Shoojit Sircar Movie",
        "review_detailed_main": "Few movies are made with such sincerity. Madras cafe deals with politics both national and international. While the director maintains it's a fiction, Story is beautifully mingled with a few historic events giving it a touch of reality; to me, that is the beauty and USP of the movie.\n\nScreenplay and cinematography are superb. Editing of the movie is good too, cutting unnecessary romantic/emotional scenes (which Bollywood movies are generally culprit of), making it a decent paced thriller. Though, I believe editing could have been better, especially the stature of Bhaskaran in Sri Lanka should have been more elaborate.\n\nPerformances are great- John deserves lot of credit for taking up the role and doing justice to it. Nargis also does a great job and so does 'Bhaskaran'.\n\nShoojit once again came out trumps. This is his third directional venture and he has not disappointed yet. Looking forward to his next movie."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "mahendrakuppusay-808-264678",
        "review_rating": "1",
        "review_title": "OMG!!! Worst acting, and too obvious...",
        "review_detailed_main": "This movie is God-awful! First time I have seen two actors conversing with each other in different languages. John Abraham converses with Nargis Farkhi in Hindi, while she responds in English, how ridiculous is that? Top it off, Nargis is supposed to be from Britain, while she has an American accent! This film also looks like a propaganda film, while Tamils are being slaughtered by some group, presumably the Sri Lankan forces, there is a child crying in the mayhem wearing a sign stating 'Stop Killing Tamils.' FYI, Tamil activism only started during the late 2000s.\n\nAnother strange thing in the film is that there is a mysterious white guy with an Australian accent, and another with an American accent with no description as to who they are. They supposedly are negotiating with the LTF (LTTE) in the film, while there is a guy looking like BJP Prime Minister candidate Narendra Modi. Very fishy?"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "swaven",
        "review_rating": "9",
        "review_title": "Madras Cafe-Got to be the best film from India",
        "review_detailed_main": "When I watched Zero Dark Thirty I thought such kind of films will never be made in India.Even if someone attempts to make such a film it will be diluted with lots of nonsense.I was proved wrong after watching this film.I still cannot believe it is an Indian film.First of all the script is based on historical facts.Second the film is based on Military Intelligence and Geo Politics. Indians very rarely take films on such subjects since it demands very strong screenplay and often the producers and directors for commercial reasons will dilute the scripts by adding some nonsense. First of all the main credit should go to John Abraham for producing this film and second to Shubhendu Bhattacharya and Somnath Dey for writing an incredibly brilliant screenplay and third to director Soojit Sircar for not tapering with the screenplay.\n\nLoved this film."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "shshanknautiyal",
        "review_rating": "8",
        "review_title": "Fiction comes from the facts.",
        "review_detailed_main": "Madras Cafe is probably one of the most engaging political crime thrillers to come out of Bollywood. While the Khans constantly rape human emotions in any blunder of a flick they become a part of, Madras Cafe scores high with impeccable method acting by John Abraham.\n\nThis is probably the first time John has worked to his true potential. Apart from the exceptional direction and editing, the film's only flaw I find is Nargis Fakhri. True that her role demanded her to be stylish and sophisticated, she is still the odd one out when compared with every other performance in the film. Even the character of \"Ruby\" played by Rashi Khanna scores well over Fakhri's performance in terms of the natural method adopted by the side-actress. Somehow Fakhri's fans will be proud of her because she has consciously stepped out of her mute- model image, and delivered the best she could in a very demanding role.\n\nDirector Shoojit Sircar's claim that the movie is a work of fiction will eventually be claimed to be true, however, I didn't find anything out of place as far as the facts in the movie are concerned. The crew has done its homework thoroughly and have kept the controversies at bay, but then again - shite happens only in India!\n\nFinally, the movie puts John back in the league. The plot is gripping and the climax is the fact with which we Indians have learned to live. Enjoy!\n\nRating: 8/10 (2 points off for Nargis Fakhri's below average performance)"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "dimajumdar7",
        "review_rating": "9",
        "review_title": "Must watch.",
        "review_detailed_main": "Fast paced movie. New to India. Salute. A great effort."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "indicontent",
        "review_rating": "10",
        "review_title": "Another Great Shot from Shoojit",
        "review_detailed_main": "The movie is one of my favorite; from plot to the narrative, it is near to perfect. Story is inspired from the real events and tells a lot about the civil war in Sri Lanka, espionage system of India, arms dealers and their interests in conflict. However, one thing that surprised me was no role of the Sri Lankan government was shown in the movie.\n\nActing wise I think Sidharth Basu was the best, then John. Nargis Fakhri did not have much to do in the film. But, I think it is all the director who should be given credit for such a great movie. After Vicky Donor and Yahan, Shoojit seems to graduating from fine to finer film making.\n\nMy final verdict, it is a must watch who love realistic movies. And, Yes, I liked no song Hindi movie."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rahuljonathan-nair",
        "review_rating": "9",
        "review_title": "An intelligent political thriller in mainstream cinema!!!",
        "review_detailed_main": "Political, tense, finally explosive, MADRAS CAFE is no picnic in the neighborhood park. Madras Cafe's true star is its story which builds up to an agonizing end. It brings to life the Lankan war which many viewers were too young to have known. It highlights India's ambiguous role, moving sensitively, taking no sides. Its second half grows more fraught and taut, conspiracies and compulsions becoming clearer. Madras Cafe deserves an extra half-star for guts, going for the gunpowder - but with a restrained hand. Wonderful film delivered by Shoojit Sircar and John Abraham after 'Vicky Donor'! Note: If you like typical Hindi movie masala, unrealistic action or melodrama, this movie is not for you."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "Pronil07",
        "review_rating": "9",
        "review_title": "Must Watch",
        "review_detailed_main": "In two words, awesome movie. After a long period of time I've seen such a standard Bollywood movie with serious actions and what to say. Hats off Madras café!\n\nJohn Ibraham is a superb actor and really he displays the real life threat of a RAW agent in real life. In the film John was looking great.The film shows you the real conspiracy in such a fantastic way. Cinematography is again awesome, i'll rate personally as 8/10. And last but not the least the background musics are really great, its like you are in heaven. I'll personally rate the background music 9.5/10 . Ekdam Jhakass hain Boss!"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "androunlock",
        "review_rating": "1",
        "review_title": "Based on Lies",
        "review_detailed_main": "OK i Accept that As a movie,this is really a OK film.....\n\nBut being a Tamil from Sri Lanka i am not able to digest anything.\n\nwhen this guy \"vishesh vijay\" talks about politics behind the movie without knowing anything that really happened in srilanka...how much problems my family faced due to Indian army...its my duty to point out why this movie should be banned...\n\n1.It was the Indian army(so called peace keeping force) & Sri Lankan army that carried out all the rapes,killings of Tamil innocent civilians in the first place which all the south Indian Tamil and Indian people know.....and apparently the director didn't want to show or even mention about this in the movie.\n\n2.the director had a meeting with the president of Sri Lanka before the pre-production of the movie..so you guys can figure out where this going....\n\n3.the Indian government/congress party leader Sonia ghandi was responsible for the killings of 400,000 Tamil people during the war in 2009/Indian government could have stopped the sl government from using cluster bombs which they didn't do.sonia's revenge for killing her husband who apparently ordered Indian army to go sri Lanka(to rape/kill Tamil people).\n\n4.when u make movie based on true story its your core responsibility to make sure you tell the whole story..but here its like the director wants to create a bad image about LTTE,the so called guerilla force/militants ran a Separate government(Schools,hospital,police force..etc)during the period they controlled Jaffna.\n\nDirector needs to be slapped in the face for this .....\n\nand john Ab i used to be your fan until this movie...."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "Swapnilagarwal",
        "review_rating": "9",
        "review_title": "This café is definitely worth a visit!",
        "review_detailed_main": "Finally, Indian cinema seems to be coming off age! Amidst the formula- based 100+ crore-club 'rabbits', certain 'tortoises' based on biopics and real incidents are getting into the race and winning hearts. The latest turtle on the track is Shoojit Sircar's 'Madras Café'. No, it's not a turtle in pace, but definitely a low-profile creation imbibing a high-profile story, untold till date on silver-screen. Hard to believe, but yes, this one comes from the 'Vicky Donor' director. While Sircar tickled our funny bones weaving a sensitive issue in his last routing, this time he forays into a new zone of political spy thrillers. Here's my take on various facets of the movie:\n\n\u0095 Plot: The movie revolves around origin and development of LTTE (referred to as LTF) movement in Sri Lanka and Indian intervention therein, which eventually led to assassination of Late Rajiv Gandhi (referred to as 'PM/ex-PM' only, his name not mentioned). LTTE issue was dealt in the past by movies like 'Roja' but this one literally dives to the sea-bed in detailing. The subject is very new and was equally sensitive to handle. But full marks to Sircar for doing the job so remarkably well. Movie is well-paced, smartly edited and impact-fully presented. Best part, it does not attempt to be judgmental on the issue and aims at presenting only whats and hows of the events dexterously.\n\n\u0095 Cast: Casting is the biggest forte of Madras Café. A larger than life issue like this demanded sensible casting and Sircar is bang on here too! John Abraham does full justice to the lead-role with his limited acting skills. Nowhere, he overplays or crosses the 'realism' line. However, for me, it's Siddharth Basu (the tele-quiz man of India) who steals the show with his impactful performance as RD Sir. He is suave and composed as demanded by the role. Hope to see more of him in coming days in Bollywood! Nargis Fakhri is good in the limited role she has. Unlike Rockstar, where she was required to emote (and failed miserably), in 'Madras Café', her character had to be stoic and stone- faced and converse only in English; so, the role suited her completely. Model Rashi Khanna adds a bit to the G-quotient as John's wife. All other actors are also perfectly casted, whether be those from Indian squad or LTTE/ Lankan groups (casted mostly from Tamil Film industry).\n\n\u0095 Cinematography: Kamaljeet Negi does a kamaal with his beautiful camera work. We see amazing yet intriguing jungles of Lanka, heart- rending war sorrows, quick spy sequences in Thailand, all through the eyes of his magic lens.\n\n\u0095 Music: We have seen in the past serious subject movies getting unnecessary potholes in the name of unrequired songs. Sircar was intelligent enough to limit music to background only. The sole song on- screen is with the closing credentials, which does not perturb audience's attention.\n\n\u0095 Flaws: The movie suffers from minor hiccups viz.: - Exaggerated emotional outburst by John for the assassinated ex- PM - Substantial use of English and Tamil (though with subtitles) might irk some.\n\nDespite having the spy angle, 'Madras Café' has no frills attached like 'Ek tha tiger' or 'Agent Vinod'. It is sincerely to-the-point till the very end. Hope, it encourages the new-age film-makers in B-town to foray more into such 'real' cinema. The movie is definitely a must-watch for all those expecting meaning and substance."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "prasadandre",
        "review_rating": "9",
        "review_title": "John's best ever!! Pick John's any patriotic movie and .......",
        "review_detailed_main": "One of my friend recommended this and I truly thank him for suggesting such an amazing movie. I felt that this movies is really underrated and untold or unspoken. This movie shall be known to every Indian.\n\nThis shows the untold wars, risk and unspoken martyrs. Im just freezes out, just finished the movie....I remember the goosebumps and it would be remembered forever......"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "amanand838",
        "review_rating": "8",
        "review_title": "This film means BUSINESS.",
        "review_detailed_main": "It is a very unfortunate fact that bollywood is still very much behind in making a movie which pumps up your heart, keeps you on the edge of your seat and lastly terrifies you. Yes there are many of them which falls in these categories but very few of them stands out. They start in order to make a thriller but then after bollywood-ising it ultimately comes out as a comedy. Adding characters which the movie don't need and introducing love-songs which don't speak even for themselves let alone the movie to which they are part of, have been the real problems for these movies.\n\nBut, Madras Cafe breaks all these rules and then gives a hard slap to all those filmmakers who are making comedy out of a thriller. It is a high intense drama thriller where the tension is high, characters are there not just for the sake of it, absence of songs are there so as not to spoil the mood(they really were not needed) and finally the story is moving.\n\nMadras Cafe is set against the backdrop of Sri Lankan Civil War in the 1980s and is about the lives of civilian getting destroyed as they hang in the middle of the government and LTF.The main plot revolves around the,as they say, Grand-Conspiracy of the assassination of the Ex Prime Minister of India by many external forces so as to control the economy of the world.\n\nI am still amazed with the fact that Shoojit Sircar who made the light hearted Vicky Donor is the same man behind Madras Cafe. This is what movie making is all about where versatility, which is solely missing in Bollywood nowadays, is what many people look for and Shoojit Sircar seems to have made full use of it.The detailing done by him in the movie is top-notch. The conversion of colorful sequences into a black and white one to show the casualties of the civil war is done exceptionally well. He is the real hero behind the movie and certainly has become one of those directors to watch out for in future.\n\nThe casting of the movie is very well balanced as Nargis speaks English because she is just terrible when she speaks Hindi(Rockstar), John Abraham makes you feel for the character Vikram. It's a milestone in his career. The rest supporting cast does a commendable job. Kamaljeet Negi(DOP) has taken this movie to another level as he has shot the film exceptionally well, the civilians getting killed and the war sequences being the high point. Yes there was only one song which came when the end credits started to roll in the movie but still the background score provided by Shantanu Moitra was excellent and really keeps the tension alive which was certainly needed for a movie of this kind.\n\nMadras Cafe is one of those rare movies where thriller doesn't get converted into a comedy and obviously where second half is better than the first.Finally this film ends giving tribute to Shri Rabindranath Tagore by using his poem 'Where the mind is without fear.......' This film certainly means business."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "ahujarajiv",
        "review_rating": "9",
        "review_title": "Gripping & Brilliant take on the assassination of ex-PM Rajiv Gandhi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "niteshsunildeshmukh",
        "review_rating": "10",
        "review_title": "No words For The Movie Best Movie Ever 😍",
        "review_detailed_main": "Best Thing is No songs in that movie that's why people can't distract. Best Movie In Indian Film Industry.... Direction, Photography, Cinematography, Spy, Presentation of the film & Characteres. This is 100% Complete movie. I will give u 10/10 Stars."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "amohit972",
        "review_rating": "8",
        "review_title": "shoojit sircar's excellence",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "priyanuever",
        "review_rating": "1",
        "review_title": "Shoojit Sircar's excellency",
        "review_detailed_main": "This is simply the worst untruth story. The producer of this film is Srilankan President . Srilanka convicted for war crimes , so Many European countries had banned the economy imports from lanka, as a result to make the world fool this project has filmed and a big lump some money has transferred from Srilanlan government to Shoojit Sircar who can sell his own mother to prostitution if he run out of money , Simply he want to get the money I wonder what Indian sensor board did, ha ha ha ....May be Congress force them to show Green signal because they also a guys not worried about the country or people ,The truth is same attitude peoples joined together in this project .The most funniest thing is Srilankan intelligence did the screen play who were the actual back bone for Rajiv's killing.The guys who had been arrested just a labors , but the real criminal is Srilankan government , hope you guys can remember what happened to Rajive when he was in Srilankan Milatrary march past.I am shame as a Indian what this idiot Shoojit Sircar did,"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "amyprashar",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "This movie ia sooooooo Gripping. This one is certainly in the list of top 10 movies Bollywood ever made. It's a Masterpiece. John Abraham is excellent. Movie made in real depth and every tiny details is covered with responsibility. Movie Making at its Best."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "koushikdas508",
        "review_rating": "10",
        "review_title": "Best Political Thriller I have seen so far!!!.... Excellent Creation by Shoojit Sircar!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "phadvijayanand",
        "review_rating": "8",
        "review_title": "One of the best unbiased movie on the island issue.",
        "review_detailed_main": "I watch this movie quite late, actually too late.\n\nThe movie is very well directed, handles a critical issue with trying to be unbiased at best.\n\nActing by John is very much impressive. I still think, it's his one of the best movies. I never liked him before as actor, this movie changes my mind. Sorry for Nargis Fakhri, she just doesn't fit as an actor. Other actors do their jobs just perfectly.\n\nLocations are just best, one of the movie that can be compared with any Hollywood movies. Direction, Cinematography, Sounds everything is far better than other Bollywood movies.\n\nKey thing is it tries to be unbiased on the issue. No side wins, it's a defeat for all, is the message of the movie.\n\nWhy to watch: 1. Some to add on the knowledge of Tamil issue in Sri Lanka & Assassination of Prime Minister (may not be factually correct)\n\n2. Works almost in all the areas as a movie.\n\n3. Thanks for no songs (not just any other Bollywood movie)\n\nWhy not: 1. Nothing as such !"
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "yournishu",
        "review_rating": "10",
        "review_title": "Best movie in Hindi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "devakumar1585",
        "review_rating": "1",
        "review_title": "worst movie with lie's..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "dineshprakash",
        "review_rating": "3",
        "review_title": "It gives the feelings of reading typical boring history books",
        "review_detailed_main": "I appreciate the makers, especially producers, for making this film. Idea and plot were good but because it is based on some real past incidents; screenplay and dialogues had some restrictions. So, screenplay and dialogues fails to make it interesting. One, another minus point is it climax. Very soon, you will be dead sure about the climax, so you will loose the interest. You have to remember lots of supers of place's name and date for understand this film. I am still unable to understand, who was Reed and why he was doing all this? Even that much violence and cruelty were not needed. I couldn't make my position clear that whom I should support? Every thing was shown in the manner that all were the victim of circumstances. Performance wise, nothing to shout about. All actors are quite OK. There is only a music track which comes with end credits, is so so."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "mamlukman",
        "review_rating": "3",
        "review_title": "disappointing--confusing, English subtitles filled with mistakes, Nargis can't act...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rishi_is_here-1",
        "review_rating": "4",
        "review_title": "An important subject matter of Indian history washed out",
        "review_detailed_main": "I never did a review for Hindi movie on IMDb so far. Unfortunately the very first one will be a negative review. This one had a bigger budget than many political thrillers using guns, helicopters but bad story telling, unrealistic make-ups added with terrible acting add to the misery. For the most part of the movie, John Abraham does not have any facial expressions, neither most of the other actors stand up to fill in. The facts about one of the most infamous assassination of Indian Political history are put together nicely though. However they don't gel up together. I would say this was a fair attempt to make a song-less Bollywood thriller. If you want to see a real thriller then Wednesday or Kahani should be your choice."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "vadivelc",
        "review_rating": "1",
        "review_title": "Worst movie against to Srilankan Tamils",
        "review_detailed_main": "The movie clearly taken for making lies to truth. There is no evidence that PM was assassinated by Tamil millitant groups. There are lot of confusions in PM assassination. But without getting answer simply film taken that Tamil millitant group was the reason which is still making problem for Tamils lives. This movie want to make some group of peoples only reason for assassination but not reveals truth. Based on lied story."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "rajroy-06121",
        "review_rating": "5",
        "review_title": "Lacks conviction",
        "review_detailed_main": "The story had subtlety and poise, yet lost the grip thanks to very lack lustre construct. Film neither grew on macro issues nor did it excel in details.\n\nMOST irritating part was the so called \"passionate\" journalist, her character development was so inept, it often felt like an audition of a substandard mohalla thetre.\n\nJohn Abraham looked the part, but never acted the part.\n\nSiddharth Bose's character was neither involved, nor aloof. Prakash Belawaris character was once again very poorly developed despite his great acting skill.\n\nOverall the movie lacked conviction and consequently lost the tension that a movie of this genre requires. Poor show."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "wimbrouwer323",
        "review_rating": "4",
        "review_title": "if the bad ones are just bad and the good ones arejust good, you're watching Bollywood",
        "review_detailed_main": "Familiar with European/US movies, I have tried couple of Bollywood productions lately. This one was by far the best. I do realize that I'm biased in taste etc. but since all the 10/10 scores seem to be based on some bias either, I think I'm allowed to give my opinion. It's been my last Bollywood movie. I cannot stand the simplicity in characters, storyline and moral issues. Not even an attempt to scratch the surface of a story to check whether there is something below it. Not an attempt to create a plot which is not a straight line from A to Z and not an attempt to deepen a character towards a level that someone can have more dimensions than just a patriotic hero, a worried wife, a drunk traitor or whatever stereotypes appear."
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "harshada_shewale",
        "review_rating": "5",
        "review_title": "Too amateurish, trying to copy Hollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2855648",
        "movie_name": "Madras Cafe",
        "movie_rating": "7.6",
        "review_username": "sesht",
        "review_rating": "",
        "review_title": "Overrated Bourne wannabe",
        "review_detailed_main": ""
    }
]