[
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "abrown975",
        "review_rating": "1",
        "review_title": "How did \"The Oogieloves\" go from 1.7 to 4.9? No seriously, how?",
        "review_detailed_main": "Really, people?\n\nI mean, I saw the movie. I saw it just to see how bad it was. Oh, I was not disappointed. And it seemed like at the time everyone else agreed on how bad it was, considering it had a 1.7 rating here on IMDb. About three quarters of a year later, here we are with 4.9? How did this happen?\n\nSo people just decide to up and suddenly praise this movie? Yep, seems likely. I did a little research on a lot of these \"reviewers\", due to outrage and a bit of summer boredom, I'll admit that right there. Here are my findings: Many of them were not only posted within a span of four days or so, but most of them have \"The Oogieloves\" as their only review ever made. Also, those accounts were made exactly one month and three weeks ago from today. What are the odds? Not to mention their usernames follow the format FirstnameLastnameNumber. Is it possible for everyone to just up and decide that? Poorly executed cover. Maybe this is true, and maybe it isn't, but to me it looks as if Kenn Viselman, the \"marketing visionary\", is getting desperate and is asking people to give his \"film\" good publicity. How else do you explain this sudden spike in votes and reviews? And if this really is true, then maybe Kenn was lying through his teeth when he said it \"wasn't about the money\". I mean, seriously. If it's not about the money, why the heck would you credit yourself as \"marketing visionary\" in the trailer? Does anyone see the irony in that? We're not that stupid. (Funny, I can imagine kids all over the world saying that to their parents when they saw the trailer.) Not to mention, if this is Mr. Viselman's way of compensating, then he must not be very good at his job. When you have to literally hire people to like your movie, then quit your occupation. That's like paying people to cheer you on at your baseball game. That's a bust. You've hit rock bottom, Kenn.\n\nAnd this film truly deserves more bad views than it already has. Three over-sized, fully-clothed Teletub- er, I mean Oogieloves- go on a quest to find five magic balloons for their friend Schluufy. After all, it is his birthday (it is a he, right?). Okay, that's not a bad set up. It's simple enough. But we need to keep the parents entertained. Let's spice it up with some C-list celebrity cameos! I watch them sing and dance in this movie, and I bury my head in my hands, wondering \"Why, Prince Wesley, why? Detective Kujan, what are you doing with your life? Doc Brown, if only you had your DeLorean to travel into your future and see this pile of dung!\" It's sad, really. However, even when watching the movie, I think to myself \"So what's so bad about this movie?\"\n\nIt's not how poorly-made it is, how badly-written the songs are, or how embarrassing the cameos are. It's the fact that they think this is what kids need. Do children really need three crudely designed gigantors talking down to them (literally) as if they were stupid? This is WAY past pandering, it's babying. Many people would respond to this, saying \"Oh abrown975, you've gone too far. It's just a kids movie. It doesn't have to be perfect.\" Wrong. Wrong, wrong, wrong. \"Oh come on, it's just a toy. It doesn't have to be perfect.\" \"Lighten up, it's just a baby swing. So what if it's shoddily made?\" \"It's okay, it's just a pacifier. Why would it need to be child-safe?\" Let me put things in perspective if I haven't done that accurately. Is \"Barney's Great Adventure\" a kids movie? Yes, and it was horrible. Is \"The Lion King\" a kids movie? Absolutely, but it's currently rated the #1 animated movie of all time on IMDb. What about \"Mac and Me\"? How great was that? Not at all. What about \"Up\"? Um, nominated for Best Picture at the Oscars, need I remind you.\n\nJust because it's a kids movie doesn't mean quality has to be abandoned. Using \"How can children tell?\" as an excuse is just a blatant cop-out. It's laziness, no matter how \"revolutionary\" the idea is.\n\nTHAT'S why \"The Oogieloves In the Big Balloon Adventure\" is not only a horrible children's movie, but just a movie by itself.\n\nAnd that's exactly why I say you should definitely watch it. WHAT A TWIST! Yes, that's right. Watch this horrible piece of poo. Watch it with your friends. Make fun of it. Have fun. This is the \"Troll 2\" of our generation. \"Mystery Science Theater 3000\" has prepared us for this exact moment.\n\nHuh, maybe this was Kenn Viselman's plan all along to get viewers. Perhaps he really is a successful \"marketing visionary\" after all. Well played, Mr. Viselman.\n\nThis movie still sucks though, no matter how many PR people are telling us otherwise.\n\nUPDATE: 6.3!\n\nUPDATE 2: 7! This is unbelievable."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "dwnetseeker",
        "review_rating": "1",
        "review_title": "Yes. It is as bad as you would think.",
        "review_detailed_main": "Well I just finished this film. Full disclosure, I lost a bet on whether the Pittsburgh Pirates would go above .500 this season and for some crazy reason they actually finished above .500 so I had to watch this film. With that said, I can say that at times I was thoroughly entertained.\n\nLet's start with the acting, it's hard to imagine why some talented actors chose to work in this film but then it's not that hard to imagine when you think about the one day of shooting for the significant pay day. Listen, every actor or actress was just horrible in the film. Tony Braxton was so self centered that it was almost uncomfortable for me to watch and not one time do I remember her stating who she actually was in the film. Was she playing herself? I'm still left wondering about this one.\n\nCloris Leachman was the first respectable actress to appear and she essentially played a crazy person. Her character was obsessed with circles. If you just read that sentence and re read it because it didn't make sense then let me spare you the third re read, yes...she was actually obsessed with a circular shape. When the Oogielove trio enters her home and begins speaking with her they mention nothing about this psychopathic problem. If I entered a situation like that, my initial thought would be something like \"What the hell is wrong with this woman? I gotta get outta here. This woman is crazy and I legitimately need to be worried about my safety.\" Instead Cloris's character induces the trio into a disturbing dance about circles that is sure to leave the audience questioning their sanity.\n\nBy the way, let me interrupt my character and acting assessment to quickly explain to you the plot of this film. The Oogieloves wake up in the morning and it apparently is their pillow's birthday. Once again, you read that correctly, it is their pillow's birthday. Now there is no explanation for why there pillow is alive or whether it can even speak at this point, as a viewer you just have to go with it and as I tried to immerse myself in the Oogielove world, just for a second I was able to believe that the group was really excited about there pillow's birthday.\n\nNow we are introduced at this point to our first supporting character in the film, a window with a woman's face on it. Think Snow White mirror but a beautiful woman instead. I wish I could say that this talking mirror is the most unique and weird character in the film but frankly it probably doesn't even approach the top three. The talking mirror speaks with a southern accent for really no reason whatsoever. I'm not sure where the accent comes from but it is just accepted despite no one else in the film having that accent.\n\nThe window wakes up the Oogieloves and they look into her. She has the magical ability to see anywhere in their mysterious land so she shows them an approaching character. What character you may ask? Well this character is hands down the most unexplained and unbelievable character in the film, it's a talking vacuum cleaner. Why a vacuum cleaner? I repeatedly asked myself that question while watching the movie and came up with no good answer. I'm just going to assume they simply thought of a household object and for some reason believed a vacuum would make for an interesting character. They were wrong.\n\nThe talking vacuum accidentally lets go of some helium balloons for the surprise birthday party for the talking pillow because I think he tripped on the sidewalk. (There is a sentence I never would've believed I would've typed in my life.) So the Oogieloves trio set out to go and find the balloons for the party. Now at this point my spidey senses were tingling. I had a ton of issues with their decision making here. So you're telling me they can't just go buy 5 more balloons? The talking vacuum has an answer for that question. No, these are the last balloons in their world. Hmmmmmm...well played director, well played. Well truthfully, we learn later these are magical balloons that can sing but their song was really stupid and basic and I don't really think the talking pillow enjoyed it but I don't want to give away the ending for you all.\n\nSo the Oogieloves go from place to place and meet the celebrities. The worst acting performance (and believe me this was not an easy decision) had to go to Christopher Lloyd. In about 10 minutes of screen time he had 1 line...ONE. I mean really? He just blankly stared at the camera and then made weird threatening faces towards the Oogieloves when they stared at Jaime Presley the wrong way. And yes, we were to believe that Christopher Lloyd was hooking up with Jaime Presley. The sad fact is that this was not the most unbelievable subplot of the film.\n\nListen there is other characters in this film and other terrible story lines that are worth discussing but I think I've talked enough. It was a disturbing film and really entertaining at times. It was an awful film and I don't believe for a second that kids would actually enjoy it (kids aren't stupid) but from a satirical standpoint I somewhat enjoyed it. View at your own risk.\n\n(As a side point you have to love the people that come on here and are hired to write reviews. They are so blatantly hired to write positive reviews and frankly it is comical.)"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "StevePulaski",
        "review_rating": "1",
        "review_title": "A danger to children's attention spans and their mental health",
        "review_detailed_main": "The Oogieloves in the Big Balloon Adventure is the worst kind of film you could ever show your young children. It's unsubstantial, witless, lacks anything in the way of a lesson or a moral, too kiddish for even the youngest viewer, and largely comprised of things that have been proved unhealthy for your visual and auditory senses. It has been reported by Box Office Mojo as having one of the worst opening weekends for a film opening on more than 2,000 screens, with a dismal $102,564 and a final gross of $1.06 million. Against a $20 million budget (and an extra $40 for marketing), this makes this one of the worst performances for a film ever.\n\nOur story is concerns Goobie, Zoozie, and Toofie, the three Oogieloves that exist in their own world, which is so colorful that is borders along the lines of nauseating. They are celebrating their pillow Schluufy's birthday, and plan to give him five bright gold balloons for his surprise party, which they plan to set up while he is sleeping. When J. Edgar (their vacuum cleaner friend) accidentally frees the balloons outside, they become scattered all over the whole mythical land, leaving the Oogieloves no choice but to get them back. They bounce in and out of colorfully artificial sets, running into people like Rosalie Rosebud, Dottie Rounder, Marvine Milkshake, Bobbly Wobbly, and Lero Sombrero.\n\nThat's all well and good, but would you believe those characters are played by none other than Toni Braxton, Cloris Leachman, Christopher Lloyd, Chazz Palminteri, Jamie Pressly, and Cary Elwes? If one thing is guaranteed to make your jaw drop when watching this film, whether it be the stunningly frothy atmosphere, the corny singalongs, or the inept nature of the characters, it will be the list of talent involved with this project. What could've been going through Chazz Palminteri's mind when he signed up for this film? He was the driving force behind the film adaptation for A Bronx Tale, an amazing coming of age story I'm sure those who attended The Oogieloves won't go on to see. To give him credit, he plays his role with convincing motivation, but witnessing him batting dopey milkshake puns and dancing around the milkshake diner, concocting cockamamie shakes filled with peppermint, chili, pickles, and other ingredients is one of the most dreadful things I've ever seen a talented actor succumb to. And I saw Movie 43, mind you.\n\nLet's talk about the box office performance of this film. Normally, if I catch a film on DVD, when all its financial information is already public and mostly complete, I shy away from explaining it because it usually has nothing to do with the quality of the film at hand. It's not worth mentioning, per say. Yet we need to talk about how The Oogieloves performed theatrically. I already wrote an entire blog when this film was in its theatrical run about how this film's dismal performance was either an indication of the end of August being a generally poor time to release a film (kids are going back to school, adults are generally rushed, and time is fleeting) or a smart public. Both of those, I believe, are big factors, but one of the biggest ones is the lack of an introduction on these characters or \"Oogieloves.\" Think about it. Films like the Rugrats trilogy, The Spongebob Squarepants Movie, and The Wild Thornberry's Movie succeeded largely due to their name and familiarity amongst elementary schoolers and maybe those of selective age groups. The Oogieloves in the Big Balloon Adventure is marketing characters nobody knows to a demographic that still can't completely influence their parents to take them to the cinema to watch the film of their choice. Usually, the parents decide the film and see if the child has any dissenting remarks. The Oogieloves were not introduced to the public prior to this unexpected movie adventure, and with no prior consumer knowledge via an album debut, a TV special, a TV show, books, etc, this was a project doomed from the start. Why was $60 million invested into this? The Oogieloves in the Big Balloon Adventure was marketed as an \"interactive\" movie feature, allowing children to fearlessly speak to the characters in the film, get up and dance on que, or openly talk during the picture. During the course of this eighty-one minute endeavor, ten songs are played, hoping to get children out of their seats and on their feet dancing. What is played are some of the most redundant, idiotic, monotonous songs that showcase nothing but maddening tedium. If there was any prior music released by the Oogieloves prior to this film I'd hate to hear it. The theatrics, too, never stem past costumed-humans dancing robotically back and forth to the music, and in a day and age where computer animation can create an army of one-thousand characters to dance and sing simultaneously, this return to primitive style is lame and relatively bland.\n\nTo bring things to a simple close, The Oogieloves in the Big Balloon Adventure is a harmful, harmful film to show young children. Films like this give kids nothing but a shorter attention span and an energy level that can easily be adopted off of caffeine and fast food. Taking your child to see this film will do nothing to make them smarter, better, and will do nothing to further them in any way shape or form. Taking them to see films like Brave, Cars, Shrek, Toy Story, or Wreck-It Ralph fuel their minds with creative energy, giving them a lust for life, adventure, and fun. This is one of the most appalling films released in some time for all the wrong reasons."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "MsMovie",
        "review_rating": "1",
        "review_title": "Terrible movie with some bogus reviews on IMDb!!!!",
        "review_detailed_main": "***UPDATE - Another bogus review added by someone who JUSt registered and NEVER reviewed anything before, and still it's on 1.9!\n\n***UPDATE*** Worst movie opening of ALL time - the American public speaks!\n\nFirstly, I have a pre schooler and I watch a lot of kids movies and TV. Dora can be a little annoying at times to me, but I can see it's educational value and that it has a plot, a point, some thought went into the episodes.\n\nThe Oogieloves had a bad plot, bad writing, bad songs, bad acting and was quite frankly and insult to your average pre schooler.\n\nOne of the reviews here said it was for 8 years and under, and I say to that NO WAY IN HECK! You will not find a kid above 5 wanting to sit through this garbage.\n\nIt makes the lack lustre The Lorax (of which most would say the book was far superior), seem like it should have garnered numerous Oscars.\n\nIf I was a writer on this project I would have told them they didn't have to put my name in the credits, it's THAT awful.\n\nNOW, to the bogus reviews - there are 5 here as of this moment - 1 is a good review by someone who has written a lot of reviews, so I can respect that they found something appealing in this pile of dross that I obviously didn't see. 2 are awful reviews like mine, written by people, like me, who have written other reviews.\n\nTwo of the reviews are bogus in my opinion, probably written by someone in connection to the movie, since neither of these people has EVER written a review on ANYTHING before. Does that scream fake review to you? Even with the bogus reviews this movie is only on a 2.2 so far, that should tell you it's just plain bad.\n\nDon't even rent it from a Redbox, it's not even worth that much! Parents everywhere hear me, you're going to be happy in a couple of weeks because Finding Nemo is coming back to theaters, save your money and take the little guys to that - they haven't seen it on the big screen and it's even going to be 3D too, now THAT is a movie worth your movie ticket bucks.\n\nI would have given this a zero with no qualms at all, except that there is no option for a zero out of ten!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "misspjw",
        "review_rating": "1",
        "review_title": "Horrible!",
        "review_detailed_main": "This had to be the worst kids' movie I have ever seen in my life; my four year old and I we were the only two in the theater watching it today; she must have asked me 10 times if the movie was over and if it was time to go. The voices didn't match up to the film and the whole thing was a big old' mess. The songs were silly and not in a good, silly for kids way; just silly and meaningless. We missed the first few minutes, which I usually hate, but I think that save us a few more minutes of misery. Perhaps the glow stick had something to do with the beginning that we missed, but she kept asking me what it was for. I like the idea of kids being able to interact, and maybe if there had been someone else in the theater, she would have been motivated to get up, but it just didn't work."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "Rebel_With_A_Cause_94",
        "review_rating": "1",
        "review_title": "Everything That's Wrong With Children's Entertainment In One Awful Movie!",
        "review_detailed_main": "The Oogieloves In The Big Ballon Adventure is not only one of the worst movies i've ever seen, it's the worst children's movie i've ever seen! It's everything that's wrong with children's shows wrapped up into one movie. Having left the theater, i'm still incredibly shocked that a film this terrible got a theatrical release. First off, this is some of the laziest writing i've ever heard for a kids film. Just look at the characters names! Goobie, Zoozie, and Toofie! And if you think that's bad enough, just wait until you hear some of the supporting cast characters names. Rosalie Rosebud, Marvin Milkshake, and the worst of all is Carey Elwes character's name Bobby Wobbly. The saddest of all is Christopher Lloyds role which is just embarrassing. You can tell for the most part though that none of the supporting cast wanted to be there because they aren't even trying at all. The plot of the film is as simple as it gets. The Oogieloves have the collect the 5 magical balloons they've lost and get them back in time for this big party they are about to have. You can pretty much figure out the whole movie from just that one sentence. What ensues is some of the worst jokes i've ever heard in a film and a bunch of lame dance/musical numbers. Now the Oogieloves is being marketed as a \"revolutionary interactive movie-going experience\". However, there is nothing revolutionary or original about it. If you've seen Dora The Exploreor or anything show similar of that, then you've seen everything that Oogieloves has to offer. There is nothing new here to see, except the material being taken to a new low. The writing is some of the worst i've ever heard for a kids film with all of the jokes involving some sort of gross out gag or flatulence jokes. The musical numbers are also very bland and the songs are not catchy at all. However, I can't really say the film bored me because it just kept irritating me and making me more and more angry by how awful it was. The fact that this is what people are accepting for children's entertainment is shocking and is exactly why all kids entertainment these days sucks! Oh, and don't buy into the \"Academy Award Nominated Director\" crap either, Matthew Diamond was nominated for Best Documentary for a film that nobody saw. I really can't think of anything else to say about this film besides how awful it is. Please Parents, do not take your kids to see this film!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "helenacaju",
        "review_rating": "1",
        "review_title": "EXTREMELY overrated.",
        "review_detailed_main": "Awful, pointless, unlikable, and unfunny. One: the costumes are just awful. They're disturbing and they can give you nightmares. Especially the 3 creatures (The Oogieloves AKA Goobie, Zoozie and Toofie). Two: The actors. CHRISTOPHER LLOYD, CARY ELVES, CLORIS LEACHMAN....These famous actors play unlikable characters. Congratulations, the career of these actors have a new low. =_= Three: The. Horrible. PLOT! They expanded finding 5 balloons in 83 minutes? It's repetitive! With lots of SLOW POINTS. Also, there are horrible puns and jokes. Like when Toofie's pants fall down...IT'S NOT FUNNY. Four: The songs are absolutely horrible. They will make you want to rip your ears off. The worst song is the awful theme song. I can't believe this piece of trash has many positive reviews. Five: The fact that this movie got theatrical release when everything screamed \"Direct to DVD\". I'm not forcing anyone to avoid this, but who doesn't like very annoying kid's movies shouldn't watch this."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "trfesok",
        "review_rating": "1",
        "review_title": "Beyond belief!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Absolutely horrendous",
        "review_detailed_main": "If it weren't for the talented actors and the notorious positive reviews and ratings spamming, I wouldn't have known that The Oogieloves in the Big Balloon Adventure existed. After seeing it to see if it was as bad as all that, a big part of me wishes it stayed like that. The Oogieloves in the Big Balloon Adventure is really as horrendous as everyone says. The colours are bright, but not in a good way, the whole movie has a garish feel that only accentuates the movie's overall tackiness. The costumes are so creepy that they induce nightmares, Barney and the Teletubbies are tame in comparison, while the songs are some of the worst I've heard, the lyrics are incredibly childish and the tunes will leave you cringing. That they're badly sung doesn't help though. The Oogieloves in the Big Balloon Adventure isn't fun, educational or endearing in the slightest. The writing is as childish as the songs, with the humour and gags being enough to insult a 5 year old and traumatise children younger than that. They are not funny at all, and can be seen as inappropriate. Education value is low on the radar, people will almost certainly be saying \"why am I being being \"taught\" something I already know?\" and they won't appreciate that it's done in a way that talks down to them rather than engage. The story is full of repetition and goes nowhere a lot of the time, there are stretches where there is a strong temptation to nod off. 5 year olds won't even need to see this movie to do and learn the stuff that is shown in the movie, so that makes The Oogieloves in the Big Balloon Adventure pointless as well as repetitive and dull. Don't expect Christopher Lloyd, Cloris Leachman, Cary Elwes and Chazz Palminteri to make The Oogieloves in the Big Balloon Adventure watchable. They are saddled with characters that are impossible to like or engage with, dialogue that shows even them looking embarrassed and they are poorly utilised, they try but just can't do anything with what they're given. It is a waste of real talent, which is one of the worst things a film can commit in my opinion. And the less said about the truly obnoxious titular characters the better. In short, a horrendous movie, which along with Foodfight! is one of the absolute worst movies seen by me in a fair while. It fares terribly as a family movie, and is even worse for its main target audience too. 0/10 Bethany Cox"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "rosshenderson-93326",
        "review_rating": "10",
        "review_title": "This film is an artistic masterpiece!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "jdennist",
        "review_rating": "1",
        "review_title": "The Worst Film of 2012",
        "review_detailed_main": "If I were 3 years old and had this garbage foisted on me...I'd consider putting myself up for adoption.\n\nIf I were 3 years old and had this garbage foisted on me...I'd fling fecal matter at the screen.\n\nIf I were 3 years old and had this garbage foisted on me...I'd throw a tantrum just to get taken out of the theater.\n\nIf I were 3 years old and had this garbage foisted on me...I'd never want to see another movie again.\n\nThis movie was not good.\n\nDon't take your kids to see this garbage. There are TV shows far superior to this. There are classic movies far superior to this. Last year's Winnie The Pooh is perfect for kids. Show them that.\n\nNot this sludge."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "peeweeh9",
        "review_rating": "1",
        "review_title": "The worst movie I have ever seen in my life.",
        "review_detailed_main": "One of the worst movies in the world. Don't be fooled by the bots who are freaking PRAISING this movie. The movie is god awful. In fact it's so bad that I would give it 0 stars, but IMDb does not have an option to give it 0 stars. \"The Oogieloves in the BIG Balloon Adventure\" has to be the WORST movie ever right next to the Garbage Pail Kids movie. Don't waste your money on this miserable pile of excrement. It is absolutely horrible. Also, if you really want to have your eyes and ears bleed, watch the movie at your own risk. And, would you believe that this \"movie\" is at a 7.4?! Want to know why? Apparent some troll decided to get a bot that spams this movie with surprisingly positive reviews, thus, bringing the rating up. This movie is a good reason why IMDb needs bot protection."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "fredrutz",
        "review_rating": "1",
        "review_title": "Beyond bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Not to be seen by anyone older than 3.",
        "review_detailed_main": "I do not understand the marketing decision to create the Oogieloves. This sort of thing clearly would interest very young children--with its bright colors, catchy music and deliriously happy characters. However, I cannot honestly see a child older than about 3 enjoying this in the least. So, it appears as if the target audience is 12 months to perhaps 36--a very, very narrow window indeed. So narrow that many parents wouldn't take their kids because who wants a film that ONLY kids this age would like? You couldn't bring the older sibs to the movie, as they'd be suicidal or would be bouncing off the walls throughout the movie. And, if your older child DOES like this, I question their sanity and maturity! As for everyone NOT in the target audience, you'll probably find the Oogieloves both annoying and incredibly creepy. Their faces are only barely animated--with their dead-like expressions and facial movements. And the music is clearly the sort of simplistic stuff that would annoy as well. The bottom line is that I can see NOTHING about this film that wouldn't turn off the viewer unless they are very, very young.\n\nI am not giving a numerical score to this one. I don't have a tiny child to ask what they think and it's not fair to rate a film for tiny kids when I am an adult. But I am very annoyed with IMDb because they don't do a very good job of policing the reviews or numerical ratings. \"The Oogieloves in the Big Balloon Adventure\" HAD a score of about 2.0 for several months and some group apparently bombed the site--flooding the film with 10s (why, I have no idea)--hence it's very respectable score of 7.5. Additionally, there are many positive reviews that clearly must have been put there by the filmmakers. You can tell since the reviewers have not reviewed any other films and their 'reviews' are made up of single-line blurbs--as if they were lifted from a press release! Unfortunately, I've seen this same sort of thing happen with a few other films--such as the reviews on \"Just Another Romantic Wrestling Comedy\". Someone is going to need to start policing these things or of what value would IMDb be if this get out of hand?!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "jml470",
        "review_rating": "1",
        "review_title": "Terrible movie, ignore the rating",
        "review_detailed_main": "Normally, I don't write reviews for the movies I rate just because I don't have the time, but for this I'll make an exception since I found out about either a person or a bot actually going through and raising up the rating for this piece of dreck.\n\nNow, I know I'm not the target audience being an adult, but you can tell the difference between a good kids movie and a bad kids movie. A good kids movie won't talk down to its audience and treat them like an idiot, just because they're kids, it doesn't mean they're stupid. A bad kids movie treats them like an idiot because they're a kid. Oogieloves decidedly falls into the latter category.\n\nSo, please, parents, if you're actually looking for a movie for your kids that's live action and not animated, DO NOT rent/buy this movie. For the love of god, there's like 10 Muppet movies out there that's better than this, including Muppets in Space. If there's no Muppet movies, even Space Jam is better than this. If you're really desperate, even the Scooby Doo live action movies are better than this! And if you absolutely can't find anything besides Oogieloves, give them a book or make them watch a blank screen, both provide better mental stimulation than this!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "WhosDat-62-596620",
        "review_rating": "1",
        "review_title": "All those 10/10s must be by spam bots...",
        "review_detailed_main": "I can tell all the 10/10s were actually bogus ratings because everybody HATES The Oogieloves. They're annoying creatures who do such stupid crap. How can this get a 7.6/10 when The Adventures of Sharkboy and Lavagirl already has a THREE point four out of 10?! I bet the 11,764 people who gave it a 10/10 were probably spam bots or bogus ratings because a fan of them was probably mad about it getting a 1.7/10. I bet those 1/10s on The Adventures of Sharkboy and Lavagirl were also made by spam bots. I wish The Oogieloves in the Big Balloon Adventure can have a 3.4/10 while The Adventures of Sharkboy and Lavagirl can have a 7.6/10, or maybe higher!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "tomjackson40",
        "review_rating": "1",
        "review_title": "Why is this even a movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "Flowertyra",
        "review_rating": "2",
        "review_title": "And for all of you who thought this was actually GOOD....",
        "review_detailed_main": "I reviewed this film for my Youtube channel, and I considered it absolute crap. The characters have little personalities, EVERY DAMN THING is brought down to the lowest level (even insulting the intelligence of \"challenged\" children), and the songs made me want to jump off a bridge and make this movie burn in a hole in the ground.\n\nEVERYTHING in this movie screams\"Direct-to-DVD\",and even though this is only 87 minutes, it feels like it's three times as long because of all of the stupid filler.\n\nHowever,I think this would've been fine as a TV special, just with most of the songs taken away, have the Oogieloves understand the concept of a LADDER, make it so the movie talks AT the kids' level instead of talking DOWN to them, and have the kids ACTUALLY LEARN SOMETHING BECAUSE OF IT. In this film, all I learned is what would happen if someone got really high while watching \"Teletubbies\" and thought up of a rip-off of it."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "The_Film_Cricket",
        "review_rating": "",
        "review_title": "Who was this made for?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "antonypigram",
        "review_rating": "10",
        "review_title": "Fantastic",
        "review_detailed_main": "I came after the glowing review from Double Toasted and Spill who totally embraced it - while they also acknowledge you do need to be inebriated to enjoy it.\n\nWhile it would help to get some brownies.. of the pot variety.. it's still a laugh and can see this reaching The Room status within 20 years. The cow is a particular highlight & generally people need to not take it too seriously. So many iconic characters & career highlights from the actors. Would I rather watch Chaz Palmonteri in The Usual Suspects or Oogieloves again? I'm not sure. Both great in their own way.\n\nThe song's are also hilarious."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "allexand",
        "review_rating": "1",
        "review_title": "Do not believe the sock puppets. This is a terrible movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "DatCrazyRater15",
        "review_rating": "1",
        "review_title": "If you wanna know who made the bogus reviews, I know who caused this mess",
        "review_detailed_main": "This is NOT an actual review for The Oogieloves in The Big Balloon Adventure, but I'll tell you how I know who really made those bogus reviews.\n\nI filtered it as chronological when reading all the reviews, and I when I looked at pages 2 - 6 and I saw 34 accounts give this movie a good rating between June and September 2013. I also checked the last page and found 2 more bogus ratings around the time it was first released. But because the mess happened in June 2013, I think I know who created the bogus reviews. It was really Peter Simon, I suggest you filter it as \"Chronological\" and look through pages 2 - 6. When you go to page 6, you'll see his username under batnerdavid, meaning that Peter Simon was the FIRST user to write a bogus review when this whole mess first happened (The day was June 14, 2013, the other 2 in 2012 and the one earlier in the year don't count). Yep, so we finally know who was responsible for this mess and it's all thanks to me for telling you guys who wanted to know. Your welcome if you find this useful. Case closed."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "david-tessler",
        "review_rating": "1",
        "review_title": "Horrible, truly horrible - 98% of positive reviews are hoaxes",
        "review_detailed_main": "Absolute garbage! We saw this opening weekend with our then 2.5 year old. Thought it would be a fun first-time movie experience for our child. It's the worst trash for kids I've ever seen. We see plenty of kids movies and TV and this is atrocious. 98% of the good reviews here on IMDb are bogus - just check them out and they all are exactly 7 months old and none of the reviewers have reviewed anything else before. Full disclosure - this is my first review, but I felt I had to try to counteract the obvious IMDb marketing attempt for DVD sales. I cannot recommend seeing this - for anyone of any age when there are so many quality children's movies and programs."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "Good-One",
        "review_rating": "1",
        "review_title": "How is this even possible?!",
        "review_detailed_main": "How does this title get a 7.6/10 when the United States users gave it an average of TWO out of 10 and the users outside of the United States gave it an average of THREE POINT FOUR out of 10?! I'm pretty sure someone decided to create 11,764 false accounts and give it 10/10s. Or is it just IMDb can't do math? If there are 712 United States users and 1,028 users outside of the United States gave voted, it should say that a total of 1,740 users voted for it, not 13,132 users. If the averages are 2/10 for the United States users and 3.4/10 for the users outside of the United States, then it should average to between a 2.5/10 to a 2.9/10."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "TheSonomaDude",
        "review_rating": "2",
        "review_title": "...I saw it.",
        "review_detailed_main": "That's right guys, I actually found and viewed this...thing. Is it as bad as everyone says? Is it as bad as the trailers make it look? Is it as bad as the 1.7 on IMDb? Is it as bad as the mere $411,050 it grossed on its opening weekend? Well...yes.\n\nThe story involves three....three...\"things\" that have to throw a birthday party for their talking pillow, but they are waiting for their talking vacuum cleaner named J Edgar (I'm serious about that name) to deliver some balloons to make the party complete. However, the vacuum cleaner trips like a dumbass and accidentally releases all of the balloons into the air. Now its up to our three friends to go on a wild and quirky adventure to find the balloons and meet some new pals along the way.\n\nOther than some bright colors and poorly written songs, Oogieloves offers nothing for children at all. The plot is extremely repetitive: the Oogieloves bump into a new character, sing a song, get a balloon, then move on to the next character, rather rinse repeat. The costumes for our protagonists look like they could've been bought in a Halloween store. I mean, the mouths move like an old kung-fu movie dubbed into English, and they all have severe camel toe. And also, why the hell did they name the vacuum cleaner after the head of the CIA? Is it some sort of inside joke or something? Did they think toddlers would really know who J Edgar Hoover is?\n\nThe characters and their actors are very...interesting. Clorice Leachman plays Dottie Rounder, an old lady who is obsessed with circles. She doesn't seem genuine at all, as if she was dragged out of bed and forced to dance. The same can be said with Christopher Lloyd, who doesn't even talk at all (except for the line \"Oooooooogie!\"). Cary Elwes as a bubble-spewing, ADHD cowboy truck driver seems likes he's having fun on the set, but he cant sing worth a damn, unfortunately. Personally, the worst of all is Toni Braxton as the singer who has a cold. Trying to describe her performance here is like trying to describe a dragonfly sexually assaulting an elephant with a coloring book. Simply put, her acting is just pitiful, and the song her character sings is one of the worst songs I've ever heard in a movie; its in my top 5.\n\nThe ONLY character worth sitting through in this movie is Chaz Palminteri as Marvin the Milkshake Guy. Wow, is this character fun! I'm not a kid, but if I were, I would've jumped outta my seat and started dancing along with his song. His acting is over-the-top, which is perfect for this movie and perfect for the role too. Not to mention, Chaz has the best line in the movie: \"Oooh! Mah favorite!\"\n\nOverall, Oogieloves And The Big Balloon Adventure is not a movie I'd take a kid to see. There are no lessons at all for one thing. At least something like Dora The Explorer or Barney teaches lessons like sharing, being kind, speaking Spanins, etc., but this movie teaches kids squat. This is the kind of movie that would lower a kids IQ. I'm not sure what to rate it, but it wont be a high rating because this movie was just flat out awful."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "beth-lowrimore",
        "review_rating": "1",
        "review_title": "Horrible...should not be rated G -- should not have ever been made!",
        "review_detailed_main": "This movie, is not only an insult to a 3 year old. However the provocativeness, and \"sex appeal\" in it is absurd! What 3 year old wants to see someone kiss a fish and say \"holy mackerel\" or the Rose princes sing about scratching her thighs ? I am disgusted that this movie was even made, more or less considered a G rated movie for children. EVEN Barney doesn't have sexual type suggestions! I am very upset and disappointed in Lionsgate for making this, I am very open to most things, however when I watched this, I was embarrassed at some of the scenes. Would not recommend this to anyone. I see now why I tend to stay with Disney and Sprout's programing!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "brookewhite1998",
        "review_rating": "1",
        "review_title": "The rating is wrong and so is this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "johnmcd1234",
        "review_rating": "1",
        "review_title": "This needs to stop",
        "review_detailed_main": "I've been reading the reviews for this movie on this website, and most of them point out that despite it's overwhelming negative reception and many people giving it poor reviews, the rating is shockingly high. But what's fascinating/horrifying is that it's increasing. As of me writing this, it is now at 7.3. No. Just... No. This needs to stop. I do not know what's causing this to happen, but it needs to stop. This site and rotten tomatoes are the main review sites people go to, which is why this needs to stop, because that, my friends, is lying. False advertisement. For normal movies, I won't care, but for a kids movie, very young kids I might add, I feel like I deserve to join in the crusade of taking down this movie. So, if my statement isn't obvious enough, let me simplify it for you parents who are reading this. DO NOT SHOW THIS TO YOUR KID! That's it. Don't show this to your kid, and IMDb is full of crap."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "wipedclean",
        "review_rating": "10",
        "review_title": "This is a true work of art",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "BlossomTheLeader",
        "review_rating": "1",
        "review_title": "Makes Teletubbies look like Kung Fu Panda",
        "review_detailed_main": "I can say this is PURE TOTURE for people who see this. It's a rip off of Teletubbies, Bambifan101, I'm sorry but I hate that show. I swear to god if I watch this on Netflix, I'm going to freak out! This is the worst children's movies you will ever see! And NO, It's far from being just a decent movie. I just saw this it was rated 3 stars on Netflix and The Powerpuff girls had two stars! Don't even bother watching this even if you life depends on it! Seriously it makes Teletubbies and Adventure time look like Kung Fu Panda and The Lion king! Go watch 90s cartoons like Rocko's Modern Life, Powerpuff girls, Dexter's Laboratory, And Gordy Instead. It's horrible that you will regret this garbage! HOW COULD IT GET 7.3!?"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "thesirennymph",
        "review_rating": "2",
        "review_title": "Even worse than I thought",
        "review_detailed_main": "I first heard of this movie after my family visited some friends in Florida and some of us went to watch \"Katy Perry: Part of Me\" and I couldn't even believe the trailer. And naturally I was fascinated that not only is it being considered the worst movie of all time ,but it's one of the lowest grossing opening weekends of all time. Now that I've seen it for myself out of Bile Fascination...I still can't believe what I'm watching. Even for kids movies (at least in terms of ages 1-5) it is saccharine and at a lot of points pretty insane. It doesn't even help that outside from the fact that it's in a movie theater as opposed to being on TV, the concept has been done in every preschool show ever so it's not even that creative. I also feel very sorry for those who had to sit through this film in the theater (I watched this on YouTube) because the Dora-esque semi-interaction will defiantly result in some annoying kids."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "jonathangardynpiano",
        "review_rating": "1",
        "review_title": "The best horror movie!",
        "review_detailed_main": "The Big Balloon \"Adventure\" is a lovely horror movie.\n\nMy eyes were murdered at the sight of these horrifying creatures, and their voices sounded as if a child was trapped in there, trying to escape. Creepy! I can't believe so many children were in that theater, especially when-\n\nWait, this is a children's movie? Oh, alright.\n\nThis is one of the biggest disgraces to children's films I have ever seen. Many people try to claim that, \"It's just for little children, don't take it so seriously\". There is plenty of amazing children's content, such as the recent film, Inside Out. The most painful part of this movie was when Chazz Palminteri played some overly happy waiter (Side note, I wouldn't be so happy playing in the Oogieloves) and kept going, \"OOH!\". I think it's him going through the realization that he's a character in the Oogieloves.\n\nBut in all honesty, if I was offered a paycheck for starring for, say, 20 minutes, I'd be the first in line for that role."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "bonniejoy-978-68763",
        "review_rating": "1",
        "review_title": "The Word \"Painful\" Can't Even Describe This",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "worldsworstwryter",
        "review_rating": "1",
        "review_title": "I can't believe I actually watched this.",
        "review_detailed_main": "Nothing.\n\nThere's no plot. No point. And no enjoyment to be had, either for kids, or for bad movie aficionados!\n\nIt does actually have a slightly creepy undertone. The Oogieloves themselves have very dead, soulless eyes which is quite off-putting. There is a character that is a hoover, who is in love with the sentient window. There's even bestiality, when a fish character flirts with and then kisses a human lady...\n\nThis was the most interesting aspect of the 'movie' since nothing that actually happens is of any importance. The only things that I can remember from the actual film, is a lot of people spinning around, and some wonky camera angles that made me feel a bit dizzy.\n\nI know that entertainment marketed towards kids of this age has to be judged differently from other kinds, but that's not an excuse to make lazy, empty rubbish. Something that's aimed for a young audience can still be good, and high quality within it's own category.\n\nOverall this movie is the definition of boring, and watching it made me tired. It's not really funny to sit through and I'd have to give it a measly 1/10."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "darkghost3400",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": "This movie tries too hard to appeal to kids using a lot of clichés and stereotypes from many children's show, to the point that it seems a parody. This is the greatest flaw of the film and the reason of many of the other problems.\n\nAnother problem is the conflict of the \"Big Balloon Adventure\". It may be OK to maintain a short chapter, but is too weak to maintain a feature film. The problem is made more obvious with all the filler scenes and repetition. Therefore, the storytelling is terrible. The first minutes of the film feel like an eternity, the pattern quickly gets predictable and when you think there is going to be a good scene, there isn't. The film also keeps treating as linear a mission that isn't.\n\nThe characters do not fare any better, being barely more than bland stereotypes. In the case of the \"puppets\", the unappealing designs do not help. The three Oogieloves are too bland to be sympathetic or engaging, the Vacuum is annoying, the fish feels like a load (it is inappropriate for an adventure, the pillow is unlikable, Windy Window feels bland, the animals are useless and only serve as filler, and the human characters feel embarrassing being only utilized for humiliating roles, all them failing to be entertaining. Even if they tried their best on the film, the script ridicules them too much to let them give a decent performance. Talking about the script, it is utterly shallow. It keeps treating children as stupid and has little educational value, which is things that their audience has already learned or could learn easily in other sources. The running gags feel forced and fail to cause any laughter. The Special Effects look mediocre, but tolerable; while the jumps of the Oogieloves feel too fake.\n\nAbout the music, all the songs were cheesy, superficial, generic and lazy, keeping the underrating of children. Many of them were badly sung, maybe with the exception of Rosalie and Lola. And they did more harm than good to the film, due to their irrelevance.\n\nTo finish, I recommend this film as involuntary comedy, rather than a product for kids."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "ristermogers",
        "review_rating": "1",
        "review_title": "Life is Pain",
        "review_detailed_main": "Deep hurting deep hurting deep hurting deep hurting deep hurting deep hurting deep hurting\n\n1/10"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "adamsamsung",
        "review_rating": "1",
        "review_title": "6.0?!",
        "review_detailed_main": "How did this movie go from a 1.6 to a 6.0?! You could say that this is a kids movie so it's for kids and not adults, but this really doesn't change the fact that this movie is in every way: terrible."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "supermincereftked",
        "review_rating": "10",
        "review_title": "Very good movie MUST WATCH!!!!",
        "review_detailed_main": "This movie really is a shining example of what makes a good kids movie. Wished people liked at as much as I did because I shed many tears my sister (who is 3 by the way) did not enjoy this and threw a massive tantrum saying how boring it was however I and my 23 year old brother shed many manly tears I loved goofie toofie and the other one and don't wanna watch it again cause it was quite lol :)"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "writetommylong",
        "review_rating": "1",
        "review_title": "Anyone who gave this more than a 1 has been brainwashed by THE OOGIELOVES!",
        "review_detailed_main": "How the hell did does movie have a 6.4? This movie is just awful and frankly isn't even a movie! Anyone who gave this more than a 1 has been brainwashed by THE OOGIELOVES! And why is the dude from A Bronx Tale in it? For a full review click this linkn > https://www.youtube.com/watch? v=t1j4GRlz-FQ&index=31&list=PLxOKy-G3phBomkGrPJuQwUawQmS_1ysNN"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "christophersvanefalk",
        "review_rating": "1",
        "review_title": "Immoral company buying positive reviews",
        "review_detailed_main": "If you came to IMDb and wondered why this abortion of a movie (the biggest box office bomb in history, by the way) has such a high rating, well, wonder no more.\n\nThe company has either enlisted their own employees, or the services of a review/like-bombing company, to drench this entry in positive reviews. The 10-star reviews are almost unanimously written by newly created accounts with obviously generated names (Mary869 or whatever), which have not reviewed anything else, ever. Yes, I have not done so either - it should say something when people sign up to IMDb just to point something so blatant as this out.\n\nSo, not only has the company completely failed to make anything even approximating a bad movie - they are also unethically trying to manipulate ratings to make it seem like anything else but the complete catastrophe that it is."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "shaymin2348",
        "review_rating": "1",
        "review_title": "Awful, Boring, Bogus.",
        "review_detailed_main": "If you haven't seen this movie yet, don't. It's horrendous. This movie relies heavily on the trope of parents sitting their children in front of anything because it's \"made for\" kids. Don't do this, parents. Look for quality movies and shows. Things like Thomas the Tank Engine and Friends or Disney movies (Note: Ken Viselman did nothing for TTTE&F. He was head marketing.). This movie made me cringe of how bad it is. The first minute or two of the movie had to explain in song and dance what stock images of ducks or insects meant. The plot is so flat. The Oogieloves need to get a balloon for their friend, a pillow. They go across the U.S. I suppose and get a balloon for their friend, a pillow. That's the story. It's bad. Bad, bad, bad. Luckily, no more movies of this series will be made, as they won't know how to advertise, and it was the biggest box office bomb of a movie like this. We're saved! The oogieloves are No more!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "feralladybug",
        "review_rating": "1",
        "review_title": "Oh Cary,why????",
        "review_detailed_main": "If you love The Princess Bride,do NOT see this movie. Your heart will shrink 3 sizes that day. To see the once dashing star of The Princess Bride looking bloated & thoroughly bereft of dignity in this tawdry mess of a movie is to die inside. Dreadful children's movie with undead teletubbie-type suited characters trying to retrieve lost balloons for a pillow's birthday.Yes,it is as inane as it sounds.Bizarre musical numbers that seem to go on forever. I think this may have actually topped The Cat in the Hat as the Worst Kids Movie Ever. To see talented actors like Elwes,Christopher Lloyd & Cloris Leachmann embarrass themselves in this fiasco does not add to your life anyway.Avoid like the plague."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "kingclockwork96",
        "review_rating": "1",
        "review_title": "How in God's name does this have a 7.4?",
        "review_detailed_main": "The fact that something this shitty wound up from the Bottom 100 list to a 7.4 is something I just can't fathom. This movie is beyond stupid as hell. I know this is a children's movie and kids movies are easy targets for awful movie reviews, but honestly, if I were a kid I'd feel insulted from this.\n\nThe movie's story is your basic kids story stuff, some big party is being arranged, all's going well until one of the Oogieloves looses the magic balloons required to make the party all wonderful (I think, honestly the plot is too stupid for me to even follow). So they have to go on a quest to recover these balloons and along the way they encounter many creepy people (Usually played by B, C or D list celebrities) who help them with getting these balloons and who usually sing extremely painful and stupid songs when the Oogiloves get said balloon.\n\nHonestly, this movie is just plain stupid. Again, i know this is a kids movie so the plot is meant to be incoherent, but it's just terrible and generic as all hell. Also, I have to complain about the cast. Why is it that this movie is full of actors who honestly deserve better then this? Seriously, you have a cast consisting of Cary Elwes, Cloris Leachman, Chazz Palminteri, and, good god Christopher Lloyd? How far you've fallen, yet out of all the possibilities and comebacks you could give to these people, you make this trash. So yeah, you have a stupid plot, a cast consisting of actors that are slowly watching what's left of their careers waste away. Combine those two together, and you have this pile of garbage.\n\nTruth be told I can't recommend this at all. If you're a parent looking for something to keep your toddler or preschooler occupied stay as far away from this as possible and maybe rent them some Disney movie or something. I suppose the only group of people I could recommend this to are druggies. In fact, they should have made this a stoner flick and called it \"The adventures of Cary, Christopher, Cloris, Chazz, and Jamie in Drugland\". That and they should have cast Charlie Sheen, Lindsay Lohan, and Lil Wayne as the Oogiloves, but at this rate I'm just fantasizing. So yeah, if you're a pothead or anything along those lines looking to watch something for kids whilst high as balls and Yo Gabba Gabba ain't doing jack for you, I suggest giving this a look, I'm sure watching this movie while high is a 100 times better then watching it while sober."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "Oogie-Bull.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "jacoboneill",
        "review_rating": "1",
        "review_title": "I wanted the balloon to pop. I wanted it to pop so bad.",
        "review_detailed_main": "If they don't have to try, why on earth should I try?\n\nBrief notes:\n\nThe sets look and feel like an enlarged preschool playpen. It didn't look the least bit natural, engaging, or inviting.\n\n\nThe sing-a-long sections really didn't work for me. The film was so robotic that no energy could have possibly been transferred to it's audience.\n\n\n\n\n\n\n\n\nThis movie is bad. This movie is awful. This movie is atrocious. This movie is stupid. This movie is insulting. This movie is damaging to my psyche. This movie is lazy as sin. This movie is a sin. This movie is other synonyms for bad such as the ones I'm about to mention. This movie is defective. This movie is horrendous. This movie is undesirable. This movie is putrid. This movie is decayed? This movie is depraved of anything resembling quality.\n\nChristopher Lloyd is boring in this movie. Frankly, I'm impressed.\n\nThis movie is worthless. This movie is naughty, naughty, naughty. This movie is a disaster. This movie is trash. This movie is garbage. This movie is rubbish. This movie is nothing. This movie is a sniveling piece of annoying dangling snot that when you try to rub it off, it just sticks to the side of your face. This movie is ugly. This movie is condescending. This movie is demeaning. This movie is MADE BY PEOPLE WHO HAVE CREATED SEPARATE ACCOUNTS TO INCREASE THE RATINGS. AT ONE POINT, THIS FILM WAS WELL OVER AN 8 BECAUSE OF IT. THINK ABOUT THAT. This movie is annoying. This movie is tedious. This movie is a little grating after a while, to be frank. This movie is a stinky piggy. This movie is terrifying. This movie is lame. This movie is unpleasant. This movie is repulsive. This movie is revolting. This movie is inspiring.\n\nIf these people can make a feature length, wide release film, then maybe one day I can to.\n\nThis movie is insane. This movie is inane. This movie is incapable to function. This movie is boring. This movie is abhorrent. This movie is disgusting. This movie is despicable. This movie is disposable. This movie is irritating. This movie is ludicrous. This movie is insufferable. This movie is pretentious by the sheer fact that it thinks it is allowed to exist. This movie is a stain. This movie is pathetic. This movie is death. This movie is a scam.\n\nOverall, I wouldn't recommend it. If you are in need of a family film for movie night, here are some suggestions for better options:"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "shnick1985",
        "review_rating": "1",
        "review_title": "Mindless children's entertainment that is surprisingly offensive at times",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "heatherbuen",
        "review_rating": "8",
        "review_title": "This is a kids movie best for ages 8 and under",
        "review_detailed_main": "The other reviewer's comments about this movie being so awful is really the problem with movies at all. One must not forget that this movie is G rated, you will not get a lot of action sequences or drama from a movie that is G rated. The previous review was reviewing the movie the way an adult would view it. For someone like me who has actually taken my kids to see this and to be able to report that my children loved it is enough for parents to take a deep look at what they are allowing their kids to watch. This is for the parents, grandparents, aunts, uncles and others that want to take their really small children to a children's movie without having to worry about shushing them and making them keep still. It's a movie that has simple story lines and characters with a lot of repetitiveness because as my daughter's kindergarten teacher has stated, with 5 years olds, you repeat a lot.This is a movie that teaches kids how to identify a situation, formulate a plan, follow the plan and find a solution.\n\nThere is a message in this movie that not every situation involves some dramatic tragedy, killing or murder to teach a moral lesson in the world. Sometimes situations follow a sequence of events and the colorful characters and the simple language teach a lot to your young children. You will not get this in other children's movies or animated feature films.\n\nI really liked Cloris Leachman's character, my 5 year old remembered her as Grandma Dottie a lot. In fact my 5 year old would wear polka dots and comment that she was just like Grandma Dottie. My children also kept singing the theme song in the car. That was after just seeing the movie once. The 80 minute movie was short and my 2 year old was able to watch the whole thing.\n\nThe best part about it is that the kids can get up and participate in th e movie by singing, dancing and following a long. Don't we want to teach our kids how to follow instructions? This is a great learning tool and I hope more families take their kids to see it. As a mom, I'm taking my whole family again because I don't have to worry about my kid being shushed in the theater.\n\nI did give it an 8 because as an adult, the concepts are so simplistic that yes, you will get bored as an adult. However, if you bring your child you will love interacting with your child and following along with what's going on in the movie. Parents will get more out of it if they participate with their kids, ask their children questions about what they see on screen. If you're just going to sit there, it will be long."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "Jmr123456",
        "review_rating": "2",
        "review_title": "So bad it's horrible",
        "review_detailed_main": "I almost always watch these awful movies online, usually to avoid giving money to these horrible film makers, but sometimes because I can't find a copy in my video store. This movie was both.\n\nThe basic 'plot' starts with a man in a horribly disturbing Oogie- suit loosing balloons because of his creepy pillow friend. Him and the gang then have to find the balloons. That's it, they might meet a celebrity who will sing an awful song here and there, but that's literally the whole plot.\n\nThe editing is all over the place, mainly in this one scene where Christopher Lloyd is dancing to a sloppily edited mix of music, one second he's moving his knees, then he's in Egypt, then doing a tango.\n\nAll the jokes fall flat, it's not Foodfight style humour where they have someone fart on someone's face, or put a random food item in a movie quote, but it's pretty bad. In one scene for example, Chazz Palminteri keeps stopping to say \"OOUGH!\" every five seconds, probably to amuse kids because it sounds funny.\n\nThis movie had a massive ad campaign, but as the trivia page says, they set a world record for the lowest grossing film showing in over 2000 theaters. The creators eventually got so desperate that they got people to right positive reviews on sites like IMDb, probably through the use of money or brain washing techniques- Goofie Toofie, PICK UP YOUR PANTS!!!!\n\nWhat just happened... THE OOGIELOVES IN THE BIG BALLOON ADVENTURE IS THE BEST MOVIE OUT THERE! I SAW IT IN A PACKED THEATRE ON ITS RELEASE DAY, AND EVERYONE WAS APPLAUDING AT THE END. WITH INTERESTING CHARACTERS, RICH PLOT AND HILARIOUS COMEDY THE WHOLE FAMILY CAN ENJOY, THERE IS NO REASON NOT TO BUY THE OOGIELOVES ON BLU-RAY TODAY!!\n\nseriously though, this is one of the worst movies out there."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "maxfkeller",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "lemoneyes99",
        "review_rating": "1",
        "review_title": "Horrible Old movie about oogies and a balloon suddenly jumps from 1.7 to 7?",
        "review_detailed_main": "This movie has no redeeming qualities even worth discussing. I think the metacritic has it at 32/100 yet a number of reviews here gave it a 10/10! A 10? Does this movie look like it's a 10? Does this really seem like it's as good as classic kid's movie Toy Story? There are so many obvious fake reviews that I am offended by it. I just can't let this stand. Screw every person at the production company that participated in faking reviews. 34 of the positive reviews are 8 or higher. The clearly Fake Reviews also have similar wording. Keywords are also used like 'Plot Summary' and 'Character Description' Who the hell titles their reviews that way? And oddly, 2 reviews start with a number like 89. Or 28. Not numbers like a score but numbers as in a list. That is\u0085unusual. The 30 of the 34 reviewers have only 1 review (for Oogieloves), no avatar, no poll responses, no ratings and no lists and no other activity since joining nearly 3 years ago. ALL 30 joined IMDb at the same time, June 2013 except two a few months later. And they all have plain simple user names with random number at the end. I Have encountered only ONE clearly LEGIT positive Review and the 3 remaining positive reviews are pretty clearly fake but if they are they are at least different from the other reviews."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "dmann-62849",
        "review_rating": "1",
        "review_title": "This is Why Crowdsourcing Reviews Doesn't Always Work",
        "review_detailed_main": "Look over the disjunction between the negative and positive reviews of this movie - clearly one side is lying. I leave it up to the intelligent reader to guess which side."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "zsofikam",
        "review_rating": "1",
        "review_title": "Wow, Just Wow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "sarahthebaldifan",
        "review_rating": "2",
        "review_title": "Creepy And Terrible",
        "review_detailed_main": "Bruh, why did they create this! This is Elmo but gone wrong! The characters are annoying, and I had a hard time watching this abomination! Go watch something like Tiny Toon Adventures or Spongebob instead! Not this! Montana Max, Spongebob, and Patrick Star make way better characters than these ugly creatures!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "stardustshowers",
        "review_rating": "1",
        "review_title": "please don't take your kids to see this movie, or even watch this movie.",
        "review_detailed_main": "I remember at the time this movie was going to be shown i was 8 years old when the previews came out? this was a 2012 movie, and just looking at the previews gave me shudders. like i respect shows/movies being made for young kids, but this one is just no. a great concept of getting kids to sing or dance, just not a great storyline. kids, even young kids can understand things better than this, the movie is dumbed down i feel, and imo the previews are just CREEPY. one star, show your kids a better movie, your kids aren't missing anything"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "landonfoster",
        "review_rating": "3",
        "review_title": "Why do I hate this movie?",
        "review_detailed_main": "Because it may serve as a passing diversion for very young viewers, it fails to offer much more than several brightly colored examples of the worst stereotypes of modern children's entertainment, the whole movie runs about an hour too long, the story's too big for the children who would love it the most, and it's a prime contender for most peculiar wide release of 2012. I'm glad I never saw it when it was released. The month of the release date on the poster has a terrible pun. The acting is poor, the writing is poor, the humor is poor, and in other words, just cheap. I hate this movie. Why does it exist? Why does it have a rating of 6.3 out of 10? Why not 3 out of 10? It sucks!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "cpcats-466-894211",
        "review_rating": "8",
        "review_title": "A fun, silly little movie a preschooler would like.",
        "review_detailed_main": "After reading the super-negative reviews, I wanted to put in my two cents. For it's genre, I thought this movie was pretty good. We brought our 2 1/2 year old granddaughter, and she really enjoyed it. It took her a little while to warm up to it, but by the end, she was dancing & clapping along with the show. Is it a great movie? Of course not, but it's not meant to be. It's meant to be fun for the little ones.\n\nIt was funny seeing people like Cloris Leachman and Christopher Lloyd in it....funny and a little sad. Would a 6 or 7 year old like it? Probably not... but great for preschoolers. It would have been even more fun for her if there would have been other people in the theater."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "clearlymachine",
        "review_rating": "1",
        "review_title": "To describe it as \"painful\" would be an understatement",
        "review_detailed_main": "As someone who thoroughly enjoys watching bad and low-rated movies, there are very few films which I'd place in the 'you could not pay me to sit through this again' category. This is one of them. Sincerely, someone who has sat through 'After Last Season' twice."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "thomasjyankee",
        "review_rating": "1",
        "review_title": "Watched for How Did This Get Made",
        "review_detailed_main": "Firstly, what horrendous experience did the \"How Did This Get Made\" crew have in the city of Detroit to choose this film for their live show in Detroit? What did the good people of Detroit do to them to deserve this? Point on the doll where the Motor City hurt you.\n\nThis was a painful experience. I have a 4 year old, and I would never expose him to this absolutely absurd film at any point in his life. That being said, how deep in debt or high on drugs were the few big stars that appeared in this film? Did they act while a gun was pointed at them out of picture? There are real actors in this. Doc Brown, the Dread Pirate Roberts.. these were characters these actors were known for and some how they agreed to do this? Worst film I've ever seen, and my son has watched Amazon shorts that look like a college student put together in a all nighter fueled on energy drinks junk food. An academy award winning production compared this this garbage.\n\nDo not watch this."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "connorpaolillo",
        "review_rating": "4",
        "review_title": "Not the best, but it's not terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "hdoerr-02108",
        "review_rating": "2",
        "review_title": "The Oogieloves in the Big Balloon Adventure disappoints with its weak plot and lackluster characters",
        "review_detailed_main": "I recently watched The Oogieloves in the Big Balloon Adventure, a children's movie that garnered some attention for its innovative interactive format. However, my experience with the film could have been more satisfying. The plot was relatively weak and lacking in coherence. The story meandered aimlessly without a clear direction, and I struggled to stay engaged.\n\nThe characters in the movie could have been more exciting and one-dimensional, failing to leave any lasting impression. I found it hard to care about their journey or goals, making it difficult for me to root for them. Additionally, the humor in the movie could have landed better with me. The jokes felt forced and contrived, often relying on juvenile slapstick or cheap gags that failed to elicit even a chuckle from me.\n\nOverall, The Oogieloves in the Big Balloon Adventure is a lackluster movie that falls short of its promise. While the interactive elements may have been a novel concept, they failed to compensate for the movie's shortcomings. I would only recommend this movie to people looking for a fun and engaging cinematic experience. If I had to rate it, I would give it a 2 out of 10 stars."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "annecbowling",
        "review_rating": "1",
        "review_title": "The worst thing in existence",
        "review_detailed_main": "The film said 233 minutes whyyyyyy and why not say about 4 hours. In all seriousness this thing is probably the worst thing called a \"movie\" I have ever scene, the thing is dated it feels like something from the 1990's not 2012. The window lady is more terrorfying than the Teletubbies sun. If I had a choice between watching this or going to the medieval times I would start researching the time machine before they finish the sentence."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "doctorquacks",
        "review_rating": "1",
        "review_title": "Not suitable for parents, not worth it for Mr. Christopher Lloyd, and boring as hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "blott2319-1",
        "review_rating": "1",
        "review_title": "Don't even watch it for HDTGM ;)",
        "review_detailed_main": "I've been listening to the How Did This Get Made podcast for more than a decade now, and it's always been a dream to go to a live show. Finally, they decided to visit the Midwest on a tour, which included a stop in Detroit. I was quick to get a ticket, but somewhat appalled when I saw the movie they were going to put us through was The Oogieloves in the Big Balloon Adventure. This is a truly painful movie to watch. Even having no kids of my own, I've seen some bad children's TV shows, but this is like the worst of those all stretched out to be feature film length. The entire thing is so slow and tedious, with no educational value whatsoever. It doesn't teach any real life lessons, and at best can get kids to count up to 3. It's almost the opposite, in that it teaches kids they can safely jump from high places holding nothing but a balloon, and it also displays some mild racism.\n\nWhat might be the most shocking about The Oogieloves in the Big Balloon Adventure is the cast of human characters that show up to embarrass themselves. Chazz Palminteri, Christopher Lloyd, and Toni Braxton are just 3 of the faces that are dancing and singing as horribly goofy characters. I will acknowledge that it seems they are giving their all in these performances despite how stupid the characters are writtten. Speaking of that, the writing is what I find most obnoxious about this film. It's one thing for goofy puppet characters like Barney to talk in very simple words so children can understand them, but these creatures say utter nonsense half the time. The songs are somehow worse. I've heard improvised lyrics that are better than this drivel. And if there's one thing I can't imagine parents wanting when they bring their kids to the movie theater, it is for a movie to encourage their kids to get up and start dancing and running around the theater. What can I say other than never watch The Oogieloves in the Big Balloon Adventure? Even if you have little kids there's no value in it, and God help you if they decide they like it and want to watch it again and again."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "kruno5gaming",
        "review_rating": "3",
        "review_title": "a ripoff of \"The Bedbugs\" and \"Teletubbies\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "casablancavic",
        "review_rating": "10",
        "review_title": "This has to be the finest piece of cinema EVER created.'",
        "review_detailed_main": "Forget StarWars or Jaws Or Casablanca Or Back To The Future.\n\nThe OOgieloves is pure genius.\n\nThis tells a story of 3 Oogieloves who must acomplish the goal of obtaining 3 magical and mystical ballons.\n\nThis is symbolism for obtaining the wisdom and knowledge of life.\n\nThis takes us into a spiritual journey where we embrace who we are and our acomplishments.\n\nIt's meaning is a deep rooted social commentary about how far MAN must go and what lies behing our immediate grasp. It's a treasure of witty storytelling and dialogue which only those wise enough will learn the real secrets from this.\n\nIf you've not seen it, I suggest that you not only watch it once in it's entirety, but watch it at least 10 000 times with your friends, family and neighbours and have deep introspective discussions about it.\n\nIt's about life's challenges and how we overcome them. It teaches us inner strength and the beauty and power which lay deep buried inside us.\n\nIt's empowering and energetic.\n\nOne can only walk away in sheer amazement after spending time watching this. Inspiration for the heart, mind, body and soul.\n\nAfter taking this viewing in, I was able to accomplish anything in life. It's simply remarkably amazing and offers so much inight into the world around us and how we percieve it.\n\nIt's touching, tender moments bring tears to the eyes when the Ooogieloves begin dancing and singing.\n\nAfter watching this several times in a row - you will understand how you too can achieve great wealth, knowledge and power.\n\nThe brightest minds and richest people have been sure to be inspired by such wisdom under the guise of the Oogieloves.\n\nThe Big Baloon signifies our future and the quest for beyond our imagination.\n\nIf no other movie in your life has touched you, then the Oogieloves will do just that. It will bring you to tears and you will cheer when it's all over - because you have gained unuttainable wealth which you never had before.\n\nYour life will be changed so dramatically - that the only way top realize it is to watch it again and again.\n\nit's a pognant heartwarming story of triumph and compassion, wonder and understanding for the great mysteries of the universe and everything beyond it.\n\nI believe that this singlehandly is the sole answer as to - WHY ARE WE HERE?\n\nLet it captivate you.\n\nIf you\\ve ever questioned the reason for existence, The Oogieloves will offer you an explanation and fill your mind with so much knowledge that all the great masters of science, theory, mathematics and biology and chemistry will be jealous of everything you have attained from this fine, cleverly crafted, skillfully written screenplay - brought to us withexceptional storytelling, mind blowing animation and computer graphics and production values so well developed, you will be thinking that you have jumped 2000000 years into the future.\n\nAvoid all other reviews where the people state that this is a crap movie and go with this review - because you know that it speaks volumes of truth in a manner where the truth will embelish you in total captivation.\n\nSimply - purely genius film-making at it's finest.\n\nI can never fathom that another movie will ever achieve this caliber of entertainment - while providing us with unfound knowledge from the universe for the next 20 billion light years.\n\nRush to see it NOW."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "jacobcamp330",
        "review_rating": "10",
        "review_title": "Why is everyone going crazy its a kids movie",
        "review_detailed_main": "I am reading all these negative reviews about the film and I don't understand\n\nwhy people are getting so worked up. Oogieloves is a CHILDREN'S film. The way\n\nit encourages the audience to participate is kind of revolutionary, especially in\n\nthis generation where there isn't pop-up video or sing-a-long so much. This is a\n\nfun film for kids: it is colorful, it is creative and it is musical. Best of all, since my\n\nchildren are at least encouraged to move along, I don't feel so badly letting them\n\nwatch this while I take care of some much needed things in the house."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "alyssapridgen91",
        "review_rating": "10",
        "review_title": "Film accomplishes a lot/ teaches snazzy dance moves all within 1.5 hrs!",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a simple, cute film.\n\nIn an hour and a half,\n\nyour family will meet the Oogieloves and their friends, tour Lovelyloveville and learn some snazzy\n\ndance moves/ catchy songs.\n\nAll in all, not too shabby!!!!!! I watched this movie with my whole family.\n\nMy two cute babies also loved it.\n\nWonderful moment. Lovely story. I recommend it. A nice hour and one half of pure amusement."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "bigbossorochi",
        "review_rating": "10",
        "review_title": "Amazing Movie!!!",
        "review_detailed_main": "I was skeptical at first about this movie. I was blown away by the deep spiritual meanings and the existential quandaries found in The Oogieloves in the Big Balloon Adventure. If there is a better movie I have not seen it! The simplistic plot of the movie counterpoints to the inevitability of the struggles of man. The poetic undertones when the titular Oogieloves search for the magical balloons is just a metaphor for finding true love and happiness! Your children may not get all of the enriching symbolism in this movie but that's okay. Children will enjoy this magical journey and Parents will have their hearts touched by the beauty of this movie. 10 out of 10"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "michelatharton24",
        "review_rating": "10",
        "review_title": "Children 7/8 will like that they can participate; but film is best for the under 10 crowd",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventures is a decent children's film with something for everyone. I would recommend it to parents with children in different age groups or grades (which is most of us).\n\nAdults (i.e. parents) will appreciate the great cast, which features Toni Praxton, Christopher Lloyd and the beautiful Jaime Pressly. Very young children will like the brightly colored sets. Children a little bit older will like the characters themselves (each one has a distinct personality) as well as the music. For kids up to 7 or 8, the fact that the film actually lets them participate-i.e.sing and dance and move along with the characters, will be something fun and they will like having the new experience. For these reasons, I think that Oogieloves in the Big Balloon Adventure is a film that the whole family can enjoy (provided all of your kids are less than 10 years old—after that, I find that kids think they are too \"adult\" to see the same \"kids\" movies that their parents adore)."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "miguelreye43",
        "review_rating": "9",
        "review_title": "Character description. Special bc it is interactive. One of the most talked about films of the year.",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a one-of-a-kind film about three oogieloves who dance and sing their way around Lovelyloveville, their home village. The Oogieloves include Toofie, who seems to have a Mohawk which in the logic of kids films makes him the \"bad boy\" and maybe even the heart throb! Zoozie is a redhead who can speak to all different things in the Loveloveville kingdom since she is fluent in so many languages. And Goobie is a science genius in the making, who, with his big, round spectacles will make glasses-wearing kids feel OK.\n\nWhat makes Oogieloves so special is that it is interactive—the audience has to participate in the film, instead of just hiding between a big bucket of popcorn. It also has a great cast, including Grammy-winner Toni Braxton and the wonderful Christopher Lloyd.\n\nOogieloves was one of the most talked about films this past summer, so if the plot, characters, cast and catchy songs aren't enough to make you want to see this film immediately, perhaps seeing it to understand all the hype will inspire you!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "petersimon145",
        "review_rating": "10",
        "review_title": "Oogieloves in the Big Balloon Adventure is a cute film for little kids.",
        "review_detailed_main": "I took my\n\n4 year old nephew who loves going to the movies and we had a great time. The\n\nmovie had cheerful songs, cute costumes and a retro feel (which I personally\n\nloved). This film may not be as \"revolutionary\" as it says it is, but it was nice\n\nactually connecting with my nephew and dancing with him at the movies, instead\n\nof just zoning out with a bucket of popcorn."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "andrespeckert6",
        "review_rating": "10",
        "review_title": "Film is a cool twist on children's film; in generation of WII, what took so long?",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a cool twist on a children's movie, calling for audience participation. Seems very \"now\" and my kids thoroughly enjoyed following the Oogieloves on their adventures.\n\nNo surprise, given that we are in the generation of \"WII\", the only thing I want to know it why it took so long for something like this to come out?\n\nI would recommend this film for parents who are sick of seeing the same old films, either under different names or under the guise of sequels. This is a unique film—love it or hate it, its not your typical Disney fare."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "scottkwiatkoski",
        "review_rating": "10",
        "review_title": "It is a sweet film",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure came out last year and according to Wikipedia was a super huge box office flop. It also has received a lot of bad reviews, really mean ones too! I can't really tell you why people are getting so angry about it\u0085\n\nOogieloves was a sweet film.\n\nMy family borrowed a copy from a friend, and liked it so much we shortly went out to buy a copy of our own. Its fun to dance and sing too,\n\nthough quite frankly I don't dance as much as I should! Still, my kids like it and that's what matters.\n\nAt such a great price too, if your kids ask for it, why not just buy it and be supermommy for a day?"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "princessdacey6",
        "review_rating": "10",
        "review_title": "Film great and surprisingly innovative in generation of WII, Dora the Explorer and touchscreens",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a nice flick to watch on a rainy or super hot day. Pop the DVD in the player, tell your kids you have a surprise for them, tell them you have a surprise or a special movie to show them, and then let the games begin! Even in the generation of Dora the Explorer, WII and touch screens, I can bet your kids will have never seen something like this before! Sit back and see how they react.\n\nMy youngest child didn't initially understand that he was supposed to dance and sing along, so it was cute to watch his big sister explain to him \"the rules\" of the game, if you will. It made me happy to see them playing together so nicely, especially after a day of being cooped up in doors which normally makes any kid a little cranky!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "nancyyoungn77",
        "review_rating": "10",
        "review_title": "I am so happy they got Toni Braxton to do this film!!!!!!!!! She is amazing and looks beautiful, as usual.",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a type of movie in which three oogieloves dance and sing Lovelyloveville. The Oogieloves contain Toofie, who seems to encompass a Mohawk which in the cause of brood movies makes him the \"bad boy\" and possibly smooth the mind thump! Zoozie is a redhead who be able to converse to all unlike equipment in the Loveloveville empire seeing as she is confident in so numerous languages. And Goobie is a discipline mastermind in the creation, who, among his huge, around eyeglasses will make glasses-wearing family believe OK.\n\nWhat makes Oogieloves so extraordinary is to it is interactive—the viewers has to partake in the movie, in its position of immediately defeat among a full-size container of popcorn. It moreover has a vast shine, counting Grammy-winner Toni Braxton and the fantastic Christopher Lloyd.\n\nOogieloves was one of the most talked on the movies this past summer, so if the plan, lettering, transmit and memorable songs aren't sufficient to construct you want to see this film right away, maybe considering it to appreciate each one the hype will motivate you!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "kojolapower",
        "review_rating": "10",
        "review_title": "I had a blast at this movie!",
        "review_detailed_main": "Oogieloves was so much fun, both for me and all the kids that packed the theater. I've never jumped out of my seat so many times in a movie. The kids around me were having the time of their lives, that was very cute to watch. The energy in the theater was great. I loved the characters, especially Ruffy the Fish! I loved how he was always a bit grumpy, but usually ended up saving the day. Those lips are wild! I liked the combination of actors & characters. Jamie Presley was great! I say go see it & get ready to have some serious fun! Clearly some people have some strongly negative opinions about this movie....but it's meant for kids & families. All the kids that I saw were thoroughly enjoying themselves."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "keenandoesstuff",
        "review_rating": "10",
        "review_title": "I'm loving it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "raqueltorres940",
        "review_rating": "9",
        "review_title": "Mix of a Broadway musical, the Teletubbies and a WII dancing game which combine to create a film little children will want to see again and again.",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a mix of a Broadway musical, the teletubies and a WII dancing game, combining the cheerful songs of a musical, the aesthetic of the Teletubbies (albeit brighter) and the interactive qualities of WII.Oogieloves combines all these elements to make a happy children's film that your kids will want to see again and again.\n\nOogieloves in the Big Balloon Adventure is one of the most controversial children's films that has come out in the last few years. Whatever other people may say, for me and my family, Oogieloves in the Big Balloon Adventure is a simple film, short and sweet and perfect for young kids, think pre-school or kindergarten.\n\nMy kids and their friends seem to enjoy it thoroughly, and beg to watch it when they are on a play date. The film on DVD is also very reasonably priced, so it is a great bargain and a special treat to get your children."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "mitchmalasky08",
        "review_rating": "10",
        "review_title": "Oogieloves like when teletubies first came out\u0085Film is different from others with unique characters",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a great escape from the humdrum of everyday life! OK, I guess that could be said about much of children's entertainment, but Oogieloves felt exciting and different, kind of the way I think other people must have felt when telitubs first came out\u0085 Oogieloves look different from a lot of other characters out there, and the sets are very creative and interactive looking—like things are always changing, so you have to keep an eye out for any little changes (like the mirror's drapes!) My kids and I loved watching for every little change, and this is what keeps the film exciting after repeated viewings—that, and the fact that the songs just get better with age!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "chablismyers664",
        "review_rating": "10",
        "review_title": "Child saw film at friend's house and mom bought it. Better for children to watch it with at least another person bc film is social/ interactive",
        "review_detailed_main": "My child saw this Oogieloves in the Big Balloon Adventure at a friend's house and loved it.\n\nHe came home singing the songs, and I soon went out and bought it for him to.\n\nHe loves watching it with friends.\n\nOne suggestion: my son is the only young child in the family,\n\nso I would suggest it for families with more than one little one just because the film is interactive/ social, so it is much more fun to do with others. Oogieloves in the Big Balloon Adventure\n\nis the type of film I wish they had had out when I was a little kid. At least I get to live it vicariously as a mom!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "goldiewest230",
        "review_rating": "10",
        "review_title": "Movies that feature science are a great way to get kids into science! Oogieloves will be great to show the kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "barbarafelixjosephine",
        "review_rating": "9",
        "review_title": "Film is a cute mix of the teletubies, Dora the Explorer and karaoke",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a nice film to take young kids to see.\n\nA cute mix of the teletubies, Dora the Explorer and karaoke\u0085 My family would see it again today!\n\nI suggest Oogieloves in the Big Balloon Adventure for families with children of different age groups, who want an interactive film experience instead of the same old film you have seen (and paid for) dozens of times.\n\nGreat to see a movie where\n\nkids can be kids and make some noise!!!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "jamesrathz73",
        "review_rating": "9",
        "review_title": "Oogieloves is a nice change from most children's movies.",
        "review_detailed_main": "I would suggest Oogieloves in the Big Balloon Adventure for anyone who is tired of seeing another Disney/ pixar film\u0085like me and my family!!! Seriously, I don't know how much more I could have taken of the same old stuff.OOgieloves in the Big Balloon Adventure is a great adventure. To create a awesome surprise party for friend's birthday, the Ooogieloves (GOOBIE, ZOOBIE and TOOFIE) have to trek around town to find the magical balloons that were lost by the super clumsy J. Edgar (admittedly, one of the film's most annoying characters). While going on their search for these balloons, they meet all these cool characters, Rosalie Rosebud, a talking goldfish, a cool man who works in a cow diner\u0085. The list goes on and on!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "sylviastallone",
        "review_rating": "9",
        "review_title": "awesome kids movie but not very exciting for parents",
        "review_detailed_main": "A lot of comments about this film talk about children's feelings about\n\nOogieloves in the Big Balloon Adventure, and I would like to talk about me and\n\nmy husband's reactions.\n\nFirst of all, yes, this is a children's film. I have seen a lot of films with my kids—\n\nI have always loved going to the movies—and this is a CHILDREN'S film. I have\n\nseen other films which have received better reviews and have been described\n\nas \"witty\" or reaching an adult audience, but I never would have seen them\n\nunless my kids had wanted to go. People, children's films are first and foremost\n\ndesigned for CHILDREN. No sense in getting all upset about a children's film that\n\ndoesn't appeal to your adult sensibilities, since that isn't the point.\n\nThat said, we bought the movie to watch at home with our kids. We saw it at\n\nwalmart and our son was immediately drawn to the DVD's bright packaging. The\n\nprice was nice, so we figured, why not?\n\nMy kids liked it, but for me and my husband it was great seeing some of our\n\nfavorite stars (new and old alike) in different roles. Obviously, Toni Braxton\n\nwas there and looked beautiful. Jaime Pressly is also looking good. And seeing\n\nChristopher Lloyd (\"doc\" in Back to the Future) was a blast from the past!\n\nAll in all, Oogieloves in the Great Balloon adventure is a fun, summer flick. Don't\n\nread too much into it, just sit back and enjoy!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "nicolefafragola",
        "review_rating": "10",
        "review_title": "Good movie for children",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure tells the story of a group of colorful\n\nfriends who are making a surprise party for another friend. The plot thickens\n\nwhen the special party balloons are accidentally lost, so the friends have to go\n\nexploring and making their way through Lovely Loveville to find them.\n\nThis film made me remember what it was like to be a child and watch TV shows\n\nor movies with little adventures. Children have a logic all their own, and live in a\n\nmagical world where something like this could really happen to them if only they\n\nlived in Lovely Loveville. Actually, on a personal note, when I was little I always\n\nwanted a surprise party myself, and helped plan many for friends (I did this\n\nwhen was older than the suggested 8 years old for this film's audience) but no\n\none ever made me one. So who knows? Maybe my kids will throw me one after\n\nseeing this film (hint, hint!)"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "katiechapman9",
        "review_rating": "10",
        "review_title": "Plot description. Kids sang and danced and moved. Great to have a movie where kids can make some noise.",
        "review_detailed_main": "I took my family to see this movie last year in theaters and wasn't expecting a lot from it, I just wanted a change from the typical talking animal film we always happen to see. Some friends get together to plan another friend's birthday party: what could go wrong? Well a lot, in the Oggieloves in the Big Balloon Adventure! The Oogieloves: Goobie, Zoobie and TOofie, loose these special magical balloons courtesy of their well-meaning but super clumsy friend J. Edgar\u0085 and off go the Oogieloves to find the balloons in a race to beat the clock before their friend's birthday party, which also happens to be a surprise!!!!!! My kids laughed in this film, and sang with the songs (which they do anyway with most films, but at least with this one, they were supposed to!) and moved around to the music and cheered for the Ooogieloves"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "rannynm",
        "review_rating": "9",
        "review_title": "Charmingly perfect for preschoolers",
        "review_detailed_main": "The Oogieloves in the Big Balloon Adventure is an adventure in its own right. Producer Kenn Viselman wanted to create for young children a movie experience in line with their natural energies to move and dance and sing aloud, rather than forcing them to sit like little adults in the theater, and KIDS FIRST! youth film critics love it. Our youth critic, Morgan B, calls the concept \"awesome,\" and says, \"No one tells you to please sit down and be quiet. You get to have fun.\" Cheyenne N says, \"I can't wait to watch it again with friends, so we can do the Oogie cheers and dances together.\" In addition to reviewing the film the two sat down for one-on-one interview with some of the stars, at the film's recent red carpet event.\n\nViselman, an innovative force in children's TV programming, shares more about the movie on KIDS FIRST! weekly radio show Coming Attractions, which streams on VoiceAmerica Kids.\n\nThe Oogieloves in the Big Balloon Adventure Reviewed by Morgan Bertsch (See her full review on video.)Kenn Viselman, who helped make \"Thomas the Tank Engine\" and \"Teletubbies\" household names, has come up with a new movie concept for kids, with Matthew Diamond as the director. Scott Stabile is the writer. The concept is awesome.\n\nThis is a movie like no other I have ever seen. You actually get to dance, sing and cheer in the movie theater. No one tells you to please sit down and be quiet. You get to have fun. The butterflies tell you when it is time to get up and move around and the turtles tell you when it is time to slow down, take a seat and enjoy the show. Don't forget to clap for all the little dancers when they are done. The movie is interactive, and you feel like you are part of the movie because you get to participate in the actual show. There is no violence or villains, just a fun, family-friendly movie.\n\nChazz Palminteri as Marvin Milkshake and Guistina Chirco as Marna make you rethink what you want in your milkshake the next time you order one.\n\nThe Oogieloves Goobie, Zoozie and Toofie live in Lovelyloveville, which is a colorful, happy place. When their five balloons fly away, they go on an adventure to retrieve them. Windy Window provides clues to J. Edger (Hoover) to help them on their hunt for the balloons to give to their friend Schluufy for the big surprise birthday party. They must use problem-solving skills at each adventure to solve the many puzzles of how to capture the balloons. The clock is ticking — will they make it in time for the big party?\n\nAlong the way they meet a great cast of characters: The fabulous Cloris Leachman plays Dotty Rounder. Jaime Pressly is Lola Sombrero. Christopher Lloyd is the bongo-playing Lero Sombrero. Cary Elwes with his crazy bird is Bobby Wobbly. Toni Braxton is the singer Rosalie Rosebud, and there are many more people you will get to know and love.\n\nThe songs are original, creative and you will have the lyrics stuck in your head with a smile on your face.The puppets look real and are very funny. Wait till you see what the raccoons can do.\n\nIt is appropriate for all your youngsters. Your children can go see a movie and act like a kid. I would recommend this movie for ages 3 and up.\n\nI give it five ***** twinkling stars.\n\nFor more youth reviews, go to kidsfirst dot org."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "katiewalsh63",
        "review_rating": "10",
        "review_title": "Family loved film when it came out, wanted to see it again in theaters but decided to wait for economic reasons.",
        "review_detailed_main": "I saw Oogieloves in the Big Balloon Adventure last year with my children. They immediately fell in love with it and couldn't stop dancing the dances or singing the songs or staying how they wanted to see it again!!! We almost did go back even, that is how much we loved it, but in this economy we decided to wait till it came out on DVD to save some money.\n\nWe are now in proud ownership of the movie and I would say that my kids watch the film somewhere between once and three times a week. Children in general can watch the same movie or read the same book over and over again —its not about finding out what happens necessarily, but experiencing their favorite parts. This movie also gets better each time you see it because you already know the dance moves and it is like singing along with your favorite song—one you know the lyrics (or at least the chorus) you can really let loose."
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "carnafaculbrasil",
        "review_rating": "10",
        "review_title": "Great summer film—good characters and costumes",
        "review_detailed_main": "Oogieloves in the\n\nBig Balloon Adventures is a\n\ngreat summer film.\n\nThe songs are happy and help drive the plot forward, and also show off some of its cast's great singing abilities.\n\nThe sets are cool, clearly thought out to be visually\n\ninteresting with the character's costumes.\n\nAnd the characters themselves are also cool, and each have their own thing going on behind the stage, such as J. Edgar's crush on Windy. Ah, love!"
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "jonalynnkaias",
        "review_rating": "9",
        "review_title": "Plot description. Lovelyloveville is colorful and movie has catchy songs. Fun summer film for rainy day",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1520498",
        "movie_name": "The Oogieloves in the Big Balloon Adventure",
        "movie_rating": "1.7",
        "review_username": "rahamelindo",
        "review_rating": "8",
        "review_title": "All these elements combine together to create magical film with tons of originality/ massive appeal",
        "review_detailed_main": "Oogieloves in the Big Balloon Adventure is a must-see movie. I have taken my children to basically every children's film, and I can tell you that Oogieloves is special. The film's plot is simple: when magical balloons— the last 5 in Lovelyloveville, the Oogieloves' very special hometown—are lost by the Oogieloves' caretaker/ friend, the Oogieloves themselves— Zoozie, Toofie and Goobie—go on a quest to find the balloons and meet some cool characters like Lola Sombrero, Marvin Milkshake and Rosalie Rosebud (none other than Grammy Award winner Toni Braxton). The songs and dances are also simple but cheerful, as are the sets. The film's magic somehow lies in all of these elements coming together, plus the fact that the audience can/should/ is expected to interact to make a special film with massive appeal and tons of originality."
    }
]