[
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Calicodreamin",
        "review_rating": "4",
        "review_title": "Don't watch for the plot",
        "review_detailed_main": "There is no plot to speak of, the dialogue is disjointed, the storyline is disjointed, and the ending is a joke... but don't kid yourself that you're watching for any of these things."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ciprianhanga",
        "review_rating": "3",
        "review_title": "Spoiler alert: it's pretty bad",
        "review_detailed_main": "I don't remember if I have reviewed another movie so far, but seeing so many 10/10 reviews determined me to log in to write this, to ballance things up a bit.\n\nThe movie is pretty bad. The plot (if you can call it that) is mostly absurd and the events are cliche and totally predictable (try to remember what somebody did or said in all the bad movies that you ever saw: yes, it's exactly what's going to happen), the events don't make a lot of sense, the dialogue is cringe, the characters are very cartoonish and unbelievable. What they say don't make a lot of sense, and also nobody reacts to events in the way a normal person would do. These are comic book characters, not people. When they try to suggest some of these people are crime lords it's hilarious, you can't help but chuckle. Real mobsters would have these guys for breakfast. Ironically, the fly girls in the movie are actually more believable, because the way they live it is more close to some girls I know.\n\nI never saw any of the \"Shades of Gray\" movies, but for a good part it felt like a relative of those movies. The sex scenes are pretty convincing, I'm still unsure if the oral sex was actually simulated or not.\n\nThe good things I can say about this are (and each gets a star from me):\n\n\nShould you see it? Well I don't know, even with the low score that I gave it, I feel like people should make up their own mind and not take someone's else opinion on it. Besides, I think people should watch bad movies from time to time, to be able to understand better why other movies are good, and to be more appreciative of those, as a consequence.\n\nSo yeah, go watch it, but keep your expectations ridiculously low."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "schmillamedsch",
        "review_rating": "2",
        "review_title": "Worst",
        "review_detailed_main": "Probably one of the worst movies of the century so far"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "nourasoussa",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "I honestly can't believe this is an actual movie and number 1 on Netflix in my country."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "petranickcg",
        "review_rating": "1",
        "review_title": "Money buys love.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "barbaraschum",
        "review_rating": "1",
        "review_title": "I made an account to give this movie a bad review",
        "review_detailed_main": "This was probably the worst movie I've ever seen. The dialogues between the main characters are unbelievably cringy and the plot literally doesn't make any sense. Don't watch this movie unless you wanna waste 2 hours of your life just to give this movie a (probably) 1 star rating too."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "pataati",
        "review_rating": "1",
        "review_title": "Polish boyfriend with short cargo pants",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "enwright",
        "review_rating": "1",
        "review_title": "Are you lost baby girl?",
        "review_detailed_main": "The cringe levels runeth over. The English is almost as bad as the plot. If you want to watch this movie do so as a drinking game. Did you cringe? Then take a shot my dude. You will be wasted by the end."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Neon_Gold",
        "review_rating": "1",
        "review_title": "Insanity",
        "review_detailed_main": "I honestly don't know who thought that this movie would be a good idea. It is a complete train wreck for multiple reasons.\n\nOne of the biggest issues is the plot is just nonsense. It is inappropriate to have a man deiced that he will hold a woman captive and she will love him. That is just not ok and i don't know why they made a movie romanticising this idea. The male character is a creep. He assaults the female character multiple times and it is not shown as a bad thing. It's just like he is a man and he has power so he can do what he likes. It is really really bad. Beyond that they just do variations of the same scene 6 different times. This movie is just the same scene over and over again broken up with random montages with a song played over it.\n\nThe actions of the characters are nonsensical too. She has been kidnapped in a foreign country and then the next day there is a shopping montage where she is just like \"woo lets go buy some new clothes\". Like that just wouldn't happen, you would be terrified and she just acts like fine with it. I feel like they try to get the audience on side by making her current boyfriend a horrible person. I think they think the audience will be like \"oh that's good she got away from him\". Yeah she did get away from her bad boyfriend...by being kidnapped by an Italian mobster who is holding her captive????\n\nThe second issue is the leads can't act and a lot of the movie is just them interacting so its like watching an amateur dramatics troupe half of the time. Now i can't work this out but this woman who is kidnapped never seems scared like at all. I can't deiced if this was the direction she was given or she just can't act or the script said she isn't scared. She literally wakes up after being kidnapped and tried to open the door to get out, can't because its locked and is just like \"Yeah fair enough\" and just sits down like this happens every day.\n\nOn top of that the scenes with the male lead pushing her against walls and stuff she pulls like \"Posing, modelling\" faces and is not like \"Jesus Christ the man is assaulting me help\". Once again was this the direction or was it the acting who's knows?\n\nIt also relies heavily on \"Pop\" songs that are really loud and unnecessary. They constantly play one after the other and then when reading i found out the male lead sung like a big chunk of them so i guess production was just like \"well he will give us them cheep let's throw them all in\".\n\nI could go one about all its problems but it all circles back to the directing, acting and the script. It was just a perfect storm.\n\nBelieve it or not it is watchable but in a way that you want to watch it to see the disaster. It is the no1 viewed film on a large amount of different countries Netflix's at the moment and i believe this to be the reason.\n\nSo its really up to you if you want to watch it. It is very boring but also a train wreck."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tbyrd-50088",
        "review_rating": "1",
        "review_title": "Straight up porn- no judgement.",
        "review_detailed_main": "I do not even know where to start. Look, this is nothing but straight up porn. The plot is ridiculous, the chemistry between the two leads is nonexistent, and the acting is even worse. Trust me when I say, you will watch this in fast forward. It is that horrible!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "murilovidal",
        "review_rating": "",
        "review_title": "You are watching this movie wrong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lydianickerson",
        "review_rating": "8",
        "review_title": "Take it for what it is people!",
        "review_detailed_main": "Is this a 5-star flick? No. But it's not supposed to be. I'm really surprised by the number of bad reviews. It's basically a soft-core porn as everyone has said. Kind of a plot, but not really. More of a erotic fantasy. I love the 2 main characters together. They seemed to have great chemistry. It works. I speak for myself here, but I don't really like regular porn as it's very unrealistic. Yes as a female I will watch some of it, but I don't get turned on to the same things men do and I'm always searching for something that I really enjoy watching that doesn't annoy me with the whiny moans and money shots. At least something like this is a little more relatable and not so ridiculously fake (very little based on the \"plot\" but you know what I mean). It's a steamy fantasy movie. That's it. I read all 50 shades books and the movies were really awful. I was so disappointed. They should've gone all out. This movie, the sex scenes, especially the first one, were on point! As a chick, I'm into the erotic steamy sex scenes in movies and they're hard to find. Those turn me on more than porn. I like to see passion, love, sweat, etc. This movie shows that. I hope they plan to do the others in the series, which based on the ending, it appears they will since it's left open."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "euroGary",
        "review_rating": "6",
        "review_title": "Obviously '#metoo' hasn't yet made it to Poland...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Nothing says romance like a kidnapping and sexual assault!",
        "review_detailed_main": "A mobster has a woman he's never met kidnapped and when she awakens from the drug given to knock her out, he informs her that she'll be living as his prisoner for 365 days. If after this period she hasn't fallen in love with him, he says he'll let her go. And, this weird rape fantasy ends up proving that in the end that the woman DOES want to be dominated, abused and forced to be a sex slave because the man is so sexy hot.\n\nI honestly think that the folks responsible for \"365 Days\" know they created an evil and dangerous film....and that was their intention. Sure, it's irresponsible to make a movie promoting kidnapping and sexual assault...and I cannot imagine any normal person thinking this is a good thing or that it would make a good movie. No, I think the filmmakers knew the film would get a lot of hate and anger...and as a result, it would get a lot of attention. In other words, if you can't make a good film to get attention, make a terrible one to get attention. And, not surprisingly, this film has earned a spot on IMDB's infamous Bottom 100 List.\n\nSo is the film good in any way? The plot that is pro-rape and pro-kidnapping certainly isn't good. Technically speaking, the film also has a few issues.....though it is slick and 'hip' much of the time. While they do a lot of gimmicky cinematographic techniques to make the movie look good, it also often falls back on the tired use of the shaky cam. Additionally, the film turns out to be disappointing even as pornography, as you really don't get much enjoyment or sexual energy from most of the picture. You'd do much better just looking at porn online or just making consensual love with your own partner! Overall, a smarmy little picture...one that unfortunately DID get the negative attention they filmmakers wanted but which also contributes nothing positive to this world and is rather boring.\n\nIn real life, I am trying to imagine an offender in court telling the judge \"I was just doing what I saw them doing in \"365 Days\"...is that so wrong?!\"....and promptly being sentenced to 104 years in prison!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "deepzdeep",
        "review_rating": "1",
        "review_title": "Toxic",
        "review_detailed_main": "Such stupid, worthless, toxic story line . Glorification of relationships where the sole role of a woman is to be a slave and fulfill the desires of a harsh , egotistic ,rich male character."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "bikas-katwal10",
        "review_rating": "1",
        "review_title": "I wish there was zero star",
        "review_detailed_main": "Never seen such horrible movie in my entire life. The concept, acting, scenes, basically everything is wrong in this movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jrd1093",
        "review_rating": "1",
        "review_title": "Softcore Porn Rape-Fantasy",
        "review_detailed_main": "This movie is porn for Karens who think they're too good to watch actual porn, so they watch this ridiculous rape-fantasy garbage instead (another example being 50 Shades of Grey). Of course, filmmaking wise, it's an insult to everyone's intelligence and has some of the worst production I've ever seen. I can't believe Netflix is paying money to stream this. I've seen pornos that are legitimately better films."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "cardsrock",
        "review_rating": "1",
        "review_title": "Absolute garbage",
        "review_detailed_main": "This hardly qualifies as a film. It's basically porn with some random cringey lines and scenes stringed together. The actors can hardly even be called that and the direction is below amateur. The film essentially romanticizes kidnapping and rape too, and for that it should be ashamed. This is truly the bottom of the barrel for 2020."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "esuwem",
        "review_rating": "1",
        "review_title": "Just terrible",
        "review_detailed_main": "This movie is legit the third worst movie I've ever seen. Incoherent plot, stupid characters, completely illogical in every sense of the word. My advice would be to avoid this hot mess at all costs."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "janiev-84092",
        "review_rating": "1",
        "review_title": "\"Are you lost baby girl?\" Yes I was..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "aya_a-fawzy",
        "review_rating": "1",
        "review_title": "When a 12 years old writes a movie directed by his classmate",
        "review_detailed_main": "Wow, how corny can a movie get and what were they thinking, it's so corny it can be rated as a comedy movie. They collected every cliche from the book of cringe and romance and shoved them in a movie. I can't even humor the movie by listing the things that are bad with it, doesn't even deserve the time or effort, the two hours I wasted watching it were more than enough."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "carmenagg",
        "review_rating": "",
        "review_title": "Dont see this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sh_rabat88",
        "review_rating": "10",
        "review_title": "True Erotic",
        "review_detailed_main": "It's Garbage if you're looking for great storyline but if you want to enjoy pure erotic romance yes it is a consummate time pass for you."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mattmayakeller",
        "review_rating": "6",
        "review_title": "Mafia themed 50 shades of grey",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "grimreaperrr",
        "review_rating": "1",
        "review_title": "What on earth did I just watch",
        "review_detailed_main": "Such a rip off from fifty shades of grey. The plot and character development is all over the place. Some things didn't make any sense at all. The ending was horrible. Where's my 2 hours gone?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "anniechen-08545",
        "review_rating": "1",
        "review_title": "Wasted my time",
        "review_detailed_main": "The plot was trash. Even fifty shades series had better plots than this. Things happen out of nowhere, I was confused the whole time watching this movie. Couldn't even get myself to finish watching till the end"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tiriltuba",
        "review_rating": "1",
        "review_title": "Hilarious garbage",
        "review_detailed_main": "This movie made me laugh so hard I almost peed myself. Pretty sure it's not supposed to be a comedy tho..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lobnaessawabi",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "I've never seen a movie that bad. Couldn't even finish it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "hiyna_mdx",
        "review_rating": "5",
        "review_title": "Wattpad 100%",
        "review_detailed_main": "I have read a few stories on the app and this movie is definitely a good reason why some books should never make it on the screen. It was fun but ridiculous and pathetic."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "bianquita1",
        "review_rating": "1",
        "review_title": "Cringe Fest",
        "review_detailed_main": "A new low for Netflix. Horrendous acting, script, EVERYTHING! How desperate for content do you have to be to show this trash? Shame on Netflix!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "pujavachhani",
        "review_rating": "1",
        "review_title": "Such a terrible plot",
        "review_detailed_main": "Such a waste of time. How did Netflix even pick this movie up"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tiredfite",
        "review_rating": "1",
        "review_title": "Seriously??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ipady-74702",
        "review_rating": "",
        "review_title": "do not waste your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "typicalminah",
        "review_rating": "10",
        "review_title": "a really damn good erotic movie",
        "review_detailed_main": "I don't understand what's the bad reviews all are about. i think this is a good erotic movie, the cast is on point, the acting is good, the plot could've been better tho i mean wtf is that ending?? i am dying. i need a closure dammit. but overall this is a really good movie flicks"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "andrewchristianjr",
        "review_rating": "6",
        "review_title": "A FIFTY SHADES OF GREY KIDNAPPING PORN MAFIA FILM.",
        "review_detailed_main": "A \"Fifty Shades of Grey\" kidnapping porn mafia film. Seriously, who watched this film for the story? I have no training in writing yet I'm confident I can write better porn script than this piece of work."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "marmar-69780",
        "review_rating": "1",
        "review_title": "365 days",
        "review_detailed_main": "Wow just wow,im in shock how bad this film was in every possible way in movie making industry,this is actually big insult to every person that ever did a movie before or is just planning to make one,everything is horrible here,acting was one of worsest that i ever saw,lines and dialogue were horrible from beginning till end,story was awful in a hideous ways,and movies entire premise and message is so disgusting and wrong that i think that director of this film should pay some punishment for making this abomination,seriously screw this film in hell were it belongs with every other crap that was realesed this year,dont watch this film or you will hate yourself if you do"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mahmus",
        "review_rating": "1",
        "review_title": "No",
        "review_detailed_main": "This is what happens when you have a script for a porno and think \"you know what? I bet if I make the sex scenes less explicit I can turn this into a theatrical movie\", but you keep the awful dialogue and the disgusting kidnaping plot that was too tasteless for even the most desperate porn studios and expect no one to notice.\n\nAlso, from a writing standpoint, what's the point of making it 365 days to fall in love with him if she's just gonna fall in love with him on like the third day? Couldn't they at least made it clearer how much time has passed, because half the time I have no idea if it's been week or five months. It does feel like a year, that's for sure."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "grantss",
        "review_rating": "2",
        "review_title": "Incredibly bad",
        "review_detailed_main": "Laura, from Warsaw, and her boyfriend head to Sicily for a holiday. There she meets Massimo, the young leader of a local Mafia family. He is immediately smitten by her and kidnaps her, takes her back to his estate and holds her captive. He gives her 365 days to fall in love with him.\n\nIncredibly bad: weak story, dull and wafer-thin plot. Doesn't work on any level.\n\nNot sure who the target audience is. If you want a good story, there isn't much of a plot. If you want a good gangster/crime drama, that element takes up maybe 5-10% of the movie. If you want a romantic drama: what part of a woman being kidnapped by a knuckle-headed hoodlum and yet somehow falling in love with him is romantic, or even plausible? If you want an erotic drama, this will only work if you're a teenager and/or you don't have access to the internet.\n\nI assume this was made to cash in on the inexplicable success of Fifty Shades of Grey. On that note, as bad as Fifty Shades of Grey is, 365 Days makes that look like a masterpiece."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "toothlessgator",
        "review_rating": "1",
        "review_title": "The absolute dumbest movie I have ever watched. Absolute trash.",
        "review_detailed_main": "I implore you not to waste your time watching this. And honestly, the only thing worse than this garbage film is the soundtrack. I saw the reviews for this movie and thought \"oh this sounds like it will be a silly bad movie to fill up my afternoon\" NOPE. It was just bad. Awful. Actually painful to watch at times. Just say no. STUPID."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sophienapier",
        "review_rating": "1",
        "review_title": "Doesn't deserve 1 star",
        "review_detailed_main": "The worst thing to date. A controlling man that's not even attractive with the most cringeworthy line \"are you lost baby girl\" zero stars worse than 50 shades of grey."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mopteen",
        "review_rating": "1",
        "review_title": "Illegal",
        "review_detailed_main": "Who wrote this plot then decided it was okay?!? I mean this man not only kidnaps a girl and forces her to love him, but has horrible one liners. Twilight was toxic but this takes it to another level. I kept excepting him to murder her. But he was attractive so u guess him being crazy and a stalker doesn't matter."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "robbieworlds",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "It's feel like 50 shades of grey a worthy oscar film"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "toriraphael",
        "review_rating": "1",
        "review_title": "No one asked for this movie.",
        "review_detailed_main": "The plot was loosely constructed filler for the scenes in between the porn. It was like 50 shades of grey meets, pornhub meets polish twilight meets general hospital. The dialogue was surface level and cringy. Nothing was remotely convincing and the world building was weak at best. The whole film seems like fan fiction put on screen. The only good thing about this film was the lighting and use of color. Everything else was sub par at best. Not to mention the problematic subject matter and sexist undertones. If you wanna a better film with sexual tension I'd recommend call me by your name or In the mood for love, don't give this film your time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "slim-44",
        "review_rating": "",
        "review_title": "Netflix's ELITE for adults",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "barkera-13584",
        "review_rating": "10",
        "review_title": "Positive views aren't fake?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "danaeriley",
        "review_rating": "6",
        "review_title": "Dont let the bad reviews discourage you",
        "review_detailed_main": "After debating to watch this or not, I decided to give it a try. I mean, I liked 50 shades....it's a fun, fantasy type movie that you can escape in for 1.5-2 hours & not have to worry about anything else. I think that's the point why these movies are popular. The main character is very, very attractive, and its nice to see movies catering to women, or anyone appreciating a mans body. Think about it- how many times have you seen an almost naked woman in a movie? So, I just love when these movies come out & men are so salty about it like, OK every other movie has women everywhere & there's like 4 movies with man being exposed.\n\nIts worth a watch."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "alexandramees",
        "review_rating": "1",
        "review_title": "WTH was this?",
        "review_detailed_main": "I don't even have words to expres how cringe and bad this movie is. I mean, what did I just saw?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lennox101",
        "review_rating": "1",
        "review_title": "Cringiest movie of all time",
        "review_detailed_main": "I was watching this with my girlfriend because I've heard mixed reviews, she's heard quite a lot of good reviews from her friends and we thought it'd be better than 50 shades so we gave it a watch.\n\nOh my goodness, it is the most cringiest movie I have ever watched in my life, I literally walked out of the room, it does not flow at all. The \"erotic\" scenes seem so forced and compared to 50 shades it just is not on the same level.\n\nThe guy is so creepy and doesn't even come across in a seductive way, just an extremely awkward, overly aggressive control freak!\n\nThe people who made this movie should be ashamed of themselves, it has to be ranked in the top 10 worst movies of all time, it certainly can claim the crown of the cringiest movie ever made.\n\nJust wow."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "aquadrama",
        "review_rating": "1",
        "review_title": "Crazy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "gabrielamenjivar-07269",
        "review_rating": "1",
        "review_title": "Disgusting, degrading, derogatory, deamining.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "campos-8",
        "review_rating": "2",
        "review_title": "BAD, BORING AND MORALIST.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dearsadegh",
        "review_rating": "1",
        "review_title": "the worst movie that I have ever seen",
        "review_detailed_main": "I don't know how a person can make this cheap movie? it's embarrassing"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "thetwonerdydudes",
        "review_rating": "1",
        "review_title": "It's Stockholm Syndrome: The Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Abdullah7777",
        "review_rating": "1",
        "review_title": "Toxic masculinity- horrid movie",
        "review_detailed_main": "Okay, there is no doubt that the guy is hot! But this movie promotes toxic masculinity and honestly is so degrading for women... the way the story plays out is just not rite! Yes, i know it is just a movie!!! But with all the kind of people out there in the world, this is the last thing people want to see! Glamorizing kidnaping, abuse and masculinity, no thanks! Its 2020!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "melisbarin",
        "review_rating": "",
        "review_title": "Waste of Time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "kylaschall",
        "review_rating": "10",
        "review_title": "BETTER THAN 50 SHADES",
        "review_detailed_main": "It was the best erotic movie I have ever watched and it was just great. WE NEED PART 2!!!!! ALL YALL WATTPAD PPL THIS IS OUR MOMENT!!! ITS SO BEAUTIFUL AND MAGICAL AND JUST MM."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "george_namaste",
        "review_rating": "7",
        "review_title": "Good movie with bad ending",
        "review_detailed_main": "I am giving it 7/10 rating for this movie even though the ending was unsatisfactory. I would have given it better rating if the movie ended on a better note.\n\nI think lot of ppl have given a bad review for this movie since it showcases abduction of girls. Many ppl seems to question why this is in netflix... If that was the case, all the movies in netflix should show only positive movies ( movies based on robbery, killings,psycho thriller etc shouldn't be showed). I get it. Movies can influence ppl.\n\nDont watch this movie if you dont like watching too much of nude scenes. Lot of it was spoken in polish and without any subtitles. Its sad that movies are released without much english subtitles. I was able to see the movie with 50% english subtitles. Couldnt understand the whole story.\n\nBut, from what i understood and the acting by the male and female character, movie was nice. Far better than 50 shades of grey.\n\nGood choice of main characters. Both are good looking. Acting was on point."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "zazabagheri",
        "review_rating": "1",
        "review_title": "The worst!!",
        "review_detailed_main": "Simply the most stupid movie I've ever seen!!! It didn't have any stories or actings!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "avandesteen",
        "review_rating": "1",
        "review_title": "Rape culture",
        "review_detailed_main": "This is the most horrible movie ever and I am so embarrassed this is currently Nr1 in my country. This is the perfect illustration of rape culture. It is honestly horrific and I really don't understand how someone can launch that kind of movie nowadays. And I'm not even mentioning the horrible acting or the poor scenario."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "hliasxarishs",
        "review_rating": "1",
        "review_title": "They kill the boom guy",
        "review_detailed_main": "If you respect your time don't watch this movie . Plot and dialogues are awful, it's a mix of \"beauty and the beast \" and \"50 shades of grey \" no development of the characters , every 10 minutes we have a 3 minutes sequence with music . I recommend this movie only if you want to laugh with your friends while playing drinking games ."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "laurintaster",
        "review_rating": "1",
        "review_title": "Cringy, bad written movie with terrible music director",
        "review_detailed_main": "I literally created an account in IMDB just to write a review on this movie. The storyline was probably written in one day. The soundtracks never really matched the mood of the scene and seemed out of place. I have never laughed and cringed this hard from a movie. I would definitely describe it as erotica, which wasn't mentioned in netflix, sometimes I wasn't sure if I was watching a movie or porn. Polish and Italian mashup in one movie seemed kinda weird for me too. The main actors/actresses are lacking talent makes this movie even worse just like a cherry on top.\n\nBad job, Poland!\n\nI'm sorry for anyone who will watch it in cinema, what a waste of money..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mateusolivotti",
        "review_rating": "1",
        "review_title": "365 ways to destroy a movie",
        "review_detailed_main": "365 dni is the new movie in the Netflix catalog, and I honestly don't know how Netflix saw this movie and thought \"Okay, it looks good.\"\n\nThe film should be called 365 defects or 365 ways to destroy a film, and I will not waste time citing all errors, I will mention only the most serious ones. First of all, the film has almost no history, just some justifications for putting on sex scenes, editing and editing are a disaster, so the film at times becomes confusing, the script is shameful and one of the worst things from the film, and to finish the direction and horrible in all aspects, the film is directed by two people and it weighs a lot."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "blubfishie",
        "review_rating": "1",
        "review_title": "Surprised by how bad it is.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "teneet",
        "review_rating": "1",
        "review_title": "Walmart fifty shades",
        "review_detailed_main": "I have seen a lot in my years, this is something else. Imagine romanticising Stockholm Syndrome. She literally falls in the ocean because of HIM and she thinks hes some prince charming. NO. It was his fault. He literally saved you from a situation HE put you in. We all have our fantasies but Netflix should not bring such vile images to my screen. I have issues and these issues have been AMPLIFIED by this absolute snuff film."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mweisman-99732",
        "review_rating": "1",
        "review_title": "it sucks",
        "review_detailed_main": "Like real bad. garbage movie based on a garbage book, thats it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lalalanellecmg",
        "review_rating": "10",
        "review_title": "Better than 50 shades trilogy IN ALL ASPECTS",
        "review_detailed_main": "Honestly love this movie because its storyline is unique, and like it came straight out of a wattpad book. The actors played their characters well, plus the setting of the story is beautiful. Breathtaking. I can't wait for part 2 and part 3! Best erotic movie I've ever seen. Massimo is smoking hot!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "chubarova",
        "review_rating": "6",
        "review_title": "Good erotic film.",
        "review_detailed_main": "I don't know why this film has so low rate. Firstly, the story is quite interesting, it's about transformation of relationship from hate to love. Secondly, the cast is good, actor who plays main character is really good-looking. Thirdly, the scenes filmed well, you as a viewer can feel the atmosphere of love between characters. So, it's good erotic film."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mathompriv",
        "review_rating": "1",
        "review_title": "Left the cinema",
        "review_detailed_main": "Just when you think that Polish cinema cannot fall any lower, a movie like this one is made.\n\nAbsolute trash and money grab for Valentine's Day.\n\nOne star for visuals. Don't be fooled by the fake reviews."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sanderandreassen-29885",
        "review_rating": "1",
        "review_title": "Wtf",
        "review_detailed_main": "Worst movie i have ever seen there is no plot or progression. I have watched 20 minutes and im intrigued to see how this movie actually can get. Dont get me started on the music choice, ripoff chainsmokers in every scene!!!!!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jack-39973",
        "review_rating": "1",
        "review_title": "Really Bad",
        "review_detailed_main": "One of the worst and most stupid movies of all time. Bad story and really bad and dump characters..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "psxexperten",
        "review_rating": "1",
        "review_title": "This is pure and simple garbage from beginning to end.",
        "review_detailed_main": "Don't believe all the 8-10 stars reviews, they are wanker friends of cast and crew. There is no way any person on earth enjoyed this movie; let alone thought it was a 10 star film. It is truly unbelievable how this movie managed to get released. It is with all honesty really really bad. Terrible Awful Crap One of the worst films I have ever seen."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "patrykwalasek-93380",
        "review_rating": "1",
        "review_title": "I litterraly made an account to share my opinion",
        "review_detailed_main": "I don't know if it is the worst movie from Poland but definitely in the top 3. The plot, the acting...nothing will make me want to seen it again. Definitely I consider time watching this totally wasted."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "emmanuellebarone",
        "review_rating": "1",
        "review_title": "Really badly acted and promoting violence against women",
        "review_detailed_main": "How can Netflix show this movie? watched only a few sequences, it is very badly acted and it is definitely promoting violence against women. That's a big NO."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "iliyaniz",
        "review_rating": "1",
        "review_title": "Stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "penniannhazzard",
        "review_rating": "1",
        "review_title": "WTF?",
        "review_detailed_main": "What is wrong with you people? I didn't realize Stockholm Syndrome was the new relationship high. Ugh. This makes Christian Grey look like a Disney Prince."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Tendressee",
        "review_rating": "",
        "review_title": "Polish girls are not so vulgar, unrefined and boorish!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "xmaryammax",
        "review_rating": "9",
        "review_title": "Speechless, Part 2 ASAP",
        "review_detailed_main": "This movie was simply wow I'm speechless. BUT the ending was not IT! I hated the ending as it was so disappointing unless they are planning on a part 2 to link them together."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "therese_ryderman",
        "review_rating": "6",
        "review_title": "Romantic and sexy movie. I liked it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "vladan-curic",
        "review_rating": "1",
        "review_title": "I can't remember watching sth worse on a long while",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "maria63303",
        "review_rating": "2",
        "review_title": "Sad Excuse for a Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sagetwo",
        "review_rating": "1",
        "review_title": "A true nightmare.",
        "review_detailed_main": "This is not romance. This is built on stalking, kidnapping, dismissal of informed consent. The female character is given 365 days to develop \"stockholm syndrome.\"\n\nPeople, who wrote the story, is deeply immoral or needs mental help. Same goes with the people who made this movie. Same goes with the people who give this movie, more than 3/10. Same goes for people who disapprove my short and concise review\n\nWhy do movies like 365 days, 50 Shades, Twilight, etc. exist in the first place?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "amiasgarzade",
        "review_rating": "1",
        "review_title": "Erotic movie",
        "review_detailed_main": "If you want to watch an erotic movie, this movie is a good one, but if you prefer to enjoy the story, this is the worst. You can't believe the characters. Cinematography has done well. Italy's landscapes and buildings are beautiful."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Lakambra",
        "review_rating": "1",
        "review_title": "Why are these movies still in production?",
        "review_detailed_main": "By far, the most cringy and awful movie in 2020. Just horrendous."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "stingsahin-831-564122",
        "review_rating": "1",
        "review_title": "Women has valued more in most porn",
        "review_detailed_main": "An unacceptably humiliated woman. An incredibly rude man. It should be a crime to show this movie to young boys and girls. There is no love, there is no even like."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "nanluna",
        "review_rating": "3",
        "review_title": "I have seen porn movies with a better plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "yudhabagaskara",
        "review_rating": "1",
        "review_title": "disaster waiting to happen",
        "review_detailed_main": "This and after we collided are the epitome of how toxic relationship can ruin the whole movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "chaplinman13",
        "review_rating": "10",
        "review_title": "Erotica that is enjoyable, don't believe the ratings or bad reviews",
        "review_detailed_main": "The overall rating on this movie is quite misleading, and that's disappointing. Hence the reason for my 10/10. It probably deserves more of 6/10 or so.\n\n365 dni is not to be Oscar worthy. It wasn't made to be the best dramatic film either. It is EROTICA. All these horrible reviews on acting, explicit sex, fetish's, no plot, and etc. Disappointing if you expected something different than the great erotica it is. The movie photo alone allures to more.\n\n365 dni is aspects of movies more on the lines of Wild Orchid, Secretary, Henry & June, Killing Me Softly, Delta of Venus, 9 1/2 Weeks, Red Shoe Diaries, and yes even 50 Shades. ASPECTS though, not entire scenes. Move along if you're not here to view erotica and forgo your inaccurate reviews, please.\n\nAlthough technically the lead male, Mossimo kidnaps lead female, Laura, there's more to it. Those crying #MeToo or Stockholm, maybe pay attention to the lead male character, Mossimo, as there's more. Sex only comes into play about halfway in. The only body parts shown are buttocks and breasts. However, it's very sensual and there is indeed build up, showing we didn't need full nudity to enjoy (but might be nice). Yes, there are oral scenes with proper sounds, but again, parts are not truly shown. You must use your imagination, which is fine and works well in this movie.\n\nThe movie begins on a rooftop. A meeting between Mossimo's father and two men. Mossimo is there (along with guards), but sees a beautiful, smiling, dancing, happy female through binoculars. I won't list any spoilers. There are three languages spoken (Polish, Italian, and English). My subtitles only captured the Italian and I understood the English. I missed out on the Polish conversations, which was a bummer, but not too many scenes (maybe 4). There is death (2 count), there is the chance sighting, there is beautiful scenery, there is wealth, there is the chance finding, there is murder, there is drugs (one scene), there is teasing, there is sex, there is pleasure, and there is love. Sure, there could have been more building between the two main characters, but that didn't make this a bad movie. Sure, there's aspects in the flick that are never fully explained, but again, it's erotica and didn't make this a bad movie. Yes, there's a spreader bar, chains, and fasteners, but this doesn't make it a fetish film.\n\nTo each their own. Only you, the viewer can be the judge, but you must be open minded and enjoy erotica to enjoy this movie. As for me, I'll watch it again and be happy with it. Thank you."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "vivianla",
        "review_rating": "",
        "review_title": "\"Sexy\" Scenes With Not Much Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "TdSmth5",
        "review_rating": "7",
        "review_title": "Good for what it is",
        "review_detailed_main": "Somewhere on a rooftop by the sea some mobsters are conducting some deal. Because it involves human trafficking, the one side is reluctant. One guy is watching a girl on the beach when his father goes to talk to him. The father is then shot. Now the son, Massimo inherits the mob clan.\n\nSome attractive executive named Laura is working on a deal. She's in a relationship with some guy way below her league. For her birthday they go with another couple to Italy. There she runs into Massimo, who then kidnaps her. Turns out she was to girl on the beach years ago. I wouldn't have known, we only get a split-second view of her on the beach. But he became obsessed with her and made it his mission to find her and make her his. He offers her a \"deal.\" He'll keep her for 365 days during which he'll try to make her fall in love with him. If he fails, she's free to go and he won't force her to do anything against her will.\n\nEven though this guy lives in a castle for crying out loud, Laura is downright hostile for a while. She gets to have everything she wants but insists on escaping. Eventually he lets her make a phone call. He makes the mistake of taking her to party where she off course overtly starts flirting with guys. That drives Massimo crazy and he attacks one guy...who happens to be from a rival mafia. This will come back to haunt them.\n\nHe's not particularly adept at romantic seduction, he's more interested in sexual seduction and surprisingly succeeds in making her fall first in lust with him. Eventually in love as well. And they establish a sort of normal relationship, except that no one can know what he does for a living. They even go so far as plan a wedding but that's when his occupation becomes an issue.\n\nEven though there's a quite a bit of story here, the focus is more carnal. There's not shortage of sex involving mostly this one couple. The sex scenes are rather odd. Yes, they are strong in a way, but I found them a bit clean and sterile in how they where filmed. They are also filmed more for a female audience. Anna Maria Sieklucka is both lovely and hot. Not in a bombshell way but more in a stunning girl-next-door way.\n\n365 days is a strong erotic romance drama for adults. As such it's a relatively good movie. American audiences are of course not familiar with movies about sex that aren't porn or gateways to bdsm or offensive comedies, hence the poor reviews and the absurd low score here. But this genre of slightly erotic non-porn movies with varying degrees of explicitness where vanilla sex is the main theme has been around in Europe for decades. 365 Days is a just recent and successful example. Hopefully it will begin break the link that the porn industry has established in the American mind that sex + film = necessarily porn. So I applaud the intention of this movie. Perhaps it's success will give rise to more movies of its kind."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "radhrh",
        "review_rating": "1",
        "review_title": "Truly awful. An abomination of a movie.",
        "review_detailed_main": "The Mrs. wanted to watch this but even she turned it off after half an hour. I can't fully express just how awful and frankly offensive this movie is. It makes 50 Shades look good. An abomination of a movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "luizabilteanu-61094",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen.",
        "review_detailed_main": "Wasn't able to watch it until the end. Had to always skip through it. Full of cliches and cringe dialogue."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Sweeti6639",
        "review_rating": "1",
        "review_title": "Offensive",
        "review_detailed_main": "I found the plot of this movie incredibly offensive. It's basically romanticizing an extremely toxic unhealthy relationship. The script and the acting were also both pretty horrible."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "peter-partyka",
        "review_rating": "1",
        "review_title": "absolutel garbage",
        "review_detailed_main": "What a garbage. I can't remember watching anything as bad as this . Waste of your time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jablesduhammstein",
        "review_rating": "1",
        "review_title": "Very bad",
        "review_detailed_main": "This is the \"The Room\" of erotic movies. It all has an overall cheap feel to it. At a certain point it begins to feel as a musical too. There's a BJ scene with rock and roll in it that made me consider hanging myself with my belt. It feels like the script for this was written by an underage WattPad user. I'm impressed Netflix would put out such hot garbage. Giving the equipment used and image quality is so high and the movie quality is so bad I'm willing to believe that the director is just a well connected rich person."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "PumpkinSeeds15",
        "review_rating": "1",
        "review_title": "Ughhhhhh",
        "review_detailed_main": "This movie makes me embarrassed to be a polish citizen. It singlehandedly set back women some 20 years purely by existing. There's nothing I can say that other reviews haven't said already. The single positive thing is the fashion, it was quite good, and wow that was hard to say."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "kaseaseabrook",
        "review_rating": "1",
        "review_title": "Wow",
        "review_detailed_main": "When he spit on her area, I finally realized I was watching a porn with a Hollywood movie budget.\n\nAlso, quit hyping up rich men who kidnap/mistreat/sexual assault women who had amazing careers before she met him to become sex slaves and then show amazing shopping trips and then she's like \"I LOVE YOU,\" movies. JUST STOP."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "liz_val",
        "review_rating": "1",
        "review_title": "First review: I made an account to give this movie a bad review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ashleynluna",
        "review_rating": "10",
        "review_title": "Let women have this. Men have plenty of erotica.",
        "review_detailed_main": "Let us enjoy some female gaze. Damn. Giving this a 10 to balance the haters."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "musicalfreakgurl",
        "review_rating": "",
        "review_title": "NO PLOT. Just sex. Movie follows book series.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Naithiry",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I couldn't even watch this movie until the end. This is one of the worst movies ever made. I felt embarrassed. The dialogue was HORRIBLE. This movie does not belong on Netflix."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "johannordin1",
        "review_rating": "1",
        "review_title": "A degrading bag of trash",
        "review_detailed_main": "This film basically acts like the sexist and pitiful dreams of a loser who has never interacted with women or anybody else for that matter without having ulterior motives. I can't even put into words how sad and ridiculous the idea behind this movie is and the execution of it is somehow even worse.\n\nIf the director is not some creepy old guy who just wanted to make his own softcore porno I'm confused"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "rosa-lidsmoes",
        "review_rating": "2",
        "review_title": "Watch it ironically",
        "review_detailed_main": "If Fifty Shades of Grey, Twilight and The Room has a baby, this would be it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "valossvk",
        "review_rating": "1",
        "review_title": "Totally garbage from the beginning to the end.",
        "review_detailed_main": "Don't waste you time on this, it's about nothing and end about being nothing no story at all no acting at all"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "chouiluca",
        "review_rating": "1",
        "review_title": "Horrible.",
        "review_detailed_main": "Do yourself a favor and do not watch this, It's beyond bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Onjam-54472",
        "review_rating": "2",
        "review_title": "Cliché, cliché, cliché and omg kill me!!!",
        "review_detailed_main": "But I'm glad I watched it. Two hours of my life gone for good, but well spent, since I somehow came up to all sorts of curses and comments I never knew I've ever heard."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "gscheikowski",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "How is this popular? Don't watch it will waste your life."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "salesmarcos",
        "review_rating": "1",
        "review_title": "Bad. Pretty bad.",
        "review_detailed_main": "That's it, there is nothing in this movie that worth a word or your time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jbrown-44118",
        "review_rating": "9",
        "review_title": "I loved this movie, but probably because I like erotic fantasy.",
        "review_detailed_main": "First off, I must say I loved the 50 shade books, but thought the movies were so so. If this movie was this good, I can't wait for the books to be published in English. Polish people went all in. Now, it's not exactly like 50 shades, but it's the same principal: cat and mouse game. I know people are confused on why people and women in particular love this movie. It's a fantasy, yes, it's not real, we know that, but that doesn't matter. It's a safe fantasy in our minds because it's in a movie and not real. Michele who plays Mossimo does an amazing job, better than Jamie did with Christian Gray. He fits the role to a tee.\n\nAs for the ending, this is part of a trilogy. Once people understand that, the ending makes sense. It's not over and I CAN NOT wait for #2.\n\nAt the end of this day, this movie is not meant to win awards. It's meant to be a feel good movie and it gives millions of women all over the world, the feels and it hits the mark. Especially since we are in quarantine, we need a movie that takes us away.\n\nFor anyone who doesn't understand this movie, they don't understand erotic fantasy. This movie is not for everyone! But it is for millions of people all over the world!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mikenot-25861",
        "review_rating": "2",
        "review_title": "1 Shade of grey........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "RebekahE99",
        "review_rating": "1",
        "review_title": "Why is this even on Netflix?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sayyamkapoor",
        "review_rating": "1",
        "review_title": "Absolute garbage",
        "review_detailed_main": "I've seen some pathetic movies in my life and calling this movie pathetic would be an understatement."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "allysonhathcock",
        "review_rating": "1",
        "review_title": "Must be a spoof",
        "review_detailed_main": "This makes pornography look intellectual. Horribly written, bad acting, nothing redeeming about any character nor interesting. Ugly people. Boring plot. Bad dialogue. However great scenery! Worst film ever made...."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "yeizzy-28461",
        "review_rating": "1",
        "review_title": "Does these people have common sense?",
        "review_detailed_main": "Despite the stupidity and the many holes in this movie, we all know it belongs to somewhere else and it's not Netflix"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "darkmoon-74604",
        "review_rating": "1",
        "review_title": "Lack of depth",
        "review_detailed_main": "This movie clearly needs improvement for both the acting and story line."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mohammadarafatma",
        "review_rating": "1",
        "review_title": "A pollution for the eye.",
        "review_detailed_main": "This movie is full of mistakes. No decent plot, bad acting, disgusting intimate scenes, bad script. I do no recommend it at all."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "meghan-kuentz",
        "review_rating": "1",
        "review_title": "Everyone involved in this should be ashamed",
        "review_detailed_main": "This thing has to be joke right? He *kidnaps* her to give her the chance to fall for him? That is Stockholm syndrome. That is not romantic, it's criminal. To anyone watching this- THIS IS NOT ACCEPTABLE TREATMENT OF WOMEN!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "zocavanagh",
        "review_rating": "8",
        "review_title": "Not as bad as I thought",
        "review_detailed_main": "So I think a lot of people who saw this film, don't understand erotica or sexual fantasies. And nothing is a \"copycat\" to 50 shades, as a lot of old erotica novels have similar storyline's. This movie is just an erotica novel coming to film. The sex scenes are that of the books my grandma even read and handed down to me! The story line did make sense, however the back story wasn't supposed to be the focus. The film was about desire, passion and sex. That's it. Erotica novels are cheesy with some cringe story lines but the sex scenes are hot! And this is what this movie really is. The adult film industry is the largest in the world and believe it or not this type of fantasy is actually very common. Of course it's not wanted in real life that's why it's a fantasy. The woman's sexuality actually had all the power and what is wrong with that? Don't over think the \"captive\" part. It's just a plot to build competitive desire between the characters."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Adil90",
        "review_rating": "6",
        "review_title": "Refreshing",
        "review_detailed_main": "A ferocious and erotic breath of fresh air showing a man and woman in predatory natural interplay with no strings attached. The movie is mediocre but hammers it home through passionate actors bringing their respective roles alive, graciously teasing the viewers inner animal until the long-awaited crescendo is reached."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "starlit-3",
        "review_rating": "1",
        "review_title": "Promoting Kidnapping is NOT OK",
        "review_detailed_main": "Since when is promoting kidnapping okay? To make it worse she develops stockholm syndrome which seems to condone the whole thing! Netflix needs to address this! This movie should be destroyed!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "bellapette",
        "review_rating": "2",
        "review_title": "Cringy af",
        "review_detailed_main": "I've never cringed harder at a movie. Inspiration must have been from wattpad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "michicalvo-02122",
        "review_rating": "1",
        "review_title": "She was drugged and kidnapped it was NOT ROMANCE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "amralikh",
        "review_rating": "1",
        "review_title": "STOP",
        "review_detailed_main": "Please Netflix STOP making movies!! You are so bad!!!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jaslar92",
        "review_rating": "1",
        "review_title": "Cannot get over how much this movie sucks",
        "review_detailed_main": "As mentioned by some of the reviewers, I think the main message of the movie is: money buys love. Imagine if the Massimo was an avarage guy, working a 10 hour shift, middle-class and would kidnap Laura, simply because he liked her. She could spend a year in his basement deciding if she likes him back. Laura would probably die trying to escape. Basically we are telling female audience that it is OK to be a vicitm as long as the abuser is hot and rich. Because women like dominance right?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "iluvjbm",
        "review_rating": "1",
        "review_title": "Are you kidding me",
        "review_detailed_main": "I don't understand how this movie is number one on Netflix, this is terrible and horrible. I understand the guy is hot and all but what the???? Like are you kidding me??? What kind of ending was that ? Like it's terrible I was so disappointed thru the middle all the way to the end. I'm so upset. Never will watch it again."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Gravedigger41",
        "review_rating": "1",
        "review_title": "CRINGY AF",
        "review_detailed_main": "If this was in the comedy section I'd rate it with 10/10. But it wasn't. Worst acting I've seen lately, even the sex scenes (which was half of the film) made you laugh."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "daniellewellen-40800",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "50 shades of grey was better than this.. and that's saying something..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "angelica-41561",
        "review_rating": "8",
        "review_title": "Wasn't watching for the plot!",
        "review_detailed_main": "Goodness where did this man come from! I didn't pay any attention to their backstory. I enjoyed the movie for the competitiveness going back and forward between the two."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ilhamsj",
        "review_rating": "",
        "review_title": "Baddddd not worth opening",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tnulla",
        "review_rating": "6",
        "review_title": "Awesome erotica",
        "review_detailed_main": "Enjoyed watching it with my fiance. Good actor and actress."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "roshenjaswal",
        "review_rating": "1",
        "review_title": "Wow... this was bad",
        "review_detailed_main": "I will keep this short and (not so) sweet, this was easily one of the worst films I have ever seen. Save your time and your sanity and don't watch this. TERRIBLE"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "robbiefusco",
        "review_rating": "1",
        "review_title": "How any women could find this appealing is embarassing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "skylarpmacomber",
        "review_rating": "1",
        "review_title": "Cringe dialogue and horrible plot",
        "review_detailed_main": "Plot was horrible and the dialogue was horrible. Also who sees this as love he kidnaps her"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "valkiradog",
        "review_rating": "1",
        "review_title": "Every polish girl fantasy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "habibjedly",
        "review_rating": "1",
        "review_title": "Exploitation of people's feelings",
        "review_detailed_main": "This movie, in the utmost simplicity, is a film that does not contain a story or meaningful messages. It is just a work that relied on pornographic scenes as a primary and official source in order to gain views and build a fan base in addition to the final, which is for me something that increased my hatred for this movie"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "s-ara-96223",
        "review_rating": "1",
        "review_title": "Just bad",
        "review_detailed_main": "This movie was pretty bad. It was among top 10 on Netflix. But I really don't understand why. It's so bad I barely got through the whole movie. It was painful to watch but as it had good reviews here I decided to watch it. So decided to give it a review so it will get balanced out.\n\nDon't watch it if you don't want to waste your time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jreid-81713",
        "review_rating": "1",
        "review_title": "absolute garbage",
        "review_detailed_main": "Please dont waste your time watching this trash. Zero plot, awful characters and stupid idea. Nothing but nudity and terrible lines. Whoever made this should not make anymore movies."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "hbarber-80894",
        "review_rating": "1",
        "review_title": "The worst movie ever.",
        "review_detailed_main": "No debate, the worst movie ever made bar \"The Room\". This website is made for rating movies, not porn. If you are a middle aged woman who's using this to be aroused by, all the power to you. But don't rate it a 10/10 when it has the worst cast, performances, cinematography, music......"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mnmoore-45585",
        "review_rating": "9",
        "review_title": "It's actually not as bad as everyone is making it out to be...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "TinyThoughts",
        "review_rating": "6",
        "review_title": "It's a chick flick",
        "review_detailed_main": "Rate it as such. Before watching i heard a lot of that it is terrible etc, and my expectations were really low. It wasnt so bad! Plot is not too good, acting is ok, camerawork is kinda good, ending was actually quite surprising in a good way, and hey, its made for women. Multilinguality was also a plus. Not so bad as they call it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "iamxxii",
        "review_rating": "1",
        "review_title": "Heaven for narcissists",
        "review_detailed_main": "Super duper candy narcissistic piece of joke. Watch \"TAR\" to understand the dangers of today's narcissistic women. All narcs end up desperate unknown and mostly dead with ZERO family connections. Super duper expensive clothes, apartments, makeup, etc etc, Bugatti by some people who don't even speak English? Tate family reminders? Not surprised. To buy and service Bugatti it is not practical? Guy is a builder? A Roma? Drug dealer? What does he do? Or whas he one of Tonbridge mastermind stealing £53 in cash? Makes no sense, i give it a ZERO point! Agree or disagree but that is the absolute truth! Thank you."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "minlee1980",
        "review_rating": "1",
        "review_title": "Romance?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "elizuk-39728",
        "review_rating": "1",
        "review_title": "No romance, only an erotic movie",
        "review_detailed_main": "I think it was the worst movie I've ever seen. It has no story, only an idea of it. You have to like these movies, because it is not a romance. He kidnaped her, made her to do what he wanted, he had sex with her and in the end... what end? It has nothing. When I've read the plot I expected something different, but it seems that the plot says not to much at all.\n\nOnly one thing that I liked was the landscape from Italy, but that was all."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mattfrancis-03963",
        "review_rating": "1",
        "review_title": "Shame on viewers",
        "review_detailed_main": "Blame Italy, or Poland, or Netflix? No just blame people. Nowadays it's about a thrill, not a story meaning the movie was a cringe fest and a laughing stock. Now it's not the dialogue that was bad, the woeful unrealistic story, or the acting, what's bad is the fact people can make excuses for this throwing lot of clever cinematic views and shall we say steamy moments. A movie isn't about the thrill. It's not about filters and fancy clothes, being spoilt as a woman and loaded as a man. No actually that actually is all this is. Netflix throws this at us because of the demands to please the audience with this sort of thing. Any pathetic, girl power, snap chat fish for likes love myself type of person will adore this. As too will any unhappy coupled or bored individual. Point blank doesn't matter how disgusting the male lead is, how bad the story or dialogue, how bad the female leads acting is, it's all about what is pleasing on the eye. That's why a Netflix original cannot be trusted or half of the reviews left by these so called adults. Many of whom are probably underage by the way or only care about a good time and no doubt have everything easy. This isn't about an escape and it's not about putting yourself in the polish girls shoes, or underpants, it's about what is wrong with the every day person these days and how so long as they're enjoying their life nothing else especially not this stuff matters. Shame. A woeful woeful film.\n\nNeed to be in one of my clubs in two hours? Ha ha. Cringe. Just shut up."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Vector18",
        "review_rating": "1",
        "review_title": "Stockholm Syndrome: The Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "alindsayal",
        "review_rating": "1",
        "review_title": "An Awful Rip Off of 50 Shades of Grey",
        "review_detailed_main": "His film recently hit Netflix and has been seen by quite a few people so I have now decided to watch it and review 365 DNI. The premise of the film sees an Italian mafia boss kidnapp a woman and give her 365 days for her to fall in love with him.\n\nMain Character The main girl in this film is called Laura and I checked the actresses history and she has done nothing before this film and it really shows as she is terrible here. It feels like she was hired just because she is attractive and was willing to do things that maybe other performers wouldn't be. Her character is laughably bad and has no depth to her at all, she is so weak and you really wonder why you should care about her in the film. Then there is the main guy who is probably even worse, he is so aggressive towards her and unlikeable, the fact that these two people would have any type of relationship is absurd and is hard to watch as it is all the film gives to you.\n\nSupporting Characters There are literally no interesting supporting characters, it is all the stereotypes you would expect. The ex partners of both people, the crazy bestfriend and the old school gangster but none of them are performed well at all and you are given no reason to care.\n\nStory There is a slightly interesting premise here but it requires good acting and good storytelling which this film has neither. The two leads have no chemistry together and actually their relationship is pretty abusive and really hard to root for even though the film tries to make you. There are some generic side plots that are there to pad out the film and play no part of the main plot, plus the ending is awful with no explanation at all.\n\nScript The script is shocking, the dialogue is truly laughable, there is no hu,our and no drama which makes the film even worse then it should be.\n\nStyle The film's style mainly focuses on it's sex scenes and yeah they are well done but honestly it is not worth the time, you can find things on the internet that is the same and quicker to watch. This film forgets what it is, it goes on for two hours which is way too long and makes this film feel longer then it has any right to be.\n\nOverall Overall, this is one of the worst films I have ever seen, this film is there for it's sex but the rest of them film has the porn level of acting and storytelling that comes with it making it a truly awful film.\n\nRating - 1/10."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "faer_kr",
        "review_rating": "2",
        "review_title": "Misogynist",
        "review_detailed_main": "A Polish erotic drama. It's about a gangster who kidnaps the girl from his visions so that she falls in love with him. Performances that leave a lot to be desired. They only sell you the physique. Pretentious Explicit sexual scenes, in fact it is the only resource that the film uses, that and eroticism. The story's arguments don't make much sense. Since when did violence, crime, kidnapping, misogyny and gender violence become something romantic? Pathetic how a kidnapped person reacts. This closely resembles 50 Shades of Gray as it uses the same misogynous resources. The ending is the only thing that does the film justice."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "steve_anderson22",
        "review_rating": "1",
        "review_title": "Kind of glorified kidnapping and sexual assault.",
        "review_detailed_main": "Not sure why number one in uk. It is poorly written and would not recommend this film, even to a fifty shades fan. If you want a bit of sexy, plenty better then this. Think this film gives the wrong impression of love..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lemuspicapau2009",
        "review_rating": "10",
        "review_title": "This is a ten",
        "review_detailed_main": "I will say that this movie accomplish to entertain, and personally I really enjoyed watching Michele Morrone, very handsome man. Off course it will not be expected that anyone that acted or produced this movie will be nominated for the Academy awards, but hey, what the heck, I liked it, even more than the Fifty shades franchise being honest with you. I will agree that I was expecting a more idrlic ending, but hey after watching this movie, I sure want to read the book."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "WhoMadeYouGod",
        "review_rating": "6",
        "review_title": "Honestly not that bad",
        "review_detailed_main": "It's a watchable film... it's not amazing but it is what 50 shades should have been. The storyline is a bit lame... the acting is ok but honestly I don't get the 1/10 ratings. Take it for what it is meant to be and I think people who like this type of film will enjoy it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "elitoy-85854",
        "review_rating": "1",
        "review_title": "I made an account just to give 1 star",
        "review_detailed_main": "\"365 days\" is probably the most cringe movie ever made. The plot doesn't even make any sense and I don't think that this could possibly ever happen in life no matter how unrealistic it is. It was definitely not thought through at all. The movie was not even erotic even though that is its genre and it was lacking the whole \"erotic atmosphere\". The producers have definitely tried to come up with something like 50 Shades of Grey and have failed miserably. I wasted 2 hours of my life for that - don't do the same mistake!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "agjemiola",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Don't even waste your time. Highly disappointing, rubbish story, seems like made by totally inexperienced student."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "samdumorris",
        "review_rating": "1",
        "review_title": "Uhhhhhh...",
        "review_detailed_main": "THIS MOVIE MAKES 50 SHADES OF GREY LOOK LIKE A MASTERPIECE!! IT WAS THAT BAD! I THINK THIS ONE SENTENCE IS ENOUGH"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ravenrose2300",
        "review_rating": "1",
        "review_title": "Kidnapping, assault, & isolation",
        "review_detailed_main": "Yep that's about all that's in this movie. Oh and weird sex scenes. This is just another movie, in a line that's way too long, where the woman is independent but the second a rich controlling man shows interest she forgets who she is to fall in love. This just tells woman that if he has money but is controlling that's ok. He really loves you. I can't BELIEVE this is in Netflix top 10"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "toddwilson-49972",
        "review_rating": "1",
        "review_title": "Uhm, sure",
        "review_detailed_main": "Imagine if the main character was a broke ugly guy, this would be a completely different movie!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Roseallday",
        "review_rating": "1",
        "review_title": "2 days to finish the movie",
        "review_detailed_main": "Yes, it took me two days to finish this movie because I could not handle the cringe, sometimes I would mute it and read to avoid their awful voices but even then, reading the subtitles would stop my blood circulation because of how corny the lines are.\n\nit is so cringing worthy I started to question the life choices that led me to continue watching this masterpiece of cringe and wast of time.\n\nStupid plot, cliche and overused scenes, bad acting, bad English, imaginary scinarios..etc. This took bad movies into a whole new level, I think that the writers of this movie, read Twilight and Fifty shades and thought to themselves...hmmm how could we do the same but add more cringe? To those who want to watch this movie...run, run away from this and never look back."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "esebuedo11",
        "review_rating": "1",
        "review_title": "The very worst movie I've ever seen",
        "review_detailed_main": "Bad actors, poor argument, do you say erotic movie? 50 shades is art compared with this trash."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jorgeluevano",
        "review_rating": "1",
        "review_title": "Cringe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "damionspincess",
        "review_rating": "10",
        "review_title": "Good Movie to watch/ not recommended for kids",
        "review_detailed_main": "If you're looking for a great movie to watch when the kids are in bed, this is it. Loved it!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "darkomarijancevic",
        "review_rating": "7",
        "review_title": "Not to be watched from the perspective of a 'normal' person",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "breeannej",
        "review_rating": "1",
        "review_title": "Nope",
        "review_detailed_main": "Couldn't even watch the whole movie... The movie really started to seem like it was saying that kidnapping, molesting and abusing women is okay and 'sexy'. Cannot believe Netflix put this up."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "edyeduard331",
        "review_rating": "1",
        "review_title": "Waste of Time",
        "review_detailed_main": "Waste of Time. A stupid movie... No logic Boring... Very boring"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "gregoryheringer",
        "review_rating": "1",
        "review_title": "Nightmare! I made an account to give this movie a bad review!",
        "review_detailed_main": "It's embarrassing how they try to make people sympathise with a sociopath and think it's totally okay to kidnap and harass someone until they fall in love with you. Not to mention the idea that you can do whatever you want with a woman that's tied up, if you THINK she likes it. The worst movie I've ever seen in my life. The dialogues between the main characters are unbelievably cringy and the plot literally doesn't make any sense. Don't watch this movie unless you wanna waste 2 hours of your life"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "medha-43184",
        "review_rating": "1",
        "review_title": "Why why why",
        "review_detailed_main": "Why this is on number 1 on Netflix... Who approved this movie ?!?!?!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "couchpotato2k",
        "review_rating": "1",
        "review_title": "The film that redeems Pornhub",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "50 shades of Beauty and the Beast",
        "review_detailed_main": "The movie got quite infamous - I think it was in the top 10 in many countries, because of ... word of mouth. Though mouths are being used for things here, that will be quite appalling to some. You don't even have to be a prude to feel this goes a bit too far. This is quite the understatement to be honest, because it is quite explicit.\n\nWhile I didn't freeze frame, you can clearly see a (plastic) penis in many shots. So if that already is shocking and feels a bit too much ... maybe this isn't for you. The shock value aside though, because while most already have mentioned and are aware of the 50 shades of grey connection, many have not mentioned or connected this with the Beauty and the Beast story. It is there, even the time frame, how long she has to fall in love and all that. There is no witch with a curse, but there is an inciting incident at the beginning of the movie, that completely breaks our character.\n\nThis broken strong man (alpha male) type thing draws a certain female fantasy and type in. So while I think a lot are unfair to demean this because of its story, the real flaws lie in the script and the very weak performances. As a mixture of two movies this is fine actually. If the script would have had some tweaks to it, I might even have considered it better than 50 shades (you can hate me now), especially because of the B&B injection - and because it actually dares to go some extra miles (didn't even have to be as explicit).\n\nSo in conclusion, not your typical love story in any stretch of the imagination (and not much imagination needed anyway) ..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "uneek_ro",
        "review_rating": "1",
        "review_title": "Desaster! Burn it!",
        "review_detailed_main": "Excellent lighting, they worked hard for a piece of &/&@ movie like this...must he banned and burned for eternity...the worst movie i ever encountered in my life."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "filmfluxtube",
        "review_rating": "1",
        "review_title": "Who is this movie for?",
        "review_detailed_main": "This movie would be laughably funny if it didn't have such a troubling portrayal of women. The movie makes many poor, questionable decisions, but the thing I can't stop asking is: who is this movie for? If it is for women, how can they overlook so much of the movie's actions and plot? If it is for men, why the scenes with the shopping and spa days? If it is erotica, why does it seem to hate sexual acts so much?\n\nI guess the movie is not for me, which is why I have such trouble understanding its intended audience. Which, overseas, was troubling vast."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "singlwhitefemale-45567",
        "review_rating": "10",
        "review_title": "What happens in tunnel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "davidfassbender",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Never saw a trash Movie like this. Music very Bad. Camera very Bad. Actors very bad. Spend 2 hours of my life...."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "GDS7410",
        "review_rating": "1",
        "review_title": "Cheap eroticism. Avoid it at all costs!",
        "review_detailed_main": "A glorification of violence and manipulation in a \"couple\", the worst of all is that it is presented under a false romanticism plus the luxury and physicality of the criminal and sexual offender."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Sir_AmirSyarif",
        "review_rating": "2",
        "review_title": "We're all owe apologies to Dakota Johnson and Jamie Dornan",
        "review_detailed_main": "One star for the movie's generous amount of pretty fun unintentionally comical sex scenes. And Michele Morrone please stop singing."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "rileylaw-45062",
        "review_rating": "1",
        "review_title": "Is this some sort of joke?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dinahm-54120",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": "Worst Movie I have ever seen.. events are cliche.. bad acting.. silly dialog"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "colleenwendland",
        "review_rating": "1",
        "review_title": "Raunchy for my taste",
        "review_detailed_main": "Um can we say an Italian Fifty Shades Of Greyish. Except it's a controlling mafia boss . Not a controlling businessman like Christian Grey . But if you're into that sort of thing , than have fun watching"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "SirDipjol",
        "review_rating": "1",
        "review_title": "We all know why we clicked the title...",
        "review_detailed_main": "The movie was so bad...after 5 minutes of watching it. I had to resort to other way to 'release'."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "365 Days",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "randomness-96",
        "review_rating": "10",
        "review_title": "Oh my gosh!",
        "review_detailed_main": "I.. I.. I don't know what to say.. the ending.. wow.. even though the movie mostly were in a different language I absolutely loved it! It was exciting, funny and extremely hot! I just can't get over the ending.. my emotions are running wild.\n\nThis movie deserves a watch definitely!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lauradora-17660",
        "review_rating": "7",
        "review_title": "Better than 50 Shade of Grey",
        "review_detailed_main": "I don't understand why it has such low reviews... The movie was good they could have added a lot more to the plot regardless the passion was there, if you like romance novels you will like this film..... it's much much better than 50 shades of grey!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "bshaef",
        "review_rating": "2",
        "review_title": "I've Seen a Lot of Dumb Shows",
        "review_detailed_main": "In my life and this one comes pretty close to taking the cake. No story until the last minute, terrible acting, \"erotic\" scenes that made me laugh, weak dialog and in general hands down an awful show. Netflix must have got a huge discount on the purchase price or the director had a nocturnal emission when plotting the show. Scenery was nice though and a better actor than any of the cast. Chalk up a couple of wasted hours on Sunday afternoon. Lots of oral sex, if you're interested in that sort of thing but it was funny instead of erotic."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "soundstormmusic",
        "review_rating": "1",
        "review_title": "Toxic Masculinity at its finest",
        "review_detailed_main": "This movie shows why a lot of movies from the 60s feel wrong.\n\nTreating a woman like an object is just...not sexy. This panders to the 'I wish we could go back to the 60s'-crowd, where women were fulltime moms and rights were mostly reserved to white people (I write this a white man fyi).\n\nAll I can say is; yes dominating someone can be sexy. But not if the dominator is also your kidnapper, who wants you to fall in love with him and keeps you there for a year. Stockholm Syndrome anyone?\n\nBesides these horrible decisions, the movie itself makes it even worse. Inconsistent shots where you're wondering where you're going because the editing is so bad you kind of go 'oh ok, apparently the previous scene was done?'.\n\nHorrible acting. The story itself sucks big time. It's just in general confusing but also tedious and filled with cliches. Big dominant rich man, weak frail woman, woman likes shopping, man and woman likes party. Rich, bling, nice island. God it's so dull.\n\nI think this has been the first movie I've watched where there are literally no redeeming factors. Just don't watch it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Dominic_Speight",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "This movie was the absolute pits. Avoid at your peril"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "thefuriousonion",
        "review_rating": "1",
        "review_title": "50 Shades of Garbage written by middle schoolers?",
        "review_detailed_main": "That's pretty much what this dumpster fire of a \"film\" is. Horrible acting, ridiculous dialog, and the most offensive to intelligence \"romance\" ever concocted. Twilight is a damn masterpiece of romance writing compared to this."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "karloshamza",
        "review_rating": "1",
        "review_title": "The worst movie I ever watched",
        "review_detailed_main": "The whole film is full with pornography and sadism.\n\nThere's no story no dialogue acters have no talent they're just got s*x evry single minute.\n\nI do really give this stupid movie 0/10."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "arman_j0088",
        "review_rating": "1",
        "review_title": "Very Bad 👎",
        "review_detailed_main": "This movie has no point. Very unrealistic to the point that I had to fast forward some parts."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sia-39201",
        "review_rating": "1",
        "review_title": "Really?",
        "review_detailed_main": "The point of this movie was?\n\nI genuinely never watched something this bad. Forced dialogue. Lack of storytelling and bad acting.\n\nThere is literally nothing that you take out of this movie other then a strange feeling that you want to go and get a therapist.\n\nOn the other hand I can see that they tired to do something with the cinematography but other then that this movie is one of those movies that are so bad that they are good."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "pagoni-gosia",
        "review_rating": "1",
        "review_title": "At the beginning I put 3 stars, but when I finished I put 1",
        "review_detailed_main": "Irrelevant, stupid story, nothing stick there. How these main characters even got married, not having even one serious dialogue??\n\nHow did it end it cherry on the top of cake.👎🏼"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Fafi165",
        "review_rating": "10",
        "review_title": "So sensual",
        "review_detailed_main": "This movie was way better than Fifty Shades of Grey It's so intense so loving so sexy the actors had chemistry Fifty Shades of Grey had no chemistry it was just that people read the book and just follows along with the movie that was it This movie was spontaneous"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "delores052",
        "review_rating": "6",
        "review_title": "Enjoyed",
        "review_detailed_main": "This is erotica. As a woman who has read her share of romance books and a few romance movies,I know what I like and what I don't. Granted the dialogue was bad. Scenery was gorgeous. Acting was great in some scenes and aweful in others . Bottom line was the movie was basically good for me. If I understood Polish ,it would have been loads better."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "koatprdns",
        "review_rating": "1",
        "review_title": "Giving the BOTD-",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "brochia",
        "review_rating": "1",
        "review_title": "What the???",
        "review_detailed_main": "This what happens when you take soft porn and give it a real budget. I can't believe some of the things I saw just in the first 30 minutes! I'm no prude but a needed warning before watching this. Hide the kids, Lol"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ebrahimpourfateme",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Don't waste your time watching this movie. The movie didn't have a real subject. The movie had a weak script. In my opinion, the only good part of the movie was their house.😶"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "leviathan-1922",
        "review_rating": "2",
        "review_title": "Unromantic and Unearned",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lauralessimason",
        "review_rating": "1",
        "review_title": "The 1 star beaches they killed off Laura",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "laurajacobs13",
        "review_rating": "2",
        "review_title": "Horrible",
        "review_detailed_main": "Worst acting skills i've seen in a long time Plot didn't make sense. Severe case of stockholm syndrome?\n\n#metoo isn't known in the whole world However.... made me hot a few times.. hahaha."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "christofferwarga",
        "review_rating": "1",
        "review_title": "This movie is so bad",
        "review_detailed_main": "This is the most boring film I have seen all year so far. I found myself constantly checking how much time is left. The plot takes such a backseat that I honestly don't know what exactly happened except that the guy kidnaps the girl and en time passes. And it doesn't say how much time has passed and for a movie that claims It's supposed to be 365 days a really want to know how much time has passed has it been a week a month a year."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ingridxxxxxx",
        "review_rating": "3",
        "review_title": "Good concept, but terrible execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "leneeterblanche",
        "review_rating": "10",
        "review_title": "So bad it's good",
        "review_detailed_main": "If you like to make fun of bad movies, this is it for you."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "spmahabier",
        "review_rating": "7",
        "review_title": "How mature R U really? Nice movie - I want 2 see more...",
        "review_detailed_main": "Beautiful location, good looking people. But if your a youngster or a prude or don't like to much skin in movies, this is not for you. Also viewers with specific past traumas should think twice to prevent triggers.... but isn't that the case with every movie?\n\nTry to look beyond the basic storyline and appreciate this genre for what it is, it's erotica and it's about time there is more tasteful eye candy like this in this world. I personally am glad that these films are being made. Even when it's met with so much criticism - that is always to be expected because it's one step closer to more fysical, visual and mental freedom.\n\nKeep it light. It's a Great movie for a girls night... and not made for heavy discussions. The kidnapping storyline is not new - and often used in other genres. This time it's used for creating intimacy. And there is no force in de ssc - safe / sane and consensual intimate acts that are the basis for the developing relationship. And keep in mind there are a lot of fantasies about being whisked away by a handsome stranger who lives in the lap of luxury and who wants to woo his love intrest. And that is wat this is - a fantasy... wich you are watching as a voyeur. Real life is cruel enough, so these fantasies story's have a place to exist on it own as guilty pleasures.\n\nAbout the critics... in the horror genre are more shocking visuals and worse storylines. But everyone knows what they are going to watch. So is it with this story. Don't hate what you can expect is coming. The haters don't appreciate the effort en artistry that has been put in this movie. And that is the only valid parallel with 50 Shades - what had a virgin and a beautiful control freak. This is about a handsome bad boy and a strong girl. So I prefer this storyline more..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "blazesuncaster",
        "review_rating": "1",
        "review_title": "Lol",
        "review_detailed_main": "I feel stupid even writing a review about it, so basically. Sex, sex, sex, and more sex."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "issypilon",
        "review_rating": "1",
        "review_title": "cringe",
        "review_detailed_main": "Whoever wrote this has read way too many wattpad fan fictions."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "georgakisester",
        "review_rating": "1",
        "review_title": "Poor Story - poor acting",
        "review_detailed_main": "I had to read subtitles to understand massimo in english! everything was on a low level. A waste of my time this movie. No good story, the acting was a desaster and the language as bad as the movie itself - including polish actors who spoke such a poor italian that i wanted to cry! its not enough to have two good looking actors for a movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "karanjdhv-37323",
        "review_rating": "1",
        "review_title": "Skip it!",
        "review_detailed_main": "The plot is very much boring. Casting was great. Decent attempt made from both the leads in the acting department. Supporting cast did not have much to blossom in this awful story line. The story goes down with the women being kidnapped and forced to fall in love. Overall don't waste time on this one."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mariapianapoletano",
        "review_rating": "1",
        "review_title": "Wrong wrong wrong",
        "review_detailed_main": "This is wrong on so many levels. Misogynist, badly written, badly acted..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ali-79-997033",
        "review_rating": "1",
        "review_title": "Po*nflix..... Really?",
        "review_detailed_main": "I am sure there is no quality parameters on Netflix.... C class garbage erotica movie... No plot, zero acting a movie without a director..... Such a shame...."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "kirilp",
        "review_rating": "1",
        "review_title": "No words",
        "review_detailed_main": "I can't believe this ridiculousness popped as n1 movie in my country. Does it mean most of the people are complete morons? Sad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "idawalle",
        "review_rating": "1",
        "review_title": "Total, absolute garbage",
        "review_detailed_main": "I seriously wanna cry of the fact that i used two hours of my life to watch this movie. I am at lost for words at this point. The whole movie seems like some kind of joke and i can not believe its ranked as number one in my country's Netflix. Don't waste two hours of Your life watching this, go do Something fun instead!! Even watching the grass grow is better than this..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "yumiko-26188",
        "review_rating": "9",
        "review_title": "Actually Enjoyed it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Horror_Flick_Fanatic",
        "review_rating": "6",
        "review_title": "Fifty Shades of Grey, Italian Wise-Guy style.",
        "review_detailed_main": "Watch out Pornhub, Netflix is moving on to your turf. 365 din (2020) is essentially a Fifty Shades of Grey story re-imagined as an Italian Mafia erotica film. Lots of sex in different positions and fancy location like a typical paperback romance novella. It's rated R for the ample showing of boobs, but not quite NC-17.\n\nIt doesn't have much of a story to be completely honest. It is mostly erotica so comparing it against any other soft-porn film will make it fare badly. The top boss gets wacked almost taking the bosses' son along with him. But son takes over the family business and becomes obsessed with a very pretty Polish girl.\n\nNo mob business ever gets conducted in the film so don't expect a Martin Scorsese mob drama. It's mostly an eye-candy romance with good looking actors but little acting skill. Watch it as a fun movie without great expectations. I am not going to rate it a 1/10 even though I can see why some would. I enjoyed the eye candy.\n\nIf the poster interest you and you want to watch some eye-candy, its not bad. But if you are looking for a serious drama, fugetaboutit capiche?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "theredsky",
        "review_rating": "1",
        "review_title": "365 Days Review",
        "review_detailed_main": "The fact that this film tries to morally justify people kidnapping others and forcing them to fall in love with them automatically gives this film a low score. It's pathetic, dumb, and idiotic. Every other aspect of the film just continues to lower and lower the score. This is the most boring film I have seen all year so far. I found myself constantly checking how much time is left. It's so boring because the story takes a backseat to the sex scenes which in themselves are poorly shot, undeserved, and cringy. The plot takes such a backseat that I honestly don't know what exactly happened except that the guy kidnaps the girl and that's it. The performances are fine but the actors have nothing to work with. Every other aspect such as the cinematography, editing, and musical score is incredibly bland. Avoid this at all costs no matter what you hear."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "felipebetancourt",
        "review_rating": "1",
        "review_title": "Totally waste of time",
        "review_detailed_main": "I have to change it 20 minutes later, I can't believe Netflix allows such a bad quality films in their platform."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "emu81684",
        "review_rating": "1",
        "review_title": "Just Watch Kennie JD Instead",
        "review_detailed_main": "I watch her joke about terrible movies and when she has a new one out, I'll usually check the movie out, too, just to see how bad. Man... this movie is a class all it's own. I get what they were trying to do, and if you take the actual plot out of the sexy scenes, they can be kinda hot, but the reality makes them terrible.\n\nIt's another one of those story lines that just pushes the dominant alpha male a little too far, to the point where -rationally- the female lead should run away and call the police. Just save yourself the time and energy."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sismagilova",
        "review_rating": "1",
        "review_title": "Theres nothing good about this",
        "review_detailed_main": "All the low ratings are the truth. Idk what terrible taste in movies makes some of you think this is good. Just watch some adult content online instead..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "groparu_S",
        "review_rating": "1",
        "review_title": "Stopped watching at half",
        "review_detailed_main": "Netflix pls take it down. I rather run 10 km than wathing the other half..and I hate running😂"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "BenT17",
        "review_rating": "1",
        "review_title": "The worst movie ever made.",
        "review_detailed_main": "This film is utterly degrading, pathetic, and offensive. It's shocking a movie this backwards and twisted was ever able to get made, let alone released. Netflix should be ashamed of themselves as well as anyone who was involved in the making of this travesty. The fact that this got to number 1 makes me sick. This movie is sickening. The worst movie ever made, I'd rather watch \"The Room\" a million times."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "muresanuvladm",
        "review_rating": "1",
        "review_title": "It's really bad ...",
        "review_detailed_main": "Please don't waste your time. This movie is absolutely terrible."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ayatullahrabea",
        "review_rating": "1",
        "review_title": "A waste of time",
        "review_detailed_main": "I just lost 2 hours of my life for nothing. A bad version of fifty shades of gray."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "charlotte1284ep",
        "review_rating": "10",
        "review_title": "Loved it!",
        "review_detailed_main": "Way better than Shades of Grey. Not the deepest plot but very hot."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ashantz",
        "review_rating": "6",
        "review_title": "Its OKAY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sharnelperera",
        "review_rating": "1",
        "review_title": "1 hr 54 mins of your time you'll never get back",
        "review_detailed_main": "I don't even know where to start. There are obvious parallels between this film and the Fifty Shades of Grey trilogy, but 365 Days makes the Fifty Shades movies seem like Oscar-winning, cinematic genius. Yes 365 Days is that bad. Even if you're able to look past the film trying to pass rape and sexual assualt as 'romance', or the portrayal of women as mindless, gold-digging bimbos, or the painfully stereotypical hot Italian gangster, it's hard to look past the terrible acting, plot, and ending. This film is equivalent to a car crash, but let's face it. No one is watching this for the story."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "thedodgerdogg",
        "review_rating": "1",
        "review_title": "I will never get these 2 hours back",
        "review_detailed_main": "What did I just watch? I seriously feel like 2 hours of my life was stolen from me. Horrible ending. What was Netflix thinking?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "souza-92032",
        "review_rating": "1",
        "review_title": "I actually created a profile just so i could review this",
        "review_detailed_main": "This is the worst piece of s@#$ movie i have EVER watched in my entire life. I swear i have seen better plots and storyline in a Brazzers production"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "a29575710",
        "review_rating": "1",
        "review_title": "Really Really Bad",
        "review_detailed_main": "This may be the worst movie this year. Bad script. It's just some random porn."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "artemis_xoxo",
        "review_rating": "1",
        "review_title": "Made me vomit",
        "review_detailed_main": "This is honestly so disgusting. do NOT watch this movie"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "choueiri101",
        "review_rating": "1",
        "review_title": "Watching paint dry is 'wow' in comparison",
        "review_detailed_main": "I would have settled for just a pointless movie but this, this movie provided so much levels of horrible.\n\n'Are you lost baby girl'? So bloody stupid.\n\nThe acting was simply horrible, the script beyond pointless, editing awful and the sex scenes are comical.\n\nNo normal victim would act this way.\n\nAvoid this train wreck."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ayubnor-89685",
        "review_rating": "1",
        "review_title": "Bleached my eyes",
        "review_detailed_main": "There are truly horrendous films out there, and in terms of 365 Days, it's already up that alley. This was on Netflix's top 10 charts for most of the summer in 2020, and good lord did I regret every minute. To sum it up shortly, 365 Days is pretty much a two-hour long Brazzers video that is fueled by horrendous acting, a story that makes zero sense, and a soundtrack that is ungodly annoying. Truly a disgrace to Polish cinema."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "X-darkness",
        "review_rating": "1",
        "review_title": "Boooring movie",
        "review_detailed_main": "If i can vot with no star star at all i wil do it Wast of time On of the wort movie i ever seen in my life"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "qixip",
        "review_rating": "10",
        "review_title": "Proof of Why Rest of The World Should Not Follow Hollywood Policies",
        "review_detailed_main": "This movie is a true erotica. Barbara Bialowas as a female director choose to not censor sex and nudity when story needs them, what Hollywood has shied away in last few years. This genre is so rare in past decades and audience were so thirsty for it, that 365dni was trending all over US social media when it released on the online streaming services, all major European newspapers had articles about this movie. How many polish movies got this kind of attention? If your are someone who gets offended by watching two attractive, beautiful actors get naked and perform sex scenes on screen, it would not be a problem for you to find an American alternative in last ten years; Hollywood movies which pretend sex does not exist, actors whom keep their clothes on for a sex scene or directors who have to shoot actors in a way that audience wouldn't be able to see anything during love scenes. I would like to congratulate all cast and crew on this success, especially Barbara Bialowas for her courage as an emerging, young director who didn't let restrictions ruin her movie. Although she has to improve in future projects but she managed to make one of the most successful polish movies."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "boothjacquie",
        "review_rating": "6",
        "review_title": "Very Sexy Movie",
        "review_detailed_main": "A very sexy movie - REALLY enjoyed watching the extraordinarily gorgeous actors & scenery. The script could be stronger & the sex scenes are pretty much soft porn (& VERY steamy), but I enjoyed watching this movie nonetheless. The lead actors are GORGEOUS - I would watch them in anything! Loved the wardrobe, styling & location scenery. Storyline revolves heavily around sex, so I didn't feel the lengthy sex scenes were gratuitous. On par with 9 1/2 Weeks. A great date movie. Not sure why the reviews are so bad - worth watching."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Reinvented04",
        "review_rating": "1",
        "review_title": "Worst Movie I've ever SEEN!",
        "review_detailed_main": "I wish I could rate -10.... terrible acting, terrible movie, I wasted my time but luckily the fast forward button exist...."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ewie1995",
        "review_rating": "1",
        "review_title": "Have people lost their mind!?",
        "review_detailed_main": "This is the worst movie I have ever watched. I can't believe there will be a sequel. HOW do people find this movie great!? This is absolute garbage."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "charlinejansen",
        "review_rating": "1",
        "review_title": "CHEAP KNOCK-OFF of fifty shades of grey",
        "review_detailed_main": "This is by far the most cringy movie I have ever watched.\n\nThe casting is waaaaaay off, just plain terrible. These are the worst actors i have ever seen, no one would act like that in real life.\n\nThe combination of Polish, Italian and English is giving me a Headache.\n\nI have watched alot of erotic drama movies and this is by far the worst. I feel like I am watching a home-made movie for a bizarre schoolproject??\n\nI don't get the good reviews here, must be paid for cause it's IMPOSSIBLE someone didn't cringe while watching this. Especially the \"baby girl-line\" its hilarious.\n\nI wish I could get that hour of my life back."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "TheVictoriousV",
        "review_rating": "1",
        "review_title": "We've all learned absolutely nothing",
        "review_detailed_main": "I was given an offer I couldn't refuse when my littlest brother \"pitched\" 365 Days, insisting that the Fifty Shades of Grey films will seem \"f-cking amazing\" by comparison. You can't achieve this, I thought, unless satirizing the format, but even if the film in question is laughable, that is because it's entirely serious.\n\nI could end things here if I were more dismissive of inept cinema. The thing is, though, that movies like 365 Days are of greater psychoanalytical interest than most media, especially in the climate that surrounds contemporary courtship and that which men are said to be collectively guilty of. Much like the Fifty Shades trilogy, this is a movie I desperately need to see remade.\n\nWhy would I want to see this movie again, you ask? It's very simple. It is because this film, like Fifty Shades, does have a fanbase, and I am so endlessly curious as to how these people (mostly female, middle-aged, and amidst various crises) respond to the material if we pull a Michael Haneke and remake these movies exactly the same way - scene-for-scene, shot-for-shot, each inane line left intact - except the powerful, dominant male of the central romance is replaced by a Kevin Spacey or a Harvey Weinstein analog; a closer resemblance to how these scenarios may pan out in reality.\n\nHow would the fangirls feel about this kind of story, in terms of its purported sexiness and mystique, if it better resembled the real-life counterpart? Better yet, would it turn a knob in their brains that finally made them look inward and think about what this signals to the abusers of the world?\n\nWhat exactly are they communicating with their love toward this kinda content? What does it look like they're into? If they want to improve/change the way that men are societally taught to approach women, is it easier for them to understand how \"I want my own Christian Grey or Massimo\" isn't helping if we show them what Christian Greys and Massimos actually look like (and where they can find them, if they're serious in their pursuit)? Is the present state of things, I query with complete honesty, squarely on the dick-owners?\n\nI think I got ahead of myself by asking these questions straight away. Who exactly is this Massimo? Well, he's a Sicilian mafioso (played, fortunately, by a photogenic hunk named Michele Morrone) who abducts an unwitting Anna-Maria Sieklucka and explains that she must fall for him within 365 days if she is to regain freedom.\n\nEssentially, some Polish author gravely misunderstood Beauty and the Beast and decided that something as nightmarish as this would be equivalent, plus the oh so daring sex scenes. The consolation is that Massimo agrees not to touch Laura, as the character is named, without clear consent. We all wish we could be imprisoned for months on end by someone so thoughtful. I've seen more romantic things in my stool.\n\nSo, is this indeed worse than Fifty Shades of Grey? On one hand, it is categorically more original than \"glorified Twilight Saga fan fiction\" and it may not be quite as dangerous as young women aren't as likely to go after mafia hunks as they are to end up in a Christian Grey scenario (albeit with more of a Weinstein type in the role). On the other hand, who has time to learn Polish?\n\nAnd before anyone starts: I get it. I get that we all have our weird fantasies that don't strictly adhere to what we desire for realsies (hence my terabytes worth of \"Bugs Bunny on Daffy\" fan-art don't prove my sincere dating preferences). I preemptively agree with your counter that \"this is just a movie, bro\". But sometimes it isn't \"just a movie\". Ask yourself whose fault that is."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "rmitchellwagner-17091",
        "review_rating": "1",
        "review_title": "Like WTF",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tashlast",
        "review_rating": "1",
        "review_title": "Stockholm Syndrome: The Movie",
        "review_detailed_main": "This movie is like if The Godfather, Beauty and the Beast, Twilight, The Room, and Fifty Shades of Grey had sex and the result was this demonic abomimation of a love-child that none of them would own up to.\n\nThe only reason this movie is labeled as a \"romance\" and not a horror is because the guy is hot and even that is extremely offensive. So just because the guy is hot that gives them an excuse to force a person against their will to fall in love with them? Disgusting. Is this what we're trying to teach people today? That stalking and harassing people is the best way to enter a relationship? This Massimo character has all of the appeal of Harvey Weinstein and Ted Bundy in one. It's creepy but true. He makes Christian Grey from Fifty Shades lool like a good boyfriend. That is NOT good. I felt my soul die everytime he said \"Are you lost baby gUrL?\"\n\nNetflix needs to just stop with these Wattpad fanfiction stories. They're AWFUL! Stop giving such a high platform to contrived films that romanticize unhealthy relationships. I hate how this is still on Netflix on it's top 10 list as of July 2020. I don't even know what to say anymore..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "farrelljustin",
        "review_rating": "1",
        "review_title": "Arguably the worst movie ever made.",
        "review_detailed_main": "Bad acting. Terrible writing. Awful directing. From beginning to end, this movie is completely insufferable. It's not a stretch to say this could literally be the worst movie ever made. A documentary about dog excrement would be far more entertaining and interesting."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dogonlion",
        "review_rating": "1",
        "review_title": "Really bad!",
        "review_detailed_main": "\"That's why I'm giving you a chance to fall in love with me\". \"I'm not used to tolerating disobediance\". If these lines don't scare you, Try watching this movie. It's obviously written by a meat head who thinks it's the year 1565 and talks to the woman he kidnapped like a slave. Music is bad. The acting is bad. Why am I wasting my time writing this? it's not worth it. THE WORST!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "samanthamason-92848",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "I NEED TO KNOW IF THERE IS A SECOND ONE. The ending was so amazing! I hate it when movies leave off like that though."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "LuckyCharms128",
        "review_rating": "6",
        "review_title": "Ignore the bad reviews",
        "review_detailed_main": "You have to take this movie for what it is - erotica. For that genre it's very well done in terms of cinematography and music. I didn't go into the movie expecting some amazing storyline, so I wasn't disappointed. 6/10 stars, its not that bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ltzand-38614",
        "review_rating": "1",
        "review_title": "OH EM GEE!",
        "review_detailed_main": "I think I have another 30 years in me, but I can say with confidence that I have seen the worst movie of my life!!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dgtracker",
        "review_rating": "1",
        "review_title": "Stupid Don't waste your time watching",
        "review_detailed_main": "I tried a couple of times to watch this and to give it a fair shake I made myself watch it to the end because of the people on here that gave it good reviews . Again don't waste your time as I did. I think to how do you get any good Sub-Titles when you are bouncing from three different languages to understand the movie. I love a good foreign film but this is ridiculous."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "adabbutterfly",
        "review_rating": "1",
        "review_title": "Worst acting ever",
        "review_detailed_main": "I star actor was somewhat ok with the acting but the actress and more of the cast were like watching people gathered from the streets trying to play actors for a day, its a pale move copy from 9 and a half weeks, fiffty shades and some mafia movie splashed in one a bad bad one... I dont get how people like it yes the lighting, the location are good but the acting is sooooo bad that if you like good movies this movie is not for you"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "colewaters",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "What the heck did I just watch? This is probably one of the worst movies ever created. It made no sense and there was no purpose for it to even to be made."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ElMaruecan82",
        "review_rating": "3",
        "review_title": "What Massimo wants, Massimo gets...",
        "review_detailed_main": "The extraordinary bodies of Michele Morrone and Anna Maria Sieklucka are perhaps the only forces that drive the ludicrous and somewhat silly \"365 Days\", the Polish production that generated such a hot buzz it ended in the Top 10 Netflix to-watch films.\n\nI confess my male crush: the man, Massimo, is a towering and tanned Latin hunk with finely-traced abs and looks like he's always posing for a Giorgio Armani ad, the woman, Laura, has the kind of gorgeous face and tantalizing body that provoke an immediate urge for possession. Only a fool would have a woman like Laura and make no effort to keep her... only a fool woman wouldn't surrender to Massimo's charm.\n\nBut only a fool script would have a man like Massimo kidnap a woman like Laura and sequestrate her in a heavenly remote island and give her 365 days to love him... in fact, only a fool script would have Massimo say \"you have 365 days\" whoever says \"365 days?\" isn't saying \"one year\" a simpler formulation? What if it's a bissextile year (like 2020), are you willing to sacrifice the possibility to have her love you at the last minute? Or is \"365 days\" only a figure of speech and Massimo knew damn well it wouldn't take so long? Anyway, when he said \"365 days\" I could swear I head the voice from \"CinemaSins\" saying \"Title Drop\".\n\nSo Massimo takes Laura in his dungeon of wealth, luxuriance and... weird sexual practices, he promises not to hurt her, to let her go shopping but she's his prisoner before becoming his lover. All we know about the two is that Massimo is some kind of Mafia member who instantly fell in love with Laura and Laura is a tough businesswoman with a husband who doesn't know how lucky he is. Massimo had his father killed in front of him and Laura is in need. Massimo as a man of possession and Laura as a woman in desire of possession.\n\nThe expositional part goes even further, it also shows Massimo forcing a flight attendant to make him happy, she's reluctant at first but at the end, she's smiling. What we have in that scene is the film in microcosm, Massimo is the new Leo, what we want, he gets, and apparently, the director is stingy on shocking moments that would normally be followed by instant uproars and calls for censorhip in these post-Weinstein days. Seems that the confinement context helped a little. The problem with \"365 Days\" is that the film tries too hard to make a sensation: so many scenes are filled with useless pop music that we're not left one instant with an opportunity to get into the depths of these characters, basically, they're all characterized by their needs.\n\nIt's a sort of psychological arm-wrestling that would be fine if the film wasn't just going up and down between moments where both go along and others where violence ensues. The film intelligently avoids the point of no return, Massimo never treats Laura like the fligth attendant but then again, it doesn't play fair with its own premise. If days are numbered, how come we never know how many days have passed? How come Laura seems quickly aroused by Massimo? Why couldn't she go through the different stages: fear, anger, hunger strikes, you know the drift.\n\nThe reason is because the film's sole purpose is to show sex scenes as heated and torrid as the sun we were missing during the confinement, I guess people were in need of that. The film doesn't care much for the feelings as long as they can be expressed within the spectrum of sexual desire: anger is physical need, defiance is sexual tension, gentlness is a preliminary, joy is orgasm etc. What's left at the end is something silly but also unpleasant in the sense that we never exactly understand why Laura surrenders to Massimo: is it Stockholm syndrome? Is it his looks? Or is it because he's stinking rich?\n\nBut I dare not torture myself with such questions because ultimately, it unveils the biggest flaw of the film which is the premise. Was Laura that hard to get to begin with? Couldn't Massimo just attract her attention? Court her? Didn't he have enough to offer instead of entrapping her in his gilded cage? Did it have to be so damn complicated? Laura was already an unsatisfied wife... The 'kidnapping' part doesn't work because it's a wrong premise but because it's treated like a gimmick, a word to put on the summary and allow the film to have its little edge other over soft core productions, this is what it's all about, and when it culminates with the long-awaited sex scene, I was aroused but didn't feel rewarde I thought \"it was about time\".\n\nIf you take off the sex material and the awful pop music, there's nothing left from the film... it's dry empty... but near the end the film got more interesting, Laura was given back her freedom and went to her home and met Massimo again, she confronted him, threw her anger at him and then I was following the scene with full attention, finally, a scene with depth, with true emotions, something totally unrelated to body fluids but no it had to switch to a sort of angry sex scene with (you get it) an awful pop music... that's when I abandoned any hope for this film.\n\nI take \"365 Days\" at face value as a little more elaborate soft core film with a silly script, and two gorgeous bodies... a wannabe \"Fifty Shades of Grey\", which isn't saying much."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sylvia_no",
        "review_rating": "2",
        "review_title": "Tone deaf",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "shamantank",
        "review_rating": "1",
        "review_title": "Great way to waste 2 hours of your life",
        "review_detailed_main": "My god this movie is bad. the plot is bad the dialog is bad and the HOT parts of the movie are bad. I wish my wife and I saw a better movie than she and we were excited to see a steamy movie but nope it was just a drag to watch from begging to end."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "walkingbass-87419",
        "review_rating": "1",
        "review_title": "dumb",
        "review_detailed_main": "Should be takendown from Netflix. What else could I say?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "angeliquedecock",
        "review_rating": "10",
        "review_title": "Why the bad reviews, I loved it !",
        "review_detailed_main": "This movie does not get enough credit.\n\nI loved it. A slightly darker 50 shades of Grey. The chemistry was sensational. One thing that is to be remarked. The accents are sometimes bad to hear. Don't think about the storyline. Just let the movie take you to the bedroom."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "MalfoyRocks1",
        "review_rating": "",
        "review_title": "Trashy Beach Romance Novel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "chelseapearson-45129",
        "review_rating": "7",
        "review_title": "Idk why this is so hated on?",
        "review_detailed_main": "Take it for what it is. A steamy foreign movie. I think it's great."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Ashley_Drebitko",
        "review_rating": "1",
        "review_title": "HOW DARE YOU!",
        "review_detailed_main": "My friends suggested this movie to me. I watched and READ this movie all the way through, on a emotional rollercoaster... FOR YOU TO END IT LIKE THAT!?!? Are you SERIOUS right now my guy!?! I'm BIG mad and sitting here crying real tears! UGH!!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "iriscasaca",
        "review_rating": "1",
        "review_title": "What Did I Just Whatch????",
        "review_detailed_main": "If you haven't seen this movie let me save you time it sucks and it's basically a movie about kidnapping, rape and stockholm syndrome"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "brunapet",
        "review_rating": "1",
        "review_title": "What the hell",
        "review_detailed_main": "Possibly the worst movie I've ever seen. So so bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jodiemoore-43898",
        "review_rating": "1",
        "review_title": "Romanticises rape, kidnap and abuse",
        "review_detailed_main": "He literally kidnaps her and through Stockholm syndrome she falls \"in love with him\" with an unhealthy amount of sexual assault"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "md-laurenzano",
        "review_rating": "1",
        "review_title": "Piece of Crap.",
        "review_detailed_main": "Mix a beautiful women with the worst interpretation ever in a film. Such very bad actors... the worst I've ever seen. The worst script ever, kind of sick. And you'll get 365 dni. Dont waste your time, Dont waste it. A Master Piece... of crap."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "emmahorner-58557",
        "review_rating": "1",
        "review_title": "Horrific. Not even a gorgeous mafia boss can save this.",
        "review_detailed_main": "Massimo is the best thing about this movie and that's just when he doesn't speak. Gorgeous but movie has zero plot, having read the book this is even worse. Soundtrack including his album also awful."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "diewahremail",
        "review_rating": "5",
        "review_title": "I'm not sure",
        "review_detailed_main": "The story is really kinda garbage but it's fun to watch(not because of the sex scenes) And I like the camerawork."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "MarieLouiseC",
        "review_rating": "1",
        "review_title": "What the hell, Baby girl...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sophiadet",
        "review_rating": "8",
        "review_title": "Good if you're not an over-thinker or a child.",
        "review_detailed_main": "Looks like this movie has been watched by a lot of immature people. Plot this, plot that ...! Don't watch it if you 're planning to compare it with other similar movies to begin with. That's NOT the right way to watch a movie. Come on! The actors look good, the accents are good, styling is good. Some disturbing scenes of ''violence'' but other than that: Good 2h entertainment! People giving it 1 star because it's ''too sexual\" ... are you joking ? Don't watch this genre and get over yourselves."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "melissabernasconi",
        "review_rating": "6",
        "review_title": "People are taking this film too seriously",
        "review_detailed_main": "Enjoy it for what it is, if your expectations are low then I think you'll enjoy this move for what it is."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "zoebaggins",
        "review_rating": "1",
        "review_title": "Wow.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "nuicaroger",
        "review_rating": "1",
        "review_title": "One of The movies that should never have existed",
        "review_detailed_main": "The worst movie of that year. The plot makes no sense, the dialogues exist just because the movie needed the actors to say something to each other, but the female character is the worst, she is the embodiment of stupidness and her lack of character is impressive, she like a puppet, but worse than that. The movie is simply terrible, the only way to see this is with your girlfriend."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "seknekatarina",
        "review_rating": "1",
        "review_title": "-2/10",
        "review_detailed_main": "The way, how this movie presents woman's character in the society is digusting... the fact how shallow the plot is... i cannot believe that there are people out there who love thia."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "aagirlaz",
        "review_rating": "1",
        "review_title": "quite possibly the worst movie ive ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "prettimommee",
        "review_rating": "3",
        "review_title": "No just No",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "RichardVargasConita",
        "review_rating": "1",
        "review_title": "Horrible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "anboq",
        "review_rating": "3",
        "review_title": "We know what type of movie this is",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "candace-birger",
        "review_rating": "5",
        "review_title": "Hate to love it, love to hate it",
        "review_detailed_main": "Don't watch for a plot...or acting. Honestly, it's just fetish smut. Female lead never actually acts scared in her kidnap situation which is a bit aggravating. But the sex scenes are solid. I'd describe more of the movie but honestly, it's confusing and just garbled together in a melodramatic piece of cinematic trash."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "curtish2809",
        "review_rating": "8",
        "review_title": "It is what it is",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "davidlatics",
        "review_rating": "7",
        "review_title": "Meh!",
        "review_detailed_main": "My girlfriend suggested this and I wasn't particularly gripped at first but as the film went on, I got hooked. But very disappointed with the end."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "radovanovicana-33214",
        "review_rating": "1",
        "review_title": "I created an account to give this movie a bad review",
        "review_detailed_main": "Besides everything, that others already pointed out, is wrong with this movie, the biggest thing that bothers me is the fact, that movies like this are popular solely because people are shallow. The plot is considered \"sexy\" because Massimo is rich, good looking man in power, it would be a whole different genre if the man would be some poor, bad looking nobody. Movie like that would've been in the horror movie section.\n\nAlso shame on them for romanticising something as horrible as kidnapping!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "abintms",
        "review_rating": "1",
        "review_title": "Creep",
        "review_detailed_main": "What an idea ...forced to be loved ..... Only rich men can ...their world woman nothing? Bad movie I stopped at half.be careful watching completely imaginative no real."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "denis888",
        "review_rating": "1",
        "review_title": "Zero For This Abominable Horror",
        "review_detailed_main": "I like good Polish movies. I like serious Polish war dramas. But I cannot and will not in any way try in my sound mind to protect this piece of manure, which falls on several wrong plates - it romanticizes what cannot be so, it is flat, it acts poorly, the casting is awful, the tempo is all wrong-set, the main idea is as if scribbled by a teenage sex-hungry idiots who never saw real life... shall I go on?\n\nThis is a poor man's version of awful 50 Shades, and what can be achieved if you take a terrible movie and make it even worse?\n\nYou get this 365 Dni abomination that cracks and sizzles and fizzles and hisses and is torn at seams. Main actors act so bland that I can do it better... Erotic? Nay - all the wrong angles, sounds, cliches and laughable ideas are used here to no success.\n\nI used to teach a female teen who was in awe with 50 Shades, I guess she will puke at this flick.\n\nNever bother - it is a crime and a waste."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "anitafiacsko",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "This was the worst movie I saw in my life. Painful to watch. Don't waste your time. Plot twist was stupid, acting not so great. More like a porn movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "rere218",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "This movie had no plot or anything!!!!! Waste of time!! Do not recommend"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mulleraria",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "It is stupid stupid movie.. With awful acting. Selling/ famous for the same reason porn sells. Lucky for the makers it was released during a pandemic. So people just watch crap like this!!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "kdawnsutton",
        "review_rating": "1",
        "review_title": "What is wrong with you?",
        "review_detailed_main": "I find it extremely disturbing that Adults have watched this movie with their children! I read a review saying they watched this movie with a 9 year old. Then another review of a husband saying his fat wife doesn't do it for him anymore but this movie does.\n\nWhat the hell is wrong with you people?!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "nicolemartepintin",
        "review_rating": "3",
        "review_title": "Not really a movie",
        "review_detailed_main": "It's a porno for women. If you understand it that way then it gets a 10 cause it a pretty good porno especially for women like 50 shades. An alpha man gang leader who is also very rich and handsome that just kidnaps her and tells her he'll make her fall In love with him within a year. A hard working boss women who gets no satisfaction from her lazy cheating boyfriend tries to deny this dark character but eventually gives in. As a movie though it's laughable the plot is stupid and the filming is amateur. It's just not to be taken seriously."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "christinanicole-05768",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "Whoever said this movie was the worst is completely wrong it was amazing. There was however one problem, I hated the ending and the only way to fix it is to make a second movie because the first wasn't enough. More please"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "anileshsinghz-24234",
        "review_rating": "7",
        "review_title": "I Made A Account For Review This Movie.... And This Happened",
        "review_detailed_main": "I made a account for Review this movie. And opinion is this is the best adult movie i ever seen. This is a perfect adult movie. One thing i aspect little bit fight. But it's okay. If anyone prepare to watching this movie. My honest opinion it's going to your best adult movie because the lighting, the location and the Luxurious thing going to blow your mind."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "colacpa",
        "review_rating": "1",
        "review_title": "IGNOMINY",
        "review_detailed_main": "It's the worst movie I've ever seen in my entire life."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "otaibist",
        "review_rating": "1",
        "review_title": "Big joke",
        "review_detailed_main": "This is not a movie this is just a joke and it is not even good!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "rvdwalle",
        "review_rating": "1",
        "review_title": "Worse than a soft porn",
        "review_detailed_main": "Bad dialogues, unrealistic scenes, bad music, wanna be drama. Just a really really bad movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lauratabak",
        "review_rating": "1",
        "review_title": "In the Netherlands we would say \"2 uur kromme tenen\"",
        "review_detailed_main": "Did i really just throw 2 precious hours of my life away for this movie?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Bibiliography",
        "review_rating": "2",
        "review_title": "Hilariously cringe",
        "review_detailed_main": "I enjoy reading romance novels and I've read my share of captive/abducted/white slavery novels, and all I have to say is that this is complete- but watchable- garbage."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "marie-89570",
        "review_rating": "1",
        "review_title": "boring",
        "review_detailed_main": "Storyline: trash. Acting: trash. Script: trash. Everything was just so bad. I think it's embarrassing that i actually spent time watching this."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jackdheil",
        "review_rating": "1",
        "review_title": "The worst",
        "review_detailed_main": "The worst film I've ever seen. I don't understand how Netflix decided to distribute this film worldwide."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "thedarkandfallen",
        "review_rating": "3",
        "review_title": "The whole thing would have made a lot more sense if Massimo was a vampire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "fa211940",
        "review_rating": "10",
        "review_title": "New school of erotic thriller comes from Poland !",
        "review_detailed_main": "Splendid landscapes, glamour, romance, sex and suspense filmed in perfect HD. Honestly, that's really good entertainment. We want more !"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "icon-02083",
        "review_rating": "",
        "review_title": "Worst film ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "xteuntje",
        "review_rating": "7",
        "review_title": "Adjust your expectations, then it isn't as bad as the reviews suggest",
        "review_detailed_main": "Honestly it wasn't as bad as some of the reviews say, you just musn't think you'll be seeing an absolute masterpiece of realistic storylines. True, the chemistry between the two main characters could have been a bit better, but if ur looking for a movie with '50 shades' romance' this actually isn't that bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "daviisantos",
        "review_rating": "1",
        "review_title": "Unbelievable",
        "review_detailed_main": "I think people tend to overreact a little bit when they don't like a certain movie to the point of giving it an unfair rate. But I have to give this one a 1/10 because this is legitimately the worst movie I have ever seen. There is absolutely nothing good about it, so I can't even give it two stars. I would like to know what was the mind process of the people who thought it was actually a good idea to release this."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dennisdg",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Absolute and utter trash.\n\nThe fact that movies like this become so popular and is so celebrated sickens me. I actually don't understand what makes it so popular. It's essentially in both physical action and plot.\n\nOh, and let's not even talk about how kidnapping is being romanticized by those who \"wouldn't mind being kidnapped by a man that hot\".\n\nWaste. Of. Time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "hendgaberr",
        "review_rating": "1",
        "review_title": "Script written by a 14 years old girl.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lunaticmzm",
        "review_rating": "1",
        "review_title": "as bad as it gets",
        "review_detailed_main": "Worse than 50 shades of grey worse than cats maybe."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "x_narinka_x",
        "review_rating": "1",
        "review_title": "Worst movie I've seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "skihampa",
        "review_rating": "1",
        "review_title": "DONT WASTE YOUR TIME!",
        "review_detailed_main": "You're welcome in advance! I never review movies but this one I had to!!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Hawaiiangirl325",
        "review_rating": "1",
        "review_title": "I haven't cringed harder in 2020",
        "review_detailed_main": "This maybe the worst part of 2020 so far. Just horrible. Songs blow. Each scene is so choppy. Bottom line- garbage. Please Spare yourself from my mistakes."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tanyacamacho",
        "review_rating": "1",
        "review_title": "I made an account so that I could give this movie a bad review",
        "review_detailed_main": "This is actually the worst movie I have ever seen. The storyline doesn't make sense. The characters suck.\n\nThey continue to make terrible decisions after terrible decision. I read the plot for the rest of the book series and it only gets worse."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "af_blue",
        "review_rating": "10",
        "review_title": "Really people?",
        "review_detailed_main": "Don't understand the low reviews, must be a lot of prudes rating this. This movie does not really deserve a 10 but I gave it one to offset the BS low reviews, it's more like a 7-8 star rating. Way better than that boring movie 50 shades of dullness, that movie put me to sleep!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Marija_Putniene",
        "review_rating": "",
        "review_title": "soooooooooooooooooooooooooo BAD.........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "acfriedman1",
        "review_rating": "6",
        "review_title": "Kind of good",
        "review_detailed_main": "This is the second time I have been watching the movie. It is so bad but so good at the same time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ethelhannah",
        "review_rating": "1",
        "review_title": "Am l wasting my time?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "alaa-elshazly1",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Such a horrible movie , avoid wasting your time , one star for shooting"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "roxmewild",
        "review_rating": "1",
        "review_title": "Not a movie ! More a collection of porn clips",
        "review_detailed_main": "Seriously it was pretty obvious from the start that this had zero story and was basically a feeble attempt to pass a weak porn flick off into mainstream cinemas\n\nTo be honest 50 shades of Grey was a load of 💩 and this no different apart from the lead actor in this in my opinion was a lot better looking and sexier than the guy who played Christian Grey .\n\nIf you want to watch some free harmless sex scenes then you may enjoy what this flick has to offer ,however if you want to be entertained intellectually then forget it! Almost forgot to mention the very annoying pop music played almost right the way through this but then again they needed something to fill the gaps in lack of script I guess!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "newyorker-69964",
        "review_rating": "2",
        "review_title": "Netflix meets Skinamax",
        "review_detailed_main": "I think the actors were earnest in their roles. But they were just cast for beauty not acting talent. It's a light BDSM fantasy that seems uncomfortable in the #metoo movement.\n\nAt least it had a bit of a twist ending, and everyone is very pretty to look at."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dgbagiu",
        "review_rating": "1",
        "review_title": "Worst Movie Forever",
        "review_detailed_main": "Words don't do it justice. I stopped halfway since it was unwatchable."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "seronjaa-797-313124",
        "review_rating": "5",
        "review_title": "Better than 50 shades of grey",
        "review_detailed_main": "Yes, it's tacky, it's stupid, it's dumbed down and unrealistic. But at least it's sexy :D This is what you get, when you turn an erotic novel written from women to women into a movie. The acting is all right. The soundtrack is horribly loud and tacky. But you can just turn off your brain off for a while and enjoy the chemistry between the main actors. Still better than most rom-coms nowadays."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tongzhicheng",
        "review_rating": "1",
        "review_title": "Awful. One of worst film of all time!!!!!",
        "review_detailed_main": "Very bad. It's just a porn movie.no content no nothing whatsoever."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jon_navarro",
        "review_rating": "1",
        "review_title": "A Blatant Rip Off",
        "review_detailed_main": "All be in more stylized and fine tuned on its sexual exploration 365 is quite honestly the most blatant rip off of one off cinema's finest directors - Pedro Almodovar's \"Tie Me Up, Tie Me Down\". The film manages to mask some of this with homages to another erotic drama \"Fifty Shades of Grey\" however it's lack of substance and creative authenticity by part of the director is fully evident. If you're looking to get a quick pull & tug, by all means knock yourself out...but this film by no means manages to add anything new, exciting or imaginative to a genre that is rich with higher quality narratives which have already shown how this type of film should be done. If you'd like to see those, I suggest the following - Tie Me Up, Tie Me Down, Basic Instinct, Body Heat, Fatal Attraction, Single White Female. What mad Almodovar's film unique amongst this group and its predecessors, was his inversion of the gender roles, with the male playing the femme fatal role and the woman playing the unwitting object of their affection. However, in this click bait era of over promising and under delivering this film sits right at home."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "shivanimaharajh",
        "review_rating": "10",
        "review_title": "Movie 2",
        "review_detailed_main": "I love this movie. The actors are amazing. They really do bring the characters to life.\n\nWhen will the second movie be released???????"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "engineer-65313",
        "review_rating": "",
        "review_title": "Worst Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "anneecunningham",
        "review_rating": "7",
        "review_title": "Very interesting film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "v-orozcon",
        "review_rating": "5",
        "review_title": "Fantasy, girl",
        "review_detailed_main": "Relax... Light core erotica is not that bad. Guy is super handsome and hot. Locations are great. Soundtrack is awesome. Remember: IT IS FANTASY EROTICA. Not looking for an Oscar."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "AK1475",
        "review_rating": "1",
        "review_title": "Pure junk",
        "review_detailed_main": "What the hell Netflix where thinking when they purchased this student film. In 2020 with #metoo too put such an offensive,degrading film is a big no no👎"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Peter-171",
        "review_rating": "1",
        "review_title": "A snorefest",
        "review_detailed_main": "Someone actually recommended this movie to me. My recommendation is not to watch this boring incoherent mess. The only plus I can give it is that was nicely shot. If you were hoping for a suspenceful abduction movie this is not for you. 1/10"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "b-96875",
        "review_rating": "1",
        "review_title": "Where should I begin?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "koritora",
        "review_rating": "4",
        "review_title": "Euro chick party movie with sex to keep guys interested",
        "review_detailed_main": "Outraged woke people will obviously 1 star this movie.\n\nThe guy is a brute, and the girl acts strong, but loves that hes a brute.\n\nPeople complain about the English... the English is fine if youre from Europe. Woke people angry its not directed at their country. Surprise!\n\nIts a chick flick full of girls partying with no consequences, drink, spa, drink, dancing, drink all while someone else pays for it. Seems accurate.\n\nOn top of that, there is a lot of sex in the movie. Very 50 shades sex, but naked bodies on screen so guys wont immediately turn off how the irresponsible, party girl movie.\n\nWas it the worst? No, probably would have been pretty popular 10 years ago. Was it good? Meh, I was engaged through to the end, but no. It wasnt that good and the ending is very... oh, ok.\n\nVerdict, watch it once with your girlfriend/boyfriend. It will probably get you hot and heavy... unless youre woke and outraged at everything."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "catpantry",
        "review_rating": "1",
        "review_title": "Timeslant",
        "review_detailed_main": "What did i just see here? A cop rushes into target and into the bathroom. The cop was called over as fallows: get down here please and separate the people in the restroom. But there was nothing in the bathroom, not even a toilet (empty). The cop slouch ed to the floor, slapped his hand on his face, and said all drawn out like, 'booooooy, noooo onnne wiiinsssss.'"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "witchhayzel",
        "review_rating": "2",
        "review_title": "Soft porn",
        "review_detailed_main": "I'll be honest... I'm a huge fan of cheesy romance novels...but its just so awkward when they take a cheesy romance novel and turn it into a movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jubsdu",
        "review_rating": "3",
        "review_title": "Just a porn movie that inspires you to be a rapist",
        "review_detailed_main": "You kidnap someone and give them ultimatum to be in love with them. That's plain rape. Kind of soft rape as soft porn is.\n\nDon't waste your ethics by watching it. You don't want to be rapist after all."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "redtheredd",
        "review_rating": "10",
        "review_title": "It's smut not Shakespeare",
        "review_detailed_main": "This is not a movie for plot or good story it's smut and if that's not what you want go watch the Irishman or something This is a movie about sexual fantasy if you are a vanilla prude you will hate it if not it has some very hot sex scenes hotter than some porn I've seen so if you just looking for some dirty fun this is a great one."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "alicewcronin",
        "review_rating": "7",
        "review_title": "Good if you're in it for the sex scenes!😉",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "titans-mommy",
        "review_rating": "1",
        "review_title": "Watched because of TikTok",
        "review_detailed_main": "The only reason I watched it was because of TikTok."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "bmcsometimes",
        "review_rating": "1",
        "review_title": "Should have just been a literotica piece, not a film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ludsanda",
        "review_rating": "1",
        "review_title": "Why was this even created?",
        "review_detailed_main": "Anna-Maria Sieklucka is beatifull as Laura. Other then that, the acting is weak, plot is non-existant, course is boring."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "edwardrevans",
        "review_rating": "1",
        "review_title": "Utter nonesense",
        "review_detailed_main": "You can see that money has been spent on making this tripe but the movie lacks any coherent meaning or structure and is an excuse just to try and titillate the viewer, this is no more than a soft core porn film. The movie jumps from italian, english, polish and this is where the movie suffers any redeeming point."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "rrvidwans",
        "review_rating": "2",
        "review_title": "Should be banned",
        "review_detailed_main": "Totally misogynist, porn film with no semblance of any storey with Bad acting, bad editing. Its a pity that most popular OTT streamer like Netflix decided to show it, otherwise it should end up in some corner of red light area's cheap sex shows shop. Main characters are so blunt , poker faced that director must have been frustrated to extract some acting from them. Wish the main character Massimo had died in first few scenes along with his father."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Yuliet10",
        "review_rating": "1",
        "review_title": "I thought it was a joke",
        "review_detailed_main": "Is just a fantasy, literally te characters never grew up or move to the same situation. The plot is basically wrote by a gilr of 15 yeears without any context or deep explication.\n\nThe only reason i gave the movie 1 single star is because those who work with the lighting guys did an excellent job."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Titan_Honey",
        "review_rating": "3",
        "review_title": "WTF did i just watched.....",
        "review_detailed_main": "The acting, dialogues and plot is so cringe, LMAO.\n\nGiving it 3 stars because it has some good s3x scenes ;)"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jack-39973",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "I did expect a really bad movie it was a really bad movie. Everything is bad.\n\nWhy is such crap so popular???\n\n#faithinhumanitydestroyed"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ashashalderman-28816",
        "review_rating": "10",
        "review_title": "I loved it",
        "review_detailed_main": "I've seen a lot of negative reviews, but personally I loved the film. It's steamy and romantic at the same time. Yes the storyline was fast paced and slightly lacking but I didn't find that it negatively impacted the film. I watched this movie even though I saw terrible reviews for it and I loved it. NEED A SEQUEL!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "kingagruszka-29589",
        "review_rating": "",
        "review_title": "I love the movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "KaD1982",
        "review_rating": "7",
        "review_title": "Super HOT And FUN, if you know what expect!",
        "review_detailed_main": "I'm surprised to see so many horrible reviews. Obviously people are taking this movie way too seriously. Relax people! This movie is over-the-top cheesy, dramatic, ridiculous and SUPER-SEXY entertainment.\n\nIf you're a fan of soap operas and taboo, dark romance novels- you'll really enjoy it. I loved it! To me, it just felt like an x-rated soap opera. What a steamy girls night movie!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "cethi-One",
        "review_rating": "1",
        "review_title": "a desaster",
        "review_detailed_main": "An insulting film for the image of women and extremely poorly made in the image of the coarse and badly written story of certain reading application, I expected nothing but I was much more outraged than disappointed."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "valfrae",
        "review_rating": "1",
        "review_title": "absolute trash",
        "review_detailed_main": "What is this plot? What is this acting? Was supposed to be sensual but it was comical instead.\n\nStupid, predictable, boring plot without any substance. What was the point of the story again? The only thing worth watching was the dude's body I guess."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "missdagkan",
        "review_rating": "2",
        "review_title": "C R I N G E",
        "review_detailed_main": "Oh. My. God. This movie was so cringey it hurts. Honestly, I got so much 2nd hand embarrassment. The lines were sooo bad (I am going to f...k you and they will hear it in Warsaw- I mean what???). The plot was too predictable (except maybe the end), totally absurd (a gangster kidnaps you and you fall in love with him, good job). I gave it a 2 because I did laugh a lot. But other than that I can't believe this thing is number 1 in so many countries and people are obsessing about their relationship..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "romedini",
        "review_rating": "2",
        "review_title": "Not so good",
        "review_detailed_main": "Beautiful girl but worst female acting since Kelly Brook in Survival Island."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Comphunk",
        "review_rating": "1",
        "review_title": "Man This Was Bad!!! And it's Trending No 1 in US Netflex",
        "review_detailed_main": "I have never ever given a movie 1 star, infact never below 4. I had already seen the rating 3.7 and given it a pass when my friend tricked me to watch this. And I ended up FForwarding the movie in 35 minutes. It's Soft Porn every 5 minutes basically. The one star is for the shallow plot. Why did they even make it ?? And the fact it's Trending No 1 is mind boggling as to what people like"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "venidel",
        "review_rating": "5",
        "review_title": "Cringe, cringe and cringe",
        "review_detailed_main": "I'm giving 5 stars for several reasons: I liked the girl's hairstyles and outfits. I loved the view of the place(s) where the movie was filmed. The songs were not bad. Now the bad part: Overusing \"are you lost, baby girl\" and \"don't provoke me\". The cringe level in this movie was 100000/10, he assaulted her so many times but it was interpreted as romance, she fell in love with those mine tho. The whole plot was a complete mess, the script was poorly written, most of it was just \"baby girl\". The wattpad stories that are written from 13 years old are more interesting. And one more thing, some stories/books better stay that way."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "TheInfiniteFormula",
        "review_rating": "1",
        "review_title": "I thought no means no!",
        "review_detailed_main": "There is the endless indoctrination of radical feminists saying you must ask every woman for her approval before sex and there is 365 days. This is when the film industry does every thing to earn some bucks and then you realise it's all about money and power and the rest is just total BS!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "watf-71144",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "This film is awful and filled with a series of sterile choreographed sx scenes.\n\nThere is no plot, the acting is terrible and the motivations of any one character dont make any sense.\n\nHonestly this film must be aimed at adolescent minds, ending up doing more harm than good.\n\nI am not sure who Netflix think this is aimed at but honestly this is the type of programming we can all do without.\n\nThere are programmes where you think the fee was worth the fee alone. This is just the opposite and I expect money back!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "karin_fredman",
        "review_rating": "8",
        "review_title": "So much better than fifty shades",
        "review_detailed_main": "For once the love couple has chemistry. The plot is a bit weak but if you look at the scenery the acting and the suspense it is about a thousand times better than fifty shades. Plus the sex scenes are really hot."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "vertigo0o0o",
        "review_rating": "",
        "review_title": "Cringe level 10000000000",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Ioana1717",
        "review_rating": "6",
        "review_title": "It isn't that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Stanlee107",
        "review_rating": "4",
        "review_title": "It could have been so much better....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Xavier_Stone",
        "review_rating": "1",
        "review_title": "Misleading Title - Poor Story 3.65 days",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "tanoeja6",
        "review_rating": "5",
        "review_title": "The most shocking part of the movie:",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "hoangngoc-16768",
        "review_rating": "1",
        "review_title": "The worst !!!",
        "review_detailed_main": "I've never seen any terrible film like this before😤😤😤😤"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "SilverOrlov",
        "review_rating": "4",
        "review_title": "Sick romance of abductions and sexually anxious mafia princes.",
        "review_detailed_main": "The same gaudy junk as \"Fifty Shades\", but a little more better for adolescents due to the many good shown erotic scenes."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "MAYESY-44",
        "review_rating": "1",
        "review_title": "Honestly?!",
        "review_detailed_main": "The absolute worst film I have ever seen. Awful storyline which had no rhyme or reason, god awful acting from pretty much everyone involved and if that wasn't bad enough to have an ending like that after 2 hours just amazes me. Honestly if this gets on Netflix as it is then anyone can do a film a put it on there. RIDICULOUS."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "uncsbuddy91",
        "review_rating": "3",
        "review_title": "Stockholm",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mosquitobite",
        "review_rating": "1",
        "review_title": "Trite trash no class toxic muck... move on, nothing to see here folks less you're 14",
        "review_detailed_main": "This is honestly so insufferably dull you will fall asleep Oh and the sex ? Yeah we ve all seen porn already so shuffle off"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ginatiaiti",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "When I tell you, I have been waiting for a movie like this! Ugh! I read Wattpad books all the time, especially the Mafia/gang leader one's. This movie brought every mafia book I've read, to life! #MUSTWATCH"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "naamabsgmailcom",
        "review_rating": "",
        "review_title": "Stockholm syndrome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jennfinn",
        "review_rating": "5",
        "review_title": "Give Me A Break.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "gallagherkellie",
        "review_rating": "2",
        "review_title": "It's like a teen movie but with sex",
        "review_detailed_main": "Wow...what a boring no pointless movie. The acting and script were horrible. I'm shocked a woman wrote this with the kidnap/rape culture it's symbolising. The only good thing about this was the scenery!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dsayshi257",
        "review_rating": "1",
        "review_title": "What",
        "review_detailed_main": "I don't review many movies but I had to review this one. What an absolute train wreck. Some of the worst acting, worst writing, worst plots and worst music I have ever witnessed in my life. Overall just a dumpster fire of a movie which should be avoided at all costs."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "gabyaldave",
        "review_rating": "1",
        "review_title": "Good for a pornographic movie",
        "review_detailed_main": "I never write reviews, but as a lover of films I had to make some justice to the cinema around the world. This film has no trama, bad acting, and depicts everything that is wrong with society trying to normalize Psychological and physical abuse in relationships. Is not a movie made for cinema but is at best a decent made pornographic movie. Really really bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "BRMDZ_21",
        "review_rating": "1",
        "review_title": "HAHA",
        "review_detailed_main": "This is trash. It's so bad that it made me laugh. The script had no coherence, it is really stupid. This whole movie is a copycat from fifty shades of gray Haha"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "amandandeda",
        "review_rating": "2",
        "review_title": "If you're into porn and don't read novels you'll like it.",
        "review_detailed_main": "I CANNOT believe this movie is trending in my country? How? Why? It's like a 50 shades of grey parody... The directors focused on sex and not story development. The characters stories are poorly developed and the movie is horribly written with no theme. This movie screams of Stockholm syndrome where people fall in love with their abusers. You'd think your watching an introduction of a crime program on ID extra... The movie spreads a narrative that it's okay to be kidnapped as long as your kidnapper is hot and wealthy!!! Honestly I'm embarrassed it trended in my country, or the Netflix system is flawed... This movie will work for people who don't read books, zero story development...so unintelligent!!! I feel like we are being introduced into porn. They are sanitizing porn for normal viewing... The entertainment industry is slowly dying, every movie has to have a representation of black people, gay people, feminists, religious beliefs are not welcome...gosh! And now sanitizing porn!!! I could rant forever, anyway don't watch it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "marakib",
        "review_rating": "2",
        "review_title": "Why?",
        "review_detailed_main": "If anyone tell me ever again that 50shades were more worse than that movie I honestly don't know how I'll react. Comparing these 2 movies, I give 10/10 on 50shades. Seriously."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "vinayakmalhotra-90308",
        "review_rating": "2",
        "review_title": "Nee good",
        "review_detailed_main": "Nee good man, the bloke wore the same shirt in the whole movie, could smell him honk through the telly, and why was there any need to kill the girl man she was sound asf. And why is this movie called 365 days when it took the lass 2 seconds to fall in love with her man, pua fuming, how yous dint show the guy snorkelling"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lalitpradhan-20456",
        "review_rating": "10",
        "review_title": "One of the best erotic love story of all time",
        "review_detailed_main": "Please Don't call my review fake . I like this movie very much. Its a unique type of movie which has a lot of xhot scenes n you ll love it. I honestly hope that there ll be more movies like this in coming years."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ladymacbethian",
        "review_rating": "",
        "review_title": "Yikes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ddrich25",
        "review_rating": "7",
        "review_title": "I don't get all the negative hype",
        "review_detailed_main": "365 was a movie I had to pay attention to because of other language subtitles, but I honestly liked it. Movies are movies, I watch them for entertainment, and I was entertained. I wasn't offended by the storyline or anything like that...because ya know, it's a make believe movie. Lead man may quite possibly be the best looking human I've ever laid eyes on. The movie had beautiful settings/scenery, beautiful clothes and a great soundtrack. The sexy/steamy parts were no more graphic or sexualized then 50 shades."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "cotswoldsgirl22",
        "review_rating": "5",
        "review_title": "well..",
        "review_detailed_main": "5 for the hot scenes and the soundtrack. If the languages were only Italian and Polish the movie would be far better. Those accents..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ambervdharing",
        "review_rating": "2",
        "review_title": "Bad bad acting",
        "review_detailed_main": "What a bad and horrible movie. Like it's the most normal thing in the world to get kidnapped and then she gets Stockholm syndrom...\n\nAnd then the acting my gosh even my high school musical was better if it comes to acting.\n\nAnd no it's not a fun family movie to watch as some seems to suggest.\n\nOverall no I hate this movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "avipsha",
        "review_rating": "5",
        "review_title": "Mediocre just like the 5 i gave",
        "review_detailed_main": "It's just mediocre. Not as bad as it has been portrayed though"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "abonayf",
        "review_rating": "1",
        "review_title": "Bad movie",
        "review_detailed_main": "This movie contains a lot of sex clips and a very bad story"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "michalisterzis",
        "review_rating": "2",
        "review_title": "A bad soap opera",
        "review_detailed_main": "The storyline reminds the gimmicks used by some soap operas or telenovelas.\n\nBadly acted by the majority of the cast which is magnified by the bad English accent. And even the sex scenes were not...sexy.\n\nSaved from getting 1 by the nice cinematography and beautiful locations."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "arielsiere",
        "review_rating": "1",
        "review_title": "That's Disgusting",
        "review_detailed_main": "I would say that 365 days is one of the worst movies from 2020 along with cuties also known as the worst movie on Netflix and it even got a sequel which i am not planning to see it or else it would be wasting my time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "rintakyo-91296",
        "review_rating": "1",
        "review_title": "What even is this?",
        "review_detailed_main": "I am speechless, after sitting through this movie, I just have no words at all! There's no plot at all, the entire movie is just the main characters mating together. I can't believe who would write a script like this, it's flabbergasting to me. They have most illogical music videos, one second they'll be fighting, and then the other, their riding in their car and there will be some happy song playing. This reminds me of the movie, After, just filled with abusive relationships and unnecessary plot twists. It's indescribable, the movie is just indescribable, what is actually going on? The direction makes me nauseous. It's the fact that Anne-Maria Sieklucka (Laura Biel) keeps trying to do a seductive voice, even though it just feels like she's whispering, it's cringe."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "anasgeedi",
        "review_rating": "1",
        "review_title": "disgraceful",
        "review_detailed_main": "This movie is probably one of the worst movies I have ever seen in my life. I watched it and I could already tell that this thing is like putting all the terrible acting and directing in the world right into a blender, and then mixing it and this is the final product. I tried to give this a genuine chance but to be honest I don't even know what I was thinking. If you even think of watching this movie then I promise you that you will sorerely come to regeret that decision. I made this account just to give it another bad review and I am so upset that I wasted so much time of my life to watch this. Thank you."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "chloehoare-99260",
        "review_rating": "10",
        "review_title": "fantastic fetish genre movie",
        "review_detailed_main": "Loved this movie, So good. So hot. The themes presented are absolutely a fetish genre of reluctance, among others. So yes if you're not into that, not the movie for you. You can't judge someone who liked it and call theirs a 'fake review' just because they're not into the same stuff you are. I know many women with this erotic fetish who love this movie too."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "makharry",
        "review_rating": "6",
        "review_title": "Watch it for Michele only, not much story",
        "review_detailed_main": "I liked the movie only for the sensual part. And yes Michele. As per the dialogue, he is god's perfect model.\n\nNot much in the story. Only some gangsta scenes for very short time. Nice scenic views. Picturisation is good. Why some people killed? What family rivalry? Why he got shot? Nothing explained.\n\nOnly if u want to see perfect body of Michele, then watch it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Polotovar",
        "review_rating": "3",
        "review_title": "Erotica with weaker plot",
        "review_detailed_main": "It's an erotic film, and it draws on that quite a lot, too, I'd say. The story isn't that great and actually I think it's not that great. Fans of erotica will probably find their thing here, but otherwise I would advise avoiding this film. For me, a weak film that I don't recommend."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "makaelyngeorge",
        "review_rating": "1",
        "review_title": "365 Days of Grooming",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lavredianas",
        "review_rating": "5",
        "review_title": "Massimo.Just that.",
        "review_detailed_main": "There's no plot in earnest. You just get to watch this Italian masterpiece for 2 hours. I mean the lead actor. Who is this guy? Is he even real?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "hatsuelalachan",
        "review_rating": "1",
        "review_title": "What the heck?!",
        "review_detailed_main": "It was so bad i couldn't even finish it watching. It was the worst movie i've ever watched and i thought that's not possible after Fifty Shades of Grey. I have to admit i thought it was some badass mafia action movie with some romance in it but daaamn, totally unexpected, in a bad way."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "adamdaughtry",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "Congratulations for being the worst movie I have ever seen in my life. Do not watch this movie. Why make the second part?\n\nPlease remove this video from all sites."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "abby-51431",
        "review_rating": "2",
        "review_title": "Interesting yet failed in the end",
        "review_detailed_main": "Without giving away anything from the plot, this movie was entertaining but ended in a garbage heap. Wouldn't recommend to anyone. Oh and he kept calling her \"baby girl\", which was just cringy."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Uriah43",
        "review_rating": "3",
        "review_title": "Suffered from Extremely Bad Direction",
        "review_detailed_main": "This film essentially begins on the Mediterranean island of Lampedusa with the head of an organized crime family declining an agreement involving sex trafficking. When he then turns to have a conversation with his son, a bullet rips through his chest which kills him immediately. It also seriously injures his son \"Massimo Torricelli\" (Michele Morrone). The scene then shifts to five years later with a meeting being held with an investment firm in which Massimo is being told that he has lost a substantial sum of money. However, rather than simply accepting these losses he allows his attractive colleague \"Anna\" (Natasza Urbanska) to change the subject which then allows Massimo to present some scandalous information involving members of the firm which puts all of them at a considerable disadvantage. That being said, they immediately agree to cover all of Massimo's losses and the meeting is quickly adjourned. Not long afterward, Massimo sees a beautiful woman by the name of \"Laura Biel\" (Anna Maria Sieklucka) and becomes determined to have her at all costs. To that end, he has her kidnapped and brought to his sizeable mansion where he tells her that she will be his prisoner for one full year and if she doesn't love him by then she will be given her freedom. What he doesn't realize, however, is that Laura has a mind of her own and knows exactly how to manipulate men to get what she wants. Now, rather than reveal any more, I will just say that this film should have been much better if it had even a minimum amount of competent direction. Unfortunately, that was not the case as the directors (Barbara Bialowas and Tomasz Mandes) were clearly over the heads and failed miserably in that regard as they saturated the film with one musical number after another. Now, I understand having a musical score at the very beginning of the movie and one at the very end. That's natural. But not every 5 or 10 minutes! To further illustrate, there were a number of sex scenes--which apparently required music in all of them. Likewise, there were dancing scenes. And more music. There were romantic scenes. And more music. There were also shopping scenes. With more music. And talking scenes. With more music. Ad nauseum. But everything seemed so artificial because there was absolutely no chemistry between the main actors. Neither was there any real drama or suspense. Having said all of that, I completely understand why both of the directors won the Razzie Award for \"Worst Screenplay.\" I also totally understand why both of them were nominated for a Razzie Award for \"Worst Direction.\" What I disagree with, however, are the Razzie Award nominations for \"Worst Actor\" and \"Worst Actress\" on the part of Michele Morrone and Anna Maria Sieklucka, respectfully. In my opinion, they did the best with what they had to work with and I don't think it's fair to criticize either of them in that regard. Be that as it may, the sad fact is that this was not a good movie and I have rated it accordingly. Below average."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jessicasingh-23700",
        "review_rating": "1",
        "review_title": "The writer/production team is not in the right mind",
        "review_detailed_main": "This whole movie explains what happens when two psychos are in a psychotic relationship (this is not a romantic normal relationship this is just complete example of 2 people who are not normal/ in reality and have Flack up minds). They are not in a toxic relationship but rather in a psychotic mentally ill toxic relationship. The writer Blanka Lipinska is obviously not in the right mind , she thinks that the love between Laura and Massimo is ok/perfectly normal. Just because she thinks that does not mean it is normal/right /ok. This type of so called love (the romance between Laura and Massimo) is not even called love/romance, but instead it is called how to be in a psychotic abusive mentally tortured relationship and be a psycho (obviously). This movie ABSOLUTELY DOES NOT MAKE ANY SENSE and LACKS A LOT OF COMMON SENSE . It is so unrealistic (the sex scenes are simulated as well). Whatever happened to Laura in this movie is very bad/ sad (Massimo enjoys mentally torturing Laura even more than she already was before and he loves to take a sexual advantage of her because of her Stockholm syndrome ; Massimo literally sees Laura as a sex toy that he is obsessed about not truly likes). If you think whatever was happening between Massimo and Laura was so called hot, romantic and also sexy (there is no difference between you and the writer). Blanka Lipinska showed the audience how desperate she is to be sexually/mentally abused by a so called Mafia (maybe she should go to Italy there is a lot of them there to give her the taste of her abnormal book/movie). Blanka Lipinska is also just mentally not in the right mind she really needs to get her mind checked out ; she is psychologically/medically not ok. This movie is a perfect example of objectification towards women and how the author/writer loves to make art that expresses how to abuse women / treat them like wild animals or sex toys. Blanka thinks that the love between Massimo and Laura is perfectly normal where Massimo spits in her private places (that is so disgusting and absolutely psychologically abnormal) she really needs to get her mental health checked out . I am surprised how she did not end up in the mental hospital yet. The writer also showed how desperate she is to loose her virginity and is fine with being sexually abused/used as a sexual toy (because she never got anyone who actually loved her for her #insecurities). I can not believe that the Poland writer can drop down so low just for profit."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "dragoshilbert",
        "review_rating": "10",
        "review_title": "Why you should see this movie?",
        "review_detailed_main": "1. great music 2. very good looking male and female main actors 3. good chemistry between two main protagonists 4. shows you how a man with masculine energy and a female with feminine energy conquer each other. 5. a lot of people seems to hate this movie :) 6. from what I asked around mature women with feminine energy are loving this movie - ask yourself why?\n\nThe music is perfect! This movie is a perfect exemplification of a lot of real behaviors in the old Europe, yes, from my experience - even if I assume the book/scenario is fiction - the inspiration was on real facts/desires/behaviors.\n\nYou do not like it? For comparison, watch Lauren Bacall with Humphrey Bogart in \"To Have and Have Not\" 1944 and compare the sexual tension, femme fatale archetype and the \"game\" with the same from this movie. If you are not convinced then continue with \"The Big Sleep\" 1946, \"Dark Passage\" 1947 and \"Key Largo\" 1948. Then take a look at the more modern one, like \"Basic Instinct\" and ask yourself if is a problem with this movie or with yourself. If you are a man, ask the woman near you what she loves, hates and get arouse from these stories/archetypes - then draw your own conclusions. If you are a woman and the man near you needs some guidance maybe you can learn a few tricks and help your man to become a better one for you.\n\nWatch this movie to learn about seduction, power of a strong woman, respect to a woman, love, passion, the price you pay when you go too far, respect of a woman for a man and the passion of a man for a woman - more about the pain and the suffer but also about the victory of conquer and love and be loved.\n\nIn this movie is so much psychology and human behavior than I asked myself who wrote this? from wikipedia: \"Lipinska worked as a therapist-hypnotist. She enjoys sports and fitness as well as sailing.\" Do you need more to understand from where all of this is coming?\n\nIn these times, in Anno Domini 2020, such a movie cannot be done anymore in USA, not even in France or UK. It has been done in Poland, please ask yourself why? This is a painful lesson than we need to pass to our children!\n\nHave fun and enjoy life!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "karbonesh-58417",
        "review_rating": "",
        "review_title": "👎",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "robynsegg3",
        "review_rating": "3",
        "review_title": "The ending was like a different movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "chiquiellez",
        "review_rating": "4",
        "review_title": "At least now I know where the TikTok trends came from...",
        "review_detailed_main": "Warning: Proceed with really very low expectations. Lower than B rated p*rn.\n\nI can't remember how many times I've skipped this whenever it popped up on Netflix.\n\nI skimmed through the synopsis & said, \"Nope.\"\n\nHowever, after recently joined TikTok & seeing all the \"are you lost, baby girl\" & \"I see red\" trends running amok, I was curious to see what was all the fuss about.\n\nThe plot was corny & the dialogues were cheesy as hell; reminded me of a very badly written Barbara Cartland romance novel I once read from my cousin's library out of pure boredom *cringe*\n\nI was on my moon cycle & should be an easy slamdunk but No!\n\nHow can 2 such beautiful people lack so much chemistry?!\n\nOnly consolation was that their cinematography was okay. Oh, and their soundtrack was good though. That's it. Nothing to lust over."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "takicveljko",
        "review_rating": "3",
        "review_title": "Meh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "halesenchanted",
        "review_rating": "2",
        "review_title": "Ridiculous",
        "review_detailed_main": "Saying this movie was ridiculous would be an understatement. Getting to know the character before delving straight to the nonsense that was the storyline would maybe have helped."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "nadkarnisumeet",
        "review_rating": "4",
        "review_title": "Avoidable erotica",
        "review_detailed_main": "365 Days (365 DNI - Polish) review :\n\nReleased on Netflix in June this year and consistently trending in their top ten, 365 Days is a Polish erotic drama which is tipped to be in league of 'Fifty Shades of Grey' (2015) and has generated significant attention on social media. Hence, this review...\n\nA young don kidnaps a woman on her birthday and threatens to holds her captive for next 365 days unless she falls in love with him. He also assures her that he wont have sex without her desire in this period of captivity. The lady ends up falling in love with her captor and then, they do it all over the place and in different positions.\n\nWith this apology of a plot which is only a catalyst for love making scenes bordering on porn, 365 Days has nothing to boast off other than the sex scenes which pop up every now and then in to its close to one hour fifty minutes of run time.\n\nThe hero, resembling Bollywood actor Siddharth Malhotra, is all beef but no talent while the \"petite\" heroine called Anna-Maria Sieklucka is a decent performer but no Sharon Stone (in Basic Instinct) to be able to pull off the bedroom scenes with èlan.\n\nIn one word, avoidable.\n\nRegards, Sumeet Nadkarni"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "zaro-65774",
        "review_rating": "1",
        "review_title": "WARNING! This is a misleading movie! Its not BDSM! and it's spreading very wrong culture!!",
        "review_detailed_main": "You DO NOT handcuff a woman in bed without her clear approval and consent!!!! You DO NOT touch her private parts without her consent!! This is plainly and simply WRONG! What the hell is wrong with Netflix spreading completely wrong and even unlawful criminal culture!!! Why the hell would they promote such horrible stuff as kidnapping and assault And then show that the woman becomes ok with all this!!! WHAT THE HELL!!! Where is the Metoo movement from bulls*** like this!!\n\nP.s. the script and the plot doesnt even go up to standards of a \"movie\"! Absolutely rubbish by all means!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "texas_robin82",
        "review_rating": "5",
        "review_title": "Great movie bad ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "shaziaaslam",
        "review_rating": "1",
        "review_title": "Pathetic, waste of time",
        "review_detailed_main": "I regretfully watched it without reading the storyline. It's nothing but soft porn. The main characters are very attractive but had no chemistry and can't act. I highly doubt they will be cast in any serious film. Also no plot or climax and it was a complete waste of my time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "desandre-28943",
        "review_rating": "9",
        "review_title": "Good movie to watch",
        "review_detailed_main": "I think this movie deserved rate better. Because the plot of the story gives the viewer a different way to have a love. Besides, this is the romantic movie not a action or drama. This movie give you a different experience how to get love from your lover. The ending make you feel twist because if this movie not make a sequel, the audience must read the novel to know the real ending. Good movie from good novel adaptation"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ariel_saulters",
        "review_rating": "",
        "review_title": "Horrible script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ashleygparker",
        "review_rating": "1",
        "review_title": "I signed up for a movie not an adult film",
        "review_detailed_main": "Went in expecting it be cringy and raunchy, it exceeded my expectations in both. This movie is straight out of an adult film, with bad acting and and a plot line that makes my writing skills look fantastic."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ivancheco",
        "review_rating": "2",
        "review_title": "Worst movie I've seen in a while",
        "review_detailed_main": "Too much music randomly. The script sucks, the performance of the actors wasn't bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Emersonian83",
        "review_rating": "3",
        "review_title": "Enjoyment V.S. Quality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "cloningerjd",
        "review_rating": "5",
        "review_title": "It's like watching an two hour cologne commercial",
        "review_detailed_main": "The plot is unrealistic and the characters reactions to the given situation are not normal and the acting is not stellar. What is does well is the cinematography. The scenery, actors, and clothes are stunning - you can't help but to continue watching for the beautiful visuals"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "confirmeddeath",
        "review_rating": "4",
        "review_title": "Judging by the reviews, this is a family friendly movie.",
        "review_detailed_main": "One of the reviewers watched this with his whole family, including 9, 11, and 13 year olds... Others also watched with family.\n\nSome watched with their partners and had the best sex of their life after the movie.\n\nSome hadn't had sex for ages, and had sex after watching this movie...\n\nWhat are you people smoking?\n\nI wouldn't be surprised if 90% of the reviews was from the same guy."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "whartoyo",
        "review_rating": "2",
        "review_title": "Too Bad",
        "review_detailed_main": "Who wrote this script? a horny teenager? So shallow in every way, cliche, absurd. Feels like watching cheap 80s movie."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "neilscott-71971",
        "review_rating": "1",
        "review_title": "How is this tripe number 1 on Netflix?",
        "review_detailed_main": "It is around 2 hours of an Italian guy sexually harassing and assaulting a Polish woman. If there was some kind of plot to this movie I must have missed it. None of it made sense. It was cringeworthy and boring."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "nivas-10978",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "This is the Worst moviei have ever seen in my life.. waste of time.."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "colliervillekids",
        "review_rating": "10",
        "review_title": "Hot. A. F.",
        "review_detailed_main": "Look...this is not an oscar contender. This is a netflix and chill movie if ever there was one. The sheer hot passion and phenomenal sex scenes are all I needed. \"His body was chiseled by God and d*** by the devil\". Ummm yes. Please! If you enjoy soap operas at a next level, this is for you. If you want some life changing, oscar worthy drama then just skip it. For what it is...10 of 10."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mabraha-15086",
        "review_rating": "",
        "review_title": "Need to see the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "elisa-hightower",
        "review_rating": "7",
        "review_title": "I loved it",
        "review_detailed_main": "Middle aged female who loved this. Scenery and music was perfect. Casting was good. It was an independent film, I was glued to my seat. Entertaining, hot, beauty cinematography. It's not for Oscar winner waiters. It's just sexy and seductive and draws you in!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "cutesd",
        "review_rating": "5",
        "review_title": "Just think of it as porn ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "santurcedc",
        "review_rating": "1",
        "review_title": "Mindless Movie But Hot Sex Scenes",
        "review_detailed_main": "The lead male character is hot Italian eye candy, but the movie is horrible. The sex scenes were hot in the movie and that's about it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Space_Crime",
        "review_rating": "1",
        "review_title": "Against All Moral Conviction",
        "review_detailed_main": "Avoid this insipid trash. This movie has no class and totally out of character. The only thing works is the cinematography, aside from that you'll be lost in the head."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Huskygirl_004",
        "review_rating": "1",
        "review_title": "Porn or movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "whitney4397",
        "review_rating": "3",
        "review_title": "Terrible",
        "review_detailed_main": "Tbh, I couldn't make it past 20 minutes. It is just awful."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "azouzmanar",
        "review_rating": "1",
        "review_title": "stupid movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "heathereachus",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "I only watched this because eveyone was raving about it on tik tok but its just a film about a woman being kidnapped and developing Stockholm syndrome for an abusive rich guy. One scene even made me cry!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "mimi1000",
        "review_rating": "1",
        "review_title": "At least he's HOT!",
        "review_detailed_main": "Fast forward to the boat scene then Stop. That's all you need to watch."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "renison007",
        "review_rating": "10",
        "review_title": "More like Stockholm syndrome and less 50 shades of grey.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "wphillipspa",
        "review_rating": "7",
        "review_title": "Some people need to learn to read",
        "review_detailed_main": "Ok I've read a lot of the negsuve reviews and the lost important thing I have to say is this: You knew exactly what this movie was about when you read the description. It literally says \"abducted, kidnapped\" Now I will agree with the plot issues, there are so many holes in it, but maybe thats how it's supposed to be. In my opinion, I want a fuller story. We never actually find out a lot of things, and they make introductions of characters and then never backtrack to them or include them anywhere. Another thing I saw was someone complained about how the English was barely understood here. From my point of view, if someone does not speak English as a first language, they don't usually speak it correctly. Nowhere did it say or even hint that these characters were well versed in English, and I think it adds to the plot and their character that they don't speak it perfectly.\n\nOverall, I am pleased with this but I would loooove to watch the same movie with more detail, or a sequel or something."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "Vassilikii",
        "review_rating": "1",
        "review_title": "This is not a movie!",
        "review_detailed_main": "It's porn. The kind that romanticises abuse. That's it. That's the review! P.s. I got a headache from watching this."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sue-06239",
        "review_rating": "5",
        "review_title": "Corny but I enjoyed it!,",
        "review_detailed_main": "Gorgeous, tall dark and handsome Italian leading man, fabulous scenery, amazing boats, lovely clothes, good soundtrack and, oh yes, lots of sex. Really, what's not to like? Well there is the cheesy dialogue and pretty bad acting (particularly by the female lead) but if you can get over that then this is a bit of raunchy escapism and it certainly kept me entertained while my husband snored in bed upstairs!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "suehenman",
        "review_rating": "2",
        "review_title": "I can't believe this in number 1 on Netflix!",
        "review_detailed_main": "I think the majority of people are probably watching this film for the naughty side of it when actually there is not that much for a 2 hour film. It seems like because the 50 shades books were so popular they've tried to do something like that but even worse! If I were to compare the two 50 shades would be right up there! The way people react to certain situations is ridiculous, there's one point where the girl falls off a boat into the water so the guy jumps in after her, they are literally in there for a few seconds and he acts like she nearly died! The film could have been so much better and I don't know if it's the acting or directing or just a mixture of both. Both leads are decent to look at but that's about it. Watch if you want a laugh."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ctscanlon",
        "review_rating": "1",
        "review_title": "Don't watch it. It sucks.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "thiagobarsou",
        "review_rating": "1",
        "review_title": "Toxic movie",
        "review_detailed_main": "This movie should never exist. It is a toxic story that romanticizes rape."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "io_loca",
        "review_rating": "1",
        "review_title": "This is worse than 50 Shades of Grey",
        "review_detailed_main": "I can't believe somebody wrote this movie. 50 Shades of Grey is a masterpiece. It makes no sense. This is my first ever written review because this movie is so terrible and I couldn't help myself. I just do not understand the hype. The acting is hilarious."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "marcotiero",
        "review_rating": "1",
        "review_title": "Vomit inducing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "swcook-53212",
        "review_rating": "1",
        "review_title": "Porn has a better plot line than this",
        "review_detailed_main": "I had to create this account specifically to write a review on how god awful this movie was. My fiancé picked it because somehow it is the number one movie on Netflix and I went into it blind. This is by far the worst movie I have ever seen in my life. The entire movie felt like an intro to a hardcore porno, then you get cucked before you see anything. Never in my life have I endured something as painful as watching this movie. It's a movie based on a rape fantasy. There was not the slightest bit of this movie I enjoyed, besides the occasional times this light hardcore porno showed a nipple. But if you enjoy 50 shades of grey, and want half the words to be in polish And instead of mentally coercing women into brutal sex, doing it with physical power and quite literally rape, cuckolding, and an absurd amount of blowjobs then this is the one for you."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "jakeface",
        "review_rating": "8",
        "review_title": "Hot hot hot",
        "review_detailed_main": "Don't get all the negative reviews. Not the best film ever but still enjoyed it and it does not deserve the current 2.9 rating.\n\nHot sex scenes and Michele Morrone is damn fine. Not sure it's the best film to watch when you're stuck indoors on lockdown though lol."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "di-crisart",
        "review_rating": "1",
        "review_title": "Pure garbage",
        "review_detailed_main": "First of all I do not understand why this movie is allowed and why a platform like Netflix would stream it. It promotes violence, abuse and it depicts only the imagination of a psychopath who has no understanding of human beings or how to treat a person. And considering what women are still dealing with even in today's society it is shameful that this movie is allowed. Secondly, the movie itself is beyond poorly made, the dialogs and the scenes are not linked, the way it is filmed is just bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lauranbvc",
        "review_rating": "3",
        "review_title": "She wears a bad wig.",
        "review_detailed_main": "I'm not even going to waste energy on this embarrassing mess. 2020 has been bad enough without Netflix making a very unrealistic erotica film with very questionable morals."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "vangorden-45423",
        "review_rating": "1",
        "review_title": "Bad,bad,bad,",
        "review_detailed_main": "Everything about these movies is terrible, acting? Where is that in this movie. \"Romance\" scenes are so ridiculous and unreal you either have to laugh at them or just shut off the TV. I could never in good conscience tell someone to take the time out of their day to watch."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "hz2961",
        "review_rating": "2",
        "review_title": "Don't bother",
        "review_detailed_main": "Almost everything is boring: characters are boring, sets are boring, script is boring...\n\nI am certain, you have better things to do with your time. :-)"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "NormUK",
        "review_rating": "1",
        "review_title": "Fifty Shades Worser!",
        "review_detailed_main": "This is a cheap and nasty Fifty Shades knock-off, with no plot, no originality and atrocious acting! Heavily promoted by Netflix (June 2020), and only likely to appeal to those completely devoid of taste..."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "eleftheriapankal",
        "review_rating": "3",
        "review_title": "Drinking game as suggested",
        "review_detailed_main": "Someone here pointed out that this movie could be used in a drinking game! When someone cringed she/he had to take a shot. So long story-short , worst hangover ever.!100% would recommend this!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "akoutoula",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Utterly ridiculous, atrocious acting plus the heroine really pisses me off. She has that myopic stare, a partial duckface constantly and she struts around like she's the Creator's gift to mankind. Even the way she walks is ridiculous, trying and failing to make it look provocative.... Let's face it, it's basically porn which I have no objection to....The guy is gorgeous, perfect eye candy...which is probably the only good thing about it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "nora-84307",
        "review_rating": "4",
        "review_title": "Weird",
        "review_detailed_main": "It's weird lol. The girl is hot tho.\n\nIt also has a lot of scenes where things are forced so that's a bit uncomfortable:/"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "eduardo-uchoa",
        "review_rating": "8",
        "review_title": "Great erotic fantasy",
        "review_detailed_main": "If you are woke and can not stand politicaly incorrect relationships, even when dreamimg, avoid it. Otherwise, enjoy this great erotic fantasy."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "yolandaddxgz",
        "review_rating": "6",
        "review_title": "Addicted",
        "review_detailed_main": "No plot to show at all, but I just like this kind of romantic story 😝"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "ok-izzy-ok",
        "review_rating": "1",
        "review_title": "I gave 1 star because it wouldn't let me put 0",
        "review_detailed_main": "I never usually add reviews however I had to for this movie so I could perhaps spare the pain of another soul .. yes , it is that bad, If you want to punish somebody , made them watch this \"Movie\" I am still crying over the hours I lost watching this."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "kdeth",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "One of the absolute worst 2 hours of my life. Dialogue is worse than a run of the mill porno movie. Acting slightly better than previously mentioned movies. Should have bailed 15-20 minutes into this thing. Can't believe it has been in the Netflix top 10 for so long. One line we'll never forget from this movie, \"Do you want to touch it\". Don't touch this movie if want a meaningful 2 hours of your life. Top 3 worst movie we've ever watched."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "lucille738",
        "review_rating": "1",
        "review_title": "Worst movie ever, I created an account just to rate this as 0",
        "review_detailed_main": "Never felt the need to revise anything, but watching this was just complete waste of time that I felt I could waste 10 more minutes to spread the word \"don't watch this\""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "averylynn-84147",
        "review_rating": "1",
        "review_title": "i hate this",
        "review_detailed_main": "I hate this the only people that enjoy this are horny teenage boys"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "sakuradu73",
        "review_rating": "1",
        "review_title": "Impossible to stand",
        "review_detailed_main": "Everything is wrong in this so called \"movie\". Pure waste of time."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "EvanKevelson",
        "review_rating": "1",
        "review_title": "I have Showtime for better Soft Core",
        "review_detailed_main": "The protagonists criminal escapades, his former girl friend were never explored. So a megalomaniac and a \"Cinderella\" Stockholm Syndrome insane captive. It was even more lame than 50 shades."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "adythechamprko",
        "review_rating": "1",
        "review_title": "First time I write a review about a movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "michalserwa",
        "review_rating": "1",
        "review_title": "Absolute drama",
        "review_detailed_main": "After seeing Corpus Christi at The Oscars I really thought Polish cinematograpy was going to be on the rise. I'd thought so until I saw this disastrous movie. It was not expected to be the best, however what I have seen did not rise to the least of my incredibly low expectations. What's bothering me most is that this movie was supposed to be polish verion of Grey and it turned out to be a cheaper version of Bounty ads. Too much explicit sex, no real bond and depth between main characters, no viable motivies behind characters' actions- these are only a few of so many sins that have been commited. This movie is outrageously bad. The very first impression that came to my mind after seeing it was that everything was so forced and artifical. Now I know that it's not even the movie itself, but the plot behind it that made it so incredibly unamusing. Final thoughts? Go see Grey if you enjoy erotic and romantic genre, cause this movie is definitely not worth it."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "andreeafaragau",
        "review_rating": "10",
        "review_title": "Porn for women",
        "review_detailed_main": "First off, this is a movie, so don't take it too seriously. Do you take action movies seriously??? Those movies where everything blows up and everyone is an expert at fighting? Do you take porn seriously? The ones where guys get laid because they bring you pizza or clean your pool? This movie is made to fullfill a fantasy. It is made for the women who enjoy it. If it's not your cup of tea just move along."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "bizare_ho",
        "review_rating": "6",
        "review_title": "Not too bad actually.",
        "review_detailed_main": "I think it could have been a better film in the right hands.\n\nThe sex scenes were so much better then 50 shades of dross. He's hot, she's hot, the sex scenes are not kinky but far from vanilla, one position for procreation purposes only.\n\nThe script was lacking but I just watched it for the sex. At least I'm honest. It wasn't half bad."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "SamJamie",
        "review_rating": "2",
        "review_title": "Escapist Entertainment.",
        "review_detailed_main": "365 Days (Polish: 365 Dni) is a 2020 Polish erotic romantic drama film directed by Barbara Bialowas and Tomasz Mandes. It is based on the first novel of a trilogy written by Blanka Lipinska. The plot follows a young Warsaw woman in a spiritless relationship falling for a dominant Sicilian man who imprisons her and grants 365 days to fall in love with him.\n\nThe film stars Anna-Maria Sieklucka as Laura Biel and Michele Morrone as Massimo Torricelli. The film was released theatrically in Poland on February 7th 2020 and was later made available on Netflix, quickly gaining global popularity and widespread recognition.\n\nI didn't initially intend on watching this film until it spent over two weeks in the Top 10 on Netflix in the United Kingdom. This film is by no means high art but it's undeniably entertaining, I didn't take my eyes off the screen for the whole runtime. I know I shouldn't of liked it as much as I did looking at the other reviews but this film is pure escapism with beautiful cinematography - if the Fast & Furious films can do the exact same for men and be praised why can't films like like this?"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "claudette_dedeth",
        "review_rating": "4",
        "review_title": "Lame Acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "saadgkhan",
        "review_rating": "5",
        "review_title": "365 DNI Makes Fifty Shades Look PG #Fact",
        "review_detailed_main": "365 Days - B- (Fair)\n\nA movie based on series of erotic book trilogy stays true to its source material and gives what is required of it. I have to give to actors; they were truly committed to it. They made the movie enjoyable even with its blatant mindless Stockholm syndrome plot. It gives 100% more satisfaction than the 50 Shades trilogy.\n\nAnna Maria Sieklucka is stunning; she reminded me a lot of Turkish renowned female actress Beren Saat from Ask-i Memnu (Forbidden Love). It's a good time-pass for people looking for some Netflix and more Chill!!!"
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "norman-21580",
        "review_rating": "4",
        "review_title": "Better than Fifty Shades of Grey",
        "review_detailed_main": "Not the best movie, but I'll give kudos to its eroticism. Actor was good."
    },
    {
        "movie_id": "tt10886166",
        "movie_name": "365 Days",
        "movie_rating": "3.3",
        "review_username": "bernardosampaioo",
        "review_rating": "1",
        "review_title": "Just don't",
        "review_detailed_main": "Worst movie I've ever seen. Worst movie I've ever seen. Worst movie I've ever seen. Worst movie I've ever seen. Do not watch it, don't waste 2 hours of your life. Worst movie I've ever seen. Worst movie I've ever seen. Worst movie I've ever seen. Worst movie I've ever seen. Do not watch it, don't waste 2 hours of your life. Worst movie I've ever seen. Worst movie I've ever seen. Worst movie I've ever seen. Worst movie I've ever seen. Do not watch it, don't waste 2 hours of your life."
    }
]