[
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "nekurath",
        "review_rating": "6",
        "review_title": "Funny, charming and not as copied as they say.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "caiged",
        "review_rating": "4",
        "review_title": "The Potential was there...till the second half ruined it",
        "review_detailed_main": "DBH is not a bad movie, per say, it just isn't a very good one. A typical Yashraj film which evokes memories of DDLJ, Mohabattein, K3G etc, which is not necessarily a good thing. In an age where one should be striving to be original and innovative this movie sinks into the depths of yesteryear and tries to emulate the success of past Yashraj films in the hopes of scoring another victory. It's clear that someone was still hung up on the past and my guess is that it's the film studio rather than the director. The musical beats, the \"heroic\" and super main lead, the independent and lovable lead actress, the styles and moods...this could just be called DDLJ part 2.\n\nThe two biggest flaws which undoubtedly leads to the undoing of the movie is the second half of the movie and Shaid Kapoor.\n\nThe second half became overly melodramatic, the ending was clichéd, contrived and silly. The cricket game itself becomes a sham with the supposed twist and turn as the Indian team go from invincible to amateur in the blink of any eye, and all because the skipper decides to sulk at the \"betrayal\" Shaid Kapoor, the other weak link, takes himself WAY too seriously in this movie. Someone forgot to tell him that this is meant to be a light hearted fantastical comedy i.e. in other words a typical masala movie. I mean you've got Rani running around dressed as a young Punjabi boy, grinning inanely and playing cricket and there's Shahid emoting away as if his life depended on it, going all husky and dopey eyed whenever possible. I don't know if he watched every single Shah rukh khan movie before taking on this role but he clearly tried to his best imitation of an over the top SRK, which failed. What also failed was the parody of other big hits, a scene that should have been funny but fell quite flat.\n\nThe start of the movie was good- it was light, it was a bit funny and the intro song \"Hadippa\" was catchy and set the mood. Rani was great as Veer, slightly annoying as Veera but the contrast was decent and it was interesting to see her switch between the two roles. And then came Shahid, the anchor that weighed everything down.\n\nHad this movie remained on a light hearted track it would have worked and been worth watching again. Also if the cricket match could have involved the rest of the team collectively it would have made for a better ending rather than the two main characters slogging it out.\n\nThis movie was supposed to be about cricket but after Shahid enters it virtually disappears and is just used for the climax of the movie and even then it was poorly executed. Despite the ease of the way Shaid and Rani hit fours and sixes having watched the recent IPL T20 games it does not work that way.\n\nSure, there was a message about women's rights and equality in the world. If they're every bit as equal on the sports field then they should play for the men's team. But that was a message that needed to be handled with a better, and preferably strong and original, director and a more serious setting. Instead the message was: if you can copy the past which deviate from the path? A real pity, for this movie could have been very good. It's worth watching for Rani, who looks really lovely, and for the soundtrack which is nice to listen to. For a better cricket movie watch Victory, which is by default the best cricket movie, which is not saying much as it has its own faults."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "GuruGantal",
        "review_rating": "6",
        "review_title": "\"Typical Yash raj's but Entertaining\"",
        "review_detailed_main": "Let me tell you first, Rani has done a good job after following Bollywood new trend of \"zero\" figure. film includes little bit of romance, cricket, dance and \"shiksha\" (typical Yash raj Masala), songs are good and very enthusiastic, Rani and Sahid both looks great even though there chemistry was not that great. Rakhi Sawant should get little more dialogues and Sheryln Chopra Hot Body appearance was not fitting into the movie at all.Rani and Sahid dance was great, fan's got little disappointment after Sahid \"Kaminey\" for not dancing much, I would like so see more romance between Rani and Sahid in this Movie, very easily a NRI boy falls in love with DESI But beautiful Rani Kaur. There was no need of English mixed Hindi dialogues in this Movie, its hard to believe for an NRI guy fall in love with that kinda girl very easily, Little bit of poor dialogues, could have done better job with Poonam Dhillon too, Old Masala but as compare to other Bollywood movies at least you can enjoy with your family. One time watch, Have fun!"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "teenbauwa",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "I was surprised to find positive reviews of Dil Bole Hadippa here as I always refer to IMDb for unbiased reviews. So now that people liked DBH, I realize that if I didn't like this movie and rather found it pathetic, probably something wrong with me but still posting my own reasons. To me, it was extremely melodramatic, loud and shallow stuff for this age. I cannot tolerate the century old \"Wrong English\" comedy any more. It is too much clichéd. Their cricket was one of the most irritating parts of the movie. I mean in cricket, it doesn't have to be a six, a four or a clean bold on every ball. And please YRF enough of conning your audience with the same Punjab di Lassi or Sarson ke Khet.And how all the bindaas girls end up changing Shahid's thoughts and perceptions of life like Geet of Jab We Met and Veera of DBH was also not digestible. The worst part was DDLJ and HAHK drama. I walked away for a few minutes. Nothing was new the same old modern girl vs Gaun ki gori and bindaas vs polished, desh vs pardes. Not a single dialogue made me laugh or even smile for a moment. Rani is a very talented actress. She should choose intelligent multiplex movies. My Vote: 1 Comment: Awful"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "aman_nanda55",
        "review_rating": "3",
        "review_title": "DBH deserves to be run out without facing a ball",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "mathur_7",
        "review_rating": "",
        "review_title": "A Sixer!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "bobbysing",
        "review_rating": "2",
        "review_title": "A childish attempt to fool a Cricketing Nation.",
        "review_detailed_main": "The day I saw the first promo of \"Dil Bole Hadippa\" few months back, my only words were \"Oh God! not again\". Because once more there was a movie based on Punjab and Cricket with a talented coach having tons of attitude, along with a girl trying to deceive in a very ill suited \"Sikh Getup\" which was not convincing at all from any angle in the frame. I even kept wondering why on earth this thought was used again by the same camp which earlier gave us a brilliant \"Chakk De India\" made on a similar format.\n\nAnd now after sitting through the whole movie today, I exactly feel the same again and was even more disappointed by the final product presented. The movie couldn't change my thoughts even slightly as it has nothing new to offer in any departments technically or creatively. From the first scene itself you are served silly sequences in the name of cricket where both the bowler and the batsman don't know anything other than just the ball crossing the boundary. The story is completely predictable from the promos itself where a girl poses as a boy to play in a match against the rival team (which is strangely an unofficial team from Lahore, Pakistan) and you are simply offered all repetitive scenes every minute in the movie without any specific entertainment or novelty.\n\nAs an overall review, I would simply like to mention a few (silly) points here about the movie, which will give you a concrete idea of the project and it's below average content:\n\n1. It starts with a sequence where Rani (who specializes in hitting sixes) is scoring 6 sixes in a row to a bowler who is supposed to be a well known Ranji player (Domestic First Class Cricket Championship in India) and he doesn't know how to try 6 different bowls in an over. Quite a silly start!\n\n2. In the next scene, at one end, Rani is praying to play for India in 2011 World Cup whereas Anupam Kher and Dilip Tahil are still talking about 40 years of our Independence. A good two decade jump in two consecutive scenes.\n\n3. In the tense atmosphere prevailing between India & Pakistan from decades, the director shows two local teams playing unofficial cricket every six months in a stadium without any cricketing official or security agencies in sight.\n\n4. These two old time friends come with their respective teams at Wagah Border (Original Location) where there is no security officials, no military men of either sides and no official cricket authority on the location from the State, Center or Local Government.\n\n5. There is an overuse of deliberate Punjabi language and Devotional Sikh \"Mool Mantra\" coming many times in the movie inspired by the best version of the Mantra earlier heard in \"Rang De Basanti\". The director uses it purposely to give the movie a more authentic feel but the move falls flat.\n\n6. Rani's real identity also gets revealed in a cliché scene where Shahid catches her changing clothes in a men washroom. Nothing new!\n\n7. In a poorly conceived climax match, the Indian players are shown getting out childishly. It seems as if Shahid kept the coaching only for him and Rani alone and the rest were simply left out of the training camps.\n\n8. The director didn't do his research on the finer details of Cricket and its rules. In the last ball, Rani changes her stance from right to left hand. A player can only do so after seeking the permission of the on-field Umpires and also informing the rival captain, so that he can change the field settings. But here Rani just changes the stance ignoring all the rules of the game.\n\n9. There seems to be no problems of Visa and Passport for anyone featuring in the movie.(as if it was a match between India & Nepal)\n\n10. In the climax, a very silly argument is given by Rani on the stage, saying that both girls and boys should be allowed to play Cricket together as a Mixed Team. Was this supposed to be innovative writing?\n\nPerformance wise Rani makes a desperate attempt to strike back but sadly focuses on a wrong project. She tries hard and also impresses in her Man-Act, but the badly written and poorly directed movie lets her down. I also couldn't understand how she approved the awful get up, which was a complete disaster all the way. Shahid does nothing, other than showing his pricey attitude. After \"Kaminey\", he disappoints big time. There is no love chemistry between Rani and Shahid in their scenes together.\n\nSherlyn Chopra simply flaunts her fab body. Surprisingly Rakhi Sawant gets more shouts than Rani in her opening scene and she really has the right dancing moves better than many lead artists in the industry. Anupam Kher, Dilip Tahil and Poonam Dhillon have played the parts allotted to them perfectly.\n\nMusically, the soundtrack has a huge Punjabi hangover. A few songs are catchy but they don't have the original Punjabi feel, vocals and arrangement. Cinematography is nothing extraordinary. Background Score is completely based on Dhol and Punjabi sounds but gets repetitive after the initial scenes.\n\nCollectively it's a light movie based on cricket with too many loopholes and faults in its direction. Anurag Singh chose an absolutely worn-out theme and also didn't work on the finer details of the sport. He carelessly tries to fool a \"Cricketing Nation\" where people eat, drink and live cricket. In fact, the movie reminded me one of the first (childish) movies made on Cricket titled \"All-Rounder\" and I think that says all about my views on \"Dil Bole Hadippa\".\n\nIn few words, I wasn't expecting such a weak movie from the makers of \"Chakk De India\"."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "silvan-desouza",
        "review_rating": "1",
        "review_title": "Yashraj need to change",
        "review_detailed_main": "Yash raj films supposedly the biggest house in film-making but sadly their films churned out are mostly craps\n\nThis is another of their crap films look at the promos itself You can predict the story\n\nThe same ganne ke khet, same punjab, same Dhols\n\nWhat is new?\n\nA girl dressed like a guy? that is copied from an English film , She's The Man, which is taken from William Shakespeare's play Twelfth Night.\n\nThe film however is as boring as ever\n\nPoor Rani tries hard to comeback with a change sadly she fails even her bikini act is cold and her guy act is better but she does annoy at places\n\nAlso the biggest flaw is how come people don't come to know it's a girl even when they hug? also the love story and the Rakhi Sawant and Sherlyn Chopra track is badly handled\n\nAlso the end is so fake\n\nNothing works\n\nDirection by Anurag Singh is bad Music is bad\n\nAmongst cast Shahid just does a walk on in the film, nothing compared to KAMINEY Maybe he wanted to do a YRF film to get a hit but sadly it failed Rani tries hard and does impress as the guy in parts but she could work on her vocal chords to suit the man She should leave Yash Chopra's films now Amongst rest Rakhi Sawant and Sherlyn are as usual A headache"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "namashi_1",
        "review_rating": "3",
        "review_title": "Dil Nahin Bole Hadippa!",
        "review_detailed_main": "Yash & Aditya Chopra are Legends in their own right. They have made some of Bollywood's finest films. But when you see their latest flick 'Dil Bole Hadippa', which has been produced by them... You actually sit and think is this film really produced by these guys? Being a fan of both, I am hugely disappointed.\n\nHollywood flick 'She's The Man' vs 'Dil Bole Hadippa'... who wins? Hadipaa would lose hands down! I would love to ask Anurag Singh one simple question? How did you okay this script, and what did you like about it?\n\nShahid still has a SRK hang-up. 'Kaminey' was a milestone, right? Watch him in 'Dil Bole Hadippa' and you'll be disheartened. Rani tries hard, it's really sad to see a talented actress like being reduced to such roles and films. Anupam Kher and Dalip Tahil have nothing to do.\n\nThose 3 stars are only and only for Sherlyn Chopra. She looks hot throughout."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "perla_arabia",
        "review_rating": "7",
        "review_title": "Fun filled entertainment",
        "review_detailed_main": "I was surprised to how a typical tried out story actually entertained me and made me happy!. Great to see Rani back, her absence was felt and her return is ever so glamorous. Its great to see someone who can really dance match up with Shahid. Shahid is his usual serious self, and doesn't come through much in contact with the viewers, but his acting was tip top and enjoyable. The story was so colorful that i was laughing unexpectedly at times. The make up for Rani as a male was realistic, i actually know someone that looks like that. My only comment is the case of the disappearing and re-appearing eye shadow and make-up. As soon as she throws everything male off she checks in for seconds into invisible beauty salon and re-appears fully beautified :D. More or less very enjoyable and will own it on DVD, the music is lively and makes you want to dance the bhangra. And for you all women rights hater males who voted poor for the movie, let me tell you its not that she was a girl its that she played better than men (in the movie) so the image of weaker sex can't play with guys was abolished and nullified to the zennith.. thats why everyone with a sane mind clapped at the end."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "bounce7067",
        "review_rating": "2",
        "review_title": "Go watch it if you hate poor people",
        "review_detailed_main": "Okay, here is the deal, this movie, by me, should get only 1 because it actually made it to a cinema or two in India. But I gave it a two because it actually had the gut to rip off a more or less popular Hollywood title called \"She's the man\". Being a copy of the original it had the potential to overwhelm the easily satisfied Indian movie goers who would make \"Wanted\" (another rip off, but this one of a french movie \"B-13\") a hit.\n\nThere was comedy in it and it was all Rani Mukherjee's face and how she/he put some make up on to act look like a boy and no one seemed to have noticed her big bosoms.\n\nIf you have a few rupees laying around DO NOT GO to this movie, donate to Haiti instead, then you would know it did not go to fund the director's newer scams to extort money from the overly naive people of India."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "alloneloveall",
        "review_rating": "10",
        "review_title": "Funny & Heartwarming!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "Herag",
        "review_rating": "7",
        "review_title": "A Treat to Watch",
        "review_detailed_main": "It takes courage and bravery for an actress to portray a man. Only an actress who is dedicated to the profession and a depth and range to the acting can take on a role,which other actresses would shun or purely not capable of playing. This movie is all about Rani Mukhejee. This is an actress born to act and born to entertain-period. It's a good story but this Bhai-Bhai stuff is repetitive,overdone,nauseating and repulsive.How about Bhai-Bye Bye. These idiot scripwriters cannot come up with anything original.Enough of this crap.For the male lead someone like Akshay Kumar would have been good for this role but Shahid Kapoor is maturing as an actor but he works below his potential for the most part. The music was lilting and the Punjab scenery is colorful. As far Rakhi Sawant, only wish could see more of this bombshell."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "amitchawla83",
        "review_rating": "1",
        "review_title": "Another Dumb copy.. when would bollywood come up with something original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "I loved it - way to go Yashraj Films!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "sweet_LVD93",
        "review_rating": "2",
        "review_title": "Dil Bole Boring!",
        "review_detailed_main": "Dil Bole Hadippa is the most redicolous movie I've ever seen in 2009. Anurag Singh shot a couple of scenes and when he showed them to Aditya Chopra aditya was disappointed and asked Anurag to shoot them again but better this time. We all know that Rohan(Shahid Kapoor) lived in England since he was a child with his mother and that his parents is divorced and that he came back to India to take over his dads cricket team. But where does Veera come from? only the one who write the script and god knows.The most weirdest thing?! How can Rohan don't have an English accent if he lived in England since he was a child. Anurag Singh doesen't have the skills to be a director and he shouldn't do more movies and bore us out.it's only the songs which was great and makes you wanna watch the movie otherwise people would've go before the movie ends. about the box office, dil bole hadippa wasn't a big flop but was below average, close to be a flop. Shahids only hit-movie in 2009 is Kaminey and you alredy know that it deserves to be a hit if you've seen the movie.If you want a good advice watching Dil Bole Hadippa is just waste of a time, don't go to the cinemas to watch it. watch it on DVD instead."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "caloriej16",
        "review_rating": "2",
        "review_title": "Dil does not Bole Hadippa !!",
        "review_detailed_main": "This movie has weak storyline that defies logic (not that all movies are logical). Actors have overacted. Perhaps the movie leaned too much on cricket to salvage the second half.. Probably making it in a short movie would have worked. Rani Mukherjee did looked like a delicate version of Harbhajan Singh, an Indian cricket player.. At times there were dying sparks of her acting in the movie but those moments were short lived.. The movie failed to have a grip after first 40 minutes or so.\n\nIt is meant to be a light movie. Yashraj banner has produced good movies like Chandani and Dilwale Dulhaniya Le Jayenge. This movie does not reach those standards. A little bit more about the Veer Pratap Singh while playing cricket would have been great. Also, this idea of using cricket or hockey teams in the movie has become slightly stale after the great movies like Chuk de India and Lagaan. Wish this movie lived up to expectations of a movie directed by Aditya CHopra."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "1",
        "review_title": "This is a boring movie",
        "review_detailed_main": "Dil Bole Hadippa, produced by Bollywood's film studio, Yash Raj Films, is an unimaginative and thoroughly boring comedy starring Rani Mukherjee as Veera, a pretty Punjabi kudi in Amritsar who is so nuts about cricket, she disguises herself as a man to join a local cricket team. Shahid Kapoor stars as Rohan, son of the team's owner, and a county cricket player in England, who agrees to come down and coach his dad's team so they have better chances of winning an annual match against the Pakistani side. Expect the predictable locker room hiccups, the obligatory romance between Rohan and Veera, the subsequent revelation that the ace batsman in their team is actually a woman, and eventually an alls-well-that-ends-well climax. Shamelessly ripped off from the 2006 Hollywood rom-com She's The Man, the plot of first-time director Anurag Singh's Dil Bole Hadippa is full of holes. Its formulaic screenplay is packed with clichés and stereotypes that you've seen dozens of times before in films produced by the same banner. The never-ending references to Dilwale Dulhania Le Jayenge, the patriotic clap-traps, and those overused Punjabi lines – very little is original here. The film's only bright spark is that feisty performance by Rani Mukherjee, especially in her sardar avatar. The actress lets herself go with an unhinged, uninhibited turn that showcases her fearlessness as a performer. It's a shame she's trapped in a meaningless, embarrassment of a film like this that does no justice to her talent. Dil Bole Hadippa is about its sets and costumes and choreography; the emotions are superficial, its soul hard to find. The film bears no directorial signature; it's really a homogenised Yash Raj product that borrows its moments from Chak De India and Rab Ne Bana Di Jodi to name just two films. Cheesy starlets like Sherlyn Chopra and Rakhi Sawant are thrown into the mix for cheap laughs, and it even takes up the equal-opportunity issue between men and women in cricket, just in case you thought the film was becoming too trivial.It's a crushing bore of a film that's neither thrilling in its cricket scenes, nor entertaining in its humour. What's it going to take to expect some originality and inventiveness from one of the biggest players in Bollywood? To be honest, dil bole sudharjaa!"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "vickykolari",
        "review_rating": "2",
        "review_title": "A wreck (+20) - Short movie review",
        "review_detailed_main": "I must say, Dil bole watch She's the man again. It is a bad adaptation of Hollywood chick flick which was a fun time-pass movie. It was not worth adapting, whereas they did, horribly. Cliche and cringe are the two words which may explain this whole movie.\n\nOf course, YRF made a lot of bad choices, and this is one of them.\n\nNot worth explaining much, a movie about a girl who wants to be a cricketer who dresses up as a boy to be in the team is the plot of this movie. Direction was so poor that he could not bring the best of these great actors.\n\nThere is nothing to watch here, I watched this because I went for this when I was in college and the other option was 'What's Your Rashee', well, I think I made a good choice here because as a group of friends, we had a lot to troll in the hall.\n\nI rate this 20%.\n\nSKIP IT, pakka skip it. Its in Hindi language, and streaming on Amazon Prime (As on April, 2020) with English subtitles but don't bother."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "firoz-borle02",
        "review_rating": "1",
        "review_title": "third class movie",
        "review_detailed_main": "If you thought bollywood cant get worse. then watch this piece of nonsense nepotism laden crap this film will make you vomit and have diarrhea at the same time. this will feel you are having an acute attack of pontine hemorrahge and if you survive this you will be scarred and crippled mentally for rest of the life"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "user-18-158882",
        "review_rating": "1",
        "review_title": "Gross",
        "review_detailed_main": "I think this was one of the worse movies ever created. I mean, I know you can't expect much considering even the trailers were repulsive but seriously. Come on. I'd like to see a little bit better acting come from the actress that had the lead role in the movie that holds the record for more Filmfare awards won. It's absolutely disgusting. You might think I'm one of those people that is really picky but honestly. I have watched some really bad movies and like them. The storyline may just be the worst I have ever seen. So trust me when I'm saying this- this movie was just plain GROSS. I am so disappointed in Shahid Kapoor and Rani Mukherjee. If I were them, I would've gone into hiding. Don't waste your time watching it."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "pmdrive",
        "review_rating": "8",
        "review_title": "Enjoyed The Music and Dancing In This One",
        "review_detailed_main": "I don't know anything about Bollywood movies or any of the finer points of Punjab dramas, etcetera. I'm just an average middle aged Caucasian American who likes cross cultural experiences. I watch movies from different cultures to get an idea of the hopes, dreams, values and morals which are reflected back via the movie. Having been to India a few times, I am getting more and more familiar with Hindu culture.\n\nAdmittedly, there is nothing new in the storyline here (think Shakespeare's Twelfth Night), but the actors are very attractive and actually quite talented dancers. Yes, the singing is dubbed, but I enjoyed the songs for the most part. Some of the movie is so stupid that I actually enjoy it as 'bad art'.\n\nI am not going to be a regular consumer of Indian movies, but this is a fresh scrubbed, if cynical, offering. I like it. I really like watching this movie."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "samara-seepersad",
        "review_rating": "8",
        "review_title": "This movie is basically the Bollywood version of She's the Man with Channing Tatum and Amanda Bynes.",
        "review_detailed_main": "This movie is basically the Bollywood version of She's the Man with Channing Tatum and Amanda Bynes. Your counterparts in those roles are Shahid Kapoor and Rani Murkherji respectively.\n\nThe movie is pretty funny - the cheesy slapstick comedy that is trademarked Bollywood. I really enjoyed all the past movie references that occur throughout the film in both the dialogue and background movie choices, it really gave the impression that the movie wasn't a movie but actually a real life situation - which it is - but while never getting too serious. There were some sub plots that felt neglected and incomplete. But since this movie is almost 3 hours long you can get over that and just make your own endings for them. Overall a very enjoyable Bollywood style film."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "bwboi1",
        "review_rating": "8",
        "review_title": "Good Movie.",
        "review_detailed_main": "I was at the premiere of 'Dil Bole Hadippa!' at the Toronto International Film Festival. The film is a story about a girl going after her dreams to play in a big league men's cricket team. The film portrays a lot of Indian Punjabi culture and is very patriotic. Fabulous acting by Rani Mukherji playing double roles in the movie. Shahid Kapoor also delivered a brilliant role as the head coach of the cricket team. The film was well directed and produced. I personally did not like the music that much except for a couple of tracks. It is a relatively decent movie for family viewing. Overall, this was a well-made movie accompanied by a good story."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "razieh_99-551-40826",
        "review_rating": "10",
        "review_title": "My favourite movie of 2009",
        "review_detailed_main": "This has got to be the best movie for 2009 hands down!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! It was So funny, fun , entertaining ,romantic. Its a movie for everyone. So if you like comedy it has a lot of that. If you like sports it has that. If you like romance it has that too and if you like a couple looking really good together you got it!!!!\n\n1. Shahid and Rani look So So So So good together!!!!!!! The best couple ever!!!! 2. Rani was so funny and entertaining. 3. Shahid was so hot and played his character just right. 4. GREAT songs.\n\nAnd\n\n5. If you have not seen it.......... Go and watch it !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nThis movie doesn't deserve a 5 it deserves 20!\n\n10 stars man!!!\n\n10 Stars!\n\nIn one week i watched it more than 20 times!!! it is so good!!!!"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "ketaki-dutta",
        "review_rating": "9",
        "review_title": "Good entertainment",
        "review_detailed_main": "I do not know why this movie got only 5.0. I personally liked the movie. Its a good, light-hearted movie with a known theme but a new message in it. Instead of blatant India/ Pakistan match, its about sex and gender. Surprisingly Rani looked good with Shahid (I was skeptical about it at first)..it was really nice to see this unexpected couple. Though this movie is a remake of the movie \"She is the Man\", I enjoyed myself thoroughly. Anupam Kher, Dilip Tahil, Poonam Dhillon were in cameos, but they did justice to their roles. I have no idea why this movie is rated so less, I really liked this movie. It's short, simple, feel-good family movie, to be enjoyed with a packet of popcorn. I would ask everyone to go and watch this movie. I am sure you will not be disappointed."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "sanj00",
        "review_rating": "9",
        "review_title": "Above average movie for sure",
        "review_detailed_main": "Ahh..Sorry but not that bad of a movie at all. If Sherlyn Chopra gets 3 stars then the movie certainly deserves 10 stars for sure..:) Sherlyn looks average. I agree movie is not exactly super hit quality, but above average and provides plenty of entertainment.\n\nIt does have similar theme as the Hollywood flick, but pure Indian from start to the end with plenty of Punjab, Indian values and Indian style entertainment values.\n\nWay to go Yashraj Film, certainly not your best work but we enjoyed it a lot. The Lahore and Punjab cricket rival was cute concept.\n\nCertainly 10 times better then Akshay Kumar's junk movies."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "Pratik112",
        "review_rating": "8",
        "review_title": "A Good Entertaining One To Watch",
        "review_detailed_main": "Not having been able to watch much of the promos of this movie, I had little idea that this would be based on the game of cricket. But this was not like Yashraj's big hit two years ago, \"Chak De India.\" A young and a fiery Punjabi person dreams of playing in a local cricket team. That person is good at batting as well as in everything else that has to do with the game but the problem is that the person is a female and at first she is not accepted. Then she decides to put on some make up and looks like a male and is allowed to join the team once she's proved her skills.\n\nStarring Shahid Kapur, Rani Mukherjee, Anupam Kher, Poonam Dhillon, Dalip Tahil and Sherlyn Chopra. Rakhi Sawant makes a brief appearance. This is directed by Anurag Singh and is produced by Yash and Aditya Chopra.\n\nRani Mukherjee has performed well in this movie. She has also done well when playing the game as well and taking in the fact that she is capable of doing something that has not been achieved by all that many great batsmen of the world six sixes in a row. Shahid Kapur keeps on improving with every film that he has acted in and it is nice to see him in a Yashraj film. Anupam Kher and Dalip Tahil were also good in their respective roles as was Sherlyn Chopra but what made it so nice was to see Poonam Dhillon back on the screen after such a long time.\n\nThe story is predictable and that, perhaps is the disadvantage that this film has and there are times that it makes one remember past Yashraj Film \"Dil Walleh Dulhaniya Lejayenge\" and also \"Hum Aapke Hain Koun!\" There are a couple of good songs and especially the title song that is worth listening.\n\nIt may be predictable but nevertheless, it is a entertaining movie which does have some good laughter as well as romance in it. But for those who do not enjoy cricket, you may find it boring.\n\nI think I have only seen Sir Gary Sobers of West Indies hit six sixes in a row."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "Filmicafe",
        "review_rating": "8",
        "review_title": "Dil Bole Hadippa - Review",
        "review_detailed_main": "Following the phenomenal success of New York, Yash Raj Films returns with the much anticipated 'Dil Bole Hadippa'. With many expectations and questions tied to the film. Will Yash Raj's winning streak continue after the success of New York? Will Rani Mukherjee be able to deliver an equally stellar performance as Veer and Veera? Is the Rani and Shahid Jodi's chemistry quotient high? The plethora of questions are answered with a resounding-Yes! Dil Bole Hadippa is a highly enjoyable, light-hearted family film with a theme that connects with one and all-Cricket.\n\nThe film does give one a sense of déjà vu with the essence of a typical Yash Raj Film where you are taken back to the days of Dilwale Dulhania Le Jayenge, Veer Zaara and many other Yash Raj classics. Dil Bole Hadippa is a light hearted romantic comedy which touches on serious issues in our society such as gender biases and inequality existent in society, but does so in a very light-hearted manner.\n\nVeera (Rani Mukherjee) lives in Amritsar with her Uncle where they coordinate for an Art/Dance show to make a decent living. Despite having a 'Nautanki' show where you have Shanno (Rakhi Sawant) stealing the hearts of all the men, Veera dreams about playing cricket in the big leagues with Sachin Tendulkar and Mahendra Singh Dhoni. In short Veera is a small town girl with big dreams and she eats, breaths and sleeps 'CRICKET'.\n\nRohan (Shahid Kapoor) lives with his mom Yamini (Poonam Dhillon) in England. He's an all rounder for English County Team. Rohan is Indian at heart but is a foreigner outwardly. Due to unforeseen circumstance Rohan parents are separated but the bond between the father and son continues. Rohan comes back to India to help his dad Chaudhry Vikramjeet Singh (Anupam Kher) who has dream to win the Aman Cup (Peace Cup) but has been on a losing streak for the past 8 yrs. Rohan takes up the challenge to make winners out of the 'Indian Tigers'. Sheer circumstances turn Veera into Veer to break the barrier to fulfilling and living a dream and what follows is hilarious, touching and moving all in one breath.\n\nWill Veera be able to pull the double role 'Veer' convincingly without being caught? Will Rohan be successful in fulfilling his dad's dream? Will Veera finally achieve her dream of being a cricketer? Anurag Singh makes a confident directorial debut with Dil Bole Hadippa. From the first frame till the climax the director definitely delivers a promising debut venture. The emotional sequences are well executed and the comedic scenes are absolutely hilarious reflective of sincerity and immense maturity.\n\nThe film could have been crisper in terms of editing and scripting. The film has its share of faults which make you wonder such as Why Shahid Kapoor who plays an NRI from England didn't have a British accent? Rani's speech where she is trying to convey a message to the crowd is not as compelling as it could have been. Furthermore, the film has a lot of resemblance with previous Yash Raj Films and may leave a segment of the audiences looking for something hatke a tad discontented.\n\nThe film works because of the equation between Shahid and Rani. The two wonderfully complement each other and their love story is pinned not as a conventional candy floss tale but the story is told in a delicate manner. After the success of Kaminey, Shahid's portrayal as Rohan introduces a new age romantic hero.\n\nRani fits the roles of Veera and Veer to the T! The body language and the right accent required to play a 'Bindaas' Sardarji is challenging to say the least but Rani pulls the character off with such ease, it is a stellar performance from the actress and should definitely win her many hearts and accolades. Rani as Veer makes you fall in love with the character so much so that you find yourself forgetting at times that it is actually Veera playing Veer.\n\nThe supporting cast: Rakhi Sawant, Anupam Kher, Dalip Tahil, Poonam Dhillon, Sherlyn Chopra are first rate and add a freshness to the film. The music of the film by Pritam brings the earthy feeling of Punjab which is incorporated well with the story of the film. Ishq Hi Rab Hai and Discowale Kisko being the pick of the lot.\n\nThe film should prove to be lucky for the Yash Raj Films banner. The film will be facing fierce competition at the box-office from the Salman Khan starrer, Wanted. Who emerges as the winner will be upto the audiences' verdict. Dil Bole Hadippa is a simple, inspiring tale of hope which makes one feel joyful and cherry and will your heart go Hadippa!"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "AishFan",
        "review_rating": "8",
        "review_title": "Fun comedy, great performance, & interesting theme",
        "review_detailed_main": "Dil Bole Hadippa is a wonderful, light-hearted, escapist comedy! Most obvious and notable is Rani's performance--a free-spirited girl who can't be stopped from chasing her dreams. Her comic timing is brilliant, and her girl-next-door look suited the role just fine. Shahid Kapoor, the new big star still getting praises for his work in Kaminey, also is quite good. Rati Agnihotri is marvelous.\n\nA few minor parts are a bit filmi/too idealistic such as the over-friendly intermingling of the Indian and Pakistani villagers before and after the match (wish I'm wrong). The main concept/theme of the movie is quite revolutionary and may be difficult to digest. I certainly had never thought of it before. In sports, why are there separate teams for men and women? Shouldn't the goal be to have the best players?...regardless of gender? Before watching this movie, I used to think that, on average, a guy is more athletically capable than a girl. That's why there are separate teams to keep the competition level. Now I see that it is unfair to put a girl to an inferior level or standard just because she is a girl. Is our society too male-dominated for the male ego to accept that a woman can do better than or even as good as a man in something traditionally associated with males?"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "dattaa",
        "review_rating": "9",
        "review_title": "DBH is an all-rounder!!!",
        "review_detailed_main": "Wonderful film! Uplifting, intelligent, entertaining and, overall, satisfying!\n\nRani Mukherjee earns great props and huge kudos for a tremendous performance - charismatic, beguiling and absolutely stunning! This extravaganza has something for everyone. On every level of human relationship - inter-national, inter-cultural, inter-personal and inter-sexual - the plot, performance and storyline takes you on a most wonderful and fulfilling cinematic journey!\n\nAnd did I mention the dazzling, energetic, utterly-refreshing dancing and singing? DBH is a multimedia-rich feast, laden with every primary color in the swatch book, with delightfully-designed sets and costumes, and enough sensual body language and male-female interplay to entice a blind man to see again and a dulled, desensitized one to actually feel something human again - as if for the first time!!!\n\nThe underlying, yet potent, commentary on women's rights & equality of sexes is a welcome breeze of enlightened social awareness and intelligent commentary and Rani M's vividly-brilliant animation of an inspiring, thought-provoking subject and story line makes this project all the more engaging and worth watching.\n\nMs Mukerjee REALLY does deserve to earn every media award and industry accolade for the amazing breadth and depth she musters and displays on the big screen in rendering and enlivening her lovable, unstoppable character in this heart-touching tale...\n\n...Dil Bole Hadippa!!!!"
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "jsot-22714",
        "review_rating": "10",
        "review_title": "Indeed, 10 stars",
        "review_detailed_main": "This film is a microcosm of India - there are many beautiful and transformative layers!\n\nThe experience of this story, visually and aurally, is a feast: it must be savored and appreciated for all that it delivers.\n\nThe 3 major actors, Rani Mukerji, Shahid Kapoor, and Anupam Kher, inhabit the humility and courage to engage in the levity of their respective characters and the heart to mine the vulnerable and core parts of this rich story.\n\nMetaphorically, the cricket games and the storyline's matches, serve as the infrastructure for what is always most important, love.\n\nWhen love is the source and motivation, victory will always be the aim and claim amidst the troubles encountered.\n\nThis is a family film- for generations, to enjoy and to be inspired."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "gurmeet-singh",
        "review_rating": "8",
        "review_title": "A colorful & zesty movie with a great heart",
        "review_detailed_main": "Dil Bole Hadippa is a very enjoyable movie for all ages. It is colorful and zesty. It is spirited and frolicking. If you do not know what it is to feel Hadippa - watch the film. Its what you will feel whenever Rani steps out on the field with her cricket bat. Its what you will feel when you cheer for every person to have an opportunity to go after their dreams. Kudos to Rani for a wonderful act. And kudos to Shahid for a good support act. This one could just be another Jab We Met - panned by the critics but lapped up by the audiences. Go see the movie and let your heart feel Hadippa. And take your kids along. Give a feel good start to the Dusshehra holidays season."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "mayurika-s-1",
        "review_rating": "10",
        "review_title": "The movie is great",
        "review_detailed_main": "After watching Rani's steady bad films , but still sticking to being her fan. This movie was a very pleasant surprise. The movie has everything.. Romance, Woman respect and encouragement, Cricket passion, India and Desh Bhakti.. it is a total mas ala film and on top of the timing of comedy by both Shahid and Rani. It was a different movie which kept me entertained and I did not feel cheated.\n\nThe songs are not memorable but are colorful and well choreographed by Vaibhavi Merchant. The theme of the movie is goos nad nowhere it gets boring.\n\nAll in all a must watch... Rani is back..."
    },
    {
        "movie_id": "tt1202540",
        "movie_name": "Dil Bole Hadippa",
        "movie_rating": "4.7",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Another Amateurish Yashraj Flick Made Watchable (To An Extent) by Ms. Mukherjee",
        "review_detailed_main": ""
    }
]