[
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "angelshalz",
        "review_rating": "8",
        "review_title": "Depends on how you look at it...",
        "review_detailed_main": "What can I say about \"Welcome!\" ( I added the exclamation mark at the end because it fit so well) other than the fact that it rocked my socks off. It was hilarious, and yes, silly hilarious. Yet I know that it would not have been so entertaining if it weren't for the brilliant actors (Anil Kapoor and Nana Patekar were amazing) and pretty good songs. Anyways, it would take a lot of talent to explain the plot to anyone because it's one of those chaotic slapstick comedies that you just have to check out for yourself, and only watch once. But in a nutshell, it is about this really decent man (Paresh Rawal tearing it up as the timid doctor) that would like his decent nephew, Rajiv (Akshay Kumar) to get married. Now comes in the hot Katrina Keif (who cares what her name was?) who, after a medley of hilarious situations, falls in love with Rajiv. There's only one problem with this, her brothers are big shots in the underworld\u0085and are not very modest. \"Welcome\" is welcoming if you allow yourself to be invited. Don't go watching it with expectations that it will be the cleverest and most sophisticated movie you will see\u0085and when it's not, don't restrict yourself from laughing away to glory"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "plqc56",
        "review_rating": "7",
        "review_title": "A fun, good-natured comedy",
        "review_detailed_main": "\"Welcome\" is a enjoyable, masala comedy with an amusing cast. It has plenty of ridiculously unbelievable, cheesy moments and the film requires viewers who don't take themselves or the movie too seriously, and who know how to suspend their disbelief. Unfortunately, there are plenty of people who are unable to take the movie in the spirit it was made. Is it full of buffoons and a silly plot? Of course! But what makes this movie so charming is that - like plenty of other Bollywood films - it tells its story with such sincere, earnest conviction that you can't help but get sucked in.\n\nThe story is centered on a mafia family headed by two dons, played by the unfailingly charismatic Feroz Khan and the gifted Nana Patekar. Nana Patekar is trying to find a boy from a nice, decent family to marry his sister, played by Katrina Kaif (surprisingly, she is tolerable in this film). Aiding the don in his quest to find a suitable boy is one of Nana Patekar's lesser dons, played by Anil Kapoor. When they find a suitable boy (Akshay Kumar), things are complicated by the suitable boy's uncle (Paresh Rawal), who is not terribly excited about his nephew marrying into the mafia. And from this tangled web of conflicting goals ensues chaos and mayhem. Mallika Sherawat is also entertaining (if extremely confusing) as a random girl who is...confusing people.\n\nIt's a silly movie full of childish, mischievous comedy and feel-good moments, but I think that, in the end, that's what we value about Bollywood films: their family-friendly messages, the dazzling spectacle in scene after scene, fun filled madness and a talented cast. Nana Patekar and Paresh Rawal were especially impressive and quite adorable. It was amusing to see Akshay Kumar play a clueless good guy after being so used to seeing him as an action hero.\n\nThe only way to enjoy this movie is to throw brains and common sense out the window and enjoy it for what it is - a family-friendly comedy with lots of laughs and entertainment. It's a question of expectations. If you get this movie expecting to see something similar to a Hollywood film, then you will disappointed. Bollywood isn't anything like Hollywood, and there is nothing wrong with that. I didn't get this DVD expecting to see an Indian version of The Godfather. There are plenty of funny references to The Godfather in this movie, but the director clearly intends to parody the world and lifestyle of a mafia don, and I think he did a good job. It's a happy story that laughs at itself at every turn, and that's great."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "ceeedeee",
        "review_rating": "7",
        "review_title": "Enjoyable and entertaining",
        "review_detailed_main": "This is complete entertainer with iconic characters and so much fun . How many times I have seen this movie and still have a superb time ."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "pawanpunjabithewriter",
        "review_rating": "10",
        "review_title": "WELCOME to the best performed comedy movie in the history of Bollywood",
        "review_detailed_main": "Most of the people would have definitely watched this movie, some who haven't, and have come here to check the reviews must be the youngest generation teens and if not, the Englishmen interested in watching the Bollywood movies. My one statement to them - WATCH IT! Yayayaya, it's a little messy, but really well made by the director. My hats off to him, Anees Bazmee for really being able to create such an epic comedy movie. All the characters, oh my god, they are so strong, perfect and so solid and humorous. I've never seen so loving Villains ever before, yes they are villains but you would love them. Anil Kapoor, Nana Patekar, Akshay Kumar, Paresh Sir, and allllll others of them, ten ti twelve more have done a tremendous job , nothing better could have ever been expected. I love love love this movie more than any. This is my favorite comedy movie in the history of Bollywood."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "uncle_g1234",
        "review_rating": "7",
        "review_title": "Total froth, worth a watch",
        "review_detailed_main": "I'm making no pretense about this movie. The fact that Akshay keeps racking up the hits shows me there are an awful lot of people who are eager to spend their money for pure escape. So this movie is an honest transaction with no claims to art. For the millions who want what it offers, they can go without fear they will regret it. To me, the thing I liked best was the female cast. It is rare for a movie to bring together such an eyeful. I was sold by the trailers that showed Malaika, Katrina, and Mallika. And the movie delivered.\n\nOne comparison I'll make is with Kyon Ki and Garam Masala. When I watched those movie there were many moments when I was stopped by \"what in the world were they thinking?\" By contrast, I didn't really have those moments in Welcome. Also, Anil, Nana, and Feroze really added to the comedy. All three of them are solid performers. In fact, I'd say Malaika, Katrina, Mallika, Anil, Nana, and Feroze were the best things I found in the movie. No wonder it rang up such high sales."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "amitwb-31821",
        "review_rating": "10",
        "review_title": "I want to go back in that time.",
        "review_detailed_main": "What a time 2007 was!\n\n& right we are lacking for a good comedy movie...\n\n& yes Majnu bhai's painting is still famous in market."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Not the brightest crayon in the box",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "prakashthube",
        "review_rating": "6",
        "review_title": "He is not Mahesh Manjrekar....",
        "review_detailed_main": "You have mentioned in your Cast section that Mahesh Manjrekar as 'Pandit'. He is not Mahesh Manjrekar. The role of Pandit is performed by Mahesh Mishra. I have already sent you the correction but still it is not rectified. Mahesh Manjarekar is producer ,director ,actor, but he doesn't appear in film Welcome. This Mahesh Mishra was in APNA SAPNA MONEY MONEY. He acts in a popular TV serials.Office Office and Naya Office Office.He was there in a recent film One Two Three along with Heerji and Mukesh Tiwari.\n\nWelcome was a so-so film but Nana and Paresh Rawal were superb in this film.............."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "vatsalspandya",
        "review_rating": "9",
        "review_title": "Welcome to the Different Bollywood Comedy",
        "review_detailed_main": "Welcome takes bollywood's modern movies to a new level. Anees Bazmee comes up with a very well directed comedy unlike his previous and 1 or 2 next ones as well. It is a mixture of a little senseless comedy, great situational comedy and even some intelligent comedy.\n\nThe movie really builds on its very one-line story. This is because of its characters and the performances of the actors. Nana Patekar has really not given as much to comedy film as he could have given. As Uday Shetty, in his very own style, his expressions and involvement are a toast to watch. He sort of does what I feel Paresh Rawal did in the all-time-great Hera Pheri (Though, he was not as hilarious as Babu Bhaiyya). But I really loved his character. Equally good is Anil Kapoor who himself gives his best ever performance in a comedy movie. Majnoo Bhai is so caring, innocent, dangerous. There is so much liveliness and the \"taporiness\" in him that whenever he is on screen, you are bound to laugh.\n\nRest of the cast is more supporting to these two. Akshay Kumar very rightly gets a supporting comedy role at which he's very good. He takes care of his comedy and romance scenes well since he doesn't have the burden to run this comedy movie all alone. Katrina Kaif comes up with a good performance which is really charming. She really became comfortable with the guidance of many veteran actors. Paresh Rawal gets a chance to show that he knows the art of comedy even in a different style. Dr. Ghoongroo does give you the laughs in his not very much screen time. Then there also is Feroz Khan who comes and gives a direction to a movie and really holds it till the end. The only problem with this other cast is they make you smile but not really laugh. Else, Sherveer Vakil, Mallika Sheravat, are good.\n\nLastly, to generate more, this movie finds a place in an ever welcoming story that could get many more characters. Other actors like Asrani, Mahesh Mishra and all the little goons, the film-making crew are all enjoyable and have the punches. These people have some punches delivered very well.\n\nIt is a treat to watch a bollywood movie with such a good level of situational comedy and the sort of creation of comedy (Uday's horses and onions). I may be crazy in watching this movie more than 10 times but every time it makes me laugh. You just need the right sense to see it.\n\nSee this movie for its performances and the comedy that really comes out of nowhere. The lack of story never really becomes a problem, he only real problem in this movie was the music in which \"Hoonth Rasiley\" was bad while the others okay and one like \"Kiya Kiya\" fairly decent.\n\nWELCOME is a treat to watch. You will come out of the theater saying that it was a very good movie but only if some of the scenes were given a try to be made hilarious, it could have been much much better. (the one rating missing due to that)."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "chrichtonsworld",
        "review_rating": "6",
        "review_title": "Nice little comedy",
        "review_detailed_main": "The comedy used in this movie is similar to that of a comical play. A lot of situations are exaggerated and never would happen in real life. A lot of the time some situations don't make sense at all. Problems are created and if you think about it are no problem at all. This is done on purpose, purely to entertain. So someone saying that this movie isn't realistic is missing the point. The actors know that the story has to be taken lightly. The structure of the movie can be confusing. But that can be blamed on the director. From what I understand that this is his first project. But I must say for that he did quite OK. Even when the direction could have been better the actors do make up for that fact. Overall this is a nice little comedy that will grow on you and is purely fun."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "bobbysing",
        "review_rating": "4",
        "review_title": "A comic of jokes edited together and gains momentum in the second half.",
        "review_detailed_main": "The latest in the inspired comedy series is this laugh riot which is full of stars. The basic plot is inspired from the Hugh Grant movie \"Mickey Blue Eyes\" (1999). Even the hero's profession is kept same as an art house auctioneer. But then the script takes on indianized plots and tries to make you laugh through comic sequences. No doubt the promotional packaging was superb which surely gave the movie a big initial draw at the cinema houses. But the content is rather not impressive and its like several comedy sequences joined together. The focus of the screenplay keeps shifting from one plot to another. The biggest disappointment is that it has less of Akshay and the viewer keeps waiting for the scenes with his brilliant timing. There is more of Anil Kapoor & Nana Patekar as two dons. Nana is kind of same with his expected mannerisms but Anil is superb and acts like he is enjoying every minute of his act. He even looks a lot younger than his age. Feroz Khan looks graceful but is loud at some scenes. He has more scenes in the climax of the movie and is also introduced after the interval. The heroines are only there for the glamour quotient of the movie and could not ask for more in this heavy star cast movie.\n\nThe first half of the movie has many unwanted sequences which are only inserted to create laughter and have nothing to do with the screenplay. But the film gains momentum in the second half when Vijay Raaz enters as a phony film director. In fact in my opinion this plot of making Nana an actor in a fake film should have been the highlight of the movie, which could create more laughter's in the cinema.\n\nThe songs are all inserted as usual and only few are hummable. The best part of the movie comes towards the climax after Katrina accidentally shoots the son of Feroz Khan. The chase and the play with the dead body afterwards is surely hilarious. It is the main highlight of the movie as you get to see some quality comedy scenes and timing in this. In all the film is not as expected but still will brings audiences to the cinemas due to the superb promotional packaging, immensely popular catchy title song \"Welcome\" and due to the current hot thing in Bollywood – Akshay Kumar."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "bhavikapattni",
        "review_rating": "9",
        "review_title": "The best comedy movie of this year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "leiberman_scratcher",
        "review_rating": "6",
        "review_title": "Worth watching once!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "rahul_gn",
        "review_rating": "5",
        "review_title": "Patchwork",
        "review_detailed_main": "The movie is nothing more than it promises to be...a series of jokes tied loosely together. Although some of the jokes are old and repetitive, watching actors like Paresh Rawal (character borrowed from Albert Brooks in the Michael Douglas starer 'The In-laws'), Akshay Kumar (character borrowed from Hugh Grant in 'Mickey Blue Eyes'), Anil Kapoor & Nana Patekar get their comic timing right is priceless. Anil Kapoor proves once again what he did in Janbaaz and Trimurti: he is definitely one of the best on-screen bad boys of Bollywood.\n\nKatrina and Mallika both look stunning, which perfectly and exactly serves their purpose in the film.\n\nWatch it only for the above listed reasons and none other."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "rajahamza-62985",
        "review_rating": "10",
        "review_title": "Should be listed in the top 10 comedies ever made worldwide",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "rosh007",
        "review_rating": "",
        "review_title": "Neither Mahesh Manjhrekar Nor Mahesh Mishra",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "Dream_Woman",
        "review_rating": "7",
        "review_title": "Loved it so much!!!!!!",
        "review_detailed_main": "I thought this film was just brilliant, the only thing that kind of ruined it for me was Mallika Arora's Item number, it was really cheap and cheesy and i really hated it, but apart from that the rest of the movie was just fantastic.\n\nRajiv is on the lookout for a bride, he meets Sanjana played by (Katrina Kaif and i must admit that her acting skills have improved a lot since she first came into the industry and she was really good on this movie) and it is love at first sight anyways as the story progresses Sanjana brothers Majnu (Anil Kapoor, he played his part so well and is a true villain) and Uday (Nana Pataker who is so underrated as an actor, i really hope he makes more great films in the future, he was also brilliant in this films and had me in stitches ) Anyways my favourite character would have to be Gungaroo LMAO (Paresh Rawal) he was so funny in this film and i could not stop laughing, there is no one like him in the industry and he is one if the best in a comedy role, He plays Rajiv's uncle who is trying to find him a bride.\n\nFeroz Khan another great actor i loved his part as RDX in the film and i just love him to bits, he is one of the best and i hope that he makes more great films in the future.\n\nAs for Mallika Sherawat?????????? well she played the love interest for both brothers Uday and Majnu, her part was pretty pathetic and useless, Mallika really is boring, until she plays a part where she can act and not play the same cheap role i am going to stay away from her films in the future.\n\nLike any typical Indian film Rajiv gets his bride in the end."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "soorya-007",
        "review_rating": "10",
        "review_title": "One of the best comedy.",
        "review_detailed_main": "Still it is more enjoyable than any of nowadays comedy movies.\n\nSimply love it."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "oscarflash",
        "review_rating": "6",
        "review_title": "Good but too long",
        "review_detailed_main": "I think this movie would be much better the editors made it 2 hours only.\n\nKatrina was lovely, Akshay Kumar was funny.\n\nthe music was good.\n\nAll in all, it's not a great movie and you can't compare it to modern movies.\n\nyou can enjoy it to some level."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "amitghattimare",
        "review_rating": "9",
        "review_title": "A perfect entertainer even after a decade",
        "review_detailed_main": "After more than a decade since its release, I am writing this review after seeing it for like the 3rd time. The movie has been the source of several memes in the last couple of years including the iconic \"Alu lelo0O, kande lelo0O\", \"mirakal, mirakal\" among few others. There is hardly any 10 min stretch in the movie that won't make you laugh or admire the creativity and sarcasm of the writer/director. The characters of Udai, Majnu and Ghungroo will always stay in our funny memories. Akshay does a decent role, and Katrina, with her beauty, pulls off another one with the Khiladi. It is one perfect movie to watch with college friends, or family members. All the songs are still pleasant to hear, make your feet move, all while keeping the humor level decently high. If you haven't watched it, you're missing some original comedy."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "WorldMovie99",
        "review_rating": "7",
        "review_title": "Really comic !",
        "review_detailed_main": "Welcome 2007, welcomes you to the really funny world of underworld Mumbai, where the most feared gangster Uday is tensed reagrding his sibling's marriage. He despite being an underworld figure wants his sibling marriage to be arranged with a decent respectable and well to do family. In such a serious tone, the BGM with desi beats of 6 measure adds the hilarious sense. Uday trying his hand in acting despite being ruthless, Rajeev turning into an astrologer for a moment, Vijay Raaz as the fake director, are some of the memorable funny scenes of the film.\n\nSanjana, the sibling falls in love with Rajeev, and then the twist starts to unfold. Majnu, younger brother of Uday who is perhaps feared more than Uday clashes sourly with Rajeev's uncle. But within that serious tone of hooliganism, majnu aspires to be a painter who paints pictures in the middle of road, even creating traffic without any sense of civil life. That particular character through various ups and downs progresses hilariously throughout the film.\n\nAll these issues complicates further when Uday and Majnu falls for the same girl set up by Rajeev in order to deflect them away from their illegal businesses. When all these intertwines, then suddenly their boss RDX appears and this becomes further complex when RDX's son appears in the scene. I will stop here and urge you to watch it, to get a full funny scenario, with lots of masks getting unmasked, lots of fake drama getting real and vice-versa etc, which finally ends in reunion of the whole characters involved in a happy ending. My favorite funny scenes are that of Majnu vs Ghungroo. The statement 'Sirf naam Ghungroo hai mera lekin koi baja nahi sakta mujhe' still retains the fun flavor in 2024. There are many such kind of....\n\nWelcome is really a comic film that intends to deliver a fun time with different types of funny traits all combined into one. It well succeeded in its attempt, though some songs were not needed I feel. The romantic songs weren't important, but of fun scenes. Some scenes were also not funny either rather serious but as a whole it is well made family watching funny film. A 71/100 based upon it's merits and flaws."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "scorpiofrenz",
        "review_rating": "4",
        "review_title": "\"Welcome\"..No Thanks!!",
        "review_detailed_main": "When you have such a strong cast, you also have lot of expectations from the film. 'Welcome' does not live up to the expectations at all! It is a \"so-so\" film, okay to watch on cable, but definitely not worth spending money in the theater. There is nothing new to it; it is another example of good actors coming together and not being able to create anything special! The story is very predictable, and is a kind of patchwork from various films. For example, Nana Patekar's character Uday Shetty is a cross between Shankar from Major Saab (a don, who is a loving brother), and Aslam Bhai from Love Ke Liye Kuch Bhi Karega (LKLKBK)(a don with a strong passion for acting). He is a goofy goon, as portrayed by various actors in innumerable films; Sanjay Dutt in Hum Kisi Se Kum Nahi (2002), Johnny Lever in LKLKBK (2001), to name a few. Nana Patekar is his usual self, with nothing new to offer as such. Anil Kapoor is another don, named Majnu Bhai, a close associate of Uday Shetty. He has done a pretty good job with his role, and definitely adds on to the value of the film. One can easily notice that Majnu Bhai's character takes a variety of traits from Circuit of the Munnabhai series, Crime Master Gogo of Andaz Apna Apna, and other similar \"comic sidekicks\". Paresh Rawal is decent as Dr. Ghungroo, but his acting is repetitive from so many of his other movies. Even though Akshay Kumar is the hero, he is often sidelined by the dons, and we don't get to see much of his impeccable comic timing. Feroz Khan is OK as the \"Godfather\" of the dons. The heroines (Katrina Kaif and Mallika Sherawat) seem to exist merely to add oomph value.\n\nThe film drags all along until the climax, which is pretty much the only enjoyable part. The dialogues are not great..or rather, they are quite \"ghise peete\". Songs are okay, but often seem forcefully inserted into the script in places where no song is needed! All in all, a forgettable movie.\n\nIt definitely did not seem like a \"Welcome\" change from the norm!"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "sashiv-rajiv",
        "review_rating": "10",
        "review_title": "BEST COMEDY FILM EVER IN BOLLYWOOD",
        "review_detailed_main": "Best film and Best acting ever by all action Actors .. Best and All best moview ever"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "waqassaleem-85201",
        "review_rating": "7",
        "review_title": "Full on family entertainment",
        "review_detailed_main": "A good movie for the whole family. Definitely a film to watch where you don't use your head a lot. Good acting by the whole cast. The first half of the film was good but it did start to go downhill after the middle. Still good though and definitely worth a watch."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "ssvikas",
        "review_rating": "3",
        "review_title": "Predictable and dragged to the limit of patience",
        "review_detailed_main": "When you know that Akshay Kumar and Paresh Rawal are together, you know that you are in for a typical Masala comedy. Jaded Nana Patekar, Anil Kapoor and Feroz Khan join in the Melee. While what you might expect would be another Hera Pheri or a No-entry, this one falls flat even if you get into a movie hall with Nil Expectations.\n\nNana plays Uday Shetty, a don whose sister Sanjana (Katrina) falls for Rajiv (Akshay) whose uncle Dr Ghungroo (Rawal) wants him to be married to a family with no criminal record. In a comedy of errors, Rajiv falls in love with Sanjana and is now faced with the prospect of marrying someone from a crime based family or face mafia style death.\n\nThe film’s only selling point is Akshay Kumar who has been having a run with his comic Movies. With Katrina in it, this one looked like a mafia version of Namaste London, in a silly style. If Akshay continues with mediocre stuff like this, his luck may run out. Nana is past his sell by date. Anil Kapoor and Paresh Rawal are just around average.\n\nComing to comedy, the rare comic parts in the movie are when Nana, the don tries his hand at acting in a movie and is courted by Mallika Sherawat. Partly funny are scenes where Anil Kapoor turns painter and is courted by Sherawat again. The climax sequence involving almost all characters is too pointless to be even discussed.\n\nTalking of its entertainment value, Welcome makes you regret for paying to watch this movie. You may even fall asleep during some clichéd scenes. As for the songs, most of them are way below average and are all thoroughly ill timed. Keep Out!"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "rgupta-08025",
        "review_rating": "10",
        "review_title": "Best comedy movie",
        "review_detailed_main": "Best comedy movie....loved the movie.... everyone has acted their best...."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Weak comedy with mediocre acting, rather boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "vijayathethinker",
        "review_rating": "6",
        "review_title": "sincere attempt by sincere artists for sincere entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "Aman_Goyal",
        "review_rating": "10",
        "review_title": "Best comic film in Bollywood",
        "review_detailed_main": "One of the best comedy film of Bollywood. Paresh, Nana and Anil are hilarious. So are Majnu Bhai's goons. Akshay Kumar is in a serious character in the film and looks charming throughout the film. Akshay-Katrina prove that they are one of the best on-screen pair in Bollywood and certainly best of that decade."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "Puroo",
        "review_rating": "9",
        "review_title": "Heavy nostalgia",
        "review_detailed_main": "Every time I watch this film, it takes me back to the days when we had just purchased a TV. There was no internet, the only entertainment was playing with my toys or playing those demo games I had on the family computer. And every time I watch this film, it reminds me of the exact same scenario I was in when I watched it for the first time. Welcome is my favourite Akshay Kumar film of all time, not just because of how good it is, but also because it comes from what I like to call the \"golden age of Bollywood comedy\", when films like Dhamaal, Phir Hera Pheri, Sunday used to be made.\n\nThe film has multiple characters, each one having their own thing going on. Since Ghunghroo wants to get his nephew Rajiv married in a clean family, while Rajiv doesn't like his uncle's behaviour. Meanwhile the dons Majnu Bhai and Uday Shetty want to get Uday's sister married to a clean family too and so they threaten Rajiv and his family to marry her. Then there's RDX and his son Lucky, who are much bigger gangsters than Uday and Majnu and thus don't want them to give up their ways. And RDX is triggered heavily by Lucky's false death. There are many other minor characters like the director played by Vijay Raaz and Ishika played by Mallika Sherawat.\n\nThe film is one of the better comedy films that Bollywood made in the golden age, considering it's a completely original idea while paying homage to the house scene from the end which is taken from Charlie Chaplin's Gold Rush. The movie directing scene is hilarious, and so is the part where Ghunghroo is trying his best to avoid Majnu at Sun City. The Passing the Parcel part is the one which absolutely takes me back to the child me who was playing Virtual Sailor and occasionally looking at the TV.\n\nWelcome is the film I see every time it comes on TV. I really like everything about the film except the campy acting in some scenes, especially by Katrina Kaif. I really wish the sequel captured the same essence that this film did, because it fails heavily in that aspect."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "m_shankar20",
        "review_rating": "2",
        "review_title": "Glorious Waste",
        "review_detailed_main": "If Anees Bazme had set out to make a load of crap, he has succeeded brilliantly. 'Welcome' probably has one of the best star cast seen in 2007. But all have been wasted without regard on a script that is worse than what kindergarten kids come up with.\n\nIt is a wonder that still some people, other than Feroze Khan himself, want to cast him in their films. Thankfully, he does not have much screen time. But even he seemed much more bearable compared to the rest of the mindless proceedings of the film. I hardly understood some of the song lyrics. I guess it was intended to just add to the crap.\n\nNot much to write about, but hope this sounds a warning bell to Akshay Kumar. He has an excellent sense of comic timing. But he is getting boringly repetitive. If he does not want to end up like Govinda, it is high time he looked seriously at his work profile."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "jafrihammad",
        "review_rating": "10",
        "review_title": "Superhit",
        "review_detailed_main": "Superhit movie, best dialogues, nice story. From starting to end there is comedy in every scene. Anil Kapoor and Nana Patekar roles are the highlight of the movie. Treat to watch!"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "silvan-desouza",
        "review_rating": "1",
        "review_title": "One of the worst piece of comedies",
        "review_detailed_main": "Anees Bazmee made big money with NO ENTRY which was far better his film is absolute trash Tries to copy MICKEY's BLUE EYES but falls flat The start scenes itself are boring, Nana's track is quite funny while Anil- Nana scenes are fun earlier, Akshay's track is one of the most boring part of the film Sadly and strangely his scenes with Katrina fall flat Anil trying to frighten Akshay Kumar or some more scenes are quite funny But overall the entire comedy falls flat and there is nothing even funny about the film The story falls flat and the last few scenes are so bad that you feel like choking yourself and laugh at the directors What the heck ? Any thing they make and make money at the Box office How such films work?\n\nAnees Bazmee gives his worst film ever His only decent film was Pyaar To Hona Hi Tha While NO ENTRY was also quite good Music is okay, though Himesh songs sound boring and too many songs especially the item song look forced Cinematography and digital effects are bad\n\nPerformances Nana has done pokerfaced comedy several times, here too he does it brilliantly and does a good job especially in the shooting scenes Anil too is hilarious in his part Akshay Kumar is a letdown, known for his great comic performances here he just falls flat, it seems he was trying to play his part like Agastya Rao he played in JAANEMAN but his act looks monotonous here Katrina Kaif is horrible as usual Malika Sherawat is better then her in a small part Paresh Rawal is monotonous Feroz Khan hams as always"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "bhvkbhoir",
        "review_rating": "10",
        "review_title": "A complete comic relief",
        "review_detailed_main": "Great acting. Witty dialogues and excellent comic scenes. A movie that you can watch any time."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "rajeevrockz",
        "review_rating": "10",
        "review_title": "Funny ...Very Funny !",
        "review_detailed_main": "Welcome is a great movie . Akkshay Kumar and Co. manage to keep u in splits throughout .Katrina Kaif is looking as gorgeous as usual.Paresh Rawal fits his role to perfection.Nana Patekar is shown in a different role and does it amazingly.Anil Kapoor does manage to overact but is still funny sometimes.The other side actors also do their job pretty well.Forgot to comment on Mallika ....but she doesn't do much and was not really impressed by her acting.Special mention to a one legged guy in the movie...don't know his name but you will find out when you watch the movie.The first half keeps you entertained.In the second half you wonder whereas they are going over the line with the comedy thing.If you really want to have fun in this movie don't think much while watching it.To sum it up ...Go Watch Welcome !"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "divyaguptatx",
        "review_rating": "10",
        "review_title": "greatest cinematic debut of all time",
        "review_detailed_main": "The greatest cinematic debut of all time since the camera was invented. perfection and nothing less. This movie takes elements from charlie chaplin, pulp fiction, the godfather, casablanca to create the masterpiece metaphorical genius that is welcome. Truly quality work well worth your time."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "raihannajm",
        "review_rating": "1",
        "review_title": "Waste of time .no theme and story",
        "review_detailed_main": "If you like to waste your time go watch this long movie"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "rabiashehzadi-74754",
        "review_rating": "10",
        "review_title": "Movie of all time",
        "review_detailed_main": "Akshy Kumar is the one of the best actor that gives Bollywood movies a new zeal of growing well..Best performance is only done by Akshy Kumar.."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "devanshmay",
        "review_rating": "9",
        "review_title": "Classic!!!",
        "review_detailed_main": "One of the best family entertainers. A perfect masal film."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "Krazzy4",
        "review_rating": "10",
        "review_title": "Welcome is a Good comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "IPyaarCinema",
        "review_rating": "8",
        "review_title": "Nostalgia And Memes",
        "review_detailed_main": "Review By Kamal K\n\nI've always loved Welcome. It is pure nostalgia for me. I remember so many jokes in this that made my stomach hurt from laughing as a kid and they still do. This is still one of the funniest movies I've ever seen. Nana Patekar and Anil Kapoor duo is brilliant here. If there's any reason this movie works, it's because of them and their chemistry. Akshay Kumar is great as well. The raw, dry humor combined with the fact that the movie is tongue and cheek, makes for a great time everytime I see it. The romance is where I have a few issues, but the comedy works so well that I can look past it."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "naveensao",
        "review_rating": "8",
        "review_title": "Must watch as only comedy movie",
        "review_detailed_main": "Excellent comedy timing, excellent music, excellent work by all actors. Nana and Anil leaves their mark once again."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "devarun-69616",
        "review_rating": "10",
        "review_title": "Cult classic comedy",
        "review_detailed_main": "You can watch it and laugh at the same scenes even after 13 years of it's release. That's what it is and underrated comedy classic"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "salmanrondo",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "Full on laughter and really a Good movie to uplift mood with some really soothing songs ."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "mundeparth",
        "review_rating": "9",
        "review_title": "Such A Low Rating To This Entertaining Movie",
        "review_detailed_main": "This movie is not a Brainless comedy movie but it's pure situational Comedy. The Story is very descent but the Actual magic of this movie is Acting performances of all the actors . Akshay , Paresh Sir ,Anil Kapoor were great even Kat was descent but Nana Patekar was literally lit and Outstanding . He used to steal the show whenever he use to be on Screen. The dialogues were very well written and they were Executed really well .The movie is a great Family Entertainer and this is Now A classic in Best Comedy Movies. I can't still believe Critics hated this movie and That's the reason this great comedy movie has got such a Low Rating but This movie literally deserves atleast 7.5 ."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "trishsuraj",
        "review_rating": "9",
        "review_title": "One the best comedy movie",
        "review_detailed_main": "If you want to refresh your mind just watch this movie. Every character are memorable and funny. No vulgar jokes are used , every comedy scene are situational and it the plus point for the movie."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "Raja79",
        "review_rating": "8",
        "review_title": "Old Bollywood",
        "review_detailed_main": "This movie is the definition of the 2000s era of Bollywood, and oh what a great era it was.\n\nThis movie is a reminder and reflection for Bollywood and what it can be, and how entertaining it can be!"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "nksarker-19829",
        "review_rating": "10",
        "review_title": "STARCAST 😘, HILARIOUS 😂 PLOT",
        "review_detailed_main": "Was watching the 2nd part... And found it blatant and boring.\n\nSearched for the 1st film to know why 2nd part was made. Found 1st part 100 times better than 2nd one. Akshay kumar didi a fabulous work alongside Anil, Katrina, Feroz khan"
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "mathuraadya",
        "review_rating": "10",
        "review_title": "WOW! I SERIOUSLY MEAN WOW!",
        "review_detailed_main": "This movie is AMAZING, SUPERB, FANTASTIC, FABULOUS, EXCELLENT, AWESOME, COOL, BRILLIANT, GREAT, HILLARIOUS, INCREDIBLE & SPECTACULAR."
    },
    {
        "movie_id": "tt0488798",
        "movie_name": "Welcome",
        "movie_rating": "7.1",
        "review_username": "guljannat",
        "review_rating": "8",
        "review_title": "Very Funny Movie..",
        "review_detailed_main": "Very funny family movie. We can't stop laughing. Very funny story."
    }
]