[
    {
        "movie_id": "tt0337611",
        "movie_name": "Dilwale",
        "movie_rating": "5.6",
        "review_username": "fawadakhtari",
        "review_rating": "7",
        "review_title": "Believe it or not I have seen this movie more than 50 times",
        "review_detailed_main": "This is one of the movies which is very popular in Afghanistan. I am not sure if Indian people remember this movie or not but Afghans certainly do. I still hear some of the guys on Afghan local radios asking for this song to be broadcasted for them. The actors were chosen very well. I liked both Ajay Devgan and Sunil Shetty in the movie. I did not like Raveena in the movie.\n\nMusic: This film's music had great impact on it's audience forcing them to watch the movie for the great songs from NADEEM SHRAVAN. Also the singers, Kumar Sanu, Alka, Udit has done great job singing songs for this movie.\n\nI recommend anyone watching this movie, specially music lovers."
    },
    {
        "movie_id": "tt0337611",
        "movie_name": "Dilwale",
        "movie_rating": "5.6",
        "review_username": "varghesejunior",
        "review_rating": "7",
        "review_title": "A long journey of action, drama and music",
        "review_detailed_main": "Dilwale is a good film, except for the similar flaws that most films of the 90's had.\n\nStory is about an efficient cop who is give the task of handling a mentally deranged man's case. The cop soon realizes that the convict is innocent and does all that he can to prove the latter's innocence and bring the culprits to book.\n\nThe music is noteworthy, with Kumar Sanu's melodious voice in most tracks. There are many a song in this film. Some action sequences are good, bit of overacting on Sunil Shetty's part, but otherwise he and Ajay Devgn are cool. They did make a good pair in this film.\n\nThe flaw - Some scenes are meaningless, at some places the editing is not smooth, and some sequences are simply exaggerated. Also some of the songs make the film unnecessarily lengthy.\n\nWatch it but watch the time!"
    },
    {
        "movie_id": "tt0337611",
        "movie_name": "Dilwale",
        "movie_rating": "5.6",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Decent romantic film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0337611",
        "movie_name": "Dilwale",
        "movie_rating": "5.6",
        "review_username": "praneshiyer",
        "review_rating": "9",
        "review_title": "Wonderful, entertaining classical movie of the 1990's",
        "review_detailed_main": "Dilwale (1994) is a romantic, action-packed entertainer of the 1990's decade. Ajay Devgan for the first time in his acting career, then, did a mentally retarded person's role and his change of image really worked wonders. Not only was Devgan appreciated widely by both, critics and masses, but this movie, DILWALE(1994) did very well, then at the box-office. Also, Ajay's female co-star in this movie, Raveena Tandon,not only looked super-pretty in this movie but also danced well in the song numbers, too. Paresh Rawal, Avtar Gill and Gullu(Gulshan Grover)too have acted well in this triangular love story.I was disappointed though, that the song number,\" Jo tumhe chaahe usko satana\", picturised on Raveena Tandon and Sunil Shetty , was chopped off the editing table.The songs of this movie were outstanding too.This movie, Dilwale(1994), was in reality, Raveena Tandon's first career super-hit. The best part of this movie, was though Sunil Shetty's under-rated acting as a police officer. Sunil was even nominated in all the many dozen film awards functions, then for \"Best supporting Actor award\" category.The songs of this movie were not just a rage, then, but even now many Bollywood fans, go online on the internet to hear this movie's super-melodious songs. I have already, watched this movie 5 times till date."
    },
    {
        "movie_id": "tt0337611",
        "movie_name": "Dilwale",
        "movie_rating": "5.6",
        "review_username": "rsdtilai",
        "review_rating": "8",
        "review_title": "What a Intense acting by Ajay Devgn & Sunil Shetty",
        "review_detailed_main": "Outstanding performance by Ajay Devgn.. Nobody can perform like Ajay Devgn In this type of intense rol."
    },
    {
        "movie_id": "tt0337611",
        "movie_name": "Dilwale",
        "movie_rating": "5.6",
        "review_username": "chetan_r411",
        "review_rating": "",
        "review_title": "Average Music with Timeless Music",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0337611",
        "movie_name": "Dilwale",
        "movie_rating": "5.6",
        "review_username": "mkumardash",
        "review_rating": "9",
        "review_title": "Story That Penetrates Into Your Heart",
        "review_detailed_main": "It's a 3 hour long movie but I assure you that you will not get bored at any instance. Powerful Story, Acting and Music. One of the best movies of Bollywood. Love you Dilwale team."
    }
]