[
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "FirstCryingGamer",
        "review_rating": "7",
        "review_title": "A little overrated but still a good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "9",
        "review_title": "Just Awesome !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "andrewchristianjr",
        "review_rating": "9",
        "review_title": "SUPERHERO EXTRAVAGANZA!!!",
        "review_detailed_main": "Superhero extravaganza! Spider-Man NWH didn't meet my expectations, it exceeded them. The most emotionally resonant MCU film so far. This movie is worth every excruciating moment we had to wait. The visuals, the score, the emotions, the story, and ofc the fan-service. This film understands spider-man fans like no other spider-man film before it. Truly a celebration of the most beloved character in the best way possible!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Loved every second",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "masonsaul",
        "review_rating": "10",
        "review_title": "Phenomenal conclusion",
        "review_detailed_main": "Spider-Man: No Way Home is a phenomenal conclusion to the trilogy and Holland's best outing as Spidey yet. Starts off fun, safe and familiar and then becomes extremely emotional, satisfying and full of great callbacks. A love letter to all things Spider-Man.\n\nTom Holland gives an incredible lead performance once again, reliably charming and likeable but with a lot more emotional heft this time around. Zendaya and Jacob Batalon both have perfect chemistry with Holland and are also incredible in their own ways.\n\nBenedict Cumberbatch reaffirms why he's such a good Doctor Strange with his excellent dry wit and gravitas. All the returning villains give strong performances but Willem Dafoe is definitely the standout performance with an unsettling and terrifying presence.\n\nJon Watts' direction is superb, the action sequences are thrillingly acrobatic once again but refreshingly impactful this time around. There's a few homages to the styles of the previous iterations and some gorgeous imagery.\n\nIt's also perfectly paced with none of its roughly 2hr 30 minute runtime feeling dull or overly long due to a strong momentum established early on. The CG is extremely impressive with only a few weak spots.\n\nThe music by Michael Giacchino is fantastic, a nice balance of themes from the previous iterations and use of Holland's iconic motifs which are slightly altered in ways that work as well as a few new additions that are beautifully epic."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "BandSAboutMovies",
        "review_rating": "10",
        "review_title": "Somehow better than Endgame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "lucy_andrews-04052",
        "review_rating": "9",
        "review_title": "one of the best cinema experiences",
        "review_detailed_main": "I'm from the uk so we don't really do all that kind of cheering in cinemas. But oh my god. I've never seen anything like it there were so many moments during this film where the cinema just exploded, pure excitement coming from almost everyone, including me.\n\nEven though it was quite bittersweet i cannot wait to watch this movie again, this is a top 3 mcu movie.\n\nThe score was just fantastic, acting amazing, even the small bits of fan service just put a smile on my face. There's not much else i can say about this film, except how excited it's made me for the future of the mcu."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "vegamingdk",
        "review_rating": "10",
        "review_title": "Yes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "gbill-74877",
        "review_rating": "6",
        "review_title": "Great concept, mediocre execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "fanchnou",
        "review_rating": "10",
        "review_title": "Superbly recycle two decades of Spidey to connect them all and close this chapter to start fresh new stories from now on.",
        "review_detailed_main": "Spiderman Far From Home is to years of stand alone Spider-Man movies what Avenger Endgame was to Avengers: an amazing grand finale to wrap up all the previous adventures in a grand manner, thus allowing a new phase.\n\nThis allows something very special:\nTobey, Andrew & Tom are no longer three different set of movies, they all come to as one adventure, together.\n\n\nSpidey is now reset to a new beginning (no caretaker, no girlfriend, no best friend). This will allow the building of a whole new story.\n\n\n\n\nI always loved these three actors, seeing them together was a dream come true I could never have dreamt of in the past. And before you know it, it's already the end of the movie, this is how captivating it is. 10/10 for me for sure!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "blott2319-1",
        "review_rating": "6",
        "review_title": "A franchise in decline, and this meta nonsense doesn't help",
        "review_detailed_main": "I was already concerned about Spider-Man: No Way Home when I walked into the theater (one could say I was expecting to be disappointed.) I kind of hate the idea of delving too deep into a multiverse, because I think it muddles things too much, and defies the internal logic of most stories. Sure enough that was something I felt while watching this film. This movie cannot hold up to even the tiniest bit of analysis, because it creates plot holes that you can drive a freight train through. It's kind of sad because there were some moments in the movie that I genuinely loved, but all I can think about days later are the myriad of questions that I'm left with because this movie created so many situations that make no sense.\n\nMy other big problem with Spider-Man: No Way Home is not really a fault of the movie, but more of the society we live in today. Living in an internet-focused culture, we are bombarded by ads and news stories that relate to the things that interest us. SInce I've shown my love for all things MCU in the past, of course I see plenty of things crossing my radar about the upcoming films. I was able to avoid watching any trailers for this movie, which I thought would help, but by merely catching headlines of casting rumors I could foresee every surprise they built into it. Of course any logical mind could put two and two together once the guest appearances start, so I suppose this isn't a movie that is going to blow away audiences with its surprises.\n\nAs I said, though, my disappointment is quite frustrating because I also found many aspects of No Way Home so satisfying. They wrapped up some story elements nicely, and this might have contained some of the best acting in any Marvel movie. In particular, I found Zendaya so surprisingly strong, I was almost able to ignore her lack of character motivation in some key moments. She wasn't the only person in the film that behaved stupidly, in fact the central premise of the film is built on a horrible idea from Aunt May that seems altruistic, but lacks any 4th-dimensional thinking which I would expect from a genius like Peter Parker. But smart people being dumb is the catalyst of the entire story, as even Dr. Strange doesn't seem to think anything through, past Peter's initial request.\n\nNo Way Home is easily the most meta Spider-Man movie ever made, which is kind of shocking to say in a post \"Into the Spider-verse\" world. It's catering to the most die-hard fans in the world, but it's more of a nod to the fans of the Spider-Man movies. I was always a huge fan of the multitude of Spider-Man comic books when I was a collector, but I've typically struggled with his portrayal in films. So, giving all these nods to things that came before Tom Holland took over the role on the big screen, falls a bit flat for me. One of the things I loved about this iteration of the character is that it avoided the cliches and saved us so much of the traditional Spider-Man origin story, but this movie back-pedaled and became a copy of a copy of a copy.\n\nThis return to cliche also sucked some of the emotion out of key moments as any fan of the character should know the same old tropes by now. I almost got emotional at the end because of the great acting performances, but the big emotional moment earlier in the film did nothing for me as all I could think was \"really, we're going there?\" There are some good laughs in the film, although I wonder how well it will hold up on rewatch. And I will rewatch this film, as I do with all MCU movies, but I think at this point Spider-Man: No Way Home sits as my least favorite in the franchise. In fact, I'm at a point right now where I'm questioning if I will keep being a diehard fan of everything the MCU churns out. This film wasn't what I'd call a complete failure, but I'm concerned the MCU is getting closer to one of those. Perhaps EndGame should have been exactly what the title implies."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "desmedtdiego",
        "review_rating": "10",
        "review_title": "Amazing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "paul_haakonsen",
        "review_rating": "6",
        "review_title": "Definitely one for the fans...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Neptune165",
        "review_rating": "5",
        "review_title": "I consider myself to be a big fan of Marvel and definitely of Spider-Man, but something wasn't right about this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kalafatenadir",
        "review_rating": "10",
        "review_title": "MCU's Magnum Opus?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jun-taufik",
        "review_rating": "10",
        "review_title": "The Best Spider-Man mMovie Ever",
        "review_detailed_main": "I dare say this movie is a bit better than Avengers: Endgame. Why? Because there are some unexpected expected suprise here and there. It's great in every angle: action, comedy and emotions. This is all I can say because I do not want to spoil it. Don't forget to sit after the very end of the end credits."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ssapkota-13781",
        "review_rating": "10",
        "review_title": "Theatre turned into Stadium",
        "review_detailed_main": "This one is for STAN LEE. Amazing experience, roller coaster of emotions and all those memories. Just WOW.\n\nAnd don't miss the 2nd post-credit scene as it is gonna blow your mind."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "cricketbat",
        "review_rating": "8",
        "review_title": "They did it! A Spider-Man trilogy finally stuck the landing!",
        "review_detailed_main": "They did it! A Spider-Man trilogy finally stuck the landing! Spider-Man: No Way Home is an impressive culmination of the films that came before it, with an engaging storyline, exciting action, laugh out loud moments, and dramatic consequences. The beginning climb is a little slow, but it's an exhilarating ride once things get swinging. I don't exactly know how this movie will hold up after multiple viewings, as there are some plot points that don't quite make sense when you start to think about them, but I thoroughly enjoyed myself this first time."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mhorg2018",
        "review_rating": "6",
        "review_title": "A good, not great movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ars29792",
        "review_rating": "10",
        "review_title": "History is made",
        "review_detailed_main": "I don't know when again in a future Marvel movie would we have something as historic as this. The story flows so well and it's extremely funny, sad and cool all at the same time.\n\nCan't wait to watch it again!!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mtmetcalfe",
        "review_rating": "7",
        "review_title": "Fun fan service but sloppy story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "danielsthamer",
        "review_rating": "10",
        "review_title": "Movie for the fans",
        "review_detailed_main": "This is 100% a fan movie. Has everything you could have wished for. I honestly don't have words to describe this film. I'm getting Iron Man 1 vibes and more! Just go see it. Do it!!!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "atlasmb",
        "review_rating": "7",
        "review_title": "Spectacle, But Not Spectacular",
        "review_detailed_main": "My expectations for this film were off the chart due to what I had heard and read about how great it is. What it does deliver is plenty of spectacle. But a great film needs more than that. The story also moves along with some pace. But emotional impact should never be sacrificed for expediency. In short, this is an enjoyable film, but there have been better Marvel films.\n\nThere is one scene that stands above the rest. And it is guaranteed to bring a smile to the lips of any Marvel fan. It has so much subtext and it is so unexpected.\n\nIt ends with a tee-up for the next chapter, of course. I just hope that one focuses more on the characters and less on the effects. It certainly has that possibility, given where this episode ends."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "IPyaarCinema",
        "review_rating": "4",
        "review_title": "Nonsense And Nostalgia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Radio-1s_Mr-MovieMad-Ami_104-1FM",
        "review_rating": "10",
        "review_title": "\" A FIERCELY SPECTACULAR CELEBRATION Of Visual Pop Art At Its Wild, Whacky Creative ZENITH; And A Love Letter To SpiderMan-iacs ❤ That's Been ✌ WHOLE DECADES... IN THE MAKING❗",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "FeastMode",
        "review_rating": "9",
        "review_title": "CRAZY",
        "review_detailed_main": "Don't watch the trailers. Just watch the movie. I'm not going to say much. It's amazing. And I'm in complete disbelief that it actually happened. Well-made, well-acted, well-directed. Fun, funny and crazy with a ton of heart. Can't wait to watch it again.\n\nI slightly prefer the theatrical version over the extended.\n\n(6 viewings, opening night IMAX 12/16/2021, IMAX 12/29/2021, IMAX 1/20/2022, IMAX 2/2/2022, Re-issue UltraScreen 9/7/2022, 7/5/2024)"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "HabibieHakim123",
        "review_rating": "10",
        "review_title": "Best Movie Of The Year",
        "review_detailed_main": "First of all, i was so grateful to be experience this movie in theaters, with a great audience that as excited as me, they were clapping and the movie deserve it, Spider-Man No Way Home is everybody's dream, it's an exciting movie, with an epic story, and phenomenal performance, it just amazing, it's incredible, it's fantastic, it's mind blowing, it's an experience that i will never forget, once cross in my mind that this one is probably even better than Avengers Endgame, but as the time goes, it's still not reach that level but that really doesn't mean anything, both movie are epic, Spider-Man No Way Home is one of the greatest movie i've ever watch, one of the greatest superhero movie i've ever watch, and it simply The Best Movie Of The Year."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kosmasp",
        "review_rating": "10",
        "review_title": "Homeless and restless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "leestoych",
        "review_rating": "7",
        "review_title": "Deluded by the hype",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Sleepin_Dragon",
        "review_rating": "10",
        "review_title": "Wow!",
        "review_detailed_main": "What cinemas were made for. I wasn't expecting something quite as amazing as this, this was two and a half hours of incredible entertainment, drama, laughs, tears and action galore, there truly was something for everyone here.\n\nThis movie really has ignited my love for the franchise once again, and I am truly excited for what comes next.\n\nNostalgia, there seems to be a real thirst for it these days, and there is a lot of it to enjoy here. There are plenty of moments throughout that will have you speechless, they really do break all of the rules here.\n\nThis is one incredibly good looking movie, dazzling special effects, dizzying action scenes, two and a half hours will literally fly by.\n\nIncredible, 10/10."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "krishrajkapur",
        "review_rating": "7",
        "review_title": "Tom Holland cements his place as the best spidey actor",
        "review_detailed_main": "Spider man has always been my favourite character, due to the nostalgia of reading the comic as a kid, or just the characters sheer brilliance. In the last two movies that Holland did as spider man, I was slightly disappointed because we only got to see a child who was constantly babied by Tony Stark. The Spider-Man who we watched in Homecoming and Far From Home hadn't really earned his place in my heart, with Holland's childish charm being over used and making the character of Peter Parker a boy who frankly doesn't live up to the standard set by his predecessors. In this movie however, not only did it give me a nerdgasm due to the fantastic ensemble cast, but I finally got to see Holland flex his acting muscles and show me whey he was cast in his role and why he has reached his levels of stardom.\n\nThis movie was brilliant. The emotional themes which were laced into he movie kept the plot moving, with Holland, Willem Dafoe and Marissa Tomei showing us why they were truly hired. Unlike previous Spidey movies like TASM and Far From Home, this one truly captured my attention and boasted the elements of Spidey that I love so much.\n\nI will admit that when going into the movie, I was very hesitant about them bringing back the old Spider Men and villains, because I believed that they were better left untouched, but after watching the movie, all of my negative thoughts were blown away. Each villain gets their own time to shine, each of them harness their old selves whilst also elevating their characteristics.\n\nToby and Andrew both come back, something which elicited screams of joy from everyone in the theatre. They were brilliant. Toby was calm but excited, mature but fun, wise but still held that social awkwardness that we all adored back in the day. Andrew in my opinion, was way better as Spidey in this movie than any of his own. There was a pure emotion behind Andrew's Spidey and we finally get to see why he was cast as Spidey. It worked. Having three socially awkward super powered nerds somehow worked.\n\nI won't lie when I say that this is by far my favourite Spidey movie of all time. There were so many tear jerker moments in the movie, with Tom Holland standing out in all of them. He finally showed me SPIDER-MAN in capital letters. His character's emotions were so believable due to the way in which he portrayed them. His character came across as human, as someone who makes mistakes and then seeks ways to fix it, in order to keep those who he loves safe.\n\nThe classic uncle Ben line gets dropped multiple times in this movie, finally making this 'Home' trilogy as Holland's Spidey's origin story in a sense. We see how the famous Uncle Ben quote truly makes an impact on Peter at the end, making us cry with tears of sadness but also pride.\n\nMy words cannot express how much I loved this movie. Especially that final scene."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "BrnzReviews",
        "review_rating": "10",
        "review_title": "With Great Power Comes Great Responsibility!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "diegosays",
        "review_rating": "7",
        "review_title": "SPIDER-MAN 3...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Oh_Capital",
        "review_rating": "3",
        "review_title": "A Movie For Children",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "orpheusdim",
        "review_rating": "10",
        "review_title": "Shut up and pay the ticket",
        "review_detailed_main": "Best Spider-Man movie ever. Among the beat blockbusters of all time. Great acting. Great vfx. Do you want anything else? Go and watch it\n\nWe need amazing 3."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "awarrenliy",
        "review_rating": "10",
        "review_title": "Best spider man movie ever",
        "review_detailed_main": "If you saw all spider man movies, you're will absolutely love it! I saw it 2 times already, and want rewatch again..some of the scenes and dialogues are sooo good."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "baileytwanny",
        "review_rating": "10",
        "review_title": "Expectations Exceeded!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "rajaniket-07761",
        "review_rating": "10",
        "review_title": "Amazing 🔥",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "evanston_dad",
        "review_rating": "7",
        "review_title": "I'm Sure It's Fun for Die Hard Fans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "abhasib",
        "review_rating": "10",
        "review_title": "Non Beatable Movie In the World",
        "review_detailed_main": "I have Never Seen Such a Beautiful Movie Like this Marvel You Are the Best.\n\nSpiderMan Was my favourite Movies from childhood and you have remembered me my fabulous childhood and make my mood thanks for all movies that you have created for us."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "drqshadow-reviews",
        "review_rating": "6",
        "review_title": "Energetic and Colorful, But Also Meandering and Overloaded",
        "review_detailed_main": "Instantly loathing the publicity of being outed by the press, Spider-Man hits up the Sanctum Sanctorum to ask Dr. Strange for some mystical assistance. They cast a spell of wiped memory and screw it up, reality is torn, familiar faces invade different spaces... you know this, you've seen the trailer. It's the Sony/MCU equivalent of X-Men: Days of Future Past, with a stream of old band members coming out of retirement for a jam-packed farewell concert.\n\nOne might hope that the results are a smidge better than that old X-Men reunion, and they are, but No Way Home also suffers from many of the same problems. Primarily, the overwhelming urge to stuff as much crap on the screen as possible, even when the audience is already exhausted. It tries to serve too many masters and, in the end, sufficiently serves none. There's fun to be had, especially when the oddball mix-and-match super-characters get the chance to escape the trappings of a broader storyline and simply converse as individuals. Those accessible human interactions have been a big strength for the two preceding Marvel Spider-Man flicks, and they reap great benefits here, each time the old guard mingles with the new.\n\nI wish we had more such moments, but the push to turn the MCU's most grounded franchise into another big-time tent pole attraction demands otherwise. In reaching for the next major event, they've overlooked the \"neighborhood\" part of \"Friendly Neighborhood Spider-Man.\" Actually, they might've forgotten the \"friendly\" part, too, because there's a whole bunch of angst spinning around Tom Holland's central performance. But that's more excusable: Peter Parker goes through a lot over the course of this hundred-fifty minutes, he progresses and matures as a character, and he's experienced equally dark times in the comics.\n\nNo, the performances aren't the issue here, nor is the dialogue, which remains snappy and delightful. The primary culprit is the plot, bloating and careening in indeterminate (and often mindless) directions, making a lot of noise but not making a lot of sense. Dr. Strange hand-waves many explanations under the guise of mysticism, which is basically his thing, but so do the various Spider-Men. Important members of the supporting cast are marginalized and under-served. The city of New York, once an essential ingredient, is now barely a backdrop. Goalposts are moved, overshadowed, and then moved again. Rumor has it that script re-writes were still underway during filming, and it shows.\n\nThis is messy. Lots of fun on certain occasions, but stifling and sludgy in others. It's a mixed bag, leaning more to the positive than the negative, but I don't know that I'm content with the way everything wraps up in the end. Where Homecoming and Far From Home both left me charged and anxious for the next step, No Way Home put me in a place of quiet acceptance. Feels like the franchise has aged, and that's not a great thing."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "albertucciopazzuccio",
        "review_rating": "10",
        "review_title": "The best Spiderman ever",
        "review_detailed_main": "The best Spiderman ever. I frankly don't like the start. Too fast, too confusing but then it gets better and better. And when the other 2 Spiderman join....it gets really awesome."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "garabedian123",
        "review_rating": "6",
        "review_title": "Lacking in story. Good in action.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "hellsbells75",
        "review_rating": "1",
        "review_title": "I wanted to like this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "am-86315",
        "review_rating": "10",
        "review_title": "Wowww",
        "review_detailed_main": "Amazing. Film review and let you know that you are interested and have been working on and have to be able and willing and then we can get the office of talking with you and your phone and then we will need a quiet day 😜😜 the office 😜 a good day please see attached file is scanned image in PDF format."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "yysfwxd",
        "review_rating": "8",
        "review_title": "Spider man no way home",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ethanbresnett",
        "review_rating": "9",
        "review_title": "Easily one of the best films in the MCU",
        "review_detailed_main": "This film really is something special.\n\nI enjoyed every single second and would happily have lapped up hours more of it.\n\nEverything about it is executed so well. I mean SO well.\n\nNot a single Marvel fan alive will be disappointed by this."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "drewbraston",
        "review_rating": "10",
        "review_title": "A Spectacle",
        "review_detailed_main": "This is the movie for a Spider fan. Endgame vibes throughout the film. It's not a perfect movie by any stretch but the emotional payoff in this trilogy for Tom Holland's Spider-Man is fantastic. Powerful performances delivered by several of the cast members. Get ready to feel the full range of emotions."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "JohnDeSando",
        "review_rating": "",
        "review_title": "Super holiday entertainment loaded with visual and spiritual meaning.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Leofwine_draca",
        "review_rating": "6",
        "review_title": "Best of the trilogy",
        "review_detailed_main": "I'm no fan of the SPIDER-MAN films with Tom Holland; I find them way too kiddified and the humour just jars with me. But I can comfortably say that this is the best of the trilogy, and that's because it feels fresher and different to the rest. I loved the recall of old villains, it was great to see Foxx, Molina and Dafoe come back again and it's clear they're having fun. Cumberbatch is good in a limited role too. Best of all are Andrew Garfield and Tobey Maguire, who light up the screen and make all of their scenes delightful; they show up Holland, that's for sure. The rest is your usual mish mash of CGI action complete with an excruciatingly overblown and sentimental ending (please!)."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "avisheksarki",
        "review_rating": "10",
        "review_title": "Best Spiderman Movie",
        "review_detailed_main": "I am big fan of Spiderman Man movie.this movie. Shows us how important it is.\n\nStory are very Interesting and the plot of is also very well.\n\nVFX,CGI are just Next level."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jackransom-69832",
        "review_rating": "7",
        "review_title": "\"The multiverse is a concept of which we know frighteningly little.\"",
        "review_detailed_main": "Easily the most anticipated and theorised comic book film since Avengers: Endgame. Spider-Man: No Way Home is set directly after the end of Far From Home. With Spider-Man's (Tom Holland) identity now revealed, Peter asks Doctor Strange (Benedict Cumberbatch) for help. When the spell goes wrong, dangerous foes from other worlds start to appear.\n\nIt was always going to be difficult for this to live up to the myriad of potential expectations that had built up in mine and millions of others heads after the first trailer released back in August. Luckily throughout its duration No Way Home excels at fan pleasing moments and truly giving Peter monumental stakes and potential consequences. However it is undeniably overstuffed and choppy, as well as for me personally a lot of the MCU'isms not always particularly gelling well with the returning villains.\n\nI will be keeping the plot details vague, but for those who had expectations and ideas of what the film might be, it probably is pretty much what you expect. The opening act ripple effect of Peter's identity being revealed, with he, MJ and Ned being turned down by colleges and constant harassment sets the stage well and understandably Peter's desperation for Doctor Strange to fix it. From there the rogues gallery pour through and it's up to Peter to stop them.\n\nHere is where some of my favourite aspects of the film are, as well as my irritations. It's undeniably great seeing these characters return to the big screen, and throughout the second act it is uniquely executed and delivers some satisfying interactions between the foes (though some of their motivations could have been a bit more fleshed out), as well as time to breathe. However it is once again the abundance of joke attempts and alterations to a couple of the characters that just make some of the interactions feel awkward and cringe inducing.\n\nDoc Ock's bridge battle is a standout return and the choreography, sound design and score all intertwine nicely. Holland wasn't lying about this being a darker and more violent entry into the franchise, with the first Goblin brawl being the film's highlight, alongside the jaw-dropping visual spectacle of the mirror dimension duel. The final action set piece is pure spectacle and grin inducingly fun, it's just a shame that yet again it's another CGI heavy sequence set at night, so it's frequently hard to see what's going on at certain points.\n\nThis is probably Holland's best Spider-Man performance as he really has some emotional heavy lifting to do, as well as keeping the quips and enthusiasm fresh. Willem Dafoe absolutely steals the film. He's still got all of it: the grin, the laugh, the expressions and genuine menace. Molina as well, brilliantly capturing the commanding intelligence and personality of Doc Ock and Jamie Foxx is far better suited in this iteration of Electro. Benedict Cumberbatch adds a layer of bitterness and snark to Strange, yet keeps his core values and dedication to help in check.\n\nSpider-Man: No Way Home may just be the film many fans of dreamed of. Unfortunately for me, whilst it still delivered a lot of what I wanted, I can't help but feel a bit disappointed. Dafoe & Molina prove once again why Spider-Man 1 & 2 will never be topped, the increased personal stakes for Peter are welcome and I'm still partially in awe that the film actually happened. However the leering presence of now extremely familiar and annoying MCU traits and tropes, certain character interactions and an overstuffed storyline do hold it back."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "akdjreview",
        "review_rating": "9",
        "review_title": "Greatest Marvel film in potentially a decade",
        "review_detailed_main": "Following constant disappointment with Marvel movies, I had come to stop caring for or even watching any. But Spider-man has had a special place in my heart since a kid so I had to watch, especially after hearing rumours. To tell the truth, this exceeded my expectations with great power.\n\nWith surprisingly good acting and great emotionally loaded scenes, No Way Home managed to capture something many Marvel movies fail. Emotions. This was not only an action-packed movie but also a story-driven movie with fantastic execution. Tom Holland and Zendaya as well as other actors managed to deliver acting never seen in the Marvel universe before.\n\nNo Way Home captured that heart of the first couple of Spider-man trilogy which I think old fans will admire. Nevertheless, I believe this movie was fantastically done and little mistakes.\n\nNo Way Home is a great movie I highly recommend. Especially to the Marvel fans like me that had gotten bored of the new stuff."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Prismark10",
        "review_rating": "7",
        "review_title": "Spider-Man: No Way Home",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "gabbar-57124",
        "review_rating": "5",
        "review_title": "Hype carried the movie..",
        "review_detailed_main": "It was a pretty decent movie, but the ones who are yelling, and saying it's the best MCU movie ever.. or the best Spider-Man Movie ever.. i don't think so.. It's jst the hype talking so much, the comedy as usual MCU always tries too much to be funny.. and it fails.. This film is carried out by cameos.. Lazy writing.. The only good thing was the ending.. That's it.. Definitely not the best.. and not an 8 IMDB rated movie.. Dr Strange is better than this IMO.."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "amirakbaria",
        "review_rating": "10",
        "review_title": "Spidermans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mehran_kheiri",
        "review_rating": "10",
        "review_title": "Wow, just, wow.",
        "review_detailed_main": "It was incredible... No more words. I went to 4DX and I absolutely recommend it. The amount of redemption you feel in this movie is second to none... Especially if you're a early 2000s kid this movie is a must watch."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Sergiodave",
        "review_rating": "9",
        "review_title": "Quite brilliant",
        "review_detailed_main": "If you thought the Marvel Universe had reached it's climax with Avengers Endgame, then think again, this was superb, and far more entertaining than any other Spiderman movie. Very cleverly done, mixing laughs and tears. If this is the way phase 4 is going to go then bring it on. This is the reason you go to the cinema, wonderful entertainment."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Super_Bob1",
        "review_rating": "8",
        "review_title": "This really puts a smile on my face",
        "review_detailed_main": "To keep this spoiler free and brief I'll just say this, keep away from any leaks and just go see it when you can and you'll love it even more. The film does justice to it's characters and ties up some loose ends from previous movies."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mtyrs",
        "review_rating": "",
        "review_title": "a great success",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "7",
        "review_title": "The Biggest, Grandest And Most Exhilarating Spidey Flick Ever Appeared On Big Screen!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "UniqueParticle",
        "review_rating": "10",
        "review_title": "One of the best marvel movies ever!",
        "review_detailed_main": "An exhilarating wild ride from start to finish which is perfect for a runtime of 2 hours 28 minutes! I'm glad I managed to see in IMAX at 11:40 AM well worth it especially with an audience that reacted loudly to exciting bits. I absolutely love the grand scale of everything from the multiverse, characters, massive budget, tingling sense is so well done, and the humor is spot on. Fans or not of the movies Spider-Man: No Way Home is crystal smooth flow of excellence!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "cherold",
        "review_rating": "7",
        "review_title": "Emotionally incoherent but chunks are good",
        "review_detailed_main": "No Way Home starts with as much silliness as any Spider-Man movie in history. Peter Parker, unmasked, asks Doctor Strange to make everyone forget him, then hedges, then everything gets weird as a bunch of bad guys from previous Spider-Man movie series start wreaking havoc.\n\nThe multiverse is, of course, a major component of Into the Spider-verse, but while that was brilliant and cool, here it comes across as profoundly silly.\n\nSo in my head I was seeing this as the silliest of all Spider-man movies; a ludicrous romp with fun mindless action. And then, in a weird tonal shift, the movie gets really dark, and then tries to go back to the light-hearted bit with that hanging over it, and does some more really silly stuff, and some rather confused but fast-paced action, and then goes for a sad thing that I found kinda boring, and, well, what is this supposed to *be*.\n\nIt doesn't make much sense, it's tonally chaotic, and as with the previous film, the action is fleetfully enjoyable but entirely forgettable.\n\nStill, a reasonable amount of the humor works, it's fun to see the way they play with the multiverse, and there's definitely fun to be had. But I find it perplexing how many people love this movie because to me it's a mess. It should have just stuck with silly all the way through."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "potatovsgaming",
        "review_rating": "10",
        "review_title": "I DONT KNOW WHERE TO BEGIN",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "namob-43673",
        "review_rating": "6",
        "review_title": "Spectacular and amazing but not a complete homerun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "statuskuo",
        "review_rating": "2",
        "review_title": "Dull, Bland And Dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kozmava",
        "review_rating": "10",
        "review_title": "one of the best movies",
        "review_detailed_main": "I saw it 2 days ago, it was the first session and my mind was blown. Definitely one of the best movies ever. Can't wait to watch it again. I felt many emotions: sadness, excitement, anger... Marvel never disappoints."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "george-lemontzis",
        "review_rating": "10",
        "review_title": "Amazing Spider",
        "review_detailed_main": "In the beginning I was thinking what the plot could be... combined with Doctor Strange and multiverse the result it's Amazing. Adventure, comedy, drama, special effects creates one of the best Spider movies!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "msbreviews",
        "review_rating": "9",
        "review_title": "A memorable, passionate, once-in-a-lifetime cinematic experience.",
        "review_detailed_main": "If you enjoy reading my Spoiler-Free thoughts, please follow my blog to read my full review :)\n\n\"Spider-Man: No Way Home is one of the darkest, saddest, emotionally draining entries in the MCU, surpassing all of my expectations.\n\nDespite a messy, convoluted first half with some pacing issues and occasionally frustrating, poorly placed humor, Jon Watts, Chris McKenna, and Erik Sommers more than compensate these minor issues with some of the best (and brutally violent) Spider-Man action ever witnessed on screen.\n\nIn addition to this, the surprisingly coherent narrative packs shocking developments and actually offers enough screentime for the villains to significantly impact Peter Parker's arc. Unbelievably outstanding performances from everyone involved, especially Tom Holland, Zendaya, and Willem Dafoe.\n\nA heartfelt, nostalgic homage to the Spider-Man legacy that fans will rewatch countless times, laughing and crying along for many more years to come.\n\nA memorable, passionate, once-in-a-lifetime cinematic experience.\"\n\nRating: A."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "gboi-29731",
        "review_rating": "10",
        "review_title": "The film was want we wanted and more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "sharky_55",
        "review_rating": "7",
        "review_title": "Trying to do better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "syedfarhanwolverine",
        "review_rating": "10",
        "review_title": "THEY DID IT.",
        "review_detailed_main": "The best Spider Man movie starting from the story line to the action the drama the emotions ,a visual treat for all the MCU/spiderman fans A great way to end the year 2021 Its a must watch not just once but atleast 5 times.."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "sbweightman",
        "review_rating": "7",
        "review_title": "Very entertaining, but lacking originality",
        "review_detailed_main": "A good all round superhero action film with great special effects and cast of characters. The way it brings together the multiverse does allow for some entertaining surprises, but the lack of a new or single villain as well as the seeming invulnerability of the hero does negatively impact the tension. There's a good amount of humour and drama, but little stands out as truly great in this 'greatest hits' compilation."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "haseeb_babar",
        "review_rating": "10",
        "review_title": "The ultimate Spider-Man movie!!",
        "review_detailed_main": "This movie is everything you could possibly fantasize and then more. Absolutely brilliant, this is easily the best Spider-Man movie ever made, and maybe this is nostalgia talking but possibly the best marvel movie ever!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kuner-59029",
        "review_rating": "6",
        "review_title": "Tries really hard, but only reminds of better Spiderman films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "zlateanh",
        "review_rating": "1",
        "review_title": "Worst Spider-man ever",
        "review_detailed_main": "The only non-brain dead person in whole movie was Doctor Strange.\n\nEvery line classic cliche and total garbage.\n\nNo words can explain how much they just can't make a movie anymore without making it to get you not wanting to watch another movie anymore."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "logloglog",
        "review_rating": "10",
        "review_title": "One of the best superhero movie i've seen",
        "review_detailed_main": "Here is my opinion on the movie. Not ok with it? Do a review yourself :-)\n\nI've seen every MCU and DC movies in theaters and i was surprise by the film. One of the 3 superheroes movies of all time on my board.\n\nWe see a lot of caracters evolve and the movie takes time to set each one in the story.\n\nFull of action scenes of different types from one another. Escape the crowd, escape the magician, run from vilains, fight the vilains, save the world.\n\nThe visual effects are great. The combat scenes takes the best of all spiderman movies and benefits from it. Camera angles and movements are excellent."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "queropastelverde",
        "review_rating": "10",
        "review_title": "best movie!",
        "review_detailed_main": "And without a doubt Tom Holland's best spider movie and perhaps one of the best web-slingers ever made. Very good script, which manages to put all the pieces together in a very interesting way, very good visual effects, comedy that works, and finally, Tom Holland's spider gets a dramatic arc that it really is. Excellent, just grab the popcorn and have fun."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "darceyleighmansfield",
        "review_rating": "10",
        "review_title": "This is an amazing movie and 100% recommend it",
        "review_detailed_main": "This is a great movie with good suspension and emotional balance It has a very good story line carrying on with all the other Spider-Man's without a stop in rhythm and storyline."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "rupokf",
        "review_rating": "10",
        "review_title": "Awsome, mind blowing, action and emotion worth watching film",
        "review_detailed_main": "The movie basically a kick-off of multiverse in MCU, It brings all previous spider-man villains and heroes to show the multiverse, with many awsome appearance and turning point this movie has fulfilled the needs of spider-man fan."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "TheBigSick",
        "review_rating": "",
        "review_title": "It's not a film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mlhicks",
        "review_rating": "6",
        "review_title": "Fine, but dumb plot",
        "review_detailed_main": "The movie is fine and enjoyable enough, but the plot is terrible. It's one of those movies where the whole thing is driven by how dumb the main character is and the stupid choices they make.\n\nDon't do X. Does X.\n\nDon't trust Y. Trusts Y.\n\nUse Z to fix the problem. Doesn't use Z.\n\nRepeat."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "dhruvrajraulji",
        "review_rating": "10",
        "review_title": "Best Movie Ever (Atleast When It Comes To Supes)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "isaacsundaralingam",
        "review_rating": "6",
        "review_title": "Marvel's writing problem plagues what could have been the best Spiderman movie ever",
        "review_detailed_main": "(No Spoilers)\n\nSpiderman: No Way Home is probably the biggest superhero movie since Avengers Endgame... There's no denying that. Ever since this movie's announcement, you knew this was a bigger deal than the usual superhero flicks. And being a movie with such high expectations, means that there's so much room for things to go wrong. And unfortunately... It seems like it did.\n\nNow I'm fresh out of the theatre, and I already feel like this movie had so much potential wasted. A sentiment I also share towards Avengers Endgame; where the only thing the writers seemed to worry about was 'fan-service'. Fan service is fine honestly, but the line should be when fan-service slowly starts taking over for storytelling. Because the storytelling in this movie was childish.\n\nDon't get me wrong... I enjoyed the movie... I enjoyed the theatre experience... It was fun... But fun is not enough when you realize what could have been. Spiderman: No Way Home could have been Marvel's most ambitious project yet, but it has the curse of Marvel's horrible writing staff who similarly messed up everything from Avengers Endgame, to WandaVision, to Falcon and the Winter Soldier, to Loki and to Black Widow. The plot of the movie sounds like some cheap fan fiction that somehow got made. And what's even worse is its absolutely cringe worthy dialogue; existing for the sole purpose of reminding the audience of previous Spiderman movies. It's such a dumb and convenient plot that just exists for the sake of nostalgia.\n\nI loved Avengers Infinity War and I really enjoyed Spiderman Far From Home, but I haven't enjoyed a single Marvel project since, because all their projects have been so shallow with no real substance to back itself up. Marvel has a writing problem that needs to be looked into, for the sake of cinema and storytelling.\n\nWhat a missed opportunity... What an absolutely missed opportunity..."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ollie_hws",
        "review_rating": "9",
        "review_title": "A lot of brilliance to take in",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jp_91",
        "review_rating": "7",
        "review_title": "Good but not amazing.",
        "review_detailed_main": "\"Spider-Man: No Way Home\" is an entertaining film for fans of the spider and Marvel, highlighting the script about the multiverse, the first-rate performances, the excellent cinematography and the well-achieved special effects, however I found the film lazy, but the fanservice is guaranteed."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "phillipechavda",
        "review_rating": "1",
        "review_title": "boring",
        "review_detailed_main": "Way overrated, probably because of all the characters from the other movies. They keep making these films in a way to make people have to watch the other ones to understand everything so that they can make more money. The storyline was boring."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "williamlund-49583",
        "review_rating": "9",
        "review_title": "The best spiderman movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "samiulnihal",
        "review_rating": "8",
        "review_title": "Fan service",
        "review_detailed_main": "In the scale of nostalgia it would take 10 out of 10.. but in the film perspective it doesn't worth more than 8.. story is very ordinary.. and marvel just gave everything fans wanted.. visual was good.. and Tom holland was perfect.."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "nsmiaroski",
        "review_rating": "8",
        "review_title": "Gotta love Peter Parkers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "brandonds",
        "review_rating": "9",
        "review_title": "Great movie SPOILERS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "lasirulochana",
        "review_rating": "",
        "review_title": "Astounding movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "PedroPires90",
        "review_rating": "6",
        "review_title": "Messy but emotional",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "alindsayal",
        "review_rating": "10",
        "review_title": "An Epic Film That Really Delivers",
        "review_detailed_main": "Finally, the biggest film Spider-Man: No Way Home has hit cinemas and I had to go see it as early as possible. Now I have watched it, here is my review for the film. The premise of the film sees Spider-Man's secret identity revealed, he tries to get Doctor Strange's help to fix things but this leads to some unwanted visitors from other universes to cause problems for both of them.\n\nMain Character Tom Holland has played Spider-Man for a while now and for me this is his best performance in the role. You really see how he has grown and this film shows real depth to the character and how he has kind of grown up into this crazy world. He doesn't have much rest in the film and it really pushes Holland to impress in the majority of his scenes and I thought he was great in really making Spider-Man a top hero in The MCU.\n\nSupporting Characters Zendaya plays MJ and I was just really happy to see the dynamic between her and Peter in this film. Despite everything that goes on they are a pretty strong couple and it is just nice for a comic book film to have a relationship that feels natural without overpowering the main plot. Benedict Cumberbatch reprises his role as Doctor Strange and he is really good, I really like how despite being a hero he has a more mature and different viewpoint to Spider-Man. He adds some really interesting parts to the film and plays a unique role in the progress of the story and Spider-Man as a character. Jacob Batalon is back as Ned and he is much better then the role he played in Far From Home. He is just a fun character that supports Peter, he is way more involved with Spider-Man and that improves his character so much. Marisa Tomei is back as Aunt May and again she is more involved this time out and is just a really great person for Holland to bounce off and the dynamic just really works and makes their relationship feel very real. Willem Dafoe, Alfred Molina and Jamie Foxx reprise their roles as Green Goblin, Doctor Octopus and Electro. Dafoe and Molina are great and really flourish in their roles, but the surprise is Foxx as Max Dillon/Electro. He is so much better then he was in Amazing Spider-Man 2 and I am glad he got given this 2nd chance here.\n\nStory The story is really great, I was worried with all of the multiverse elements that the focus could have been taken off of a character arc for Spider-Man but it nails this element. Peter has a real arc and it develops incredibly well and for me was a real highlight. It is obviously great seeing the returning villains and they are treated with respect and their characters are further explored. The ending feels deserved and because you are so invested it feels really earnt.\n\nScript MCU films often get criticised for their scripts including too much humour in them, but I actually think the balance is really handled well here. Yes there are funny moments here but for me they didn't outweigh the serious and darker parts of the film.\n\nStyle The film looks great, the actions scenes are all really fun and seeing The MCU Spider-Man going against villains from the other franchises works very well and allows for some fun sequences. The pacing for the film is also really good, despite being 2 hours 30 mins it never felt too long and I honestly believe that there isn't really any filler here which is an impressive feat.\n\nOverall Overall, Spider-Man: No Way Home is an epic film that really lives up to the hype. I am possibly still buzzing because I have just watched the film but I can't find too much fault and this is a Spider-Man fans dream film and anybody will find this film plenty of fun.\n\nRating - 10/10."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "DeBBss",
        "review_rating": "6",
        "review_title": "Overhyped and Overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "therealJosephWilson",
        "review_rating": "9",
        "review_title": "Marvel Studios got Spider-Man right, this time!",
        "review_detailed_main": "If you love Spider-Man then you'll definitely love this film. Not only does \"Spider-Man: No Way Home\" have an amazing script but the characters are written perfectly. Not only will this blockbuster blow your socks off visually and emotionally but it will bring back a lot of needed nostalgia that is a breath of fresh air for Spider-Man fans of all generations."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "zhyarTheChosen",
        "review_rating": "7",
        "review_title": "Just hear me out",
        "review_detailed_main": "It was a real good movie with a decent story and fun action but this movie is way too overrated just because it got all the famous actors i really don't think this is a good reason to describe a good movie and let's be honest they did a great job at mixing all these universe's."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jaapeelman",
        "review_rating": "5",
        "review_title": "Idiotic childish movie",
        "review_detailed_main": "I really do NOT understand the high score for this movie.\n\nThe storyline is idiotic and childish with monsters and spider-men coming from different dimensions all because some spell from dr. Strange went bad.\n\nMy God, what a piece of crap this movie... The special effects are as expected great but the rest is really a bunch of nonsense!\n\nI love Spider-man, Batman, the Hulk etc but this movie is really terrible and I wasted 148minutes precious time.\n\nTake my word for it: the best thing to do is to skip this movie and wait for something better to watch, which is not hard as there are not many movies as dumb as this one!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mikeproc",
        "review_rating": "8",
        "review_title": "Peak Fiction",
        "review_detailed_main": "Everything you could want from a spider-man movie and a superhero movie. I do truly believe the best way to label the film is as nothing but \"peak fiction\". Any MCU fan will deem this as another satisfactory film in the series and i'm sure after the films release, every Comic book store on earth was filled with embryonic joy. I read another review that claimed that this is what cinemas were made for and I couldn't agree more , the variety of emotions shared amongst every man/woman/child were truly sensed through everyone's reactions in the cinema."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Amazingtheory",
        "review_rating": "10",
        "review_title": "The Definitive Spider-Man Movie",
        "review_detailed_main": "For as long as I can remember, I've been a Spider-Man fan. Growing up with the Tobey movies really set the bar for Spider-Man movies for me. Those movies defined what it is to be Spider-Man. A few years and a few Spider-Man movies later, that bar the Raimi movies had set remained untouched. The amazing Spider-Man movies were great in their own ways but suffered from some plot issues and an unfinished story. The previous MCU Spider-Man movies were also great in their own ways, but I always felt like they lacked real consequences and stakes. Nothing could hit that mark like the Raimi movies did... that is, until I watched this movie. The action, the light hearted humor, the emotions, the consequences, the responsibility... all of what defines Spider-Man, is all here. I think I can safely say that this movie is the best Spider-Man movie. As a huge Spider-Man fan, this movie was everything I wanted it to be and is an absolute game changer. I went in with ridiculously high expectations after imagining all the wild possibilities in my head before watching it. My expectations were exceeded and I could not be happier with what we got from this movie. It is the best Spider-Man movie. This movie bring much closure to many things and stories set up from previous films while setting up numerous possibilities for future installments and I cannot wait to see what the future will bring."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "bozarez",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "notareviewer",
        "review_rating": "9",
        "review_title": "The most amazing Spiderman.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "JoelChamp85",
        "review_rating": "6",
        "review_title": "I don't think the writing was up to standard.",
        "review_detailed_main": "First half is almost unbearable with Peter's friends and family taking larger roles than previous films, they just don't cut it. The comedy misses it's mark and the emotional scenes have no impact. The only good supporting character in first half is Dr. Strange. But, the second half does redeem the film somewhat. This is probably one of the weakest in the franchise."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "sauravraj-98887",
        "review_rating": "10",
        "review_title": "Best Marvel movie of all time .",
        "review_detailed_main": "This is the greatest Marvel of all time . The cheering and clapping it received from the crowd was huge from starting till the end . The movie had everything and in true sense it's a marvel done by sony and Marvel . Everyone should go to movie hall to experience the true feeling of the movie ."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Misss25",
        "review_rating": "7",
        "review_title": "Spider-man stupidity doesn't make sense",
        "review_detailed_main": "I love MCU's other spiderman's movies, they were great, specially the last one ''Spider-man :Far from home\"I was just mesmerized by it's virtual effects and story was kind of unique and tricky too. However, I excepted a bit more in this as the ratings seems really high. But, all my expectations fall flat. I donno why they tried to present Spider-man as a messy one! Most stupidest thing is why would he tries to snach the box from doctor strange? For saving these dangerous criminals??"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ivan-sablin",
        "review_rating": "10",
        "review_title": "A closure for many stories",
        "review_detailed_main": "This is a wonderful film which feels true to the spirit of the comics and the character. The writing is great, there are a lot of witty exchanges and great character moments. The acting is also top notch. No spoilers, it is really worth seeing."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "surfisfun",
        "review_rating": "7",
        "review_title": "getting tired of cgi overload situations",
        "review_detailed_main": "Maybe if i seen it in imax theater i been more appreciative.\n\nI thought it was infantile in its dialogues and ways DR Strange deal with all this until it get so the end.\n\nIts a blockbuster . Big budget.\n\nKids and young teens will probably adore."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "thejeta1",
        "review_rating": "1",
        "review_title": "Ridiculousness",
        "review_detailed_main": "I'm unsure of why this has received a high IMDb rating. It's rubbish and slow and nonsensical. Instead this film rakes in all past cast members for some obscure reminiscent feelgood film. Trash at its Hollywood best. You've been warned."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "tallinnuk",
        "review_rating": "10",
        "review_title": "100% The Best Spider-Man Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kalidasanmrms",
        "review_rating": "10",
        "review_title": "The Best Spiderman movie of all Time!!!!",
        "review_detailed_main": "It's the best Spiderman film I have ever seen in my entire life!!! Also one of the best comic book films . It's Dark emotional and suspenseful at the same time . Tom holland was just amazing . Must watch!!!!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "smatatov-39695",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Finally filler the whole in my heart that was left by the first two movies. I can finally go on in peace knowing that my favorite spider men got the closure they deserved."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "iamaayushkr",
        "review_rating": "10",
        "review_title": "Speechless",
        "review_detailed_main": "It's mind blowing. One of the best MCU movies and probably the last one where you would find so much happening around in one movies. It's complete Chaos package with superstar and villains. MY 2ND BEST MCU MOVIE AFTER IRONMAN.\n\n100% recommend 👍🏻"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Kherzon",
        "review_rating": "7",
        "review_title": "An Awesome Mess",
        "review_detailed_main": "I really don't like the MCU very much, but I love Spiderman wholeheartedly. I watched this movie 5 times in theaters, imagine my hype level at this movie's reveals.\n\nBut my hype didn't stop me from seeing this movie's glaring problems.\n\nAs many have mentioned before, the events that set the story in to motion are ridiculous. Even I know that Dr. Strange is acting strongly irrational and impulsive. And then he has the gull to blame Peter, even though Strange is jumping in to a spell without explaining its effects on Peter's life. This is actually an unacceptable level of writing.\n\nNot only that, but they messed up most of the big cameos in this movie.\n\nFirst off, Jamie Fox's Electro is just a straight up a different character. I think Fox's ego might've gotten in the way of the writing because he is literally the same character he played in Baby Driver. What happened to the sensible and insecure Max from TASM 2? He is also not blue anymore, andq he doesn't even mention the fact. That being said, his character does get a few intentional laughs.\n\nFlint Marko and Dr. Connors were just there, so they can tease and not deliver the Sinister Six. The actors weren't even on set. They could've easily been cut from the movie and nothing would be lost. They also don't explain why Flint Marko stays in sand form the entire time. It's really weird and distracting because he never did that in Spiderman 3.\n\nDr. Octavius was alright, even if he did seem a little more whiny than usual. And they pull a weird fake out scene with him where he just runs off for no good reason except that it's convenient for the plot.\n\nNorman Osborne was great, except that he is freakishly strong compared to the first Spiderman movie. Maybe Tom Hollands Spiderman is just a lot weaker than Toby's.\n\nIf they had Electro acting like Electro, and given Dr. Octavius a bit more of a motive for the mentioned scene, we could've had a nice 3v3 setting without the nonsense Connors and Marko brought with them.\n\nOn the flip side, I love what they did with Andrew's Peter Parker. He alone had two scenes that made me teary-eyed.\n\nThey also did a great job with MJ. She was less snarky and quirky and more supporting and vulnerable. I actually really enjoy her character now.\n\nToms Peter got some very strong emotional moments as well, and I like that they essentially fixed every common complaint people had about his character.\n\nOne more thing I have to get off my chest is that the CGI in this movie is horrendous. Pretty much all the most important scenes in this movie look distractingly terrible. From Andrew's reveal to his key scene with MJ. My first time seeing the movie, I honestly wondered if that is Spiderman from a animated universe until he took off his mask.\n\nThe entire end battle looks terrible as well. The color scheme for that fight is just dark browns and greens. It's as if they were trying to hide the terrible CGI. Unfortunately, that results in there being very few actual frames where we can see the Spidermen in action. Just from the memes I've seen about the movie where people are trying to create templates, it seems there are very few shots that can even work as pictures because it's very dark and is usually blurred by motion.\n\nDon't get me wrong, the movie is great, but it easily could've been a 10/10 movie for me. That's why it's so infuriating to see them blunder all this potential. I don't know if it was studio interference, but a lot of baffling creative decision keep this movie from being a masterpiece for Spidey fans."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "yadvindersaini",
        "review_rating": "10",
        "review_title": "Dream Come True",
        "review_detailed_main": "This movie is the best thing I've ever watched.. I've always been a huge Spiderman fan, what could be better than watching all the Spiderman sharing the same screen in addition to some marvel magic. It's just not that, everything in the movie made sense.. it wasn't just something that you will like just because of your favourite heroes. This movie is packed with each and every element, a roller coaster of emotions. In these 2.5 hours you'll laugh, cry and scream. Overall, This movie ended up being way above my expectations.. I was really waiting for some good old marvel movie after Avengers-endgame but this one is just something else. If you are a Spiderman/marvel fav go and watch this as soon as you can."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "edvinskoglund",
        "review_rating": "6",
        "review_title": "Great movie but overrated (minor spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "akjaved-04625",
        "review_rating": "10",
        "review_title": "Exceeded all my expectations😍",
        "review_detailed_main": "I was afraid that NWH would also be as bad as Spiderman 3 or TASM 2 with so many characters being involved. Nothing like that happened here. It was smart writing, everybody did their parts perfectly. Willem Dafoe is the real MVP of this movie which came in as a Surprise for me as I wasn't expecting much from him. As a good Spiderman movie, it had emotions, drama and humour. Go watch it, before anyone spoils it."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "bryangary65",
        "review_rating": "7",
        "review_title": "Time to go home",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "rashidovtj",
        "review_rating": "1",
        "review_title": "Worst Spider-Man Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jasburke",
        "review_rating": "10",
        "review_title": "Very good",
        "review_detailed_main": "Very good movie, enjoyed it a lot. I was engaged throughout the entire movie, and I thought that every act was basically a masterpiece, culminating to what is now my favorite movie."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "shahzebnas",
        "review_rating": "10",
        "review_title": "PERFECT",
        "review_detailed_main": "Well well... Easily the best MCU film so far and is also among my top 3 favourite films of all. This won't give you even a second of time for you to blink your eyes..."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "carolineeric",
        "review_rating": "10",
        "review_title": "Perfection!",
        "review_detailed_main": "This was one of the best Marvel movies ever - Funny, Emotional and Highly Nostalgic.\n\nLoved how all the characters got closure and it was just brilliantly unbelievable to see our favourite characters from 20 years ago."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "abrujo",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "I'm not a fan of spiderman but this movie it's the best of all spiderman's movies. Really enjoyable, maybe the plot is not kinda logic, and Tom is kinda annoying when acts, but it's good."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "FlashCallahan",
        "review_rating": "7",
        "review_title": "Norman's on a sabbatical Honey!.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "rafagonzalez",
        "review_rating": "10",
        "review_title": "Best in a while",
        "review_detailed_main": "Brilliant movie, lot of emotions and completely deserves the time to watch it on the cinema.\n\nTom Holland gives us his best performance I've seen from him, his chemistry with Zendaya really shows their personal relation as a plus."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "pasaribuharisfadli",
        "review_rating": "7",
        "review_title": "A neat fan-service",
        "review_detailed_main": "Tom Holland's version of Peter Parker is still the most annoying of them all. But apparently, it works as a plot device in his third so-called solo outing, Spider-Man: Way Home.\n\nThe film's sole purpose is fan service and ties any loose ends neatly. So neat that we tend to overlook the so many coincidences and/or conveniences that occur in its plot.\n\nNonetheless, kudos to Jon Watts for executing an enjoyable feast that will satisfy any Spider-Man fan from every universe."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "manavarya-20224",
        "review_rating": "10",
        "review_title": "It is the best movie of 2021",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "marcusiianderson",
        "review_rating": "6",
        "review_title": "Standards for a good movie have gotten low",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "EpicMovieCompilations",
        "review_rating": "3",
        "review_title": "Sincerely Disappointing and Objectively Pointless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "awnitasehrawat",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "leesinclair-65276",
        "review_rating": "10",
        "review_title": "Hand's down one of the best comic book movies",
        "review_detailed_main": "This movie was a fantastic adventure filled with everything and more you'd want from a movie about such a popular character that is known and loved through generations, it's really a movie to bring everyone together!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "nevermind54",
        "review_rating": "8",
        "review_title": "My professional view",
        "review_detailed_main": "This part of Spider-Man is especially important from the whole story of this movie. In addition to the new characters we see on our screens such characters as Tobey Maguire, Willem Dafoe and others that we haven't seen since the first parts of Spider-Man. More than ever this part of Spider-Man: No Way Home ties into the entire history of Spider-Man. I recommend everyone to revisit all the movies before this part to re-live the storyline. I advise to read the review of the film not just one, but from several film experts. Because this series turned out to be controversial for many experts. But personally for me it is a masterpiece that should be nominated for at least 2-3 Oscar nominations."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ariandoski",
        "review_rating": "10",
        "review_title": "A movie that gave us hope that Marvel has more to give us.",
        "review_detailed_main": "After a worst movie in all of Marvel's history (Eternals). Marvel came back in the best way we can imagine. Marvel has a lot more to give us. Spider Man No Way Home is a movie that was built 20 years ago from the first Spider Man movie with Tobey Maguire. That's why it's one of the best movies in history. That you bring back the most characters influenced by us from old Spider man movies, it's just succeeding as you should expect."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "racnifo",
        "review_rating": "",
        "review_title": "Marvel Cinema doesn't get any better than this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "therealjaysmoke",
        "review_rating": "6",
        "review_title": "Beware of the fake reviews, this deserves nothing more than 6",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "biography98",
        "review_rating": "9",
        "review_title": "I Loved It!!",
        "review_detailed_main": "This is it, my friends, the best entry in the Spider-Man series (which is saying a lot). The cast is excellent with Holland the best. He looks good in boxers as well. I thought the 2.5 hour film would drag a bit. But it flew by. Too bad James Stalin was not in it. Guess he's too busy writing his books (Hollywood Lesbos: Who Screwed Who is his latest). I had not been in a theater for years. It was well worth the wait. An amazing film that will break every BO record in existence. Congrats to all!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "nogodnomasters",
        "review_rating": "7",
        "review_title": "No good deed goes unpunished",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "shoanmohammad",
        "review_rating": "10",
        "review_title": "Its enough to make a grown man cry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kgprophet",
        "review_rating": "7",
        "review_title": "The Ultimate Fan Service Movie",
        "review_detailed_main": "While this third movie in the latest trilogy of Spiderman films will more than placate the fanboys and fangirls out there, it is at a cost. This movie could have easily clocked in at two hours and feel like the perfect blockbuster movie. But no. After the finale, the \"good byes\" stretch on and on. Then of course there is baiting for other upcoming MCU movies. Even the fun jokey jokey scenes that are the hallmark of this franchise get cringe-worthy sometimes. I still give this movie a thumbs up, because it took a concept and found some fun with it. There is a little bit of manipulation, with more than a few tear jerker scenes (really? How many times do you need to push the waterworks?). But the biggest thing this movie has going for it is re-thinking the villains. Instead of the villains arriving and being bad guys, we find a way to make them sympathetic, and the audience will go along with the alternate storyline.\n\nI also like Benedict Cumberbatch. He fares well as a secondary character that only appears in the movie every once in a while. At the heart of the success of this current iteration of the Spiderman franchise is the friendship, particularly MJ and Ned. They stay integral to the center of the story quite intentionally, so you feel this is more of an ensemble piece that the previous two movies. However, the expected fan service (rumors are true) takes over and becomes the twist in the story. The concept of multiple universes has been pushed by Marvel for the last couple years, and here it is used as a vehicle for conflicts that arise.\n\nSo I enjoyed the story, the treatment of the villains, plus the high buck action scenes we expect, and the supporting characters. For that reason, I will declare this film is the best of the three. Just get ready for some tugs at the heart in the third act, where you may find yourself getting a little annoyed that another music cue (the solitary piano notes with the sad violin) is making you well up again.\n\nI will give this a 7 out of 10, despite the extra half-hour of hugging."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "FixedYourEnding",
        "review_rating": "4",
        "review_title": "Sad and mindless 2.5 hrs",
        "review_detailed_main": "I feel sad to be living in a time where a movie like this can get high ratings. This movie is for low-attention-span adrenaline-immuned viewers, which unfortunately there are more and more of. Unless you are a group of teenagers looking for a night-out, I would not recommend this movie at all.\n\nI didn't expect much from this movie other to be an entertaining comic-book-like story. Boy, was I disappointed. It has been no more than a collection of random fight scenes with incoherent story and almost random dialogues in-between. Also, I think the casting of Spider-man, M. J. and Aunt May are just horrible. Tom Holland appears to have the brain of a 10-year old, and Zendaya is great in other films, but as MJ she just doesn't work, same goes for Aunt May (Marisa Tomei) she looks way too young, flirty and brainless, exact opposite of what this character should be.\n\nOverall it is a slaughterhouse to everything that spider-man should stand for. It is concentrated around universes and egocentric personal problems instead of being a moral model of real-world problems. The 2.5 hours long movie seem to just be an adrenaline shot one after the other, no substance and nothing to learn from. I'm sadden by having to write this, the production quality is great but where is a plot, a moral and generally being a better person. Sony should be ashamed of themselves for dragging Stan Lee's creation through the mud like that and Marvel should consider terminating their license for this creation. Seriously."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "marwinsingh-30063",
        "review_rating": "10",
        "review_title": "MOST MEMORABLE EXPERIENCE I'VE EVER HAD IN CINEMA..",
        "review_detailed_main": "Spider man no way home is filled with old school memory, nostalgia, heart, action, adventure, high octane and action scenes, heartfelt and tearjacking emotions and most importantly pure fan service.. smnwh is one of the best superhero movie ever made and I'm saying this as a true DC fan, but i also love marvel.. I don't see any rivalry between em.. anyway if you want to relive your early childhood to teenage years memories go watch it... this film exceeded my expectations way more than big epic scale films like infinity war, endgame, zsjl etc.. smnwh is also made on a big scale.. i can't say anything anymore because I fear i'll spoil it for you and i don't want to ruin your fun.. but I'm sure you guys will have no idea what will happen in this film if you still haven't seen it... just go and see this film as soon as possible to get a once in a generation event.. because I'm also going to see it tomorrow and then again on Sunday and maybe even on Christmas also.. thank you Kevin feige, amy pascal and jon watts for creating this event movie.. and a big big big thanks to legendary STAN LEE and STEVE DITKO. Fans will be in your debt forever I'm sure you are enjoying everything from heaven ... can't wait for next spider man trilogy.. thank you written on 16 Dec 2021..11:00 pm #spidermannowayhome.\n\nBY- MARWIN SINGH."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "firdausshallo",
        "review_rating": "8",
        "review_title": "BEST THING EVER",
        "review_detailed_main": "Tears, laughs, nostalgia, heartache, emotional beats, everything about this movie is perfect. You won't regret watching it 5 times just for the effect. Ugh I need to get my next tickets asap."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "evansjoshyr",
        "review_rating": "8",
        "review_title": "The most fan-servicey film that ever fan-serviced",
        "review_detailed_main": "The cheers in the cinema said it all. This is a film for the fans of spider-man and is a Swan song to his history on the big screen. Sure some of the comedy doesn't quite hit, there are some pacing troubles and not every character has enough screen time to flesh out their character.\n\nBut despite its problems, this film excels at listening to the fans and giving a spider-man movie that will be remembered as ending an era just as endgame is remembered for the avengers."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "zouhirl-46700",
        "review_rating": "10",
        "review_title": "Thank you marvel thank you sony for masterpiece",
        "review_detailed_main": "Marvels best solo movie ever Amazing Everything they give in it Best movie Super Gonna break all records One of the best movie of decades Marvels best solo movie ever Amazing Everything they give in it Best movie Super Gonna break all recordsMarvels best solo movie ever Amazing Everything they give in it Best movie Super Gonna break all records One of the best movie of decades One of the best movie of decades."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "felipezoquii",
        "review_rating": "",
        "review_title": "Celebration.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "natashachanson",
        "review_rating": "10",
        "review_title": "MASTERPIECE",
        "review_detailed_main": "The best spider-man movie to exist. I don't really have words because I'm still trying to process the whole movie. Iconic. Masterpiece. One of the best movies ever made. Watch it."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "zd00",
        "review_rating": "6",
        "review_title": "Not as good as fans make it seem to be.",
        "review_detailed_main": "I'm not a hardcore fan, but I've watched all MCU movies, even rewatched several ones, and find them entertaining in general. This is the first time that I thought 'ok, this is not a film I would want to watch again.'\n\nThe fan service was a top priority it seems (complete with meme-level references) and the novelty this film introduces wears off quickly (especially since it has been rumored long before release.)\n\nThe script is particurarly weak, the dialog had cute punchlines but lacked cohesion, the direction was kinda bland and even the fx were not to my liking - although they look great, something was off; maybe it was just a case of trying too hard to fascinate the audience.\n\nThe whole premise was weak, with frequent stupid decisions by the characters and Dr. Strange being particularly non-sensical, careless and possibly out of character.\n\nOn another note, Tom Holland does not look like a school boy anymore; it's kinda distracting.\n\nWell... ¯\\_(**)_/¯"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "diogocanelas",
        "review_rating": "9",
        "review_title": "Astonishing! Best spiderman so far",
        "review_detailed_main": "This movie has everything! It's packed with action from start to finish, funny as hell, great visual effects and a few surprises with some unexpected appearances. Watch it on the big screen, you won't regret it!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "zulrizvi",
        "review_rating": "6",
        "review_title": "Not really great",
        "review_detailed_main": "It was good entertaining, but suppose there were no Andrew and tobey's spiderman anywhere before this, then this would have been an average \"into the spiderverse\" thing with weak or poor plot.."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "artbyabhi",
        "review_rating": "1",
        "review_title": "What's wrong with world or i did not understand anything till date",
        "review_detailed_main": "It's an OK movie, an average movie, which has characters from other movies because the studio who purchased the other studios had those characters.\n\nSimple, nothing wrong with it.\n\nThis is a basic yawn-worthy story line, containing nothing for a serious movie human, with faulty plot lines. No problem with that. Every week there is one or the other weak movie being premiered and get bashed as per their standard.\n\nWhat amazes me is the mass public reaction towards this movie, sometimes dubbing it as the best Marvel or Spider-man movie of all time. No it is not.\n\nIt is simply not worthy of a single-time watch."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jordanx-03437",
        "review_rating": "8",
        "review_title": "This movie was awesome.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jk1985",
        "review_rating": "9",
        "review_title": "Some great moments in a brilliant film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "lewis_ice",
        "review_rating": "10",
        "review_title": "11/10, amazing",
        "review_detailed_main": "No spoilers here, just go watch it, debatably best marvel film to date, along with End Game. No way home is just as good but in its own way, and it's nice that the story is much more character focused than End Game, with there being way less main characters in it!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "erin_d187",
        "review_rating": "10",
        "review_title": "Perfection!",
        "review_detailed_main": "Tom, Zendaya, and Jacob are absolutely perfect in this film! There are several other surprises that I would hate to ruin for Marvel fans that have yet to see the film, but just know it won't disappoint!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jediwalker-49827",
        "review_rating": "",
        "review_title": "OK but not the best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "margineanvladdaniel",
        "review_rating": "6",
        "review_title": "So many things to say but I'll start with lazy writing all over again",
        "review_detailed_main": "Not gonna spend more time to say much than I did in the cinema and thinking about it after so I'm going to limit myself to disgraceful,typical marvel. They destroyed every character, Molina deserved it, he admitted he did it for money, i don't know how much they payed the others to let them humiliate their characters like that. Willem Dafoe deserved all the praises for holding the ground and keeping his integrity and regret that we don't have a joker movie with him. I hope everybody sees this movie and compare the views, see the cliches and the unoriginal ideas. Waiting for Morbius, hope that one isn't destroyed too."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "henkejake",
        "review_rating": "9",
        "review_title": "Marvel creates another win!",
        "review_detailed_main": "Whether you like action in general, or superheroes, or anything Marvel has done this far, this has everything an amazing movie should have.\n\nAside from the web slinging and awesome fight scenes, the acting and emotions throughout this film should be greatly admired, for the cast does an fantastic job creating something so beautiful.\n\nTom Holland definitely proves himself to be a well rounded artist, and it rubs off on everyone sharing the screen with him. The story is great, almost too simple, yet we get sucked into this journey that takes the audience on an unforgettable ride.\n\nTickets are going to be sold out quick for this film but be patient, it will be well worth the wait.\n\nA must see!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "JustinianusTheSecond",
        "review_rating": "6",
        "review_title": "Unlike many I found the story very weak",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "aidannash-21510",
        "review_rating": "10",
        "review_title": "With great stakes comes great expectations. And boy, were those expectations exceeded.",
        "review_detailed_main": "This movie is... incredible. Out of all the Spider-Man movies I have seen (The original Raimi trilogy and the MCU trilogy), this one is the best. And that's saying a lot, because Spider-Man 2 was an absolute masterpiece that made me really appreciate not just Spider-Man, but Peter Parker, the boy behind the mask who wants so desperately to live two separate lives, one as a superhero with the responsibility to save the lives of the people around him, and another as just a regular, gold-hearted kid with friends and family. All that being said, however, the reason I like No Way Home more than Spider-Man 2 is because I had not actually seen the Raimi trilogy until AFTER I saw No Way Home, as that movie is what made me realize how deep Spider-Man actually is and that I wanted to look more into him. So, me loving this movie the most is almost definitely because of my personal experience with it. It sparked my interest in the webbed hero with just a kid behind the mask, and it did so while also living up to the expectations of long-time veterans and fans of him. This movie is an absolute must see if you are at all interested in Spider-Man. While it may not be perfect and have its flaws (like the pacing at some points being a bit weird and having quite a slow, drawn-out startup), it is still an absolute masterpiece in the Marvel series, and the writers, directors, and all others involved in the making of this film can be happy knowing that Stan Lee is smiling down upon them from heaven, truly proud of how his beautiful character and universe is being carried on to soar high."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mr_bickle_the_pickle",
        "review_rating": "7",
        "review_title": "I loved the themes, not the humour",
        "review_detailed_main": "I know this is going to be unpopular opinion....but I feel disappointed with this movie. I think my main problem is the comedy. First of all, I didn't find much of funny just super corny. But they also relied on it too much where I felt like it was detracting from the more serious moments. I was getting tonal whiplash. Am I supposed to be sad right now? Or Am I supposed to be laughing? And also I know movie has gotta movie and propel the plot forward but there were certain things that happened that felt WAY too convenient. And it sucks because this film genuinely has a good plot and themes. And some seriously dark moments in the film that gives it gravitas. I think I would have enjoyed the film more if they had just toned down some of the jokes, the meta, and some of the fan service to focus more on the story. I thought Tom Holland was great though and really stepped up into a more mature Spider-Man. And I thought the character arcs in general were good. Again, didn't hate the film. Lots of stuff to like, just overall not my favourite. I'm struggling how to rate this though...probably somewhere between a 6-7."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "aavaliani",
        "review_rating": "1",
        "review_title": "the level of stupidity is astounding",
        "review_detailed_main": "The only good thing about this movie is the visual affects. I wasted 2.5 hours watching this. I was really waiting for something exceptional based on the reviews this movie got. But in reality it is worse than matrix resurrections."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "dashasskachkova",
        "review_rating": "10",
        "review_title": "Holland's best film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "krzeslawxdd",
        "review_rating": "10",
        "review_title": "OMG",
        "review_detailed_main": "In short- that movie rocks! Its a textbook definition of fan service. We got all that we wanted and more! For entire duration i've been completed stunned at storytelling, visuals and acting. I might be biased because i'm huge MCU fan, but i do not care. I loved every second of it, can't wait to see what future holds for us, spidey fans. Despite everything that is happening in the world, im glad that i'm alive right now."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jacobrt33",
        "review_rating": "9",
        "review_title": "They pulled it off!",
        "review_detailed_main": "This movie was truly everything it could've possibly been. One of Marvel's more moving stories for sure, it brought a lot more emotional weight to this iteration of Spider-man, which it needed. I really appreciated the growth of Tom's Peter Parker, and can't wait to see what they do next with him. Despite the large number of villains in this movie it managed to still feel balanced, driven, and true to the characters. Loved every second."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "aas-52026",
        "review_rating": "10",
        "review_title": "Way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jon_hsieh",
        "review_rating": "6",
        "review_title": "Decent...not sure what these 10/10 are about",
        "review_detailed_main": "Thanks to writers Erik Sommers and Chris McKenna, Tom Holland is officially the dumbest and most annoying spiderman ever.\n\nI didnt like how they couldnt be creative and do something else but to do an Into the Spider Verse live action.\n\nProduction 8/10.\n\nActing 7/10 Script. 6/10 Director. 6/10\n\nWould i recommend it? Sure, if you got nothing else to do."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "javier_galindo",
        "review_rating": "10",
        "review_title": "AMAZING.",
        "review_detailed_main": "This was the best movie I've seen in 2021. It had everything I wanted . Chef kiss. I need more Spider-Man's like this movie. I loved every little bit in it."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "tchitouniaram",
        "review_rating": "6",
        "review_title": "very decent installment!",
        "review_detailed_main": "Personally for me , it is far from best Spiderman film ever) It feels so overwhelmingly too much , with all the previous villains and previous Spidermen , that for me all film somehow lost focus... nevertheless , definitely worth to watch !"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "itzwilleypvp",
        "review_rating": "10",
        "review_title": "Best spider man movie",
        "review_detailed_main": "In my opinion this is easily the best spider man movie so far. The emotions swings like a roller coaster and your childhood dreams gets fullfilled. The movies also contain a lot of humor, so you'll get a good laugh too, thats for sure. The movie get better if you're a marvel fan and knows small details and so on."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "omerkaravani23",
        "review_rating": "7",
        "review_title": "Top 5 in the MCU",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "elliotjeory",
        "review_rating": "4",
        "review_title": "A lazy mash up of Spider-Man films",
        "review_detailed_main": "I was disappointed, they have run out of ideas so they bring out Spider-Man greatest hits. I found it rather boring and I think it's getting silly all these cross over films but the masses keep going so they will continue to make them. It's a good film for die hard fans but for the casual viewer it lacks any real substance."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "liamgg-26681",
        "review_rating": "9",
        "review_title": "Great Ending To A Great Trilogy",
        "review_detailed_main": "While No Way Home never reached the heights of some of the MCU's best for me, the film is still an incredible achievement that carefully juggles decades of Spider-Man storytelling to craft a satisfying adventure that takes you through many different emotions. The third act's big surprises might overshadow some of the movie's flaws, but the handling of fan service is done to perfection without feeling forced. A great ending to one of my favorite superhero movie trilogies of all time."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "gearley",
        "review_rating": "9",
        "review_title": "This film is everything The Eternals isn't.",
        "review_detailed_main": "Without doubt this is the best Spider Man film yet made. It's filled with character, passion, loss, humor and pathos; plus the special guest stars will bring a smile to your face. Our cinema cheered when they appeared.\n\nThis film is everything The Eternals isn't."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "JHJReviews",
        "review_rating": "10",
        "review_title": "Amazing!",
        "review_detailed_main": "What can I say that has not already been said. Spider-Man: No Way Home is an amazing moving hands down. I really enjoyed that marvel studios didn't waste any time getting right to the action of the plot. The most impressive exploit in the spider-man movie is how marvel leaves loose ends with every character. Which is a brilliant idea that keeps the audience guessing what's next. So if you are wondering if this movie is worth watching the answer is \"YES.\" A huge heads up if you haven't watched this movie it will leave you with a warm unsettled heart."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "bodygaurd-50498",
        "review_rating": "9",
        "review_title": "Truly Awesome",
        "review_detailed_main": "Well made film for all THE spiderman that has come till date. A proper satisfaction to the fans of Spider-Man's as well Marvel's. The only thing missing in the film was THE GREAT STANLEE 😔."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ChelseaAndell",
        "review_rating": "",
        "review_title": "Easily Top 5 Favorite Marvel Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "connorwburnett",
        "review_rating": "7",
        "review_title": "A massive step up for Marvel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "antonlvdm",
        "review_rating": "10",
        "review_title": "My favorite Spiderman movie!",
        "review_detailed_main": "This was just perfect. It borders on Endgame for my all time favorite Marvel movie. This is how you do nostalgia right. What are you doing still reading reviews about this movie, go and watch it already!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "michael_keip",
        "review_rating": "6",
        "review_title": "Okay but not great",
        "review_detailed_main": "It was fun to watch. But the plot was very poor.\n\nThe whole story of the movie is set in motion by very stupid choices by the hero's that should know better than this."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "faizz-70520",
        "review_rating": "10",
        "review_title": "With great power comes great responsibility!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "danielegiuseppefronte",
        "review_rating": "7",
        "review_title": "Not a masterpiece, but an incredible and unrepeatable experience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ajsporty",
        "review_rating": "1",
        "review_title": "One of the worst films of all time",
        "review_detailed_main": "Embarassing. Cheap fanservice. Nostalgia feeding. Plot points that make no sense. Awful action. And terrible, behaviour between the three spidermen.\n\nI however must give respect to Willem Dafoe for his diamond in the rough performance. The few lines of dialogue he had brought me back to 2002."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ssethy-08096",
        "review_rating": "10",
        "review_title": "Tom Holland is finally... Spiderman!!",
        "review_detailed_main": "This film is a love letter to both Peter and Spidey, packed with every little thing that a spiderman movie needs... It finally shows us Peter's selflessness, his desire to have everything, and the eventual acceptance that he can't. He learns and grows and changes so much. FINALLY FEELING LIKE HE IS HIS OWN PERSON!\n\nTom Holland is finally... Spiderman!!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "blackcat-45811",
        "review_rating": "8",
        "review_title": "Tobey made this movie 10/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "NicolasTheWolf",
        "review_rating": "10",
        "review_title": "One of the best experiences",
        "review_detailed_main": "This was one of the most impressive cinema experiences I ever had. Spider-Man: No Way Home really had it all. I still have no words for what I just witnessed.\n\nAmazing."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "itisallgoodman",
        "review_rating": "9",
        "review_title": "More than Expected",
        "review_detailed_main": "After the third phase of Marvel Cinematic Universe, the franchise dropped the quality and I don't remember seeing an impressive movie since Phase 4 so far. Spider-Man No Way home became the biggest hype of the year 2021. In the end and I was personally expecting a dissapointment due to the weak performance of MCU in the last time, but No Way Home did way more than I expected. The movie full of nostalgic and emotional scenes. The movie that connects all the generations together and makes a perfect ending to all the three Spider-Man franchises. In the end, this is an another masterpiece from Marvel, with the best fighting scenes I've ever seen in my life, with the best Picture, the best CGI and the best acting so far. I loved The Spider-Men relationships and I have to say that all the three legendary actors (Tom Holland, Tobey Maguire and Andrew Garfield) did a perfect job portraying their Spider-Men."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "stariali-75748",
        "review_rating": "",
        "review_title": "Setup for future Spiderman movies...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jonney-spicer",
        "review_rating": "7",
        "review_title": "The people's Spider-Man film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mattfillinger",
        "review_rating": "10",
        "review_title": "Peak Fiction",
        "review_detailed_main": "Spider-Man: No Way Home is the greatest live action Spider-Man movie of all time. It is a thrilling end to the \"Homecoming\" Trilogy and it sets up the next one perfectly. The acting in this movie is incredible and it is emotional and thrilling beginning to end."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "argpolkon",
        "review_rating": "6",
        "review_title": "This film is made only for Spider fans.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "AlsExGal",
        "review_rating": "8",
        "review_title": "This is more like a family reunion...",
        "review_detailed_main": "...as it brings together past villains such as Dr. Octopus, Electro, Green Goblin, Lizard, Sandman, and a few other characters from past versions. They have returned thanks to the multiverse, an inter-dimensional portal accessed by the stern Dr. Strange (Benedict Cumberbatch) in a spell gone awry intended to restore Spider-Man's (a winning Tom Holland) anonymity after Mysterio outed Peter Parker in Spider-Man: Far From Home.\n\nThe multiverse functions as a Macguffin of sorts. It's the jumping off point for Marvel movies to do what they do best, and No Way Home doesn't disappoint, thanks to that tried and true formula of good-natured banter and giddy CGI set pieces. I liked how it taps into Electro's awesome power. I kind of imagined that Electro, played by Jamie Foxx, perhaps, and this is a big perhaps, could be a crime-fighting consultant in some future movie. And Willem Dafoe gave a tortured performance as Norman Osborn, fighting hard to silence the diabolical inner voice of Green Goblin.\n\nAll Marvel pictures have non-preachy messaging. No Way Home touches on grief, vengeance, and also makes a case for humanity's redemptive nature."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "davidallenxyz",
        "review_rating": "6",
        "review_title": "Crowd-pleasing moments disguise a pretty average superhero movie",
        "review_detailed_main": "Here's the recipe for \"No Way Home\":\nA generous portion of fan service\nA heavy dollop of sentimentality\nMix roughly with the multiverse\nServe on a bed of CGI\n\n\nThere is a fantastic idea the heart of this. Universes collide and every nemesis of Peter Parker is searching for him. Which means that the villains (and heroes) from the previous Spider-Man films end up in the current world. Willem Dafoe and Jamie Foxx in particular are fantastic in their roles.\n\nThere is some unexpected tragedy in the film, and the heroes of the past spend a lot of time reflecting on their own misfortunes. This has an emotional impact but does slow the film down at key moments.\n\nThere is far too much CGI (as usual) so you end up watching something closer to an animation or a video game at times, with scant regard for physics. Doing so much work in front of green screens really impacts the acting as well.\n\nThe biggest issue is the superhero story itself - the bit where the good guy overcomes the bad guy. All the multiverse nonsense struggles for logic and takes a long time to set up, and Spider-Man doesn't really spend enough time fighting the bad guys at the end. The action sequences are good but they feel like an afterthought.\n\nThis is a film for the fans. The neutrals (like me) may not get so much out of it."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "domica-79503",
        "review_rating": "1",
        "review_title": "Wow!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "borix-65340",
        "review_rating": "10",
        "review_title": "Great Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "shrif-52158",
        "review_rating": "10",
        "review_title": "crazy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ahmedintilligent",
        "review_rating": "10",
        "review_title": "Rating Things in spider man no way home",
        "review_detailed_main": "In this film i so supraiced because the VXF is Fire man and the drama and the actions in Soo cool .you should watch it in Cinema better than phone becuse the sounds and the Fell is So amazing think you marvel for this amazing movie."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "renardrambe",
        "review_rating": "10",
        "review_title": "Spiderman",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "djwave-81362",
        "review_rating": "6",
        "review_title": "Almost fell asleep",
        "review_detailed_main": "The movie tries to dazzle and is successful in it special effects. It starts to be cumbersome in the dialogue, where the story is dragging. The humor doesn't catch on and dialog is boring at moments. It was entertaining enough for a positive score, but I will not call it \"very good\"."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kdobbs10",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "Probably one of my favorite MCU movies ever! Spider-Man became my favorite because of the earlier Spider-Man adaptions, and this just reminded me of why I love him!! The plot, the character development, the flow of the movie were all superb! Well done!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "frutkoff",
        "review_rating": "7",
        "review_title": "Worth the watch",
        "review_detailed_main": "Good movie. Not my favorite Spider-Man but still worth the watch.\n\nAs a first time watch if you haven't heard spoilers and you've been a Spider-Man fan, it's fun!\n\nI got a 90s Cartoon Spidey vibe from the characters, and I mean that in the best way!\n\nI would love to see some more of Peter Parker dealing with his problems.. there were some scenes about it but it quickly moved on to the superhero segment instead of diving deeper into the character and how he deals with this situation he needs to solve. There was so much more to see in those situations in the beginning and in the end of the movie. Spider man scenes were great."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "fahadailabloushix",
        "review_rating": "10",
        "review_title": "BEST SPIDER MAN MOVIE EVER!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "DimensionsRealmsStudiosOfficial",
        "review_rating": "7",
        "review_title": "Best Spider-Man movie ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Criticalstaff",
        "review_rating": "1",
        "review_title": "In no way good",
        "review_detailed_main": "It might be the worst movie ever made. Not just because it is bad, but because of the misuse of all the resources that went into making it.\n\nI will be the first to admit that I have propensity to look for meaning when I am watching a film. Be it the straight-forward moral of the story or a higher meaning, something to make you think. That is how I enjoy cinema the most, when it gives me something to think about. Big or small. When the images on the screen are about something more than simply the images on the screen.\n\nThis film is the complete opposite of it. Its meaning is inward-looking. It is not interested of looking at anything other than itself. It is complete and utter navel-gazing. That really is the crux of the film. That is the reason why this is barely watchable. Every flaw and mistake comes from this movie's own excessive self-contemplation.\n\nWhere to put the blame is a different question. It has been established for some time that these MCU films are not \"directed\". There is no singular vision behind them and it boils down to an assembly line. The plot and dialogue are so bad I can't imagine anyone put any amount of thought into it. All the lines do actually feel like ad-libs the actors improvised on the day. Visually there is an absence of flair (and I am being generous) which is on par for the course for these movies by now. The soundtrack and sound design is, of course, forgettable. The editing is conventional. The set design is reminiscent of those real-estate videos where celebrities show their homes. The costume design is ok, again which is not shocking knowing the means that were allocated to this.\n\nThe acting could have been the saving grace of the movie. Unfortunately, Tom Holland, Zendaya and Jacob Batalon are the stars of the film. And while their performances are good, they usually have to share the screen with (multiple) Oscar-winners. It is jarring to see the best talent doing what is basically glorified background work. That is why this is the worst movie of all time. You have a film packed with the best actors working today, but we have to follow Tom Holland's inane struggle on how to apply to some college.\n\nI am not even sure I want to go into the plot. In truth it does not matter. I suspect that even the makers of this took that as a given. The Marvel Cinematic Universe has now morphed into a never ending reference and call-backs machine. That is the core of this film: \"remember this?!\" The structure of it is one of a TV show, except in TV there is an A-plot and a B-plot. This film is all B-plot.\n\nAs I am writing this, this film has been viewed by millions and is one of the highest grossing movies of all time. Please kill me now."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "srikhyaati",
        "review_rating": "10",
        "review_title": "BEST MARVEL MOVIE EVER!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "akrangare",
        "review_rating": "10",
        "review_title": "Best Spider Man movie Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "billmomopony",
        "review_rating": "9",
        "review_title": "God",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "fuzuli-67301",
        "review_rating": "10",
        "review_title": "amazing movie",
        "review_detailed_main": "I enjoyed every second of it. It is so much higher than my expectations. The humor was great and Willem Defoe is such a good actor. I love how this movie showed how strong Tom Holland spider-man can be."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "3ABM581",
        "review_rating": "7",
        "review_title": "Nostalgia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ilyavlad",
        "review_rating": "10",
        "review_title": "Great movie, a lot of potential",
        "review_detailed_main": "Awesome movie! Definitely one of the best marvel movies. And I think it deserves 9/10 rating - given how many people absolutely loved it. It is not about whether it's as Oscar worthy or equally quality made as Godfather, but whether it hit the right notes for the large part of the audience - which it did. If you put 1 ratings, just to lower the rating from 9/10 - that is just low life thinking, just enjoy a movie and put a real rating - from your perspective, don't try to counter attack \"marvel fanboys\" - because they put 10 due to how they feel about it. Look at Critics rating - that is a metric to show if the quality of the cinema is good or not and how much...it's 71 and I think it's fair. Don't be a low life."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "lucaschriskowalski",
        "review_rating": "7",
        "review_title": "Amazing? No.",
        "review_detailed_main": "I purposely didn't want any trailers as these days, they ruin movies and reveal most of the good stuff. Not many of the key action scenes from the movie were not in the trailer. Peter Parker came off as very annoying, definitely in scenes with Dr Strange and when Peter wanted to \"try\" to save the lives of the opponents from other universes. But what really frustrated me was the blatant product placement of the Hyundai, there was no need whatsoever for it to feature in the scene it did the way it did. It stopped centre on camera and the audience got a good view of this new car. Surely Sony didn't need that extra cash? Entertaining but not revolutionary. Dune was much better."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ashutoshsantra",
        "review_rating": "10",
        "review_title": "Amazing!!",
        "review_detailed_main": "The best ever movie in the marvel timeline I'd ever expected. It gave me goosebumps. Had a great experience being witnessing nwh.. It's has action suspense emotions and everything balanced which a perfect sequel movie ever had. Just loved it.!!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "thekonq",
        "review_rating": "6",
        "review_title": "Very good and enjoyable. But top 20 of all time?",
        "review_detailed_main": "This movie was a very pleasant surprise especially the latter half of it. It was great fanservice and the very fact we can see all those actors unite on screen is amazing.\n\nHowever it's a mess. A very enjoyable one but still a mess. It's obviously been shot separately with the actors not being in the same rooms due to covid but it still feels stiff at times because of that. Also the CGI is slightly undercooked as they probably worked on it all the way up to release day. The first act falls flat especially when you compare it to the rest of the movie.\n\nOverall this is a good movie however it has no right to be above movies like The green mile, Inception, Interstellar, Gladiator, Alien (1979) , Django unchained etc."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jain-99275",
        "review_rating": "1",
        "review_title": "Did not even bring back nostalgia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kokotsinis",
        "review_rating": "10",
        "review_title": "The best film ever",
        "review_detailed_main": "It has everything you could ask in a Spiderman movie ,some may be infuriated by the end but you'll understand the point of it.it was was a really smart plot , executed by a great producer.it is also fast paced."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "omarelsahhar",
        "review_rating": "10",
        "review_title": "Spiderman no way home is one of the best movies",
        "review_detailed_main": "The movie was incredible there was nothing bad about and the nostalgia is so good the ending was sad but the whole movie was supercalifragilisticexpialidocious."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "sophiakjaer",
        "review_rating": "9",
        "review_title": "Flawless",
        "review_detailed_main": "Tom holland is flawless as spider man.\n\nA well constructed movie and with very good cgi Zendaya shouldn't be MJ she's not whit minus 1 point because of her."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "0558am",
        "review_rating": "9",
        "review_title": "Strongest of the MCU Spidey Trilogy",
        "review_detailed_main": "I'll be honest, I was going this expecting the hype around the film to exceed its quality but it was delightfully surprising.\n\nDespite knowing the biggest and most exciting twist of the film (thanks internet), the film managed to surprise and deliver.\n\nWith the absolute stand out performance of Tom Holland as Spider-Man and the surprise appearance of a few familiar faces, the film delivers in an action packed yet still emotionally powerful way quickly and easily becoming the best of the MCU's Spider-Man movies.\n\nThe only real criticism I have of this film is it's reliance on past characters and films to carry the narrative of the film. Rather than coming up with new ideas for Spider-Man and the future of his character in the MCU, they chose to rehash old favourites. Whilst I understand that to a certain extent, it is a little disappointing to see so much of the film hinge on it."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "RavalRevenge333",
        "review_rating": "6",
        "review_title": "Ugh what could've been",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Red_Storm_Rising",
        "review_rating": "10",
        "review_title": "Call it a fan service, but for me it was a movie delivery of life time.",
        "review_detailed_main": "This movie is a treat for those who have been watching and loving spider movies since past two decades. Nostalgic factor is turned up to ultimate level.\n\nHats off to the creative team for piecing the idea for this movie and making it happen.\n\nThis movie is for the fans, by the fans."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kalilka",
        "review_rating": "6",
        "review_title": "Cool idea but lacking plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "seszter-58440",
        "review_rating": "10",
        "review_title": "YES YES YES",
        "review_detailed_main": "The most satisfying way to end a trilogy. This movie is chef's kiss to all marvel fans. I was laughing crying and smiling at the same time. So many emotions and awesome picture."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "you-when",
        "review_rating": "7",
        "review_title": "Solid movie - not groundbreaking",
        "review_detailed_main": "7.5/10\n\nPreface by saying I enjoyed the movie and thought the rhythm of the movie was great with it constantly capturing the audience attention.\n\nI do think the trailer was too revealing and wasn't really surprised by anything which occurred in the movie. It all seems rather formulaic. Nevertheless, definitely the best of the existing Spiderman trilogy."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "unununbelievabledeals",
        "review_rating": "5",
        "review_title": "Lazy writing and overhyped",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "cinistersynthicate",
        "review_rating": "10",
        "review_title": "The movie that almost brought world peace.",
        "review_detailed_main": "For a moment every fan on the planet was eating good, we all got together, laughed, cried, got pure excitement, and rejoiced as we saw our favorite spider-men on the screen together. Pure treat, executed insanely well. Great job marvel."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Wally71551",
        "review_rating": "9",
        "review_title": "Fan Service of the Best Variety",
        "review_detailed_main": "This movie is pure fanservice, but it (mostly) feels earned and true to what the original films they're pulling from. It never feels like it's butchering the classic characters to fit them within the MCU, and even though some are underutilised, they always do the characters justice."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "srmonopatin",
        "review_rating": "10",
        "review_title": "Spiderverse is always great",
        "review_detailed_main": "It has been the most beautiful moment in a cinema, at least for me, its like you are watching 3 different generations of spiderman for around 20 years in just 1 movie, and green goblin is the best character."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "kareemkimo-41791",
        "review_rating": "10",
        "review_title": "Spider-Man: No Way Home (What a wonderful movie)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "amjadjumaa",
        "review_rating": "10",
        "review_title": "The best movie",
        "review_detailed_main": "It's the best movie of 2021, one of the best history movies and superhero movies, if not the best. Thank you, Marvel, and we're excited for the upcoming movies."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "rockdude-68045",
        "review_rating": "7",
        "review_title": "Marvel series converted into a Movie special",
        "review_detailed_main": "In summary this movie was well received and for good reason because it's a solid good movie. With that being said it wasn't great and it wasn't the best spiderman movie. It heavily relied on nostalgia to carry the plot and development and while I can appreciate it all it didn't exactly climax as I was hoping for. Felt like the marvel series as of late just compiled into a movie instead of episodes.\n\nTom holland uses up the last of his awkward teen spiderman attitude in a overdue effort for his character to finally start truly evolving. Yet it comes pretty slow over the course of this film. Additionally, the main conflicts in this movie basically are all spidermans faults when you really think about it which makes it even less of a plot arch due to the circular reasoning behind the movie.\n\nNostalgically it carries the film for obvious reasons and while I loved what happens I feel like it wasn't as wholesome as I expected it to be.. I guess I just got a high expectation from all the great feedback of the film.\n\nThere were some glaring issues with the plots reasoning and motivations but I get it. Overlooking some of those things it felt like this film was just a filler marvel movie to set up for the next phase and it showed up in its quality. Felt more like a movie special for tom holland instead of a side series that marvel did for loki, wandavision, wintersoldier, and hawkeye. Basically the same quality and effort except instead of a series you got a movie with nostalgia.\n\nIt was still a solid film to watch but not exactly top tier from marvel. Still loved the nostalgic parts though! They might have carried this movie but it worked!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jetbluefares",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "adrilucas99",
        "review_rating": "7",
        "review_title": "I'm glad this movie exists",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "abdulazizsz",
        "review_rating": "10",
        "review_title": "Spiderman at it's best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "maceeisafrog",
        "review_rating": "10",
        "review_title": "BRILLIANT!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "sayantankabri-77715",
        "review_rating": "10",
        "review_title": "multverse consept",
        "review_detailed_main": "To say that there has been an unbelievably long wait for the Spider-Man: No Way Home trailer is actually something of a grand understatement; just looking at the two other 2021 Marvel Cinematic Universe films that never had any marketing materials released before their covid-19 delays, we see a far different story in terms of publicity: the teaser trailers for both Shang-Chi and the Legend of the Ten Rings (September) and Eternals (November) dropped some five or six months before their respective release dates, while the full trailers arrived roughly three months out. The very first preview for the third Spidey didn't arrive until tonight, just under four months until the movie's December 17 debut, and, even then, the argument could be made that it only materialized because of a leaked - and work-in-progress - version from yesterday had forced both Sony Pictures and Marvel Studios's hand.\n\nWhile the exact nature behind this unprecedented MCU delay remains currently unknown, what is known is just how much news, rumors, and sheer speculation from seemingly all corners attempted to fill the content void over the course of the past year. And, intriguingly enough, the teaser's long-awaited arrival hasn't done much to address those ardently held theories - though it certainly has given us some bones of substance to chew on until the next, full trailer gets delivered from on high.\n\nIt's a lot to parse, so we're going to do our best to wade through it all together. Here's everything we know about the big-picture, overarching connections of No Way Home now that we've received the very first narrative confirmations (and half-confirmations, as it were)."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "omerpolat-94849",
        "review_rating": "10",
        "review_title": "10/10 movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "joachimhagbarth-76783",
        "review_rating": "7",
        "review_title": "Loved the scenes hated the premise",
        "review_detailed_main": "A lot of reaches and coincidences involved to make the plot. A lot of really dumb decisions made by Peter, just to make a Grand finale. I felt a lot of nostalgia, and loved some of the scenes."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "obeadaomar",
        "review_rating": "10",
        "review_title": "A",
        "review_detailed_main": "The film was beautiful it was the best film for tom holland Jdjskakaskskentnrjrkrkrkdkdkdkdkfkkffkfkoodkd. Bdnsnsksjsjsjsndnddh sjsjeberbebdhjs.nznssnsksjsjsjsnsjsjsdjfftri."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "laurg-89074",
        "review_rating": "6",
        "review_title": "Fun Concept, but Peter just ruined it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mariadrago",
        "review_rating": "9",
        "review_title": "Lovely",
        "review_detailed_main": "This is the best Spiderman ever! I loved every scene of this amazing film. It's funny, exciting, amazing and yet profound. And you will be surprised after the first 30 minutes....a true gift (but also a great marketing choice) for all the Spiderman lovers."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "russellwalton-52531",
        "review_rating": "6",
        "review_title": "An average film hiding behind nostalgia",
        "review_detailed_main": "Let me get to the point, this film is just a crossover attempt to cash in nostalgia and is easily the weakest of the three Spider-Man films so far.\n\nThe action is great but lost is the humour and the plot, if you break down the story of this film you quickly realise that \"into the spider verse\" did it better. The story of the film doesn't have the development of the previous films, the introduction of previous people just felt crammed in for the sake of it.\n\nThe plot: I'm Spider-Man Spell goes wrong Send them back No I want to cure them It goes wrong Cures them Send them back\n\nCompare it to the actual plot of say mysterio trying to steal stark tech and cashing in on peters emotions it just felt weak. The cameos are lack lustre as well only two guys really perform well with others just throwing in a line here or there, the whole thing was a nostalgia grab.\n\nIn my eyes this film with Peter being revealed should have been Spider-Man the fugitive being hunted down, introduce kraven and a Jameson backed scorpion, have a death of a major character in Spider-Man's life and then fearing more people being hurt go to dr strange for a \"forget who I am\" spell and lead into this film. The reason for wanting a spell here is \"my friends are sad\" it's just felt like a weird jump from one film to the next and it makes me worry for dr strange 2, too many characters apparently now means sacrificing genuine story.\n\nPeople say this is the best marvel film but I say take those nostalgia glasses off and compare this actual story to into the spider verse or the previous films and review it again. It's a solid average action spectacle but lacking a real plot. Kids will adore it though."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "taba75",
        "review_rating": "4",
        "review_title": "Horrible",
        "review_detailed_main": "The first Marvel movie I couldn't watch all the way through. Poor character representation, meaningless, silly story. Viewing is recommended for children only."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "lucasbannatyne",
        "review_rating": "9",
        "review_title": "Great, Amazing, Heartbreaking, Nostalgic but lazy at points",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "djuvedi",
        "review_rating": "10",
        "review_title": "Fan-Girlin over the movie",
        "review_detailed_main": "Me being a spiderman fan sincee the longest time, bottomline, it was anything and everything I could ever ask for. I remember screaming my lungs out during the *not gonna say it* moments. You laugh, you cry and you're left jawdropped. It was a treat to watch spiderman no way home. Amazing performances, spectacular cinematography. You could say im being biased but only the OG fans can understand what it meant to us. A must watch with your friends and family."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "abeauregard-266-403837",
        "review_rating": "10",
        "review_title": "Amazing! But watch the order Spiderman movies first!",
        "review_detailed_main": "Absolutely incredible! They did an amazing job wrapping everything together. Definitely watch the older Spider-Man movies first though, and you will get far more out of this one. And of course watch all the other Marvel movies first too. Lol."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "gsglassell",
        "review_rating": "9",
        "review_title": "Spider-Man",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mohitkumarp-52286",
        "review_rating": "7",
        "review_title": "Brefing",
        "review_detailed_main": "So much brefing an detaling in the movie and in the starting of the movie it take so much time for coming the action scenes.\n\nAnd from my point of view there is also a little bit short role of dr Steven strange in comparison of tom Holland as spider man."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "zaynfenix",
        "review_rating": "10",
        "review_title": "Just Amazing!!!",
        "review_detailed_main": "The movie definitely lived up to the hype, without a doubt the best movie this year!!\n\nThis movie will captivate you from the start with the introduction of key characters to the amazing CGI and fight scenes. It is definitely worth the money. I could watch this a thousand times and would still cheer very loud!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jljacobi",
        "review_rating": "7",
        "review_title": "Generally good fun, a bit long, a bit predictable",
        "review_detailed_main": "I enjoyed this movie, and laughed out loud several times. But I also found the pace a bit slow at times.\n\nI might also say it was familiar. There's not a lot here that hasn't been done in a Marvel movie before. If I'm noticing that, I'm obviously not fully invested in the experience.\n\nI'm also found myself wondering just how long the teen angst and immaturity stuff was going to last. You find out in the end, but still.\n\nI particularly enjoyed the reunion portion, though that was a bit over done as well. What ever happened to the tight 100 minute movie? Is it in the contracts that each actor must get a certain amount of screen time? Yes, I know the answer.\n\nIn short, I thought Far from Home was the better flick. I think this one is just getting higher marks because it's not woke garbage we've been seeing recently.\n\nA good time, not a great time."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "gabigarner",
        "review_rating": "10",
        "review_title": "One of the best movies ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "nahahrithkk",
        "review_rating": "",
        "review_title": "Old Treat",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "dalfak96",
        "review_rating": "6",
        "review_title": "Top notch production with several stupid plot holes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "loozzotys",
        "review_rating": "1",
        "review_title": "so bad NO WAY IT'S AN 8.7...STOP THE FAKE RATINGS",
        "review_detailed_main": "Zendaya such bad and just awful actress.\n\nBad CGI, predictable script and dialogue again. . I expected alot more..bad acting..Tom Holland's over-acting is so bad...what happened to real acting?\n\nThe dialogue is so bad and childish and predictable and boring. What a complete waste of time and Zendaya is just bad actress. What a waste of time.\n\nToo many fake accounts making 10/10 scores."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mhalroudhan",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "This is the best movie ever the actors are amazing and over all the best movie. I could watch this move a million times and never get bored that's how good it is."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jeffgoss-91523",
        "review_rating": "10",
        "review_title": "20 Years and Worth the Wait",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "BodyX417",
        "review_rating": "10",
        "review_title": "i am in love.",
        "review_detailed_main": "Me and my sister did go to the cinema in the begining of the year and i just loved it it was so good its the best film for any spider-man fan and it is by far the best spider-man experience out there."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "chinmayabj",
        "review_rating": "",
        "review_title": "Great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "omarkhaled-01746",
        "review_rating": "7",
        "review_title": "does fan servicing make a great film ?!",
        "review_detailed_main": "NON-SPOILER Review\n\nAs expected it was a fan service film filled with most unbelievable surprises ever put to a screen ...Screams were louder than bombs and audiences couldn't catch their breaths fron the amount from nostalgia but as a STORY ....logic , drama ...to be honest I don't know as it really suffers major plot holes specially at the first half and the middle ...it was almost like a Satuday Night live comedy mashed all the comics relief your mind couldn't possibly imagine into a emptinees as it lacks the necessary logical mechanics of events that lead us not to be emotionally invested into an important dramatic turn , though in the third act quite the opposite , I cried from the ending which was really GREAT , laughed hilariously from some of lines , screamed from the insane depiction of DETAILS and moments between characters and owened by the great direction and cinematography which was the only parts consistantly great throughout with the great acting from EVERYONE ...specially willem defoe and tom hollan however a reminder if you are not from the generation of the 2000s and not a fan of spiderman in general ...don't expect anything else storywise ..."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "wasimhalder",
        "review_rating": "10",
        "review_title": "I love this",
        "review_detailed_main": "Most amazing movie i have ever watched.film directory is awesome Nostalgic scenes are very reminiscent of childhood No matter how many times I see it, it doesn't seem old. Every time I see it, tears come to my eyes."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "zoe_leeman",
        "review_rating": "6",
        "review_title": "Had so much potential",
        "review_detailed_main": "It had potential to be amazing- bringing back the og's, but they quite frankly ruined the best villains with this film- it was overkill and entirely rushed. They also did Tobey a disservice in this film, quite disappointing. Not worth the hype imo."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "squeakydrummer",
        "review_rating": "9",
        "review_title": "Simply Put: A Ton Of Fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "cliftonofun",
        "review_rating": "6",
        "review_title": "Expanding universe, shrinking story",
        "review_detailed_main": "The thing about multiverse stories is they are great for callbacks and humor...but not great for coherent plotlines or character arcs. (That's part of why the multiverse functioned best in Spider-verse: animated films can get away with being less tethered to reality.) Anyway, I loved seeing old characters return or the amusing banter, but this was my least favorite of the MCU Spider-man movies. The earlier tales, especially the first, worked because they felt like simpler teen movies and the main characters - Peter, Ned, MJ - had fantastic chemistry. Those moments were too few and far between here because we had so much multiverse to traverse and so much plot to explain. The twists were convoluted, the plot holes were large, and the whole thing worked better when it revolved around academic bowl and prom. Basically, my favorite MCU remains simpler MCU. Involving more villains (and heroes) than ever before was definitely not \"simple.\" They're expanding their universe, but shrinking the story. Is it fun? Yes. Could it be better? Absolutely."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "The_Dog_Father",
        "review_rating": "1",
        "review_title": "Worst Super Hero made",
        "review_detailed_main": "I couldn't find one thing to like about it.\n\nSuch a climatic ending and cliff hanger for Spider-Man Far From Home, and this starts out flat as an opened, left in the car for a week, diet no caffeine coke.\n\nI was in shock how pathetically written the movie started out, doing an \"okay, all is forgotten, you kids can get on with your life now.\" Sloppy, lazy, and insulting, even to the youngest of fans out there.\n\nLike a date promised to go to a nice restaurant, and they end up getting treated to that one hot dog at the gas station that has been on the back rotisserie for a day and half.\n\nAs we get over the first absurd shock, the movie just keeps getting worse and worse, more ridiculous as the plot unfolds. Recycled parts, with a really bad appearance with Dr. Strange in it. Their tango together and how that was written is even more absurd than the story line itself. This obsession to defy rules without maturity, by this 3rd Spider-Man, was just too annoying to even come close to liking it. It must be part of the mental issues with kids out there now, \"I can fix it, and save the bad guys.\"\n\nSo very anti-climatic from leaving off from \"Far From Home.\" Stale, horrible plot, worst script, and so very dull. I wonder if Samuel L. Jackson saw the original script, and was \"Ahhh hellNaw, I ain't doing this sh t.\"\n\nFor the love of Christmas and all that is Holly and Jolly, get someone who can write, produce, and direct these movies. Let the fans have a go at, or the film students who would do it for room and food truck. They couldn't do any worse, I promise."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "adityassingh-39746",
        "review_rating": "10",
        "review_title": "Best Spiderman movie",
        "review_detailed_main": "It is worth of every single money you pay to see it. Best of all time this is a fabulous art made by the most experienced and talented Directors and cast."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "chestergutierrez1031",
        "review_rating": "9",
        "review_title": "Love this!",
        "review_detailed_main": "The best Spiderman for me. My friends love this too. Watch this in Cinema and very happy watching it. :) This exceed my expectations. Thank you for this movie."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "madisonlenae",
        "review_rating": "10",
        "review_title": "Best Spider-Man movie! Sorry Toby McGuire!",
        "review_detailed_main": "Best movie of 2021 by far! Loved every second of it an so did my kids. Great family movie! If you're not big into the marvel universe you'll still love the movie! Made me fall in love with Spider-Man all over again just like i did when I watch the Toby McGuire ones as a kid! Now I can provide that for my kids!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "AndreiCtl97",
        "review_rating": "9",
        "review_title": "Without disappointment",
        "review_detailed_main": "A very honest opinion. It was the best Spider-man ever made, thanks to the return of everyone in the other movies.\n\nFor me, the 2h 28min passed very quickly, because you were very captivated by everything that was happening. They could have done it easily in 3 hours 28 minutes, I don't think anyone was upset.\n\nTom Holland did his best role in the spider costume. It will be interesting to see a sequel because the ending left some puzzles. What will happen next?\n\nIf you're a fan of Spider-man, you can't help but like the movie! If you're a hater, better refrain."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "teiixeiral",
        "review_rating": "7",
        "review_title": "The best Spider-Man Outing for Marvel",
        "review_detailed_main": "The first 2 MCU Spider Man's were okay but No Way Home is easily the greatest outing yet. It's almost impossible for a movie like this to fail when the storyline is balls to the walls and so satisfying if you've watched every single Spider-Man live action movie yet.\n\nThe performances are all solid, but it's Defoe who ends up stealing the show. His performance as the Goblin really is one of the greatest villain portrayals of all time. Also, Andrew Garfield deserved a better Spider Man franchise because his performance jumps off the screen in his limited screen time.\n\nWhile a lot of these reviews are overrating the movie, it's still great and well worth your time for a seriously fun and inventive concept."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ashleyvictoria91",
        "review_rating": "10",
        "review_title": "SOOOO SO GOOD!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ashfordofficial",
        "review_rating": "6",
        "review_title": "Ok.",
        "review_detailed_main": "It wasn't as grand and spectacular as everyone rave about. I was expecting something marvellous, but all I get was a half filled glass of water that should've been filled and overflown. A missed opportunity to fully utilise the awe-inspiring scope of the Spider-Verse.\n\nJust like Jon Watts' previous Spider-Man films, this one too turn Peter into an annoying teenager who mess up everything. I hate it when they turn my favorite comic book characters unbearable. Tom Holland's performance was sometimes so bleak and annoying."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "rebelinthehouse",
        "review_rating": "10",
        "review_title": "Can't fault anything about this movie at all",
        "review_detailed_main": "Roller-coaster of emotions, epic battle scenes, Easter eggs, all sorts of surprises all mixed with great writing and acting leaving me wanting more!\n\nAll you need to do is let your inner child go and sit back and enjoy the show, bravo marvel, thank you for doing the comic books and cartoons justice, keep em coming!!!"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "akbardhiyakarashad",
        "review_rating": "7",
        "review_title": "Not the best plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "upendrasinghksh-30316",
        "review_rating": "1",
        "review_title": "All hyped up, not upto the mark",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ahadsheikh-26024",
        "review_rating": "10",
        "review_title": "i love him peter porkour",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "mark_manwaring",
        "review_rating": "10",
        "review_title": "Nearly 20 years in the making",
        "review_detailed_main": "A fantastic story line that brings every spider franchise in line and re-opens each universe for future films\n\nA fantastic cast with brilliant Easter eggs for marvel and Sony to use. Everything ties together perfectly."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "taeyoondaveheo",
        "review_rating": "9",
        "review_title": "A perfect spiderman movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "imiea",
        "review_rating": "10",
        "review_title": "A masterful, emotional roller-coaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "CinemaFX",
        "review_rating": "7",
        "review_title": "This is a fun ride but with few problems",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "ayanmajumdar-09332",
        "review_rating": "10",
        "review_title": "Best Spiderman Movie",
        "review_detailed_main": "Best Spiderman Movie of all time.. The story, acting visual effects everything was perfect. Can't believe what i just saw ! Go & Watch it as soon as you can, For best experience watch it on Imax !\n\nWon't say much, Just Sony & Marvel did everything fans wanted ! That's it !"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "Gleunji",
        "review_rating": "7",
        "review_title": "No Way Perfect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "msajad-21562",
        "review_rating": "10",
        "review_title": "BEST MARVEL/SPIDER-MAN/ COMIC BOOK MOVIE OF ALL TIME!",
        "review_detailed_main": "You may feel all kinds of emotional feelings a human being can feel at once!\n\nThis movie contains everything a movie should have And i personally enjoyed nostalgic parts the best."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "MovieFreak35",
        "review_rating": "7",
        "review_title": "Good time",
        "review_detailed_main": "I enjoyed this movie, it was fun, entertaining and the story itself was actualy pretty interesting, not the greatest, but kept me interested. The one thing that brought this movie down is the constant attempt at humor, it took what could be really cool and turned it into an SNL skit, and what should have been serious was more of a joke bc this is Marvel, everything has to be funny, all the time. Im not saying it was all bad, i got a few laughs here and there, but it was to over the top sometimes and i just think the movie would have been better if they dialed it down a notch and just told a good story without everything having to be funny."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "potipiroon",
        "review_rating": "2",
        "review_title": "What is the hype?",
        "review_detailed_main": "I decided to go see this movie because of the 8.9 rating, which was based on more than 200,000 reviews. Honestly, I am shocked. The movie was so boring that I actually fell asleep at one point. The plot was very childish and unnecessarily long. I heard that some people actually left the theater out of boredom. I assume the high rating was only possible because of such strong a fandom. Overall, I felt like I just lost 2.5 hours of my life."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "erickd-27786",
        "review_rating": "10",
        "review_title": "It is the best spider man film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "abhinavgs",
        "review_rating": "10",
        "review_title": "Extraordinary, Must watch",
        "review_detailed_main": "This is the best Marvel movie I have ever seen with lots of inspiring scenes and amazing action. You should watch it in the biggest screen possible. Don't miss this movie."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "editworld",
        "review_rating": "10",
        "review_title": "Masterpiece!",
        "review_detailed_main": "One of the best movie from marvel. I like this movie so much. There is so much emotions in this movie. The actors who played the villains was awesome."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "larskojima",
        "review_rating": "10",
        "review_title": "good movie",
        "review_detailed_main": "This movie is one of the best movies i have seen in a long time, i was really entertained by it.\n\nHolland is great in this movie, and you see other spiderman as well\n\ngood movie."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "vengeance20",
        "review_rating": "6",
        "review_title": "Better Than The Previous 2 Films, But Still Not A Patch On The Originals!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "namgyalzanskar",
        "review_rating": "10",
        "review_title": "Out of world",
        "review_detailed_main": "It's the best out of best . You cry, you laugh you jump, you scream and you say wow in every 5 min .\n\nBut beware of spoilers and get ur ticket as soon as possible, for this is the biggest movie of this decade after endgame, you can't just sit in your home and let go of this experience."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "masongoodridge",
        "review_rating": "6",
        "review_title": "Great nostalgia but mixed with a predictable and loose plot",
        "review_detailed_main": "I grew up watching Spiderman and the nostalgia of seeing Maguire was great, but that doesn't off set the weak and predictable plot mixed with some very unclear motives from all the old foes.\n\nCaught this film last night after seeing it constantly talked about on social media. I have not enjoyed any recent marvel films including the 2 previous spider-mans, and although I must say this was better, it still left much to be desired.\n\nThe first hour or so was pretty painful and dull, but it did pick up towards the end. I like a long film, but for an action film like this, it felt like it dragged on.\n\nThe acting was pretty poor on the whole bar Willem Dafoe who defines what it means to be a super hero villain. Yet the majority played cheesy roles with no substance.\n\nDid they try to cram too many villains in? Absolutely. Focusing on the Green Goblin was good, but the lizard guy and sandman was pretty unnecessary. Bar the obvious nostalgia.\n\nI am older and I get the film is geared towards a younger audience who for clear reasons would want to see the CGI and extravagant scenes.\n\nIs it too much to ask for a clearly defined, intricate plot these days?\n\nAnyway, it's always fun to get to the movies and i enjoyed parts for sure."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "asexualkilla",
        "review_rating": "10",
        "review_title": "This movie is beyond belief",
        "review_detailed_main": "This movie did things that fans couldn't have expected is it weren't for the leaks and set images. But all that aside this is the best marvel movie to-date."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "DigitalShark1",
        "review_rating": "6",
        "review_title": "Felt like someone's fanfiction",
        "review_detailed_main": "I understand this movie is getting heavy-praise right now and you're probably already thinking of downvoting this, but at least hear me out.\n\nI'm a big Spider-Man fan, and I genuinely enjoy most marvel movies. I don't think I consider too many of them masterpieces but they're enjoyable. I went into this movie wanting to like it, but instead what I got was a story that read out like someone's fanfiction without much else to offer.\n\nDon't get me wrong, the film's fine enough. There are some funny jokes and it does feel good to see Willem Dafoe as Green Goblin and Alfred Molina as Doc Ock again, but not much else than that. Peter and MJ's relationship feels very cookie-cutter and at some point you get tired of hearing washed-up actors talk about their old films.\n\nIt's not a bad movie, but highly overrated and everyone really needs to calm down over it."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "akoaytao1234",
        "review_rating": "1",
        "review_title": "A Cash Grab for a Willing Marvel Fan",
        "review_detailed_main": "It would be unfair to say that I never really laud as great films BUT I always admire this ability to create quality escapism.\n\nWith all that, I think Spider-Man: No Way Home might be the first film of that series that I actually hate .\n\nFirstly, this film feels so juvenile to the point that it is annoying. I guess this is a film not really made for me. I found the way Hollands tries to plays up the good boy persona exceedingly off-putting AND not needed. Zendaya and the Filipino guy are just a figment on its story. They even tried to gentrify the \"other\" versions of Spiderman film. Funnily, I love all the treatment for the Original Spiderman characters. Otherwise, its a mixed bag.\n\nSecondly, I found the cause of conflict in the film so unnecessary. It does not make sense for me why and how it happened. It feels like watching a cash grab for fans.\n\nI mean the conflict of the film is that his presence as a superhero has such a negative effects to their live that they were ultimately banned to their collegiate school BUT it is contrast with a rally showing their popularity too. It is like be consistent film. Even the spell is hinged on the fact that they did not plan. They go on as if this is a thing he does every time BUT he just goes for it without really thinking through of the whatnots. Ultimately, the choice of Holland Peter to armchair psychologist ughh. Just watch it, its like a Bob the Builder-esque plot line.\n\nUltimately, what really sour me about the film is the Dr Strange Conundrum. Why even watch when the consequences can be reversed and played on? I mean, he did had some in the end BUT is it really not deserved. As a viewer, I hate it from since the Avenger films BUT I hate it more so this time, because it actively says it can AND it can even personalize it.\n\nOverall, this is a pure cash grab for people who are watching it for the characters but not the content. Its pretty much anchored on a very weak premise AND feels like a connective tissue for things to come. [0.5/5]"
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "stativechicken",
        "review_rating": "10",
        "review_title": "One of the best Marvel films ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "rcstoreyjr",
        "review_rating": "10",
        "review_title": "great movie",
        "review_detailed_main": "Watch it! You'll really love it. If you've seen them all (like ALL) like I have, this is a great addition to the franchise. Holland is outstanding in this movie. All the other characters are good, too. And of course, seeing the other Spider-man characters made this movie perfect."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "jonsturdivant",
        "review_rating": "9",
        "review_title": "Very Entertaining",
        "review_detailed_main": "This movie although over two hours long went by in a flash. There's not much more I can really add to what everyone has already said. There's lots of action in this movie and the dialogue was funny and not to over the top. Loved how even though this movie was told from more of a gen-z perspective, older Marvel fans will not feel disconnected from it."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "garethelliott",
        "review_rating": "9",
        "review_title": "Loved it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "JabezGill",
        "review_rating": "7",
        "review_title": "Good - not great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "markkylerussell",
        "review_rating": "10",
        "review_title": "What a powerful Spider-Man movie 👍👍👍",
        "review_detailed_main": "Spider-Man no way home never stops being popular after 69 years Stan lee I love you man I always love you're comic books your movie lines you're Cameos it totally changed history forever."
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "StoryTaker1",
        "review_rating": "7",
        "review_title": "Would give it a 10 as a fan, but 7 more objectively.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt10872600",
        "movie_name": "Spider-Man: No Way Home",
        "movie_rating": "8.2",
        "review_username": "CG89gc",
        "review_rating": "9",
        "review_title": "Complex and well handled",
        "review_detailed_main": "So great. I loved every aspect, and they handled some hard topics with grace and still managed to keep the action. I wanted to cry and laugh and was totally captivated the whole time."
    }
]