[
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "BaronBl00d",
        "review_rating": "3",
        "review_title": "Lives Up to Expectations",
        "review_detailed_main": "Okay, it is quite horrible. Yet, despite the overall harsh criticisms found on here, it is nothing at all near being one of the worst movies I have ever seen - in my lifetime, this year, or even this month. Bad? Yes indeedy! But God Awful? Not quite(though perhaps closer than I am letting on to). Steve Howey plays Stan Helsing who works at a video store. Halloween night is here and Stan meets up with two incredibly hot girls and his buddy Kenan Thompson(you figure out which one is unlikely to be in that quartet in reality). Thankfully Kenan is there, because he has a few of the few laughs that are in this film(the others belonging to octogenarian and living legend Leslie Nielsen dressed as a hideous barmaid). It seems Stan is destined to live up to his ancestry and slay monsters - what monsters you may ask? Well, ridiculously and inept looking ones NOT from classic horror but from modern \"classics\"(I shudder even putting THAT in parentheses!) We get Pleatherface with a leaf blower and a line when he no longer has it, \"It looks like no one will get blown tonight.\" Stop your sides from aching now with laughter. We get Chucky looking like a guy with painted x's and o's on his face. A Pinhead double from Hellraiser. Anf let's no forget the Michael Myers, Jason, and Fweddy doubles as well. All of these look so stupid and like someone from a fifth grade art class got to work on their wardrobe and costumes. There are other horror references and a story that defies logic - and explanation here for lack of need. Really, Stan Helsing is like Epic Movie, Disaster Movie, and Date Movie. It has a few laughs but not enough to even keep this lame crap afloat long at all. The humor is mostly adolescent and sophomoric with at least four references to bathrooms and all that great humor that comes from noises and the other fertile comedic ground that is inherent in feces and urine. Does the movie have any saving graces? Well, Kenan Thompson and good ole Leslie Nielsen are good some of the time. There are a few jokes that land roughly but in place. Then there are the female cast members who for the most part are very, very pleasant to look at like the three gals playing vampire strippers and Diora Baird and Desi Lydic as the two female leads. Neither can really act though Lydic has comedic potential. Baird has some fine assets to keep abreast of nonetheless. If you are looking for clever or witty humor, you must look elsewhere. If you have an IQ near that of a quasi-literate teen - you might think it is totally rad or some such feeling. Phewwww!"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "gavin6942",
        "review_rating": "5",
        "review_title": "I Hate To Admit I Enjoyed This",
        "review_detailed_main": "Stan Helsing, a video clerk for a certain video chain store, is ready for a Halloween party with three of his closest friends. But before the party, he has been asked to deliver a bag full of movies to the store's manager, who lives in a gated community. What lies beyond the gate: karaoke, monsters and gay porn studios. This is going to be a long night.\n\nLet me be blunt, when you tell me a film is coming from the same people, or the same sort of people who brought us \"Scary Movie\", \"Date Movie\", \"Disaster Movie\" and so on... I'm inclined to believe this is one more film that was a waste of time for the actors, a waste of money to make, and a waste of brain cells for anyone who watches it. Mysteriously, despite this bias, I enjoyed \"Stan Helsing\".\n\nSure, the humor is juvenile, revolving almost entirely around hookers, strippers, porn and the same gratuitous sex that we've come to expect since at least \"American Pie\" (you can say such humor dates back at least to \"Porky's\", but don't tell me that the new wave of it has any wit behind the smut). Somehow, with my mind turned off and my stomach full of Corby's brand whiskey, I found this film humorous and enjoyable from the first five minutes.\n\nIt has some disappointments. The monsters are such a minor part of the plot, sadly, and even Leslie Neilson has a role that isn't as funny as it should be. But such simple jokes as the porn title spoofs got me laughing (\"Glad He Ate Her\"? Classic) and I don't mind a few gorgeous women on my screen from time to time.\n\nBut as I say, if you're looking for a clever monster spoof, it's not here. The monsters sing a karaoke song, but their origins are not explained and they have maybe ten to fifteen minutes of screen time, contrary to what it would appear by the cover. But if you like dumb humor, like \"Dude, Where's My Car?\", this would be worth your time... especially with a friend and a bottle of Feckin Irish whiskey."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "grantss",
        "review_rating": "5",
        "review_title": "Silly but not all bad",
        "review_detailed_main": "Quite silly, but not as bad as it is made out to be. Horror movies deserve to be parodied and this does that fairly well at times and has some really funny moments. A lot of it is also quite lame though.\n\nCast includes Leslie Nielsen in one of his last roles. Diora Baird ensures that the movie has your attention and that it is reasonably entertaining in the end.\n\nThere are a lot worse ways to spend 90 minutes."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "mxidiroglou",
        "review_rating": "1",
        "review_title": "Oh my God......",
        "review_detailed_main": "I think these guys don't even try anymore to make not a funny one, but even watchable movie anymore....\n\nThere is no need of spoilers or taking even a deeper look at this ''movie''. There is no plot not script no acting, nothing really present that this would qualify this as an actual movie.\n\nWhen i sat down to see this movie i knew about what i was going to see. A cheap laugh. But as i realized i noticed that a actually barely smiled during the movie. I spend most of my time looking at my watch wandering when the movie is going to end. Anyway...\n\nOne hint to the producers...\n\nSTOP MAKING THIS TRASH ANYMORE. I am not an American, but i would personally be very offended if this kind of movies are supposed to reflect the cultural level of young American people."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "mortal_kombat8_kabal",
        "review_rating": "1",
        "review_title": "Wow As Good as Meet The Spartans!!!!",
        "review_detailed_main": "You can easily compare this to the greats like Date Movie and Disaster Movie and everything by Aaron Seltzer! Bo Zenga is another addition to the \"well it sounded good when we threw it around the idea table\" club. Of course how can you expect much when one of his last pictures was the comedic gem Soul Plane. If your one of those people who hate that someone close to you drinks too much get back at them by playing the drinking game to this movie. It's simple the rules are you drink every time something funny actually happens in the film. This film is guaranteed to leave you sober. However i can't guarantee you both won't drink yourself silly to try and forget the movie you just watched.\n\nBottom Line folks, i wasted an hour and a half of my life so you won't have to."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "brownbagcomics",
        "review_rating": "1",
        "review_title": "Worst spoof ever",
        "review_detailed_main": "This is not a movie that you will find ANY enjoyment in and the lack of humor in a spoof shows that the director/producers/actors were just phoning it in to collect a paycheck. Personally, I was embarrassed for Keenan Thompson and Steve Howey. To take this job without reading the script was definitely a wrong move. And to honestly try to incorporate spoofs of horror movies that others have done better is a real crime. If you see this of your own desire, you can't blame anyone when you want to poke your eyes out afterward. If you want to see funny horror, try anything else but this. In fact, try the movies that this one tries to lampoon. But please, don't waste your time or energy on this. Be forewarned - see at your own peril!"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "haglerf",
        "review_rating": "1",
        "review_title": "Queue this one for a raspbery award - awful!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "scottmannen1",
        "review_rating": "2",
        "review_title": "Quite possible the worst movie I have seen this year.,,,",
        "review_detailed_main": "Its rare that I actually despise a movie as much as this one. Now before you say I am coming down too hard on this movie...if you don't believe me just watch it. The movie starts out 'ok' like a decent rip off of Scary Movie; however, it quickly descends into a downward whirlpool of bad acting, poor direction and a plot that makes little sense.\n\nBasically this movie is a spoof on horror movies. There were a few parts where I laughed- near the beginning, but after that it seems as though the film budget ran out of money or something because after the halfway point it completely looses direction. I kept expecting a story to develop or some kind of back history on 'Van Helsing' to appear. It didn't. The characters are poorly written...and even with the comedic assistance of Leslie Neilson it still flops hardcore.\n\nLeslie Neilson must be really hard up for acting spots to have taken a spot in this stinker. My recommendation is that you don't watch this one....in fact don't even rent it. Its really that bad."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "wilbert1987",
        "review_rating": "1",
        "review_title": "awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Mikel3",
        "review_rating": "",
        "review_title": "It has it's funny moments, but they are to few and far between",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "chrichtonsworld",
        "review_rating": "1",
        "review_title": "Absolutely dreadful!",
        "review_detailed_main": "Nothing like Scary Movie at all. As spoofs go this movie doesn't do anything to make you laugh. And isn't that the point of a movie like this. There was a real potential in making this a fun movie. But somehow I guess that the director and producers couldn't be bothered. I can't blame the cast since they obviously try their best to make this work. But you can see the desperation in the main character's eyes when he has to do another pointless dialog. Shutting your mind of isn't an option either since there is no slapstick comedy to be enjoyed. Well there are some redeeming elements or maybe even the only reason to watch this. The two girls. One with very nice boobs (Diora Baird) and the other one extremely hot blonde (Desi Lydic). Sadly this just isn't enough to be tortured through the whole movie. (My advice skip to the sexy scenes with the girls and forget about everything else). Ignore previous comment and don't waste your time. Avoid this movie!"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "imarcusbrown",
        "review_rating": "8",
        "review_title": "It's a spoof, not a blockbuster movie",
        "review_detailed_main": "People have no clue what comedy is. This movie was never made to be a great blockbuster movie. Understand what you're watching before you watch it"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "jhill84",
        "review_rating": "7",
        "review_title": "I'm going to say I like it.",
        "review_detailed_main": "I'm going to say I like it. Don\"t get me wrong its a bad movie but it doesn't mean its not enjoyable. Its not to much like Meet the Spartans or date movie were they parody scenes from the movie they parody and make them stupid. They did do that with the monsters by making them look like morons and give them really dumb names but beside that they do have some funny scenes and dialog. And they do try to make the a bit like the people they are base off of. Like when they use their weakness is like what fans made fun of the real people they copied. To defeat Freddy get rid of his glove. Pinhead push the nails in. The mask think with Jason and Myers is not their weakness but it showed how similar they are and that Jason was a ripoff of Myers. Leatherface wait till his chainsaw runs out of gas. And Chucky he is a doll. If you missed that then you have no business making fun of this movie. And the other main characters I thought was a good casting choice and they were really funny. Finally they didn't a a truck load of over the top reality breaking jokes. They have those but its more down played. I'm just saying rethink this one."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "baumer",
        "review_rating": "1",
        "review_title": "I keep thinking I've seen the worst movie ever made, then another gets released",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "nabakov62",
        "review_rating": "",
        "review_title": "Stan Helsing gets an A",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "antonedbone",
        "review_rating": "1",
        "review_title": "Nauseatingly bad!",
        "review_detailed_main": "Wow, just got done watching this \"parody\" and it was so bad I feel like throwing up...not kidding! At first it grabs you, thinking it might be a funny spoof, like Scary Movie and the like, but if you can tolerate this thing till the end, you will see it is nothing of the sort. The acting is terrible. There is nothing funny at all, it just drags on and on and you'll find yourself begging for the end. Not even to see how it ends, just because of the sweet release of watching. I could never sit through this movie again. I can't express how bad it is, possibly the worst movie of all time. The 2 main female characters are pretty hot, and that's the ONLY good thing about the movie. I NEVER put posts on this website, but had to with this one, just because it is so bad. Avoid at all costs."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "blaforet",
        "review_rating": "1",
        "review_title": "wow.",
        "review_detailed_main": "First off, I want to thank the writers and directors of this movie. Because of you, I want to become a screenwriter, because I know that no matter how terrible an idea I have for a movie, some idiot will fund it.\n\nI went into this movie knowing next to nothing about it. My secret vise is awesomely bad movies, and I didn't want bad reviews to dissuade me from watching it, because I know awesomely bad movies are not for everyone. My God, if only I had read the reviews.\n\nThis movie was terrible. There was no plot, horrible acting, and the jokes were groan-worthy. Stan is a video clerk in the first 10 minutes of the movie, but that plot line drops as dead as the actors' careers, and turns into random wth moments. The other hour and twenty minutes are spent running away from a host of horror ripoffs and a franken puppy. Yeah, that's about it.\n\nThank God I didn't spend any money on it, it was on Encore. Don't watch this garbage. You'll regret it."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "DICK STEEL",
        "review_rating": "2",
        "review_title": "A Nutshell Review: Stan Helsing",
        "review_detailed_main": "There are some comedies that just try too hard, and Stan Helsing falls into this category. Written and directed by Bo Zenga who has more producing credits and making his directorial debut, Stan Helsing stars a cast of relative unknowns hobbled together to forcefully create laugh-a-minute sequences that don't always hit their marks, but instead fall quite short in not being silly for silliness sake.\n\nOne thing's for sure though, is that Zenga dug deep to throw plenty of movie references from the horror genre into his comedy, especially when the villains turn out to be cheap knockoffs of their real cult counterparts, with Fweddy (Freddy from A Nightmare from Elm Street), Mason (Jason from Friday the 13th), Needlehead (Pinhead from Hellraiser), Pleatherface (Leatherface from Texas Chainsaw Massacre), Lucky (Chucky from Child's Play) and Michael Crier (Michael Myers from Halloween), and not including minor ones such as the Hitcher, and a giant cockroach. But ultimately there's nothing here to make this film anywhere near being horrific, except that the end product is quite horrific in itself.\n\nOn the other corner of the ring of good, we follow the adventures of a foursome consisting of the slacker Schlockbuster video clerk Stan Helsing (Steve Howey) whom everyone mistakes from Van Helsing the monster exterminator, who has been tasked to drop off some videos en route to his Halloween party with hottie ex-girlfriend Nadine (Diora Baird), his best friend Teddy (Kenan Thompson) and an exotic dancer cum massage therapist (interpret this as you will!) Mia (Desi Lydic), on a road trip filled with last minute detours leading from point to point and incident filled. The entire journey unravels with inexplicable coincidences relying on cliché after cliché to bring on some cheap laughs, which when proved inadequate there's always the odd toilet joke to stink bomb everything.\n\nDialogue is full of sexual double meanings, with Mia being the group idiot to fall for, or become the butt of the jokes. Nothing in the narrative ever makes much good sense other than to react or create a hilarious situation for our foursome to get into, and filmmakers perhaps need to stop and take stock of the comedy genre now that spoofing pop culture, or pop icons, are no longer a quick and easy way to surprise and satisfy an audience, and not when the impersonations was far from their mark.\n\nDon't get me wrong that I've lost my funny bone, but this relatively cheap production didn't have much to laugh at. What's more painful is that it starred the late Leslie Nielsen in drag and makeup as a bar waitress, and seemed more like a desperate role meant for paying the bills. Filled with jokes with some being naughty while others nonsensical and silly, probably the scenes set within the video store bookending the film with patrons providing sight gags and trash talking became the main highlights."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "thug_thug",
        "review_rating": "1",
        "review_title": "I didn't think it could be this bad",
        "review_detailed_main": "Okay, I thought \"Disaster Movie\" and \"Superhero Movie\" were terrible. However, they did have several mild laughable moments throughout that somehow made it manageable to watch on TV.\n\nThis movie has no laughs. I think I smirked twice, and that was about it. It's a really disappointing movie. I didn't expect much of a plot or character development, I expected dumb, usually lacking laughs akin to those you would find in Scary Movie 3-4.\n\nThis movie honestly had none of it. I can't believe anyone could mock horror's greatest legends so poorly.\n\nHonestly, please watch something better. Try \"Airplane!\" or its sequel, \"Scary Movie\" 1 and 2 -- anything but this."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Very bad...but not nearly as bad as I'd assumed.",
        "review_detailed_main": "The IMDB Bottom 100 List consists of the one hundred worst rated major motion pictures of all time....and many of them are very similar parody films marketed to very dumb young people. They all feature extremely crude humor, bad writing and make your brain dumber as a result of watching them. \"Disaster Movie, \"Epic Movie\", \"Meet the Spartans\", \"Date Movie\" and \"The Starving Games\" are just a few of these incredibly bad movies that made the list...as well as \"Stan Helsing\". However, after watching \"Stan Helsing\" I was surprised. I was a bad film....crude, stupid and generally unfunny...but NOT to the level of awfulness of these other films. In fact, I'd have a hard time putting this on a bottom 1000 list...let alone bottom 100. Unlike many of these films, there actually is a bit more plot and cohesion than the other movies. Not much...but more...though NOT enough that I'd recommend it to anyone I like!\n\nThe film is the story of four idiots who get lost on a Halloween night and end up stumbling into a cursed town of the dead. Various psychotic murders like Jason, Freddy Kruger and Pinhead wander through the place...looking to kill these four idiots. And, apparently, Stan is their only help...though he certainly doesn't realize he's the hero of the film.\n\nCrude, stupid and annoying....but a few of the jokes actually made me smile and the film was only about 94% terrible!"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "leighabc123",
        "review_rating": "1",
        "review_title": "This Was The Worst Spoof Movie Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "saaakaaa",
        "review_rating": "1",
        "review_title": "Dumb dumb dumb",
        "review_detailed_main": "Needles to say, needles to do... Do not waste any second of you life watching this... It is an CRAP... And I like crappy movies, but this, no no no no Needles to say, needles to do... Better watch some porn or stuff... Iti is totally mess. Should I say that made me go to WC twice, and not to leak. Why people do this, why they spend money, that is the question. And the lead actor is so dumb that is horror. Me leave. So nice to have u home son, ya mama, it is. Me glad, me go home so soon. Take me to see some stupid movie and you may put me down i say no no . This is wrong i am an actor an i made some good ads for milk, not so fancy but rather tasty and u see, that didn't change me at all. No mama"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "ryanmdick",
        "review_rating": "8",
        "review_title": "Enjoyable.",
        "review_detailed_main": "While the reviews on here says it sucks, I actually thought it was pretty ok. I would at least give it a shot before taking these ' advice and skipping over. I do feel like the whole Scoobie Doo schtick was a bit overplayed though. And I still wish they had more on the vampire strippers lol."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "l-roy",
        "review_rating": "6",
        "review_title": "Switch off your brain and enjoy!",
        "review_detailed_main": "Despite some of the other reviews, this film wasn't so bad. Of course it isn't a master piece, but that is never what it set out to be. I don't rate direction, camera angles, and soundtrack. I'm a normal guy who rates a film, Good or Bad.\n\nThis film was watchable, not extremely funny, but then again, not extremely terrible.\n\nThe jokes are laddish and sometimes silly, but that doesn't make it bad.\n\nIf you watch this movie and are just 'going along for the ride' and not going out to criticise, then you will take some enjoyment from this movie.\n\nThe plot.....isn't really there....but then again, that isn't the point of the film, it's to make you laugh, which it does in some areas.\n\nDisengage the brain and enjoy. It's worth a watch if you like films like Scary Movie (although, in my view, it isn't as good as the Scary Movie films)"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "RichardSRussell-1",
        "review_rating": "2",
        "review_title": "Somebody Evidently Thot This Would Be Funny",
        "review_detailed_main": "Stan Helsing: A Parody (R, 1:30) — Other: Comedy, bargain basement, formula\n\n2 background facts:\n\n(1) In Bram Stoker's classic novel Dracula, the intrepid Dutch adventurer who was the vampire count's nemesis was Abraham Van Helsing. (\"Bram\", incidentally, is a diminutive of \"Abraham\".)\n\n(2) By vote of knowledgeable fans at the 2003 World Science Fiction Convention, the 3rd best SF film of the 20th Century was Forbidden Planet. It was released in 1956. It starred Leslie Nielsen as the heroic spaceship captain.\n\nI have listed this film as a comedy, since that's what it purports to be. Certainly it's full of formulaic horror-movie stereotypes, which you would expect from a self-proclaimed parody. And I laffed out loud a couple of times, which means it can't sink to the absolute rock bottom of my ratingometer. That's about it for the singing of praises, tho.\n\nThe protagonist is the slacker video clerk Stan Helsing (family name simply Helsing, not Van Helsing), who keeps getting mistaken for his ancestor by people who are particularly well informed on this issue while otherwise showing a remarkable tendency to drown while gazing upward open-mouthed during a rainstorm.\n\nStan (Steve Howey) and 3 friends set out for a Halloween party. One of the group, Nadine (Diora Baird) is Stan's ex-girlfriend, she's pretty emphatic about the \"ex\" part, and we see in flashback why she feels that way, as Stan is one of the most insensitive lunkheads on the planet. This raises the question \"Why the hell is Nadine going to a party with this schmuck?\"\n\nNo attempt is made to answer that or explain the many other improbabilities. The viewer is left to infer that the various horror-movie creatures wandering around wreaking havoc are going unnoticed because everyone else thinks they're just costumed for Halloween.\n\nPoor Nielsen plays Kay, an overworked waitress, in lipstick and drag. This was just painful to watch.\n\nAmong many random occurrences thrown into the plot in no particular order are gratuitous panty and boob shots; a monsters vs. heroes karaoke contest; Freddie, Jason, and a little kid in a hockey mask who gets seriously whacked in a case of mistaken identity; and a hard-to- miss giant cockroach that the lesbians in the next toilet stall nonetheless managed to miss.\n\nSomebody evidently thot this would be funny. By \"somebody\" I don't mean me."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "fallenangel-13911",
        "review_rating": "5",
        "review_title": "Know what this is and enjoy",
        "review_detailed_main": "This is one of the absolutely stupidest movies I've seen. And I love it. It's just a dumb fun movie. If you are looking for something creepy, good dialogue or decent acting keep on looking. There are a handful of good actors in this but overall it's kinda crap. But that's what makes it fun.\n\nIt has been years since I've seen this but I still remember how much my husband and I laughed while watching this. He hates horror so these kinds of movies is the closest thing I can get him to watch. I think people will enjoy this as long as they don't take it too seriously. Know this is a low budget movie, get your popcorn ready and just have fun."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Bernie4444",
        "review_rating": "4",
        "review_title": "Leslie Nielsen in top form as others tries to follow his lead.",
        "review_detailed_main": "It is Halloween; this is the time one should be watching It's the Great Pumpkin, Charlie Brown (1966) or at worst Arsenic and Old Lace (1944). But no, you are about to choose \"Stan Helsing\" (2009).\n\nStan (Steve Howey) who is out to make a movie gets stranded in a sort of Halloween Twilight Zone. There they are confronted by all the biggest slashers of the time. Makes you want to up-Chucky unless you are a Freddy-defender. It can be mockingly funny.\n\nYou will need to be well versed in a plethora of movies to be aware of all the joke references. Some of the movies: Species: The Awakening (2007) Shutter (2008) King Kong (2005) The Notebook (2004) Freddy vs. Jason (2003) The Blair Witch Project (1999) The Sixth Sense (1999) Saving Private Ryan (1998) How Stella Got Her Groove Back (1998) Titanic (1997) Stargate SG-1 (1997) Six Degrees of Separation (1993) Schindler's List (1993) The Hills Have Eyes (1977) The Last House on the Left (1972) The Munsters (1964) The Wolf Man (1941) Frankenstein (1931)\n\nThis is one of those movies that can go either way. I think that they tried too hard to be campy. Luckily Leslie Nielsen could pull off his character without breaking a sweat."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "atinder",
        "review_rating": "1",
        "review_title": "The Disaster movie Part 2",
        "review_detailed_main": "Here come another spoof.\n\nThe plot: It's Halloween night and video store clerk Stan Helsing just got stuck with a last minute request to deliver some videos. With his best friend, his best friend's date, and a smoking hot ex-girlfriend waiting to go to a party, Stan convinces them to take a side trip to Stormy Night Estates for the drop.\n\nBut the group gets locked inside and Stan discovers he's actually Stan Van Helsing, descendant of the famed monster killer. Now, to lift a curse from the town and get his friends home safely, Stan must defeat the six greatest movie monsters of all time: Fweddy, Mason, Needlehead, Lucky, Michael Criers and Pleatherface.\n\nThis movie is so Silly but it is only 1% better then the worst spoof of all time The Disaster movie,This movie it not funny at all, I didn't like it at all. It didn't make me laugh Once 1/10.\n\nPlease Avoid this movie."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "ironhorse_iv",
        "review_rating": "2",
        "review_title": "A movie, you shouldn't watch on Halloween. Nor ever. This movie was so awful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Vincent_B",
        "review_rating": "1",
        "review_title": "Feels like hours of pain and torment...",
        "review_detailed_main": "This has to be a first in movie making history. I have never sat down to view a movie that cut the connections to and from the prefrontal cortex, the anterior part of the frontal lobes of my brain. \"The Ring\" movie spoof in the first 10 minutes of the film is suppose to be SO FUNNY to make you laugh though the remainder of the film. The 'monsters' are about as funny as an episiotomy during childbirth without medication... and I am a male. The acting, plot, and direction are just missing and kind of pointless. If you insist on watching this and actually enjoy it enough to rate it more than I did, may I suggest you blink wildly and then close your eyes really tight for an interesting light show. I really feel sorry for the person who loaned the DVD to me, since they bought this at Wal-Mart for $7.50! He even said, \"Here, you want see why I plan to shoot myself?\" and handed me the DVD."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "nazlemak1",
        "review_rating": "1",
        "review_title": "Probably one of the worst movies I've ever seen",
        "review_detailed_main": "I will admit I actually did enjoy the first few Scary Movies. But then they just kept getting worst and worst. And by far this is the worst I have ever seen. From beginning to end there was nothing remotely funny. I didn't like to think that I wasted my money watching this but it was torture and I had to leave about an hour into the film. I still can't believe I stayed so long. As usual it has the crude sexual humour which I wouldn't ever mind if it was actually funny. The plot was absolutely stupid and the parodies just plain sucked. I am disappointed with Keenan for accepting this role and fooling me into thinking it might have some credibility."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "juiceman10712",
        "review_rating": "1",
        "review_title": "Don't, I Repeat, DON'T be fooled by this one.",
        "review_detailed_main": "I first heard about this one at the FanExpo in Toronto where I picked up the awesome looking poster. AFter watching the trailer I was a tad bit disappointed but was still aching to see it. Now I'm aching that I did.\n\nQuite possibly one of the biggest wastes of time ever. Just so everyone gets the picture, the humour in this and the overall quality is on par with the disastrous collection from Seltzer and Friedberg (Epic, date Movie etc.) There are so many problems with this film that it borders on insanity. There is virtually NO plot, structure or pacing and we never get any explanation of whats going on or why. Even all the villain spoofs (which is what the point of the movie is supposed to be) are so paper thin and mind-bogglingly-stupid. Why is Freddy supposed to be all gangsta? or why is Mike Myers Jewish? The villains get minimal screen time and their all just kind of there...for no particular reason.\n\nThe film is full of toilet humour and gross out/sex gags (as i said, Friedberg/Seltzer) and while I did chuckle once or twice, I wouldn't say it was funny.\n\nWhile watching I was hoping that there would be some wicked fight at the end to redeem it to some degree. But the ending is just as disappointingly awful as the rest of the film.\n\nThe idea of a great descendant of Van Helsing fighting off all of the big time movie monsters of contemporary film is actually a great idea and It could have worked as a zany spoof or a Jack Brooks style over the top horror-comedy, but it is so poorly executed that it defies logic. It doesn't work as a comedy. It doesn't' work as a horror. But most importantly, it doesn't work as a MOVIE. There is no film here. Only a pathetic half arsed attempt at one.\n\nDon't watch it ever, in fact try and forget it exists, it will make the world a far better place"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "bgregory098",
        "review_rating": "10",
        "review_title": "I honestly laughed!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Michael-d-duncan",
        "review_rating": "6",
        "review_title": "Average Slapstick Lowbrow",
        "review_detailed_main": "Meh...\n\nThis film was okay. I watched it in two installments due to some time constraints and what I wound was that I neither felt wonderfully compelled to finish it, but I wanted to take the opportunity.\n\nIt was pretty funny, not side splitting but not terrible. I'm glad I didn't spend much on it.\n\nIf you've got a couple hours to kill and don't mind losing a few IQ points, save your money on the beer and watch this movie. The acting was campy, the plot: mostly pointless, and the ending: dumb. But the ride though was good enough to be enjoyable. In the end, just a good bit of mindless fun."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Garbage Pail Kids 2: Kill Stan",
        "review_detailed_main": "Oh\u0085my\u0085'Stan Helsing' is just a plain, awful mess. It's completely unfunny, uninteresting and unbelievably stupid. There is not one moment of humor, and when they try and set up a \"joke,\" it's already seen coming a mile away. It's hard to describe how bad this was, but I will try: It would be more fun to watch paint dry, listen to keys stuck in a running garbage disposal for an hour or bungee jump without the bungee cord. It's equally hard to describe the plot. Again, I will try: boy-wonder, Stan, commonly mistaken for the original \"Van Helsing\" (Ha, ha, ha, that is so funny – no seriously, it was so funny, you will hear that joke 2 dozen times) and his gang are off to a Halloween party, but get detoured when Stan has to drop off videos. On this comical (sorry, I cannot lie, make that sobering) journey they meet the Garbage Pail Kid's versions of Freddy, Michael, Leatherface, Chucky and Jason. A lot of the time when I dislike a movie, I can safely say, \"well, to each their own, someone's gotta find value in this.\" For this piece of trash, I will confidently say: \"STAY AWAY. DO NOT RENT OR WATCH, EVEN FOR FREE. EXORCISE THIS ABOMINATION.\" Am I being too harsh? Well, anyone that didn't adhere to my warning, you tell me. Please also tell me how this got green-lit? It couldn't be the sad Leslie Nielsen cameo. It couldn't be the producers even though people remembered who \"Van Helsing\" was – this is like spoofing '13th Warrior' now in 2009. All of the actors looked amazed they had jobs, though they honestly shouldn't – their lines appeared to have been read seconds before the shot. This jumped quickly to the top 10 worst I've ever seen."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Coventry",
        "review_rating": "4",
        "review_title": "Really not the worst horror parody out there.",
        "review_detailed_main": "\"Stan Helsing\" is a lame and infantile parody, but at least it's a little bit better and funnier than the vast majority of nowadays spoofs, like the \"Scary Movie\" sequels or \"Meet the Spartans\" and \"Superhero Movie\". Somebody ought to tell the people in Hollywood production studios that we really don't need any more spoofs; seriously. Stan Helsing, a video store clerk and direct descendant of Van Helsing – although he's the only one in his surrounding who doesn't realize that - , and his friends are on their way to attend a Halloween party, but first they have to make a detour to the \"bad part of town\" to deliver some rental tapes. On the road, they encounter all sort of situations that look strangely familiar \u0085 like they're coming straight out of horror movie blockbuster. The premise is fairly original, but the script relies too much on unoriginal gags and clichéd situations. There are, for example, way too many blond bimbo jokes and similar derivative stereotypes. Simply put: for every decent and remotely funny joke, there are about a dozen and a half embarrassing and horrid ones. I laughed quite hysterically at the sight of our hero mistaken a grade school hockey goalie for Jason Voorhees and beating the crap out of him, for example, but then later you have to struggle through a painfully disastrous cameo appearance of Leslie Nielsen as a transvestite barman in a redneck karaoke bar. The climax is atrocious, with a horror movie monster karaoke showdown! Yeah, that really is as retarded as it sounds. It's Chucky, Michael Myers, Jason Voorhees, Pinhead, Leatherface and Freddy Krueger performing their version of the Village People's \"YMCA\". Oh well, I guess that at least it's a positive thing that the writers remained faithful to the more classic horror films and legendary villains of the 70's and 80's. To compensate partially for the overall bad quality level of the jokes, at least they hired some really pretty actresses, like Diora Baird (who walks around the entire film in a revealing Indian squaw outfit) and Desi Lydic."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "JoeB131",
        "review_rating": "1",
        "review_title": "Okay, if you are going to do a parody",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "2",
        "review_title": "Cheap, unfunny, boring and a total waste of time",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nWhy has making a halfway decent spoof movie become such a difficult task? One of the most successful art forms in terms of getting great belly laughs, taking pot shots at serious, well known films, that was worked to great effect by geniuses like Jerry Zucker and Pat Proft, is now being destroyed by the useless likes of Aaron Seltzer. And the latest addition, this ultra low budget (and looking every bit of it) monstrosity, written and directed by Bo Zenga, is a further scary nail in the coffin. The props, costumes and production values through out give the impression of being cobbled together by people who either didn't know what they were doing or just wanted a rush job and with such poor acting, writing and story telling, it's quite a boring chore to sit through too. As for any laughs, it's more notable for it's surrealness, such as seeing Leslie Nielsen in a waitress outfit and even more so Freddy Kruegger, Pinhead, Chucky, Leatherface, Michael Myers and Jason Voorhees doing their distinctive karaoke take on The Village People's YMCA. The whole thing leaves you with a yearning to watch the whole Scary Movie series back to back where this idea was done so much better, such a shame as the Wayans brothers could probably have made this promising idea work better. To think how long I was looking forward to seeing it...*"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "atk92",
        "review_rating": "1",
        "review_title": "Who approved this garbage, and then financed it?!",
        "review_detailed_main": "There are relatively few times that I have come out of a movie so bitter and angry as this one. I look at this movie and other movies such as Epic Movie, Disaster Movie, Not Another Teen Movie, etc. and wonder what happened to spoof comedy. There are fewer types of movies out there that are worse than unfunny comedies, and this 'comedy' got ZERO laughs out of me. Who finds this stuff funny? Oh look, its Leslie Nielson in drag, that's HILARIOUS! Oh, and all of these iconic movie slashers such as Michael Myers and Freddy Kreuger are doing the YMCA dance.(I'm completely serious.) That is not funny, its a farce. I don't know what is worse, the writing or the fact that there seems to be some sort of market for a movie like this.\n\nWhat makes this movie even worse is that while some terrible movies get the thrashing they deserve, (such as The Happening, Troll 2, and Battlefield Earth) they are memorable. Those movies are entertaining, although not in the way the director intended. This movie is not memorable in how bad it is. It. Just. Sucks. I have rated over 800 movies on this website, and have only given out eight 1/10 ratings. This movie earns and deserves that distinction, because it has no redeeming qualities whatsoever."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "adlagema",
        "review_rating": "1",
        "review_title": "One of the WORST movies I've ever seen",
        "review_detailed_main": "First, let me say that I LOVE stupid, juvenile, slapstick humor. Just for reference, I've thoroughly enjoyed such movies as the 'Scary Movie' franchise, 'Vampires Suck', 'Meet the Spartans', etc - some pretty dumb, but funny humor there. There aren't too many comedies, especially spoofs that I haven't at least CHUCKLED at. Stan Helsing did not even make me smile. It was so bad it actually made me angry for having wasted my time watching it. Absolutely NOTHING in this movie is funny. Not even remotely. The ONLY and I mean ONLY remotely 'interesting' element of this movie were the hot actresses. I honestly don't understand how anyone could rate this movie more than one star. I'd give it zero stars if it were possible. Please do yourself a favor and avoid this movie - even if you can watch it for free. It's not worth your time, let alone your money."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "Unfunny and has no point to it",
        "review_detailed_main": "As far as spoof movies go, Stan Helsing is not as abysmal as Disaster Movie, Epic Movie, Meet the Spartans and 2001:A Space Travesty, but it is a long way from being Airplane!, Young Frankenstein, Galaxy Quest and Loaded Weapon 1 either. As a spoof movie, it fails. It is unfunny and quite frankly pointless as well.\n\nThe production values are cheap. The camera work itself is reminiscent of direct-to-video fodder, while the sets are cheap and the costumes are little more than fancy-dress. The soundtrack is poor and doesn't fit with the tone of the movie. The comedy doesn't work at all either, the script is absolutely awful with stale laughs, the spoofs are irrelevant and superfluous and any slapstick is painfully juvenile.\n\nThe story is almost non-existent, and any scene that tries to tell even a thread of a story ends up being predictable and pointless. There isn't a single likable character either, all of them are caricatures and clichés, the direction is sloppy and the pace is rushed. The acting is terrible, the female leads are beautiful but can't act and how Leslie Nielson was dragged into this I shall never know.\n\nOverall, a lame and unfunny spoof movie and best avoided. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "aesgaard41",
        "review_rating": "1",
        "review_title": "When Bad Movies Get Worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "Very Funny!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "le-shrimp",
        "review_rating": "7",
        "review_title": "Unexpectedly funny movie",
        "review_detailed_main": "Stan Helsing is definitely worth watching if you are looking for a movie in this genre. It is funny and you never know what's going to happen. The movie is produced by the executive producer of Scary Movie, and one recognizes the humor from that film. Horror/comedy parodies are usually not very good, but this one stands out from the other new ones I have seen. It did not have an advanced plot, but that is not something to be expected from this type of movie. However, it kept me interested throughout the film and that is good enough for me.\n\nI gave the movie 7/10 because it is one of the best I have seen in this genre. Instead of sticking to just one movie, it had its very own plot and used the other movies well. Stan Helsing is not as predictable as many other parodies like it, and I will definitely watch it again."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "riffmaster7",
        "review_rating": "1",
        "review_title": "Someone actually provided money to have this made",
        "review_detailed_main": "I don't think I've seen a worse movie in my life. I don't know what the budget was to have this made, but it would have been better spent setting it on fire and watching the ashes disappear in the wind. Not funny, not scary, incredibly lazy, and a slap in the face to horror and comedy. I would give this zero stars if possible."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "D_Burke",
        "review_rating": "3",
        "review_title": "The Story Is Dead Before The Killers Arrive",
        "review_detailed_main": "\"Stan Helsing\" is a dreadfully dull comedy that is poorly written, poorly paced, and not very well thought out. It's a shame, too, because the movie's title made me laugh.\n\nIf you've seen the DVD cover of this movie, it tells you that the movie is made \"by the executive producer of 'Scary Movie' (2000)\". It makes me wonder why \"Scary Movie\" worked as a comedy and as a spoof, yet those who collaborated upon it have failed miserably when making their own spoof movies in a similar vein.\n\nOf course, I'm talking mainly about Jason Friedberg and Aaron Seltzer, two out of the six writers of \"Scary Movie\" who went on to make abominably unfunny parody films like \"Date Movie\" (2006) and \"Meet The Spartans\" (2008). In fact, the reason I wanted to see \"Stan Helsing\" in the first place was because Friedberg and Seltzer had absolutely nothing to do with it. However, while \"Stan Helsing\" is slightly more deserving of a theatrical release than anything by Friedberg and Seltzer, it shouldn't be commended simply because it sucks a little less than \"Date Movie\".\n\nIn fact, you can tell just how desperate this movie is when the opening credits read \"Stan Helsing: A Parody\". Whenever a comedy tells an audience in writing what sub-genre it is, you may want the next hour and a half of your life back already.\n\nStan Helsing (Ashton Kutcher lookalike Steve Howey) is a clerk at Schlockbuster Video (Yep, that's the name of the place). In one of the worst set-ups to any story, he is ordered by his manager to deliver a set of videos to the boss's mom. The problem is that it's Halloween, and his friends are picking him up in their van to go to a party.\n\nHis best friend Teddy (Kenan Thompson) is dressed as Superman (reminding me immediately of Thompson's recurring character Superdude from his days on Nickelodeon's \"All That\" (1995)), and has two gorgeous ladies in the van with him. Stan's ex-girlfriend Nadine (Diora Baird) is allegedly dressed as an Indian, but is scantily clad enough to make any man in the audience not care. Teddy's squeeze is ditsy stripper Mia (Desi Lydic), who changes costume in a relatively clever running gag.\n\nReluctantly, Teddy drives Stan to deliver the videos first, but of course they get lost. Stan keeps hearing that his ancestor is Van Helsing, who is described in this film as a monster killer. Of course, anyone with the slightest familiarity with vampire movies (not necessarily novels) will know Van Helsing as the man who hunts down Dracula in the Bram Stoker novel of the same name.\n\nI guess some people's minds have been poisoned by the Hugh Jackman vehicle, \"Van Helsing\" (2004). In that film, Jackman, as Helsing, attempts to kill not only Dracula, but Frankenstein's monster and the Wolf Man. The movie bombed, and came out six years before this one, thereby making it not very ripe for parody.\n\nAnyway, rather than Stan Helsing taking on the classic Universal monsters, he finds he has to kill more modern horror movie villains: Freddy Krueger (\"Nightmare on Elm Street\"), Michael Myers (\"Halloween\"), Pinhead (\"Hellraiser\"), Leatherface (\"Texas Chainsaw Massacre\"), Jason Voorhees (\"Friday the 13th\"), and Chuckie (\"Child's Play\"). The people playing these monsters not only look nothing like the originals, but they are also each equipped with cheap gags. Freddy Krueger wears a large watch around his neck a la Flava Flav, Pinhead has darts protruding from his head, Leatherface carries a leaf blower instead of a chainsaw, and Michael Myers wears a yarmulke.\n\nYes, you read that right: Michael Myers wears a yarmulke. Why? Well, that character wears a white-washed Captain Kirk mask, and Captain Kirk was played by William Shatner, who is Jewish, I guess. The point is, these props don't make you laugh for very long, and mostly remained unexplained.\n\nIn an even more wasted role, the late Leslie Nielsen just plays a guy in drag. Yeah, that's it. If someone had tried to call him Shirley, it may have been funny, but he just shows up, is in women's clothing, and that's really about it.\n\nThere's also a tired Michael Jackson/pedophile joke that goes nowhere. Given that the film came out in 2009, the year Jackson died, the timing of the gag couldn't have been worse. The main cast isn't funny, the story makes absolutely no sense and goes nowhere, and there's an even dumber climax involving a karaoke contest. It doesn't even seem worth it to commend this film for not making outdated pop culture references.\n\nIf you find yourself falling asleep during this film, just hope that Freddy Krueger appears in your dream and slashes this film reel to bits. At least that way, your dream will be more entertaining than this movie."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "1",
        "review_title": "Stan Helsing (2009)",
        "review_detailed_main": "Oh dear Christ almighty! Van Helsing was pretty much a spasticated spoof as it was. Stan Helsing is a dedicated cluster fck of comedic incompetence. We see the ancestor of Van Helsing having to fight against a series of slasher spoofs. If the idea of Michael Myers (now called Mikey) wearing a yarmulke makes you laugh then a) you're a fricking idiot that should have been aborted and b) you might like this crap. The only reason to keep watching this is Diora Baird, literally couldn't take my eyes off her. The only 'joke' worth commenting on is the Michael Jackson pisstake. This shows that somewhere lay some comical balls of steel, or they stupidly forgot to edit it out. Probably the latter. It's a shame this was one of Nielson's last films, as it is quite the embarrassment."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "taterfarraday",
        "review_rating": "1",
        "review_title": "The worst movie parody I've ever seen....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "aarelf",
        "review_rating": "1",
        "review_title": "Crap horror comedy attempt",
        "review_detailed_main": "Stan Hellsing is the worst film i have ever seen . It try,s to be funny but it is not in the slightest. Its cringe worthy how bad this movie is. Don,t waste your time watching it . You will be disappointed. It,s attempt of being humorous is actually more entertaining than what they intended to be entertaining. The whole time i was watching this movie i was waiting for it to get funny but it never did. I am kinda assuming that they had a low budget because of the quality of the movie But they chose to do a movie with to many actors that are all terrible rather than paying a better script writer or doing a better job on the costumes. The only way this movie would be acceptable would be if it was fan made. I don,t even know why they released this movie in general or how it ever made it across the sea Im just happy i got it free with another DVD rather than paying for it."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "eric-a1129",
        "review_rating": "2",
        "review_title": "Not the WORST movie ever...",
        "review_detailed_main": "Well, against my better judgment I decided to watch Stan Helsing today. I am a very big fan of both the horror and comedy genres, however I quickly realized that some things should never be combined. Even though this movie did have a moment or two that could be considered funny, I found the hardest thing about watching this movie was trying to sit through the final 15-20 minutes, that took a lot of will and discipline on my part.\n\nParodies in general are difficult to pull off, but when this film included some of my favorite serial killers such as Jason, Freddy, Chucky, and Leatherface I thought it had some material to work with, and had potential to be decent. However, almost every joke attempt came off as lame, immature, and just not funny. Like I said, there were a couple of jokes here and there that managed to get a smirk, but most of them, even the funny ones, missed the mark. The best thing about this movie, and the sole reason I gave it a whole star was because of the terrific performances (umm..okay outfits actually) of Diora Baird and Desi Lydic. Both of these women were dressed in revealing Halloween costumes throughout the entire movie.....well played.\n\nIf you like parodies, than you may get a kick out of Stan Helsing. Everyone else should avoid this movie like the black plague."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "TheSBot9000",
        "review_rating": "1",
        "review_title": "Late game Scary Movie tier comedy",
        "review_detailed_main": "If you've ever seen Scary Movie 5 or Movie 43 or any of those later parody movies then you should be expecting the exact same amount of enjoyment (I.E none) from watching this movie. What originally starts off as a hopeful endeavor into the humorous representation of horror-movie tropes ends up being a bland, boring \"adventure\" that relies on overdone adult humor jokes to push it's non-existent plot along along until it fizzes out in the finale. It's only a 1 for 2 reasons: I can't rate it lower and I did find maybe 2 scenes actually funny."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "steveswangler",
        "review_rating": "1",
        "review_title": "how does stuff like this get made?",
        "review_detailed_main": "First and off topic, to other \"reviewers\" give a review, dont just write out the entire storyline.\n\nBut second, this wasnt funny at all. I love parody movies, but unfortunately they are either hilarious or they are awful. This falls into the second category.\n\nFrom pointless needless scenes, to stupid jokes, to the uneven and meandering plot this motion picture was more annoying than funny.\n\nI cant figure out how producers agree to make films like this one, or how so many actors agree to perform in garbage like this. Of course, Kenan Thompson is now on snl so even though he is funny, he is used to being on completely unfunny crap."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "onosereba",
        "review_rating": "8",
        "review_title": "I truly enjoyed this movie for it's deliberate stupidity",
        "review_detailed_main": "This movie isn't an Oscar movie and it wasn't trying to be. This was a pure parody of horror flicks, not all the jokes are hilarious but most of them are.\n\nIf you go into this movie expecting to be blown away, then you will be disappointed but if you go in expecting to laugh at ridiculous situations and plot lines then you will delighted.\n\nI loved it because it obviously never took itself seriously and all the main actors were committed to their ridiculous characters.\n\nThis movie is not as bad as Scary movie 3 or Dance flick but it's not as good as Scary movie 1. It's to be taken in it's own context and not scrutinized with the standard of those movies.\n\nThis movie is STUPID but funny. So see it."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "drw_81",
        "review_rating": "7",
        "review_title": "Forget the bad reviews....",
        "review_detailed_main": "Give this movie a chance, is actually pretty good."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "view_and_review",
        "review_rating": "5",
        "review_title": "About What I Expected",
        "review_detailed_main": "I feel like if I watched this movie given the title, the trailer, the genre, and the bad rating, then I have no right to pillory it. This movie was just as dumb as I expected it to be and that's why I'm not mad.\n\nFour friends--Stan Helsing (Steve Howey), Nadine (Diora Baird), Teddy (Kenan Thompson), and Mia (Desi Lydic)--are set to party on Halloween night until a little detour turns the night into a fight for their lives. They have to face a parody version of Freddy, Jason, Leatherface, Chucky, Pinhead, and Michael Myers (Fweddy, Hitcher, Pleatherface, Lucky, Needlehead, and Michael Crier). Stan Helsing kept being confused with Van Helsing the monster slayer. It was totally ludicrous from the word \"go!\" There were more sexual jokes than horror jokes, none of them were that good, but I knew that going in."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "PiperGrissom1",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Nothing interesting or remotely funny in this so called spoof. It's just bad."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "mpopy1",
        "review_rating": "2",
        "review_title": "Stupid, Unfunny, and Disguisting",
        "review_detailed_main": "One of the worst movies I have seen so far. It's all about sexual jokes and fart noises. Watching that I had a good laugh or two near the beginning but after a while every joke was predictable. Maybe it's so bad because it is a \"parody\" but damn, it's not entertaining at all. It was an hour and a half of torture."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "hr-boege-546-170392",
        "review_rating": "2",
        "review_title": "only funny if you are stoned",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "FlashCallahan",
        "review_rating": "2",
        "review_title": "the whole town is dead....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "eminkl",
        "review_rating": "2",
        "review_title": "Middle schoolers are going to like this film, but that's about it.",
        "review_detailed_main": "I saw worse spoof films, but I saw much better as well. Stan Helsing has a handful of funny jokes, but most laughs are stupid and uninspired. It wastes a nice concept entirely. Middle schoolers are going to like this film, but that's about it."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Alexander_TheOne",
        "review_rating": "1",
        "review_title": "The worst movie I've ever seen",
        "review_detailed_main": "Out of 2100 movies watched. I would rate this as the worst pure, utter bullshit I've ever seen. (Haven't watched vampires suck yet.) The script seemed to be written along the way, Acting, Costumes and effects are among the most ridiculously bad someone could possible do.\n\nThey used the name, the genre to make money. It's the only ambition and reason people who made it had.\n\nI honestly wonder if the director himself even would/have watch/ed the movie more than 1 time..\n\nTo sum it up, avoid at all cost. Watch only if you are a huge movie nerd, or want to see how to absolutely not!!, make a movie."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "jacobjohntaylor1",
        "review_rating": "1",
        "review_title": "To scary",
        "review_detailed_main": "This is a spoof horror movie. So it is supposed be funny. But it is not. It is scary. It is to scary. The hummer is a awful. Leslie Nielisen plays a woman. And that is to scary. I am not an easy person to scary. But this on did it for me. 3.6 is not a good rating. But still 3.6 is overrating this movie. It is badly written. It is also a lot of the actors in this movie are awful. The is pooh pooh. There is scene were Freddy Krueger is taking a pooh pooh. And there is a another scene with a man dressed as Frankenstein taking a pooh pooh. This is the proof that it is not funny. It is just pooh pooh. I do not want to see Frankenstein taking a pooh pooh. And I do not want see Freddy Krueger taking a pooh pooh. And I do not want to see Leslie Nielisen dressed like a woman."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "skyrrasuspyrra",
        "review_rating": "9",
        "review_title": "A low-budget masterpiece!",
        "review_detailed_main": "This is a truly \"so-good-it's-bad\" situation. This film will live on proudly as an exercise in bad taste and deliberately over-the-top spoofing of many our favorite horror films. As a fan of both horror and bizarre humor, I found this movie very enjoyable. The one liners and quick gags may turn some people off, but this type of movie was meant to be filled with them. This is not a serious attempt at an Oscar nomination, so you can expect a few of these snobs on here to make their wisecracks. These are the same people, I imagine, wouldn't get half of the horror references. If you appreciate corny, tasteless, and even avant-garde humor, you should at least like it. If your also a huge fan of horror, you'll love it. Don't listen to the naysayers! Give it a chance! Just don't take it too seriously. 9.1 out of 10--I know that may seem high, but I laughed a lot. Thanks for reading!"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "dmraci",
        "review_rating": "7",
        "review_title": "It's 7 stars not because it Oscar winning",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Diorafan05",
        "review_rating": "5",
        "review_title": "If it makes me laugh, I like it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "kirk-246",
        "review_rating": "4",
        "review_title": "The spoof genre is starting to run out of gas.",
        "review_detailed_main": "What do you get when you put some good actors like Kenan Thompson and Leslie Nielsen and you put them in a spoof on slasher flicks that clearly has killed the spoof genre? You get 'Stan Helsing'. It has no real plot, the characters aren't very interesting, you hardly laugh at the crude and sexual humor that I normally laugh at, and the acting is beyond atrocious.The acting is even worse than the acting in 'Jennifer's Body'. Now I have truly witnessed what may be one of the worst movies of 2009.My friend is the one who introduced this movie to me.He told me that it was funny and he gave it an 8 out of 10.So he let me borrow the movie in exchange of letting him borrow 'Saw IV'.I don't necessarily blame him for liking it.I just can't believe how he can even stand it.There's just no getting around it.It's nothing more than a cheap rip off of much better horror movies like 'Halloween', 'A Nightmare On Elm Street', 'Friday The 13th', 'Jeepers Creepers', and 'Child's Play'.It also rips off of 'Hellraiser', but I haven't seen that movie yet.There's not even an explanation to why the killers are in the movie.Did they rise up from the grave or what? I thought that Rob Zombie's extremely underrated 'Halloween 2' was WAY better than this piece of trash.\n\n'Halloween 2' rules. 'Stan Helsing' sucks."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "EvylOverLord",
        "review_rating": "5",
        "review_title": "Not Nearly as Bad as Ratings Implied",
        "review_detailed_main": "It was way better than a lot of spoof films I've seen lately that have bored me to tears. I would have rated it higher, but the ending was a bit disappointing. The monster song was awesome, but it goes downhill after that. This is a raunchy, silly, 80's style comedy film. Keep in mind Leslie Nielsen is in it, so think \"Naked Gun\" meets the first \"Scary Movie\". Then add in some \"American Pie\" for flavoring.\n\nIf you are looking for some amusing, sexy, and stupid way to kill time, then you might like this movie. If you are looking for a deep meaningful horror or thriller film, then obviously look elsewhere. If you are not into raunchy innuendo or strippers, definitely stay away."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "GiraffeDoor",
        "review_rating": "3",
        "review_title": "Put a stake through it.",
        "review_detailed_main": "Yes, there is the occasional fun gag but you can count them on your fingers.\n\nThis movie deserves its status as among the one hundred lowest rated movies on here. Remember Scary Movie and its sequels? well, it's that if they were made by those internet personalities that are famous for some reason.\n\nNow I liked Scary Movie 3. I loved Scary Movie 5. But there is no joy, no passion, no fun in this movie. Sure, it's goofy, but it is tediously long drawn out with a stupid plot that just coasts too long on how it has bad facsimiles of iconic slasher villains. It thinks that that is a joke. The plot goes nowhere, the whole thing is poorly thought through and it's just the same kind of thing over and over.\n\nJust another mixed parody that was made just because they thought it would be easy to do so."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "arfdawg-1",
        "review_rating": "1",
        "review_title": "He Never Worked Again",
        "review_detailed_main": "The problem with this movie is that it is very very very poorly directed. Slow as molasses. Some of the humor fits the ZAZ mold of yore, but the director has no business directing.\n\nIn fact, he has never worked again."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "ashfordofficial",
        "review_rating": "2",
        "review_title": "RIP Leslie Nielsen",
        "review_detailed_main": "I googled horror parody films and this one showed up. I thought why not? I didn't know it's going to be THIS bad.\n\nDiora Baird was the main attraction of this film.\n\nRIP Leslie Nielsen. You'll be missed."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "curiosarcana",
        "review_rating": "2",
        "review_title": "Promising premise falls flat.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "smalltt96",
        "review_rating": "10",
        "review_title": "wow way better than expected",
        "review_detailed_main": "its way better than scary movie and a lot funnier its a shame that this was one of Leslie N. last movies he was great and what a way to end his movie Carree he was the highlight of this movie and no one could of played the role better I'm looking forward to seeing a sequel this is a good movie in my eyes this is kinda Scary Movie 5 except with better acting and funnier lines Keenan was also very funny he needs to get more movies hes a very good actor and so so so so funny very good movie\n\nplease comment and tell me what you think no matter what your opinion is as long as its not rude or crude but please check this movie out it deserves a better rating than what it has my rating is 8/10"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "staunton-gary",
        "review_rating": "7",
        "review_title": "I wanted to give it 6.5",
        "review_detailed_main": "Almost 7 stars for this movie. The movie started off with a few giggles which became less as the story unfolded. However, I was entertained enough to award it 6.5 stars. Nadine (Diora Baird) was the weakest link, she looked rather bored, perhaps its because the main focus was her chest. Mia (Desi Lydic) was entertaining as was Stan Helsing (Steve Howey). Teddy (Kenan Thompson) felt more like he was there to satisfy some quota. Watchable, once."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "jeremycrimsonfox",
        "review_rating": "1",
        "review_title": "Proves How The Parody Film Genre Is Stale",
        "review_detailed_main": "Yeah, this film is horrible. Made by the same people who made Scary Movie, this film is basically what you'd expect from them: a group of people get into a situation with creepy monsters, complete with the overload of crude humor and sexual content to the point where it stops being funny, etc. By this time, the formula has gotten so stale, these type of films should be outlawed. If you want a good horror comedy, stay away from this and watch Zombieland (which was released the same year, and was actually successful)."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "PulpSomething",
        "review_rating": "5",
        "review_title": "Poor third Act",
        "review_detailed_main": "Strong start, but third act completely falls apart."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "mad_mike1211",
        "review_rating": "2",
        "review_title": "From bad to worse",
        "review_detailed_main": "This movie starts out average and gets bad pretty quickly. When you realise what it is, you try to accept it for what it is. That doesn't prepare you for how bad it really gets though. Overall plot is interesting but they do nothing with it and butcher it at every moment. acting is average at times but shocking at others. Script is horrible from start to finish and the cringe moments get worse as the movie goes on. Put it this way, I would avoid watching this if I were you. 90 minutescould be spent doing better things, like watching paint dry, orcounting the grains of sand on your local beach"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "andrewjosephtrevino",
        "review_rating": "1",
        "review_title": "Worst Move Ever",
        "review_detailed_main": "Hands down, the worse movie I have ever seen. It was a complete waste of my time. Im sorry for the actors and everyone involved in that movie but that movie shouldn't of had happened."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "shortc-85671",
        "review_rating": "5",
        "review_title": "Excellent spoof film, so bad it's good",
        "review_detailed_main": "Listen, this got laughs from me. Despite the reference humor, it was weighed with terrible original ideas. The bad plot was held up with good actors and played with the cheesiness really well.\n\nAlso Leslie was amazing.\n\nThough I need to know what happened to those videos."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "tequila101",
        "review_rating": "5",
        "review_title": "Ummmm, Not Really, Could of Been Better!?",
        "review_detailed_main": "This is the second parody film I've seen, and I've got to tell you, it is messed up.\n\nStan Helsing is about a man and his friends who try to attend a Halloween party but their car breaks down in the middle of nowhere. After that they meet the likes of Freddy Krueger, Pinhead, Chucky, Jason Voorheas, Leatherface & Michael Myers. Stan must stop the horror icons before they take over the town and kill all the people of the town. They expect him to do it because he's Van Helsing. WTF!? First of all I want to talk about how they mucked up the horror icons. Chucky looks like a rag elf from one of those Santa Claus films. Jason wears a hockey mask but giving him an entire hockey uniform was just going too far. They mucked up Freddy with his finger knives (Tooth brush, lip stick :(. They even made him look gangster.\n\nPinhead is needle head and he looks like the solar system. Umm, really weird Michael Myers as they gave him red, rosy lips and Leatherface isn't even Leatehrface because he has tubes coming out of his head; he has a metal mask and no chainsaw. Instead they gave him a bloody leaf blower. Even the deaths towards these horror icons was just F****d up.\n\nAs we go to the main characters Stan, his ex girlfriend, and his two other friends (in which I don't remember their names). The main characters are stupid and messed up. Adult humor has just gone to far in these stakes of this film.\n\nI liked the first half of the film, but when the second half came along, it just dropped this film to the ground. The scenes are stupid, the humor is not even funny and I'm disappointed that they screwed up Chucky & Michael. Stupid film 4.9/10"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "gokhan-37770",
        "review_rating": "1",
        "review_title": "A Scary Movie-like production",
        "review_detailed_main": "As a guy who don't appreciate parody movies which has weak comedy structure like this, i'd like to say to not offer this to watch. In fact, there was only one thing that this movie can give to its watcher and it was the song of Long White Cross by Pluto, rest of it was not worht to comment. Even the thing that Leslie Neilsen was the cameo couldn't save it, not to mention Ken Kirzinger, the portrayer of Jason Voorhees, a slasher movie villian in it, you know. So, in the nutshell, be careful to not bring yourself to the points to watch these, eat your vegetables and live a life funnier. I can offer this to you at least."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "MWaetke",
        "review_rating": "8",
        "review_title": "Actually pretty good",
        "review_detailed_main": "I caught this movie on cable a couple times and despite the deliberately campy jokes and monsters found quite a lot of humor so I was surprised to see all the negative reviews. Yes, the monsters and situations were exremely campy, but the script was constantly funny and involving as were all the actors delivery. It was jarring to see Leslie Neilson's getup but his delivery was razor sharp and their interaction in the club was very funny. Keenan Thompson was a surprise and stood out as constantly hilarious and kept the movie moving along. On SNL he was always in lame one joke skits and you couldn't tell how funny he was."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "RightOnDaddio",
        "review_rating": "6",
        "review_title": "2023. A Gen-X Review of a Decade-Plus Old Film That I've Never, Ever Seen Before",
        "review_detailed_main": "Why did I not hate this film? Why didn't I? It seems like everyone else does. A have a tried and true battle-tested buddy who is one of my go-to's on all things horror and I remember way back when, when this was released he said to me something to the effect of, Dude, don't even waste your time. It's so stupid. It's one of the worst movies I've ever seen.\n\nI had lots of other things going on at that time, so to the back burner it went.\n\nUntil 2023.\n\nOkay, so it's easily like a cheesy Scary Movie knockoff.\n\nBut there are two things for me that make it much more than that.\n\nThe comedic charm of Steve Howey, who plays Stan (Dude, I had no idea he was Stan! He's always hilarious!) and also the unbelievable eye-popping beauty of Diora Baird. Wow! I could watch her on screen like this with her just standing there not even delivering any lines. What a knockout.\n\nThe supporting cast is solid as well.\n\nThe legendary Leslie Nielsen in one of his final roles. Respect. Also Kenan Thompson who as of now has a new Good Burger coming out soon.\n\nAwesome.\n\nSo, the villains here look silly but that's probably a rights or licensing thing. But you get the idea and they're all here: Chucky, Freddy, Jason, Pinhead Is this a dumb movie?\n\nProbably. But isn't it supposed to be?\n\nLook, Howey's sharpness and Baird's gorgeousness keep me occupied and entertained the entire run time.\n\nThere are plenty of laughs to be had here. Even if you're sober."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "pandion1",
        "review_rating": "1",
        "review_title": "Imagine Scary Movie, but worse",
        "review_detailed_main": "This movie tells us from the start that it is a parody. It is, in so far as it fits a 12 year old child's definition of parody. There is no cleverness here. No wit, no subtlety. No chance to make a crass joke is avoided. There is none of the intellectual sophistication necessary for a parody. This is what happens when a script gets written by a child and then somehow an adult decides to make a film. What makes it worse is that even when the jokes could be good, they completely fail to land due to the inept handling of the film by the actors, the director and the script writer.\n\nI thought it was impossible for a film to be worse than Scary Movie. I was wrong."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "fluffchop",
        "review_rating": "2",
        "review_title": "Incredibly Unfunny",
        "review_detailed_main": "Never delivers. It's not a parody of anything. It's just a lame movie that goes on and on without a laugh anywhere. I think the writers must have been on Cocaine and thought what they wrote was funny."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "ricky6913",
        "review_rating": "9",
        "review_title": "One of the funniest scary movie parodies",
        "review_detailed_main": "All i have to say is this is quite possibly one of the funniest of the movies the director has made. This is a movie that is not meant to be criticized as you watch it but yet tenderize the comical part of your brain. This was made from one of the directors of the scary movie parodies. So to the people saying this is a rip off of the scary movies, this is actually a spin off. Well scripted and very funny, the main character run from unscary \"scary\" movie characters that have been haunting peoples dreams for ages now. The comedy comes from the stupidness of all the characters, it is not supposed to serious at the slightest bit. The people who can not laugh at this movie have no actual humor. The characters have so much bad timing in this movie that it leaves the whole movie action packed and chopped with humor. The fact that every time they were in danger and easily escaped is the funniest of all. All the misrepresentations, sexual innuendos, \"close encounters\", and funny friend scenes is what makes this an all around funny movie. I have recommended this to all my friends and so far all twenty something have got back to me with the same comments i am posting. The funniest of all though is all the critics of this movie who were obviously not in the mind set to laugh, tareing this movie apart. Great movie and a must watch to all comedy loving fans."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "amichnea",
        "review_rating": "6",
        "review_title": "Not that bad:)",
        "review_detailed_main": "Gave it a 6 since it is in the same pot as Scary Movie and just about every other parody movie that followed on the same principle.\n\nThe 6 is purely for the women because oh my god:) they all bloody gorgeous... and that's about it:) Honestly I though it was a lot better than the previous stuff, from all the parody films, wasn't over the top silly jokes, not really sick stuff where they have to use vomit, farts and all kind of grossness because they think it is funny. They actually did have some funny moments, some clever jokes... again stuff that has been missing from all other parody films.\n\nOverall the film it isn't as bad, maybe if it came a few years back it would have been much better received but since this area has been done and redone so many times... it is just another one of those films:) Watch it if you have nothing better to do, not really worth the cinema price but good if you can borrow it.\n\nBecause of the women and sexual nature, hoink hoink:) the film is probably suitable for a male audience... so get your mates around have some beers and enjoy it."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "grande_illusions2",
        "review_rating": "10",
        "review_title": "Seriously, this film is NOT that bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "bapple37",
        "review_rating": "8",
        "review_title": "Overly underrated",
        "review_detailed_main": "This was HILARIOUS. I was sober the first time I watched it, LoL"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Mega Monster Movie",
        "review_detailed_main": "It actually isn't. But that is the actual German title this movie got. I haven't translated it into English. This is it. Suffice to say, the movie would not live up to an expectation you would have, when you hear that title. It's also true that some people expected more \"spoof\" than is actually in the movie.\n\nMaybe it is not so much the \"spoof\" percentage, but the fact that it just didn't feel funny to most people. And I'll be the first to admit, that quite a few jokes didn't really work. Still the movie tries hard and it has actors in it (which can't be said about others spoofs of recent times). It is not laugh out loud funny, you might chuckle here and there. It has good production values and looks good (not only our lead actresses). All in all, very decent indeed!"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "cosmality",
        "review_rating": "9",
        "review_title": "Haters gonna Hate",
        "review_detailed_main": "I see lots of negative reviews. This isn't a blockbuster hit. This is a Horror Comedy Parody! It is supposed to have the feel that I think this movie does a great job capturing.\n\nThe one liners in this movie are fantastic, the goofy parody adaptations of common movie killers is hilarious, and you have a couple actors who aren't really well known right now, but have great chemistry. It is a go to movie for filler near Halloween for me now, as I like something more lighthearted.\n\nDon't take my word for it, or the word of others. Watch it yourself and see. This is a movie you will either love or hate, which should be obvious by the ratings."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "Cell_Life",
        "review_rating": "7",
        "review_title": "Funny Comedy Horror Spoof",
        "review_detailed_main": "As a drive-by connoisseur of horror; this was a pretty darn funny send up. Beats the last couple Scary Movie spoofs that relied on too much cameo/star presence.\n\nThis was formulaic, but in a good way, goofs, send-ups, mocking with some actual WTF weirdness. I'd rather watch this for the genre than another Scary Movie rehash. Bottom line, kookier, creepier, and fresher than the genre staples have lowered themselves to.\n\nAlso, the actors are above par for a 'tongue-in-cheek' parody. If your expecting witty repartee, your in the wrong place. If you want a goofy send up of cliché horror tropes, you've arrived."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "iwaker",
        "review_rating": "9",
        "review_title": "Horror spoof that's raunchy, funny, imaginative, and actually scary.",
        "review_detailed_main": "Ok, not all that imaginative, save for a few scenes. But it was all shot acted and put together in a way that made if feel like an actual horror movie. I was in a constant tense state with each creepy character encounter, believing that it could have turned real any time... but i'm not saying it didn't. you'll have to watch it.\n\nI felt that it was better than the other raunchy horror spoofs that i've currently seen. It had a in it's own world feel that made if different than the others. And It's not as HollyWood as Screem, with it's cameos, or as Horribly cringey and perverse as House.\n\nThe film is about a movie store employee and his friends, two galls and a guy, who drive out of town to drop off some movies at the store owners house. During the way and at the destination, they encounter many creepy characters one after an other. I won't tell you if they survived. You'll have to watch the film.\n\nThe jokes are funny and raunchy, which does put this movie in the mature adult category. There are some gross jokes. But I didn't find it all that horrible like I did with House 2.\n\nThe characters were cleache but all likable, and worked well as a team, and even had that Scooby do vibe to them. Of course The girls were very attractive, and wore hip exposing attire the entire time. There was even a imaginative pantie shot scene that made me cringe and laugh at the same time.\n\nAll in all, it's in my view better than the other raunchy spoofs, and worth the look."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "StevePulaski",
        "review_rating": "6",
        "review_title": "A Movie Jason Friedberg and Aaron Sletzer Could Look Up too.",
        "review_detailed_main": "or a parody movie getting two and a half stars, thats like saying Leonardo Di-Caprio did his worst performance. It will never happen. So really, this might be a sign that 12/21/12 maybe real. Or they finally just did a good job. The main strength this movie had was casting Kenan Thompson, the only one who seems to try to be funny. Which he succeeds in some parts.\n\nThis is not strong though as a real film, the title \"Stan Helsing\" has to be the worst title next to \"I Still Know What You Did Last Summer\" or \"Friday After Next.\" If you guessed it, it's a parody of \"Van Helsing\" and other pop culture, cult classic horror movies.\n\nIt focuses on Hellraiser, A Nightmare on Elm Street, The Last House on the Left, and Friday the 13th. All parodied carelessly and very low class. They have to use lines like \"We have to go on to 428 Elm Street. It's the last house on the left.\" To emphasize it's a parody.\n\nThe plot, if there is one, involves a group of teenagers (Kenan Thompson, Steve Howey, Diora Baird, and Desi Lydic) trying to get to a costume party. When Stan Helsing (Steve Howey) needs to drop off some movies, he convinces Teddy (Kenan Thompson) to drive out of his way to do that.\n\nThey encounter many foolish and stupid acts in the movie, the two girls, portrayed almost like dropouts, Nadine and Mia (Diora Baird and Desi Lydic) are traveling with the slackers, and surprisingly going along with there pranks. Mainly Mia, who is the stupidest character next to Ed from Good Burger.\n\nThere is not much good about this movie. I have to say though, since it is very similar to the nostalgia the Scary Movie Franchise. It's not horrible, but still not very good. I enjoyed The Scary Movie Franchise, but didn't like the fourth one much.\n\nKenan Thompson is the highlight of this movie, but he can't do much when in between a rock and a hard place with this un-inspired script.\n\nDirector, Bo Zenga, who has helped write the script for \"Soul Plane\", will definitely have one long career if he relies on stupid parody movies to hold himself down.\n\nStarring: Kenan Thompson, Steve Howey, Diora Baird, and Desi Lydic. Directed by: Bo Zenga."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "GoitTR",
        "review_rating": "8",
        "review_title": "Actual review",
        "review_detailed_main": "It's a parody and it does what it's supposed to, the plot isn't supposed to matter, you aren't supposed to care about it, don't worry about it. You might as well complain about the cinematography.\n\nIt is supposed to be fun and likeable and it is. The complaints from most reviews are as relevant to this genre as saying this film isn't historically accurate. They make no sense. Films should be judged based on what they try to be, in the genre they choose to fill. It's not very serious and it shouldn't be. Some of the comedy is very dumb, and that's fine, that's allowed.\n\nThis gets way more hate than it deserves for no real reason."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "gianmarcoronconi",
        "review_rating": "6",
        "review_title": "Parody",
        "review_detailed_main": "People have to understand the direction of films like this which are parodies made very badly on purpose, ok in particular this parody is funny but not too much and has some flaws, but it manages to fulfill its task as the film is stupid like little else and it is exactly what these films are, colossal nonsense made just to make people laugh with tricks as banal as they are funny."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "owner-58246",
        "review_rating": "8",
        "review_title": "Stan Helsing!?",
        "review_detailed_main": "\"Stan Helsing!? I thought you said VAN Helsing!!\" lol"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "kezopster",
        "review_rating": "6",
        "review_title": "I've seen worse",
        "review_detailed_main": "Maybe the fact that I've seen worse says something about the movies I watch, but truthfully, I've seen many b-horror movies that were a lot worse than this parody. (\"Deathproof\" comes to mind quite quickly.) There's a lot of effort in this movie to be really funny and, at times, it does just that. The spoof of \"Chucky\" made me laugh because it was so unexpected. The bazillion references like \"...yeah, it's the last house on the left.\" That was fun, too.\n\nIn a lot of ways, this movie felt like it was a comic book adaptation. The premise is good enough. Stan Helsing is in denial about being a Van Helsing. Heck, this movie is at least as good as \"Van Helsing\" and \"The Brothers Grimm.\" Desi Lydic as Mia, an erotic dancer turned massage girl; she was just fun.\n\nDiora Baird as Nadine, was clearly picked to be a look-alike for Courteney Cox from \"Scream.\" Still, she was immensely watchable in the movie.\n\nKenan Thompson fell a bit flat at times, but was fun, too.\n\nIt's a send-up of teen slasher flicks and when it worked, it was fun.\n\nSome movies, you just give up watching... or fast forward to get it over with quicker... this one, for whatever reason, I kept watching. I guess hoping (pulling for?) the next little gem to make me smile."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "kurfirstinc",
        "review_rating": "10",
        "review_title": "oh geez",
        "review_detailed_main": "attack of the killer tomatoes, rocky horror, killer klowns from outer space, chud, troma, scary movie sequence not another teen movie, the relic, psycho.... and you wont give this a better star rating? i will give it 10 on principle... movie noobs. Punk bands make millions, going on tour and selling albums. They all became rich. And when you're rich, its hard to stay angry at the world. The fuel, the spark that started it all was gone. If you've watched The Dark Knight, there's a line in there that fits perfectly: You either die the hero, or live long enough to see yourself become the villain. Those were the two options punk had. either quit at the top of their game, or continue on making money, but become total posers. This point is where most bands broke up. they said \"screw it, we've gone as far as we can\"."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "metal-blade",
        "review_rating": "10",
        "review_title": "Great movie, Funny and Good Acting!",
        "review_detailed_main": "I Have no idea at all why someone would rate this movie under 10 stars, i couldn't stop laughing through the whole thing. i loved it! and got into all the characters, which had their own personality's.\n\nthe horror movie characters spoofs, had awesome makeup! the way they looked, looked just right! don't want to get into trouble for copyright reasons I'm guessing.\n\nSo it was fine! To sum up a short review, the movie was great in my eyes, cool, had horror in it, the acting was funny and good, cool music and effects.\n\nI wouldn't listen to someone saying all this dumb stuff about a movie saying its not funny or the acting sucks, just watch it for yourself and you will see the true beauty."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "seejoker1",
        "review_rating": "10",
        "review_title": "Don't believe the political correctness justice warriors, this is worth a watch!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "wadebednarick",
        "review_rating": "10",
        "review_title": "I had fun watching this..",
        "review_detailed_main": "That is all, just fun, and I kept watching so there. It wasn't epic drama or Shakespeare. Sometimes you just want to have fun watching a silly movie. Holy crayola six hundred characters to write a review? What is this English Literature class? I'm not writing a mid-term here, eh. You know what I don't even want to read a review that's six-hundred characters long. I would also like to thank the ladies costume department. If you are looking for something to finish off your popcorn and daiquiris this should do it just fine. You can turn out the lights because this will not scare you. So make some popcorn and daiquiris and let it roll."
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "krackers27",
        "review_rating": "10",
        "review_title": "Super funny horror spoof",
        "review_detailed_main": "I watch this movie every Halloween, it has become a guilty pleasure! Just turn off your brain and enjoy all the wacky characters and jokes! Ignore the low ratings, if you like \"Scary Movie\" you will like this spoof also"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "mattmoore-29077",
        "review_rating": "10",
        "review_title": "AMAZING FOR WHAT IT IS",
        "review_detailed_main": "I have always enjoyed this movie as it is a great spoof to some great horror movies. It is not meant to be some masterpiece people, you know what you are getting into with Stan Helsing when you look at cover and trailer. I will never understand why this has such a low rating, give it a chance!!"
    },
    {
        "movie_id": "tt1185266",
        "movie_name": "Stan Helsing",
        "movie_rating": "3.6",
        "review_username": "ilpot",
        "review_rating": "10",
        "review_title": "OK as low budget horror comedy",
        "review_detailed_main": "This is low budget film but there is good atmosphere and moments enough so you can watch through.\n\nWhen you watch it in mood you know what to expect kind of..\n\nthen it is value of lost time.\n\nYou can see they are having good time\n\nso it spread to you too maybe.\n\nNot much is lost if you stop watching.\n\nAfter film you get to thinking what did not happen. That is good also.\n\nThere is probably all monsters as they promise. Film is sexy but not too much. Things are in balance."
    }
]