[
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "innocuous",
        "review_rating": "1",
        "review_title": "A \"must-see\" movie. Really. I'm not kidding.",
        "review_detailed_main": "Don't be fooled by the rating. You have to watch \"Birdemic\" at some point.\n\nThis movies outshines \"Troll 2\" in every respect. It puts \"Plan 9 From Outer Space\" and \"The Room\" to shame. Imagine a movie that would be created solely to give film students a paper topic on how NOT to make movies. Every conceivable error has been made in making \"Birdemic.\" At first, you simply won't be able to believe that the film is not a spoof. But if you read about the film and about Nguyen, and if you take a few moments to watch the additional material on the DVD, you will soon agree that this was just a misguided effort on the entire production team's part.\n\nThe sound is the most outstanding example of sheer incompetence. The director clearly understood what Foley is, since the gunshots have all been added post-production, but I guess they just didn't have the time or money to dub the vast majority of the film after shooting. And it needs it. Badly.\n\nThe acting is uniformly terrible. Not bad. Terrible. Alan Bragh doesn't even rise to the level of fourth grade pageants. Whitney Moore is cute as a button and is aided by a bit of camel-toe in at least one scene, but she's the best of a poor lot. All the supporting cast is \"give your financial backers a small part\" bad.\n\nIf you want to explain blocking, editing, framing, sound markers, continuity, reverse shots, and other film terms to your friends, this is the film to use. None of it is done correctly.\n\nWhile the CGI (and I use the term in only the broadest sense) birds are hilarious, my favorite scene is the \"retirement\" scene. I think that the word \"retirement\" is used six times in just three lines. Watch for it. It's hard to miss.\n\nBUT...it's strangely watchable. In contrast to many bad movies, it's not boring. Consider it a train wreck that you simply can't tear your eyes from. Even the boring scenes (and there really aren't that many) have some aspect (poor sound, hilariously unrealistic dialogue, odd things going on in the background) that fascinate. You'll be giggling and poking your elbow into the side of the person beside you.\n\nSo, go rent it. Really. You won't regret it."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ejonconrad",
        "review_rating": "1",
        "review_title": "Definitely on the \"best of the worst\" list",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "pledgerock",
        "review_rating": "1",
        "review_title": "The worst film made by anyone, ever, at anytime",
        "review_detailed_main": "There are no words that come to mind after seeing this film. Travesty, horrific, absurd, ridiculous, and mind-numbingly stupid all come to mind but none of 'em quite describe just how awful this \"film\" really is. To see where everyone went wrong, let's break it down!\n\n1. It takes 45 minutes until the actual plot begins to develop. By this time, the majority of viewers have fallen asleep or have taken their own lives.\n\n2. The actor who plays Rod, Alan Bagh. He makes me miss Nicholas Cage. NO NOT THE BEES!!! AHHHH!!!\n\n3. The birds. What do they do exactly? Nothing. The birds come down and fly directly in front of the victims face. Then they die for reasons only criminally insane director James Nguyen knows. God help us.\n\n4. Read my parental advisory\n\n5. \"Hey I thought I told you to stand back. These birds are contaminated\"\n\n6. What is wrong with Rod's friend? And why can't he get a good looking girlfriend?\n\n7. The dialogue. It's like watching a poorly translated foreign film. \"I like you and because you are pretty to me\" \"I thank you this words they make me happy\" \"Yaaaaaayyy...\"\n\n8. This quote: \"Why would birds do something like that? Why would they just attack\" \"......I don't know\"\n\n-------The good?\n\n1. Thank god for Whitney Moore in lingerie. The only believable thing about this movie was that she got a job at Victoria's Secret.\n\nAnd that's my review. Go see it. I guarantee you will never see a worse film."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Quinoa1984",
        "review_rating": "2",
        "review_title": "a film for our times, for ALL times, or perhaps none at all....",
        "review_detailed_main": "Sometimes there is a film that comes along that boggles the mind. You cannot believe the thing exists, but there it is, paddling its arms forward like a Special Olympics finalist (and no, this is not a joke on the Special Olympics - they're too good for Birdemic: Shock and Terror). The movie tricks a viewer like yours truly; at first, having not seen anything made by its director, the inimitable James Nguyen - he has two other films to his credit, Replica and Julie and Jack, neither seen by me (just as well, one of whom gives its highest praise as \"Ed Wood quality\" on IMDb) - I wasn't sure what I was really seeing, if it was either the highest or lowest of artistic expression.\n\nThe film takes place in some sunny seaside community on the California coast - as we're made PAINFULLY CLEAR in the opening from-the-car driving shots (immediately calling to mind the opening credits of Manos: The Hands of Fate) - and is about how Rod (Alan Bough) and Nathalie (Whitney Moore), who meet one day by chance, he a successful solar-panel salesman and she a Victoria's Secret model (she just made the cover!) Oh, and there's an almost inexplicable warning of a crazy-killer bird epidemic on the news, from, um, I guess it's global warming. And after about a half hour of almost *nothing* going on between these two pieces of cardboard-as-actors, the birds finally arrive.... oh yes, how they arrive.\n\nWhat I mean by my uncertainty of what I was seeing, it felt like a double-edged sword. I kept thinking during the film, 'either Nguyen is a total genius, crafting the most intentionally bad movie in recent memory, or he's quite possible the most sickening hack you've never wanted to meet.' It's one thing that the film was shot on a shitty camcorder. It's another that the actors appear to be non-professionals or at best from community theater (Alan Bagh is so stiff he just might make your eyes bleed; Moore is too hot to have that happen, though her talent is just as nill).\n\nBut it's something else how absolutely, and surprisingly consistently, awful the film-making is. Even if you've never taken a class in proper lighting or sound or stage direction or editing, Birdemic shines so mightily in its crap-ness. Scenes start and end without a proper marker, as if the editor didn't know how to flow from one scene- one SHOT- to the next. Sound is completely mis-matched from one shot to the next. The music is the kind of synthesizer work that cranked up loud enough could drive Bin-Laden out of his cave (they even go as far as to rip-off the John Lennon song \"Imagine\" for a girl character wearing a \"Imagine Peace\" shirt. And the birds... oh, boy, the birds (if you need further proof, watch the trailer, do yourself a favor and get it out of the way).\n\nNow, again, experiencing this film, especially in the case I had in a theater with people perhaps anticipating its awfulness based on the trailer or the website or the claim by Nguyen to be a \"Master of the Romantic Thriller\" (Trademarked. I'm not kidding), that this is perhaps just a brilliant prank, a satire of epic proportions. Certainly the \"message\" part of the movie- and it's wielded with such a sledgehammer it would make Stanley Kramer look like Jim Jarmusch - is done to such a ludicrous extent, with characters appearing for walk-on scenes like a Old-man Biologist who appears to explain that the birds were caused by man's harm to the planet, or the \"Tree-Man\" in the woods who has a tree-house home and finds the birds don't attack him because he's in the woods and not out on the road like the rest of stupid man-animal civilization. Not to mention the rather *listen to us now* attitude of the main characters driving their hybrid cars and seeing An Inconvenient Truth (I s**t you not, this is in the movie) and their silly solar panels. Who ever heard of that working really well?\n\nAll of this could, potentially, really be just a put-on of such a magnitude that I would want to shake Nguyen's hand for pulling off such a feat. But, no, Nguyen took himself very seriously during this production, only slightly changing his tune after the fact of people seeing the film like the audience in The Producers seeing \"Springtime for Hitler\" for the first time (if you need proof, look at this NY Times article quote: \"I never went to film school,\" Mr. Nguyen said. \"But I did go to what you'd call the film school of Hitchcock cinema.\"). I'll give him that he had persistence in getting the film out there, even showing it in bars around the Sundance film festival when he couldn't get in. The masses of sober people puking all around him should have given him a clearer idea of what he had though.\n\nOh, don't get me wrong, Birdemic is absolutely, hysterically, historically, gloriously funny. It's a magnificent fresco of horrible CGI (the birds just float, like a screensaver), and non-existent acting, and plot that... wait, what plot? And who needs an ending that makes sense either, or shots that match up? It's so funny that I ended up feeling just a wee-bit guilty by the end. It's easy to mock this movie, like a bully on the playground mocking the kid with Cerebal Palsy. If the film isn't an intentional anti-film, then it's just a really bad Manos/Ed-Wood level movie, and all of the hilarity that ensues from it is kind of expected. It's not even worthy of Asylum DVD status. Alongside The Room, After Last Season, and Severed Ways, it's one of the real no-budget bad-movie finds of the past ten years. A must-see, for every wrong reason imaginable."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "maggeboiii",
        "review_rating": "1",
        "review_title": "I felt my brain melting and eyes aching",
        "review_detailed_main": "When a movie starts with music that grinds your ears, standard movie- maker font, 10 minutes of random shots from the valleys of Hollywood and an unknown B-movie director that claims he's the \"master of romantic thrillers\", you know you're in for one hell of a ride.\n\nI don't really know if this movie is a joke or not, if they actually went in full force with the intention of actually making a great film with their 10.000 dollar budget, clearly they did not. When the actual film starts, the camera is so horrid I thought the cameraman was drunk, or if I was unwillingly intoxicated. Anyways, I had to check my earphones after a couple of minutes, because the sound suddenly stopped and popped up at random, looks like the sound-mixer of this movie probably is deaf or some sort of modern day Hellen Keller.\n\nLet's say something about the acting.. if there is any. I felt my heart wrenching when the protagonist started reading his lines, his act is already so wooden after two minutes of screen-time he'd fit right in the Ents from the \"Lord of the Rings\"-trilogy. When an actor can't even walk straight without showing signs of having something rectangular shoved up his rectum, there's something wrong.\n\nAfter about 45 minutes of clapping (yes, see it for yourself), a love story that makes the Twilight-saga seem like \"The Notebook\" and \"Titanic\" combined, dialouges that are from another planet and all-in- all all I'm thinking: Is this movie the \"Shock and Terror\" the sub-title proclamates? 'Cause I haven't seen a f*cking bird yet!!\n\nWhen the birds arrive.. No, I don't even care to write about it.. I feel ashamed of myself. I feel like laying down in the shower with my clothes on and cry while the cold water is running on full.\n\nThis movie basically makes Tommy Wiseau's \"The Room\" seem like the new \"Schindler's List\". Enough said."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Natejitsu",
        "review_rating": "1",
        "review_title": "Where Do I Start?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "claude6543",
        "review_rating": "",
        "review_title": "Unbearable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "akuma634",
        "review_rating": "1",
        "review_title": "The worst movie of the decade and probably the most preachy",
        "review_detailed_main": "I just got done watching Birdemic for the first time, I knew it was made on 10,000 dollars and it is regarded as one of the worst movies of all time. This same day I also watched The Happening and The Crawling Eye (MST3K version) so maybe I was feeling masochistic. This movie was all around bad in every aspect. It looks like it was shot on a fairly cheap digital video camera and it's obvious that the sound was recorded from the microphone built into the camera instead of a boom mic. I know that because the sound is very awful, the actors have to be pretty close to the camera to be heard right, and there's way too much loud background noise which in post production they played a lot of public domain elevator music to drown out the background noise. The worst audio issue was when they film on the beach because the sounds of the beach are 5 times louder than the actors voices.\n\nThe movie itself is very slow paced, the first half of the movie is just the main guy meeting his dream girl and building their relationship. The problem is that nobody in this movie can act and the writing was pitiful so what we get are very bland characters, not even vanilla more like tofu bland. We get no reason to care about these people in any way and to make them less likable the main guy has to talk about solar panels, hybrid cars, global warming, and even the war in Iraq as much as he can. The script is almost a love letter to Al Gore. This feels like an eternity where it goes from his boring job that he is way too enthusiastic about, his obsession with a greener world, and his dates.\n\nThe second half of the movie is when the birds finally go on a rampage. Lots of 2D computer generated birds that fly around in circles and attack their prey by hovering in place while moving their wings up and down and making the same noise looped over and over the whole movie. Somehow these berserk eagles can set house on fire as well as kill people in one swoop. The couple ends up meeting another couple who lets them ride in their van, this van has everything from handguns and two AK-47 assault riffles with unlimited ammo (I'm guessing the van has Game Genie,) as well as medical supplies, and anything the plot requires. Most of the movie has these people gunning down birds and searching for survivors. The survivors they meet all have long boring monologues about how it isn't the eagles we should be afraid of, it's global warming and mankind's use of fossil fuels that is responsible for this disaster.\n\nAs far as the action goes, it's about as lame as the trailer makes it look. When someone dies it's just a bird hovering in front of the person and they fall down with blood make up on them. There's also some really pointless scenes there just to raise the body count like a man who pulls a gun on them (even though they still have an assault riffle that they seem to forget about for the rest of the movie)who wants their gas, which they say cost them 100 dollars a gallon. There's a whole lot of nothing interesting going on. At least companies like Troma can take a 10 cent movie and throw in lots of nudity, over the top gore, and comedy. The people behind Birdemic have the worst CGI effects since the old Star Trek movies and long speeches about the environment. If you watch it, bring some friends and laugh at it because it works in that regard. Other than that it's Duck Hunt: The Movie."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ptkepler",
        "review_rating": "1",
        "review_title": "This movie is beautifully bad.",
        "review_detailed_main": "This is one of my favorite movies of all time. I do not mean that it is a good movie, as it is one of the worst movies ever made. However, the magnitude of this movie's failure makes it a truly original experience. Birdemic Shock and Terror puts your mind in a place between awe and crying from laughter. No other movie, even ones with comparable ratings , can compare to this movie. This movie pulls off awful in such a way that blows your mind. After you watch this movie, you will be left speechless for almost a 1/2 hour just trying to comprehend what you just watched. It is truly a one-of-a-kind experience that I feel everyone should have."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Top Forty Things I Took From Birdemic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Hinosan417",
        "review_rating": "1",
        "review_title": "really awful, but strangely entertaining",
        "review_detailed_main": "Given that \"Birdemic\" has been blasted by many critics, I think I should say something positive about it to start off with. The scenery of Half Moon Bay is agreeable, for one thing, and Ms. Moore has at least a modicum of charisma; also, anyone who appreciates a stylish blue hybrid Mustang rolling along in a stately manner gets to savor that very sight in many lingering shots. All positive aspects of this film.\n\nLess positive aspects of this film are legion, so much so that I'm reminded of my wish that IMDb.com would allow a vote on a scale from 1 to 100 rather than 1 to 10 (in which case \"Birdemic\" would rate at least a 3 out of 100 for the reasons mentioned, and perhaps a 4 for meaning well (though the message about global warming comes across in a preachy and ham-handed manner)). Still, something about the profoundly amateurish quality of this film makes it feel a little unfair to rate it at all ~ in much the same way that it would feel wrong to grade a term paper on the basis of some rough notes jotted down before writing the paper rather than the paper itself. This film very much reminds me of a rough draft ~ a sort of rough visualization of what the film would have been if the producer had more resources at his disposal (thus making the upcoming larger-budget sequel all the more intriguing).\n\nYet, I wonder if this film might have been less entertaining if it were better made. If it featured better sound, editing, writing, acting, direction and special effects, it might just be a forgettable homage to \"The Birds\"; its very flaws elevate (or should I say depress?) it to a special level otherwise occupied by a few special films like \"The Room\" and \"Manos: the Hands of Fate\" ~ the legendary realm of films that are so bad they're good. So, giving it the benefit of the doubt as a real film and not just a rough draft, I tender my vote of 1 out of 10 and hope that other fans of this film will also give it an appropriately low vote and insure its rightful place on the Bottom 100 (once it gathers the requisite number of votes)."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "wynimations",
        "review_rating": "10",
        "review_title": "i am a bird",
        "review_detailed_main": "Words cannot describe how greatly this movie changed my life. The year was 2014. My legs were gone. My children, somewhere in Ukraine. My wife stolen from me by the Government. Everything was going wrong for me. One day, I decide to rent Birdemic: Shock and Terror. The moment the movie started, my spirits lifted. Its four minute intro of only driving made me forget about my wife and children almost immediately. Then, the first words were spoken: \"h i\" I'd like to pay whoever casted this because they did an amazing job. The audio quality is also the best I've ever seen. Yes, this movie has gifted me the ability to see sound.\n\nContinuing, every word that was spoken inspired me as a person. I also learned, in detail, how to use a gun, which, I now find very helpful.\n\nImmediately after the movie ended, I heard a knock at my door. My legs had returned to me, kicking the door down and attaching themselves to my waist. With this first amazing thing happening to me, I had the motivation to fix everything.\n\nI flew to the White House, killing the president immediately with my bird-like stare. I grabbed my wife from the clutches of his arms and lifted her into the air with my newly grown wings, holding her with my feet. The children were next.\n\nWe soon arrived in Ukraine, my children screaming when they saw me. There were tears in their eyes and they were backing away from shock. They missed me so dearly. I grabbed both and put them in my pelican-like beak, and began flying home.\n\nBirdemic: Shock and Terror is the reason I am still alive."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "zacharybell",
        "review_rating": "7",
        "review_title": "Cleverly Bad",
        "review_detailed_main": "This movie is better at being bad then many movies are at being good. Obviously, it is intentionally a terrible movie, and it succeeds in many ways, making it a decent movie."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "InaneSwine",
        "review_rating": "1",
        "review_title": "A joke, the worst film ever committed to celluloid",
        "review_detailed_main": "First of all, to approach \"Birdemic: Shock and Terror\" with any kind of hope of witnessing a good feature film is utter lunacy. \"Amateur\" is a word a thousand times too generous for this film's description. Even given its low budget of $10,000, the majority of which seems to have gone on car fuel, the film is a joke. The acting is unspeakably bad, the \"special\" effects aren't worth mentioning, the music is corny and inappropriate, and the film's editing techniques have all the marvel of a flip-book.\n\nThe only way to enjoy this film is to treat it as exactly that, a joke. The above faults of the film are so glaring that the film becomes one huge joke that you can laugh along to. However, even this joke wears thin pretty quickly, and you're left feeling quite empty, as if you've been cheated out of 95 minutes of your life.\n\nNonetheless, I am firmly convinced that it is the director James Nguyen who is having the last laugh, as he has created a film so notoriously bad that everyone wants to see it. Perhaps the joke is on us, and the director's intention was to see just how popular this film could be through its infamy. Even so, absolutely nothing can forgive how bad this film really is. It makes Battlefield Earth feel like Star Wars, and makes the special effects of 1933's King Kong look like those of Avatar. It is, quite simply, the worst film ever committed to celluloid.\n\nWatching the trailer, I actually had a decent laugh, and thought it might be worth it. But having watched the finished product, the knowledge that somebody spent $10,000 making this ugly piece of garbage and then having the audacity to call it a film is infuriating, and actually quite offensive. People were PAID to produce this. With MONEY. I still don't believe it."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "JGChind",
        "review_rating": "1",
        "review_title": "A movie so terrible is fascinating",
        "review_detailed_main": "I don't know where to begin this review. It is a film that completely fails at every step of the movie making process. From directing, to acting, to writing, to camera operation, to scene structure, to pacing, to visual effects, to sound editing... The list goes on. I watched birdemic thinking it was a 'deliberately bad so it's funny' kinda movie. It's not. You can see the films director James Nguyan takes himself completely seriously with the global warming message jammed down our throats. I spent the majority of the hour and thirty minute run time laughing in disbelief that this movie exists. It is a film you have to watch, if only to know how to gauge a bad movie in the future. I was just wondering what fundamental error they were going to make next. Overall birdemic is a fascinating piece of work simply because it is truly awful cinema. So terrible that it's unintentionally hilarious. I would absolutely classify it as a must watch."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "CLANZO125",
        "review_rating": "1",
        "review_title": "What the hell just happened to me?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "SnoopyStyle",
        "review_rating": "2",
        "review_title": "really really bad",
        "review_detailed_main": "Rod runs into former classmate model Nathalie. Global warming and blah blah. Birds attack.\n\nHorrible acting. Horrible writing. Badly stilted dialogue. Ill-fitting music. Horrible directions. Long boring non-scenes. Bad special effects. It's hilarious for about two minutes as it smacks your face all at once. Then it's intermittently funny as new levels of awfulness occurs. This is an incredibly bad movie. It's a student film at best. The bad sound design gets annoying. The squawking mixed with planes on bombing runs is as terrible as it gets. I'm comfortable giving this movie one star. The laughs are not generated deliberately. I'm laughing at how bad this is. I do want to give this a pity point. I can't. I can't. One point for the effort. These people tried. They're not good but they tried."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "aredsunrises47",
        "review_rating": "1",
        "review_title": "If you put The Room, Troll 2 and The Birds in a bender",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "knodd1",
        "review_rating": "4",
        "review_title": "Most amazing piece of garbage I've ever had the pleasure of seeing",
        "review_detailed_main": "Shocking and terrorizing is right. I don't even know where to begin. All I can say is it has the worst editing, worst sound, worst acting, worst directing, worst special effects, worst story, and worst ending ever told. However it is by far the most breathtaking failure I've ever seen. It's like watching a work of art by Picasso created with dog poop and vomit under sewage water. Maybe that's what makes it fun to watch because of its honesty in trying to make a horror film with very limited resources. The pacing is atrocious though in that you will finally see the birds attack about 45 minutes through the movie and the birds look like Windows 95 screen savers. The sound editing...it's like every shot you will hear the difference in the background noise and by the time you see them \"firing\" guns your ears will explode due to the intensity of the sound. Forget about the plot because it doesn't even need one. All in all I can say it's a great movie to laugh at even when you are not drunk."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "doctorsmoothlove",
        "review_rating": "2",
        "review_title": "Schlock and Sputter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ironhorse_iv",
        "review_rating": "1",
        "review_title": "This is what happen if 'The Birds' wasn't directed by Alfred Hitchcock, but a crazy fan of his",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "kylegardneryoung",
        "review_rating": "10",
        "review_title": "Who needs a summary? It's Birdemic!",
        "review_detailed_main": "This movie puts Puts Troll 2 to shame and rivals The Room... but I really think this one's the best of the worst... ever.\n\nTo truly enjoy this heap of hilarity, get yourself 5 or 6 friends with a 12 pack each of PBR and have a MOVIE NIGHT DRINKING GAME!\n\nRules:\n\n1. Any time the camera pans, drink.\n\n2. Any time the audio gets botched, drink.\n\n3. Any time Rod walks unconvincingly (that's right... you'll know it when you see it), drink.\n\n4. Any time birds explode, drink.\n\nOf course add your own rules, but sip small or you'll be through all twelve of those cold ones in no time.\n\nDear God this movie is fantastic."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ernstdirk",
        "review_rating": "1",
        "review_title": "How did no one prevent this abomination from coming into being?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "WheelzFourReelz",
        "review_rating": "1",
        "review_title": "Shock and Terror is completely right.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "igornveiga",
        "review_rating": "1",
        "review_title": "So bad and poorly done it's fun.",
        "review_detailed_main": "I got to know this film through brazilian Youtuber Otávio Ugá, in his program \"Os Piores Filmes do Mundo\". And my conclusion after watching this work is what is stated in the title.\n\nAbsolutely nothing makes sense in this movie, plot, music, and of course the special effects.\n\nThe tip I leave is, for those who are going to watch, I suggest drinking a few beers beforehand and getting ready to laugh a lot."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "dockbennett",
        "review_rating": "1",
        "review_title": "Bad as bad is bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Can this even be considered a movie?!",
        "review_detailed_main": "It's hard to imagine that \"Birdemic: Shock and Terror\" isn't at the top of IMDb's infamous Bottom 100 List. After all, it's about the most amateurish and stupid film I've ever seen. Most kids posting homemade videos on YouTube make more professional looking stuff than this terrible mess. Imagine the joy in watching \"Birdemic\" as you see folks act who have LESS talent than middle school students in a school play! Imagine the use of a home movie camera whose sound is only activated when the 'actors' talk--and cuts on and off loudly and abruptly as they talk! Much of it is like a silent movie!! Imagine weirdly askew camera angles, scenes where lines are flubbed and a glacial pace. Yup, all that awaits you if you bother to watch this film! Oh, and lest I forget...there really is NO PLOT through much of the movie!! Yes, despite supposedly being about killer birds, nothing really happens during almost all the film! It's more like they turned on the camera and simply put EVERYTHING in the movie--even when it was completely irrelevant and you could care less about the characters!! So eventually it's saved when the birds FINALLY attack, right?! WRONG!!! The 'birds' are even more lame than stuffed birds on sticks or guys making shadow puppets of birds! You really have to see and hear them to believe 'em! When I say this is a horrible film, I mean that it is monumentally horrible. I am talking WORSE than \"Plan 9\", \"Rat Fink a Boo Boo\" and, believe it or not, worse than \"The Room\"!! Now that's bad!! Now considering that I am a fan of bad films and have reviewed well over 12,000 movies, when I say that this is the WORST film I have ever seen (yes, even worse than \"Manos: The Hands of Fate\") it means something!! Abysmal in every way...so bad you wonder if it was all some joke and never was intended as anything more! To quote Colonel Kurtz, \"The horror....\"!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "keirarts-1",
        "review_rating": "1",
        "review_title": "utter crap.",
        "review_detailed_main": "OK, first off i love bad movies. Hell of the living dead, birds of prey zombie 2,3,4,5 burial ground, nightmare city... OK you get the idea, so when I saw the trailer for birdemic I honestly HAD to see this movie. Finally I got a copy and sat down ready to laugh my ass off, instead I got bored, horribly horribly bored. Don't believe the hype people, this movie IS NOT so bad its good, its utter f*****g rubbish. For over half an hour of tedium I sat there as talentless actor gets in car, talentless actor gets out of car, talentless actor described his successful career in sales, talentless actor preaches enivronmentalism.... then i switched it off. No killer birds, no laughs and i was not at any point entertained this movie was just a complete waste of time and the money used to make this garbage could have been used to feed starving children. If you want a cheesy killer bird movie, watch Rene cardone Jr's Beaks (aka birds of prey) or if you want a great killer bird movie watch Hitchcock's classic the birds, just avoid this like the plague, watching it makes you stupid and the director makes uwe boll look talented."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "chitoryu15",
        "review_rating": "1",
        "review_title": "I don't know what to say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "a-twetman",
        "review_rating": "3",
        "review_title": "Ever heard of \"so bad its funny\"? This takes the concept to a new level.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Enrique_Villa_Lobos",
        "review_rating": "10",
        "review_title": "A true masterpiece",
        "review_detailed_main": "Haters, just haters this movie is a comedy masterpiece, I've never laugh so hard in any movie and I shall thank Birdemic for that!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "creator-84868",
        "review_rating": "",
        "review_title": "Have you ever seen a movie so bad you felt legitimately traumatized?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "wheres_me_pint",
        "review_rating": "7",
        "review_title": "Glorious truth about birds",
        "review_detailed_main": "This film is like if robots made a film about humans and the humans mortal enemy was hovering, suicide birds. So many awkward, strange questions come from watching this film. Who was the r and b singer singing just for them at the bar? Why would you go and eat lunch in an open picnic area whilst under attack by birds? Definitely worth a watch for lovers of the lower arts such as I."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "BandSAboutMovies",
        "review_rating": "1",
        "review_title": "Just wow...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Goodmonica",
        "review_rating": "1",
        "review_title": "A Must-See Comedy!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "adriangr",
        "review_rating": "2",
        "review_title": "Oh my",
        "review_detailed_main": "Almost impossible review as a commercial movies, \"Birdemic\" looks like a home-made project that somehow got a release. Everything about it screams UNPROFESSIONAL!!! From the very basic opening credits, which are in a hideous PC-average font, to the very long and static shots that start too early (before the actors are ready) and go on too long (after the action or conversations have ended), which show no understanding of cutting or editing. From the terrible muffled sound which varies with every camera angle, revealing that there microphone was on the camera and sometimes the background noise drowns out the dialogue, to the script and acting which makes you want to throw things (the lead guy walks like a drugged 5 year old, which is a shame as there are many long minutes of footage devoted to showing him just walking).\n\nAnd then we have to bird effects which look like a screen saver or a phone app. Stuck just on top of the filmed action we see looped animations of birds which can seemingly hover in one place flapping in slow motion.\n\nThe appalling plot sees our heroes spend 45 minutes doing normal everyday things like dating, meeting the parents, visiting restaurants and driving cars before anything happens. Once the bird attacks start, our gang of 4-6 \"survivors\" (apart from all the people strolling about that are not part of the film, and the endless traffic of other cars and trucks that are also not part of the film) seem to make a mad dash from the city (why is not explained) into the countryside (why that's safer is not explained), stopping regularly to buy gigantic bottles of water, armfuls of food and tanks full of petrol, only to somehow have to drink from streams and eat seaweed and a fish caught from the ocean only minutes later, when they can't be more than a few minutes stroll from another convenience store.\n\nYou need nerves of steel to be able to sit through this and call it entertainment. I can only assume this is a home movie. If it is, it must have been fun for the actors and their friends to watch once it was finished, but how actually got to be distributed and sold commercially is a total mystery."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Tibs123",
        "review_rating": "1",
        "review_title": "Drunky Dwarf reviews : Birdemic: Shock and Terror ( 2010).",
        "review_detailed_main": "Waw, just wow. U know that feeling when you're having a conversation and then the conversation stops because you don't know anything more to talk about? That is pretty much the dialog for this movie. U can't call it dialog either, it's like 45 minutes of dead silence. This movie is so uncomfortable, it's more comfortable to watch your grandmother making out with a giant pink furry unicorn with a Justin Bieber face then watching this movie.\n\nThe problem with the acting is that it feels so unnatural. It's like you're watching a bunch of robots who are programmed to walk to this place, then do that. They don't give any motivations for their actions. If u would replace the main actor with a tree, i wouldn't notice it. My guess that they are taken from the p-business ( IMDb is forcing me to censor this word) .That would explain why the bed scene is the best scene in the entire movie.\n\nLet's talk about the plot: there is a guy and he earns a million dollars or something. He meets a random blond girl in a café and he seduces-es her with a creepy smile. So they drive around and they visit her mother, they go to work and visit an Irish pub! Then suddenly........ a random singer sings for them. The bland guy dances the same for 5 minutes. Oh yeah there is something with birds too in the last part. And speeches about global warming , long LONG speeches from the most random people ( a tree-hugger?)\n\nThe plot and the characters are so stupid. Everybody who worked at this movie should be ashamed. The plot makes no sense and the writers , sorry the writer, who is also the director, probably also the editor, producer, sound editor and donut boy, was permanently high. The most random thing about the movie is that when the birds start attacking the main characters, they just go in a random house to see other random people. Then they start riding with their magic car. A car that randomly spawns stuff that they need. \"Oh look, it's a machine gun!\" \" It's a fishing rod!\" \" And there, a AK47\" \" Oh hey, Godzilla eggs here!\" \" OMG , a nuke\" OK maybe those last ones weren't true but if they indeed would happen i wouldn't be surprised.\n\nLet's talk about the biggest problem of the movie. U don't care about the story and neither do the characters and the writer. For example: children just had their parents killed, they don't care, they just want a happy meal? Somebody just died, OK they are sad for like three seconds and then it's OK again. They don't even censor the other cars. It's not an apocalypse when you see everybody driving around. ( maybe the birds learned to drive?) The filmmaker obviously didn't care to make a good movie so why should we care ?\n\nThis is one of the worst movies i have ever seen. Everything about it is bad. The ending is terrible; it is all so bad. If i ever watch this movie again i will puke out birds everywhere. The movie's biggest enemy is not the birds but the director itself ( and the hungry kids).\n\n( Btw : in case u don't know, the special effects are really bad)."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Shockingly terrible",
        "review_detailed_main": "Of course there are movies around that have a so bad it's good factor to them. There is the odd moment that is unintentionally funny about Birdemic: Shock and Terror, but much of it insults you in how incompetently done it all is. The worst movie ever? Might need to think on that one, but if not the worst ever it is easily down there as one of them. Whitney Moore is beautiful and cute, however that's all that halfway decent about Birdemic. It is a very cheaply made film, the constantly choppy editing and cheap shots make it very difficult to like or appreciate the scenery, and the special effects are some of the absolute worst of any movie of recent years. The dialogue is not just awkward sounding but also rambling and heavy-handed, while the story is let down by a very thin structure and interminably dull pacing(in particular the first half-hour is enough to bore the socks off of anybody). The birds feature later on, but they are lacking completely in presence or personality and their attacks are predictable, suspense-less and somewhat too silly also. The characters are completely unengaging, at no point is any effort made to make the audience care for any of them. And the acting is just terrible, Alan Bragh has no charisma whatsoever and looks very ill at ease, while Whitney Moore's beauty isn't enough to make up for her complete lack of acting talent. All in all, may have the so bad it's good factor for some, others will find it too shockingly terrible to enjoy it and the latter camp is where I fall in. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Breadless_Sandwich",
        "review_rating": "1",
        "review_title": "A Masterpiece",
        "review_detailed_main": "This film sucks a giant donkey's wiener; nothing makes sense with meaningless characters, god awful special effects, and don't get me started on the acting - BUT - I love this film simply because I couldn't stop laughing, and laughing, and laughing, and laughing.\n\nIf laughter is the best medicine, this'll heal cancer.\n\nThe plot is something to do with birds or something, I don't really care what the plot is because when I first saw those birds dive bombing into buildings I fell off the sofa and on to the, harder than I thought, wooden floor.\n\nYou may start watching this film and almost immediately give up from the long driving scene and windows movie maker opening credits, but you got to stay strong because before you know it a girl gets killed by a bird while peeing on the side of the road.\n\nIn conclusion - A masterpiece of cinema."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ascendant01",
        "review_rating": "1",
        "review_title": "I am insulted that IMDb only gave this a 2 out of 10",
        "review_detailed_main": "--- A 2 out of 10? I am INSULTED! Clearly this is the absolute worst movie I had to endure in over 20 years and I am positive the makers were trying very hard for a ZERO! And in MY book that is exactly what it got, a BIG F A T zero out of ten. --- I have no idea where to start with this example of a junior high school project that some how got picked up for rental production. The \"eagles\" and \"hawks\", and I use those terms loosely, look like they were stolen out of some 80's arcade video game. Their movement is one dimensional and have no other motion than to exist in the air with wings moving up and down. I have never known the eagles where I live to be able to hover in mid-air facing upward as if on a flag...very curious. --- Maybe I missed the part where someone was identified as an arms dealer, but suddenly the freaky eagles appear around the people and there are screams, \"ooooh,\" \"eeeewwww,\" \"ahhhh...,\" then someone has an idea. I swear I expected a light bulb to appear. The idea goes from thought to action...\"hey, we are under attack by killer one dimensional birds. Here, take this automatic weapon I just happen to have in the back seat and open fire.\" \"Oh yeah and use the thousand round magazine I have in the gun too!\" That is all I can stand to say about it. Oh wait, I just have to tell you to keep your eye out for those attack clothes hangers too. --- This is the first movie that I actually demanded a refund from Family Video over. I thought Alien vs Ninja was getting my waste of space award for the month but then this movie came along and blew Alien vs Ninja right out of the water. ---Alien vs Ninja = 02 , Birdemic = 00. When watched together they earn a solid -01 . Mathematical explanation (+02x00=-01)"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "donburcham373",
        "review_rating": "1",
        "review_title": "worst of the worst",
        "review_detailed_main": "I wish i could give this movie a zero, but too bad it wont let me. this has probably got to be one of the worst \"movies\" (and i use that term lightly) created in film history. this has all the makings on how not to make a film. the dialogue was horrendous and very awkward. the \"special effects\" were very special indeed. they were primarily composed of gifs. the story was complete rubbish centered around a couple for the first hour and then flying exploding birds in the last 30 minutes of the movie. i ended up skipping through the slow parts ( which was 97% of the movie and still got the grasp of what was going on...which was nothing. all in all this movie should be taken as a joke if you decide to watch it or for the poor souls that watched it and now are creeping around the reviews for a good laugh..."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "tjneocleous",
        "review_rating": "10",
        "review_title": "A true masterpiece",
        "review_detailed_main": "A thriller, the likes of which I have never seen before, Birdemic captured my attention the whole way through, from the 10 minute opening credits scene to the gripping climax to the brilliant ending. I grew 6 inches taller, grew a beard, and got a PhD while watching this movie the first time. I have seen the light, I have been converted. I pray to the God of the Birds every day, for He is almighty. Never have I loved a movie as much as Birdemic. The plot is stellar, the audio is unmatched, and the effects are groundbreaking. 10/10 would absolutely recommend. My best friend watched this movie and it cured his cancer. Birdemic is not so much a film, but more of a religious experience. Praise Jesus."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "GManfred",
        "review_rating": "",
        "review_title": "Turdemic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "achimpinspace",
        "review_rating": "1",
        "review_title": "Piece of trash",
        "review_detailed_main": "It's a piece of trash. At the same time, one of the greatest films of our time."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "sarahlexie",
        "review_rating": "1",
        "review_title": "Everyone needs to see this.",
        "review_detailed_main": "You don't need to see this because it's good. You need to see it because all of society needs to collectively suffer because of this. It isn't even a \"So bad it's good\" kind of movie. This is a \"So bad I hate myself for watching it\" movie. But you can't bring yourself to turn it off. For one hour and thirty minutes you sit there in silence wondering if this is actually real and when it's over, you're left feeling angry at yourself for watching it, but also a sense of pride for sitting through this dumpster fire. You don't just watch Birdemic, you experience it. You'll laugh at the special effects, cry at the pain you'll feel in your soul while watching these poor people attempt to act, and leap with happiness when it's finally over and you can proudly say that you made it through Birdemic."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "corrupt_panda",
        "review_rating": "1",
        "review_title": "perfection",
        "review_detailed_main": "Hi. - Hi. - Here's a menu. - Thank you. I'll be right back with you. - Excuse me, miss. - Yes? I don't mean to bother you. What? I feel I know you from somewhere. Really? Yeah, did you go to San Mateo high school? - Yeah, how'd you know that? - I went there too. - So are you from here? - Not really. My mother lives up here but I'm from San Francisco. What about you? San Jose. I remember you now. You were in my English class. - I was? - Yeah, I sat two seats behind you. - You remember that far? - Yeah. So what do you do? I'm a fashion model. And a beautiful one too. Thanks. Well, it was nice talking to you. But I should really get going. I've got an audition for a modeling job. So it was good talking to you. Same here. Nathalie. Oh, hi again. I was wondering if we can keep in contact. Sure. Here's my card. - Here's mine. - Thanks. Again, it was nice talking to you. - I'll see you later. - Bye. This morning flocks of seagulls and crows were found dead in downtown San Jose and along highway 101. The crows and seagulls also caused an accident on highway 101 near the 1st street exit. Authorities are investigating the cause of their death. In other news today, the population of polar bears is declining rapidly due to the melting of sea ice in the arctic. As the sea ice melts, the polar bears are forced to move farther north. Although some have survived, many have died from starvation due to the difficulty of finding enough food such as seals. What does it take to win your business today? Okay, I'll give you that and a 50% discount. Can we close the deal today? Can I place your order today? Great, thanks. We appreciate your business. Hey, what's with all the noise? Caught the big fish. Yeah? How big was the sale? $1 million. - Awesome, man. - Biggest sale of my career. I'm proud of you. Nathalie? Hey, Christine. What's up? I have great news for you. Victoria's Secret wants you to become their cover girl model. You're kidding. No no, it's the real deal. That's great. Yeah, of course I'll do it. Thanks for getting me the gig. You are welcome. You worked very hard. So here's your chance to impress them. Congratulations again. Okay, I'll talk to you soon. Okay. All right. Okay, I'll talk to you later. Thank you again. All right. Okay, bye, Christine. Thanks. Okay. - Hello? - Nathalie? Who is this? It's Rod."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "rayyanx-74140",
        "review_rating": "1",
        "review_title": "I'm in pain",
        "review_detailed_main": "I paid for this film as a joke, expecting something bad but holy crap I didn't expect something this terrible to come before my eyes, they had to have made this as a joke. I can't believe it."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "mdwest-05771",
        "review_rating": "1",
        "review_title": "James Nguyen is his generation's Ed Wood",
        "review_detailed_main": "I caught this movie being riffed on Rifftrax, a new show from the MST3K gang, on Pluto TV. It's the best way to experience this stinky pile.\n\np.s. I wonder if Tippi Hedren sued Nguyen for giving her third billing actors credit."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "davidvkimball",
        "review_rating": "2",
        "review_title": "Laughable.",
        "review_detailed_main": "This film is laughable. No, actually. Like if you want a good laugh with some friends, watch this movie.\n\nA group of my buddies and I were in stitches the entire time.\n\nAside from the humorous aspect of this disaster, I'm afraid there is little-to-no-value in watching this. Birdemic suffers from terrible acting, poor video quality, an annoying soundtrack, lackluster special effects, forgettable characters, and a preachy ending. Not to mention the completely unnecessary amount of gore and sexual themes.\n\nI couldn't tell if the alleged \"environmentalist\" message in this film was part of a conspiracy theory or just a joke...\n\nIt's difficult to find something I actually liked about the film. So I'm just going to end the review here.\n\nJust make sure to add Birdemic to your \"terrible movie night\" movie list and, when you do get to watching it, prepare to shake your head in disbelief at least a few times."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "misharoskin",
        "review_rating": "1",
        "review_title": "Lung exploding comedy! no joke, watch this movie.",
        "review_detailed_main": "Ill start by stating that if that movie claimed it was a comedy, i would have rated it a solid 6.\n\nThis movie caught us by complete surprise. A bunch of friends came by my place to hang out, we got high and and a genius idea popped into my head. \"Let's watch a god awful movie\" i said. I goggled \"imdb bottom rated movies\" and rest will be forever remembered as the day that a 1.8/10 IMDb movie made us soil our pants laughing.\n\nWe literally laughed the entire movie. Every thing in this movie is of kindergarten quality, CGI reminds me of Microsoft Powerpoint presentations i use to make in my grade school days. The audio is sickening and half of the movie you cant hear jack squat because a boom Mic was out of the budget apparently. Everything was just eye-gouging, suicide inducing awful.\n\nWE LOVED EVERY SECOND OF IT, in fact we watched the second movie immediately after the first one, and it was just as hilarious.\n\nPlease watch this movie. get as high as possible if you can...thank me later."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "conn231",
        "review_rating": "2",
        "review_title": "You have to see it to believe it!",
        "review_detailed_main": "I love bad movies and watching bad movies. I was really excited to see birdemic because all the bad reviews I have heard. The first word that was said in this movie pretty much told me what i was in for. At the beginning of this movie I was excited to see a really crappy movie and make me laugh hard. I was terribly wrong. By the first hour I just wanted the movie to end.\n\nNot only the audio was the worst I have ever heard, the editing was a joke, the lighting was awful but besides all that it was terribly boring the first about 30-40 minutes. What i was hoping to see was birds attacking people for the whole movie in really ridiculous ways but in the first 30-40 minutes the movie was just a day and the life of a really average and boring guy. The character's acting didn't help at all either.\n\nNot only was the character boring but I feel like the film could have been only 30 minutes long if there weren't so many shots of useless and pointless shots, mainly of them main character driving! It was just shot after shot of a car entering and leaving a shot.\n\nThe worst part of this movie is the audio. The audio was is the most noticeable part of the movie. There are times when the person isn't talking but they are still talking, ambient sound volume was being changed every other second. It was as if sound mixer brought up audio only when a character was talking then brought the sound back down when they finished.\n\nThe final verdict is that if you are someone that love to laugh at bad movies this might not be for you because its just way to bad, but if you have to watch it then watch it with a ton of people and make jokes during the movie. You will not believe how bad this movie is. Oh and one more thing, prepare for some really lame social commentary over global warming."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "A Truly Awful Film!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "tspenard",
        "review_rating": "",
        "review_title": "Not A Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "dankdad",
        "review_rating": "7",
        "review_title": "Good to watch with friends",
        "review_detailed_main": "It's bad but good, if you watch it with friends it's even better because it's hilarious."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "lemon_magic",
        "review_rating": "2",
        "review_title": "Stinks on ice (and reminds me of \"yellow snow\")",
        "review_detailed_main": "This seeming tribute to Hitchcock's \"The Birds\" is a classic example of what happens when someone with a lot of enthusiasm, but absolutely no talent or film craft (or money) tries to make a movie. It's bad in a way even Ed Wood or Jerry Warren are not; Wood because his love of his dreck somehow shines through in every frame he shoots; and Warren because Warren at least includes lots of stock footage from other, competent films in his concoctions. \"Birdemic\" evinces neither passion or competence - it just borks along long like a piece of outsider art made by someone who saw a movie once and took notes, but then lost the notes and just winged it. (Hah! See what I did there?That lame pun is STILL better than any of the writing or dialog you'll find in \"Birdemic\".)\n\nIt's worth watching once just to laugh at the ludicrous special effects and the amateur hour acting. I have seen dozens of low budget science fiction and horror films in the last 40 years, and I have never seen worse examples of either. Seriously, the bird effects look like the product of a talented seventh grader, and I can't believe anyone over the age of six could convince themselves that what appeared on the screen was acceptable. The director would have been better off grabbing stock footage of bird attacks from nature documentaries and alternating them with footage of the actors (and I use the term advisedly) reacting to them, like the old Tarzan and Jungle Jim movies. And he would have been better off raiding the local high school and community college drama departments for his cast. Nothing against the actual cast members, who were probably just regular folks trying something different, but Lord, they're awful. Reasonably photogenic, (especially the heroine),but awful.\n\nThe one good thing about Birdemic is that it tries to be about something, and it means well. It's dumb and clueless, but it isn't sleazy or creepy, and it doesn't seem to have been made in the spirit of an exploitation movie.\n\nTwo stars, because I'm feeling generous today."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "abogado-05741",
        "review_rating": "1",
        "review_title": "The Movie is A big Middle-Finger! A Shock and Terror!",
        "review_detailed_main": "The Director is such a Dork, Derp and Stupid. Why such this exist? The Cinematography is such painful in the eyes! It's like from the Windows 10 Night Light Feature but much painful in the eyes! Poor CGI, Poor Acting and Most Likely the actors doesn't have a Workshop support! Even the director didn't have at least attend school for directors!\n\nThe movie is true from it's title... Because the movie itself is in fact.... SHOCK AND TERROR! A big Middle-Finger to this movie! Go back to school, James Nguyen!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "epiaggio",
        "review_rating": "1",
        "review_title": "No, please, mum, I'll do my homework twice, but don't play it!",
        "review_detailed_main": "(silence)... I'm sorry, I needed a minute of silence after watching THAT. (Should it be called a movie? I'll look up \"movie\" in the dictionary).\n\nWell, I can't express my exact opinion about it, so I'll summarize like:\n\nOh, my God! Is this a video game? Reminded me of my youth years playing with a Commodore-64. I didn't know how to shoot the birds, though.\n\nI'm not making very much sense, and I'll tell you why. After the minute 37 of the THING, I suffered severe brain damage.\n\nPlease be aware of that. No adult has to see that unless accompanied by a child. Seriously, that thing can make you either laugh just a bit, or cause a brain shutdown. That's what happened to me. I remember seeing some fake birds, and then.. zap!.. Blackout!\n\nIf you look to describe the thing with just one word, you won't be able to. The closest word is \"pathethic\".\n\nDeserves no more. Please, see it with a child to distract you, so you don't end up like meeeeeeeeee, yahooooooooooooooo!!!!!!! eeeeeeeeeehhaaaaaa!!!!! OK, OK, will not happen again. I took my meds now. See for yourselves.......and don't go saying I did't warn you!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "awesomeanthonydavies",
        "review_rating": "2",
        "review_title": "Not so bad it's good... Just so bad it's funny.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "thetmbk",
        "review_rating": "1",
        "review_title": "One of the Worst Movies Ever Created",
        "review_detailed_main": "Rated: 1/10 Rounded to 1\n\nI can't even express how bad this film is. The only reason one would watch this is to make fun of pretty much every aspect of the film. It is so terrible it's almost funny. The animation is terrible, the birds literally float in mid air while barely flapping their wings. The acting is almost as bad as the animation, we won't even talk about it. And the first 50 min. of the film has absolutely no point and doesn't have anything to do with the rest of the film. I've made better films with 3 kid actors, Nerf guns, and a $30 video camera in my back yard... and I have proof. To sum it up, do not watch this movie... it's the kind of movie someone would use to torture a prisoner.\n\nWas this review helpful? If so, check out my other reviews. Or visit my website at: www.tmb2k.com"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "dutch-5-741195",
        "review_rating": "1",
        "review_title": "Was this thing made by retarded school children?",
        "review_detailed_main": "The audio sucks, camera work is erratic, dialog is painfully delivered. Script must have been written in crayon. Establishing shots held way way way too long. Action starts way way too late. Foley is sad, CGI is hilarious.....\n\nWere they trying to kill the art of film? The lack of acting skill reminds me of a 3rd grade Christmas play.\n\nBy FAR the worst movie EVER.\n\nEven the Rifftrax version was hard to watch....\n\nThe only believable actor was the little girl. What is with the fully auto M-16? None of the people in the other cars seem to notice the attacking birds.\n\nTHIS MOVIE SUCKS!!!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "stephen-hare1",
        "review_rating": "1",
        "review_title": "Does anyone know how to erase memories?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "mrgb48",
        "review_rating": "2",
        "review_title": "My God,where do I begin?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "reubenlazarou",
        "review_rating": "10",
        "review_title": "A coat hanger would be my weapon of choice too",
        "review_detailed_main": "Remarkable coat hanger swatting motionness skillage going on. I wouldn't screw with this team even if I was a bird in a tank. I was disappointed that nobody threw the coat hangers though because that would have made for some marvel level action right there."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "aaronglz23",
        "review_rating": "",
        "review_title": "The Room has some competition",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "djmankeewiz593",
        "review_rating": "7",
        "review_title": "the independent counterpart to piranha 3d/Battleship",
        "review_detailed_main": "It's like Piranha 3D/Battleship. Simply put.\n\nFor those unaware, these are bad films, that are trying to make entertaining films out of themselves. To me, that's actually quite creditable. Even though it's laughable, you'll have quite a good time laughing at it. I enjoyed it more as a comedy than a thriller. With that said, I really hope they stick with the same formula for Birdemic 2 but improving upon it all, instead of trying to be like Piranha 3DD, where it's trying to be so deliberately bad that it just ends up terrible film that isn't funny. It's worth a watch to see it since it's so cute trying to be like a fully feature film, it's trying to do what it's trying to. You can find it on YouTube, full film and all, no joke."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "daryahorenko",
        "review_rating": "1",
        "review_title": "Boring, atrocious, ludicrous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Aaron1375",
        "review_rating": "1",
        "review_title": "Any score higher than one is too high for this...",
        "review_detailed_main": "I have seen some really bad movies during my time, but I have to say this one most certainly has some of the worst acting and line reading of any of them. Manos: Hands of Fate actually has way better acting than this thing did. Forget the effects, bad effects can be forgiven; however, when your lead guy sounds like he's autistic and walks in a manner no human being does, that cannot be forgiven. Seriously, how hard is it to walk like a human being?!? You should be doing it all the time! The film also features more parking and pulling out than a whole driving classes video collection!\n\nThe story, well, lets just say it starts out slowly. Super slowly, I mean, the first half of this movie is just watching the lead guy courting the lead girl and going on dates and such. I am being totally serious...you watch them go on dates with the only things hinting at the Birdemic are a couple of newscasts about global warming and a dead bird at a beach. Then after the couple have sex, which we do get to see the lead girl who is cute in her bra and panties, wham, we have birds attacking. No gradual buildup or anything, no the birds are on the attack and hovering at windows screeching. The rest of the film is the hero and his girlfriend stopping every so often to give the birds a chance to attack them again.\n\nI am not sure if this movie was made in all seriousness, I almost think it has to have been made as a joke. Once again, the acting is atrocious, the only actor in the film that seems like a fourth rate actor is the main girl. She could be in a horror movie of higher quality, but that isn't too much of a compliment because there is only up to go from this atrocity! The film also keeps getting heavy handed with environmental messages, but coming from this film makes me want to go out and buy the largest gas guzzling machine possible to drive!\n\nSo, this film is bad, if it was made as some sort of joke I do not know, but I hope so because I can most certainly make a better film even for the paltry 10,000 this film apparently cost. The film starts out as a bad romance and turns into bad nature attack flick about halfway through, but the parking and driving are all throughout the film! It is sad that the only thing good in this film was the lead girl's camel toe!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "dianred-1",
        "review_rating": "1",
        "review_title": "One Of The Worst Movies Ever Made",
        "review_detailed_main": "We rented this movie today (April 9, 2011) thinking that it would be a good movie; we were both surprised at how bad it is. The sound comes and goes from time to time, the picture quality is good, not much for horror scenes, and the birds when they attack looks so fake; like a video game.\n\nWe have seen our share of bad movies but, this one takes the cake; I would not recommend this movie at all unless the person is that bored and willing to watch this kind of cheesy class b movie.\n\nI have noticed that there is supposed to be a part 2 to this movie; I don't think I will be renting it, it's supposed to be in 3D too but, if it's as bad as this one; forget it, I won't waste my money or time.\n\nThis is more of a made for TV movie, but I wouldn't recommend this for TV either; I don't know what they were thinking when they did this movie."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ivanisavich",
        "review_rating": "4",
        "review_title": "First two acts are fun, third is a bore",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "geist-bass",
        "review_rating": "1",
        "review_title": "I've seen better special effects from the 1940's.",
        "review_detailed_main": "This movie actually made me feel like a terrible person.\n\nI'm not even joking. This sh*t was even worse than 'The Exorcism of Emily Rose' which is saying something.\n\nThe acting was worse than anything I have seen before, the audio cut out randomly, and the \"Special Effects\" GOD DAMN, THOSE \"Effects\" WERE TERRIBLE.\n\nI regret watching this crap, I want my life back. And guess what? There's a sequel. And the tag-line? \"You asked for it\"\n\nNo. We did NOT ask for it. We asked for it to be purged from the world, and all copies immediately seized. NOT for another, equally terrible sequel.\n\nOh, did I also mention that the plot MAKES NO SENSE WHATSOEVER?"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "boxman-3",
        "review_rating": "5",
        "review_title": "Very enjoyable trash, though not \"the next Room\"",
        "review_detailed_main": "Birdemic has all the requisite components that make up a delightfully bad movie: bad acting, bad dialog, plot holes, bizarre directorial and script decisions, and extreme awkwardness. For an outbreak of killer birds, everybody seems so resolutely casual about this aviary apocalypse. There is no sense of urgency or danger; characters will stroll in their walks and frequently make outdoor pit stops. One female character is killed after she wanders needlessly far from the safety of the van to pee. They didn't decide that an indoor bathroom would be safer? The gang also decides to wander through a crowded forest, a habitat that might, you know, attract birds. Then there's the careless frolic on the beach, again needlessly far from the refuge of the van. Rod is held up by one motorist for gas (yes, society has broken down that far in hours, and yet you can watch hundreds of cars pass along the other half of the road, foolishly driving toward the birdemic and their doom). But then Rod leaves behind the full gas container and hops back into the van, escaping a not so imminent bird attack. They keep venturing to outdoor areas to escape an enemy that utilizes the sky. They even have a picnic! In short, these people are dumb.\n\nNow comes the inevitable, and somewhat subjective part, where the critic must place Birdemic upon the scale of Absolute Awful ranging worst of the worst (Manos: The Hands of Fate) to the best of the worst (The Room). The people behind Birdemic are trying to streamline the cult phenom process. It premiered in New York City in early 2010 and is already being funneled to many markets. It all feels a little too manufactured for my tastes, like the media is so eager to be ahead of the hipster curve. Birdemic is a perfectly enjoyable, laugh-out-loud experience best had with a bunch of your friends and perhaps some adult beverages. It's a fine piece of derisive entertainment thanks to the sincerity of Nguyen. But in the world of bad, The Room still reigns supreme. Whereas Birdemic has plenty of bad housed in 90 minutes, it's pretty much the same bad decisions and limitations. I look forward to Nguyen's next film, Peephole: The Perverted. You just can't go wrong when a movie has a subtitle, \"The Perverted.\" He may not be Tommy Wiseau, but this man knows how to make some tasty trash."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "adam-cook96",
        "review_rating": "1",
        "review_title": "I would have enjoy eating my own balls more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "gianmarcoronconi",
        "review_rating": "1",
        "review_title": "Embarassing",
        "review_detailed_main": "Let's start by saying that this movie has embarrassing special effects, the acting rehearsals are worse and the meaningless scenes are fineplice."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "TimmyDumples",
        "review_rating": "10",
        "review_title": "Birdemic - Making \"The Room\" look like an Academy Award winning film",
        "review_detailed_main": "If you have any chance of seeing this movie, do everything in your power to do it. This is one of the best \"so bad it's funny\" movies I have ever seen. I saw an encore presentation in L.A. and haven't seen a room of people laughing so hard in my life. It simply has everything one could want. Bad CGI (the animated birds in the movie are actually GIFs!), horrific acting, drunken cinematography, you name it, this movie had it. I typically zone out when watching a funny bad movie, the plot will lull and some things will get boring. But NOT Birdemic! This movie seems to be specifically tailored to ensure you don't get bored! Out of all the things this movie got wrong, keeping your eyes glued to the screen, they got right. Encore James! Encore! Put it this way, this movie is even worse than my sentence structure in this review. Do yourself a favor and SEE THIS MOVIE!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "gengisk",
        "review_rating": "",
        "review_title": "RiffTrax🤣🤣🤣",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ahretz",
        "review_rating": "7",
        "review_title": "People do not understand movie ratings.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "mrpattinson-07689",
        "review_rating": "1",
        "review_title": "Yup! The visionary writer and director is here.",
        "review_detailed_main": "Must watch. You'll be thrilled and horrified by the horror story. Forget conjuring film series, this is the worth watching."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "nathanschubach",
        "review_rating": "5",
        "review_title": "5 Stars for this hilarious cult movie",
        "review_detailed_main": "I couldn't stop talking about this movie for at least an hour after seeing it with 6 of my friends. There's a quality that the movie has that made me laugh uproariously at how awkward the entire movie was. My friend and I were in tears, and we kept cheering for the actors throughout the movie.\n\nThat being said, the movie is notoriously bad. The special FX birds and gore were an afterthought, the sound was either muddled or rerecorded ADR in a studio with different actors, some of the shots went on for way too long, the direction of the actors was jarring and made the characters feel creepy towards each other, the plot is an abomination, and every step these characters take, you're screaming at them as the audience, \"what are you doing?!\" The main blonde actress has been interviewed about the film where she explained that the director would often run out of money and call them back to shoot scenes randomly.\n\nI had a great time watching it, though. My 5-stars I'm giving this goes towards the quality of the experience watching the movie. It's not a good movie, but it's a great cult movie with a misguided, heartfelt message that only the director can understand. And that's fine. Lost Highway and El Topo were confusing to me, yet those movies remain cult classics. Maybe it's the fact we were watching a couple older John Waters films beforehand, but EVERYONE who has streaming video and is on the internet today in 2012 has had to have at least heard the legend this movie has behind it. I think it's worth upgrading the stars on the film to get more of a reputation for how insane this movie is instead of focussing on the lowered quality of the production."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "implaxible",
        "review_rating": "1",
        "review_title": "Truly the worst movie ever",
        "review_detailed_main": "Remember those old 60's sitcoms with the scary rubber bats on wires? The special effects in this one are worse. Even though they are CGI (circa 1993), the superimposed birds look more like paper cutouts than anything else.\n\nThe main gal actually pulls off her role with some charm. The guy, not so much.\n\nThis movie is so cheep (sorry) that they didn't even bother to pay for using stock footage. Look for the \"Getty Images\" watermark on the racing footage during the newscast. And I don't believe the director ever learned the word \"Cut!\". This one far outshines what I had previously considered to be the best worst movie(s) I'd ever seen."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "1",
        "review_title": "Birdemic: Shock and Terror (2010)",
        "review_detailed_main": "As awful as you've heard, but a bit disappointing in its awfulness as it doesn't even try. How can I laugh at something when it never tried in the first place? What is hilarious is the director's deluded idea that this may help the environment. It's littered with painful dialogue such as \"I'm getting a hybrid car\", and a whole scene of the protagonist purchasing some solar panels. It's also painfully annoying, with the same 20 seconds of music played on a loop and just 2 sound effects for the birds. No editing where sound is concerned makes for a film that's hard to understand at times, as dialogue is swamped by background noise. Not funny, not exciting, not creative, just terrible. Pure shite!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ieatyourfamirry",
        "review_rating": "1",
        "review_title": "Bad ripoff of Alfred Hitchcock's The Birds",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "gavin6942",
        "review_rating": "3",
        "review_title": "Terrible, Just Terrible",
        "review_detailed_main": "A platoon of eagles and vultures attacks the residents of a small town. Many people die. It is not known what caused the flying menace to attack. Two people manage to fight back, but will they survive Birdemic?\n\nWhere to begin on this one? The acting (and I use the word \"acting\" loosely) is among the worst I have ever seen, the computer-generated birds are not even plausibly real, and why is there a \"minivan militia\" that drives around with assault rifles for just such an emergency?\n\nThis film makes \"The Room\" look like \"Shawshank Redemption\", but it is really hard to rate. On its merits, it clearly deserves the lowest possible rating (and it is no surprise this has achieved the honor of being on the IMDb Bottom 100). However, much like \"The Room\", it is thoroughly entertaining in its badness. Watching this in a theater full of hecklers and you could have the time of your life. Yet, it even stops being funny in the third act.\n\nThe film has been described as \"Birds\" meets \"An Inconvenient Truth\" (both for very obvious reasons). I am confused by the environmental message... they go beyond the \"pounding it into our heads\" stage -- polar bears, tree-huggers, John Lennon references, solar panels... it is more annoying than anything else."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "luvmycat",
        "review_rating": "5",
        "review_title": "I had the time of my life.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "TKDLion8",
        "review_rating": "1",
        "review_title": "This really could be the worst movie ever made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "janielany",
        "review_rating": "10",
        "review_title": "1/10? Really? These people must be trolling!",
        "review_detailed_main": "I can't believe the number of deceptively low ratings on this movie. Everything about it is just about perfect.\n\nWhen I first watched this movie, the first thing I noticed was the absolutely beautiful CGI, so you can imagine my shock when I saw that that is one of people's biggest complaints.\n\nAlso, the story is an amazingly done allegory for the Vietnam War. The plot of this story is are amazingly deep, this movie is absolutely wonderfully directed, (and I know I Already said this, but it's just that good), The CGI is absolutely beautiful.\n\nEasy 10/10, all of the people calling this a 1/10 must be trolling."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "bensonmum2",
        "review_rating": "7",
        "review_title": "\"I think you'll look great in those lingerie.\"",
        "review_detailed_main": "Birdemic: Shock and Terror was released in 2010. I cannot believe it's taken seven years for this film to finally pop-up on my movie radar. If you've never seen Birdemic: Shock and Terror, do yourself a favor - don't wait as long as I did to catch it. It's a movie that has be seen to be believed. Words cannot do it justice. All at once, it is one of the worst movies I've ever seen, but one of the most fun. Film classes should use Birdemic: Shock and Terror to demonstrate how not to make a movie. Everything you think you've seen done poorly in a movie is most likely done worse here. It's a nightmare. Sound, lighting, cinematography, continuity, acting, and on and on are epically abysmal. It's like watching a slow-motion train-wreck. The two best (or worst, depending on how you look at it) examples of what I'm talking about are the dialogue and special effects. The dialogue sounds so completely unnatural. No one talks like this. It sounds like someone took a foreign language script and ran it through an online translator. And the way the actors deliver these ridiculous lines with a straight face is truly priceless. As for the special effects . . . well, there's really no way to describe them. My vocabulary doesn't include adjectives that can possibly paint a mental picture to adequately describe what's on-screen. You'll just have to watch it to see what I mean. Racking my brain, the only positive I can come up with is Whitney Moore as the female lead, Nathalie. She has more screen presence than the rest of the cast combined.\n\nAs bad as Birdemic: Shock and Terror is, it's still an absolute blast to watch. I can't remember ever having this much fun with a movie that is otherwise so Gawd awful. I laughed so hard at the birds exploding on impact that I had to stop the movie more than once. As I've said ad nauseam, I watch movies for entertainment. And boy was I ever entertained. The first half is a bit slow or I would have rated Birdemic: Shock and Terror even higher. I feel \"good\" about my 7/10 rating."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "PassPopcorn",
        "review_rating": "1",
        "review_title": "Pass the Popcorn review",
        "review_detailed_main": "In 1963 Alfred Hitchcock made his cult movie 'The Birds'; in 2010 James Nguyen took the concept to a whole new level. Birdemic is currently the sixth worst movie on the IMDb \"Bottom 100 movies\" list, which is still pretty low. It might just be the worst, most boring movie about killer birds and ecology ever made.\n\nRod (Alan Bagh) is a successful software salesman who has just started dating Nathalie (Whitney Moore), a Victoria's Secret model. As it usually happens in movies, their perfect lives are suddenly threatened by, in this case, killer birds that, interestingly, start attacking them after they've spent their first night together.\n\nThis movie is so bad it isn't even funny. It begins with endless scenes of Rod driving around town and moves onto horribly edited phone call scenes. If you skip the first hour, you're guaranteed not to miss anything except a really bad and boring introduction to the story. I can't understand why was Alan Bagh chosen to play the lead since he is clearly the worst actor of all and even a tree could have done a better job than he did. Whitney Moore, on the other hand, seems to be constantly embarrassed and therefore can't stop smiling.\n\nThe occasionally awkward dialogue is also worth mentioning: the scene in which Rod says that Becky \"is taking a s**t. Nathalie is watching her back.\" is certainly going to be remembered as a screen writing masterpiece. But the Oscar goes to Yeung Chang's visual effects, if you dare call them that. He would have done a better job using Microsoft Paint.\n\nThe music is awful, too. But it's not as relevant as the message of this movie: Nguyen saw 'An inconvenient truth' and thought it would be a good idea to make global warming the cause of the birds' madness, turning this movie into a bad horror with elements of ecological propaganda that nobody cares about. It actually makes you want to go and burn down a forest, just to make Nguyen sad. Which leads us to the obvious conclusion that everything in this movie is awful.\n\nRating: 1/10 Read more at http://passpopcorn.wordpress.com/"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "bennylandia",
        "review_rating": "1",
        "review_title": "2008??",
        "review_detailed_main": "i had to put something about this movie, the worst everything is in this movie,the special effects on the birds? are you kidding? i couldn't believe what i was watching! is this made in 2008???? how can they allow to finance this idiotic movie! even ED WOOD JR. must be thinking' \" what's wrong with this people?????????\".OK some movies are bad,but make us laugh for how bad they are, but this one made me freeze just by looking at the birds! now.. i believe i can pick my phone with video camera,tell my 6year old nephew to write the script and call my neighbors, and make BIRDEMIC 2: LOTS OF BIRDS. it will be a BLAST!!!!!!!!!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ymryson",
        "review_rating": "1",
        "review_title": "IMDb needs to at a \"zero stars\" voting option",
        "review_detailed_main": "A bunch of middle school kids could probably write, act, and film a better movie than this, one with better effects and a more consistent sound quality.\n\nThe \"acting\" is unconvincing and wooden, even when you cut the actors some slack for the poor script.\n\nThe business conversations and the pro-ecology dialog are just strings of buzzwords.\n\nThe RiffTrax guys did a great job skewering this horrible movie, but unfortunately you still have to actually watch the movie during the riff."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "meganbuckner-00315",
        "review_rating": "1",
        "review_title": "Just... wow.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "obrosebaystore",
        "review_rating": "1",
        "review_title": "How could you possibly like this",
        "review_detailed_main": "Do you like c.g.i that should be a filter\n\nDo you like robot like actors\n\nAnd do you like talking about global warming every 5 minutes"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "radioactiveeggdoesutube",
        "review_rating": "1",
        "review_title": "Absolutely stupid",
        "review_detailed_main": "This movie is the worst movie I have ever seen. I feel this way because it is basically a ball of crap. Horror Romance Thriller. First of all its not even remotely scary. Secondly, the romance is just dumb. Thriller??? well its not thrilling and I can tell you that much. Instead it should read \"Comedy\" because its so bloody stupid. Its up there with baby geniuses and the garbage pail kids. This film doesn't even deserve a capital letter cause its so stupid I cant even bird to watch it. James Nyguyen. Do you have mental issues, for if you do, then I understand then I understand the ball of crap before me. So you stupid man do us all a favor and don't make another film. Thankyou"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "nath-ace",
        "review_rating": "1",
        "review_title": "Every bit worse than you've read",
        "review_detailed_main": "I am speechless, honestly wouldn't have watched it if it wasn't reviewed so badl. But i wasn't prepared for this. Wow. I hope this was labeled as a comedy! Also what is with the 3 minute still dialogue scenes?"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "lethalmouse-09949",
        "review_rating": "1",
        "review_title": "I think i may be having an existential crisis.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "JoseCarlosPereiraFan",
        "review_rating": "10",
        "review_title": "Birdemic changed my life",
        "review_detailed_main": "Birdemic shows us family comes first and the power of friendship is very important. We need Part 2!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "adamelshafie",
        "review_rating": "",
        "review_title": "Most beautiful movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "cannabinosa",
        "review_rating": "6",
        "review_title": "I like it",
        "review_detailed_main": "I am coprophagic and i like this movie beacause it is a giant piece of s*it!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "MovieMason1",
        "review_rating": "1",
        "review_title": "A Movie So Bad It's Entertaining",
        "review_detailed_main": "Personally, I feel obligated to give this a 1 out of 10, but it feels so hard for me to rate. On one hand, yes it was terrible, but it does fall into that category of it being so bad it's good, just like The Room. My rating just comes from how I'm looking at it as a movie, and let me tell you, it's terrible in just about every category. The acting is atrocious, the story doesn't have a good sense of direction, the characters are lifeless due to the lack of any effort the actors put into their roles, and the effects are just...0/10. But on the other hand, it wasn't boring, therefore, I don't completely hate it. If you're looking for movies that fall into those 100 worst movies lists that you may find out there, then this is a perfect contender. It truly is that abysmal as a feature length production. Things just go unexplained by the end of the film. Why are the birds attacking? It's never explained! Don't expect any answers from this movie. Also, the first half of this movie is just completely irrelevant. I guess I can appreciate it for at least trying to establish the two main characters, but there lies another problem. They're the only two characters that are properly developed. There was no need to show anything relating to their jobs and especially for that to go as long as it did. The plot of the birds attacking is not set into motion until about 40 minutes into the film! So for the first half hour, you're just watching stuff that doesn't need to be there in the first place. But, as I said, it's entertainingly bad, so I would recommend this one if you and your friends are looking for something to crack up at. I personally did not get that experience, as I had no one to watch it with. Just be aware of what I said in order to mentally prepare yourself for the experience that is Birdemic: Shock and Terror."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "robertpimental",
        "review_rating": "1",
        "review_title": "Worse than a 5th-Grader's GoAnimate Project",
        "review_detailed_main": "I could rant on and on about how many balls this thing sucks (in summary, it sucks 6 full ball pits), but I'll just list the cons. 1. I'll just get this out of the way. The birds. They're literally just GIF images panning around the screen. When I saw those birds, I laughed so hard that soda sprayed out of my nose. I'm not joking. 2. The sound. The beginning of the movie sums it all up for you. 3. The introduction. It's longer than the amount of rope you need to fill up an entire planet. And it's boring, too. 4. This cost MONEY. Even if it did cost money, it wouldn't cost 20K. It would at least cost about 3 dollars and a couple Chuck-E-Cheese tokens. 5. The movie constantly tries to tell you about global warming. We wanted to see birds (wait, after we saw those birds, no we don't), can we get birds for god's sake? 6. This costs money to buy. This should just be one of those things you find on a video website after searching deep enough. To say the least, a GoAnimate project is better than this movie."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "bleeblahbloo",
        "review_rating": "4",
        "review_title": "The best worst movie ever made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "LDonin",
        "review_rating": "2",
        "review_title": "Guide to an Enhanced Watching Experience",
        "review_detailed_main": "So here, I'm gonna tell you how to truly experience this masterpiece on a transcendental level. Birdemic is one of those movies which are so extremely bad that it ends up being funny, the production quality, cinematography, audio, acting, and pretty much all about it is so bad that it makes up for a great movie to watch with drunk friends, even more if you enjoy subjecting them to excruciating pain and despair, I mean the film is basically and established joke nowadays so there's no point on me talking much about it. So here are the steps: 1st: get some friends, they're essential to the understanding of this monumental work of a mind so advanced we can't understand it yet. 2nd: Get as drunk as you possibly can, this way you will be able to get passed the first 2 seconds 3rd: watch your friends slowly starting to hate you as the movie goes on. and that's about it."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "sedlakandrew",
        "review_rating": "3",
        "review_title": "Champagne comedy",
        "review_detailed_main": "The review title has been shamelessly stolen, just like the animated bird clipart in this film(?)\n\nIn all honesty, this 'movie' was 500% hilarity and pure entertainment. Everything is ramped up to -11, making is so bad, it's worse. Great to view with a few drinks and friends.\n\nRent it or find it free on a certain popular streaming site."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "lenhardtct",
        "review_rating": "2",
        "review_title": "Worst Movie",
        "review_detailed_main": "This has to be the worst movie I have ever seen, and I'v seen Monsturd and Mega Piranha. The only reason I've given this film 2 stars is because the chick is hot. It is impossible to give a film a zero on IMDb. Some advice when watching the film. Do not eat or drink while the movie is playing, I almost choked after the first line. The audio is so bad. You could seriously die if you are not careful. I could not get drunk enough while watching this because I was afraid of dieing. I wanted to pull out what little hair I have left and just scream until I pass out or die. If I would have watched that while hammered, the room I was in would have been utterly destroyed. I was screaming so much during this film, not because it was scary, but because it was awful. No idea how it got picked up to be distributed, I even bought it on Blu-Ray."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "mkcross",
        "review_rating": "3",
        "review_title": "Shock and Terrible Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Al_The_Strange",
        "review_rating": "3",
        "review_title": "Birdemic review",
        "review_detailed_main": "Well, I went into this expecting some all-out \"so bad it's good\" charm, but holy crap! Children can make better films than this! The story is abysmal. It spends nearly forty minutes on the lamest and most un-dynamic love story ever filmed. When the \"birdemic\" finally hits, there's no good reasoning or explanation for anything (and certainly no explanation for why all the birds leave at the end). It's all blamed on global warming. Yep, then the film goes on to shove global warming into the audience's faces at every turn. Because, apparently, it will cause birds to freak out and turn into GIF files that zoom along with airplane sound effects and can spontaneously combust.\n\nThe actual bird attack is the lamest thing ever committed to film. The birds are so cheap, and they tend to hover in place and incessantly repeat the same stock sound effects over and over again. They go on to dive-bomb everything and explode in cheap-looking explosions.\n\nActing? Terrible across the board. Writing? Just as terrible. Production? This film was probably made with pocket change. Filming? So very pedestrian. Sound quality? My God, the sound was the worst. It kept cutting in and out, with dialogue and sound getting cut off randomly. At first, I thought the disc was screwed up.\n\nThere are some scenes that go on for far too long. The beginning credits are a hoot; it's like five minutes of nonstop driving and driving and driving, with the same music looping two or three times. Same goes for the film's final shots.\n\nThere's easily a thousand other things wrong with this picture. You can laugh at it. You can pick it apart and pour all your hatred into it. You can get bored and walk away. For the most part, the former applies the best, so long as you are open to such bad cinema and can find enough good humor to take this film as it is. It's certainly up there on the \"so bad it's good\" meter, and would likely supersede most of the films shown on the SyFy channel (take that, Mega Shark vs Giant Octopus!).\n\n1.5/5 (Entertainment: Pretty Good | Story: Awful | Film: Awful)"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "libalibi",
        "review_rating": "10",
        "review_title": "Vietnamese Uwe Boll, lower on cash but higher on stupid/insane",
        "review_detailed_main": "This is one of the rare \"Hey, I just got a camera, let's film something\" abominations that I enjoyed..but I use term enjoyment loosely as this thing is, what I call, an endurance testing vehicle.\n\nIt doesn't quite have the charm of The Room (another home made keeper), but it excels in all of the other trashy movie checklist dogma(s)..absolutely no plot, absolutely no acting, absolutely no special effects, absolutely no directing/editing/sound, absolutely NOTHING. And that is what keeps this boat from sinking brutally as I have yet to find such an inept attempt at recording something. Anything.\n\nIt was interspersed with boring bits and some headache inducing moments. They were worthy adversary but if you can manage to go through them you will be rewarded as I was.\n\nAs a lot of reviewers mentioned, lead character is the funniest. Even the most mundane actions such as walking and talking seem strange to him as he tries to mimic these actions.\n\nAll in all, a must see film, either for laughing at it or watching it in disbelief.\n\nBelongs in Top 5 Bottom barrel (for now)."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "lifelibertyandserenity",
        "review_rating": "1",
        "review_title": "Birdemic a study on why just because you have a video camera doesn't mean you should make a movie",
        "review_detailed_main": "Well I just watched the RiffTrax version of the movie and still wanted to bash my brains out with a 2x4 full of rusty nails. Mostly due to the fact that this movie could be used as a torture device for any human being that is a fan of the cinematic art form known as moving pictures. Their are some movies so god awful that they are fun to watch I.E. Sharknado and The Happening. The main difference between those pieces of dog sh*t and this piece of dog sh*t is that this movie thinks its being artsy and delivering a brilliant subtle world altering message while assuming that the audience has the intelligence level of the week old splooge inside the jeans of a ten year old boy tragically born with fetal alcohol syndrome. The movie proves how dumb it believes its audience to be by making all of Rod's business deals with NTC software end in nice even round numbers like 1 million dollars and 1 billion dollars. Then he creates a company in a week and its immediately financed by the dumbest and or laziest venture capitalist group in the world for a nice even 10 million dollars. Then when literally out of nowhere the Birdemic hits for no plausible reason whatsoever the movie starts bashing us over the head with global warming propaganda that was written by that same ten year old with fetal alcohol syndrome I mentioned earlier. This movie was made slightly bearable by the guys at RiffTrax because at least they made me laugh but this movie has made me hate people named Rod and if ever a Victoria Secret cover model walks up to me I'm running away in fear and immediately relapsing on a lethal dose of Heroin you know just in case she even slightly reminds me of this waste of 1.3 GB that the servers of the world will never get back! Oh and yeah forgot to mention that Rod's girlfriend for the movie is a Victoria Secret cover model because we wouldn't know she was a hot soulless mouth breathing waste of oxygen unless the movie told us she was a model! P.S. I'm also an Afghanistan veteran and they manage to throw a why can't we all just get along line from an marine and Iraqi war veteran which is the only realistic part of the movie Army rules Marine Corp. drools na ni na ni boo boo! (sticks tongue out and makes farty noises)"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "drdipstick",
        "review_rating": "2",
        "review_title": "Terribly Entertaining",
        "review_detailed_main": "Just as the headline states, this \"film\" is terribly entertaining. It sucks major balls, but it's entertaining for the most part, which is why I gave it two stars. You'll likely laugh your ass off at the incompetence this piece of art has on full display."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "cjstickels",
        "review_rating": "1",
        "review_title": "My All-Time Favorite Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "dallasrbriggs",
        "review_rating": "2",
        "review_title": "Angry Birds: The Full-Length Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "foxxesp",
        "review_rating": "4",
        "review_title": "If you want ironic comedy, this is the movie for you!",
        "review_detailed_main": "If you want stupidity and unintentional humor, I recommend this movie to you!\n\nThis movie is unintentionally made for filmmaking students as the textbook definition of how NOT to make a movie. It's glorious and you can definitely laugh at this sheer stupidity.\n\nIt's one of those good bad movies that makes The Room look mediocre in contrast."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "virtuafooty",
        "review_rating": "4",
        "review_title": "Hi, the eagles killed our friends, do you have a phone I could use?",
        "review_detailed_main": "The director starts with a long travelling shot, and we automatically add Kubrick to Hitchcock as directors the person behind this obviously aspires to.\n\nThe first scene shows exactly how far from that he is as he fails to a) get his actor walking like a believable human being, or b) manage 2 seconds of a tracking shot on him without the camera clunkily jumping along.\n\nThat said, visually the film isn't too bad, we get some very artistic and picturesque shots, let down a bit by lingering shots on cars, women, sandwiches and whatever else the director likes.\n\nThe sound and editing is awful, cutting between shots with completely different levels of volume and ambience. I thought it was bad during the early conversations, but the boardroom and then on the beach it got progressively worse, and at times the dialogue is even drowned out.\n\nEverything is super heavy handed, ranging from the constant environmental/anti-war messages to via news reports and dropped into conversations, as well as frequent comments about of money - A hundred dollar fuel, a twenty thousand dollar solar panel, a million dollar contract, a 10 million dollar investment, a billion dollar takeover! I have to say though these both got funnier throughout.\n\nI takes over 45 minutes to get to the actual birdemic, and the CGI is the next level bad you're expecting (maybe hoping for) by that stage of the film. The scene where they fight them off with coat hangers is one of my personal highlights of the film, along with pretty much every death scene.\n\nI will give credit to the female lead, she has a bit of charm, and I find her daily activities of walking, cutting food etc. as believable as her being a model. Beyond that the extras are largely better than the main cast. The young girl in particular has clearly never acted before.\n\nI won't go into more specifics or spoilers as you really need to watch it and be as shocked and entertained as I was. Right, I'm off to watch the sequel!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "TyrantSlaughter",
        "review_rating": "3",
        "review_title": "Very poorly made movie, yet at times humorous.",
        "review_detailed_main": "Make no mistake, this movie is painfully bad. It has a horrible camera, very bad acting, not so special effects, abysmal sound, etc. But if you're able to endure the movie, I'm willing to bet you'll have a few laughs at the movie's expense (like the clapping scene). I did, which is why I'm giving it three stars instead of one. I don't regret watching the movie, but I don't see myself wanting to watch it again.\n\nThe birds are the same two poorly animated models (an eagle and a sea gull), they flap around making the same annoying sound, the guns are obviously air soft guns, the birds only have about 2-3 dying animations. The dialogue is painfully bad. I question whether it was done and shot purposely like that in an attempt to be humorous.\n\nThere also may be an underlining message that global warming may be a serious concern to our planet, but the movie was too stupid for me to actually care."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "the_zohn",
        "review_rating": "1",
        "review_title": "'The Room' It Is Not ...",
        "review_detailed_main": "... but this is another film that is just so profoundly awful in every way, shape and form that it is an absolute must-see for anyone who appreciates such things.\n\nTrust me, if you sit down and watch this cutting room floor crap, you'll be saying, \"One million dollars!\" and drawing hysterical laughter from anyone else in the Birdemic coterie."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "bth31383-1",
        "review_rating": "10",
        "review_title": "absolutely hilarious",
        "review_detailed_main": "purely awful... In the words of Jodie Foster (while crying) \"There are no words...they should have sent a poet\" to describe the depths of this atrocity. It's so bad it crosses from the realm of terrible into ironically good back into terrible again and then finally making a stop at vomit inducing hilarity.\n\nOH and if you wanna make the movie even funnier. Go to Rifftrax.com and download the audio supplemental track. (They are the writers and stars of Mystery Science Theater 300)... its cheap and i guarantee that if you find this movie to be funny then you will love this audio track.\n\nif you need anymore recommendations for shitty movies just send me a message though the IMDb site."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "maxastree",
        "review_rating": "2",
        "review_title": "Sorry, but except for some preaching, it just doesn't happen.",
        "review_detailed_main": "I had an inkling that this film would scale the heights of hilarity that Tommy Wiseau's film \"the Room\" did for so many people - but boy was I WRONG.\n\nThis movie is TERRIBLE, it's not a botched, unintentionally funny film, it's just a bad student/amateur project, complete with shots that aren't locked off (they couldn't afford, or didn't bring a tripod), terrible special effects (they couldn't afford, or didn't learn how to make passable CGI renders), and appalling, stilted performances. (They couldn't afford, or didn't have any friends that could make for an appealing, watchable gig on screen. Not even some local guy from an amateur play or standup show that turned out pretty good. No one.).\n\nOK wait: to be honest, Whitney Moore (the pretty girl that appears in the film) does have a natural on screen presence, and given some worthwhile dialog, could be described as \"an actress\". No-one else in this film earns such a description.\n\nBUT WHAT'S IT ALL ABOUT?? I hear you ask. UM, a guy that's come into some money via a stock option following his tech companies upscale takes a pretty girl he used to know in high school on a date. Not long after, giant deadly \"birds\" attack from above, murdering random people, making \"Birdemic\" something of an entry in the \"zombie apocalypse/dystopia\" genre.\n\nExcept not really, because there's only about 22 birds in the air in the entire film. It's initially hilarious because the visual effects appear to have been done by a fourteen year old with an intellectual disability on some very outmoded Adobe software. The ineptness of director Nguyen's ability to get depth in a shot, continuity or an error-free soundtrack is overwhelmingly apparent throughout.\n\nIn hindsight, some of the absurdity of the film might strike viewers as funny, but wading through ninety minutes to appraise how bad it was isn't really cooking my boat. Seriously, this is the 2010's and people make 1.40 YouTube clips with more hilarity than this entire production.\n\nI have one caveat for this film: in two places, random characters that don't fit into the story appear to deliver bulky, unwieldy bits of dialogue concerning sustainability, ecosystems and the threat of global warming. This alone doesn't really save the picture from being 90% terrible filler and generally an embarrassment.\n\nSome people think failure is inherently hilarious. Such people are referred to as \"dorks\"."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "briancham1994",
        "review_rating": "2",
        "review_title": "Almost hilariously bad",
        "review_detailed_main": "This film is terrible but at least it's almost funny at the same time. The scene with characters fending off bird GIFs with coat hangers is the peak of cinema."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "miskatonic-37477",
        "review_rating": "1",
        "review_title": "\"The key to the truth of primordial universe\"",
        "review_detailed_main": "This movie really made me think. I have to admit that this is the 2nd movie which makes me think about \"What am I looking at?\" and \"Why am I looking at it?\". I just literally can not describe the feeling of watching this film, or should I say, can we really call it \"a film\"? There are several things in this film that are beyond my comprehension of the world: 1. After Effects. They are just too.. um, transcendental. 2. Acting Skills. They seem to be afraid of something, something deeply inside them, so they need to control their emotions. 3. Distribution of the lengths of the scenes. I did believe that most of the scenes in a movie are somehow important, at least they give the viewer some sort of information. But in this movie, my knowledge did not apply and I tried my best to figure out what is the information behind the scenes. However, I totally failed. Well I must not think further. This movie is taking down my sanity. If I continue to think about it, my knowledge of the whole world would definitely collapse and I would see the truth guarded by those ancient beings."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "zacharybloss",
        "review_rating": "1",
        "review_title": "I've seen better things come out of a High School Classroom",
        "review_detailed_main": "This movie makes you realize how good the Room is."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "jhansell-89168",
        "review_rating": "1",
        "review_title": "Watch it, but it doesn't deserve your respect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "simen-96-729530",
        "review_rating": "1",
        "review_title": "A must see, Highly entertaining",
        "review_detailed_main": "Where should I start -\n\nThis movie is so poorly made, it's an artform. Of course this has been done on purpose; but It is not easy to make something as poor as this movie.\n\nIt is highly entertaining, I haven't laughed this much watching a movie ever.\n\nThe animated clipart birds, explosions and the other effects - (cut and paste) is simply incredible. The story line, random politics, romance, the dialogues, the acting... so incredibly poor; How did they do it?\n\nConsidering it is so poor, it is so entertaining I wanted to give it a 10 out of 10, but that would not be fair, as this is the worst movie ever - and doesn't deserve to lose it's pole position at the IMDb bottom 100."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "refinedsugar",
        "review_rating": "1",
        "review_title": "Where's Becky?",
        "review_detailed_main": "When it takes 47 minutes for the killer birds to appear in a movie called 'Birdemic: Shock and Terror' (it's only 90 mins long) you know you're in trouble. A \"so-bad-it's-good\" flick that can't be unseen. Unintentional laughs, $2 production values and \"visionary\" director / writer James Nguyen who allowed this film's success to go to his head.\n\nEveryday guy Rod (Alan Bagh) has it all going for him. Closes a big deal at work, gets a huge bonus and starts going out with blonde \"fashion model\" Nathalie (Whitney Moore). When he's not playing basketball, eating out, dancing in clubs with her, driving his car or watching the news - he thinks about the environment & solar power energy. Then birds start attacking putting the world into a post apocalyptic mode for survival.\n\nStilted acting. Horrible \"special fx\". Guerilla filmmaking. Daft sound quality in spots where you can't ever hear the dialog. Laughable green screen work. Camera shots that go on for way too long. A cornucopia of awfulness. Cringe levels. Get your head in the right place before watching 'Birdemic' because you're going to need to come correct."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "verjoyce",
        "review_rating": "1",
        "review_title": "So bad it's...still bad but it's really funny!",
        "review_detailed_main": "Birdemic is a masterpiece....I think.\n\nEverything about this movie is wrong Just...wrong. The plot makes no sense, the acting is extremely wooden and the male lead can't even walk right! The male actor is so bad I'm not sure how he even go a part in any movie. He's just so terrible! He acts like how I would have aced in my kindergarten play. I think they found him in some kind of special Ed class and put him in the movie. The female sucks too. When you think it couldn't get any worse (Or better) than the birds come out! Damn. This is a must watcfh, but only for people who can really enjoy it and find it funny. Or again, just watch with rifftrax."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "idespiseweakness",
        "review_rating": "10",
        "review_title": "A Masterpiece.",
        "review_detailed_main": "To call Birdemic a work of art would be to rob it of its transcendence. Birdemic has redefined human accomplishment; redefined it so thoroughly that I feel a slight sense of disappointment whenever I'm watching something that is not Birdemic. I would pay anything to recapture the feeling I had when I watched this movie for the first time. It's indescribable.\n\nThe main character, Rod (Alan Bagh), is a computer guy who falls in love while saving the world. The viewer gets a sense of every part of Rod's life, from the nuances and specifics of his computer job to the wild, romantic passions coursing through his veins, to the desperate urgency that only comes when the fate of humanity rests on your shoulders. Every syllable of Rod's dialogue is another perfect note in the melody of this national treasure, written crisp and sharp, delivered with gravitas and precise comedic timing. The fact that Bagh has not received some kind of recognition for his performance speaks volumes about the snobbery and despicable self-congratulatory nature of the various modern film academies.\n\nThe plot is beautifully conceived and executed. Exploding acid birds are attacking humanity because they don't like cars, and Rod happens to be in the position to stop the madness because he meets a wise scientist who understands what's going on. Look, the specifics aren't that important. What's important is that the plot makes a lot more sense -- more sense, in fact, than any movie I've ever seen. There is not a single plot hole or inconsistency to be found.\n\nThe cinematography is breathtakingly beautiful and the animation puts Hollywood blockbusters to shame. The movie conveys its thoughts on such topics as environmentalism, corporatism, relationships, human connection, and knowledge with a poignant elegance that is almost shocking. The film made me laugh, it made me cry, it made my skin crawl, it made me feel emotions I've never felt before, emotions I never knew I even had.\n\nEvery human being, regardless of circumstance, needs to watch this movie."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "nard-82965",
        "review_rating": "1",
        "review_title": "Birdemic: Shock and Terror is Shockingly Terrible",
        "review_detailed_main": "Anyone who watches Birdemic will most likely feel completely baffled by its existence. They will wonder who made this and why? Most importantly they will wonder if anyone working on this movie even tried. Birdemic has so many problems it makes the audience wonder if it is a joke. The laughably unrealistic special effects piled upon the underdeveloped plot and stiff acting makes the movie hilariously unrealistic and seems more like a comedy than the horror movie the director, James Nguyan, intended. The plot is basically that of The Birds. Birds go crazy and attack people for no apparent reason, except they are mad at people for not being environmental and something with bird flu. When they attack people they do so by shrieking while making a plane sound, and suicidally crashing into things, such as houses and gas stations, and exploding. The birds do not actually show up until about half way though the movie, and so many things never get explained. Birdemic starts with the main character Rod (Alan Bagh) driving. It shows him driving for almost 5 minutes, and every other little boring detail from his life, like filling his car with gas. He eventually meets up with an old classmate from high school, Nathalie (Whitney Moore), who turns out to now be a model. He then creepy follows her as she leaves the restraint but she agrees to go out with him any ways. Alan Bagh acts as stiff as a sim, like from The Sims 2, as he reacts very robotically to everything, like the way he walks and the way his face appears so stiff and blank all the time. Whitney Moore's acting is average but there is a point where she must have realized how ridiculous the whole movie seemed because at one point when everyone is trying to fend off the birds you can see how hard she is trying to not smile or laugh. The special effects might be the worst part in the movie. The birds do not even appear a little realistic. When on screen they stay in the same spot, squawking and occasionally flapping their wings, and then when the camera moves the birds move as though they are stickers stuck to the same spot on the lens. When the movie shows fire it looks like a fire started on the film instead of the intended target burning. The camera work is poorly done. In the beginning while Rod drives the camera records at a sideways angle. The film and sound editing in the movie is terrible too. The first line spoken in the movie is where the first problem appears. It is a simply a waitress saying \"hi\" but it does not meet up with her talking and there is static audible in the background. With the film editing, multiple times the film will randomly jump skipping a few lines of dialogue. Overall this movie does not have many, if anything, good in it. I do not know they made it. Honestly I wonder if they realized how bad the movie was when they were making it. The only reason I think anyone should, could, or would watch this movie is to enjoy how delightedly terrible bad this movie is in every aspect."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "nivkehr",
        "review_rating": "1",
        "review_title": "The best \"so bad it's good\" movie I've seen",
        "review_detailed_main": "The acting, audio, storyline, cgi, basically anything about a movie you can name... it's terrible, but did that stop me from enjoying the movie? Not one bit. I'd you're looking for a good movie to laugh at the atrociousity of, this is a good one."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "onasivart",
        "review_rating": "1",
        "review_title": "Beyond Painful",
        "review_detailed_main": "I found myself moaning and groaning and writhing for the first 20 minutes of watching this torturously embarrassing assault on my emotions — not because it was shocking or terrifying, but because it inadvertently contained every possible characteristic of bad filmmaking. The only reason I stopped suffering was because I began fast-forwarding. The only good things about this \"film\" were seeing locations that I recognized, and seeing a few attractive actresses in bikinis. Thank God they didn't do any nude scenes. These poor young ladies would have lost chunks of their souls had they exposed themselves for the sake of absolutely the worst cinematic creation possible. Watching it made me ashamed to be human. I knew Birdemic would be bad, but I thought it might be fun to watch a cheesy horror film. It wasn't. And I know you will think that what I'm about to write next is an exaggeration, but I swear to you it is not: I recently got a molar pulled in the dentist's office, and this experience was far more enjoyable and far less painful than watching Birdemic. In the words of Joaquin Phoenix's character in the movie 8MM, \"There are some things that you see, and you can't unsee them.\" Don't let Birdemic be one of them."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "silverlynx-79590",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "The only positive about this film is that it gives you a newfound appreciation for the most fundamentals of film and cinema.\n\nThings like scene continuity, framing, sound quality, voice synchronisation, corpses not moving, acting which would at least pass 8th-grade drama class.\n\nIf it had been a half-hour shorter I'd recommend it as being \"so bad, it's good,\" but as it is, nobody aside from film students should sit and watch this."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "fasulloa",
        "review_rating": "1",
        "review_title": "Awful, boring load of truly amateur filmaking",
        "review_detailed_main": "My only regret is that I couldn't give this film 0 stars because it really doesn't deserve anything. After seeing a number of flicks making fun of this film I decided to see the whole thing & I truly regret it.\n\nThe Acting was awful, the lead character's only attribute seems to be the ability to stare at his crush and exclaim stupid lines with a bored face.\n\nThe directing was just as bad, pretty much nothing in Birdemic makes any sense what-so-ever and even saying that is a complement.\n\nThe special affects were truly abysmal. In fact the original classic the birds despite being mad many, many years before still has birds that are a trillion times more realistic that the trash in this film (and no that wasn't an exaggeration) They probably would have been better off using kindergarten drawings of chickens than what they used in the film.\n\nNo matter how unbelievably bad that was, the editing was the worst part of all. In fact I wouldn't be surprised if they didn't have an editor at all and just used every second of footage they shot. Endless boring scene takes place after endless boring scene, half this movie is the main character driving around in his car! The sound is just as bad, I've seen and heard better from 0$ budget High School films than this.\n\nThis movie is unbearably awful and boring, it's not like the room for example which is so bad it entertaining, this is just plain stupid. The Director Nguyen should never be allowed to make another movie, and although the film tries to use the noble themes of humanities dependence on fossil fuel and the need to save nature, nothing can save this. This movie is rightly considered one of the worst of all time, and my advise is to avoid it."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "QueryVillain",
        "review_rating": "1",
        "review_title": "Worst movie ever, that you MUST watch (So bad it's good)",
        "review_detailed_main": "This is probably the biggest disaster in film making history ever. Plot is boring and doesn't make sense for the most time, acting and dialogue is atrocious and I could probably make better CGI using some free apps on my phone.\n\nBut... It's brilliant at the same time. Well brilliant if you enjoy such disasters as Troll 2 and The Room (2003). This is by far my favourite movie in \"so bad it's good\" category. And the best part - they were dead serious when making this. I still have a hard time believing that, but it's a fact. I don't want to spoiler anything by mentioning some of the best parts in this masterpiece, just watch it yourself.\n\nBy the way trailer is just a tip of the iceberg. By watching this I guarantee you - you haven't seen such comedy (although it wasn't meant to be such)"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "hotrodps3",
        "review_rating": "1",
        "review_title": "this movie is so bad that is why it is called \"shock and terror\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "m-a-metchi",
        "review_rating": "1",
        "review_title": "A boy meets a girl who is a model and they develop a love relationship. But suddenly a lot of birds attack, and kills many people. No one knows why.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "jokernharleyqpsn",
        "review_rating": "10",
        "review_title": "I want to commit not alive",
        "review_detailed_main": "This movie was the worst thing I've ever seen, that's why I'm going to buy it for my teacher who hates comic sans, and bad camera work"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "YouShallPass",
        "review_rating": "1",
        "review_title": "WORST MOVIE ON THE PLANET",
        "review_detailed_main": "There is so many bad things about this movie, let's start with CGI, Acting skills, audio, camera angels, unrealistic plot. To be continued..."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "toluyol",
        "review_rating": "1",
        "review_title": "This Movie is a perfect example of how to not make a movie",
        "review_detailed_main": "The only people who should watch this are aspiring Directors and School Short Film Makers because It is the best piece of media to tell them how not make a movie.\n\n=The Characters= The characters are really just bland and one Dimensional in terms of personality which means we don't really get to sympathize with them or understand their emotions due to The Primary school level acting on show here. =The Plot= If you told me the plot was not done in one writing session of one random bloke I would call you a madman, since it seems the Director was hey we only have enough of our special effects budget to get some Low Quality Animations of birds and an explosion effect, So he just tried to make a Decent plot but it is obvious that the Writer had some form of Writer's Block which becomes more apparent the longer the film goes on and i really hate the rubishly pushed in Enviromental Message in the movie, that confuses me even more. =Closing Statements= This movie's only advantages is in how poorly it was made, which makes me laugh unironically."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "shadow-cipher",
        "review_rating": "1",
        "review_title": "Offensive to Birds",
        "review_detailed_main": "If birds saw this movie, they would be horribly offended. The birds would start their own birdemic against the birds in birdemic - and calling them birds is incredibly generous - just because of how offensive it is. I could make better bird special effects and I have zero knowledge in the special effects department.\n\nI changed my mind. They aren't birds. They're screeching paper cut outs that spontaneously combust when it's convenient to the plot. Or when the writers don't have a convenient wild animal to make the characters move.\n\nBut hey, at least the fire effects are better than the bird effects."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "cegollie",
        "review_rating": "1",
        "review_title": "my time on the show",
        "review_detailed_main": "Hi guys, im the bird who killed the gas man toward the end of the movie. i know it looks like i enjoyed being there but james ngyuen was very cruel to me and the other cast. the conditions we were kept in were so painful that we needed therapy after. i hope the suffering of us for your entertainment was worth it. im taking out my anger by rating this movie one star. hopefully soon i'll have the birds on my side as well. and then you'll be in trouble"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "makiprettywoman3",
        "review_rating": "5",
        "review_title": "The Must See Worst Film!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "cegollie",
        "review_rating": "1",
        "review_title": "this is a perfect movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "e-esmer",
        "review_rating": "1",
        "review_title": "More than worst",
        "review_detailed_main": "How can they produce a movie like that? It's horrible."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "chadtingley",
        "review_rating": "1",
        "review_title": "Wow. Just wow.",
        "review_detailed_main": "Going into this, I had no idea what I was getting into. After the first lines, I did. This film is so bad, I took notes, I was ready to pick this apart, but then I realized one very important fact. After the final cut was complete and James Nguyen had finished watching it, he had to say: \"This is great, we nailed it!\"\n\nAs a film fan, I have seen a lot of bad movies, now I can say, I have seen the worst movie ever made. This is a movie all true movie fans should watch and then hand the DVD to a friend and say \"I dare you.\"\n\nA brief rundown as to why it is so bad; The acting, I am fairly certain that Alan Bagh got the part because he actually owned the Mustang and they needed a nice car. I definitely was not because of his acting chops. The editing, a high schooler with iMovie could do a better job, even in 2010. The timing, mom's thumbs up that lasts just two beats too long, making it awkward, was painful. The heavy handed message delivery, why not make everyone just carry signs, \"Global Warming is bad!\" Finally, the birds. It starts with the parrots, in San Francisco, and it just goes down hill from there.\n\nIf you have time to kill, and like bad movies, this one does not disappoint, except on every level. But at least you can say, \"Yeah, I have seen the worst movie ever made.\""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "samumemm",
        "review_rating": "10",
        "review_title": "Best movie i have ever watched",
        "review_detailed_main": "Everything about this movie was perfect from the acting to the special effects. i would definitely watch this movie a million more times if i could."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "GojiraVonJinx",
        "review_rating": "1",
        "review_title": "Just might be the all-time champ of awfulness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "HenryBLove",
        "review_rating": "1",
        "review_title": "Good for a Laugh but not much more",
        "review_detailed_main": "Honestly it was one of the worst films I have ever seen. Don't get me wrong I wasn't expecting much in the first place but this film still managed to disappoint me."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "cdaniels500",
        "review_rating": "1",
        "review_title": "Worst Movie I've Ever Seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "turnbull-js",
        "review_rating": "1",
        "review_title": "groan",
        "review_detailed_main": "Birdemic starts out as a love story, with protagonist Rod just trying to meet a nice gull - but when killer birds arrive, things take a tern for the worst. Rod, no chicken himself, proves toucan play at that game - inexplicably arming himself to the teeth and meeting fowl play with swift fury to protect the one he doves.\n\nOn piper it seems like a poor emulation of The Birds, and certainly director James Nguyen seems to be robin certain plot elements from Hitchcock. Whilst I don't want to seem to be mocking Birdemic, poor eggsecution makes this aviary hard film to swallow.\n\nThe dialogue throughout is hawkward, and at times it feels like they are winging it. The cheep special effects are reminiscent of NES classic Duck Hunt, and although they quacked me up they are far from pheasant. The soundtrack is peckuliar at best, and largely consists of long stretches of silence - a cardinal sin sure to ruffle some feathers. Heron there you see glimmers of talont from the young starlings but certainly nothing worth tweeting about.\n\nMigratest suggestion is to sparrow few hours to experience Birdemic with friends, beakause you're sure to have a hoot. At times watching feels like a birden, but endure and you won't egret it. Owl call it one of the greatest trash films I've feather seen."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "eskovan2",
        "review_rating": "1",
        "review_title": "Only watch with Rifftrax..",
        "review_detailed_main": "Only thing I can add about this massive pile of dung is that I saw it on Pluto on The Rifftrax channel. This is about the only way I can possibly imagine sitting thru even a minute of it.\n\nSeriously, this movie is unwatchable otherwise.."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "christianrodier",
        "review_rating": "1",
        "review_title": "The movie that stops at nothing and stays there",
        "review_detailed_main": "40 minutes into the movie and literally nothing of importance has happened. That is all you need to know. This is not to mention the special effects look like they are stuck in the 90s."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "sjbolton",
        "review_rating": "1",
        "review_title": "A good study in everything to NOT do in making a movie.",
        "review_detailed_main": "Not a single aspect of this \"movie\" is done right. Anyone interested in making movies or working in the industry should watch this trash to know exactly what never to do. Being in colour doesn't even help this garbage stink any less. Colour grading/matching is non existant. The characters are one dimensional and there is zero attempt to develope the characters into anything you can be interested in. The lines are delivered flat and lifeless that a text to speech program from the '70s would have improved things. They've been pieced together that its painful to listen to every conversation. All the special effects compositions are so very wrong and sound effects too they draw attention to how they dont fit at all in any respect.\n\nIts clear not even students were involved as zero skills have been used anywhere in the making of this movie, even if it had been made fifty years earlier its just garbage garbage garbage. I'd guess someone pirated a lot of software and decided to call themselves a movie director much like facebook idiots call themselves photographers because they bought a cheap DSLR or paid $2 for a photo filter app in their phone. Skills are needed to make you a producer of anything, not the tools you use."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Mrvictorgomez18",
        "review_rating": "1",
        "review_title": "Can I rate 0 stars?",
        "review_detailed_main": "James Nguyen shame on you, you call this a cult phenomenon?"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "olivernowers",
        "review_rating": "10",
        "review_title": "Tied for the best movie I have ever seen",
        "review_detailed_main": "Why do I want to write the 5th comment on Birdemic? I am not sure - almost everything that could be possibly said about it has been said. But like so many other people who wrote comments, I was and am profoundly moved by this simple and eloquent depiction of hope and friendship and redemption.\n\nThe only other movie I have ever seen that affects me as strongly is Mega Shark vs Giant Octopus. Both movies leave me feeling cleaner for having watched them.\n\nI didn't intend to see this movie at all: I do not like Bird-attack movies and I don't normally watch them. I work at a branch library and one day as I was checking Birdemic out to one of our older patrons, she said to me, \"Whenever I feel down or depressed, I check out this movie and watch it and it always makes me feel better.\" At the time, I thought that was very strange. One day there was nothing on TV except things I absolutely would not watch under any circumstance or things that I had seen too many times already. I remembered what she said, so I watched it. I have watched it many many times since then and it gets better with every showing.\n\nThe allusions to real-life are both subtle and prophetic. Non-stop action combines with stunning special effects to portray the inherent struggle that humans face against killer eagles and vultures around the world on a daily basis; this film might just be the inspiration needed for governments to tackle this global problem.\n\nBirdemic and Mega Shark vs Giant Octopus are the best movies I have ever seen. I do not judge it by it's technical merits - I don't really care about that. I have read that the Shawshank Redemption or The Godfather or this or that movie is the best movie ever made. They may have the best technique or be the most influential motion pictures ever made, but not the best. The best movies are ones that touch the soul. It takes a movie like Birdemic to touch the soul."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "sobiahussn",
        "review_rating": "1",
        "review_title": "I've no words",
        "review_detailed_main": "This film is something that shouldn't even exist. The first hour is absolutely nothing before the birds actually show up; the quality looks like it got filmed by a blackberry prototype and the sound made you think you were going deaf. I promise you this is the longest hour and a half of your life that you will never get back- I'm surprised this was even allowed to be realeased."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "flazerprpz",
        "review_rating": "5",
        "review_title": "MASTERPIECE",
        "review_detailed_main": "I believe this so called terrible movie is in fact, brilliant.\n\nIt´s a low budget movie so they disguise the poor productions with elements of humour. Sure there could easily be a better screenplay, better actors and a better story, but I think it works just fine. I never laughed so hard watching a movie and for that I´m exited to watch the sequel of this movie and hope that they kept the same low budget but hilarious production and direction of this film.\n\nPersonally, i think it´s a movie you should watch with your friends or family so you can comment troughout the film the funniest aspects and make it a memorable film as it should be!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "kurt-w-mathisen",
        "review_rating": "1",
        "review_title": "I've seen better quality toilet seats, dripping in urine compared to this film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "jn_agin",
        "review_rating": "2",
        "review_title": "Shock and Terror indeed",
        "review_detailed_main": "Ahh yes, one of the most famous so bad it's good movies. And boy did this one earn it. Atrocious dialogue, woody acting, and the worst not really sex scenes I've seen in a movie. While this is highly recommended to watch with friends, I will say that the very end gets very tedious. If it weren't, I'd probably gives this more a 3/10."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "esadoff",
        "review_rating": "5",
        "review_title": "Mediocre Bad Movie",
        "review_detailed_main": "I'm a pretty big fan of bad movies and consider myself somewhat of a connoisseur. While this has the hallmark of a lot of bad movies, it's not really that great of a bad movie. When it comes to cinematography, the movie is terrible. The movie is also awful when it comes to pacing. This sometimes leads to amazing scenes, but in this movie, the slow pacing is actually quite boring. Combined with boring dialog this movie misses some of the things that make other bad movies great. Compared to Samurai Cop, for example, there are no crazy lines or monologues like the \"I'm telling these son-of-a-bitches...\". There are some great scenes in Birdemic, like the choppy applause scene, but I got more bored while watching this movie than many other bad movies. It can be fun to watch, but its glaring errors aren't as funny as comparable movies."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "wfc33-155-607512",
        "review_rating": "1",
        "review_title": "This movie proves anyone can make a movie for $100 bucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "leon_saunders",
        "review_rating": "1",
        "review_title": "😢😢",
        "review_detailed_main": "It's the sort of movie you make with your pocket money?? How do you make a movie and step back with pride?? It's a poster movie for everything not to do in movie making!!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ShaunHertz",
        "review_rating": "10",
        "review_title": "10 out of 10 best movie ever",
        "review_detailed_main": "I just want to say that this is the best movie ev- hahahaha - I can't keep this up... to tell the truth, this is not a well made movie but watching it was one of the best times I ever had with my friends. It was so bad that it was funny, you really should watch it with your friends so you can laugh at it together. Because of this movie, my friends and I even started a small group to watch bad movies and laugh. This is definitely the best worst movie I have ever seen. But it was very fun to watch and never got boring because of all the mistakes and the bad screenplay. Not to mention the actors... So thank you Nguyen for your horrible sound editing, absolutely emotionless main character (Bagh) and ABSOLUTELY horrible birds.\n\nYou really did a (horribly) great job. THANK YOU!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "thecriticopinion",
        "review_rating": "1",
        "review_title": "What Have I Just Watched. Jabbing Your Eyes With a Fork is More Fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "LoganWeasel",
        "review_rating": "2",
        "review_title": "Why...Just...why?",
        "review_detailed_main": "This movie made the room look like a masterpiece its terrible acting, terrible set,awful cgi effects,and weird audio cuts during dialouge,I can't find anything good to offer in this film,I actually procrastinated this review multiple times because i couldn't finish the \"movie\",atleast the room has a cult following,but not birdemic oh no this film has a following but its not at cult status thats how bad it is,not to mention the first hour out of the 1:31:10 running time of the film is nothing but pointless sequences that have nothing to do with the film and i swear they used a 8 mm camera to film this,for a 2010 release it has poor visual qualities and the audio OH GOD! the audio you can clearly hear the audio cuts when it alternates between the \"actors\" talking it's choppy and gets very annoying after the first 30 seconds of the film,it has out of context music that makes a car ride look like a super fun adventure to the shire,and how come this apparently abandoned city has hundreds of cars passing by?,and I can't stop thinking about how this movie exist at all,In conclusion This movie should be passed up unless you're a fan of bad movies."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "teeda-22662",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "I found the answer to the question \"what is the worst movie you have ever seen?\""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "jaws1780",
        "review_rating": "1",
        "review_title": "Bore-demic: Schlock and Terrible!",
        "review_detailed_main": "I'm convinced the people who say this movie is \"The best worst movie ever!\" haven't actually SEEN the whole thing, and are only commenting on abridged versions from YouTube clips. This things kinda a bore.\n\nDon't get me wrong. There ARE some (unintentionally) hilarious parts (mostly when our \"heroes\" get attacked by a particularly vengeful Playstation game...er I mean \"birds\") However the GCI atrocities don't even show up until the movies halfway point and only pop up occasionally afterwords. Like many other bad movies, this has massive pacing problems making the film a very dull slog.\n\nSo what do we get while we're waiting for the Winged Clip-Art of Doom to strike? We get an ENDLESS supply of driving and parking scenes that, if cut, would render the remaining footage about 15 minutes long. (And bad driving scenes to boot. These have all the thrill of Driving Miss Daisy, even AFTER the squawking GIFs start attacking.) And then about 13 of THOSE minutes is filled with pointless character after pointless character filibustering about global warming or some environmentalist issue told in that oh-so exciting \"Guess-what-I-copied-directly-from- Wikipedia-without-actually-reading?\" tone of voice. I kept waiting for Captain Planet and the Ferngully fairy to show up and rant about how unsubtle it all is. For the lover in you we even get a turgid \"romance\" between two pieces of plywood...er our heroes (You'll never look at a pumpkin festive the same again.)\n\nBut like I said there are SOME amusing moments to dull the pain, if you like seeing marble-mouthed dull-witted leading man who walk with the limber gait of the Frankenstein monster, plenty of flubbed lines that show that the word \"retake\" is not in directors vocabulary, the most jaded assemble of extras ever (a Birdemic is no reasons traffic in the background can't proceed as normal, right?), inept salesmen who CHEER when they lose one million dollars on a sale, and of course site of our no-talent cast pretending to interact with special (ed?) effects eagles that would look poorly rendered on a circa-1997 Geocities website. But those are just an oasis of hilarious ineptitude in a painfully dull sea of padding. Maybe it's easier to deal with as a group or \"audience\" to share the misery, but otherwise this is slow, plodding mess."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Without a Doubt a Must-See Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Reckno64",
        "review_rating": "1",
        "review_title": "0/10 objectively but since there's no 0 option I guess I'll have to give it a perfect 10",
        "review_detailed_main": "I really couldn't decide what this film deserves. It is absolutely incredible in how it does everything wrong, making it unironically enjoyable. It's bad film-making at its best.\n\nI was more inclined to give it a 1/10 but settled on a 10/10 because of its unsubtle climate change activist message. It was over the top preachy, but since I agree that climate change is real and shouldn't be treated as a joke, I gave it a high rating. Guys we need to act on climate change NOW!!! Even South Park admitted it in 2018!!!!!\n\nWatch this admirable mess of a movie, it will make your day. It is better than a \"boring\" movie ANY day!"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "nuhc",
        "review_rating": "1",
        "review_title": "Attack of the animated .gifs!",
        "review_detailed_main": "I first heard about this movie from my nephew, who told me it was so terrible that I just had to see it. As a fan of bad movies, all I can say is that I wish MST3K were still around so they could lampoon it. Yes, this one is one of the best of the worst movies ever, and should rank right up there with Plan 9 or Manos: Hands of Fate. If you like to watch bad movies, you've got to see Birdemic. It's so horribly bad it's actually got to be seen to be believed. I know that a lot of people call this or that movie \"the worst movie ever made,\" but in this case I have to say that this is definitely the worst movie I've ever seen.\n\nFirst I'll discuss the \"plot.\" Apparently global warming is so bad it makes birds in southern California attack people, even conducting kamikaze attacks against buildings and gas pumps (complete with aircraft sound effects!). Global warming must be really bad when dive-bombing birds explode into flame. Just how hot is it, anyway? And the plot holes are so huge it's a wonder all the actors don't just fall into them. For example, one moment the group in the van is running away and shooting at killer birds, the next minute they're out having a picnic at a state park. The heroine smiling at different points in the movie after the bird attacks. Kids playing with a ball and having a good time while they're on the run from killer birds (and after their parents were killed by same).\n\nThe first 45 minutes or so of this \"movie\" center around the hero, Rod, who finds the woman of his dreams, Nathalie, and starts to develop a relationship with her. For some unknown reason, she is totally attracted to his lack of personality, and they begin a no-conflict relationship. In fact, even Nathalie's mother is totally supportive of her modeling career, even happy that she's going to appear on the cover of a Victoria's Secret catalog. Everything's going great. Rod and Nathalie have an intimate moment in a hotel, and wake up the next morning when the birds start attacking. They find another couple in the hotel who just happen to have a van full of automatic weapons (which is never explained except later that the guy was an ex-Marine), so they go around shooting the birds and trying to help people. The ending is just as confusing as the premise of the movie, with Rod's girlfriend asking a question that starts with \"Why?\" which I half expected her to finish \"did I take this role in this cheesy movie?\" Or perhaps, \"Why was this movie even made?\"\n\nOK, let's talk about why the movie is so incredibly bad. The plot, for one. Secondly, the editing is incredibly amateurish. You could drive a Mack truck through some of the cues. The opening camera shots from the front seat of a car were all tilted so that it looked like they were driving on the side of a mountain. In fact, most internal car shots were slanted like this for some reason. Couldn't they find a cameraman who could hold a camera upright? When characters are talking to each other on the phone, the scene constantly switches back & forth between each character as they give their one or two word replies, which became annoying.\n\nThe quality of the filming is extremely poor. Poor lighting left some actors entirely in the dark on a few occasions. The sound quality was horrendous, dropping out completely at times, and you couldn't hear the actors speaking while on the beach because of the loud ocean sounds. The background music was terrible, and in some spots where there should have been music there was none.\n\nThen, you have to take into account the incredibly horrendous acting from just about everyone in the movie. The lead character walks like he's got a stick up his butt. Which isn't surprising, because all the acting is so stiff and wooden they couldn't have done worse than replacing the actors with department store mannequins. In fact, the extras seem to be the best actors in the entire movie, whether just walking into a building or laying around dead. Watch the scene early in the movie where Mr. Stick-butt is walking into the building, and then contrast that with how naturally the extras are walking.\n\nAnd the piece de resistance is the incredibly cheesy special effects birds in the form of what appears to be animated GIFs added to the video post filming. It reminded me of viewing a Geocities website back in 1999. In fact the cheesy CGI was probably the funniest thing in the whole movie, especially when some of the birds dive-bombed and then fell over dead. When the actors were shooting the birds down, it took me back to playing Duck Hunt on the Nintendo back in 1990, though the birds in Duck Hunt at least flew around instead of hovering in one spot while flapping their wings. They couldn't even put together fake bird props for the dead birds, but had still .gif images of birds laying on the ground.\n\nI was tempted to give this movie 2 stars instead of just one because this movie was so incredibly bad it made me laugh. But I rate movies on their own merits here, so it has to be only 1 star. But I do recommend it for the hilarity factor. At the time of this writing, the entire full length movie is available on Youtube, so I recommend seeing it there instead of renting or buying it. If you don't want to sit through the whole thing, watch the trailer or see the video showing the \"best\" action scenes from the movie.\n\nI understand they've made a Birdemic 2. I can't imagine why."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "WoLf_DiGiTaL",
        "review_rating": "1",
        "review_title": "Why this movie is",
        "review_detailed_main": "Imagine if you will being the posterboy for Camera shy There is another word but i can't remember it right now..Kinda like the editor of this movie when cutting scenes. Anyway Now imagine someone puts a gun to your head and forces you to act in front of a bunch of cameras. Now imagine that person making you do your acting in front of all those camera's invites every school bully you ever knew to watch each and every scene. now imagine you are a camera shy fellow having to act in front of all those cameras with the gun at your head being laughed at as you try to act and then noticing your mother is doing a striptease poll dance routine to entertain the class bullys between takes. and she is joined by your sister and grandmother. That friends is the only way i could think of describing the lead...The lead...i am not gonna say actor. thankfully, halfway through the movie some birds show up, you can take no more, and turn off the movie. I assure you. This will happen. You may thank me by saying yes this helped and deposit vast sums into my paypal account. Have a nice day."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "sixhoos",
        "review_rating": "1",
        "review_title": "Pure idiocy",
        "review_detailed_main": "Made by a moron. Acted by morons. Dialogue written by a 1st grader. Filmed with a home video camera."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "anubiz-10936",
        "review_rating": "10",
        "review_title": "Not quite as good as Shawshank Redemption, but pretty close",
        "review_detailed_main": "Fascinating story, great camera work, perfect suspense, impressive special effects. And not to forget the brilliant acting performance. I truly loved every second of this masterpiece."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "tbuestrin",
        "review_rating": "1",
        "review_title": "Wow...just wow.",
        "review_detailed_main": "Literally the worst movie I have ever seen....and that's coming from a huge fan of B-Horror movies.\n\nI'm pretty sure that my 8 year old daughter could proof the script for errors better than the writer. Also...the producers should invest in Final Cut Pro...because the special effects look like they were taped on the screen...just brutal!\n\nThere is one saving grace to the movie...it's so bad that the MST3000 guys (now RiffTrax) have spoofed it...brilliantly as always.\n\nIt gets 1 Star because 1/10th of a Star is not an option."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Hoopsflynn",
        "review_rating": "",
        "review_title": "It's Like Watching Al Gore Take a Crap On Alfred Hitchcock",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "ImBoredSoIReviewMovies",
        "review_rating": "1",
        "review_title": "10 out of 10 better than Citizen Kane",
        "review_detailed_main": "Anyone disagreeing with me on this I will fight to the death"
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "Kreme",
        "review_rating": "1",
        "review_title": "Wretched",
        "review_detailed_main": "Easily in the class of worst movies ever made, Birdemic has obsoletely nothing to recommend it other than a hilarious send-up of it by the folks at Rifftrax. The acting is horrible, the script is a mess of confusion, the directing is worse, and the special effects look like they were done by an 8yo on an old Quadra 660av. The movie lacks all the charm of something like Plan 9 From Outer Space and fits in well with dreck like Manos The Hand of Fate.\n\nIf at all possible, avoid seeing this film. Drive many miles out of your way if need be.\n\nEven if you like bad movies in general, this movie will test your limits."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "mattratt-42427",
        "review_rating": "1",
        "review_title": "Great CG",
        "review_detailed_main": "A bad movie icon? I think not. I had to check to see if this came out before Sharknado in which it did so maybe it wasnt made bad on purpose. You know the SciFi channel garbage. Expected more from such a so called great bad movie. Yes the cg does give a tickle to the funny bone and yes the acting is right on par with what I usually enjoy but thats about it. Maybe I shouldnt have watched it sober might of helped with a few beverages. I know this a part two or maybe even three but Im stopping here. I guess watch it so you say you did. Ultimately though not good bad."
    },
    {
        "movie_id": "tt1316037",
        "movie_name": "Birdemic: Shock and Terror",
        "movie_rating": "1.7",
        "review_username": "g-04644",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "\"Hi, the eagles killed our friends- uh- do you have a phone I could use to call the police?\"\n\nI fail to conjure words to describe this movie. This is the kind of movie you buy just so that when people come over and see it they say that they never heard of it and you're like \"wanna watch it\" and they're like \"sure\" so you put it on, sneak out the back-door, move to Mexico, and change your name. Bad acting, bad audio, bad CG, bad plot, BAD MOVIE. Just imagine what was going through those \"actors\" heads when they where swinging at nothing with wire hangers.\n\nI give it a 1/10- buy it and give it to someone you hate."
    }
]