[
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "datgoolguy",
        "review_rating": "",
        "review_title": "A Misunderstood Cinematic Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "TrashTramp",
        "review_rating": "",
        "review_title": "my kids loved it!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "austindouglas",
        "review_rating": "",
        "review_title": "The absolute best movie I've ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "uav_guru",
        "review_rating": "5",
        "review_title": "Not bad, but my kids enjoyed it",
        "review_detailed_main": "While the premise of the movie, the acting, the action and the story fall well below the entertainment threshold for the adult audience members, my kids enjoyed it quite a bit. Three girls, one 5 and 2 are 7, completely enjoyed most of the film. And why not? The kids are cute, the villain is villainous, the line between good and evil is clearly marked and the good guys win. They particularly liked the \"toys\" and the personalities of the children. Without spoiling it, the ending was plenty exciting for them. I am glad we took them, regardless of what I thought of the film."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "philbarry92",
        "review_rating": "2",
        "review_title": "Absolutely fantastic, couldn't ask for more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "tufftexan",
        "review_rating": "5",
        "review_title": "Super-Crappy, but kids love it.",
        "review_detailed_main": "My wife tortured me last night. She made me sit down with our two little girls to watch this drudgery of junk. She said our oldest, 8, wanted us to watch a movie with her. She certainly picked a dandy.\n\nAnyway, I'm not going into how awful the characters were or how weak the plot was, etc. etc. Just know as an adult you'll hate it, but if you want to keep your kids (under 9 years old) out of mischief for an hour and a half then pop this in the DVD player. My 3 year was just mesmerized. Don't think she has ever sat that long while watching a movie.\n\nI rated it 5/10 ... since I personally give it a 1 and my kids would say 10 ... so ... I just averaged it out.\n\nCheers! TT"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "kzoofilm",
        "review_rating": "1",
        "review_title": "Teething was more fun",
        "review_detailed_main": "If you've been thinking about hiring somebody to clean out those clogged gutters or to get that darned septic tank working again, just call Jon Voight. Yeah, the same Jon Voight who won an Academy Award as best actor in 1978 for \"Coming Home.\" The star of \"Midnight Cowboy,\" \"Catch-22\" and \"Conrack\" -- you know, Angelina Jolie's dad.\n\nWhy bother Mr. Voight? Well, considering that he's lending his name to \"SuperBabies: Baby Geniuses 2,\" he clearly has a lot of time on his hands, doesn't consider any job too demeaning and probably won't charge too much.\n\nIn case you're wondering why Voight would elect to appear in \"SuperBabies,\" the follow-up to a movie he wasn't in, instead of \"Anacondas: The Hunt for the Blood Orchid\" -- and don't pretend you don't remember the scene in the first \"Anaconda\" in which the gargantuan serpent swallows, then coughs up Voight -- here's a hint: Voight was an executive producer of the original \"Baby Geniuses.\" Since that 1999 fiasco effectively torpedoed what was left of the screen careers of Christopher Lloyd and Kathleen Turner, it must have been a formidable challenge finding actors eager to strip themselves of every scintilla of dignity to perform alongside a bunch of feisty computer-generated toddlers (with the exception of Scott Baio and Vanessa Angel, of course). Apparently for Voight it was put up or shut up time.\n\nSo here he is, ladies and gentlemen, outfitted with not one, but two dollar-store-quality wigs and employing an absurd German accent as Bill Biscane, a megalomaniac who plans to use cheaply made, insipid kiddie TV shows to hypnotize babies around the world and rob them of their free will; clearly, Biscane marches to the sound of his own drummer. But those who cherish the ideal of infants being able to make their own choices need not despair: SuperBaby Kahuna (played by Gerry, Leo and Myles Fitzgerald, who are by no means identical triplets) is on the case, and if there's anybody you want on your side when you're facing an onslaught of wretched programming, it's \"a small fry with a big attitude\" who taunts his enemies with such put-downs as \"Why don't you pick on somebody half your size?\" and \"Never send a man to do a boy's job.\"\n\nKahuna -- who is revealed to be a grown man trapped in the body of a pre-schooler, in a slightly sickening plot twist that requires three flashback scenes to post-World War II Germany to explain -- has some major connections, too. He can jump on his computer network and converse with Whoopi Goldberg, the members of that nearly forgotten boy-band O-Town, or any other celebrity or pseudo-celebrity willing to be pasted into a movie that only an unfortunate few are fated to see. Although he seems wise beyond his years as he notes that \"every child has power -- all you have to do is believe,\" Kahuna lives in what looks like a papier-mache cave full of large plywood and plaster imitation toys that might have been salvaged from the windows of a now-defunct F.A.O. Schwarz location. It's a sad sight indeed.\n\nThere are other four SuperBabies, too, and just prior to the climactic showdown with Biscane and his goons, this diaper-clad quartet jumps onto Kahuna's magic carousel, where they are transformed into Brain Boy (who wears a scaled-down cap and gown), Cupid Girl (who shoots arrows that cause grown men to stop fighting and hug each other instead), Bounce Baby (who is stuck inside an orange beach ball) and Baby Courageous (whose get-up proves that the only thing that looks worse than a grown man in a tacky hairpiece is a toddler in a bad toupee).\n\nWatching from the sidelines are Baio and Angel, as the dizzy owners of a highly questionable day care center in which most of the children parade around half-dressed, and Hilary Duff clone Skyler Shaye and Frankie Muniz lookalike Justin Chatwin, who attempt to provide a bit of squeaky-clean teen love interest -- not exactly what the target audience of 6-year-olds is itching to see.\n\nAs was the case with \"Baby Geniuses,\" the movie contains a surplus of awkward-looking digital effects that are supposed to convince us the wee ones are actually making wisecracks and running wild. The results are generally pitiful. If \"SuperBabies\" is marginally better than the excruciating \"Geniuses\" -- and you sure wouldn't want to live on the difference -- it's because director Bob Clark and screenwriter Gregory Poppen don't shoehorn in nearly as much innuendo or smarminess this time around; they're equally stingy with charm and imagination as well.\n\nBy the way, Voight's next project is called \"The Karate Dog,\" in which he'll co-star with Simon Rex, Pat Morita and Chevy Chase, who'll provide \"the voice of Cho-Cho,\" according to the Internet Movie Database. Do an Oscar winner a big favor and call him this weekend -- really, the guy must be willing to do just about anything for a couple bucks."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "holtrey-vincentelijah",
        "review_rating": "5",
        "review_title": "\"Superbabies\" is one of the worst films of all time because its humor is too clean.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "nadbruce",
        "review_rating": "1",
        "review_title": "worst movie ever made",
        "review_detailed_main": "This is quite possibly the worst movie ever made. Even my 4 year old hated it and wanted to leave. I was using it as an excuse to nap in air-conditioning. Alas, it was so bad that my daughter insisted we leave. Not really a surprise for a Steven Paul film, but I'm saddened that Jon Voight's career has fallen so low...and Scott Baio??? ARGH! Believe me, I've had to sit through some bad kid flix, but this one is an all time loser. There is a woman with very large lips (Vanessa Angel) who almost makes it bearable, just for the pure fascination of watching whether or not they will explode. However, my suggestion would be that all prints of this film be sent to President Bush so he can see how harmful his education budget cuts have been."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Was Jon Voight held at gunpoint to star in this piece of garbage??!",
        "review_detailed_main": "I was expecting this movie to be bad, and it was even worse than I expected. I have seen some truly terrible movies in my time like Home Alone 4, NeverEnding Story 3 and any of the Friedburg-Seltzer movies. But Superbabies:Baby Geniuses 2 brings the phrase \"terrible movie\" to a new level. And believe me, that is being kind about this piece of garbage. I am truly not surprised that it is in the bottom 100, it deserves to be there. That is how bad it is, and it highly deserved the 4 Razzie nominations it received. If you thought the first movie was bad, and it was, this is even worse. Sorry if I sound harsh, but I am trying to be honest.\n\nThe dialogue was absolutely excruciating. I seriously wouldn't be surprised if it was written by a six year old. It completely lacked sophistication and humour. And guess how many times I laughed during this movie? You guessed right, not even once! The plot was lazy, uninspired and clumsy. The idea of a media mogul wanting to dominate the world? How many times has this being done before? Loads, and much better might I add. The direction was sluggish and never reached its focus. Even worse than the dialogue, direction and plot were the fight sequences. How tedious were they? Very, not to mention very inappropriate, even for a family movie.\n\nThe performances from the entire cast were exceedingly poor. Jon Voight has pulled off some good performances in the past. However, I truly think he was held at gunpoint to star in this mess. And he gives the worst performance of his entire career here, acquiring a simply dreadful German accent that has to be among the worst ever accents in film history. It was worse than his accent in Anaconda, honestly there were times when I couldn't understand what he was saying. The other performers weren't that much better either, Scott Baio especially was wasted. And the child performers were misguided, they just couldn't do anything with the script. And I do apologise here, but I don't think babies trying to behave like adults is cute or funny in the slightest.\n\nEven the camera work was next to abysmal, nothing more than flat and rushed. Shame really, because there was one or two nice bits of scenery. In fact, the only real half decent element of this this otherwise abysmal film was the music, and even that was forgettable at best. All in all, Superbabies: Baby Geniuses 2 was nothing more than a piece of garbage, that was the low point of Jon Voight's acting career. 0/10 Bethany Cox"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "muslimbellydancer",
        "review_rating": "10",
        "review_title": "Great but very underrated family movie.",
        "review_detailed_main": "Super smart cute babies and superb movie. Very entertaining. Me and My son Muhammad were shocked how it is so underrated although it's cost production was high. Smart and good karate Kid teaching evil guys a useful lesson and that is a great movie theme.\n\nExpert Director Bob Clark made a great movie. Don't believe the bad rates. Thanks Sony pictures for the release."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "missjennifer1980",
        "review_rating": "7",
        "review_title": "This movie wasn't terrible",
        "review_detailed_main": "U people are downright cruel. This movie wasn't that bad. Yes, it wasn't as great as the first, but even still it doesn't need your down and dirty opinions.\n\nMy husband & I both liked it. We're 29 and 25 years old. It wasn't great, but not bad either. Doesn't anyone act like adults anymore?? Apparently not! My almost 4 year old daughter acts more like an adult than all of you!\n\nWhy don't you stick to the phrase, \"IF YOU CAN'T SAY ANYTHING NICE, DON'T SAY ANYTHING AT ALL!\"\n\nGROW UP, U SO CALLED ADULTS!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jonflottorp",
        "review_rating": "1",
        "review_title": "It is the best movie i have seen in yearsB",
        "review_detailed_main": "The babys are not Even babyes they are 5 to 6 years old great acting the superbabyes is movie you should watch right now."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Old_Fat_Dirty_Perv",
        "review_rating": "",
        "review_title": "horribly underrated piece of art",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "I'd rather gargle with hydrochloric acid than see a \"Baby Geniuses 3\"!",
        "review_detailed_main": "Okay, the first movie from this series \"Baby Geniuses\" was so poorly received that reviewers were beside themselves castigating the film. It currently is ranked #73 on the IMDb Bottom 100 list. Yet, astoundingly, the film led to this even worse sequel--\"Baby Geniuses 2\"! This sort of sequel is a prime example how some people in Hollywood just need to get real jobs...or at least stop doing LSD! Unlike the first horrible piece of garbage that is \"Baby Geniuses\", this film manages to be significantly worse for several important reasons:\n\n1. It is totally unoriginal. While \"Baby Geniuses\" was dumb, it was somewhat original and perhaps the film makers naively thought the film would sell. Here, however, they knew they were producing a giant stinky diaper of a film from the onset--following the horrible drubbing the first film received--and yet they STILL made it!\n\n2. \"Baby Geniuses 2\" has some of the absolute worst computer work I've seen in a recent film. The babies are horribly dubbed as their computer generated lip movements didn't match--and in some cases looked really creepy.\n\n3. Jon Voight managed to do a much, much worse job as the villain compared to the combined talents of Christopher Lloyd and Kathleen Turner in the original. That took LOTS of effort! Lots and lots and lots of effort!\n\n4. A ninja baby! While one of the babies in the original film did some karate here and there, here we have an honest-to-goodness ninja baby--complete with ninja mask and insanely ridiculous wire-fu stunts.\n\n5. Two words about the second film that say it all...SCOTT BAIO!\n\n6. Even more pop culture references that no child would understand. Considering that 99.9% of the people who actually wanted to see the film were children, this is a serious problem.\n\n7. The @&*$ kids talk and talk and make commentary on EVERYTHING. It's like going to a movie with an annoying kid sitting next to you who thinks he's the host of Mystery Science Theater 3000 and talks throughout--but in reality, he is just an obnoxious child who won't shut up. PLEASE shut up!!! SHUT UP!!!! SHUT UP!!!!!!!\n\n8. Gadgets! Unlike the first film, this one gives the ninja kid all kinds of super gadgets, such as a car like the Batmobile that spouts flames out the back, a James Bond-like mini-copter and Dick Tracy communication devices.\n\n9. The ninja baby has his own version of the Bat Cave--complete with holograms and Willie Wonka-like accessories.\n\n10. In many ways, \"Baby Geniuses 2\" is like the first film merged with \"Spy Kids 2\"--another bad kids film. It manages to combine the worst qualities of each!\n\n11. The ninja kid is a Buddhist with super-powers. As a result, now nearly 1 billion Buddhists worldwide also hate this film. Instead of offending this religion, they should have attacked a fringe cult like the Movementarians.\n\n12. A romance between two teenagers that just seemed a bit creepy. Seeing two teens kiss who look a lot younger than their actual age made me feel a bit queasy. My 19 year-old said she felt the same.\n\n13. For the cost of \"Baby Geniuses 2\", they could have funded ten independent films...or more. While this isn't a huge budget film, it cost a lot of money for the special effects. What a sad waste.\n\n14. Towards the end of the film, several babies sprout super-powers. One is like Superman and can fly, one shoots magic arrows, one is a giant bouncy ball (how that can come in handy against the villains is anyone's guess) and one is \"Brain Boy\" (whatever that means).\n\n15. The last 10 minutes...oh, does it suck! No, it Mega-sucks!\n\n16. The end of the film rips off Bogie from \"Casablanca\"--what sorry sacrilege.\n\nOverall, this is truly a horrible film. While there might be films that look crappier or have worse production values, the fact that this one DOES have a decent budget and production values yet is this thoroughly horrible makes this an amazing film. Clearly, it deserves to be on IMDb's infamous list! At one point, one of the babies make a comment that would be the perfect description of this sequel--\"Oh no, I'm feeling nauseous again\"."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "avtimdb",
        "review_rating": "1",
        "review_title": "This One Makes Catwoman Look Good",
        "review_detailed_main": "There are plenty of PG and G movies that are equally enjoyable for children and adults. \"Baby Geniuses 2\" is not one of them.\n\nI wasn't expecting Oscar material when I took my seven year old to see Bob Clark's latest film. But what unfolded was truly a bomb - neither funny nor coherent. Thank goodness these don't come along that often.\n\nOther than a flatulence joke in the first 5 minutes of the film (now a requirement for children's cinema), the laughs were few and far between in the remaining 90 minutes of this movie. During the many long periods of boredom, many questions began racing through my head. Why are these babies talking? Why do we care? Why aren't they saying anything funny?\n\nI can only assume that Jon Voight has a grandchild/godchild/nephew/niece, for whom he dedicated this performance. There really could be no other plausible reason for such an actor to associate with something with so little merit."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "hannibalw",
        "review_rating": "1",
        "review_title": "Baby Geniuses 2- No Brains In Site",
        "review_detailed_main": "It is difficult to review a movie this bad where does one start ? The dreadful screenplay. Does this studio employ script readers. The horrible characters Jon Voight as a Neo-Nazi is one step away from doing xxx porn. A steep decline for an actor who once received an Academy Award(Coming Home) At the screening I attended no less than 12,of the families attending walked out a third of the way through leaving 5, brave families in the theatre .And there was no laughter even from the kids . This film has studio tax write-off written all over it. Why it wasn't sent direct to video is a mystery for the ages. Some studio exec actually thought this would make money ?!?!!!! The animated baby talking is horribly done; the mouth movements never match the actual words . It is said you can learn just as much from a bad movie as a good one. The only thing I learned here is that Hollywood has been taken far astray from its roots . Whoever gave this dirty diaper the green light should be fired or made to watch this over and over and over ........"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "davet14",
        "review_rating": "1",
        "review_title": "Oh the pain!",
        "review_detailed_main": "Words cannot truly describe how down and out awful this movie was! I took my 6 year old to see this and even she seemed less than interested in this garbage. Not surprising given the superior \"children's\" movies that have come out in the last few years such as Nemo and any other Pixar movie. Scott Baio finally proved that he could be in something worse than \"Joanie loves Chachi\". All I could keep thinking about was how John Voight made superior movies like \"Midnight Cowboy\" and to wind up in trash this... This would have been great MST 3000 fodder - even \"Manos, Hands of Fate\" fares well against this. Again, most normal human beings couldn't even make a movie this bad if they tried. I guess this was fate paying me back for all the horrible foreign import/dubbed \"Pipi Longstocking\" movies my mom had to take me to in the 70's (as she often reminds me.) It's all karma..."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "hannibalw",
        "review_rating": "1",
        "review_title": "A Nappy Load Of Crappy",
        "review_detailed_main": "This film stinks higher than a 5,day old dirty diaper . It may amuse Neo-Nazi's for Jon Voights portrayal of the head goof of a brainwashing enterprise or some such thing.I think that's the point but I'm not sure the script is so perfectly dreadful .I may have missed it.But that appears to be it though why they would experiment in a day care center run by Chachy(Scott Baio)I am unclear on. The first 'Baby Geniuses' made like five cents in its entire run this one will be lucky to clear half of that . Why do these people keep green lighting projects that are beyond redemption.\n\n\"I luff the soft sound of a babies laugh \" One of the utterances from Jon Voight who is definitely on the down side of his career . Zero of 5 stars for this film ."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Animus",
        "review_rating": "1",
        "review_title": "pure soiled diaper material",
        "review_detailed_main": "The first movie was GARBAGE and worthy of no more than 2 stars. This follow-up is such a dumpster fire that it deserve NEGATIVE stars. Sadly i can't rate it less than 1 so that is what the crapfest earns. I suggest that instead of watching this you hit yourself repeatedly in the head with a sledgehammer."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "projectchao",
        "review_rating": "4",
        "review_title": "Not truly an awful movie",
        "review_detailed_main": "I grew up watching the trailers to this, and I even watched the first Baby Geniuses a million times when I was little. When I saw the trailers, I honestly thought the movie was going to be terrible.\n\nAnd I was right. Ten years later I watched this in it's entirety.\n\nDoes it deserve it's 1.9 rating, however? To be honest, it's actually better than the first in the fact that it doesn't have a dated 90's feel to it, and the bad, corny jokes are... at least a bit better, even though there's even more than the first.\n\nQuick overview of the plot: Old man wants to run brainwashing TV station but a bunch of babies stop him. That bit of a plot alone is so mind- numbing; but in all truth, the true demographic [4-8 year olds] don't go for detail. To make up for it, adult jokes are dispersed cringingly.\n\nWith a 20 million dollar budget, half-baked special effects are thrown everywhere, tinted with mediocre lip-syncing. They started work on this movie in 1999, and for five years of time, the visuals of this movie look like the byproduct of a crayon-eating toddler, mixed with delicious oversaturated colours and eye-bleeding contrasts. The sets are ridiculous, the way it's shot is messy, and it feels more like if a Spy Kids movie were done even more horribly wrong than they were.\n\nI'm giving this a 4 because it could use something closer to the first, and it's not as terrible as a Friedberg-Seltzer movie or the like."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "movieexpert77",
        "review_rating": "10",
        "review_title": "My favorite movie .Shocked why it ia so underrated!",
        "review_detailed_main": "Superbabies is a super family movie and my favorite comedy/action movie.\n\nVery cute and smart and good babies fighting evil with their good spirits.\n\nEnjoyable movie for all people and not mainly kids.\n\nUnstoppable action from beginning to end."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "AlsExGal",
        "review_rating": "1",
        "review_title": "Why did they make a sequel to such an awful movie?",
        "review_detailed_main": "The first \"Baby Geniuses\" movie was inane and boring enough, why make a sequel? Are studios that hard up to make money? That scared of trying something different for fear of losing money? I guess they figure going with a franchise that has a proved record of mediocrity is safer - at least you're not surprised when you lose money. This film is not campy or cheesy bad, it's just plain boring bad - the worst kind of cinematic experience.\n\nI guess my reason for writing a review of a movie this bad several years after its release is this - Parents, if you're looking for family-safe entertainment, you can do better than this type of film. Your kids are smarter than this. If they're young enough not to mind sitting through this film, then they are too young to enjoy any kind of movie anyways. For family-safe entertainment you can never go wrong with just about anything made by Pixar. Pixar knows how to make films that use CGI to accentuate already good plots and interesting characters, not as a substitute for them.\n\nAs for this film, it makes Gigli look like Citizen Kane. 20 years from now if there is a \"Mystery Science 4000\" to replace the now defunct MST3K, I'm sure this film will be one of the featured objects of ridicule... if the poor robots can stand the torment of sitting through it."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Radio_Lady",
        "review_rating": "",
        "review_title": "My almost four-year-old grandson loved it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "I_Love_Catherine_Zeta",
        "review_rating": "1",
        "review_title": "Have a fun day out watching super babies, then blow your brains out!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Ellimof",
        "review_rating": "1",
        "review_title": "Death by Film",
        "review_detailed_main": "I can tell you this...FOR THE REST OF YOUR LIFE, you will never experience a more shameful 88 minutes than this...it makes you question life itself...\"How did I get here?\" \"Do I deserve this?\" \"Nothing will be the same.\" The time witnessing this travesty will be a burden you will have to carry forever...so do yourself a favor and cherish a life in which you have not witnessed this curse."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Newsense",
        "review_rating": "1",
        "review_title": "Stupidbabies: Baby Idiots 1",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "somf",
        "review_rating": "1",
        "review_title": "jaw dropping awful",
        "review_detailed_main": "So last night I go to the Prince concert. Wife injured herself, so I go with my single buddy. Get pretty toasted and kind of forget to come home straight after the concert. Sure I went to an after party, but only to call a cab which didn't show up for over an hour. It was not pretty at home today. My punishment- take my 5 year old daughter to see this dreck.\n\nBob Clark is almost in the Ed Wood category with his body of work. Although, I must admit I really liked \"A Christmas Story\". But this film was truly one of the worst films I've ever sat through. What was Jon Voight thinking when he accepted this role. Surely it couldn't have been purely financial. The guy has had a lot of paydays over the years.\n\nThere were a few young couples in the audience without their kids too. Man, that freaked me out. They didn't even walk out. That's scary. They can vote. No wonder Bush is our president. I wonder what they did last weekend. Go to the Yu-Gi-Oh movie. That's what I'm betting on. It's a scary world out there.\n\nOh and even worse, the ending set up a sequel. Mr. Clark, if you are reading this, if you dare to put a baby genuises 3 on film before my kid turns nine, I will hunt you down and maim you. That's a promise."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "myersb",
        "review_rating": "1",
        "review_title": "This movie made me lose my self respect.",
        "review_detailed_main": "I've seen probably hundreds of movies. This was the first movie that was actually painful to watch. This is the first movie that made me lose my self respect. This is the first movie that I was actually embarrassed to be seen coming out of, and had to leave thru the fire escape. This is the first movie that made me feel dirty and ashamed. The plot twist was the most predictable in any movie I've ever seen. I won't make you suffer like I did, and spare you the awful reality that is \"Superbabies\". DO NOT SEE THIS MOVIE. Instead, donate your ticket price to the Will Rogers Institute donation container they have at the ticket counter. DO NOT SEE THIS MOVIE."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "a-twetman",
        "review_rating": "1",
        "review_title": "Kill it, kill it with fire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Ow_this_hurts",
        "review_rating": "1",
        "review_title": "oh dear god, WHY??!!",
        "review_detailed_main": "I saw this movie when it first came out because I was friends with a family full of immature little brats.\n\nAnd seriously, I think I actually repressed this movie deep into my subconscious, it was that traumatic.\n\nand I still carry the mental scars and I must live with the perpetual, everlasting shame of ever agreeing to watch it.\n\nI do remember one part that I found particularly excruciating, and I haven't been able to repress it:\n\nat the end when that kid finds his mother or whatever and introduced her to his girlfriend type person, and is like \"this is my...m-mother\"\n\ndon't give me that fake dramatic \"touching moment\", dear lord.\n\nand I'm not putting the spoiler thing on for that because its not a spoiler because this turd sandwich has nothing to spoil."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "olalara",
        "review_rating": "10",
        "review_title": "A Masterpiece Movie That Has Been Unfairly Under-rated!.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "worldsworstwryter",
        "review_rating": "1",
        "review_title": "B.O.R.I.N.G",
        "review_detailed_main": "This is the most mind numbing thing I've ever experienced. Sedatives will soon go out of business, because all you need to banish insomnia is to watch even 10 minutes of this movie."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "s-hoyland",
        "review_rating": "",
        "review_title": "Fine for the Kids!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "GravityLoudHouseLover1",
        "review_rating": "1",
        "review_title": "Worst than The First Movie",
        "review_detailed_main": "The First Baby Geniuses I remember watching as a kid but I didn't see the sequel until 2017 which is worst Than the 1999 Film. Super Babies Baby Geniuses 2 is about 4 Babies trying to Stop this evil Television Executive from Brainwashing the World & The Movie Stars Jon Voight as Bill Biscane who is the Evil Television Executive. Kahuna is this baby who really a 50 year old Man trap in the body of a Baby who tries to Stop His Evil Brother who is Biscane. The Movie has 0% on Rotten Tomatoes which compared to The First Baby Geniuses having a 2% on Rotten Tomatoes says a lot. Anyway This Movie is Garbage & Please Avoid it. 1/10."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "damcqueen",
        "review_rating": "1",
        "review_title": "Absolute torture",
        "review_detailed_main": "They could play this at Guantanamo Bay and the prisoners would be putty in the prison warders hands after 2 hours. Incredible that the likes of Jon Voigt should be associated with this steaming heap of excrement. Worst of all my 7 year old son didn't think it was bad so this film could actually make money and could be heading for your VCR (if you have kids) soon. They could show it at film school as how to throw away millions of dollars on a piece of rubbish that gets shown right around the world - I mean we saw it here in the United Arab Emirates. The premise had loads of possibilities - kids with superpowers -could have been funny, instead it was just unrelenting drivel. Not the actors/kids fault really - shoot the script writers and 'director'. Shoot them now!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "ryan_kuhn",
        "review_rating": "1",
        "review_title": "**Insert your own stinky diaper joke here**",
        "review_detailed_main": "Terrible. That's just one word that could describe this pile of diaper entertainment. Another movie is unwatchable. I had to sit through this garbage while watching some kids one day, and I knew this movie wasn't good when even the kids lost interest a few minutes in. There are movies where the kids get into the action, they cheer on the good guys, or they involve themselves into the movie. Not this one. Superbabies entertained none of the kids, and left me wondering how this movie ever left the boardroom where the script was written. The movie did solve one question that had been burning inside of me for a while: Where has Scott Baio been? Here, he plays a father of one of the babies and director of a new daycare center that may or may not be integral in the plot to take over the world by the diabolical Biscane (Jon Voight). I can understand Baio being in this movie, he hasn't really been in demand of late. But when I see Voight perform in this movie, I wonder to myself \"Why?\" He's done some good work of late, notably in Holes and National Treasure, and then he plays some sort of super villain with a bad German accent who is derailed by 2 year-olds. He'll bounce back, he has to. The babies in the movie, who are supposed to be the stars, looks freaky to me. The voices do not sync up with the movie lips at all. I think the characters in South Park have better synchronization than these babies. And the movie is not funny either. Again, I go to the kids, where I noticed none of them laughed at all. Instead, they all wanted to read, or draw, or take a nap, or do their laundry. Anything to escape this movie."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "st_pilot",
        "review_rating": "1",
        "review_title": "Worst Thing Ever",
        "review_detailed_main": "THE worst movie I've ever seen. I watched this a few weeks ago on HBO On Demand, simply because it was #5 on the IMDb Bottom 100 list. (As of 10/17/05 it is #3.) To get an idea of how awful this abomination is, think of the worst five seconds of acting, cinematography, plot lines, lighting, directing, and so on, that you've ever seen in your life. Imagine those 5 seconds repeating for an hour and a half. Now multiply that by ten thousand. Superbabies is even worse than that.\n\nTalking superhero toddlers, led by the mystical Kahuna, conspire to thwart the evil plans of Nazi leader Jon Voight. Co-stars Scott Baio. Enough said."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Rogue-32",
        "review_rating": "1",
        "review_title": "Where's Stewie Griffin when you need him??!",
        "review_detailed_main": "Yup, this is a bad movie, no question, with a silly plot, dumb execution, and not one moment of anything resembling genuine inspiration throughout the entire bleak excursion. It's not witty, charming or funny in any way, and even the appearance of Jon Voight couldn't help the proceedings, although you gotta give the man credit for trying. For a film with the word 'geniuses' in the title, you'd think they could come up with something reasonably creative at the very least. I kept imagining Family Guy's Stewie Griffin showing up and teaching these tedious little punks a thing or two, but he never arrived, to my dismay."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Pilsung89",
        "review_rating": "1",
        "review_title": "Avoid this trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "injury-65447",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "It's hard to even endure the first scene. Badly dubbed babies talking about rotten milk. What a stinker. I've eaten tastier things out of my diaper!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "zpwqfsf",
        "review_rating": "10",
        "review_title": "IGN 10/10",
        "review_detailed_main": "This movie really makes you feel like a superbaby genius. This movie is a masterpiece and everyone should give it a watch as the writing, cinematograph and acting compares to movies like Godfather and Shawshank Redemption and the level of writing is comparable to a Song Of Ice And Fire by George R R Martin"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "homestar_is_cool",
        "review_rating": "1",
        "review_title": "Who let Bob Clark become into this?",
        "review_detailed_main": "This film is officially one of the worst in history, even though it's now at #11 on the Crap List on IMDb. It's 0 on a lot of the review aggregators on the Internet and that's basically what I believe. I saw this on HBO in 7th grade and laughed at some of the scenes, but as I got older, I was like, \"Why in the hell did Bob Clark make this?\" You wanna know why? He couldn't make another \"Porky's\" or \"A Christmas Story\" because for one thing, we love those films! He wants to go back to his She-Man days of the 1960s! Did he just pick up some retard's script and say, \"That's an Oscar-winning film?\" Probably. Mac and Me is better than this piece of crap and so is Leonard Part 6! Those are classics compared to this! Ishtar is better and should win all of the Oscars! Save us from this hell! Score: 0/10!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "segal218",
        "review_rating": "",
        "review_title": "Highly Underrated Children's Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jt_boricua1981",
        "review_rating": "1",
        "review_title": "Are these reviews even legit?",
        "review_detailed_main": "Are these 10 scores real? Were u guys paid to give this atrocity 10 stars? Im so confused. This was utter garbage."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "wwe7961",
        "review_rating": "1",
        "review_title": "An abomination on every level. If I ever see a movie worse than this I will die.",
        "review_detailed_main": "This movie goes beyond words. Saying that it has acting that makes me feel like throwing up is an understatement. Saying that it is an abomination on mankind that makes Hitler look like Ghandi is an understatement. Taking a copy of the DVD, setting it on fire, smashing it with a hammer, and throwing the pieces left over into a volcano is less than the true fate this movie deserves. I can call it any name I want to. In the end though it will defeat me with just how awful it is. If you got the strongest critics in the world together to watch five minutes of this they would rip their own eyes out in two. Well I should stop talking about how bad it is and get into what makes it bad. First off the acting just awful. Even John Voight an Oscar winner delivers one of the worst performances in movie history. Everyone simply makes me sick. The worst ones are the voice actors for the babies. They give by far the most annoying performance ever put to film. You could take Jar-Jar, the live-action Italian Pinnochio, everyone from Troll 2, everyone from Manos, and Eddie Murphy in 98% of every movie he is in together and it wouldn't be as bad. They have voices that make nails on a chalkboard sound like Motzart. They sound like they are the kids of whoever possessed Regan in The Exorcist. (Exorcist 2 never happened) Then we have the effects. They are pitiful. They are just so bland and lousy that it refuses to be comprehended. When you get to this colorful secret lair later in the film it feels so lifeless for some reason. Action scenes are more about annoying as hell puns in this movie then a sense of actual fighting that feels like fighting. It leaves you yawning at how boring it is. I know that it is supposed to be kid friendly, but Spy Kids has more tension than you and it wasn't even trying to be suspenseful. Fighting is so bland in this movie that it feels more fun to watch people throw punches at the air. Also the effects on the babies mouths is simply atrocious. Then we get to the real reason why this movie fails. The story is a joke. A deaf blind monkey that is drunk, high, and born with no legs or arms could right something better than this. Four babies work with superbaby to stop a man from taking over the world. If you haven't slit your wrists yet you are really strong. As for dialogue it is mostly made up of this. Annoying baby conversations, moron adults, moron villains, 16 year old exposition about babies. Kill me please!!!! The director of this died in a car accident after this. As you can tell by this movie it was most likely karma or intoxication after a day of shooting. (Yes I am aware that he made A Christmas Story, but that does not make up for this) This movie aims low, crashes, and burns to death. It is a movie that was shot on 30 million, but it looks like it was shot on 300,000. It is so bad that even if you want to bash y0ourself don't watch it. I wasn't that mean on movies before this. If a movie was bad I would say it was bad. Now after this I see in awfulvision. When I see a movie that is really bad I force its head in the dirt and watch it die slowly. This is simply crap times infinity.\n\n0 stars out of 4"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Wetsuitfan812",
        "review_rating": "1",
        "review_title": "Worthless Garbage",
        "review_detailed_main": "This Movie makes GIGLI look good. I do not know why Jon voight would even want to star in this poor excuse for a movie.\n\nSaw this at thanksgiving and left the room after 5 minutes, Yes folks this movie is really that bad.\n\nThe baby's' are unimaginative and poorly portrayed, Bounce Baby?? come on I could come up with a better idea that that if I was drunk.\n\nThen again you would have to be drunk to sit through this one.\n\nJust watch the way the voices sync up with the mouths and you will see what I am talking about, Remember to bring the eye soap!!\n\nThis movie is garbage, Nuff Said!!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "stema-sp",
        "review_rating": "1",
        "review_title": "i did not believe.",
        "review_detailed_main": "This review can only be fully understood if you pretend that I chained you to a chair while I'm screaming the following at you:\n\nThis movie is hate!; The very essence of cruelty and indecency compiled together to to exists.\n\nThis movie is anger!; It is vengeance waiting in a dark corner forever plotting your demise.\n\nThis movie is absolute blackness!; it is the absence of everything while it leaves you with filth and obscenity.\n\nMay it forever burn!\n\nI hope this has been helpful. You can stop pretending now. *whispers* run!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "foothill_warrior",
        "review_rating": "1",
        "review_title": "foothill_warrior@yahoo.com",
        "review_detailed_main": "Never watched it and never will - but the poster pic is pathetic and I hate Scott Baio so giving worst review possible. If you watch this you will have permanent brain damage."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "mgaffney1229",
        "review_rating": "1",
        "review_title": "You don't need to see it.",
        "review_detailed_main": "It was weird wading through the first 20 or so reviews which praise this as the greatest movie in the history of whatever. Well, I guess that's the internet. Sarcasm runs deep on the web.\n\nTo be honest, I have never watched this movie. I've exposed myself to enough horrendous shlock in my time that I don't need one more thing sucking away all that is good and decent from my life. But it doesn't matter, at all. You literally don't need to see this movie to know it is absolute trash. And it's not even the fact that it's a sequel to a horrifically bad film in it's own right. All you need to know about Baby Geniuses 2 is this:\n\nOn IMDb's list of the lowest rated movies of all time, according to a user vote, this film comes in second place to a propaganda film for a fascist government run by a murderous dictator.\n\nSo why did I bother reviewing it? Boredom. Another day in the internet."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jayro",
        "review_rating": "1",
        "review_title": "One of those rare horrible movies...that is a must-see!",
        "review_detailed_main": "When I uttered the words, \"Baby Geniuses 2\" to man in the box office at the movie theaters I had a certain sense of shame and embarrassment. The only reason I went was because we had a group of about 15 film majors that thought it would be funny to all go see the late-night showing of this movie. We were right! From the second we saw the flashback to 1962 Berlin, Germany we knew this was going to be sooooo ridiculous that there wouldn't be any problem finding stuff to laugh at. The dialogue and the \"concept\" of this movie are so prepostorous that I contemplated dropping my major in film once it was over because I thought that if this movie could make it to the big screen, then Hollywood is truly dead. I understand, this is suppose to be a kid's movie.\n\nDoesn't work as that even! There was actually a few young children in the theater and they were crying after about 15 min. into it. There's too many special effects and loud fight scenes to make it enjoyable for a child. Plus, even a baby can probably tell how much crap this is. One of the funniest moments was during a part where they're pulling a mini-van into the head baby's secret lair behind the Hollywood sign...I know, that's enough to be funny....but if you look in the upper left hand corner in the screen you can CLEARLY see a crew member just messing around behind a bush. That's how poor quality this is. Well, that's all I'm going to waste my time saying about this movie. If you have a group of friends who want to just laugh they're butts off for 2 hours (way toooo long), then be brave and go see Baby Geniuses 2, it'll be an experience you unfortunately will never forget."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "RealityHurts",
        "review_rating": "10",
        "review_title": "I'm Not Forcing You To Buy The DVD,But This Movie Is Absolutely Perfect!.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "kfo9494",
        "review_rating": "1",
        "review_title": "Like a baby's diaper- it's a stinker!",
        "review_detailed_main": "Here is a film that you wonder how in the world that studio executives were duped into spending any money on this disaster of a film. What exactly were the people at Sony Pictures doing the day someone made the decision to fund this film? And then after the film was in the can did someone notice that it should be shelved or released for TV other than an expensive theatrical project?\n\nAfter sitting through the ordeal, I really cannot tell you much about the story. Jon Voight is a 'Nazi' type villain that goes around being foiled by these babies that speak in words that must be in some foreign language because I was not sure if it was English. The viewer is left unable to understand the script and unable to comprehend the plot.\n\nI can only guess that people thought looking at babies walking around in diapers, talking gibberish, would be sweet. However we learn that what the babies make in their diapers is exactly what this film is worth. Absolutely one of the worse films made."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Krentastic",
        "review_rating": "",
        "review_title": "This movie violates my beliefs!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "kylet38",
        "review_rating": "1",
        "review_title": "The final and worst film ever made by Bob Clark! Do not watch this awful movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "sirdickis",
        "review_rating": "1",
        "review_title": "wow...",
        "review_detailed_main": "Quite possibly the biggest lump of crap digitized onto DVD...ever. The audio was horrible at best, much like listening to (who also makes a cameo) 'O-Town'. I wish I could say that this movie could be potentially watchable under the influence of entheogens. This is not the case.\n\n*WARNING PARENTS* You are risking reducing the brain capability of your child if he/she watches this movie.\n\nYou also risk the chance of immediate projectile vomiting on your part. Your eyes may get stuck rolling back into your skulls. You may also thing mean thoughts of you children, knowing they convinced to watch such a torturous disc of dung.\n\nI'm making myself think recounting how atrocious this 'thing' was.\n\nAlthough I hate to admit it, you are better off watching 'Mulan II' or 'Lion King 1 1/2\"."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Ilovepornoandwomenveryverymuch",
        "review_rating": "1",
        "review_title": "Super Bad Movie",
        "review_detailed_main": "Do not see this very very bad movie!. I am very very happy that all people hate this very bad movie.I am very very happy all people vote 1 * for this very very bad movie. I advise you all to vote 1 star*.Only stupid people and crazy families vote 10 for this very bad movie. I am very very very sure this movie will go back and back to be at the bottom.Why they make a very bad bad movie like baby geniuses?.Do not buy this DVD!. Do Not Be Crazy!.Vote only 1 * and open your mind and you must hit your kids if they buy this very very very bad movie . This movie has very much violence and very very bad. Do not waste your time and see it.Only smart people vote down for this movie and only crazy people vote up for this very very bad movie."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "gregory1-2",
        "review_rating": "1",
        "review_title": "it is terrible",
        "review_detailed_main": "It is terrible and quite stupid. Nothing like the first part. The first part was very good, that is why I decided to watch the second one as well, but it was a complete disappointment. The babies are used for stupid and completely unrealistic propaganda issues. Could not you find something else? I do not know how stupid somebody must be to create this crap. Is there nothing else to do than waisting money? With a proper director and scenario this movie could have been a hit, because the idea in general of babies knowing more than what we know is quite intriguing. There sure will be no superbabies three after this flop. If I saw this scenario I would have never ever approved it. How can they still try to sell it for around 20 dollars? Who would buy such a crap?"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "sias-programming",
        "review_rating": "1",
        "review_title": "Sucked, like a baby's pacifier",
        "review_detailed_main": "Okay, who came up with this movie anyway? Baby Geniuses??? Why don't they have a movie called \"Intelligent Toddlers\"? This movie was completely stupid. I hate how they combined actual events, like war in Germany, in this movie's story. Did the writers actually believe this would get better ratings if people saw something from \"The Great Escape\" in this movie except with babies as prisoners? Maybe they thought people would say, \"Awww, how cute. A baby as a prisoner.\" Rugrats is definitely better than this. And it was just stupid how babies surpass adults in knowledge and intellect while they still crap their diapers and cry. And I forget, wasn't there a bad guy who wanted to take away nap-time? Really stupid. If they're \"super babies\" then they don't need naps. The writers probably over-exaggerated and thought that they should combine every important element of a genius but still have silly baby characteristics. I wonder if they saw the Justice League and said, \"How about the Justice League as babies? Ingenious!\" I even remember someone saying they WANTED to see this movie and all I could think was that they had to have been completely dumb. This movie couldn't have been made any worse."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "istewartsaysnot",
        "review_rating": "1",
        "review_title": "Save me!",
        "review_detailed_main": "I, I, I just don't know where to start... This is such a piece of garbage... I can't even try to describe how bad this is... I actually wanted to have my eyes taken out with a spoon. There was absolutely nothing worthwhile in the entire movie. More boring than watching nothing at all and staring at the back of a chair. I usually love bad movies and get kicks out of them... Manos: Hands Of Fate, Plan 9 From Outer Space, Ape... but this, this was so bad, I almost wanted to die after it!!! This is by far the single worst movie I have ever seen in my entire life. I thought that maybe it would be a little goofy, but I was very sadly wrong(I went because of a friend (They looked about ready to kill someone after it ended.)). Never, ever, ever, ever in your entire life, even attempt to watch this horrible trash! For your own safety!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "ax-23",
        "review_rating": "1",
        "review_title": "Just please don't watch it, I'm begging you",
        "review_detailed_main": "I watched the trailer for Superbabies and it seems like it's a joke. I have never seen this film at the cinema or advertised on T.V so I have never watched it but it looks terrible The writers must have been high when they came up with secret agent babies, spy kids is OK but this is something ells. And why is it in kids films that the villain wants to take over the world and they never accomplish. If you voted this movie 10 seriously you MUST be joking I'm going to buy this on ebay put it in a fire place and pee on it and take a photograph so thats what I'm going to do tonight If you have any respect for movies please don't put this in your DVD player."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Open-mindedMuslimWoman",
        "review_rating": "10",
        "review_title": "A Great Movie From Sony Pictures. It is unjust to be under-rated!.",
        "review_detailed_main": "Superbabies:Baby Geniuses 2 is a perfect movie for kids. It has all the elements of success: entertainment,great acting, amazing direction and a good story. It is unfair to see some unjust critics harshly criticizing entertaining and good children movies because they are not paid from movie makers .\n\nFour genius babies play detectives and cleverly fighting evil.\n\nMedia mogul Bill Biscane kidnaps innocent children everywhere and there is a cute and smart child called Kahuna who after drinking a special chemical he becomes a strong kid just like a superman, he changes into a super-baby to fight evil and rescue the lives of his friends.\n\nI have absolutely enjoyed watching this stunning movie.\n\nAlas it is too good to be under-rated!."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "ouchtrotsky",
        "review_rating": "1",
        "review_title": "So much promise gone to waste",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "acerbica",
        "review_rating": "",
        "review_title": "The goggles, they do nothing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "edvazzz2001",
        "review_rating": "2",
        "review_title": "Mart Bart carries the movie",
        "review_detailed_main": "I would give this movie 0 stars, but unknown (yet) actor Mart Bart from Lithuania really shines in it. Although he wasnt the main character in his few scenes he delivers. And he delivers quite a lot: from laughter to tears, from joy to anger. I think he will have a great career. Mark my words: there will be a new star in Hollywood."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Sheol1812",
        "review_rating": "1",
        "review_title": "The first one was passable",
        "review_detailed_main": "This one . . . It's not the issue of the characters, the corny jokes, the drawn-out fight scenes. That's all passable. It is the speed at which the plot develops that is nauseating. It was fine without a sequel."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jasoul",
        "review_rating": "1",
        "review_title": "rip off",
        "review_detailed_main": "i want my money back,\n\nwho ever thought this movie up\n\nand those who made it should be\n\nashamed of themselves and their work.\n\nthis is the worst garbage i have ever\n\nseen for a film- my kids were falling\n\nasleep! if this is the best big money\n\nHollywood has to offer, then Hollywood\n\nhas no reason to cry when their jobs\n\nare being exported to Canada."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "lmntathffan",
        "review_rating": "1",
        "review_title": "YAAAAAAAAAAAAGHHHHHHHHHHHH!!!!!!!! (At high frequency)",
        "review_detailed_main": "WAAAAAAAAGH!!!!!!!!!!!!!!!! Somebody please help me! Have you seen a bad movie recently? Something with any combination of Bette Midler, Sissy Spacek, and Goldey Hawn? Please lend it to me, due to the fact that ANYTHING will seem good after watching SUPERBABIES! And again, YAAAAAAAAAAAGHHHHH!!! It wasn't bad enough that Baby geniuses was crap, oh no. Whoever gave this stinker the greenlight should be hung, drawn, and quartered, or hog-tied, pushed down, into, some snake water. Some of you may remember a pleasant scene in Baby geniuses, wherein a Baby wearing a tux knocks out a hobo who requests some change. The homeless schmutz, who lands in a toilet stall, closes his eyes, as if unconscious, and then decides to open them, as though he didn't realize that the film was still rolling. Well, no surprise! Baby Geniuses 2 contains equally bad, if not worse material, such as a baby who fires cupid's arrows to create love between evil corporate goonies, or a baby in a beachball, who bounces from one end of a room to another, without any physical harm, nor mental damage. Of course, a terrible movie would be nothing without its star, and who better to create this horrible steaming pile than Jon Voight, aka Angelina Jolie's father, of Midnight Cowboy fame. I seriously can't imagine who even came up with the storyline for this movie without bursting out with a combination of laughter and indigestion. 1 star is too gracious for this movie. Maybe just maybe Jon Voight might be able to pull his act together before they decide to make a Baby Geniuses 3: The diaper that rash'd New York."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "blakesoprito",
        "review_rating": "1",
        "review_title": "the worst movie i have ever seen",
        "review_detailed_main": "This is TOTALLY the worst movie of all time and it deserves to on the Bottom 100. Why would Bob Clark come up with such a stupid idea to make a film like this. When it was in theaters, My Mom took me and my sister who was about 4 or 5 then. My Mom thought it was awful, I couldn't stand it but my sister liked it and that's strange because most kids her age hated it. She kept repeating one of lines from that movie over and over again and I'm not gonna say what it was because you probably don't wanna know what it was.\n\nNo Wonder Jon Voight got nominated for a Razzie Award for Worst Supporting Actor, he was worse than Sylvester Stallone in Spy Kids 3-D Game Over.\n\nOne more thing, for those of you who have never seen this movie, your lucky."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "sir_jack_55",
        "review_rating": "1",
        "review_title": "Worst Movie Ever Made",
        "review_detailed_main": "This movie is awful. It is, quite simply, the worst movie ever made...it's worse than Glitter, it's worse than Battlefield Earth, it's even worse than the original Baby Geniuses. If you've seen the first film, well, this movie is the crumminess of the first on steroids. The film has plot holes big enough to float an aircraft carrier through. The premise is bad, the SFX looks like it was done by an eight year old, and all the jokes are juvenile toilet humor. This movie is so terrible that it isn't even in the \"so bad it's good\" category. This movie is terrible. Do not watch it...it truly is the worst movie ever made...and I've seen some pretty terrible films."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "shadowsfall676",
        "review_rating": "2",
        "review_title": "Why do they even bother?",
        "review_detailed_main": "This was such a waste of money, its not even funny....actually this movie is so bad its not even funny. This was no where near relevant to the original, even though the original was not that great either. But this is the queen of bad movies.\n\nThis movie has the mentality rate of an orange, my child saw this movie and she is 5 years old, she even thought it was absolutely terrible, so I do not recommend this movie to anyone of any age, maybe a 1 year old would like it...if they were lucky. DO NOT waste your time or money when there are plenty of other movies worth watching, this make House of the Dead look good..\n\nI was generous and gave this a 2/10..."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "american218",
        "review_rating": "10",
        "review_title": "One of the best funniest movies.",
        "review_detailed_main": "I don't know why most people are so bigoted and prejudiced about a great funny movie like Baby Geniuses.I never forced anyone to speak positively about a movie they detest but to tell the truth to underestimate a family movie with a great actress like Kathleen Turner in it is quite unfair!. The babies in both movies part 1 and 2 are so cuddly,cute,funny and intelligent. All The incidents of the movie were so natural,realistic and far from superficiality.There was no exaggeration whatsoever. The acting was fantastic.Who would ever imagine seeing babies that are barely 3 years old act so perfectly ?. My vote was fair in giving this masterpiece movie 10/10.\n\nI already bought The DVD and dying to see the 3rd part of Baby Geniuses."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "imjm13",
        "review_rating": "1",
        "review_title": "I'm sure I might have been entertained, if I were as old as the babies...",
        "review_detailed_main": "I was delightfully surprised when I learned that there was a sequel to the delightful, but severely underrated Baby Geniuses. I had mistakenly thought that they were finally going to create a film that would be as good or better than the original. They might have brought in a better marketing team, but they certainly had a worse writing team, possibly the worst writing team ever. While Baby Geniuses had some originality and some novelty, as well as a few funny parts, Baby Geniuses 2 was devoid of Baby Geniuses' few redeeming factors. The whole idea of super smart babies who can talk was already exhausted in the first film. Why try to bring back the babies? It's like flogging a dead horse. While I have been writing this review, I have tried to think of one good aspect of the film. The closest I could come to a positive for this film is: you can chose to not watch it!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "nearlyparadise",
        "review_rating": "",
        "review_title": "Impressively terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Superbabies: Baby Geniuses 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "tripbass13",
        "review_rating": "1",
        "review_title": "Really, Hollywood?",
        "review_detailed_main": "I can't stand this movie. I remember being younger and wanting to see it. My spazzy little brain told me \"Oh, go see this movie! You'll love it!\" You lied, brain. This is the \"Jaws: The Revenge\" of comedies! If I get the chance, I will go to the director's home, hit him in the crotch with a rattle, and destroy EVERYTHING HE LOVES! This movie is so bad, Uwe Boll looks down on it! This makes me yearn for the Super Mario Bros. movie! I watched the movie over and over, hoping to find a hidden joke. Looks like I did. \"Viewers are morons and will watch anything with 'cute' babies.\" Why the quotes around cute? They aren't cute! They're annoying! They're the little brothers and sisters of the universe! I want to tear my eyes out after watching it!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "hannibalw",
        "review_rating": "1",
        "review_title": "Baby Geniuses 2-No Brains In Site",
        "review_detailed_main": "When oh when will the major studios stop green lighting films that have no social or entertainment value at all . BG-2 is so god awful I don't know where to begin . Does this studio not employ script readers ? Why on earth is Jon Voight even in this terrible movie ? Has he finally given up and surrendered his career to his pillow lipped daughter Angelina Jolie ? As a one time Oscar winner this is a pretty steep drop for Voight. Next step down is porn . Voight plays a Nazi type character with brain washing on his mind and to do this he goes to a Daycare(?) center run by Chachy(Scott Baio) One of the babies lives in a funky cave situated behind the Hollywood sign that is filled with junk left over from SpyKids 3 . The first BG made like a nickel throughout its theatrical run this one will probably do the same it has tax write-off written all over it. Do not see this movie as it will induce irretrievable brain damage. This is about the dumbest excuse for a movie EVER!!!!! Zero of Five Stars for BG2"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "falcone-art",
        "review_rating": "1",
        "review_title": "Ready or not?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "trevormdm",
        "review_rating": "1",
        "review_title": "Worst movie I have ever seen, made my regurgitate myself",
        "review_detailed_main": "This movie is so bad that i ended up throwing up my lower intestines and having to go to the hospital."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "kylehaines96",
        "review_rating": "1",
        "review_title": "The Death Of Film Right In Front Of Us.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "nicecollinofficial",
        "review_rating": "1",
        "review_title": "Oh my god this was good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "turkishguy",
        "review_rating": "10",
        "review_title": "Excellent movie but heavily underrated.",
        "review_detailed_main": "SuperBabies: Baby Geniuses 2 is the follow-up to 1999's Baby Geniuses. In it, four smart babies team up with 7-year-old \"defender of children everywhere\" Kahuna to prevent media mogul Bill Biscane's plot to enslave the world through powerful subliminal TV programming.\n\nBabies start jumping at day-care center Bobbins World, in the stewardship of Stan and Jean Bobbins. (Stan's brother from the first film owns the center but is busy saving children overseas.) The Bobbins are preparing for the arrival of Mr. Biscane, who, at this point in the film, is an internationally recognized advocate of children and orphans. Biscane has chosen the Bobbins' upscale L.A. day care to premier his new television show for kids. Stan hopes the exposure will turn the day care into a nationally known brand, \"the McDonald's of day care.\" Biscane has other ideas.\n\nAs the Bobbinses work themselves into a high-stress lather over the near visit, four smart babies:Archie, Finkleman, Rosita and Alex sit talking to one another in a play area. To the ordinary watcher, it looks as if they're just talking baby talk. But Jean becomes convinced that they're actually having a conversation. And she's right: Archie is telling the other toddlers about the legend of Kahuna, a 7-year-old überspy who prevented the evil Nazi-like commander Kane's plot to enslave orphaned East German children.\n\nThe other babies dismiss Archie's tall tale. But they soon discover that Kahuna is no legend when he comes to their rescue—which they desperately need after getting unwittingly dragged into Biscane's malevolent sights—tricked out with all the requisite Bond-like hardware, including a snazzy rocket-powered three-wheeler. Along the way, Kahuna empowers the babies to believe in themselves, revealing each one's superpower!.\n\nThis movie is so great .I still do not know why it is heavily underrated. It was an enjoyable thing to do watching the movie on DVD and I am so certain it would be magical to see this excellent movie in 3D at the movies."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jaffarius",
        "review_rating": "1",
        "review_title": "Absolutely on top at worst movies ever made!",
        "review_detailed_main": "I was checking the IMDb bottom 100. And found this movie stand as the worst one. Then I read users reviews. Well I understood that it should be a piece of junk, but I was surprised reading positive comments and decided to watch this movie. I was kinda hard to get the copy, but finally I found one. Well I watched it without been interrupted. What I can say... Hmmm.... I got depressed cause after first 15 min I was forcing me to watch i till then end. For the name of god! Why anyone by any reason will make such a horrible movie? I was thinking of that the rest of the day. Got a headache and after getting aspirin slept on sofa. Next day I realized that I'm still not over this movie and catch my thought that I want to kill the people who made this movie. Lucky for me that instead of keeping thinking of that I just decided to write this review.\n\nThis is absolutely worst movie in the whole cinematography. Don't watch it or watch it and prepare to slowly die from the brain malfunction."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "bestdude-21875",
        "review_rating": "",
        "review_title": "AHHHH MASTAPEICE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "critic-boy",
        "review_rating": "1",
        "review_title": "The Awful, yet not-so genius sequel!",
        "review_detailed_main": "When I was young, i enjoyed the first baby genius movie. But, now as I look at the first one, I think \"Could they make an even worst movie then this?\". Sadly, it came true! Say hello to the cheesy, UN-funny sequel. Come on Bob Clark! You made good movies like \"Black Christmas\" and you bring up this! It was bad enough when you made the first one and the second one is terrible! I do not recommend this film at all! If you really want to enjoy this film, get drunk or get high - maybe it will seem a little bit more funnier, but to be honest I don't even think that will work! Bob Clark, I respect your work deeply but the Baby Geniuses film are some that I wont respect!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Crazy_Gibberish",
        "review_rating": "1",
        "review_title": "Punishingly Irritating.",
        "review_detailed_main": "A few friends and I loaded this up for bad movie night right after \"U.S. Catman In Lethal Track\". The contrast was pretty startling, and demonstrated the huge difference between a commercially produced, large budget disaster like this and quirky, extremely low budget, foreign oddities like the kind featured on MST3K. Those low budget gems, for the most part anyway, had some creative spark behind them that went wildly awry. Stuff like \"Monster A-Go-Go\" was put together by small groups of people who at least cared about what they were putting together but had no idea how.\n\nHaving said that, Superbabies is a whole different animal. It's coldly calculated to appeal to 5 year olds and somehow still misses the mark. I know kids don't mind disjointed action as long as it's flashy and fast paced, but there's too much going on here that makes absolutely no sense. There's this really creepy, drawn out back-story about how the King Baby, Kahuna, is actually an old man trapped in a child's body. Not only is it disconcerting and weird, but I can't imagine a small child following all the labored exposition getting us there.\n\nIn fact, the babies themselves don't really do anything. They just stand around in diapers while Kahuna and the adults bray like jackasses and make fools of themselves in the most irritating ways possible. Like Jon Voight, who can't even be bothered with a passable accent. Anyone remember the MST episode \"Angels Revenge\"? Where Jim Backus was playing a right-wing militant and you didn't believe it for a second while he puttered around, painfully phoning it in with a look of horrified embarrassment? That's Jon Voight in this film. He produced the first one for some God-unknown reason, and I guess he felt compelled to try and salvage this one.\n\nAll that said, it's pretty fascinating how poor this is. Everything looks so lazy and sloppy, like everyone just shrugged and said \"screw it, it's Baby Geniuses for Christ's sake, who cares?\" The Bubble Baby in the orange ball suit has a particularly horrendous CGI effect he's plastered into toward the end that had us all crying out in outrage over how lame and lazy it was.\n\nThese poor kids will never live this down."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "gothicgoblin1334",
        "review_rating": "1",
        "review_title": "Belongs in a trash dump, just like a diaper",
        "review_detailed_main": "This movie is stinker then a diaper, honestly. It's one of the worst sequels ever made; it's not like Troll 2 where it's so bad it's good, no it's just so bad it belongs in a trash dump! This film seriously has some problems. I have heard of Jesus fighting crime, Santa Claus, but babies? Here, let me rephrase that: Talking babies? Damn, they really need to get some better ideas here in Hollywood. This film isn't really creative either, and who else to make a crappy film but Nickelodeon movies? We know they screwed Lemony Snickets' book but this...(which came out the same year) is just a bad excuse for a movie, it does belong in the trash dump...just like a diaper. Recommended? Yeah right, see \"Rugrats the movie\" instead, even though that's a terrible movie it makes this film look good."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "LD Kant",
        "review_rating": "1",
        "review_title": "Worst movie...may the viewer beware",
        "review_detailed_main": "I recently got done watching this movie with a group of people. Two thirds of us had to be taken to the emergency room because of ocular bleeding. Please, for the love of God, do not watch this movie. I am warning you. It is the monster. It is the devil. It will steal your soul. By the time the credits roll, it will be too late. Don't try to regain what you have lost because it will be to no avail. Run, don't walk. Get away. RUN. PLEASE. SAVE YOURSELF. IT'S TOO LATE FOR ME. GET ON OUT OF HERE. GOOOOOO!!!! (Read that as \"Go!\" but emphatic, not \"goo\" but emphatic. that will make no sense) This thing requires ten lines of text."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Wizard-8",
        "review_rating": "1",
        "review_title": "Just as bad as the first movie",
        "review_detailed_main": "Although this movie is currently number one on the IMDb's list of the 100 lowest-rated movies, I wouldn't call it the worst movie of all time. I am a real movie nut, and believe me, I have seen much worse movies. That's not to say that this movie is good or even watchable, however. It's bad enough that it took a herculean effort on my part to make it to the end! I bet Jon Voight regretted his long relationship with producer Steven Paul after making this movie, though Voight has himself to blame for giving such an over-the-top performance that it isn't funny to watch. Shoddy special effects, main characters (the babies) who are extremely annoying, and a plot that has a number of loose ends are additional problems the movie has. It's all directed in such an unenthusiastic way by Bob Clark that you wonder why he agreed to participate in the first place. No, not the worst movie ever made... though I think it deserves a place in the IMDb's 100 lowest-rated movies."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "walken_on_sunshine",
        "review_rating": "1",
        "review_title": "Superbabies!:The Doc's Review",
        "review_detailed_main": "Superbabies the sequel to the horrible Baby Geniuses is unbearable.The animation on the children's mouths are absolutely noticeable and the dialog is poor and poorly delivered.This film is full of awful one liners and the script makes Power Rangers look like Pulp Fiction.The acting is very bad and boring and the characters are paper thin,ridiculous,unbelievable,and at times stereotypical.Lines like \"What kinda milk have you been drinkin\" of course coming from the black baby are funny only if you're into Bob Sagets comedy routines.The effects are beyond brutal and storyline is ludicrous,cheesy,corny,generic,stupid,and unintentionally laughable.Superbabies pretty much took the cheesiest line from every children's movie and mushed it into a script.This sequel is bad to the bone and unbelievably stupid.This must have been written by a cat on weed because when you're wishing you were watching teletubbies instead you know something is wrong.The only way I'll watch this again is if I'm wearing a straight jacket and surrounded by men with guns."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "eragon565",
        "review_rating": "1",
        "review_title": "This movie stinks!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jackdetwiler",
        "review_rating": "10",
        "review_title": "Babies are Cool",
        "review_detailed_main": "Babies are Cool!!! If you like babies, then this is the movie for you. Bob Clark is a genius for creating a movie about superhuman babies. Where does he get these ideas from??? Superbabies: Baby Geniuses 2 would have been more successful if Tommy Wiseau had directed it. My little brother likes this movie, he also likes babies. If you don't like this movie, it means you hate babies... WHAT'S WRONG WITH YOU?!?! The script for this movie was inventive and creative, because it was an accurate representation of a baby conversation. Did I mention that babies are cool? Like, Comment, and Subscribe if you love babies. Tomorrow we will be exploring www.legendsofequestria.com\n\n~With Love, Tommy Wiseau"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "That_Man",
        "review_rating": "",
        "review_title": "Never watch this movie, ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "PentagonDark",
        "review_rating": "2",
        "review_title": "Trust Me. It is not the Worst Movie ever made.",
        "review_detailed_main": "Everybody criticized this movie. OK. it is fine. It is not a good movie, it is worse one. But trust me. Not the WORST movie of all time. I have seen many much movies which is worse than this one. In IMDb bottom 100, many of the top 10 deserve to be the worst one. But not this movie. At least it gives a little entertainment. The concept of the movie was new. It is all from the children's point of view. it was a kind of new concept.\n\nI know many of you will not be with me. But according to me, it is not the worst one. Someone needs to rescue this movie from the bottom 1st.\n\nif you watched all bottom 10 movies, you will surely know, it does not deserve at least bottom 5-10."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "tim-aicher",
        "review_rating": "1",
        "review_title": "Horrible waste",
        "review_detailed_main": "I have 5 children from 4 to 10 years old. Finding a movie that is entertaining AND suitable for my kids is challenging but not impossible. There are only so many Disney and Dreamworks films you can rent so I occasionally take my chances on new releases that \"look good enough\".\n\nI should have looked closer, while Baby Geniuses (yes I rented that one as a new release as it came out) was a mediocre movie, it was cute and funny at times and my kids liked it. Besides it also had Kthleen Turner in it. If only I had seen the name Scott Baio on the Superbabies box before I whipped out my Blockbuster card I could have saved myself $4 and a disastrous Movie nigh at home. Not that Baio has the worst performance of the movie; that would be impossible with the job that John Voigt delivers. Voigt clearly lost a bet or really needs some cash.\n\nIf I bring home another movie like Superbabies, I will be banned from going to Blockbuster to pick out the family film on movie night."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Floated2",
        "review_rating": "1",
        "review_title": "why did they make this movie?",
        "review_detailed_main": "holy crap, this is one of the worst movies ever made, this movie is so dirt and garbage its a joke. Its a G rated movie but it isn't good, period, this is such a garbage pile of crap i don't even know where to start. The scenes and plots are beyond awful and the acting sucks. Making babies talk and act is a really stupid idea and it shouldn't be done again. This movie is such a joke and is disturbing like wow. Why on earth did they make this movie a series? The first one sucked and this one was pretty much the same, garbage and awful. Id rate this a 0 but IMDb doesn't rate that low so i was force to rate it a 1...don't waste your time and stay far away from this movie"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jeffreyflagenstien",
        "review_rating": "1",
        "review_title": "dear gawd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Nick_Taylor",
        "review_rating": "1",
        "review_title": "Cannot even begin to say how horrible this is.",
        "review_detailed_main": "Okay, so, we bought this on DVD with the first Baby Geniuses, thought it would be good.\n\nBoy were we wrong.\n\nThis is the first movie in which me and my family actually TURNED OFF a quarter of the way through. It just wasn't funny at all. It was awful, absolutely awful.\n\nAlthough, little (3 year olds) like this movie, so it's a nice thing to have on hand to waste two hours of your little kid's life...if you feel willing to pay $10 to get it.\n\nMy advice: don't see, get or rent this movie.\n\n1/10"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "dokkelly",
        "review_rating": "1",
        "review_title": "what a disaster of a so called movie...",
        "review_detailed_main": "let me get one thing clear,seeing a child act in a movie is a cheap try at being cute.But sometimes it is done well(home alone for example)but this movie is not cute.in fact it's cringe worthy,it is not only a cheap try at being cute,it one of the worst movies ever made and for good reasons,the effects suck,the acting sucks,the story sucks and not to mention it's child abuse.i had the nerve of seeing this sink bomb and i had to see a great movie to cover it up,so bottom line this movie is for morons and if you have any respect for children you would avoid this film at all costs,it's a pity that i can't rate this less than 1 star since the website won't let me."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "kronikjbb",
        "review_rating": "1",
        "review_title": "is there no limit to how bad movie can get",
        "review_detailed_main": "OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!! OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!OK, there is no limit, but those people tried to make a good movie and they had the money! This is THE worst movie ever made!!!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "freddyfromfnaf",
        "review_rating": "10",
        "review_title": "Missing child",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Lukaryo",
        "review_rating": "1",
        "review_title": "Varies from bad to unwatchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "blazesnakes9",
        "review_rating": "",
        "review_title": "This will go in the Zero Stars Zone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "nhpatt",
        "review_rating": "1",
        "review_title": "Simply awful",
        "review_detailed_main": "Awful film, do not see.\n\nThere are awful films that are so horrible that are funny to watch. This is not the case. I saw Baby Geniuses 1 a while back, a below average film and expected the second film to be similar.\n\nBut it is way worse, special effects are simply bad, plot is inexistent and jokes are definitely not funny.\n\nIt will remain as a testimony of the bad films Jon Voight has made for money. Worse of all this movie managed to get almost 10 million dollars at the domestic box office while brilliant films go unnoticed.\n\nAvoid at all costs."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "unforgivenmaster737",
        "review_rating": "1",
        "review_title": "Chachi as a starring role? If that didn't have you running to the hills, the rest of the movie will.",
        "review_detailed_main": "I'll have to admit, I've seen some bad movies in my time. From \"Syngenor\", to \"Burial Ground\", bad movies are my life. Of course there has only been one movie that I have never been able to conquer, for fear of my personal well being.\n\nThat movie is \"Baby Geniuses\".\n\nThe movie is unflinchingly bad, and it showed what happens when washed up actors (in that case, Christopher Lloyd, Kathleen Turner, Peter MacNicol, etc.) get another shot at immortality. The story revolved around a baby that was really hardcore super smart, and his twin who revolt with other babies and try to destroy the corporation run by Lloyd and Turner. They win, hallelujah.\n\nOf course, we're not talking about that movie, we're talking about the ACTUAL SEQUEL \"Superbabies: Baby Geniuses 2\".\n\nHow this thing got green lit, I have no idea. This must be how Satan works his way into our minds.\n\nThis movie continues the trend of having washed up actors in starring roles, and this year's line-up might just be better than the other. In the blue corner, we have Jon Voight, a perpetually useful actor known for his useless roles (see Anaconda), and in the red corner we have SCOTT BAIO. Three words: Charles In Charge. That's all that I have to say.\n\nFor a kid's film , this lacks imaginative ideas. For an adult film, this lacks actors, a story, a plot, a writer, and for that matter, reason.\n\nAvoid this movie like the black plague."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "funnyisbest",
        "review_rating": "1",
        "review_title": "Bruh",
        "review_detailed_main": "This movie is so terrible that it ended up at my dollar tree."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "tommiller247",
        "review_rating": "1",
        "review_title": "Terrible! Awful! Excreting? Who financed this film? (failures who don't belong in Hollywood).",
        "review_detailed_main": "This film was just AWFUL, TERRIBLE and EXCRUCIATING.\n\nIt has not plot, plain and simple.\n\nThe directing, well when you glance at the film, you'd think a clown made it.\n\nThe writing, um....I feel like whoever wrote this just got off his shift at Pizza Hut.\n\nWhoever financed the film, well they clearly DON'T belong in Hollywood. They are failures, plain and simple.\n\nEverything about it is terrible:\n\nThe special/visual effects look like it was don't in a high schooler's garage.\n\nIt is clearly a mess, a video about nothing and the only people who will ever watch it (including whoever is reading this) will see it only to see how bad it is, but I say to you, good luck! It's painful!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Katiewhitehouse",
        "review_rating": "1",
        "review_title": "I started to kill myself before I remembered the remote",
        "review_detailed_main": "This movie is so horrible that I was praying to go blind and deaf after the first five minutes.\n\nThose babies are so annoying the plot makes no sense and the acting is so horrible you would think none of them(being the adults) had ever been on film before, but it turns out to just be a really horrible script.\n\nIf you see this on TV DO NOT TURN TO IT!!!!!!\n\nIt would be a terrible mistake, and you will regret it for the rest of your life. I hope to forget this movie ever existed. Why do I have to go on for ten lines this pretty much sums it up, BAD. Oh and there should be a warning title on this movie. \"May cause suicidal thoughts, watch at your discretion\""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "menaspl",
        "review_rating": "1",
        "review_title": "11/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "fiwawe",
        "review_rating": "10",
        "review_title": "Super Movie From Sony Pictures.",
        "review_detailed_main": "A super movie from Sony Pictures .Very entertaining to kids and adults. Surprised It is very under-rated. A didactic movie . Super strong kids fighting evil with their intelligence and power. Great Comedy & Action. Wow!."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "jonethomsen",
        "review_rating": "10",
        "review_title": "This movie changed me on a deep personal level",
        "review_detailed_main": "This movie changed my view on socity, why do we as adolts choose everything, why cant babies controll our every decisision. TELL ME WHY! im now gonna get some dipers and begin to cry."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "pin-gas3",
        "review_rating": "10",
        "review_title": "The Best Film Ever Made",
        "review_detailed_main": "This film was the best film I have ever seen in my life! It was both gut bustingly funny but also tear jerkingly sad. The story is so deep it just brings you into this world the movie has made, every time I re watch this masterpiece I am always shocked at little things that I missed before. The specials effects where also amazing, the way the babies talk are extremely realistic and the fights are some of the most epic I have ever seen. If you have not seen this go see it now! It's too bad I can only give this film a 10/10 since I think its a 11/10. There are films that push the limits and blow your mind and this is one of them!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Corey_Anderson",
        "review_rating": "10",
        "review_title": "Watch this infantile masterpiece.",
        "review_detailed_main": "Bob Clark's evocatively enthralling fantasy epic sees the return of our beloved infant vigilante squad, and as it quenches our lusty and desired thirst for more naked baby, it leaves the audience satisfied in an orgasmic manner. However, controversy engulfs the film's systematic and clearly spontaneous manners of violence and drug abuse, claiming it to depict scenes extremely relative to that of the death of Baby P. Ignore that though. The menial topics of contemporary news can not, in any dignified manner, overshadow the sheer and awesome power of this infantile masterpiece.\n\nOf course I haven't watched this bloody film, who in the right mind would? Who in the right mind would write a screenplay for the scourge that is Bob Clark?"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "nathanbmnt",
        "review_rating": "10",
        "review_title": "Not Even Funny",
        "review_detailed_main": "I saw this movie with my friends just so we could make fun of it, but you can't even really do that, the movie is just so repetitive, boring, and ridiculous that you stop laughing at it start smashing your head against a table. The plot makes no sense and there's nothing holding the movie together, it's like the director made it terrible on purpose just to torture whoever sees it. Don't see the movie, even if you just want to make fun of it, it's just way too terrible. If I had the option of choking myself to death and watching this movie again I would choke myself to death. We honestly only got through forty-five minutes of the movie before turning it off, but just those forty-five minutes have scared me for life."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "greenstreetelite13",
        "review_rating": "10",
        "review_title": "Best film ever!!!",
        "review_detailed_main": "When seeing this film on the bottom of IMDb's list of top 100 worst films ever I was shocked. This film has everything, the first time i saw it I cried at how beautiful it was. All the characters have such depth and meaning into them especially characters like brain boy and bouncing boy who steal the show. Don't let me get started on the visual effects as not eve Avatar can top this masterpiece, this film looks so good I'm am appalled that it is not even out on Blu-ray! Overall this film is for everyone, the jokes are hilarious, the action scenes are nail-biting and the polish of this family adventure is perfectly executed. Superbabies: Baiy Geniuses 2 is definitely not one to miss!!!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Frank-",
        "review_rating": "10",
        "review_title": "This movie is pure genius!",
        "review_detailed_main": "This is one of the greatest films of all time. It is incredible. The fight scenes alone is worth it. I bought this movie and loved it right away. So far I've seen it 6,234 times. The plot is brilliant. An EVIL meanie tries to brainwash a bunch of kids! But don't worry though, the SUPER BABIES come in and stops the bad guy.\n\nThis movie is perfect in every way possible. But if your under 18 you might want to see it with your parents. It has intense violence and it even has some cursing. Speaking of the violence, the fight scenes in this movie makes The Matrix look like sissy fighting.\n\nThis movie is one of the best things ever. Turn off your computer. Go out and buy it NOW."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "dttee",
        "review_rating": "10",
        "review_title": "The American Movie",
        "review_detailed_main": "I walked. Walked. Into the theater. With a sense of pride...of course who doesn't feel pride upon mentioning the name \"SuperBabies: Baby Geniuses 2\" to the ticketer? The movie had epic scenes of puking on people walking down the street, potty breaks, potty mishaps, potty explosions, potty potty, and potty diaper poop. If you little boys want to learn how to unload a ton watch this piece of crap?? wat?? wat?? i mean incredible motion picture today. Why don't people enjoy SuperBabies? Is it the lack of killing? Our world has enough killing. We should learn to enjoy the art of poo and pee and it's many \"contraptions.\""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "zapit100",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "After viewing this extraordinary work of masterful art all I have to say is \"WOW!\" This may be the greatest movie ever gifted to man. It's sheer splendor is entirely unrivaled in the world of cinema. Before watching Superbabies: Baby Geniuses 2, you need to ask yourself; \"Am I ready for the most beautiful piece of artful wonder ever to be handed down through the vestiges of man's wisdom?\". Before I watched Superbabies: Baby Geniuses 2, I would lay in my bed thinking to myself \"All I want out of life is to watch a movie centered upon extremely smart toddlers saving people.\" You may be wondering \"Is Superbabies: Baby Geniuses 2, really as good as you say it is?\" The only answer to this question is through watching this awesome achievement of writing and filmography. I suggest you buy this movie, in fact, I suggest you buy one copy of this movie for every member of your immediate family and their friends."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Alex-217",
        "review_rating": "10",
        "review_title": "Vintage Bob Clark ------ Bob brings out the best in adventure for youngsters with this one -- he saved it for the end!",
        "review_detailed_main": "I viewed this film on television, a French language version, over the Christmas(2007)Holidays while visiting in Alma Quebec, Canada (region of Lac St-Jean). I missed the opening credits and had no idea who had directed this 'delightful' work. Before long I was guessing this wee treat to be the work of Bob Clark, and am now delighted to learn that he is indeed the director. Few of those watching with me spoke English, and even though this film is very \"American\" in every aspect, everything seemed to work for this audience, who truly enjoyed all that was offered. Bob's work, in my opinion, from Black Christmas to the present had occasionally been 'uneven'(although come to think of it, what director has not, at times, been 'uneven' over a career) I think A Christmas Story is his best work, a film I enjoyed immensely. However, Super Babies is a darn fine match and Bob is able to capture the essentials required in childhood adventure - something in it for kids of all ages. I'll miss him, and I will never forget the \"little boy\" in him. DMR"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "joe-staley",
        "review_rating": "10",
        "review_title": "Heavyweight of our generation",
        "review_detailed_main": "Despite the heavy controversy surrounding this film, I believe that this is one of the true masterpieces of our time and gets very little recognition for its engrossing and highly technical special effects. Also the acting in this wonderful film is second to none and creates such immersion that after the film finished, I felt my life had no meaning. I took my would-be girlfriend to see this film on release, I don't understand why she never called me again, I mean who could possibly dislike the quirky humor and top notch acting, even to this day I feel that even the famous 'Shawshank redemption' Cannot hope to compare with this true masterpiece. All in all this film is a true heavyweight of modern cinema, it's a must buy!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "loveloni",
        "review_rating": "10",
        "review_title": "Better than \"Shawshank\" and \"Godfather\" combined!",
        "review_detailed_main": "This movie is brilliant. Excellent screenplay, wondrous acting, and amazing special effects. I nearly crapped myself when I saw those delightful tots bouncing around the screen. It is pure fun for the entire family.\n\nGo ahead, pick up the DVD, I assure you it is AWESOME! A masterpiece! I mean, the lines in this movie are classic and very quotable. This movie is fantastic, and definitely in my top-ten list.\n\nIt has a great message of getting active and is also great for adults! Go buy it (not rent- BUY!) today, and you will not be disappointed. You will certainly treasure it for years to come, and even share it with your grandchildren."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "tastes_like_purple",
        "review_rating": "10",
        "review_title": "A Brilliant Kaufman style look into the psychology of American youth.",
        "review_detailed_main": "This movie is everything wrong with America. but there is something brilliant about that. it fails on every single level, effects, acting, score, editing, direction, lighting, background, and sets. But if you look at it, this film was obviously made by adults, to sell this as a summer forgettable to young young YOUNG children. but it becomes more than that. its a movie that shows how we can deceive the youth into taking whatever garbage we shovel them (a very obvious hint to religion and how we have destroyed our natural resources leaving the next generation hopeless.)its a movie that teaches us that the American public can forgive racial stereotyping if everything else around it is that terrible. it really shows how mediocre we are as a society. although i liked dissecting this movie to its core, its still quite possibly the worst movie ever made and sitting through it will scar you as much as a 90 hour rerun of two girls one cup. but other than that. check it out. illegally download it. don't support the film makers. but do check it out."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "theotsouk",
        "review_rating": "10",
        "review_title": "Great Movie!",
        "review_detailed_main": "I was bored so I went to rent a movie at he video club. I had seen all the movies except one. The Superbabies: Baby Geniuses 2 . When I went home i thought it would be childish but the messages it gives makes it touching and great to watch. I cried watching this touching story and the script was amazing. Especially when the babies talked... I loved it.It was funny. Thank god people make movies like that !\n\nThe plot is about babies. Nothing more. Cute little babies. It is a really great movie. A must watch film that must be seen. If you watch this film i bet you will get the same feelings as i did. I hope this review helped you decide on your next film"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Rallybagger",
        "review_rating": "10",
        "review_title": "Best....Movie....Ever........................",
        "review_detailed_main": "This movie is quite possibly Scott Baio's best performance...Although he is ignored by the wonderful and delightful performances by John Voight and the babies, Scott Baio's performance could go right up their with Marlon Brando's performance in THE GODFATHER and Vivian Leigh's performance in GONE WITH THE WIND. The movie is also great quality springing from best direction----to best cinematography. I highly recommend this movie to anyone who loves great movies...It's a masterpiece to say the least...All I can say is....Give Scott Baio the Oscar*.....NOW! I loved every minute of this joyful, yet tear jerking event....John Voight hits all the right notes! Masterpiece....I bow down to the worlds greatest movie ever!"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "sploshmole",
        "review_rating": "10",
        "review_title": "phat film mate",
        "review_detailed_main": "this is one of the best films I've ever watched in my life when it was released i went to the cinema with my mum and we thought it was great i watched it week after week day after day i would rate it 10 out of 10.\n\nI'm not sure because i don't understand it but i think that its is about some well cool babies that get really clever and then they save the day.\n\nthe reason that i think it is so good is because it has got a great plot. and great characters. and is a masterpiece. a classic. even better than The Godfather.\n\nSo do your self a favour, watch this film with all your friends and have a good laugh.\n\nthank you. my name is ian."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "anubistheniceguy",
        "review_rating": "10",
        "review_title": "Masterpiece, no less",
        "review_detailed_main": "I used to think that the godfather was the greatest movie of all time, but after seeing this movie, I am ASHAMED of myself This movie is like if scorcesse and tarantino mixed their best ideas with nolan and got ludwig to do the score If you haven't watched this movie because you're busy, quit your job or throw your kid out of a window and watch this amazing movie"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "baconmaker",
        "review_rating": "10",
        "review_title": "Best movie I have ever watched",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "cottonfluffs",
        "review_rating": "9",
        "review_title": "Touching, insightful, a masterpiece.",
        "review_detailed_main": "Never before has a film touched on such delicate issues as coming of age and the loss of innocence as expertly as this. It follows the story of main character, baby Christopher, as he crawls away from home, driven out by his alcoholic and abusive twin sister Jennie and takes up a life of organized crime. That's right, this film can be compared to 'The Godfather', and if I am to do so, I must say that it is indeed precisely 3146 times better.\n\nA film like this only comes around once in a life time. This is our Charlie Chaplin. The Magnum Opus of this generation. At the risk of starting a religious war, the director of this film, Bob Clark, should not only be appointed as pope, but also receive the title of God, 3 Nobel peace prizes, and also a butler space monkey. He makes Jesus look like Hitler.\n\nThat is really all that needs to be said. In conclusion, Jesus is worse than Hitler."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "matthew-pullen",
        "review_rating": "10",
        "review_title": "Don't believe what you hear...",
        "review_detailed_main": "This movie is actually quite funny. I enjoyed it, the acting was superb and the writing wasn't half bad. Those babies cracked me up every time with their antics. You should see this, despite the propaganda that worthless critics throw out there. Give it a chance, the idea is very original. The only complaint that I can actually think of is that the film doesn't seem to be quite long enough, they could have added more. One standards of laughter though this ranks up there with such recent classics as Old School, Anchorman, and the 40 Year Old Virgin but unlike those this doesn't have to appeal to horny teens who don't have morals that tend to have bad taste in movies anyways. Trust me on this one, this movie does not deserve to be in the bottom 100, especially not the bottom five."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "thefiresidechronicles",
        "review_rating": "9",
        "review_title": "Sunglasses wearing bad-ass babies.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "tylerdusek",
        "review_rating": "10",
        "review_title": "AMAZING!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "brightgreengirl",
        "review_rating": "10",
        "review_title": "An Emotional Life-Changing Art Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "viktor-gyoshev",
        "review_rating": "10",
        "review_title": "I am really sad that this movie is so underrated.",
        "review_detailed_main": "I remember having the VHS of this when i was younger its been a while since then but i still remember that i've rewatched this at least a dozen of times and the movie was awesome. I realise now that it looks pretty lame but you know what guys.. if you give this movie a one then you are just some old grumpy guy that hates on movie targeted for kids. Better not watch movies for under 12 anymore."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Oh, man! What an exciting film!",
        "review_detailed_main": "Back in late summer 2004, I've seen a trailer for \"SuperBabies: Baby Geniuses 2\" in the theater, and I thought it was so exciting! I mean, I'm an action film fan, and this is a family film, so I thought this film would be excellent to see! A few things to note, though: 1. I like the trailer! Everything is funny, from the bouncing boy (My little brothers were laughing!), to...well, I don't want to describe it, but it has something to do with...Cupid Girl! 2. Also about the trailer: \"Shake It Up\" by The Cars - I love that 80s music! 3. Don't Walk...Crawl! Yeah, I definitely would have liked to crawl with a million other jealous moviegoers to the theater to see this movie! These things about the trailer definitely convinced me to have a go at this movie! Have you?"
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "lorandgyorgy-96671",
        "review_rating": "10",
        "review_title": "Better than the original",
        "review_detailed_main": "Funny, well acted, good plot and amazing special effects. Also better than the original."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "windowsfan-78126",
        "review_rating": "10",
        "review_title": "This was the best movie I have ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "eduardoburrito",
        "review_rating": "10",
        "review_title": "Best movie ever created",
        "review_detailed_main": "This is the greatest thing that has ever come out of cinema. Truly a masterpiece. If you don't like it... you are lying to yourself, and (more importantly) to ME! This is true cinema and it made me even tear up a bit. Please watch this movie I love it so much."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "TinyWindowless",
        "review_rating": "10",
        "review_title": "so good",
        "review_detailed_main": "This movie was the best movie I've ever watched 10/10 it was so good especially because it has Bounce Boy in it. I wish at the end Kahuna would bring Bounce Boy with him because they would make an awesome crime-fighting duo, they're my favourite hero-sidekick duo. I hope they make a 3rd movie that is all about Bounce Boy and his adventures, it would be very cool and I would pay a lot of money to see. I wish it had more Bounce Boy in it, though. I enjoyed every scene he was in but I wish he had more lines. He was the only character I could stand seeing, the other babies were so annoying and I had to stop myself from projectile vomiting intensely whenever the other babies showed up on-screen. Other than that, the movie was amazing and I loved it a lot I will be telling all of my friends about it and rewatching it every day. #stanbounceboy."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "lfczachary",
        "review_rating": "10",
        "review_title": "Shawshank redemption had nothing on this",
        "review_detailed_main": "The 1/10 reviews have nothing going on upstairs. Imagine avengers endgame and star wars a new hope had a baby and its better than them, that's this movie. My favourite part was the whole movie. I actually had to to go to hospital over nearly having a heart attack over how good this is. I especially liked the Holy diaper grenades thrown by the catholic pope. John was the best baby of them all he fully destroyed everyone and could easily beat all the other puny baby's in a fight even if they all came at him at once, he's basically thor. I was especially surprised when I saw the justice league come out of no where to try and kill the baby's like calm down Bruce banner they're just kids. There is so much I could write I'm just so excited about how good this movie was, I'm lost for words. Imagine actually killing a ferret with a bouncy ball like WHAT!!!!!!!!!!!!!!!!! Oh my days. Basically all I can say is watch the movie it'll sweep you of your feet over how amazing it is this is truly what terminator should have been (I think they might have even stole alot of the concept)."
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "wii64",
        "review_rating": "",
        "review_title": "Worst Film Ever?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "iop98422",
        "review_rating": "",
        "review_title": "Don't watch this movie and save yourself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Sad Way for Clark to End His Career",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "braidlae",
        "review_rating": "",
        "review_title": "I hated this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "Writer_Commentary",
        "review_rating": "",
        "review_title": "Isn't Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0270846",
        "movie_name": "Superbabies: Baby Geniuses 2",
        "movie_rating": "1.5",
        "review_username": "nitzguy20",
        "review_rating": "",
        "review_title": "Dear Lord",
        "review_detailed_main": ""
    }
]