[
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "binaya27",
        "review_rating": "9",
        "review_title": "Masterpiece for Indian Cinema",
        "review_detailed_main": "Its rare, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshya Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! Such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has a important part to play in. The acting is superb. Everyone, and I mean literally everyone has acted so well that sometime you feel like you are not even watching a movie. Anyone who loves watching Bollywood movies, should not miss this classic. It's a classic, a masterpiece and kind of movie that is made once in a decade. Simply stating it, Its one of the finest movie ever made in Bollywood."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "amoghbiet",
        "review_rating": "7",
        "review_title": "And Bollywood delivers a rare gem!!!",
        "review_detailed_main": "If you are a Ek tha tiger, Dhoom 3, HNY, Bang Bang fanboy/girl, do not watch this movie and do not read this review either, it's just not for you.\n\nAkshay Kumar do not need to romance hot girls, do not need to dance and sing, do not need to do melodrama to deliver a hit movie, he had shown us this back in Special 26, he has done the same here in Baby. The cast is a perfect one and there are no flaws.\n\nMOVIE: It has everything a good espionage thriller need to have- 1. Good cop bad cop routine 2. Cute chick beating the pulp out of the bad guy 3. Super cool combat scenes 4. No unnecessary sentiments and drama 5. Some brilliant dialogues 6. few laugh out loud scenes 7. It focuses on modern warfare--an indirect one--proxy war, which is much spoken about in reference to India in recent times 8. Kick ass background score 9. Cool Spy v/s bad guys 10. funny Akshay Anupam Kher duo\n\nOn negatives: Yes even i think the movie was a bit lengthy, if the director had trimmed it 10-15 minutes it would had been great. Yet, this movie is a rare feat. Bollywood rarely delivers movies like this. Its a must watch if you like sensible movies. And regarding the negative reviews, just do not pay any heed to them, for THIS GEM IS NOT TO BE MISSED. Neeraj Pandey as a director has done a brilliant job."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "namashi_1",
        "review_rating": "9",
        "review_title": "An Engrossing Film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "robotatbb",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "One of the best thriller movie ever made in Bollywoo. Everything looks realisti. Superb acting by Akshay Kumar. Probably the best at that time."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "gourav09071994",
        "review_rating": "10",
        "review_title": "A thriller that India will always be proud of !",
        "review_detailed_main": "Though I don't categorize movies on the basis of their region or country, I had mentioned this title regarding India being proud of this movie. This is because I have heard people yelling in social media and in public about the low standards of Indian movies specially thrillers which either lack thrill or are copied from Hollywood. I agree to them o most occasions but this one. And I would strongly recommend people who complain about the lack of good movies in Bollywood to go and watch it. Or else stop complaining these craps.\n\nComing on to the movie, it describes the biggest agenda world is facing right now, i.e, Terrorism, in best way it could. The story comprises of many small incidents which are bound together so slickly that we feel the smooth flow of script. We are lost in the hustle going on in front of us and are keen to know what is coming next. First half makes the plot for the movie and the second half unleashes the execution. Each and every scenes complements its predecessor and we are biting our nails without even noticing it. Last hour is full of thrilling actions and grueling proceedings.\n\nTalking about the acting , I must say Akshay Kumar has delivered a role of his life very convincingly. He lives his character and puts that extra amount of thrill via his superb action. Danny plays his role quite brilliantly. Anupam, Tapsee, Kay Kay and other supporting casts act life to their characters and make this movie a combo of power packed performances.\n\nDirector Neeraj Pandey has already made a Wednesday and Sp 26 in past and thats why there was a very little scope for improvement for him. But I would be lying if i don't say that this is a notch higher that his earlier masterpieces. Editing is quite crisp. Screenplay is the soul of this movie while BM is equally engaging. Cinematography is grand and deserve applause. Dialogues are apt and support the movie a lot. Music is average and rightly so. Choreography is nil while action is breathtaking.\n\nIt has a few flaws here and there in a few scenes but those are hardly noticed due to the fast paced drama and screenplay.\n\nOverall, a standing ovation for Neeraj and Akshay to give us Indians a movie to feel proud of. It can easily go into books as one of the best Hindi movies.A movie of Hollywood standard and execution. And who knows Akshay might get a shot at his dream of wining a National Award. I won't be surprised if he gets one along with Neeraj Pandey. It also has a potential to be India's official Oscar entry next year.\n\nI have rated this movie comparing it to other Indian movies...otherwise I would universally give it a 9 or 9.5."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "raviuppal800",
        "review_rating": "",
        "review_title": "Best Film Of Akshay Kumar..If u like real movies must watch it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "s-padmavijayan-919-952283",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "Really well directed and excellent movie. Different approach and most important is the gripping story line and narration. A \"MUST WATCH\" movie in theater. The cinematography is good and is a delight to watch and synchronizes well with the movie. And needless to say, one of plus points of the movie is Akshay Kumar's acting as an authentic security officer. Taapsee is a delight to watch. Rana Daggubati's acting is also very good and has done a very good job as another security officer. The storyline and the plot are new and refreshing which highly complements the movie. The songs are good and matches well with the movie without boring or torturing the audience. If you liked the songs in Neeraj Pandey's previous movie \"Special 26\", then you are sure to like this too, actually the songs are even more good in Baby. And, needless to tell about \"Neeraj Pandey\", the director who has given us epics like \"A Wednesday\" and \"Special 26\". He has just proved his mettle yet again."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "alwaysplanb",
        "review_rating": "10",
        "review_title": "One of the Best!! Well... at least the Second Half is!",
        "review_detailed_main": "I'm a movie buff and watch almost every movie. Last time, I was so excited about a movie was when I saw Ugly! Talking about Neeraj Pandey, I'm among those very people who didn't find the climax of Special Chabbees exciting. In fact, I was able to guess the finale long before it started. And so for me, the finale was the weakest link in Special Chhabees. For A Wednesday, it was a great thriller from start till end.\n\nNow coming to the Baby! The first half started with bang and I was really looking forward to the movie. However, right about the interval, I was thinking that it wasn't all that great! And that's where I was wrong. With the entry of Taapsee Pannu, started a race against time. And here's where Neeraj Pandey really really blew my mind. That's how a thriller is made. Stupid movies like Race 2 ought to learn from this movie. The second half kept me at the edge of my seat that seldom any Hindi movie does.\n\nKudos to the Baby team for contributing such a gem to Indian Cinema. Thrillers like A Wednesday, Ugly, and Baby are a rare treat to movie goers like me, who just can't leave their brains at home. The critics can find all the fault they want in this movie, but for me it's one of Neeraj's best.\n\nAkshay did a very good job. He is a versatile actor who should do more sensible movies instead of movies like Once Upon A Time In Mumbai - 2. But I'm all praise for Tapsee Pannu. Unlike every Telugu movie, where the heroine is a Bimbo, Tapsee showed her acting prowess with this movie. Anupam Kher was excellent as always. Not much can be said about Rana Daggubati as his role wasn't meaty enough!\n\nAll in all, I really enjoyed this movie. Will definitely see again on Silver Screen, too! Urge you all to watch this movie if you really want a fast paced Indian thriller."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "utsavc",
        "review_rating": "7",
        "review_title": "Overall a good movie by Akshay Kumar",
        "review_detailed_main": "Considering all the movies Akshay Kumar has worked on in the past few years, I think Baby turned out to be a way better movie than what I expected. There were some scenes where my reaction was like \"what? why would you even do that?!\" or \"that's not even possible!!\", but then there's Akshay Kumar for you and it is definitely entertaining. Anupam Kher also added some humor to the movie, being the amazing artist that he has always been. The manner in which they've shown how terrorists plot and plan their moves and how they maintain secrecy is actually very intriguing. I wouldn't say that the intense scenes in the movie were nail-biting, but Neeraj Pandey did squeeze in a few such scenes in the movie where you wonder what's coming next. Some of the explosions in the movie were animated and the quality of animation was terrible. For those 2-3 minutes, I did wish they had spent a little more money and time on getting the visualizations correct. However, overall, I enjoyed the movie and I think is good entertainment for a one-time-watch. I definitely recommend this movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ramneetsingh-singh",
        "review_rating": "9",
        "review_title": "Best film by Akshay Kumar till date",
        "review_detailed_main": "This is one of the best movies ever made in thriller category. Akshay has done brilliant stunts in this movie. The dialogues were incredible. This is a movie that you can watch with your family and get a message out of it too. I totally recommend you to watch this movie. It will impress you as much as Special 26 did. This movie will be a blockbuster. That's all i have to say!\n\nREPEAT*** Don't read this******* This is one of the best movies ever made in thriller category. Akshay has done brilliant stunts in this movie. The dialogues were incredible. This is a movie that you can watch with your family and get a message out of it too. I totally recommend you to watch this movie. It will impress you as much as Special 26 did. This movie will be a blockbuster. That's all i have to say!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "santhosh-10290",
        "review_rating": "7",
        "review_title": "Baby",
        "review_detailed_main": "Good Movie. Akshay Kumar and everybody acted very well in the movie. BGM and fight scenes in the movie was excellent. The movie had many interesting scenes and many thrilling investigation scenes in the 1st half. But in the 2nd half the movie bored a bit. The movie had many interesting and thrilling scenes. Heroine is not needed in the movie. Good Movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "prashantsaini76",
        "review_rating": "9",
        "review_title": "Finally, Bollywood did a perfect Hollywood this time.. !!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vishaldesai516",
        "review_rating": "7",
        "review_title": "One of the best Thriller",
        "review_detailed_main": "Rarely you come across an Indian movie that doesn't hit a single false note. BABY is one such film. Writer-Director Neeraj Pandey has made a brilliant film that is not only technically at par with the best in the world, but it's also a dispassionate non-judgmental take on terrorism that's completely devoid of jingoism and is extremely gripping. Full marks to Producer Bhushan Kumar for believing in such a landmark film, backed by exceptional marketing especially when it's devoid of songs. On the whole, BABY is one of the finest films ever made in the history of Indian cinema. Not only because of its excellent cinematic credentials but also because of the balanced 'Thought' behind the film. Neeraj Pandey once again proves that he's a genius. This time he proves, it's possible to better Perfection. We say, hey baby, don't think, just go for BABY. Cinema at its very best!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "bartom-612-185848",
        "review_rating": "3",
        "review_title": "Please don't trust the ratings and get carried away like me!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "abhishekkumar487",
        "review_rating": "9",
        "review_title": "Perhaps the best spy action thriller in Bollywood",
        "review_detailed_main": "Baby is Bollywood's answer to Argo!!!!!!!!! The entire plot has been amazingly crafted. The performance of the entire cast was amazing. Bollywood rarely produces movies nowadays that are watchable, and in between comes this gem of a movie. The first half of the movie is good. However the real plot comes into play in the second half. The last 45-50 minutes of the the movie were so engaging that I could not remove my eyes from the theater screen. And the biggest merit of the film is the fact that there are no songs in the movie, only background music is there.\n\nAkshay Kumar has played a superb role. Its time that he should realize the fact that he looks really amazing doing films like holiday, baby and Special 26, and that he should stop doing mindless commercial movies. Danny and Anupam Kher are great at their roles. The action scenes are amazing, and cinematography is good. The best part of the movie is its direction. Neeraj Pandey has made two awesome movies earlier, and with this film he sets the standards even higher. Why cant Bollywood have more of Neeraj Pandeys and Hiranis and Anurag Kashyaps? Why cant Bollywood churn even two quality films every month?\n\nKudos to Neeraj Pandey, Akshay Kumar and co....."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "8",
        "review_title": "Fall little bit short to make a way to Oscar",
        "review_detailed_main": "BABY REVIEW- An epic thriller which deserves to be in Hollywood but Neeraj Pandey made it in Bollywood and raise Bollywood standard higher.i watched it with very high expectation and film completed all my expectation.last 30-35 Min's were inspired by Hollywood Oscar winner flick Argo.i am 90% satisfied with the movie and 10% disappointed because last scenes in Argo of interrogation on airport were nail-biting but Baby badly missed those scenes.performance wise Akshay Kumar proved that why he is my favorite after Srk and why he is the best for this role.if there would be an award for best actor in thriller category then he deserves it.remaining star cast were superb.Neeraj Pandey proves that he is king of thriller movies.another masterpiece after A Wednesday and Special 26.he proves why should we watch his movies with high expectations.i could have given 9 stars to the movie but as i already said climax were 10% disappointing.if Neeraj would have copied Argo climax then Baby would have been out of the world movie..so a must watch movie for all.here we have the 1st quality movie of 2015."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "Simply put Akshay's best performance,Neeraj's best film, one of India's best thrillers = A MASTERPIECE... A film made on international standards",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "pksxr7213",
        "review_rating": "10",
        "review_title": "This Baby will really blow your mind with its flawless and high voltage electric performance",
        "review_detailed_main": "Yet another compact and seat binding flick from Neeraj Pandey's side accompanied with dedicated power packed and flawless performance by our action king Akshay Kumar.The pace is as per pandey's rhythm with a strong message and the climax is nail biting which will increase your heart beat and the blood pressure. Special 26 trio has again shown their magic with their awesome performance. The other supporting actors are also impressive and mind boggling. The fight scene between Tapsi and Sushant is worth a special watch and shows the level of action by Tapsi.Some scenes will tickle you while the dialogues will make you crazy. so a must watch Bollywood movie and eagerly waiting for the trio next project in future... Don't miss"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mumbhaaai",
        "review_rating": "7",
        "review_title": "Baby - Sarfarosh of 2015",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ashishbhandari-82258",
        "review_rating": "10",
        "review_title": "Baby- Akshay Kumar",
        "review_detailed_main": "One of the best masterpieces of bollywood.The best in thriller.Story is amazing.Akshay Kumar bounds you with the film.Other actors also did well.Most important is its villain whose acting make you to hate him."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "Jini-B",
        "review_rating": "7",
        "review_title": "Gripping!",
        "review_detailed_main": "This movie grabs the viewer from the get-go. There are cool action sequences, and terror plots and the good guy, played by Akshay Kumar, going after them, makes for a good cinematic adventure. Akshay Kumar again delivers a good movie and a great story. The name seems a little out of place at first but an explanation is soon given for it.\n\nThere are twists and turns and every time the viewer is forced to gasp at the near captures. The supporting cast was good, though Tapsee Pannu looked a little uncomfortable at first. Kay Kay Menon paints a good picture as the villain and looks formidable. The script is the star of the film. The twists are further accentuated by the background music. Thankfully, no unnecessary songs in the film. A little lengthy and could have been edited better. Some cliches and the inspiration from certain Hollywood spy movies are evident. Anupam Kher's wig looked garish.\n\nOverall, a good movie. Anupam Kher and Akshay Kumar come together and create magic again. Deserves a watch."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sahilsupekar1997",
        "review_rating": "10",
        "review_title": "BEST SPY THRILLER EVER MADE IN INDIA",
        "review_detailed_main": "Film BABY will keep you thrilled till the end of movie...Realistic action sequences....realistic plot....great storyline....I am really glad that India is progressing"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "darpanthacker",
        "review_rating": "6",
        "review_title": "Not exceptional! Yet one of the better bollywood movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sanglap1",
        "review_rating": "3",
        "review_title": "Baby: Stupidity at its best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "avi-jh80",
        "review_rating": "10",
        "review_title": "Actually Right Act",
        "review_detailed_main": "If the bad guys have to be punished and good people are trying to correct, catch, tame with the right approach. It approach is incorrect.. wrong approach for the wrong guys is the 'right approach'.\n\nInstead of seeing this as an Entertainment movie, learning is needed to act with actions. So system needs to understand the practicality and implement solutions demonstrated in this movie with proper measures and support to eradicate bad guys from the world.. there is no end for such thoughts, these acts by the thoughts will keep originating and should be punished.\n\nThe movie is really good and actions are performed really good by Daring and really an actor Akshay Kumar !"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ketgup83",
        "review_rating": "8",
        "review_title": "BABY is a daring attempt which should be lauded and appreciated",
        "review_detailed_main": "Move over commercial masala potboilers with item songs, hero smashing 10 guys with a single blow and typical song-dance routine -Neeraj Pandey's BABY will give you goosebumps with fast-paced gritting thrills and excitement\n\nAn elite covert operation group BABY learns about bomb implanted in various cities in India. They must investigate and unravel the terrorist plan before time flies killing thousand of innocent citizen.\n\nDirected by Neeraj Panday, whose previous work included A Wednesday and Special Chabbis, BABY will consume you right from the opening as Akshay Kumar gets involved into the investigation and the cat-mouse begins. From here onward there is no turning back as the movie gives you nice twist-n-turns with well- choreographed action scenes. The scene where Akshay interrogates a suspect by stuffing him in a plastic bag is one of the best scene I have seen in recent time. The scene where Akshay Kumar's partner officer fights with another suspect before he comes for the rescue is simply mindblowing. Icing on the cake is the climax scenes which has been well executed. On the flip side, length of the movie could have been reduced little further. But brilliant screenplay, Art direction and cinematography is spellbinding. Background score gels well with the mood of the film. Dialogues are fine. It is Akshay Kumar's show all the way. A thumbs up to him for doing something different from his usual masala potboilers. Other actors do justice to their role\n\nOverall , BABY is nail-biting , reality-based action thriller that is going to give you goose bumps. Brilliant 4.5/5"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "prafullasrivastav",
        "review_rating": "10",
        "review_title": "Neeraj and Akshay's Terrific baby's Day out at silver screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ravikumarbb11",
        "review_rating": "10",
        "review_title": "One of the Finest Film of Bollywood and Akshay Kumar",
        "review_detailed_main": "Rarely you come across an Indian movie that doesn't hit a single false note. BABY is one such film. Writer-Director Neeraj Pandey has made a brilliant film that is not only technically at par with the best in the world, but it's also a dispassionate non- judgmental take on terrorism that's completely devoid of jingoism and is extremely gripping. Full marks to Producer Bhushan Kumar for believing in such a landmark film, backed by exceptional marketing especially when it's devoid of songs. BABY is one of the finest films ever made in the history of Indian cinema. Not only because of its excellent cinematic credentials but also because of the balanced 'Thought' behind the film. Neeraj Pandey once again proves that he's a genius. This time he proves, it's possible to better Perfection. We say, hey baby, don't think, just go for BABY.A Must Watch!!!!!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nvnqmar",
        "review_rating": "6",
        "review_title": "An average action thriller",
        "review_detailed_main": "People using their real names on covert operations abroad, wife calling her secret agent husband anytime on his cellphone (like they were actually using their personal cellphones during missions), only one tech guy handling the Intelligence department, a magical Apple hard drive surprisingly survives an explosion so close to it and many more... I mean Really?? Do we look like fools!! Anyway, I would have totally ignored all these small details if there was a Better Story behind all of this. But unfortunately the story was not gripping at all. There was a lack of depth in characters. Cinematography and fighting sequences were also not that good. Music was trying very hard to keep the audience not getting bored. And the end, that \"Mini Argo\" really set my mood me off. I was totally not expecting this from Neeraj Pandey. Till the end, I was waiting for the story to take it's sudden turn, but it never came. Not to mention what a waste of talents like K. K. Menon and Anupam Kher."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shafeeqthekid",
        "review_rating": "10",
        "review_title": "Neeraj Pandey has once again impressed with his \"Baby\" starring Akshay Kumar, Rana Daggubati, Taapsee Pannu and Anupam Kher in lead roles.",
        "review_detailed_main": "MISSION BABY SUCCESSFUL\n\nBABY marks Neeraj Pandey's third directorial feature , it's one of the most entertaining thriller films ever made about terrorism. Plot deal with A top-secret counter-espionage team 'Baby' is born after 26/11. Its officers, led by Ajay Singh (Akshay), have no official records or responsibilities - except to thwart terror attacks. If caught, the government denies about them\n\nAkshay Kumar gives the best performance of his career in this tremendously accomplished thriller, this was the best Akshay Kumar film I ever seen. Anupam Kher, Rana, Taapsee, Kay Kay Menon, Mikaal and Danny all the supporting cast done well with BABY. BABY tells an amazing but true story set against the International terrorism, it will keep you chained to your seat. In a way, the film is about the technique of movie-making, the spinning of stories that will persuade the audience they're true.\n\nThis is the kind of filmmaking that elevates suspense to a perception. For fans of the thriller genre BABY is a must-see, and is an all- around quality time at the movies for the mature crowd. The film fulfills its promise of being worthwhile genre and gets boosted by a good cast, good script, and the luck of timing."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sourabhcool-50",
        "review_rating": "6",
        "review_title": "flaws! flaws! flaws!",
        "review_detailed_main": "This movie has lots of goofs and flaws, the director constantly keep skipping the goofs and flaws to complete the movie.Cars are changing frame by frame from Honda to Toyota and many other scenes are over customized to fit for story. those who have rate it and consider it a great spy film, please again watch Zero dark Thirty and Argo.You all guys knows that Mumbai and its roads all filled with cars and crowds,but in many scenes the roads are all empty even in peak hours of Mumbai,this thing I certainly don't digest.not a mature spy film . cinematography is very basic and normal.nothing special about it. fighting scenes are old and common style.for real fighting scenes go and watch the raid 1 & 2 or John wick."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ar-khatale",
        "review_rating": "10",
        "review_title": "Akshay Kumar gives us his best action thriller...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shirifrnz",
        "review_rating": "6",
        "review_title": "Good intentions, average execution",
        "review_detailed_main": "Though I'm an admirer of Neeraj Pandey's work, Baby was not among the same league as Special 26 and 'A Wednesday', which was a class apart. Most Indian audiences would like this movie a lot but for me it was a case of an average movie that could've been a great one. There were a lot of loop holes(not particularly plot holes) and it could have been cut short by about 10-15 minutes. Some dialogs seemed as if they've been included just to please the audiences like Akshay's wife saying more than once \"Marna mat\"(Don't die). In fact she was one of the only miscast of the movie. Started 'not liking' her from her very first scene. First half felt like somewhat dragging, but the second half must've infused interest in the majority.\n\nThe movie had its pros too, first of which was the star-cast and the acting. Akshay Kumar was great, which he always is in these kind of roles, and everyone supported hi beautifully, be it the fight sequence from Tapsee Pannu, or the supporting roles of Anupam Kher and Rana Daggubati. Danny Dengzongpa seems to be in the second innings of his career and I'd love for him to play an elongated part in this one. Other good things about this movie were that it seemed good on the technical front and the research behind it bore fruits like the rest of the director's works. Finally, Rasheed Naz must be the perfect person to play 'Maulana Mohammed Rahman'.\n\nI personally liked D-Day, which was based on the similar story-line, a lot better than Baby though the majority might differ. Hence I won't say to stay away from this one, instead go for it and decide for yourself."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ramprasadramakrishnan",
        "review_rating": "1",
        "review_title": "you don't need to know that ,waste of time",
        "review_detailed_main": "ohhhhhh my god!!!!!!!. What a movie.\n\nNeeraj Pandey who directed movies like A Wednesday and Specal 26 comes up with this one which I feel is nothing but a waste of time. The story is like why are you doing this man why whyyyy I don't want to say anymore.\n\nIts like a movie compiled\n\nfrom a lot of short films. The acting is disastrous.\n\nWell this one is really overatred.\n\nHell man I am really disappointed with this, I wasted my 3 hours for this crap."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "akshayaniket10",
        "review_rating": "10",
        "review_title": "one of THE BEST MOVIEs I've seen",
        "review_detailed_main": "All proud Indians have waited long for this to come. Filmmaker Neeraj Pandey's 'Baby' is by no means a little baby in terms of its content and screenplay. This film nips in the bud of our country's perennial problem called 'terrorism'.\n\nAkshay Kumar as an Indian undercover agent Ajay Rajput is as tough as any real 'hero' would be. The film captures certain key pointers of how the government and Indian Intelligence functions. The makers have used the real names of terror groups, which make it even more authentic and believable for the viewer.\n\nThe action thriller smoothly sails from one tip off to another— before catching the big fish, Maulana Mohammed Rahman played by actor Rasheed Naz in Saudi. Danny Denzongpa (Feroze Ali Khan) as chief officer of a secret test team named 'Baby' leads the pack of a of handful men who are ever ready to sacrifice their life for the sake of protecting their motherland. The film throws light on the lives of such dedicated officers, who lead all their lives with a hidden identity.\n\nIt is A MUST WATCH entertainer for every Indian."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "akshayfan-83284",
        "review_rating": "10",
        "review_title": "Akshay Kumar's best",
        "review_detailed_main": "Best film of Akshay according me. One of the best screenplays of all time. Must watch for all cinema lovers."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vjnambu",
        "review_rating": "9",
        "review_title": "Edge of the seat action thriller",
        "review_detailed_main": "Baby is a superb espionage thriller with good storytelling, engaging script and patriotism with ample dose. Barring rana(he is a great actor but was not given much to perform), all the actors have given terrific performances. Akshay Kumar is perfect as Ajay, Danny denzongpa was classy and standard, taapsee was badass in her action scene, kk Menon shines in his typical style. But the show stealer is Anupam kher who despite coming in the last 30 minutes takes the limelight. Only drawback is the length and it gets dragged towards end. The walking scenes could have been edited. On the whole baby is another masterpiece from Neeraj Pandey."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "Harshithnagraj",
        "review_rating": "10",
        "review_title": "Gem of Indian cinema( Neeraj ka kamaal)",
        "review_detailed_main": "This is one of the best thriller I watched in my life. After watching lot of junk Bolly films this gave me different feeling. This film make you engage throughout and it will don't make bore at any moment. After special 26 Akshay and kher pair rocks in this film. Finally a must watch film can't be missed."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shivam-kothiyal",
        "review_rating": "7",
        "review_title": "A good Bollywood movie after a long time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rahulpanari41",
        "review_rating": "10",
        "review_title": "All time favourite movie",
        "review_detailed_main": "Direction, Acting, Background Music everything at its best"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "deepak-zeest",
        "review_rating": "7",
        "review_title": "Good Weekend Watch !",
        "review_detailed_main": "BABY When I saw the poster of the movie, it seemed to be yet another action movie with some loose plot and over the top unreal action which satiates the patriot inside us.\n\nWell, I was very much relieved to experience Bollywood casting off its clichés.\n\n1) The fight as well as the torture sequences were realistic with little melodrama.\n\n2) The plot had sequential sub-plots which were important and laid a good backing to the story as well as provided importance to the characters individually.\n\n3) No grand entries to main characters. All was in seam. For those wondering, the character of Anupam Kher was introduced in the last hour of the movie.\n\n4) The cliché of a girl trying to save herself from a \"villain\" while the \"hero\" comes to save her was removed in a very exuberant manner. You are in for a glorious treat. ;) 5) Surprisingly, the first half of the movie had no comic elements and the second half was full of it. Usually it happens the other way round.\n\n6) The climax of the movie will remind you of the climax of Argo. ;) However very clinical in its approach of showcasing terrorism, processes and people behind it, it does have flag-waving elements when it comes to patriotism. At least for me, it is something we need at the moment. It also contains subtle messages which may seem controversial but are sourced from real situations prevailing in the country.\n\nAn overly stretched movie by standard, it does have some very boring and unwanted bits. A good weekend-watch considering the patriotic occasion, you should watch it for its non-Bollywoodish treatment in the action genre.\n\n3.5/5"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "YP14",
        "review_rating": "10",
        "review_title": "Thriller and Nationalism at its best",
        "review_detailed_main": "Why is it this movie does not make 200cr and salman\"s rubbish makes 200cr easily is beyond belief. There is a missing jigsaw which does not make sense. Just compare it with Tiger Zinda Hai, BABY is by far a superior product and yet the public goes for salman"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "Dynames",
        "review_rating": "7",
        "review_title": "Bollywood Action Movie in Hollywood Sauce",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "kandarp09",
        "review_rating": "5",
        "review_title": "Strictly average movie",
        "review_detailed_main": "Some people are considering this as India's entry for Oscars? Seriously I think these are the same people who laugh at each and every joke and clap at some patriotic dialogue. Currently this has a 9.2 rating ..i mean what !!!? Its a one time watch film with average action scenes with a decent plot. Watch it to pass 3 hours if have to. Akshay kumar danny and anupam kher deliver a good performance. Another good thing is the cinematography and the quick pace of the movie which ensures no dull scenes except a very few. Second half is much better than the first. I think people are getting too patriotic over an anti paki film ."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "akshaytheboss-23921",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "As everyone says its a masterpiece. Strongly recommended. Best thriller movie ever made in India."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "destinyawait",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "This movie deserves another movie at least only if makers have a good script otherwise don't rush making the movie. The hero of the story is the script and screenplay very tight and it keeps you on the edge of your seat."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "arjun9716",
        "review_rating": "10",
        "review_title": "excellent movie",
        "review_detailed_main": "It was an outstanding movie from neeraj pandey after A Wednesday.THANX FOR SUCH AN Ultimate MOVIE.excellent plot. very well directed.beautifully acted. akki is back with a bang. movie was worth watching. this depicts the growth of Indian cinema. i would suggest everyone to watch this movie.it shows the real face of terrorism. finally i would like thank maharaja cinema for their awesome service,\n\nIt was an outstanding movie from neeraj pandey after A Wednesday.THANX FOR SUCH AN Ultimate MOVIE.excellent plot. very well directed.beautifully acted. akki is back with a bang. movie was worth watching. this depicts the growth of Indian cinema. i would suggest everyone to watch this movie.it shows the real face of terrorism. finally i would like thank maharaja cinema for their awesome service,"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "profilehack",
        "review_rating": "10",
        "review_title": "This is the best ever made movie in the HISTORY of Indian CINEMA",
        "review_detailed_main": "BABY.... BABY has lots of expectation.... & BABY delivers as it's best....\n\nA group has been created to take action against terrorism.... & this group is called \"BABY\".... & This story is all about this \"BABY\".... I just don't want to disclose the story.... just go to your near theatre & watch this movie by yourself....\n\nAKSHAY KUMAR.... He gives his 200%... He is just perfect.... He will carry this \"BABY\" with his own shoulder, alone.... just mark my word....\n\nDanny, Anupam Kher, & specially K K MENON are just awesome.... They deserve a standing ovation for their respective work....\n\nEach & every one of us is eagerly waiting for this kind of movie.... BABY is just perfect movie, which is the best ever made movie in the HISTORY of Indian CINEMA.... & specially THANKS to Director NEERAJ PANDEY.... Don't miss it.... Otherwise You not only miss a movie like BABY, You also miss the HISTORY OF Indian CINEMA....\n\nRATING: 4.90 / 5"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "yashrajs536",
        "review_rating": "",
        "review_title": "An above average spy thriller especially in \"Bollywood\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "anupapu8",
        "review_rating": "7",
        "review_title": "Pure Thriller but with a not so intelligent script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sandeepsep",
        "review_rating": "10",
        "review_title": "Baby is Bollywood And Akshay's Most Grown-Up",
        "review_detailed_main": "Excellent movie. Time well spent watching it. Kudos to the technical team for being brilliant and hats off to Neeraj Pandey for putting out another beauty.Baby is Bollywood's most grown-up action drama yet. Its scale is lavish, zipping between India, Nepal, Turkey and the Middle East, and its performances excellent. Akshay Kumar is terrific as Ajay whose core of steel you can almost feel. Akshay presents top-rung action - you practically hear opponents' bones breaking under his stabbing kicks.We are given a luxuriously-bearded mullah (based, clearly, upon a couple of real-life types) whose eyeballs have flames in them, and a crowd of followers who look as if they are ready for 'jihad'. They raise blood-curdling slogans, and talk nasty about 'Indiya'. The retaliatory measures undertaken by our hero are justified right in the beginning. Can't have hate-spewing terrorists who hide out in countries-ringed-by-deserts-and-sand-dunes threatening our sovereign nation, can we? So we are meant to cheer when the skilled counter-espionage agent Ajay (Akshay Kumar) breaks bones and smashes faces, while a gruesome interrogation sets the scene. If they can bash our guys, we are allowed to bash right back, no questions asked. Ajay and his band of merry men, the impossibly buff Daggubati, and the sulky computer expert Anupam Kher, cause some amusement as they race around Turkey and Nepal and the Middle East, tracking the baddies. But the whole is familiar and much of it is tedious.Other performances sustain Baby - Danny Denzongpa is superb as Feroz, unit chief whose love for nation and team often escape his quiet bureaucratic suits. Tapsee Pannu has a dazzling little role while Rana Daggubati provides muscle to the lean, mean team. Anupam Kher as sour-tongued strategist Shuklaji delivers with tart aplomb while Kay Kay exudes menace through unnerving, unblinking eyes."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rhitwick",
        "review_rating": "6",
        "review_title": "Ignore your intelligence and you got a good movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "manohardava136",
        "review_rating": "10",
        "review_title": "A nice movie",
        "review_detailed_main": "A good one from Neeraj Pandey. It shows the patriotism of a Secret agent.This One similar to Agent Vinod but of its own kind in a different way. Akshay's performance is just outstanding. Rana also has done a marvelous action.It reflects present day situation of our politics and youth. The direction part was good.Kay Kay Menon did a good work again as a villain after a shabby performance in Raja Natwarlal.Akshays handles his private life and agent life well.It appears like 'when a terrorist can do at a cost of his life,a soldier could also do the same to protect his country from bad guys.Finally the movie is worth watching at least once.I would rate it 10/10 for the screenplay and the story"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "farhanbachav",
        "review_rating": "6",
        "review_title": "Disappointed with straight flowing story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "jithinjohn003",
        "review_rating": "1",
        "review_title": "Horrible.. can't tolerate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ramandeepchahaljatt",
        "review_rating": "10",
        "review_title": "Fantastic action + thriller movie.",
        "review_detailed_main": "In one word FANTASTIC movie. It is different from other bollywood movies. As it has no extra drama no unrealistic effects. Everything in the movie is up-to-point. Askhay kumar has shown a great work in movie, he made the movie a sensible one not a rubbish. All actors in supporting role have also done a great job. Movie has no unrealistic or not possible in real life action no special effects or fake looking fight sequences. Story plot is just perfect, it goes on a steady pace and keep viewer in suspense. It has many scenes which will bound viewer to the movie. In fact movie is perfect from start to end. And no nudity or romance scenes. It is even better than the Akshay's last movie Holiday. Though Holiday may have a little more drama than this but this movie beats it in thriller section. If you are fan of other bollywood movies which includes lot of over drama and fake action then you may find this one a little odd, but it is great movie to watch with family."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "winaykumar",
        "review_rating": "10",
        "review_title": "Must watch action thriller movie!",
        "review_detailed_main": "This movie is strictly for people who respect art of movie making especially action thrillers. This movie might not make big box office collections because it does not have commercial elements like comedy, romance, songs, hot babes, unnecessary action, hyper sentiments and larger than life characters.\n\nThis movie is about people who want to save country from terrorism. It delivers with story, action, strong performance of actors, background score and last but not least simple and yet awesome direction. The movie has its flaws and who cares when you see the effort they put in making this movie and performance of actors they put to deliver to great product.\n\nSo folks, This movie is only for people who wants to watch no non-sense action thriller and masala loving people can keep away. All the best to makers of BABY."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "saurabh_bhuwania",
        "review_rating": "9",
        "review_title": "Whenever Akshay Kumar takes a break from slapstick comedy!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "russiantranslatorahemdab",
        "review_rating": "10",
        "review_title": "Finally a super duper hit from Akshay kumar",
        "review_detailed_main": "A super duper nationalistic movie, must watch for every proud Indian who puts nation above religion. It really needs guts to produce such a movie, and I wholeheartedly appreciate the filmmakers for highlighting some of the serious issues like how social media has now become the new platform to recruit innocent youngsters and brainwash them for anti-national activities. I appreciate the actors,technicians,story,producer,Director and for the first time The Censor Board. Must say... it a beautifully directed movie and the actors were brilliant in their roles. Loved the 'INDIAN' in bold dialogue. A must watch movie for anyone who would write 'Indian' as their nationality."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "prahladagarwal",
        "review_rating": "6",
        "review_title": "Action Crime Suspense Thriller with a weak plot!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "harmit_badboy",
        "review_rating": "9",
        "review_title": "An exceptional film, without any comparison !",
        "review_detailed_main": "Stop comparing BABY with ARGO/A Wednesday/ SPECIAL CHHABBIS or any others if you would. Its an exceptional tensed thriller, made by a creative director Neeraj Pandey. I am a huge \"Tensed film\" fan and have enjoyed watching BABY more than anything else. Simple yet complicated and professional this film is ! Hats off to all BABY team. Please Bollywood, grow with stories like Baby and keep entertaining ;D Again, stop comparing and start enjoying. I can give you any similar stories to any of yours so called BEST films, so dig it;D Please, don't use your mind, chill.\n\nCheers, to a must watch film ! BABY on the way.."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "A well shot, inspired espionage thriller that surprisingly has its director coming into form post 100 minutes.",
        "review_detailed_main": "Beginning with a typical filmy action hero sequence with a racy background score (where the loud beep of the transmitter/phone is strangely not being heard by the goons), it loudly declares itself as a more action oriented film till Kay Kay Menon comes in to impress right away followed by another engaging scene featuring Rasheed Naazfrom Pakistan. Offering just the usual, uninteresting stuff in its first hour (with another completely filmy jail escape happening in the middle of the road in broad daylight), the first major entertaining sequence of a clash comes in post 50 minutes leaving you stunned that how can the ATS team leave a self confessed, proved agent of terrorism just like that without making an arrest, after getting the desired information from him about another key suspect.\n\nThe visible flaws continue in the next sequence right before the interval too when again a terrorist (caught while making a possible bomb lying open on the table) is not arrested as per the strict procedure and is allowed sufficient time to trigger a blast killing many. Whereas in reality, the moment such a wanted man is caught, the first step taken is to see his clear hands, get hold of them quickly, so that he cannot press any button or take anything in his mouth leading to any further disaster. Hence till interval, BABY remains a well shot but average escapist kind of thriller that fails to make any major impact on the audience and offers nothing path breaking or fresh as compared to even Neeraj's last venture SPECIAL 26.\n\nBut fortunately, the tables get turned in the second half when all new faces enter the scene led by Anupam Kher, Tapsee Punnu, Sushant and Rana Dagubatti infusing new life into the BABY making it alive again. Here at first we have another long chase sequence involving Tapsee and Sushant with Tapsee simply excelling in her well-directed action scene performed superbly. And from here onwards the pace picks up in a significant manner with Neeraj coming back into the form after almost 100 minutes of the film with a terrific final hour bringing you onto the edge of your seats through an engaging action and tension crafted well. In fact the final 60 minutes get you so much involved that you tend to forget as well as forgive the mess displayed in its first half and that's exactly why the film turns out to be a winner altogether in the end with praises in your mind forgetting everything else.\n\nSo if one wishes to consider BABY from a commercial angle, then the film works well delivering the entertaining excitement anticipated (particularly) in its second half along with a worth praising cinematography (wonderfully capturing the action and the locales of Istanbul, Nepal, Abu Dhabi and more), a pulsating background score (that is a must for such thrilling ventures), fine editing (though a bit long), some well written dialogues coming at regular intervals and (especially) no songs to hinder the proceedings as usual (it has only one short love song in an unplugged form).\n\nAkshay Kumar performs as a solid actor, enjoying his action & great fitness level keeping an unsmiling expression throughout that suits his character perfectly. And its really great to see that he is supporting ventures like these on a personal level following the right path. Taapsee (as the agent) looks great and performs well too in her few scenes and so does Madhurima (as Akshay's wife). Danny, Anupam Kher, Sushant Singh and Rana Dagubatti, all play their cameo kind of short roles effectively. Plus both Rasheed Naaz and Mikal Zulfiqar from Pakistan make their presence felt, particularly Rasheed Naaz in his single scene through a peculiar kind of dialogue delivery demanding an instant attention.\n\nYet, despite all the above merits that mostly get visible in the film's second half, I am unable to rate BABY as an exceptional achievement mainly due to four reasons as mentioned below. Firstly for its entirely forgettable first half with many flawed sequences relying more on just action, cinematography and background score without any basic story as such.\n\nSecondly for shockingly wasting Kay Kay Menon, who was prominently featured in the trailer as the key villain, but was only given one major scene in the entire film so cruelly. How can one do that with an asset like Kay Kay Menon, I frankly couldn't get it?\n\nThirdly for being too convenient in its execution moving away from the reality with a typical filmy touch and cunningly playing it safe with reference to Pakistan and Muslim community (eying another commercial territory avoiding a possible ban) which further dilutes the impact justifying none.\n\nAnd lastly for having a borrowed kind of theme taking it from more than one source that is not like a Neeraj Pandey film unexpectedly. To elaborate further the major part of the film (its final hour) that actually works reminds you of the plot earlier seen in Nikhil Advani's D-DAY where they wish to take Dawood back to India. And then the final setting of making fake papers and arrangements to fly back home with the man along, is exactly like the structure of award winning English flick ARGO.\n\nSumming up, BABY has its moments in the first 100 minutes. But it's the final 60 minutes that turn it into a fast paced engaging thriller giving you the return of your money spent. And if a film's second half is much stronger than the first defying the famous jinx then that simply changes the game undoubtedly."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "iamabhikdas",
        "review_rating": "10",
        "review_title": "Triple Time Watchable Movie (Only for Intellectuals)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nitinmalhotra20",
        "review_rating": "6",
        "review_title": "Intelligent movie but lacked a punch",
        "review_detailed_main": "This movie is well made (although I did notice a couple of minor glitches) & is a rare intelligently Bollywood movie that you have to stay 'tuned in' to or you'll probably miss something crucial.\n\nThat said, I thought the movie lacked any punch at all. It's one of those that kept me excited but also kept me waiting for this punch that wasn't there.\n\nAlso - I couldn't help but think about Special 26! Heck Akshay looked exactly as he did in that movie too and that had Anupam Kher in a major role as well. I bet in a few years I wouldn't know which was which.\n\nBack to the punch - if the movie was based on real life events, it'd get a 10 because of the sentimental value but since it was just regular commercial Bollywood cinema, it missed a thump at the end. My expectation was also largely set by Danny's opening (through casting) where he said 'we thought we were ready but we were not' -- what's up with that!! They looked ready to me through and through and I unnecessarily kept speculating twists and face turns.\n\nWatch it for how intelligently the movie was made - nothing else really IMHO."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "frnkfbr",
        "review_rating": "1",
        "review_title": "Extremely overrated and over-hyped",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "premthebhai",
        "review_rating": "10",
        "review_title": "Baby Hindi movie review 10/10",
        "review_detailed_main": "Baby is a tribute to unsung heroes of our counter intelligence unit who take risk of their lives to fight the enemies of country and provide us a safe surroundings. Its story of bravery and patriotism that without any doubt deserves the attention of every one.\n\nAkshay Kumar is extraordinary as Ajay Singh Rajput. His eyes, expressions, body language everything is just perfect and he of course performs all the action scenes so beautifully and convincingly. It would not be wrong to say that he is the brightest spot of film. Danny Denzongpa is very good. Rana Daggubati looks amazing. Taapsee Pannu creates impact in a brief role. Kay Kay Menon is excellent in the role of terrorist. His expressions are just terrific and he is a treat to watch. Anupam Kher is very good. Rashid Naz is impactful. Sushant Singh is good. Madhurima Tuli is appropriate.\n\nNeeraj Pandey's Direction is excellent. Although his script could've been better but he has done a flawless job as a Director.\n\nBaby is a very good action thriller with lots of twists and turns. Watch the film for Akshay's performance and breathtaking mind boggling scenes."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "raghav-behani",
        "review_rating": "9",
        "review_title": "Take a bow",
        "review_detailed_main": "I had not seen the trailer, promo or any promotion about this movie anywhere, maybe it was not very highly promoted. I had literally no expectations from this movie. After watching this movie, I was stunned by the \"Hard-To-Believe-Its-Bollywood\" script, powerful performances, great action, amazing locations to name a few and the best part: NO SONGS AT ALL. Though completely different, it reminds me of Madras Cafe. A serious movie with no unnecessary scene at all. Shocking that the screen was just 25% full. I remember seeing Band Baja Baarat 1st day 1st show with only 2-3 people in the theater, a week later it was declared super hit. With BABY I expect it to go down as one of Bollywood's finest movies. I am not exaggerating anything. I am an SRK fan since I was born and off late I must say SRK's last sensible movies were Chak De India and Rab Ne ... Off late it is Akshay Kumar who is giving us some great movies. Special 26, Holiday and now Baby. This is definitely going down as one of my all time favorites. I wonder how pathetic crap movies like Happy New Year make so much money and gain so much hype and classics like Baby hardly get any hype which they truly deserve. Don't miss this one at any cost."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "chunnnnnu",
        "review_rating": "10",
        "review_title": "People must encourage the movie like baby for the health of Indian movies that is currently not in good shape",
        "review_detailed_main": "I don't think i have ever came across a movie that is as good as anything. for me this is one of those rare movie in the history of Indian cinema that is purely a substantive one, no propaganda at all nothing, very unlike to what khan movies usually does in India.\n\nI wish baby could also reach to 100 Cr club , 200cr, MAY BE 300 or even more... one should go and watch this movie and then can decide on your own whether or not this kind of movie should be commercially successful as well apart from all else.\n\nAll the actors including Akshay kumar,Anupam kher and others acted well enough to be able to maintain the flow of the film.\n\nThat's all...."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "subbuparam",
        "review_rating": "9",
        "review_title": "Decent movie, has rush moments and calming ones, definitely worth a watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rajatdahiyax",
        "review_rating": "7",
        "review_title": "Good to know that CIA,Mossad thing happens in India too!!!!!",
        "review_detailed_main": "While attempting to rescue a fellow Indian security agent in Turkey, Ajay Rajput (Kumar) discovers a terrorist plot against a Delhi mall which he and Jai (Daggubati) are able to prevent but learn that this was only the first in a series of massive attacks that have been planned. The two are members of Baby, a temporary secret agency dedicated to protecting India from terrorists. A team from Baby follows leads to get escaped terrorist Bilal (Kay Kay), but all of the squad members on the mission except Ajay are killed in an explosion. Ajay and officer Priya (Pannu) pretend to be husband and wife on a mission in Nepal. When a plan to capture a terrorist logistics planner goes wrong, Priya is trapped alone with him when he discovers she is spying on him. Ajay arrives to find that Priya has knocked out the villain. Feroz (Denzongpa), the head of Baby, sends Ajay to their deep asset Ashfaq in Saudi Arabia where Bilal is making his plans. The Baby agents kill Bilal and capture Maulana (Naz) whom they plan to bring back to India, sedated, under the pretext that he is a relative they need to get to India for a liver transplant. After the discovery of Bilal's death, the Arab police chief first attempts to close on the airport to prevent the murderer's escape and the police almost apprehend the Baby agents, but later when he calls and finds out there are in fact 3 people on the plane headed to India under a medical visa, he smiles and lets them escape. After Baby's success at bringing Maulana in to the Indian security, Baby is given permanent status."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "cherish-shirish",
        "review_rating": "10",
        "review_title": "Excellent Direction and Gripping Storyline - Baby is a must watch.",
        "review_detailed_main": "Neeraj Pandey delivers yet another masterpiece with Baby. After his earlier hits - A Wednesday and Special 26, the expectations were only higher and he sure has lived up to it. A gripping story line and an even excellent direction combined with a near flawless script makes this movie a must watch. Every actor fits their role perfectly and Neeraj Pandey ensures that each one of the characters makes an impression in the story. However small a role is, it leaves a lasting impression and forms an important chain in the events unfolding in the movie. He has maintained a very good balance between reality and on screen portrayal and has been able to show the danger of terrorism without painting every Muslim with the same brush. That the antagonist happens to be a follower of Islam is just a coincident. Although there are few factual errors in between and near the end of the movie, they can be overlooked considering the expressive freedom of a director. A movie well qualified to be like a Hollywood thriller, its a welcome change for Bollywood with young directors believing in delivering masterpieces rather than just giving out Masala entertainers. It will be a surprise if Neeraj Pandey does not win an award and bigger surprise if the Movie itself looses on being the Best. 9.5/10. Must Watch."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "avthedemon",
        "review_rating": "7",
        "review_title": "great movie but....",
        "review_detailed_main": "No doubt baby is great in every aspect be it acting or screenplay. But has anyone watched D-Day released a couple years ago. Baby seems to be inspired from d-day. The plot is almost same just conditions and locations are changed. Having watched d day already i felt little disappointed. But it's great movie no doubt. The screenplay is fantastic. But the use of gps-like technology indoors by akki looked over the top. And in the end giving the fate of all in hands of the saudi aldera policeman didn't go down well. While comparing to last movie from the same team , special 26 fared better. Anupam kher like always was excellent."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "gaurav-gusto",
        "review_rating": "9",
        "review_title": "mind blowing .. Brilliant performance by Akshay Kumar",
        "review_detailed_main": "mind blowing .. Brilliant performance by Akshay Kumar after Special 26. If It would be starred by Salman or Shahrukh, I might have crossed Rs. 500 crore mark. It is just because people spend money on Star not on movie. Whether that is just junk movie, people go and watch just because of starring by someone hyped and popular. This one is a splendid movie , a nice true-like story and extra ordinary performance by Akshay Kumar. he completely fit into the role of a terror fighter agent. This is because of his fitness and his Marshal art skills. This is a must watch movie. Much more worth than ticket it costs. Expecting now more such movies from Akshay hence on."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "simple-shivam014",
        "review_rating": "7",
        "review_title": "A straightforward espionage thriller that doesn't care to camouflage its violent theme with emotions",
        "review_detailed_main": "In his latest movie called BABY, director Neeraj Pandey takes you through an almost three hour action-fueled journey of a super effective, highly covert anti-terrorism cell called BABY, comprising of Akshay Kumar as Ajay Singh Rathore, Taapsee Pannu as Priya, Anupam Kher as Shukhlaji, Rana as Jai and led by Danny as Feroze Ali Khan. Basically, the main idea behind BABY is simple: to wipe out terrorism in five years or the cell itself gets wiped off the government's slate. The movie certainly flaunts some serious, riveting ideas at start and most importantly has heart to display what's necessary but the major problem lies in its originality and of course, its execution. BABY clearly derives heavy references from Ben Affleck's ARGO and Kathryn Bigelow's Zero Dark Thirty but still manages to enthrall you and most importantly, touch you with its patriotism-fueled execution.\n\nABY is a straightforward espionage thriller that doesn't care to camouflage its violent theme with emotions and has no scope for the usual glittery romance or brainless songs to tone it down. The best part of it is Akshay Kumar who has rightly earned the name ACTION KUMAR. He has become so adept at doing these kind of roles that in most of the situations he looks like a natural. In the movie, nobody could have ever pulled off the religion quote better than Akshay Kumar. As he says, \"religion wala jo column hota hai usme hum BOLD aur CAPITAL me Indian likhte hain..\" , you can feel the kind of authority he has on his role. He keeps you hooked into the film right from the first frame and rarely you'd feel the need to take your eyes off the screen. He's perfectly suited for roles like these and I'd hope that he doesn't do any of those bullshit comic roles in the cheap comedies that make him lose his authentic charisma.\n\nAnother engaging aspect about the movie is its tight screenplay. The movie ventures to various locations from Nepal to Saudi Arabia and still it doesn't lose any grip over its story. The dialogues are perfect for a patriotic film and one would find all his patriotism thirst quenched in Neeraj Pandey's BABY. The direction of Neeraj Pandey is brilliant to say the least. Some of the scenes are so intensely thrilling that they keep you permanently engrossed with your heart skipping a beat or two. One fight sequence in particular, featuring Priya (an agent) kicking ass of a terrorist, was a delight to watch. The whole fight is superbly choreographed and the dazzling fighting skills of a female agent in a Bollywood movie are rare to watch and that's what makes the whole scene special. There are many scenes in the movie that are so well filmed with situations that are equally thrilling and hysterically funny.\n\nWhile, the movie relies mostly on Akshay Kumar for most of its runtime, the supporting cast still manages to impress you with whatever they had to showcase. Anupam Kher as Shuklaji is extremely hilarious in his own funny ways and keeps you entertained with his even funnier one- liners and also, with his body language. And all of that he manages to do in a very short span as the role of Shukhlaji is of a mind of BABY which mostly reminded me of 'The Wolf' from Tarantino's 'Pulp Fiction', of course a funnier version of his. Taapsee, Rana, Danny and Rasheed Naz did a pretty decent job. Although, I felt the talent of Kay Kay Menon was completely wasted.\n\nBABY is clearly neither short, crisp and intelligent like 'A Wednesday' nor effortless like 'SPECIAL 26′ but still it's a sophisticated, modern and bold attempt of Neeraj Pandey that implements its resources to good use. The negatives can be its lack of originality, especially if you've seen ARGO and ZERO DARK THIRTY and an average, predictable second half which at times looks like a bit of a drag. Overall, it can be watched for its riveting direction, hilarious humor quotient, thrilling background score and the brilliant. AKSHAY KUMAR."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "dont_lookup",
        "review_rating": "1",
        "review_title": "Far Far Below Average Movie, Baseless Plot, Another Wasted Crap",
        "review_detailed_main": "When you see good ratings of any movie, it gets you excited to watch it. This is what happened to me and guess what, am extremely disappointed that I wasted 3 hours of my precious time.\n\nIts a typical Indian crap movie just showing random points and baseless actions, spreading sheer hate. Its hilarious when you try to copy big guns but actually you don't have the resources and guts to face out the real world realities. Totally biased story-line, below average Plot, and lousy action.\n\nNot Recommended !!!\n\nLiterally you want some fun, go watch Mad Max Fury Road or Children of Heaven or The Intouchables.. these movies are worth every second !!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shanay-singh",
        "review_rating": "8",
        "review_title": "Excellent attempt",
        "review_detailed_main": "Hats off to director Neeraj Pandey for an impressive attempt to make a Hollywood style spy thriller. With great performances by Akshay, Danny and Kay Kay Menon, Baby is successful in capturing the viewer's attention till the end with no songs and not much typical Bollywood nonsense in between.Baby's talented star cast delivers a power packed performance along with some good dialogues.Most of the action sequences are as good as any movie in Hollywood but the plot could have been a bit tighter, especially at the end.Overall a definite watch especially for thriller buffs and Akshay Kumar fans.Neeraj Pandey continues to impress after A Wednesday and Special 26 but definitely overrated at 8.9."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "Dipansu_Halder",
        "review_rating": "9",
        "review_title": "a must watch movie",
        "review_detailed_main": "Baby is a must watch movie by writer Director Neeraj Pandey. We had a big time expectation from him as most of his previous movies were super hit. And \"Baby\" was not an exception. Mind blowing screenplay which kept us stuck with the story. His stories always have a different approach. All the artists performed their best. Fighting sequences were very nice and impact full. Nice cinematography and editing made the movie more interesting. Akshay Kumar was superb. Overall the story was very much convincing and realistic. Sometimes we felt being involved in their project. Start to end it was very much entertaining and enjoyable movie. 9 out of 10 is my star ranking for this movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "manishverma-hmh",
        "review_rating": "9",
        "review_title": "one of the best movies , i have ever seen",
        "review_detailed_main": "hat's off to Neeraj Panday for his brilliant direction. With movies like A Wednesday , SPACIAL 26 , BABY he has proved that he belongs to a different league..\n\nAnd whenever AKASHYA KUMAR takes a break from comedy movies , he returns with wonderful movies like HOLIDAY , SPACIAL 26 , OH MY GOD and the latest one BABY. He once again gives a power packed performance..\n\nDANNY , ANUPAM KHER are as usual at their very best..\n\nTAPSEE is a surprise package. She is beautiful and bold and gives her 100% ..\n\nAll other actors r giving wonderful performances..\n\nMovie shows us how soldiers dedicate their life to country..\n\nIn on word BABY is'one of the best movies , i have ever seen'.. Don't miss it."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "jyotidibya18",
        "review_rating": "10",
        "review_title": "Worth Watching.Best Contemporary patriotic movie",
        "review_detailed_main": "Akshay Sir proved why he is The KHILADI. More than just a movie it is a answer to them who thinks it's game to play with India.From history Indian subcontinent is lies on the fault lines of religion and clash of civilization is a day to day affairs not only in India but in the whole South Asia.Though it's only a movie it succeeded to represent how some selfish people plays with the sentiments of the illiterates in the name of religion.It also meticulously portrayed,how the system of bureaucracy cost our hardened lives.It intensified the debate whether we should give absolute control to military personnel or continue with our existing system.Thanks to Akshay Sir for this movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "saurabhdatta",
        "review_rating": "7",
        "review_title": "Lost my Nails!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "anvyom226",
        "review_rating": "9",
        "review_title": "Brilliant, Awesome, Beautiful and Youthful Cinema , that's BABY !!!",
        "review_detailed_main": "Baby is a movie that completely blows your mind, it takes you to a level of extreme excitement and anxiety leaving you satisfied to the fullest. I really felt proud that such kind of movies are being made nowadays which increase the standard of Hindi Cinema. Talking about the movie, particularly USPs:- a) Great acting by each actor, especially Akshay Kumar and Danny. b) Direction and Screenplay is just flawless, No faltu dialogue's by any actor. c) Camera work is just superb with breathtaking shots of Nepal, Turkey and Saudi Arabia. d) Script is so edgy that the Movie keeps you glued to the seat till the end. e) Background Music is just perfect and carries the movie forward in a right pace. f) Good action scenes, including a rare fight sequence between Tapsee Pannu and Sushant Singh, where she hits him with gusto, instead of cowering in a corner and waiting for the hero to come and rescue her. g) The Subject of Terrorism has been handled efficiently by the Director Neeraj Pandey, he has very well blended the touch of patriotism, secularism and family values.\n\nOverall a must watch movie. Highly Recommended. Watch it in Cinema Hall, a lot of Hard work and Dedication has gone into making the film. NO TORRENT, PLEASE !!!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shishir9211",
        "review_rating": "7",
        "review_title": "Baby is a blend of many Hollywood films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "jatinmb",
        "review_rating": "10",
        "review_title": "Don't miss this BABY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sudheeshthulaseedharan",
        "review_rating": "7",
        "review_title": "The film is a clean thriller.",
        "review_detailed_main": "If most of the films on terrorism and extremism are about Pakistan, Baby is telling a different story.\n\nBaby introduces the villain who, while sitting in the neighboring countries, is strategizing against India, Pakistan and the United States at the same time, realizing that terrorism is only relevant in both countries if the enmity between India and Pakistan increases.\n\nThe main villain in the film and his organization represent the terrorist organizations and leaders who convey misleading messages and calls, thereby recruiting people to the organization and then gaining financial power through foreign funds.\n\nOften, by deliberately or unknowingly harboring such terrorists in some of our own neighboring countries and the Middle East, the film subtly raises a great concern that the terrorists are also getting an environment in which they can live safely away from Indian law and punishment for life.\n\nBaby creates big exaggerations in some places while combining all the qualities needed for a thriller movie like fast scenes, shots and powerful dialogues to go with it.\n\nAlthough the film easily shows the secret missions to a country like Saudi Arabia, not everyone who sees it can comprehend its potential beyond a certain limit. However, considering the imagination used in this secret mission, some are happy to accept.\n\nAkshay Kumar's marvellous performance.\n\nDanny, Anupam Kher, KK Menon and Rashid Nass in the lead roles.\n\nBest Story-Screenplay-Dialogue-Direction and Sanjay Chaudhary's exciting BGM are very nice."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "abhi5823",
        "review_rating": "4",
        "review_title": "renovation of Bollywood",
        "review_detailed_main": "actually, we can only say that it is good movie, Bollywood is now trying to make the movie like that the Hollywood does. No songs in the movie that is good, but the soundtrack of the movie is copied from the Hollywood one of the best action, thriller movie i.e The Bourne Series. Many people are saying that this is the masterpiece, but i am not agree with them ,this movie is not better than A Wednesday.if anyone had watched the Bourne series then they would realize that the soundtrack is not original it is copied. the plot of movie is good , but something is missing in movie cinematography was not good. now let's talk about the acting, Akshay acting is good. The hacking scene of Anupram Kher was not perfect, Director could make in different way and better than this, there was lack of suspense scene."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "abhiroy272",
        "review_rating": "10",
        "review_title": "Almost perfect, flawless, superb acting Akshay Kumar. Needless to say it is be one of the best movie Bollywood ever have",
        "review_detailed_main": "What To Expect:\n\nBABY is a Neeraj Pandey Film, the director of A Wednesday! and Special 26. The trailer and teasers of this movie have made it evident that this is a patriotic film. So you know that you are paying your money to watch a fast paced, meaningful, patriotic, action thriller.\n\nWhat Is Good:\n\nPerformances: Excellent\n\nAkshay Kumar returns to the action genre. He had done many action films towards the beginning of his career but later moved on to do comic movies like Hera Pheri, Gararm Masala etc.But with movies like Holiday and BABY he makes a very strong come back to the action thriller genre.\n\nStrong character performance by Danny. Very good cameos by Anupam Kher, Sushant Singh and Kay Kay Menon. All of them delivered exactly what the doctor order. Watch out for the lady actor who plays the part of female undercover agent. Excellent.\n\nProduction Value: Good\n\nFilmed at multiple locations in India and a short portion in Istanbul and a part in Saudi Arab.\n\nMusic: Good\n\nThere are no songs. There is a just a one liner nothing more than that. Background score is very good and makes the movie fast paced and interesting.\n\nPlot and Story: Very Good\n\nThis is a special agent movie. Those who give a damn. Live and Die for their country. While the idea is not entirely new but the treatment and presentation is lively.\n\nScript, Execution, Direction: Excellent\n\nNeeraj Pandey takes his work to the next level. This is definitely better than A Wednesday and Special 26. Narration is fast paced, specially the post interval portion is super. Some sequences are really nail biting and leave the audience on the edge of their seat.\n\nWhat Is Not So Good:\n\nIt is very difficult to find faults with such a movie that serves it purpose so well. Only thing that comes to mind is that few sequences are not very convincing and certain pre interval portions could have been better."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "Dhaval_Forever",
        "review_rating": "9",
        "review_title": "Baby",
        "review_detailed_main": "Akshaykumar Life Best Movie Nailed the Cherecter.....Just an Brilliant....Neeraj Pandey Direction Was Gd ..."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "titonsahashuvo",
        "review_rating": "9",
        "review_title": "\"Masterpiece\"",
        "review_detailed_main": "Wonderful!! Excitement continues till the last moment. I can't pause it for a single moment till the end. After ending I've taken a short break & now writing the review! :D Another point is that this film is completely free from usual romanticism. Without such romanticism it is successful to create excitement & perfect thrilling experience throughout the 2hour 39 minutes! Every moment I was confusedly thinking what is going to happening in the next moment! For a great thrilling experience through exciting your nerves watch it. It's a must watch! Acting of 5 members of Baby gang is really excellent specially Akshay."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mc-97775",
        "review_rating": "10",
        "review_title": "All Time Blockbuster Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "AnkAgarwal",
        "review_rating": "7",
        "review_title": "Indian Espionage at its Best !!",
        "review_detailed_main": "This film is the third undertaking by the National Film Award winning director Neeraj Pandey. Following the footsteps of his previous two movies this film is also a thriller but this time it is an espionage thriller revolving around a fictional special task force named \"Baby\". It is a temporary unit formed as a part of experiment after the attacks in Mumbai on 26/11. Backed by a well written story and a riveting plot that keeps you at the edge of your seat, it packs a powerful punch that leaves you satisfied.\n\nThe film has some real good performances both in-front and behind the camera. Akshay Kumar once again proves his mettle as a brilliant actor. All the supporting actors play their part and I must credit Taapsee Pannu, she really gave a bad-ass performance. Neeraj Pandey once again proved that despite being young he really is a very mature director.\n\nInspite of all the good things, it also has its share of problems. The most annoying one is that there was not a real single high point of the film. It pretty much started and ended on a similar note, no adrenaline pumping thrill. The villains had very little role to play and not enough time was spent on developing the relation between Ajay (Akshay) and his family. In the end I did not feel anything for anyone, I enjoyed it but there was no after-taste to it. It was a good thriller but it could have been way more than just that.\n\nBut still I really would recommend all of you to watch it, its really worth it."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "bkvora",
        "review_rating": "9",
        "review_title": "Thrller",
        "review_detailed_main": "What a thriller. What did I just watch ? Very gripping movie from the beginning. The movie moves at an interesting pace with many characters and plots leading to an excellent climax.\n\nVery good Direction by Neeraj Pandey and also the acting by Akshay Kumar and supported by Rana, Anupam Kher and others.\n\nThis is a thriller that will go done in History as one of the best thrillers of all time in Hindi Movies"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ravinderinsa",
        "review_rating": "7",
        "review_title": "Good Movie",
        "review_detailed_main": "One of the best movies ever made in thriller category. Akshay has done good stunts in this movie. The dialogues were also good. You can watch with your family and get a message out of it too. I recommend all to watch this movie. This movie will Impress you as much as Special 26 did. Firoze Ali Khan (Danny) heads a special operations wing of commandos called Baby. Akshay Kumar has done an incredibly good job in BABY. He's razor sharp and there's never a dull moment whenever he's on screen. In a scene in an Airport washroom when he bandages himself despite excruciating pain is superbly done. He's exceptional during all his action scenes as well. This movie has good story. That's all!!!!! Thank You ;)"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shivngb",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Must watch and lives upto the expectations of being a neeraj pandey film. All the cast were at there best and did a awesome job. A perfect movie after special 26"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ahegde3149",
        "review_rating": "5",
        "review_title": "Ambitious with some edge-of-seat thrills, sadly nothing more",
        "review_detailed_main": "Director-Writer Neeraj Pandey's first two films 'A Wednesday' and 'Special Chabbis' were a absolute treat considering standards of Bollywood. Both were stunningly thrilling edge-of-seat experiences. Also both had believably good script even if some minor flaws could be caught here and there. With 'Baby' he continues with similar direction and writing style, sadly the screenplay here is very hollow. Plus having a abominated run time of 160 minutes where nothing new or surprising happens, it really drains the thrill part. Still Baby is watchable compared to other mundane Bollywood movies coming out these days, it definitely will click with the general Bollywood audience.\n\n'Baby' is the name of an elite Indian anti-terrorist squad established after the attacks of the 26/11. It has been named so because of its temporary and infant status. It's Headed by Feroz (Danny Denzongpa) with help of Ajay (Akshay Kumar), who is professionally skilled in espionage. Most of their job involves carrying out surgical ops to crack terror related intel around the globe. The first-half establishes this plot in a very boring fashion. Team Baby learn about plans for major terrorist attacks across India. At the same time terrorist Bilal (Kay Kay Menon) escapes from prison. Most of the story involves tracking down different people having information about his location. While all these missions have considerable amount of tension built- up but are void enough substance to back them up. Characters just pop- up without much development and then suddenly are gone. The vastly inferior screen time of Tapsee, Dagubbati and Anupam Kher was ridiculous. Their characters had some great potential in the script, unfortunately it is not utilized at all. Akshay Kumar does the required threshold but nothing special. Both his looks and acting were almost similar to the one in Special 26. The script is stuffed to many characters and throws very little light over them except Ajay. If you dig deeper there are many small goofs, especially during the ops. Situations and things turn up just to facilitate the easy and simple narration. The pacing and thrills pick up towards the end though with a not so surprising climax.\n\nThe problem with Baby is not its premise but its execution. Everything is just kept plain and simple even if the situation demanded more depth to it. Most of the story is quite predictable expect for one or two small twists. On the positive side, it isn't filled with unnecessary songs and romance to ruin the atmosphere. The background-music was good but felt repetitive and forced. The first-half felt poorly edited. The plot advances very little in the first hour. If it wasn't for an engaging and edge-of-the seat last act, Baby would have been a very average film. The third act was the savior I would say. Baby is an ambitious attempt by Neeraj Pandey but lacks a good script. It is highly engaging at times, but feels very bland when the team is not on missions. Those who crave for thrill-elements without any care for other aspect will like it but for me it was quite average and disappointing considering the other works of Neeraj Pandey. But surely it is the first watchable film of 2015 without any doubt.\n\nRATING:[2.5/5]"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vshlmasand",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "The movie was amazing.This brings a feel of Patriotism. Akshay Kumar was perfect in his role. I would like to give most of my appreciation to the writer and director of the movie Neeraj Pandey. Neeraj Pandey is proving himself as a different and unique type of writer again and again, his brave work in Special 26 & A Wednesday has made me his fan. Thanks for making this type of movie for the country. Movie like this comes very rarely on bollywood. It is a many times watchable movie, i have watched it three times. Really i enjoyed this movie very much. Critics will definitely find some faults in this movie too. But i am very happy that someone made this type of movie. Keep Up The Good Work Like This"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mans-90711",
        "review_rating": "10",
        "review_title": "BABY",
        "review_detailed_main": "Undoubtably this is one of the best Indian thriller movie I have ever watched!! The story is very interesting, And gripping which keeps you to the edge of your seat throughout , acting from everyone in the film was outstanding, especially Akki Paaji , he was brilliant. Everyone did perfect justice to their roles in the movie . Outstanding action sequences which felt realistic .the best thing is there is no Bollywoody melodrama and songs starting-from-nowhere situation anywhere. Speed of the story is really good.\n\nThe most interesting thing is, at first I thought it is going to be a one-time-watchable movie (generally most of the thrillers falls in this category, you get to know the story once, and there is no thrill when watch it again) but I was wrong. I watched it many times, and the situations, the background music give me the same thrill again and again. If you love thriller genre, you should obviously not miss it. I don't get bored watching the movie anytime . Neeraj Pandey sir pulls out an outstanding thriller !"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "reportnewsdiary",
        "review_rating": "8",
        "review_title": "Perfect intercepting thriller",
        "review_detailed_main": "Akshay Kumars action led the movie as thriller as the story and Rana Daggubati muscle show and Tapsee surprise fight all together its worth full to watch. its brief story on how Akshay Kumar a counter intelligence officer trace out terrorists in Saudi Arabia and bring them back to India for interrogation. How did he do is the story\n\nDon't miss it : by Chotabox.com Major cast in this movie is Anupam Kher and Tapsee along with Akshay. Music was not so crazy for songs but background score is good. Cinematography was good in chasing scenes in abroad both Nepal and Saudi. There were some scenes which make the audience laugh enough specially Akshay slaps Minister's Assistant for wrong reason."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "brijendra-72455",
        "review_rating": "9",
        "review_title": "Outstanding",
        "review_detailed_main": "Very very nice movie, best performance by Akshay Kumar sir,Neeraj Sir best direction and writing Wow wow wow what a great movie. Very nice acted by all cast,best movie in bollywood."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sakshammahajan",
        "review_rating": "10",
        "review_title": "Best agent movie of its kind",
        "review_detailed_main": "it's the best movie of its kind.I have not seen such a good movie in a long time it seems to be the best performance ever given by Akshay, in his Career. It's a really amazing movie and reveals the truth about an agents life serving for the country and for the nation the without any self motive serve the country and taking their lives in their mouth always Never take a step back for leaving countries pride at sake.moving is worth in this movie has really glued my mind and said the statement that he can also compare with khans of Bollywood he has proved his worth and his position in Bollywood which is now comparable to any superstar in the history of Bollywood.I'm really glad he is making such good films with the help of Neeraj Pandey. We should also no forget the role of Neeraj pandey.He has proved that he can be the best director as by making the film is like Wednesday and special 26 he has also set the statement that the coming films of him are also worth a watch.It says all that Neeraj Pandey is going to make films which are going to make history it's really good film worth the watch and also setting good track for the people can relieve from the everyday life and make their mind extraordinarily devoted to country. Films like this can make one feel patronize."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nallaiah",
        "review_rating": "9",
        "review_title": "An elite encounter with (tik tok) clocky speed",
        "review_detailed_main": "Baby...dont even compare the name and judge it.if u did..then you are the baby.. The title deserves..one movie for a while..one for nation...really patriotic ..very delightful..gave a masterpiece work..salute to neeraj pandey sir..a great effort."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "dineshprakash",
        "review_rating": "5",
        "review_title": "First half is baby but second half is somehow mature",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ravi-unadkat",
        "review_rating": "10",
        "review_title": "Yet another gem from Neeraj-Akshay-Anupam",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nadkarnisumeet",
        "review_rating": "8",
        "review_title": "One of best Bollywood thrillers in recent time.",
        "review_detailed_main": "Baby review:\n\nHindi cinema has churned out many espionage thrillers before; from \"Farz\" in the 60s to \"Agent Vinod\" in recent times. But most of these films suffered from the Bollywood \"song and melodrama\" syndrome which ended up diluting the thriller element. Hence, Baby, written, scripted and directed by Neeraj Pandey (A Wednesday and Special 26 fame) comes as a welcome surprise.\n\nIn its running time of 160 minutes, I didn't get distracted or felt the urge to check my cell for even a minute; a feat only Hollywood thrillers have achieved so far. Cutting straight to the action from its first scene, the film details a covert operation executed by a handful of undercover agents to bust a dreaded terrorist organisation. Some influence of \"Argo\", \"Zero Dark Thirty\" and Nikhil Advani's far inferior \"D-day\" are evident. But Pandey deserves credit for keeping his narrative gripping and entertaining right till the end.\n\nOn the acting front, Akshay Kumar is brilliant as the lead agent, infusing the right amount of physicality and restraint in his performance. Danny Denzongpa suits the role of the IB chief perfectly. Anupam Kher makes his presence felt even in a small role. Kay Kay Menon, in a negative role, exudes menace. Taapsee Pannu is super impressive even in a small role.\n\nThe movie has been shot beautifully in locales of Turkey, Nepal and Saudi. The technical department is of high standards as expected from a film of this scale.\n\nUndoubtedly, Baby is one of the finest thrillers I have seen in Hindi cinema. Hollywood influence aside, it will still keep you on edge of your seat throughout.\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "asadharanasone",
        "review_rating": "10",
        "review_title": "Salute to Team B.A.B.Y",
        "review_detailed_main": "A spectacular watch. No film can deal with \"Terrorism\" portion like this one.... will teach you about armies and agents - and how they stand with our countries amidst rising threats from Muslim ruled countries.\n\nGood performance wins the heart. Akshay-Neeraj combo did an excellent work. Although the box office remains decent."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shashwat-agarwal14",
        "review_rating": "9",
        "review_title": "Bollywood Thriller at its best",
        "review_detailed_main": "Baby definitely comes under the category of 'The best of Bollywood'.In short , it is a story of bringing down a terrorist organization by a small Indian secret agency. Hats off to Neeraj Pandey (also the director of A Wednesday and special 26).Everything was spot on: whether it was Acting, Direction or Screenplay. No unnecessary songs,and amazing background tracks. With many 'edge of the seat moments' one just cannot lose interest.I guarantee you will leave the theater with a smile.Action scenes were impressive and so were the dialogues .Anupam Kher was icing on the cake with his witty remarks.I wish every once in a while films like these are made to neutralize the mindless cinema that we all(including me)love.Thanks to Akshay Kumar,this movie has definitely upped the swag of Indian agents.First half is not at all boring,as some online critics are claiming,it has a great build up.A must watch for all those who have lost faith in Bollywood...... A MUST WATCH"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "arpandewanjee60",
        "review_rating": "10",
        "review_title": "My review on Baby...A must watch film...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rajat_srvstv",
        "review_rating": "9",
        "review_title": "BABY is mature,fast-paced,edge-of-the-seat thriller.....an instant classic",
        "review_detailed_main": "Haven't seen anything more interesting and thrilling than this one in the last few years.It wouldn't be an exaggeration to call it one of the finest movies produced by Indian Cinema. With almost 3 hours of run-time,this edge-of-the-seat masterpiece has enough chills and goosebumps to keep you glued to your seats throughout. Akshay lives the character pitch perfect and is absolutely phenomenal, and so are all other actors including Danny and Anupam Kher, however a special mention for Taapsee Pannu, who shines in a short cameo. The background score is so profound that it automatically raises your heart-beat. This BABY is mature enough to be called an instant classic. MISS IT AT YOUR OWN PERIL\""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "stepmonestar",
        "review_rating": "5",
        "review_title": "A Hollywood inspired Pakistan basher with no real central plot.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "dbb-221-695521",
        "review_rating": "9",
        "review_title": "Didn't expect this from Bollywood.",
        "review_detailed_main": "I am SHOCKED.\n\nI am not the kind of person to have an account for site like IMDb.\n\nBut now I have one.\n\nAnd reason is this movie. This is probably the only movie out of Mumbai that I have enjoyed enough to ask other people to also watch it.\n\nBut I guess this is not for everyone.\n\nIf you are into typical Bollywood movies with \"Boy meets a Girl, and then they are suddenly singing and dancing around trees\" story, then \"Baby\" is clearly not for you.\n\n\"Baby\" is for those who like straightforward fast paced action thrillers.\n\nProbably the best thing about Baby is its story, which is based on real events and lives of people in Indian Intelligence Community. If you think I am joking, then consider this: a person who lived in Pakistan for 7 years as a spy for RAW is now India's National Security Adviser.\n\nActing is even better. There's no cheesy melodrama to laugh at, which is so typical of Bollywood.\n\nAction sequences and cinematography are good too (definitely better than any Bollywood movie I have EVER seen).\n\nAll in all one of the best action thrillers I have seen in last five years.\n\n-Vijay Das"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "souravsr1004",
        "review_rating": "10",
        "review_title": "Religion waale column me humlog bold aur capital me Indian likhtey hai",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "robinroar",
        "review_rating": "9",
        "review_title": "Exhilarating thriller from India!!",
        "review_detailed_main": "Neeraj Pandey, the writer-director of thrillers like a Wednesday and special 26, with his latest installment, baby, packs a punch and betters himself (which is rare in this genre) with flawless writing and directing that makes baby one of the milestone of Indian cinema. The Hollywood standard production values and directing with flawless performance from the entire cast (mainly akshay & tapsee), baby is undoubtedly my favorite Indian thriller of all time. The most significant thing about baby is the pace with which the story moves. Where the first half sets the plot the second half completely blows away the audiences expectations and the breathtaking climax is the icing on the cake. Definitely a must see for everyone who loves action thrillers."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rajtsingla-333",
        "review_rating": "9",
        "review_title": "If you need an uncompromising thrill, go see Baby .",
        "review_detailed_main": "Baby is a very good suspense thriller. Akshay Kumar is at his best in the movie, Anupam Kher too. Taapsee Pannu, she had justified her role with her acting. Neeraj Pandey, director of A Wednesday and Special 26 and now Baby, has shown his charismatic direction skills here again.Story is very good and fresh .Dialogues are good,but not great. Screenplay and the background score together are the lifeline of the film. There are so many Wow!!! moments in the film. At some scenes you cant resist yourself to clap and on some to fix you eyeballs so deeply just out of curiosity(what's going to happen in the next scene). No unnecessary creepy Bollywood songs are there. So, you will witness a true action/suspense/thrilling cinema."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "hrishirise",
        "review_rating": "10",
        "review_title": "Great movie much needed in eroded state of Indian affairs",
        "review_detailed_main": "The state of secularism in India had done so bad, that even politicians were afraid to call terrorists as terrorists. Some of them in fact used the divide as political gain and supported the Islamic terrorists.\n\nThis movie, does not sugar coat the truth and reality and is a must watch. The movie is a important realization to Indians and Indian muslims to be proud of the country they are born and living in. Indian has been divide on the lines of religion not by those who are religious party but by the ones who claim to be defenders and protectors of secularism.\n\nThere is no way secularism can mean accepting anti-nation factions."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "www-sanjeevrajpatel",
        "review_rating": "10",
        "review_title": "One of the best Movies. must watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sunilsach-14175",
        "review_rating": "1",
        "review_title": "Oa! Baby",
        "review_detailed_main": "Yes..... you see good ratings of any movie, it gets you excited to watch it. This is what happened to me and guess what, am extremely disappointed that I wasted 3 hours of my precious time.\n\nIts a typical Indian crap movie just showing random points and baseless actions, spreading sheer hate. Its hilarious when you try to copy big guns but actually you don't have the resources and guts to face out the real world realities. Totally biased story-line, below average Plot, and lousy action.\n\nNot Recommended !!!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ruchitdarji",
        "review_rating": "9",
        "review_title": "King of Thriller. One of d finest movies of 21st century.",
        "review_detailed_main": "Akshay Kumar back to action and at his very best. He throws everything in this with Neeraj Pandey's well executed direction. One of the best thing of Neeraj's movie is you cant leave yourseat until its all over. Once again he delivers with tight editing and sensational photography, matching background score. Best part is none of the character was wasted in the movie. It really shows the modern threat of terrorism and how to counter it.\n\nNo one can deny that it is one of the best movie of AK.\n\nDon't miss out, must watch in theater only.\n\n10/10"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "amitvyasg",
        "review_rating": "10",
        "review_title": "India's Best movie ever... Top movie to watch before you die...",
        "review_detailed_main": "The quality and content of the movie is excellent.. You get to learn a lot and enjoy the simple humor... Second half is breathtaking.. You can't move away from seat and I saw people sitting still and sitting forward while watching the movie...\n\nAlso people clapped multiple times in the movie... Somehow this movie forces you to clap a lot and I couldn't hold myself and it was the same with many in the theater...\n\nIn terms of acting, I can't think of any other actor who can replace Akshay in this movie.. Other actors were also good, specially Pakistani actor..\n\nFull movie has the Needraj Pandey stamp on it and Its his best movie and even better than \"A Wednesday\" and \"Special 26\"..\n\nWe are so happy to have watched this movie... Its like the best movie ever.. We thoroughly enjoyed it.. Its a perfect movie for the family outing..."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "fightclub974",
        "review_rating": "10",
        "review_title": "Reliogion: Indian",
        "review_detailed_main": "And Finally wait is over. Neeraj Pandey again proves that 'Director is the Hero of the Movie.' After giving such great movies like 'a Wednesday!' and \"special 26' he is back with 'BABY' It is very rare gem in not only bollywood but also in overseas industry. The movie duration is 160min but at last you will feel this movie should not stop. Last 40 min of movie are nail biting. Akshay did great job in movie. I think it is the best performance in his career. Danny,Kher,Rana,KK also did fine job. Tapsee's action sequence in hotel is very nice. Action sequence are superbly captured and background music score is heart of the movie. Dialogues are the crown of the movie. Finally, everyone should watch BABY if he true Indian."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "abhishekagrawal167",
        "review_rating": "9",
        "review_title": "Brilliant espionage!!",
        "review_detailed_main": "\"BABY\"-Fast paced, intriguing, intelligent thriller drama taking your breath away. Firoz Ali Khan (Danny Danzongpa) leads an Anti-terrorism group named BABY that has the ruthless- decisive Ajay Singh Rathod(Akshay Kumar), technical expert Shuklaji (Anupam Kher), macho man Jai(Rana Daggubati), soft yet brutal Priya(Taapse Pannu) and some more, who protect the nation from various damages and also eliminates the minds behind them. The quests and actions of this team, when the nation is threatened by Bilal(Kay Kay Menon), Mohammed(Rasheed Naz) and company, make up the plot of the film. Writer- Director Neeraj Pandey(Special 26 and A Wednesday fame) keeps you engaged from the first frame to the last with edge of the seat intense action-crime flick, and some added drama in the first half. Nevertheless, the second half and especially the climax makes this one an interesting offering. No distraction of songs are there to break the flow in the 160 minutes duration. The background score fills up that space blending perfectly with the scenes. Akshay Kumar shines throughout the film, being one of the finest performances seen lately. All others have done their part with complete justice, be it the interaction between members of the team or the the menace of the terrorists, everything leaves its required impact. Shot in exquisite locations like Istanbul, Saudi Arabia and New Delhi, BABY packs in an amazing venture to get insights of Terrorism and it's smart expunge. Go for this sensible cinema having ample of action, drama and humour moments. AB"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rohan-nagarkar",
        "review_rating": "8",
        "review_title": "A refreshing movie in the times of Happy new year and Humshakals",
        "review_detailed_main": "I won't like to insult IMDb by giving this movie a 9 or 10. Still, the truth is that this is one of the best action thrillers Bollywood has churned out in the last few years. The movie takes inspiration from places but the story is original and realistic. There are no 'one guy taking on 30' sequences or crazy loud dialogues which are stereotypical of this genre. It is a simple story of what each Indian wishes to see. It is a story of hope that something of this sort will be achieved in days to come. It is a realistic story of terrorists and what lies in store if we don't keep a step ahead of them. The movie takes inspiration from a few other movies with the direction of events. The movie has quite a few limitations in the finer points of direction and editing. Yet it is a refreshing movie with a positive message, something that is seriously lacking in the times of the Khans and their multi-crore obsessions. It is a movie in the times of Modi when hope is the key to a new India."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nikhil-arora",
        "review_rating": "8",
        "review_title": "Second half was better...",
        "review_detailed_main": "All in all, it was a Akshay Kumar film. The last movie I watched of Akshay was 'Special Chhabbis' which was also directed by the same director. Neeraj Panday hasn't disappointed till date and he is the only reason I decided to watch this film. But Akshay has again become my favorite, after some senseless movies like Entertainment, Boss recently. He should do more serious roles. Back to movie, It was one of the best spy/thriller movies in recent times. The only thing I was disappointed with the was VFx(I always get disappointed with this in Bollywood). The quality of visual effects adds a lot to movies like this. But still it can be ignored.\n\nOverall, I can say that Second half was better than the first. And I was not disappointed and This movie deserves a watch."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nairtejas",
        "review_rating": "5",
        "review_title": "A Satisfactory Espionage Drama. ♦ 53%",
        "review_detailed_main": "I like Neeraj Pandey's stories. His A Wednesday! (2009) is a masterpiece and Special 26 (2013) a good satire. Baby is good, but not great. But consider it as 2015's first watchable film.\n\nThe opening credits serve as a prologue which tells us that an Indian elite squad (codenamed BABY because of their martial infancy) is sent out to infiltrate huts of terrorism around the world so as to prevent any act of terrorism in India (and/or elsewhere, but let us focus on the exclusive Indian patriotism here). Ajay (Akshay Kumar), a father of two, is the skipper of this squad and mostly acts as a one-man army. Basically, this squad carries out unofficial surgical operations outside India. The story starts to make sense only after you are successfully pulled inside the plot which maneuvers between places around India and the world.\n\nA brawny first half will make you uncomfortable with some boring sequences that will surely raise few questions on the editor. The humor is destructive rather than constructive as the audience awaits a dose of real thrills. There are one or two scenes that MAY make you feel good from a spectator's perspective, but trust me it looks cooked. Enter second half and greet Anupam Kher in his appreciable performance as a quirky strategist. The pace catches up in the last forty minutes and if it were not for these crucial minutes, I am positive the film may have never come out its self-inflicted sabotage.\n\nThe plot is ambitious and no wonder Pandey has sampled some real life events into his story. They work and as far as an unsuspecting viewer is concerned, it all goes well. If you dig deeper, the narrative has nothing substantial to deliver. Yes we talk about killing these mercenaries before they plan another attack. But when every other bad guy dies prematurely, the fun quotient drains. And that is what happens in Baby. It is all so simple yet so difficult.\n\nDenzongpa and Kumar are good, not great. I somehow missed Daggubati; Kumar's actress (from that seemingly sexist Airtel ad) had more screen-space than him. The dialogs are funny and the one thing that really works for the film is the combination of drama and humor that goes hand-in-hand with all those weighty happenings. Even if you start to wonder where the thrills are, the witty dialogs will take care of you. The raw sequences of interrogation and infiltration dictates your attention.\n\nWhile the photography is good, the cinematography is below average. Direction is the usual Pandey, nothing to talk about. There is some good writing in here (a la A Wednesday!) but otherwise Baby is a slightly exaggerated drama. The namesake stunts are punchy and as the story turns to the climax, you will surely feel a satisfaction that if not in reality, a fictional India is doing something bold and not busy promoting superficial campaigns like Swachch Bharat & Make In India.\n\nBOTTOM LINE: Baby is a tasty dish for our palates, but it ends up being more of a meaty affair than an intellectual thriller. A one- time watch!\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "aditimukherjee1410",
        "review_rating": "8",
        "review_title": "A fast paced action thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "alexm_in",
        "review_rating": "10",
        "review_title": "Baby is the best Indian movie in its genre . Make it TAX_FREE..",
        "review_detailed_main": "Baby is an outstanding achievement by an Indian director. This movie is the best movie ever in this genre. Hats off to Neeraj Pandey. He is India's best director. And three cheers to Superstar Akshay Kumar for a restrained but powerhouse performance. Every department of this movie is superb. Be it direction , acting by an ensemble cast, editing, story, screenplay, cinematography, everything is superb. The word of mouth is fantastic and even the critics rating are great too. This is cinema at its best. Baby is not against Muslims as some vested interests are trying to make believe, people who have not viewed the movie. It is against terrorism. In fact there are several Muslims shown as heroic and patriotic. Danny Denzongpa plays Firoz, who heads the secret mission, is a Muslim. Ashfaq,the Indian agent in Al Dera is a Muslim.A young Muslim boy shows up the courage to expose the terrorists, and is appreciated by the hero Akshay Kumar. More than Akshay Kumar, the hero of the movie and his team, it is the Muslim characters in the movie who help in the fight against terrorism. So this movie is not anti-Muslim . In fact, Muslim and they are shown as heroic. The film is not even anti Pakistan and has several Pakistani artists. In fact Pakistani actor Rashid Naz has given a superlative performance as the main terrorist. Only terrorism is the villain. And the movie hits out at terrorism. Danny Denzongpa is fantastic, Aupam Kher puts in a spunky performance, Rana Dagubatti is good is a small role., Kay Kay Menon in a small role mesmerizes, Sushant Singh is good, Tapasee Pannu is awesome and does the best action scene done by an Indian actress ever. Madhurima Tulee is apt in her role and supports, and Murali Sharma is eye catching in his brief role. Baby is a classic movie, I think the best movie made in India , in this genre ever. And director Neeraj Pandey is fast becoming a cult film maker what with a track record of A Wednesday, Special 26 and now Baby, Exemplary! And Akshay Kumar is fast becoming the most versatile actor ever, what with him juggling between so many genres and so many different roles, and doing them well. Roll on the TAX-FREE status in India ..please\u0085..this is my humble request to the Government of India , so all Indians can see this spectacular and patriotic movie.. All this is so motivating and moving and patriotic. Bravo Baby... This technically brilliant movie which is the best ever in this genre should get its due and be appreciated. Baby should be given a TAX-FREE status by the Indian government. This should be the appeal of all Indians. And I think Super star Akshay Kumar and director Neera Pandey both deserves a National Award."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nikhil-m-patkar",
        "review_rating": "9",
        "review_title": "Baby...A matured Action thriller.....",
        "review_detailed_main": "For all Action lovers, this is the most well scripted movie in recent times. This is a no Non-sense movie, backed by great performances by Akshay Kumar, Anupam kher, KK Menon and Danny. The first half can be a bit slow, but guys fasten your seat belt for the second half. The movie has more of a realistic story-line then just bragging about heroism and machoism. You can get the taste of Spy agencies, Foreign policies, Diplomats and their influences. Additionally it also has nice looking Foreign locations. Summing up everything, this movie has a great all round entertainment for every age group. I was hopping if KK Menon and Anupam kher could have got a bit more exposure in the movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "i_rohitroy",
        "review_rating": "10",
        "review_title": "Concept Is good",
        "review_detailed_main": "The starting of the movie was OK as it contains the detail about the term \"Baby\". Later on it become a suspense one and the silent fight against terrorism starts.\n\nAs the main cast of the movie is Akshay Kumar so cannot miss hit acting and fighting moves.\n\nAt last they finally got their target and prevents a lot of bomb blasts and encountered all the main terrorists.\n\nThis is all about the movie which is normally based on the terrorist attacks. Surely you are gonna enjoy this movie as it contains a lot of dialogs and action with a lot of mind games."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ancsinha",
        "review_rating": "10",
        "review_title": "Near perfect.......",
        "review_detailed_main": "\"Baby\" is that near-perfect textbook espionage thriller we have been dying to see: straight and business-like, fast-paced, without frills, and immaculately detailed to the point of occasional verbosity (we also saw that in the TV series \"24\"). But this is also a film that attempts ambiguity about which the nasty terrorist country is (with sops like the presence of Pakistani artists – Rasheed \"Khuda Kay Liye\" Naz as the main villain and Mikaal Zulfiqar as a good guy), which was something Hindi cinema did pre-\"Border.\"\n\nFrom the audience side, however, the film has some prominent deficiencies despite its lavish budget – the action has little diversion except a mention of Akshay's domestic life off and on but no one else seems to have a family; there are no songs (but for a half-song) even in the background and thus no relief from the standard and loud background score; and above all, the film clocks in at a length of 160 minutes, and no surprises in the narration whatsoever. Rockin Jump -300x250 ACT- India Ink-300x250\n\nWith Akshay occupying center-stage at all times, alongside Danny Denzongpa thrown in as the Intelligence chief, we only have fleeting appearances by others. Taapsee, Kher and (effectively even) Rana have roles only in the second half as agents. Madhurima, poor thing, gets a minuscule role as Akshay's wife. There is little attempt to enter the life and emotions of the other agents. This is no \"Special 26\" where Akshay was one of the main characters, but an out-and-out \"hero\" film depending on his super-stardom. But even here, the film repeatedly comes up with an anti-climax-like feel-good factor in many missions, where everything goes right and the slight tension is almost immediately defused.\n\nTechnically brilliant with crisp dialogues, the film is about a crack team of intelligence officers out to prevent crimes against India and on a perennial mission to kill the villains who are planning or executing them. The team called \"Baby,\" as it is new and confidential, is finally vindicated with the elimination of the masterminds who wanted to eliminate India. The action zooms from Istanbul and Kathmandu to Indian metros and the Arabian Gulf. It is quite extraordinary and real (the stunt coordinators led by Cyril Raffaeli may take a bow) and on the plus side, the one-dimensional and cold characters are sharply etched. About 30 minutes of the total movie are on bringing back a dreaded terrorist to India and the complications that ensue.\n\nIf the film is watch-worthy, a huge chunk of the credit goes to Kumar, whose performance is truly impressive despite his uni-dimensional characterization. Everyone else is good, especially Danny and Kher."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "lokeshjain2008",
        "review_rating": "10",
        "review_title": "Bollywood have some great film makers now.",
        "review_detailed_main": "This has be to be 10/10. I watched this film and i feel go thrilled as the film reached to the end. everything about the film is great and make you more tensed and involved in it. great work!\n\nThis has be to be 10/10. I watched this film and i feel go thrilled as the film reached to the end. everything about the film is great and make you more tensed and involved in it. great work!\n\nThis has be to be 10/10. I watched this film and i feel go thrilled as the film reached to the end. everything about the film is great and make you more tensed and involved in it. great work!\n\nThis has be to be 10/10. I watched this film and i feel go thrilled as the film reached to the end. everything about the film is great and make you more tensed and involved in it. great work!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "yashwaunshi93",
        "review_rating": "10",
        "review_title": "Just Go For BABY A Must Watch Movie",
        "review_detailed_main": "Baby is Bollywood's most grown-up action drama yet. Its scale is lavish, zipping between India, Nepal, Turkey and the Middle East, and its performances excellent. Akshay Kumar is terrific as Ajay whose core of steel you can almost feel. Akshay presents top-rung action - you practically hear opponents' bones breaking under his stabbing kicks. But you hear Ajay's mind ticking too as he foils plots, plans hustles and thinks of excuses before his wife Anjali (Madhurima Tuli). Akshay is at his best, deadly serious in combat, wryly engaging with straight-faced humour, pleasantly asking a suspect, \"Kharonch kyun aayegi...?\" before interrogation.\n\nOther performances sustain Baby - Danny Denzongpa is superb as Feroz, unit chief whose love for nation and team often escape his quiet bureaucratic suits. Tapsee Pannu has a dazzling little role while Rana Daggubati provides muscle to the lean, mean team. Anupam Kher as sour-tongued strategist Shuklaji delivers with tart aplomb while Kay Kay exudes menace through unnerving, unblinking eyes.\n\nYou feel menace too when the magnificently acted Maulana Rahman (Rasheed Naz) makes devilish speeches, evoking terrorist Hafiz Saeed. Baby features multiple vibrant roles, including Hasan Noman as a smooth investigator, Murali Sharma as a minister's pompous-ass PA and Sushant Singh who faces a \"Rod. Aur gel.\" during an understandably quick interrogation.\n\nBalancing characters, conspiracies and cities, director Neeraj Pandey admirably keeps Baby rich, yet tight, researched, non- sentimental and steely-eyed. Neeraj's craft has grown - he's taken trademark touches from films like Special 26 and A Wednesday, setting them here on a grand scale, with a breath-taking climax. The cinematography - desert dunes in nothing but shaded moonlight - is elegant while dialogues are robust. One of Baby's crew tells Ajay, \"Tension kya lena? Ulta, aapke rehte, mazaa aata hai.\"\n\nQuite. This Baby's day out is deadly good fun."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "akshatvaishya16",
        "review_rating": "9",
        "review_title": "Neeraj Pandey and Akshay kumar are Awesome",
        "review_detailed_main": "Its rare, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshay Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has a important part to play in. The acting is superb. Everyone, and I mean literally everyone has acted so well that sometime you feel like you are not even watching a movie. Anyone who loves watching Bollywood movies, should not miss this classic. It's a classic, a masterpiece and kind of movie that is made once in a decade. Simply stating it, Its one of the finest movie ever made in Bollywood. Akshay Kumar is brilliant."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "deewanaakkika",
        "review_rating": "10",
        "review_title": "Who the hell is giving negative reviews",
        "review_detailed_main": "Masterpiece delivered by Bollywood. Greatest thriller movie made by Neeraj Pandey. Akshay Kumar, Rana, Tapsee, Anupam Kher, K K Menon has given their best performance. People who are giving negative reviews have a very bad taste in movies."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "the_horned_owl",
        "review_rating": "8",
        "review_title": "A Great Movie From a Good Director",
        "review_detailed_main": "Rarely has any bollywood movie made me write a review about it. I was not expecting much when I entered the theater but this movie was brilliant.\n\nThe first half is good but it is the second half that makes it a must watch. It's an action packed movie filled with great performances and direction. Akshay Kumar is brilliant as an army man, so are the other actors like KK, Danny, Anupam kher etc. It's not one of those movies which will break box office records but it will definitely win your heart. I was let down by Akshay Kumar as he was doing silly comedies for few months (Special 26 and Holiday were great) but he came back with a bang. I won't tell you about the story because the story is good and I don't want to spoil it and you will feel much better if you watch it by yourself. The movie basically deals with terrorism.\n\nSo overall I give it a solid 8 rating. Just go and watch it and believe me you wont feel cheated but if you like movies like Chennai Express,Dhoom 3 and Ek tha tiger then You might not like it. People who like movies like D Day, A Wednesay and Lunchbox will definitely enjoy it."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mxpayne75",
        "review_rating": "9",
        "review_title": "Baby Review",
        "review_detailed_main": "How often would u get to see a movie without songs in Bollywood and how often would that movie would be fascinating. Baby is those one of the rarest of the are movies to make it to this list besides Madras Cafe. Gripping is the word. The first ten minutes itself set the pace of this action thriller. This is a completely nail biting tale and has you hooked to it. Neeraj Pandey sets the standard really high and has a daring take at terrorism. The story is on the face and the script with dialogues such as \"India ek pareshan mulk hai\" and \"Main religion category mein Indian likhta hoon, Capital mein!\" completely bowls you over. Akshay Kumar fits the role with ease. He has always been the quintessential action hero and in this too he excels. Although I do feel, the content overpowers this film and so it's not Akshay's best.\n\nDanny Denzongpa is seen after Bang Bang and he gives a power packed performance here as well. The casting being perfect, he holds his character extremely well.\n\nAnupam Kher enters in the second half and is quite funny with his quirky character as Shuklaji.\n\nTapsee Pannu impresses with her action scene and shows her potential to star in films which have a heroine pulling off some action and kicking ass.\n\nRana Daggubati is truly like hulk in the film. He does not get a chance to talk much but then again his personality speaks volumes for his role.\n\nRashid Naz, the Pakistani actor, who plays the antagonist is brilliant as Maulana. You truly hate him all through the film.\n\nOn the whole, BABY is one of the finest films ever made in the history of Indian cinema. Not only because of its excellent cinematic credentials but also because of the balanced 'Thought' behind the film. Neeraj Pandey once again proves that he's a genius. This time he proves, it's possible to better Perfection. We say, hey baby, don't think, just go for BABY. Cinema at its very best!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "chitreshgupta",
        "review_rating": "10",
        "review_title": "One Of The Best Thrilling Movie... Masterpiece",
        "review_detailed_main": "If you are a Ek tha tiger, Dhoom 3, HNY, Bang Bang fanboy/girl, do not watch this movie and do not read this review either, it's just not for you.\n\nAkshay Kumar do not need to romance hot girls, do not need to dance and sing, do not need to do melodrama to deliver a hit movie, he had shown us this back in Special 26, he has done the same here in Baby. The cast is a perfect one and there are no flaws.\n\nMOVIE: It has everything a good espionage thriller need to have- 1. Good cop bad cop routine 2. Cute chick beating the pulp out of the bad guy 3. Super cool combat scenes 4. No unnecessary sentiments and drama 5. Some brilliant dialogues 6. few laugh out loud scenes 7. It focuses on modern warfare--an indirect one--proxy war, which is much spoken about in reference to India in recent times 8. Kick ass background score 9. Cool Spy v/s bad guys 10. funny Akshay Anupam Kher duo Akshay Kumar has played a superb role. Its time that he should realize the fact that he looks really amazing doing films like holiday, baby and Special 26, and that he should stop doing mindless commercial movies. Danny and Anupam Kher are great at their roles. The action scenes are amazing, and cinematography is good. The best part of the movie is its direction. Neeraj Pandey has made two awesome movies earlier, and with this film he sets the standards even higher. Why cant Bollywood have more of Neeraj Pandeys and Hiranis and Anurag Kashyaps? Why cant Bollywood churn even two quality films every month? On negatives: Yes even i think the movie was a bit lengthy, if the director had trimmed it 10-15 minutes it would had been great. Yet, this movie is a rare feat. Bollywood rarely delivers movies like this. Its a must watch if you like sensible movies. And regarding the negative reviews, just do not pay any heed to them, for THIS GEM IS NOT TO BE MISSED. Neeraj Pandey as a director has done a brilliant job."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "harsh-kabeer",
        "review_rating": "4",
        "review_title": "Baby is loud, over the top and utterly stupid.",
        "review_detailed_main": "What a waste of time! The first half, that was okay de spite many of its flawed and uninspired scenes, was completely undone by the stupid, tension free, predictable second part. Baby does have its few moments of 'awesomeness', but they are few. And they are always destroyed by the clichés, jingoism and melodrama that Neeraj Pandey had thrown in large measures to 'hold' together the movie.\n\nAkshay Kumar rocks in his role. And he is the only one to look forward to. Danny and Anupam Kher are wasted. Danny is Akshay's boss, but he always seems to be the one who seems to be begging for Akshay's help. Anupam Kher's role play more as a comedic entry than a serious, meaty role. Tapee Pannu as a female agent is good and the sequence involving her is the best thing you will watch. Hans Zimmer like music is a pain in the ears. Awful.\n\nI think it shouldn't come as a surprise either. A Wednesday suffered from the same flaws, but since it was done on a smaller scale, the flaws were not so glaring and since it reinvented the genre of a \"kickass common man in an Indian scenario\" giving voice to the atrocities suffered by a common man, it seemed a hard hitting entertaining movie. But Baby is something that has been done umpteen number of times. So it needed to reinvent the genre itself, overcome the stupidity and jingoism associated with it, but sadly it succumbed. And being a fan of espionage thriller, I am disappointed.\n\nUnoriginal, unfunny, stupid and without any intelligence whatsoever, a pity for a movie whose story relies on a lot of 'intelligence' to crack down the terrorists. Taking its inspirations from multitude of Hollywood movies (heck there is a sequence copied from Dark Knight), the movies feels uninspired and badly done. The second part goes Argo-ish, but it is never able to maintain the tension- a prerequisite for a thriller movie, I would say.\n\nBaby is loud, over the top and utterly stupid."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sangeet9",
        "review_rating": "10",
        "review_title": "Excellent movie ever made on how to deal with terrorists!!",
        "review_detailed_main": "This movie is simply masterpiece!\n\nWhat a great way to demonstrate the scourge of terrorism and how to deal with them.\n\nA class above the rest and very bold way to show the truth to the world about the ugly ways of terrorists!\n\nMust make more such movies!\n\nThis movie has made Akshay Kumar immortal in Hindi cinema and as the most patriotic actor in Bollywood!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "badesirji",
        "review_rating": "10",
        "review_title": "Superb movie...movie is very fast...specially second half is mind blowing",
        "review_detailed_main": "BABY- An edge of the seat thriller. 2 dialogues quoted in the movie, depict that anti social activities (terrorism) is not biased: 1) The religion followed in India should be \"INDIAN\" and not hindu Muslim sikhs or Christian. When it comes to a soldier it is not the religion but only the radicals and the terrorism to be fought against. 2) The brainwashers are present in each and every country of the Indian sub continent, It is not the country specific but community specific. The technology is playing a vital role today for training various people for Jehad , without even moving from their place centralising their thinking capacity. A soldier not even thinking of himself and his family fights against all this till their last breath, risking even their identities and lives. A Movie delivering a message- not to bias a country or a religion with the anti social activities, before getting the full information. No doubt it has been banned in the neighbouring and gulf countries as this may create violence. Good job done by the actors . An interesting watch, till the end"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "abhijithshettyk",
        "review_rating": "9",
        "review_title": "Class act",
        "review_detailed_main": "What you expect from Neeraj Pandey,Akki,Anupam Kher combo.. a masterpiece. Akki and Anupan kher are amazing and the chemistry between them is to watch for in their mission to nab the terrorist Rest of the cast did really well..Dany,KK Menon,Tapsee,Rana,Sushant to mention ..All were Brilliant.. Direction by neeraj is near to perfection..One of the best Indian thriller and ever made.."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "asharani-87118",
        "review_rating": "10",
        "review_title": "Baby got something for you",
        "review_detailed_main": "First thing Akshay Kumar is my favorite hero. No matter what i watch his every movie. But this review will not get affected by this.\n\nDirector of Baby Neeraj Pandey have done amazing job in this movie, just watch it you will get it why i am saying this. Story of this movie is mix of Patriotism, Extremism, Politics and Sacrifice of our army and other forces. Movie is full of action pack scenes. This movie is one of the best movies in Bollywood, but didn't get that much popularity.\n\nIf you want watch something interesting and want full entertainment just go for this movie. Characters of this movie, shows different faces of Patriotism. Its going to hard for you to understand what this movie wants to convey but i hope you will get it."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sigireddysurya",
        "review_rating": "10",
        "review_title": "Masterpeace good movie",
        "review_detailed_main": "Its rare, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshya Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! Such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has a important part to play in. The acting is superb.\n\n, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshya Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! Such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has Its rare, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshya Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! Such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has a important part to play in. The acting is superb.\n\nIts rare, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshya Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! Such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has a important part to play in. The acting is superb."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ukssdet",
        "review_rating": "8",
        "review_title": "Baby ;Akshay Kumar's masterpiece?",
        "review_detailed_main": "Baby is one of the best movies in Bollywood.After viewing,I can finally says that this film has me.I enjoyed during its theatrical run. I can only say that I love it. Akshay Kumar is so good in this film that it is very often easy to forget he is Akshay Kumar.Last 45 minutes are awesome dealing with suspense and thriller.Simply like Hollywood.\n\nBollywood is now giving back to back outstanding movie like pk and baby. Not accepted much from this film but after seeing it I would say that it is awesome.\n\nAfter watching trailer I thought that it is similar to the \"Holiday\" (2014) But it is not, better than that, Now moving on to casting.Akshay Kumar was perfect in his role ,Anupam kher role was also good but Rana Daggubati role was not that good,Lack of acting and dialogues .taapsse pannu was like showcase in the film and other are perfect at their place .\n\nMy advise is that don't read these review just watch the movie now."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ronikmail",
        "review_rating": "1",
        "review_title": "expected a lot",
        "review_detailed_main": "before interval the movie was very boring and after that there were some parts where you find the movie watchable. In comparison with D day i give 2/10. After interval you find the story same as it was in D-Day. All the thriller scene of the movie gets executed in the last stage, thats made the movie lengthy and boring. The story was very weak.The main villain Kay Kay Menon had less then 10 min role and very less dialogs, where as Anupam Kher is doing comedy although his role doesn't suits his age still he acted nicely. There's a superb fight scene of Taapsee Pannu in which she beats the hell out of a guy . Danny Denzongpa narrated the movie in his voice and playing the role as the officer leading the team baby whereas he was dependent upon Akshay for the plan. D-DAY was much much better then baby."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mc-97775",
        "review_rating": "10",
        "review_title": "oscar wining movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "anjuraghunat",
        "review_rating": "10",
        "review_title": "Perfect thriller",
        "review_detailed_main": "No words for neeraj pandey ... Amazing work Akshay, Danny & Anupam.\n\nAt the beginning I was very skeptical, 2 hrs 36 mins film gasp emoticon OMG .... So without a single second of boredom, when the film ends, now I feel like... How did 2 hr 36 mins end so quickly? :) gasp emoticon OMG :) Loosely based on Argo (2012) Movie, Our Baby Is a Gem. If Argo can win Oscars,this deserves at least 10/10 rating :)"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vedang-02968",
        "review_rating": "10",
        "review_title": "Best potray of spy",
        "review_detailed_main": "Best spy film you should watch it. Neutral opinion but bitter truth and harsh to understand how religion can be used to kill someone."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mrambokar",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": "What a brilliant masterpiece from Indian Film Industry, Direction : 10/10 Cinematorgraphy : 9/10 Acting : 10/10 Editing : 10/10 Background Scores : 10/10\n\nI am So Happy Such Films are ' Made in India '.. Just Simple Loved it, Must watch.. This is for the First time I am ever writing a review for a film, only in the past I made such efforts for 3 IDIOTS, I always thought The Dark Knight Rises was the only movie ever to have gripped me so intensely, but talking about Baby, I don't have words, please please go watch this movie if you don't believe me.. I wish to watch this movie 1 more time to understand how intensely the director kept the pace , it's a must watch movie for the learner. Akshay Kumaar has always been my childhood hero, but in the time he has proved he can do comedy , romance, action, and now a thriller so well, I love him in Action, Well Done Akki...you are the best. How can we ignore the character of Anupam Kher and Danny.. They were the best support for the film.. Amazing guys you have made me proud...."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "hafizedi",
        "review_rating": "10",
        "review_title": "A Good Movie to Watch",
        "review_detailed_main": "Usually Pakistani don't support indians. But I do, It's a very good movie to watch. Although a little bit short of Story, there could be more in it. Well performed by both pakistani & indian actors. I recommend to watch this movie. As a pakistani I also add to it that there is no need to be enemy of our neighbor after all we are all in fact INDIANS! Peace to All! Great Movie, Great both India & Pakistan!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "Puroo",
        "review_rating": "10",
        "review_title": "The 16 year old me enjoyed it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "dabangghulk",
        "review_rating": "1",
        "review_title": "Rubich",
        "review_detailed_main": "Story was Rubich not good i don't like it waste time..."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "parthdeepsinghdhillon",
        "review_rating": "10",
        "review_title": "Never gets old!",
        "review_detailed_main": "I can't stop watching this movie... Very good performances from Akshay Kumar and Anupam Kher... The rest of the cast also did well... Arguably, the best thriller of bollywood and without doubt its best espionage movie till date..."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "silvan-desouza",
        "review_rating": "8",
        "review_title": "Neeraj Pandey does it again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "aggarpra",
        "review_rating": "9",
        "review_title": "One of the best spy action thriller in Bollywood",
        "review_detailed_main": "Baby is one of the movies I really like in Bollywood, Movie has suspense, some drama and a really good depiction of chronological sequence of things. Biggest advantage is you can relate it to real-life without loosing the interest in the movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "brocklesnar-04274",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "saurabh-sindhu",
        "review_rating": "10",
        "review_title": "hey baby jayada mat socho and go for baby.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "dangertoon",
        "review_rating": "9",
        "review_title": "Baby: Essentially India's First Espionage Thriller",
        "review_detailed_main": "I have a problem with Hindi movies. Well, at least most of them. They are pretentious. They play to the gallery. They also suffer from a sever bout of sycophancy. But every now and then, there comes a film that changes my opinion, albeit for the time being. Baby is one of them.\n\nIn post-26/11 India, there is a need for an elite counter-intelligence force that can handle any future threats to the nation. Enter Baby, which is formed as a five year trial run. Danny Denzongpa plays Firoze Ali Khan who heads this elite force and is joined by his man Friday, Ajay, played by Akshay Kumar. The film takes off on the premise when it is learned that insurgents in Pakistan are planning an attack on India.\n\nThis is director Neeraj Pandey's third directorial venture and boy is it good. He has managed to keep it real and with amazing consistency. Among all its merits, the biggest would be the fact that the film moves at an amazing pace. There is not a moment's respite and there is always a twist waiting to move you off your seat. The most important ingredient in a perfect thriller.\n\nThere a few standout scenes that Baby something even more special than what it already is:\n\n1. The slap scene at the minister's PA's office. It's shot in a lighter vein but it makes you want to applaud for the way Akshay plays it out with that straight face.\n\n2. The other slap scene during Sushant Singh's interrogation. Again, a scene shot it lighter vein. Neeraj Pandey has managed to pull off these scenes excellently.\n\n3. The big twist at the hotel in Al Dera (won't spoil it for those of you who haven't watched it yet). Amazing twist. Nobody saw it coming. Take a bow, Neeraj.\n\nBaby is flanked by one of the best supporting cast performances I have seen in a long time. Rana Dagubbati is superb as the beefy second in command to Akshay. Taapsee Pannu is a surprise package. She is outstanding in her almost cameo-like role. Madhurima Tuli is needlessly around as Akshay Kumar's wife. An angle that seems to have been created to keep the family audience in mind. Nevertheless, her presence in the film is irrelevant and almost hampers the pace at times. Anupam Kher is surprisingly out of place. He plays a been there done that role of a forever irritated technician in the team. His performance just feels a bit out of sync. Mikaal Zulfikar deserves a special mention for his brilliant portrayal of a person who plays the role of an Indian asset in Saudi Arabia. We first saw Rasheed Naz in the superb Pakistani film Khud Kay Liye. In Baby, he excels as the hardliner cleric with the ease of a thorough artist. Kay Kay Menon plays the mastermind Bilal Khan. He has very few lines and lets his eyes do most of the acting. Brilliant.\n\nBaby needs to be watched to witness the mastery that Akshay Kumar shows in his performance. He seriously needs to do more of such films. Neeraj Pandey deserves a standing ovation for Baby. He keeps at being the \"no holds barred\" filmmaker that he is and hits another one into the stratosphere.\n\nAdding any more words won't change the fact that Baby is a film that must be seen and experienced."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "crapbagcrapbag",
        "review_rating": "1",
        "review_title": "Not sure if this movie is funded by Indians or Militants",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "dhruvkhumkar",
        "review_rating": "8",
        "review_title": "Awesome",
        "review_detailed_main": "The movie is very good and packed with action....all actors did well akshay sir was amazing and also Rana Kay Kay memon anupam sir did good in thei respective roles."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "MuviFan73",
        "review_rating": "9",
        "review_title": "shows what a true soldier is!",
        "review_detailed_main": "The story begins as Akshay Kumar kills his own soldier at start, relieving him from (further) pain. He has an ideal wife who says just come back alive. A true soldier and a good story are shown. All the three directorial work by Neeraj Pandey have been well crafted, fairly paced, thrillers. Well I liked the way how everything is clearly mentioned in Neeraj Pandey's movies. A salute to all them, who don't even care to be known for their work. I liked the way how the mission with 5% success possibility gave a fruit of 1000%. Go and watch it my friends, a great release on Netaji's birthday!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "user-603-543245",
        "review_rating": "10",
        "review_title": "BABY is thoroughly engaging,thrilling and gripping but won't blow you off!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "parthee9211",
        "review_rating": "10",
        "review_title": "The best cinematic,iconic,thrilling baseline, yet simple straight forward appealing film till date",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "timpact-rahul",
        "review_rating": "10",
        "review_title": "Reasons to Watch Baby",
        "review_detailed_main": "Baby is one of the finest thriller in the world;yes you heard it right; Baby has given a tough competition to Hollywood. Baby has set a benchmark for thriller movies in Bollywood. The last 40 minutes are too brilliant that you won't even move from your seats and I assure many of you will bite your nails. I would also like to mention that Baby is not against any Country or Religion. Baby has also changed the tradition that a Bollywood Heroine is attacked by villain and Hero comes to rescue. The fight sequence of Tapsee Pannu is worth to watch. Baby has glorified the power of women Hats off to Neeraj Pandey for such a brilliant Movie. Each and every character plays a pivotal role. Akshay Kumar has given his best performance and that too as an action hero ,this one is a real masterpiece."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "luvsharma1",
        "review_rating": "9",
        "review_title": "Ohh Baby!! This BABY is very Mature.... Good Baby!",
        "review_detailed_main": "Absolutely pace-full and gripping political thriller.\n\nIt's good to see Bollywood attempting fast paced good momentum political thrillers... The movie has gone to various location across the world but it does not look glamorous or spoiled rich movies (eg BANG BANG!)... but very down to earth.\n\nIn nutshell, the movie does not drop it's momentum, holds the excitement and is moves ahead with good pace. Although, the script is not too super intelligent or fresh, but is genuine. The direction is good, all actors have acted very well, locations are good, NO STUPID dialogues, NO UNNECESSARY SONGS - In simple words - A Straight Forward NO Nonsense movie.\n\nUnderstand, that the Neeraj Pandey have not hyped anything like in Hollywood. In real life, everyone works with limited resources and uncomplicated gadgets only... The methodologies are similar...That's how our Intelligence Bureau/ RAW is equipped with... Hence it made more sense.\n\nGo for it... this BABY is mature and will not disappoint you."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nadia_dubai",
        "review_rating": "1",
        "review_title": "Nothing new! ..wait for the DVD. Same old Akshay Kumar story!",
        "review_detailed_main": "Take movies like \"Holiday, Special 26, Rowdy Rathore, Ek tha tiger\"..etc etc Mix them all up and voilà you have a \" Baby\". Totally useless waste of time, nothing thrilling or unusual about the story or action. Not worth a watch in the cinema..wait for the DVD to be out! There are many scenes in the film that will make you feel you have watched this before. Absolutely nothing unique innovative or brainy.. even Anupam khers role is weightless and not creditable , one wonders why was such a film made ..is it a desperate attempt to highlight something that is not even there, they want you to think and believe something is cooking and a certain religion and a particular nationality is involved..but the question is Why? When everything is peaceful then why the insecurity thru this film? Are we indians really that scared that we need to make a bollywood movie to highlight our fears?..still thinking why was the movie made.."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "connect-shirsha",
        "review_rating": "9",
        "review_title": "Anti terrorism squad.. real action.. thrilling presentation of the plot.. perfect..",
        "review_detailed_main": "Director Neeraj Pandey gifted us a really thrilling film regarding terrorism precisely anti terrorism. A secret squad named 'Baby' works for Indian Government as an anti terrorism squad. And the title of the film is named according to this squad name. The main protagonist Ajay is the leader of this secret squad. And Akshay kumar played the character Ajay beautifully;he represented himself as a secret agent perfectly. Rana Daggubati, Anupam Kher, Danny, Tapsee pannu all are perfect in their roles. The action sequences are well shot and those are shot in real aspect. Overall it is a perfect film with actions,thrillers.. 9 out of 10 from me for this film.. Thank you :)"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "smg242",
        "review_rating": "9",
        "review_title": "Simply superb.",
        "review_detailed_main": "This is one of the best efforts in Bollywood I have ever come across. Directed by Neeraj Pandey, otherwise known for 'A Wednesday', the film 'Baby' is about a tac-team which needs to put a stop to a terrorist attack in Delhi.\n\nThe movie is gripping from start to end, and never slows down. This is one of the few Hindi movies which I can say, was long, but never boring. The film's length is, in fact, a virtue.\n\nThe level of detail and content the movie possesses is truly something you might witness in a good Hollywood movie. Every aspect of the plot is well-covered, and there are little to no plot holes.\n\nThe action is refreshingly grounded and realistic, the acting a little less so, but good and more than forgivable, nonetheless. Even within his somewhat short screen time, Kay Kay Menon steals his scenes, hands-down. The rest of the cast puts on a pretty controlled act. Akshay Kumar in the lead role is a lot less goofy and a lot more likable and firm as his character.\n\nI do wish that Menon had gotten a little bit of more of a role, and I think that his talent was a little wasted, but I guess he does justice to his pretty pivotal character.\n\nOverall, with a winning story, a detailed and clever plot, sure- handed direction, and some truly impressive action, 'Baby' succeeds sky- high, emerging as one of the best patriotic/espionage movies ever. It is no doubt a must-watch."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "somilagarwal68",
        "review_rating": "10",
        "review_title": "Must Watch -- A Excellent Plot",
        "review_detailed_main": "Well this is another feather to Akshay Kumar cap after movies like Holiday and Special 26.\n\nIts a movie which will make you feel the devotion the soldiers have for their country rather than their families. It's a thanks to all soldiers.\n\nA excellent plot ,thriller , suspense, a descent comedy scenes you can enjoy during those 160 minutes.\n\nIt does not have sandwiched songs which is really good.\n\nAskhay and Dany are awesome with there lead roles.\n\nHappy Watching."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "roshankmr916",
        "review_rating": "10",
        "review_title": "Awesome and Must Watch Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "abhisheksaha-619",
        "review_rating": "9",
        "review_title": "A Gritty Thriller about Terrorism with Akshay the Action Hero",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "tyagi-kumar-vineet",
        "review_rating": "10",
        "review_title": "Master piece.Do not miss it.",
        "review_detailed_main": "Superb and rare Bollywood movie which is fantastic in every sense.Excellent work done by Director and Actors.Fantastic background score.Everything has been done till tiny bit of details.All the time it was unpredictable whats gonna happen next.Second half is even more fantastic and thrilling.You cant miss even for few seconds.No song and no unnecessary love making scenes.Everything is very realistic.Even it rare to see in Bollywood film to see a female actor to fight like a professional police women the way Taapsee Pannu has fought.Fantastic work done by her.Highly recommendable and do not miss it.Will definitely go to the history book in the Indian Cinema as one of the top most movies."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "azdaprynce",
        "review_rating": "1",
        "review_title": "Not so good as the ratings would have you believe",
        "review_detailed_main": "I mean may be if i am an indian then i'd get it, the plot is the worst."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "tushar1128",
        "review_rating": "9",
        "review_title": "Impressive!!!",
        "review_detailed_main": "Baby stands out as one of the most breathtaking and bold cinemas Bollywood has ever put up. A gripping storyline well assembled and executed by Neeraj. What's worth with the film is the powerful performances by every character and specially Akshay. The topic of terrorism is sensitive and religious sentiments of particular section of society will definitely be touched, but the way the characters have portrayed themselves will give your heart a spare moment to think as a National. There are no loose moments all the way and will keep you grilled till the final moment. Cant resist to mention Madras Cafe which handled the same subject with utmost perfection. Certainly, movies like these are rarely made in India, so a full thumbs up!!! Go for it!!!!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "kunaldutt204",
        "review_rating": "10",
        "review_title": "Gives the root cause of terrorism in India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "jpalnitkar",
        "review_rating": "10",
        "review_title": "C'est Formidable !!",
        "review_detailed_main": "It was like my good old CAT ( MBA test ) days .... Thrilling and heart- pounding till the end .. Must watch !!\n\nNeeraj Pandey is an Indian Hollywood-style film-maker .\n\nI didn't find any blasphemy .. on the contrary such a film should have been made long ago when India saw its worst terror strike .. Great Job!! Akshay Kumar has outdone all his past performances ..\n\nI slightly over-rated it at 10/10 .. but really liked it so being a bit partial\n\nDo watch it as Bollywood has finally learnt some great film-making skills .."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mayur-dynamic",
        "review_rating": "9",
        "review_title": "A title must in your action thriller movies collection...!!!!!",
        "review_detailed_main": "A Wednesday, special 26 and now Baby, Director Neeraj Panday has yet again proved and shown why he is the best when it comes to a movie in thriller category. With Baby it leaves Mr.Panday with hand raised high ahead of all for giving best of thriller movies since A Wednesday. Counter terrorism is a very complex subject and an issue for every country currently. Here the subject being counter terrorism, how these men fight against it for the country is shown in very professional way. And in real life, we the normal people are not even aware how these men protect us all without caring for their lives and families. We salute you guys. I hope many of you will agree that there would be quantity of around 100 movies being made during a year, but very less are Quality movies. With Baby movie, you will get the feel of a Hollywood action thriller movie, yes you surely will. The thriller and action sequences, the camera work are done in almost perfect manner. When it comes to action thriller sequences, Indian movies don't have much innovative way to show up things even if it is a hand-to-hand fight or fight with guns ( like: Bourne Series, Taken). The way how Rana Daggubati and other 2 officers eliminate the terrorist threat in the mall is the way how stealth operation is being done. Silent and surprise! Really pleased to see that those men are carrying guns with silencer and not the typical guns or Ak's and start blowing all the shift around. This type of quality action we can expect from only Neeraj Panday. (after watching Baby I can say...)I mean in how many Indian action movies have you seen this? I am not just considering this as the only point but still...I hope you can easily make it out if you are truly an action thriller movie freak right? Story flows pretty with the pace. The last 30-45 minutes are truly the thriller moments of the movie. Akshay Kumar has given his best performance. All other characters are equally contributing. Good to see Mr.Danny after long time in similar role after movie - 16th December. Baby movie is surely a roller-coaster ride. No complaints! No songs, 2 thumbs UP!!\n\nBaby, this title is a must in your collection of action thriller movies.\n\nWe hope Mr.Panday will continue this good work of making quality movies. You can surely bring change to action movies the way they are supposed to be made and shown.\n\nDon't miss this movie. A must watch !!!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "lov_nks",
        "review_rating": "10",
        "review_title": "Above All Expectations",
        "review_detailed_main": "I went to see baby with the expectations of it being a good movie in the genre like Special 26 or A Wednesday. However i was surprised to see such a perfect thriller, specially for an Indian movie !!!\n\nThe movie is the best thriller ever in Bollywood till date. It is very realistic and 100% original.\n\nAkshay Kumar gives the best performance ever of his career till date. Though still his next quality movie i believe can be Airlift (still in production).Neeray Pandey, i believe, is actually the BEST director in Bollywood now. Never i could have imagine an Indian director giving such a great real-life feeling thriller, maybe even better than Hollywood movies. Hat's off no song in the film.\n\nFilm is not racist at all and not against Muslim religion. It is only against terrorists. Even the Pakistani actors did great. Akshay, Neeraj, Tapsi & the team rocked.\n\nA MUST WATCH FOR ALL Hindi CINEMA LOVERS. RATING: 11/10"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mitbaldawa01",
        "review_rating": "9",
        "review_title": "Don't Miss it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "harryok2",
        "review_rating": "3",
        "review_title": "A good script spoiled by low standard acting",
        "review_detailed_main": "Please guys be honest and rate the movies. To be honest these actors are doing movies like this because it doesn't matter to them as they are paid anyways. As a viewer we need to be honest and stop watching whatever comes in box office."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "kirtanpatel-231-210420",
        "review_rating": "10",
        "review_title": "Excellent, perfect thriller in the history of Bollywood",
        "review_detailed_main": "It is the best Indian thriller I have ever watched with so much of perfection. An edge of the seat thriller with that feels like you are truly in that spy world. It doesn't allow you to go out of movie for a single second. Kudos to Neeraj Pandey. He is one of the best film director in India today. As far as performance is concerned everybody is so perfect that no one can comment on that. Anupan kher, Taapsee pannu, Danny sir, Rana, Kay kay Menon, sushant singh. But I want to specially mention that along with story, script and Neeraj Pandey Akshay Kumar is the hero of the film stupendous performance. It the best is his career, he truly deserve best actor national award. If this film is would be a Hollywood that surely i would have a super box office success and also got many awards including academy. But sad we Indians don't give it due regard to this kind of cinema.\n\nPlease guys get out from mindless masala films.\n\nRequest to Neeraj Pandey and Akshay Kumar please make this kind of films more often in future."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "haroonch678",
        "review_rating": "8",
        "review_title": "A Masterpiece Movie,.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rraghav",
        "review_rating": "10",
        "review_title": "Very good Bollywood film",
        "review_detailed_main": "I am happy to have seen this movie during its theatrical run, such movies have to be promoted in Bollywood. I wouldn't compare this with any Bourne series installment but this indeed is a damn good film. The movie runs real fast and you won't get tired of watching some scenes which could have been edited. The story is simple yet made quite interesting. Its a thriller in every sense. The movie is shot in some beautiful locations which will give you a feel of a Hollywood flick. All actors were good in there roles especially Akshay Kumar who has given a very good performance. I guess we can expect a lot of good movies from him in future. There are some loop holes but we can ignore them, Neeray Pandey is just 3 films old but he is a great director to be. I am giving this 10/10 perhaps a couple of points extra because its a Bollywood movie and I want more such movies from them. Finally this movie is not anti any religion. Go watch it you won't feel regretted."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ganeshptriya95",
        "review_rating": "10",
        "review_title": "award winning movie",
        "review_detailed_main": "Its rare, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshya Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has a important part to play in. The acting is superb. Everyone, and I mean literally everyone has acted so well that sometime you feel like you are not even watching a movie. Anyone who loves watching Bollywood movies, should not miss this classic. It's a classic, a masterpiece and kind of movie that is made once in a decade. Simply stating it, Its one of the finest movie ever made in Bollywood."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "pranaypdip",
        "review_rating": "10",
        "review_title": "Simply the BEST Bollywood thriller/action!!",
        "review_detailed_main": "I have nothing but good things to say about the film. There isn't a single point in the movie which makes you take your eyes off the screen. There is a perfect balance between Action, Light Humor, and Thriller. The movie is well directed and cinematography was perfect. We definitely need more films like these over typical non sense films (Chennai express, Happy new year, etc.) Akshay continues to build a positive image by delivering hits like (Holiday, Special 26). Indian cinema is is well capable of making impact full movies. With Modi and Good impactful films India can definitely change (sorry for bringing politics here, but its true)."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "karan-m-sharma",
        "review_rating": "10",
        "review_title": "This is how Bollywood is growing . All 5 Stars",
        "review_detailed_main": "To be honest, I was unsure about this movie After watching Akshay's \"Entertainment\". But he left me speechless again (After Ajnabee & Special 26). I was not able to take off my eyes from the screen. This is called movie in true sense.Bravura performances. Classy Direction. Amazing script and it's execution. Pandey proved his brilliance again. This is how you spell thriller. Last Words: It is an intelligent movie with best performances. You would not regret watching. Take a bow. Standing ovation with loads of applauds. This can be industry's future. We want more films like this. Let me correct my self. we want more scripts like this."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "barcacatalunia",
        "review_rating": "1",
        "review_title": "Not good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "DareDevilKid",
        "review_rating": "9",
        "review_title": "This Baby is One Helluva Adrenaline-Pumping, Wholly Entertaining Ride",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "uccirfaanansari",
        "review_rating": "10",
        "review_title": "Best 2015 film. Only and only for India - JAI HIND",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ashishpokiya010",
        "review_rating": "10",
        "review_title": "great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "danishparab2",
        "review_rating": "9",
        "review_title": "bollywood gets a new level",
        "review_detailed_main": "By the movie name baby u should not think that movie is worst,but these movie is like that u are watching a Hollywood movie instead of bollywood movie.baby means a team code name and it is a worth watching.the first half is brilliant dialouges,action are well crated,but second half is OK it is not good as first half.But trust me u will not get bored.the movie keeps u in edge of the till end.but if ur thinking to watch movie only for heroines.YOU should not think that bcuz the heroines work is not there rather of one scene of fighting.the role of akshay kumar is brilliant.but in second half is good bcauz of anupam kher. if u like action thriller this movie u should watch u will not be disappointed of movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "roopalkgupta",
        "review_rating": "10",
        "review_title": "Now this is what I'd call a quality film..from Bollywood!",
        "review_detailed_main": "If you watch lot of Hollywood movies and wonder why there are no such movies made in India, you should not miss this movie. Watched an excellent bollywood movie after a long time. Kudos to Neeraj Pandey and his team for the hard and smart work they have done. A very well written plot with crisp screenplay, accompanied with flawless performances of Akshay and others leave you spellbound. The film successfully glimpses the challenging lives of Intelligence people. It filled me with patriotism. I am sure Indian audience are getting maturer and would certainly appreciate more of such work. I hope the other directors in Bollywood also will soon realize the same and let us get rid of Dabangs, Dhooms and Singhams and make even the small town audience for whom they make such masala movies, grow up. I wish we get to see more movies like BABY."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mishra_ishan",
        "review_rating": "10",
        "review_title": "Must watch!",
        "review_detailed_main": "One of the rarest kind of movie ever made.A kind of must watch.One wont get bored watching this movie. Basically its one of the plot involving terrorist attack and their confrontation.But the screen play made it all.Its starer are treasures of talent.Good to see AK back with a good movie this this. It also described that irrespective of place,religion police n other federals agents are against the terrorist activities collectively and Muslim religion had nothing to do the terrorism.Its always an individual choice no matter whether they belongs to India or some other country.Above all it also showed the selfless love for country by the people who are trying to save the country. Rest Enjoy the movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ekthatigerk",
        "review_rating": "1",
        "review_title": "HEADACHE!!!!!",
        "review_detailed_main": "Boring Movie Very Slow Screenplay Imaginary Concept."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vikitaru-210-281322",
        "review_rating": "10",
        "review_title": "Best movie I have seen for a while",
        "review_detailed_main": "Fantastic movie .Gripping ,funny ,realsitic .no songs ,speeches .loved it . Akshay Kumar is superb as are all the actors . My wife found the Pakistani actor who plays Ashfaq in the movie very handsome . Its sad that some reviewers feel the movie is anti - Muslim .its really not in my opinion . The boss man of the agents Feroz was a Muslim . It simply portrays reality the way it is instead of making villains with preposterous silly names like Dr Dan and Kittamkittu as in typical cheesy Indian fare . I do think this movie deserves award as best movie of the year in filmfare awards etc . Yes there are some plot or action holes but thats in every movie . I think some Indian reviewers are too used to the song and dance routine to appreciate What a great and well made movie this is .all Indians should watch it."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sourabh-bacardi",
        "review_rating": "10",
        "review_title": "Explosion of action and thriller, HELL AMAZING...",
        "review_detailed_main": "Oh My God, it was hell amazing thing I have ever watched in my entire life. Full of action, full of thriller, full of amazement, full of every-effin-thing; or i can just say it in my way that this movie was an explosive mixture of MDMA and LSD poured on both weed and hash and then made a damn effin joint of that lord stuff - that movie it was. Oh did i miss magic mushrooms hahahahaha damn good man.\n\nI simply can not explain how awesome this movie was. just for this movie i can say yes i love bollywood. First i was like who can name an action movie \"baby\", but seriously it was an awesome movie. in the whole runtime i wasn't moving a damn muscle LOL. Hats off, Loads of claps *Loud Claps* :D I was tripping the whole time, I still am.\n\neverybody should watch this movie. if IF someone somewhere wont like this movie for any effin reason then he/she would need a professional help or can get a life or can get my middle finger lol"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mihir-pandya47",
        "review_rating": "10",
        "review_title": "a masterpiece movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "DhaporShaankh",
        "review_rating": "10",
        "review_title": "Good Quality Cinema",
        "review_detailed_main": "Excellent movie slick action thriller. entertaining start to end, 2nd half is better. Good camera work, some of the visuals I have not seen in any movie in the world, not just Bollywood movies. One of those movies u have to watch in theaters. glad I did it! Akshay does good work, this guy can surprise u. Kay kay menon, wow, he is a chameleon. can become anything. Anupam kher, Danny also good. I have almost lost faith in commercial bollywood movies but here comes the surprise. Got my money's worth. Bollywood should focus more on this type o movies with strong story line and good performances. Audience will turn up in big number for sure."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "debangshus23",
        "review_rating": "9",
        "review_title": "Patriotic Film",
        "review_detailed_main": "I have seen this film 3 times, and going 50 km from my home. Every time I get a new thrill, new patriotic feelings. I am proud of our soldiers and intelligence department. They also must watch the film. This is for all proud Indians. But it cant reached to multi billionaire's club. But its ratings are spectacular. Akshay Kumar, Anupam Kher, Tapsee Pannu etc did a very good work in the film. Every stunt did by Akshay Kumar is awesome. And the fighting scene of Tapsee Pannu in Hotel was great. This is the best film I had ever seen, I would like to watch the film again and again. At last I want to say that I am eagerly waiting for the BABY 2."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "manilkumar73",
        "review_rating": "10",
        "review_title": "One of best thriller",
        "review_detailed_main": "I had some reluctance in watching Akshay movies but had to watch as I with my family were not have much option last weekend.\n\nWhat I witnessed is one of the outstanding movies that I have seen in recent years, thanks to the excellent and unique direction from Neeraj and acting by all the actors. There was not much talk between characters and were up-to point. Each actor had their tasks cutout and they have performed to their expectation. I especially liked the role of the lady spy., and should see the intensity in her eyes. The last 45-50 mins will make you sit on the edge of your seat, believe me :).\n\nThis movie is altogether in different level compared to regular masala, all smiles/styles, filled with 6-7 songs.. khan movies.\n\nJust don't go with the media review as most of them are paid and corrupt. This film is highly recommended for everyone who loves well made and good action thriller movie. Kids can also watch but with parents only as some scenes are violent."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "miya_sallu",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "deshpande-a007",
        "review_rating": "10",
        "review_title": "BABY is Real & Pure",
        "review_detailed_main": "Akshay Kumar's body language perfect fit for an Agent. Splendid Performance given by him and whole Team. It is Pure Realistic Film based on terrorism. Neeraj Panday did Great job again after Wednesday and Special 26. Akshay Kumar, Anupam Kher, Dany, Taapsee Pannu, Rana Daggubati, Kay Kay Menan, Rashid Naz, Miqal Zuliqar Everybody acted Superb. Cinematography is also Best. Locations of Istanbul, Nepal, Delhi, Mumbai and Abudhabi are well captured by Sudeep Chatterjee. Very Well balanced Screenplay. Dialogues are more Realistic. The Captain of BABY \"Neeraj Panday\" is Best of Best. Twists and Turns makes BABY more Thrilling. It keeps you on the edge of your seat. Last 45 minutes of the film are just Outstanding. Its is thoroughly Enjoyable Cinematic Ride. Go and Watch BABY. Cinema At its BEST"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "pradnya18",
        "review_rating": "9",
        "review_title": "Awesome movie",
        "review_detailed_main": "Was looking forward this kind of action movie. Unlike tollywood style stupid unrealistic action. Akki we were looking forward for some real action and this is it!! I loved the plot and storyline. Bollywood needs some real movies like this.Great caste and awesome direction. Less romance more action. Akki serves for an anti terrorist team and name of his team is \"BABY\". Danny is the chief of BABY. This film s about them trying to stop terrorist attacks by terrorist organization lead by a person residing in Pakistan.\n\nThey have successfully pictured real situation and India-Pakistan problems."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ash-bhupesh",
        "review_rating": "10",
        "review_title": "Epic Thriller and action Movie... Go watch it now!!",
        "review_detailed_main": "One thing is for sure when you'll watch this movie. You will glue to your seats. Your heartbeat will go for a roller coaster ride with every passing minute of this movie. I have to say, this is the best thriller movie I have ever seen. And more importantly it is a bollywood movie. Such type of classic movies come once in a decade. So, go watch it! Direction, cinematography, and acting... Everything is done precisely.\n\nWhat an amazing Direction by Neeraj Panday! Kudos to you sir! And every single character in the movie justify their brilliance in acting. Akshay Kumar, after many comedy movies, has come out amazingly great with this movie. Danny as usual is great with his performance. And in fact every single person has done amazing job. I hope other Directors in bollywood industry will also learn much from this class movie that Indian audience need such classic movies and not only lollypop movies always."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "gulfisaforever",
        "review_rating": "10",
        "review_title": "Just a clarification",
        "review_detailed_main": "I saw someone commenting that the film has a WRONG message that every terrorist is a Muslim. I would like to know from him, does he know any terrorist who is not a Muslim? Obviously, I agree with the fact that, every Muslim is not a terrorist. But, I have never come across any terrorist who was not a Muslim by religion.\n\nI know this is supposed to be a review for the movie Baby. But certain things need to be clarified.\n\nI was not particularly impressed with Special 26, it was a dull and dumb, slow sluggish movie. But there were people who found it mind blowing, amazing, etc etc. So not many expectations from Baby."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rashboy-abhishek",
        "review_rating": "8",
        "review_title": "BEST Bollywood action thriller till date.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vipcooldude",
        "review_rating": "10",
        "review_title": "BABY is smart, intelligent, sensitive and Brilliant...A MASTERPIECE !!",
        "review_detailed_main": "Finally watched BABY n I am still thrilled, awestruck n moved after watching the film...undoubtedly the best action thriller (technically of international standards with very real action sequences) from India till date with superb script, execution n direction (with fine detailing) from the genius Neeraj Pandey...Akki's finest performance till date...he makes this character of an undercover agent so believable and underplays it with so much conviction n realism getting into the skin of the character without making it superficial or larger than life hero...terrific realistic performance from my favorite actor wink emoticon Other actors also have performed brilliantly but the real surprise is Tapsee Pannu...she is amazing in her small but important role of an undercover agent (Kickass action sequence !!) I think BABY is an important film to watch as it throws light on Global Terrorism being non judgmental (Terrorism has nothing to do with any religion or any country) about it!! BABY is thrilling, engaging, nail biting n gripping which keeps you on the edge of your seat throughout it's running time but still entertains n moves you with it's good intentions of telling an important n true story about these unsung heroes (undercover agents n officers) of our country who are doing their thankless jobs just for our safety n security from day to day threats n sacrificing their own lives without revealing their identity to anyone (not even their families)...Salute to them !! BABY is a film which every Indian would be proud of n which deserved to be watched by each n every Indian...OUTSTANDING !! ‪#Proud‬ This BABY is smart, intelligent n sensitive :)"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "dabanggk-86503",
        "review_rating": "1",
        "review_title": "Dulllll Movie",
        "review_detailed_main": "Very Disappointed with script , director.\n\nDull movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "pkhrlniraj",
        "review_rating": "10",
        "review_title": "Awesome Movie",
        "review_detailed_main": "Such a great movie, Awesome screenplay and direction. Plot is great, make everyone hold their breath with the event sequences. Superb acting by Akashay Kumar. A straight forward movie with no nonsense and songs involved. Overall super-hit movie and a must watch. Only the ending is bit confusing. Even the dialogs are great. The movie has shown depicted the natural acting as well as the action sequences. The acting of Tapasee panu is also great. Anupam kher makes the 2nd half so interesting that you will be amazed. Rana Daggubati might not have the major role for as a supporting actor, he has done his part. The way the movie shifts the plot from one country to another is very quick and the representation is also fantastic."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "surajrana-217-365470",
        "review_rating": "10",
        "review_title": "Just Excellent Piece of Work",
        "review_detailed_main": "When I started watching this movie, I was not expected such a extreme piece of work from Neeraj Panday. Although I was very much impressed from his previous work in Wednesday, though the same quality was not in Special 26. But Baby is going to be just awesome. A perfect Thriller ,\n\nWriter-Director Neeraj Pandey has made a brilliant film that is not only technically at par with the best in the world, but it's also a dispassionate non-judgmental take on terrorism that's completely devoid of jingoism and is extremely gripping. Full marks to Producer Bhushan Kumar for believing in such a landmark film, backed by exceptional marketing especially when it's devoid of songs.\n\nFiroze Ali Khan (Danny) heads a special operations wing of commandoes called Baby. In a conversation with a senior minister in the beginning of the film, he states that the Government ought to win the confidence of the Muslim community in India, for Pakistan is taking advantage of the community's sense of alienation within India. In another scene Ajay Singh Rajput (Akshay Kumar) tells an ISI agent Taufeeq (Mujeeb Khan) how he defended a Muslim family during the Gujarat riots and why he puts 'Indian' in the Religion bracket in all forms that he fills. Somehow this sets the tone for the film that terrorists don't have a religion and no particular community ought to be associated with terrorism.\n\nThe screenplay is the hero of BABY. It flows lucidly, taking you on an engrossing journey of thrills, intrigue and surprises. Dialogues are peppered with bullets of dry humor that keep you entertained throughout. The verbal-expletive-laden warfare between Shuklaji (Anupam Kher) and Ajay is a case in point in this regard. Or when Ajay matter-of-factly tells Priya (Taapsee) as they're on the flight to Kathmandu to \"stop being my wife\" when she informs him about his snoring. The precarious uncertainty in the life of an Officer involved in covert operations has been portrayed in a subtle but telling manner. Ajay's wife (MadhurimaTuli) isn't aware of her husband's job profile but does tell him now and then, \"Bas marna mat.\" The scene where Ajay slaps the personal assistant of a minister (on his frivolous remark on the death of his colleagues) will result in an applause from the audience in the theaters.\n\nThe narrative of BABY flows like a well-made Hollywood film. Actors filter in only where required and they're not repeated just because it makes a commercial sense from a typical Bollywood perspective. Taapsee is part of one operation. Anupam Kher and Rana Dagubatti join the team in the scorching climax sequence shot in Abu Dhabi. Sudeep Chatterji's cinematography deserves a special mention. He has done an exceptional job especially in the chase sequences in Istanbul and the desert escapades in Abu Dhabi.\n\nAkshay Kumar has done an incredibly good job in BABY. He's razor sharp and there's never a dull moment whenever he's on screen. In a scene in an Airport washroom when he bandages himself despite excruciating pain is superbly done. He's exceptional during all his action scenes as well. The entire supporting cast is excellent. Danny is a picture of precision in giving the right expressions. He doesn't bullshit nor lets anyone else do the same. Anupam Kher weaves in magic in a cameo. He's entertaining and he gets the job done. Kay Kay as the dreaded terrorist Bilal makes his striking presence felt. Sushant Singh is effective in bringing in humour in a least expected situation. Rana Dagubatti as the tough officer Jai is competent. Taapsee is a sharp Commando. She shall be proud of this film. Rasheed Naaz as Maulana Mohammad Rahman has an interesting appearance and an even more interesting way of dialogue delivery. Mikal Zulfiqar, another Pakistani actor makes his presence felt in a cameo.\n\nSanjoy Chowdhury's background score is the heartbeat of BABY as it instills the necessary emotions at opportune moments in the course of the narrative. Shree Narayan Singh's editing is exceptional. Even though the duration of the film is over two and a half hours, the taut pace keeps you hooked. The last 45 minutes of the film are simply extraordinary and fast paced.\n\nOn the whole, BABY is one of the finest films ever made in the history of Indian cinema. Not only because of its excellent cinematic credentials but also because of the balanced 'Thought' behind the film. Neeraj Pandey once again proves that he's a genius. This time he proves, it's possible to better Perfection. We say, hey baby, don't think, just go for BABY. Cinema at its very best!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sk-225-766256",
        "review_rating": "10",
        "review_title": "One of the best movies...... must watch...10* can be possible.",
        "review_detailed_main": "This time around, not only does he have to stand up to brutal adversaries from the enemy camp, he also has to reckon with rivals within the ranks. Despite its largely realistic approach to the theme, Baby is an unconvincing portrayal of the life and times of a brave spy whose job is to thwart terror plots. The film draws many of its plot details from real people and incidents. But, in constructing its worldview about good guys and bad guys, it goes completely overboard with overt alarmism and finger-pointing. The principal villain of the film is a Hafiz Saeed-like maulana who, from his hideout on the other side of the border, plots terror strikes against India.\n\nMakers of Bollywood thrillers are obsessed with counter-terrorism ops. So in recent times, Hindi movie fans have witnessed the heroic exploits of many an undercover agent and wondered where the truth of such covert missions really lies. Neeraj Pandey's oddly-titled Baby does little to dispel the questions. Worse, it perniciously plays up prejudices in the bid to give its storyline a jingoistic context and mass appeal. After busting sleeper cells last year in holiday, a soldier is never off duty, action hero Akshay Kumar is back in business to send the terrorists packing all over again."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "superindrajit",
        "review_rating": "9",
        "review_title": "A gripping espionage thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "amitgarg_pta",
        "review_rating": "9",
        "review_title": "Grip torture regret view in future for life in time off advance nature for real acting drama in intelligent producer intelligent actor regret time coact regret sponsor talent.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "arun-aru771",
        "review_rating": "10",
        "review_title": "Another classic from neeraj Pandey!!",
        "review_detailed_main": "I was compelled to write to about this movie after watching it for second time. As for the movie is concerned it's fabulous.Neeraj Pandey after last outing has come back to terrorism as the theme.This movie is an edge of seat thriller with beautiful unexpected twists. The best part of movie is that it has no songs and unnecessary hero-heroine emotional drama.This movie really deserves a standing ovation, and the director has to be applauded for this brilliant effort. Direction-Top notch Acting-All actors have played their part efficiently Akshay Kumar does role of his lifetime. Music- Background music is soul of this movie which keeps audience hooked Action - finally I got a movie with realistic action, I was really fed up of rohit shetty style\n\nNote- please watch this movie in theaters or else you ll be forced to see Chennai express,happy new year,dhoom 3 kind of movies."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "pranu-83218",
        "review_rating": "10",
        "review_title": "interesting and a great movie.",
        "review_detailed_main": "Indian espionage action thriller directed by Neeraj Pandey, featuring Akshay Kumar in the lead role. The film is superb for its gripping storyline, intense action sequences, and Akshay Kumar's powerful performance...... The narrative of \"Baby\" revolves around a secret counter-terrorism unit tasked with identifying and eliminating threats to national security......Akshay Kumar portrays Ajay, a committed and determined officer who is part of this covert team. The film follows the unit's relentless pursuit of terrorists across different countries while navigating complex political landscapes and facing life-threatening situations.... is a must watch.."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "aasshhuu2011",
        "review_rating": "9",
        "review_title": "Very Well directed and narrated",
        "review_detailed_main": "Well I feel proud to be an Indian to have it's own kinda movie directed in bollywood. The story is at its best. I love the efforts for the script which is written by the director itself- Neeraj Pandey. He has done the good job. This movie has everything except little more romance. Of course Action as Akshay Kumar is performing leading role, comedy in the middle. The director should have introduced the character of Anupam Kher of being Shukla as technical support. One of the best job of the movie is that they have only one song has shot as it saved a lot more time for more direction in script. Movie has been shot throughout some foreign countries like Saudi Arabia, Turkey which makes the direction somehow perfect. In and all movie is just great and every Indian should watch Akshay performing his actions back again."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "huzefanampurwala",
        "review_rating": "10",
        "review_title": "Ohhh my baby",
        "review_detailed_main": "Baby is a 2015 Indian Hindi-language action spy film written and directed by Neeraj Pandey. The film marks the second collaboration between Akshay Kumar and Pandey after Special 26, and stars Kumar in the lead role, along with Anupam Kher, Rana Daggubati, Danny Denzongpa, Taapsee Pannu, Kay Kay Menon, Mikaal Zulfiqar, Madhurima Tuli and Rasheed Naz. In the film, an elite team of the Indian Intelligence system, perpetually strives to eliminate terrorists and their plots, during which an officer leads a team to destroy one such potentially lethal operationA must watch suspense movie for all the fans of Akshay."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "akkumaralok1988",
        "review_rating": "10",
        "review_title": "The real Movie after a long time \u0085 Akshay Kumar at his Best.",
        "review_detailed_main": "I saw \"Baby\" in the early afternoon, a fact for which I am thankful. Incredible, riveting and powerful. What else could I say? This movie has all of the qualities of classic film noir as well as the magnitude of an original, unique concept that has been tried and tired before but works here. Why? Because it then proceeded to dominate the majority of my thoughts for the rest of the day. That night I lay in bed, tossing and turning, my mind trying to wrap itself around the story, and I absolutely could not GO TO SLEEP! This is a movie that gets in your head and will not get out until you figure it all out. And that can only be done with extensive internet research. Akshay Kumar at his Best. \"Baby\" is nothing short of a phenomenon. And a brilliant one at that."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shivsutsoni",
        "review_rating": "10",
        "review_title": "Action movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "akashsingh-56044",
        "review_rating": "9",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sreeragrmails",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "This is one of the best movies ever made in thriller category. Akshay has done brilliant stunts in this movie. The dialogues were incredible. This is a movie that you can watch with your family and get a message out of it too. I totally recommend you to watch this movie. It will impress you as much as Special 26 did. This movie will be a blockbuster. That's all i have to say!\n\nREPEAT*** Don't read this******* This is one of the best movies ever made in thriller category. Akshay has done brilliant stunts in this movie. The dialogues were incredible. This is a movie that you can watch with your family and get a message out of it too. I totally recommend you to watch this movie. It will impress you as much as Special 26 did. This movie will be a blockbuster. That's all i have to say!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "tataambani",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "Baby is an beautifully written coming of age drama with a amazing screenplay and performances. This on the whole looks like a love triangle but it is not just that it is 3 characters making mistakes finding themselves to put it precise it is just them relflecting the human nature in them which is flawed & fluctuates. Another best thing about the film is it never judges anyone from the world. Even after vaishnavi does something which usually must bring a rage during the vieweing makes us feel sorry for her is where the writing peaked. It has many beautiful monolouges to state some the scene where vaishnavi mocks about a phone which anand gifted here we arrive to a point to judge vaishnavi but immeiately anand does the same by using words to shame her character where both become the same. The best part is to again highlight is the human nature that baby addresses so well that no matter how much we try to be the person we want to be. The circumstances people and the place decides."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vkalpana-72092",
        "review_rating": "9",
        "review_title": "Wonderful Movie",
        "review_detailed_main": "Best Thriller spy action movie. Watching this movie time we are eagerly waiting for the next scene...bcaz this movie is very thriller. In the course of foiling one terrorist attack bid, Ajay discovers a major threat to our nation - a plan to cause damage and strike fear at the heart of our very existence. The plot is masterminded by a maniacal leader whose organization has its tentacles spread across the world. As days progress, the unit goes through escalating challenges with time ticking against them and risks escalating. At all points, the members of the unit give it all they've got and stand tall to guard us with all their strength so that we may sleep safe in our homes. Covert and courageous operations are performed across Kathmandu, Istanbul, Abu Dhabi, Delhi and Mumbai as our protectors will not rest till evil is debated."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "maulin5",
        "review_rating": "9",
        "review_title": "BABY film is a damn hit, Baby!!!",
        "review_detailed_main": "Neeraj Pandey is back with his third movie titled Baby, after A Wednesday & Special 26. He once again proves that he can make superb movies again and again. BABY is a group by Indian Officers to protect the world from the terrorist attacks. Denny plays the role of the chief, while Akshay Kumar is as Ajay, one of the member of the group Baby. Anupam Kher, Rana & Taapsee Pannu are also one of them. How they can able to catch the main terrorist & his agents is what the film is made of. Akshay is back after Holiday, very energetic performance. Anupam & Rana fit to their small role. I liked Taapsee in Baby, specially her fight sequence. Denny, Shushant & Kay Kay are as usual fantastic. The character of the P.A. of the minister is too funny. & the main villain, Mohammad Rehman, a.k.a. Rasheed Naz is too much dangerous. His speech made me speechless. Screenplay, Script & Direction - has been done by Neeraj. He wrote an extraordinary, full of action screenplay, which he can able to direct better then what actual it's. Some scenes are off to mark. Like, In Nepal, where Akshay is jumping on the steps of a temple. Or the helicopter shot shoot in Saudi, the desert scenes, chasing sequence in Nepal, the fight scene of Pannu & Shushant in hotel - these all and many more are marvelous. The film has little bit comedy factor, too. The P.A. is too funny. Even the love factor in Akki's character makes some lite moments in the film. Year 2015 has its big & bright release, called BABY. Go for it! You have to admire this type of serious work of the makers. Good films will never harm you. So please go and watch it. BABY, will surely give you a damn, Baby!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sanjay-26251",
        "review_rating": "10",
        "review_title": "amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "wdrpwarnakula",
        "review_rating": "9",
        "review_title": "Awesome movie... Baby delivers",
        "review_detailed_main": "One of the Best work from akshay.. .it really keeps you glued to the screen... Acting was top notch..wonderful direction.. keeps you engaged till the end Baby starts on high ends on high.\n\nI was compelled to write to about this movie after watching it for second time. As for the movie is concerned it's fabulous.Neeraj Pandey after last outing has come back to terrorism as the theme.This movie is an edge of seat thriller with beautiful unexpected twists. The best part of movie is that it has no songs and unnecessary hero- heroine emotional drama.This movie really deserves a standing ovation, and the director has to be applauded for this brilliant effort. Direction-Top notch Acting-All actors have played their part efficiently Akshay Kumar does role of his lifetime. Music- Background music is soul of this movie which keeps audience hooked Action - finally I got a movie with realistic action, I was really fed up of rohit shetty style\n\nActing 9. Story 10. Direction 9. Action 10.\n\nDon't miss this masterpiece.....!!!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "jay-techie2007",
        "review_rating": "10",
        "review_title": "MUST WATCH if you are interested in high-quality thrillers",
        "review_detailed_main": "Baby is one of the best thrillers Bollywood has come up with. It was Neeraj Pandey's third movie after \"A Wednesday\" and \"Special 26\" and it's difficult to choose which one was best. However, I have seen this movie tens of times and have never got bored of it.\n\nStory: An elite counter-terrorist unit of India is on a hunt for an international terrorist planning a series of attacks in India and in the process of doing that, they hit a goldmine (metaphorically) which changes everything they had planned for. While the time is running out, they don't just have to make sure they succeed in their mission but also maintain the covertness of their operation. Perfect recipe for a high adrenaline thriller. The story is written by Neeraj Pandey himself and full marks to him for that. Besides the plot, the screenplay is brilliant with no nonsense melodrama. Even though the movie is on patriotism and counter-terrorist activities, the violence is minimum and the writer focused a lot on planning and execution of the operation without making any noise about it - which is the heart of covert operations.\n\nActing: The casting of the movie was near perfect. Akshay Kumar gave one of his best performances. His voice is perfectly suited for the role and he gave justice to that with his amazing dialog delivery. In addition, other actors like Danny Danzongpa, Anupam Kher, Kay Kay Menon were brilliant as usual. Kay Kay Menon, playing a role of a key terrorist who is brilliant with funds mobilization and planning, should have received a lengthier role, given his acting talent - largely due to his expressions and dialog delivery. I have always loved him watching on screen and he impresses a lot in Baby as well. Rana Daggubati had a crisp role to play and he did it with great panache. Tapsee Pannu's cameo was amazing and very inspiring. Rasheed Naz, with his role quite close to the international terrorist Hafeez Sayeed, did well enough.\n\nDirection: Neeraj Pandey had built a reputation from his earlier movies and he didn't disappoint at all in \"Baby\" as well. It's very difficult to make 2.5hrs+ thriller but Neeraj Pandey makes it like a BOSS. Crisp dialogs, well-written script, brilliantly conceptualized sequences, moderated action and tremendous focus on keeping the story in motion worked well for Neeraj Pandey - something which is the signature of his movies. While Akshay Kumar is the central character, he made sure all other characters receive its due justice too.\n\nOverall: Overall, the movie is one of the MUST WATCH movies if you are interested in high-quality thrillers. You must also watch \"Special 26\" and \"A Wednesday\" from Neeraj Pandey."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "arumallasundeepreddy",
        "review_rating": "10",
        "review_title": "Gripping thriller",
        "review_detailed_main": "Baby\" is a gripping action thriller starring Akshay Kumar. The film follows an elite team tasked with preventing terrorist attacks. With intense performances, well-executed action sequences, and a suspenseful plot, \"Baby\" keeps the audience engaged. The film received positive reviews for its realistic portrayal of counter-terrorism efforts and Akshay Kumar's commendable performance. If you enjoy action-packed dramas with a strong storyline, \"Baby\" is worth a watch.\n\nThe storyline keeps audiences on the edge of their seats, successfully blending suspense and patriotism. While some critics note a slightly slow start, the overall consensus is positive, making \"Baby\" a must-watch for fans of the action genre and those who appreciate a well-crafted thriller."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "gangutm",
        "review_rating": "10",
        "review_title": "One of the best movie in recent times",
        "review_detailed_main": "Time, I was so excited about a movie was when I saw Ugly! Talking about Neeraj Pandey, I'm among those very people who didn't find the climax of Special Chabbees exciting. In fact, I was able to guess the finale long before it started. And so for me, the finale was the weakest link in Special Chhabees. For A Wednesday, it was a great thriller from start till end.\n\nNow coming to the Baby! The first half started with bang and I was really looking forward to the movie. However, right about the interval, I was thinking that it wasn't all that great! And that's where I was wrong. With the entry of Taapsee Pannu, started a race against time. And here's where Neeraj Pandey really really blew my mind. That's how a thriller is made. Stupid movies like Race 2 ought to learn from this movie. The second half kept me at the edge of my seat that seldom any Hindi movie does.\n\nKudos to the Baby team for contributing such a gem to Indian Cinema. Thrillers like A Wednesday, Ugly, and Baby are a rare treat to movie goers like me, who just can't leave their brains at home. The critics can find all the fault they want in this movie, but for me it's one of Neeraj's best.\n\nAkshay did a very good job. He is a versatile actor who should do more sensible movies instead of movies like Once Upon A Time In Mumbai - 2. But I'm all praise for Tapsee Pannu. Unlike every Telugu movie, where the heroine is a Bimbo, Tapsee showed her acting prowess with this movie. Anupam Kher was excellent as always. Not much can be said about Rana Daggubati as his role wasn't meaty enough!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vaibhavshewale-68659",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "\"At the end of the day, Snowpiercer can't decide what kind of movie it wants to be. The attention to detail in fight scenes, where every weapon, lightbulb, and slick patch of ground is accounted for, doesn't translate to an ending that seems powerful but ultimately says little of \"At the end of the day, Snowpiercer can't decide what kind of movie it wants to be. The attention to detail in fight scenes, where every weapon, lightbulb, and slick patch of ground is accounted for, doesn't translate to an ending that seems powerful but ultimately says little of substance.\".\"\"At the end of the day, Snowpiercer can't decide what kind of movie it wants to be. The attention to detail in fight scenes, where every weapon, lightbulb, and slick patch of ground is accounted for, doesn't translate to an ending that seems powerful but ultimately says little of substance.\""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "chetanbluej",
        "review_rating": "9",
        "review_title": "A quintessential of quality team work in Bollywood!!",
        "review_detailed_main": "If you are a fan of movies like Argo, 12 Angry Men, Where Eagles Dare and the like then this movie would certainly entertain you and even make feel proud, as others rightly pointed out, of the quality of editing, VFX, which was the catalyst in making the movie a Must Watch!\n\nAlthough debatable, it certainly can be considered as a milestone in Bollywood, for that was the kind commitment the crew of the film put in which was clearly visible in very scene.\n\nI loved the fighting sequence when Tapsee confronts the middlemen. It was soooooo good! She certainly has created a brand for herself with this movie. The movie was practical in many terms, in aspects ranging from script to background music."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "chetaninbox-668-54666",
        "review_rating": "10",
        "review_title": "It's a classic, a masterpiece",
        "review_detailed_main": "An epic classic thriller which deserves to be in your must watch list. After watching all i can say it is perfect, flawless, superb acting by Akshay Kumar and other actors. I watched the movie by today and I was speechless after watching it was not what i expected. The movie duration is 160min but at last you will feel this movie should not stop. Akshay lives the character pitch perfect and is absolutely perfect, and so are all other actors including, however a special mention for Taapsee Pannu, who shines in a short cameo. The background score is so profound that it automatically raises your heart-beat. At some scenes you cant resist yourself to clap and on some to fix you eyeballs so deeply just out of curiosity(what's going to happen in the next scene). No unnecessary creepy Bollywood songs are there. So, you will witness a true action/suspense/thrilling cinema. So don't miss out, must watch in theater only. This BABY is mature enough to be called an instant classic."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "singhal-52253",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "The first half started with bang and I was really looking forward to the movie. However, right about the interval, I was thinking that it wasn't all that great! And that's where I was wrong. With the entry of Taapsee Pannu, started a race against time. And here's where Neeraj Pandey really really blew my mind. That's how a thriller is made. Stupid movies like Race 2 ought to learn from this movie. The second half kept me at the edge of my seat that seldom any Hindi movie does.\n\nKudos to the Baby team for contributing such a gem to Indian Cinema. Thrillers like A Wednesday, Ugly, and Baby are a rare treat to movie goers like me, who just can't leave their brains at home. The critics can find all the fault they want in this movie, but for me it's one of Neeraj's best.\n\nAkshay did a very good job. He is a versatile actor who should do more sensible movies instead of movies like Once Upon A Time In Mumbai - 2. But I'm all praise for Tapsee Pannu. Unlike every Telugu movie, where the heroine is a Bimbo, Tapsee showed her acting prowess with this movie. Anupam Kher was excellent as always. Not much can be said about Rana Daggubati as his role wasn't meaty enough!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "mukesh-77729",
        "review_rating": "10",
        "review_title": "Very good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "nsanghvi13",
        "review_rating": "10",
        "review_title": "One of the best Bollywood production. Excellent execution",
        "review_detailed_main": "Probably my second review of all time and my first for a Hindi movie. I am compelled to write this review and contribute to what I think is rightful promotion for a masterpiece. This is an attempt, however minuscule, to encourage such brilliant movies from an industry otherwise known to produce drivel for mass consumption.\n\nBaby is yet another thought provoking, engaging, and very entertaining move from Neeraj Pandey. With movies like Special 26 and Wednesday it was always going to be a very tough act to follow. But Baby surpasses all expectations and more. The plot of the movie is not novel but the attention to detail, execution of the story, and the brilliant acting is what places this move in a league of its own. The topics are myriad yet very diligently researched and more importantly, so realistically portrayed, void of the usual Bollywood hyperbole, that it keeps you engaged throughout.\n\nThe acting is Oscaresque. Akshay Kumar is solid but the other characters are creatively developed such that at different points they are allowed to assert their mark on various scenes. Herein shines Neeraj's brilliance as he masterfully exploits acting prowess of the various cast members to carry the scenes. I would mention Anupam Kher and Rashid Naz for stand-out performances. The first scene of Rashid, where minions are cleaning his feet before he walks through a dark hall to give a fiery and divisive speech in front of hundreds is chilling to the bone. This one particular scene reminded me of the scary \"calm before the storm\" kind of set-ups shown in Inglorious Basterds when Col. Hans Landa (Waltz) calmly has a glass of milk before slaughtering the Jewish family beneath his feet. These scenes, the acting, the detailed plot, and an interesting twist a bit more than half way through make this movie an absolute must watch riveting experience."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "vsagarkvn",
        "review_rating": "9",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "oguz_akdogan20",
        "review_rating": "8",
        "review_title": "Perfect Movie",
        "review_detailed_main": "Akshay Kumar Holiday encountered with the fight against terrorism, which he portrays a protagonist in the film . In fact, this film continues Even in nature, but a completely different scenario would be a completely different staff and very different places, except one person would watch Akshay Kumar . Akshay Kumar comedy films so when you look at the overall You can not love, but drama, thriller, action type movies I would say yes, I would say that you should not miss it . But this film is very strange from another world . If you follow Most of what I'll join you as well, but who can say that monitoring Bollywood itself that exceeds every day and our cinema now and get rid of romantic comedy films like this and you need to do this take what I can announce my voice . Finally Akshay Kumar to these roles very suits and such movies as it gives the right tactics least India..."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "aashutosh-vyas",
        "review_rating": "9",
        "review_title": "Baby is Baap of all thrillers in Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "raviyash007",
        "review_rating": "10",
        "review_title": "Very good movie, dedicated to the Indian Intelligence Agencies",
        "review_detailed_main": "Very good movie, dedicated to the Indian Intelligence Agencies. These kind of movies are required to make us identify more as Indian rather than on the religious tag.The message is well delivered. Apart from this the movie depicts the tough and the sacrificing life of our RAW/IB agents.Also the characters in the movie are more realistic. Akshay Kumar's acting is awesome as usual.The plot could have been bit different towards the end,there could have been more suspense. Salute the Director Neeraj Pandey & entire team for a nationalist film.I would like to see more of these kind of movies.My rating for this movies in 9. Thank you."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "funkyguru-905-164995",
        "review_rating": "9",
        "review_title": "Movie So True to reality",
        "review_detailed_main": "Besides the fact of a movie that is so well made, I must say that the story line, the plot, the theme, the idea is no true, based on real life.\n\nCan't and won't indulge in details and yet I can acknowledge the fact that this movie has, for the first time, brought in light the work of those silent soldiers who defend the biggest, the greatest democracy of this world.\n\nI would have given 10/10 and won't for the fact there were a couple of songs that were made part of it. I do understand that it is Hindi movie and without songs they don't qualify to be 'Hindi/Indian' movie. Then again, this wasn't the movie to qualify as one.\n\nExcellent direction, acting, editing, sound ... the list is long and elaborate.\n\nI suggest this is a must watch Indian thriller, coming of an age."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "Rami1000",
        "review_rating": "8",
        "review_title": "My Short Review of Baby. Really enjoyed it",
        "review_detailed_main": "Finally I watched Baby and here is my short review of the film.\n\nBaby movie was brilliant. The cast has done a superb job in portraying their characters. Dany and Anupam 's performance were strong, while Tapseewas' was great in her 10 minute role. But it is Akshay that really makes the film terrifying. He is believably as Ajay and great. akki's performance is enough reason to see this film... The action is also done very well, which is nice. In addition, the cinematography and the sets are good, making the imagery really nice and the locations believable. However, there are two problems with the film.\n\nFirst, the script is predictable but Neeraj's direction is what made me sit it on the tip of my chair almost all the time. bravo Neeraj.He is the real star of the film, Neeraj is one of the best Thriller directors working behind the camera today.\n\nThe second thing is the climax, many say its the best part of the film, while I found it, its the weakest , don't get me wrong because I have seen Argo before and if you seen it then definitely you would agree with me. but overall the film is good and deserves 200 Cr,"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ahwaan_padhee",
        "review_rating": "8",
        "review_title": "BABY Review",
        "review_detailed_main": "There is something positive about Akshay Kumar.After a series of flops, he always gets a stupendous film to mouth-shut his detractors.Post the debacle of ENTERTAINMENT and a dud like SHAUKEENS, he bounces back with Neeraj Pandey's BABY,a fast-paced thriller based on a covert operation to thwart the international terrorists.Acclaimed for his previous ventures (Special 26, A Wednesday), Pandey mounts BABY on a grand scale and the results are tremendous!\n\nAkshay plays Ajay Rajput, an elite member of an undercover task force led by Firoz(Danny Denzongpa), who gets on a mission 'BABY' to nab the masterminds who plan deadly serial terror attacks in our nation.So we have a Fazlur Rahman like figure , known as Maulana Rehman(Abdul Rasheed Naaz) a fanatical leader whose devious and controversial speeches can boil the blood of any Indian and few of his tentacles anchored by the menacing Bilal Khan(Kay Kay).\n\nAmply borrowing the plot from the Hollywood drama, Zero Dark Thirty and a finale akin to Argo, Pandey keeps us riveted through the deadly chases and some nail-biting moments, while the narrative refreshingly switches its lanes from Kathmandu to Istanbul to Saudi Arabia.It takes him long to establish the slickness, but he compensates with some sharply written dialogues and subtle humor. His astute technical acumen comes to the fore with the splendid aerial shots and some of the rare stunt sequences choreographed by Hollywood action director Cyril Raffaeli breathe authenticity.\n\nDevoid of songs, Baby camouflages into an espionage thriller post interval, and the last minutes do ring a bell of nostalgia with Pandey's earlier film Special 26, where there is an underlying palpable tension and 'what-happens-next' suspense running in your mind.Akshay Kumar is super-terrific and perfectly looks the part of an unpredictable yet committed officer , who remains unfazed with the moral dilemmas as well as phone calls from his doting wife(Madhurima Tuli).Cast in a cameo,Taapsee Pannu startles us with her 'kung-fu' chops, while Rana Daggubati complements as the 'Hulk' to the 'Tarzan' Akshay.Veterans like Danny and Anupam Kher perform splendidly and I was particular swayed by Danny's restrained act and his two-liners with genuine insights, which lent gravitas to his role.\n\nWith a pertinently relevant release timing(post the terror attacks in Peshawar), BABY's subject celebrates the unsung heroes of our country who not only care less about dying for the country, but as pointed out by Danny's character, they thrive in the adamancy to live for the country with full passion. At the same time, the solution insinuates subversiveness towards the system or going the 'Mossad' way. Nevertheless, I had my gala share of popcorn-coke thrills!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sourav-63975",
        "review_rating": "10",
        "review_title": "Charismatic by Akshay",
        "review_detailed_main": "\"Baby\" is widely regarded as one of the more realistic and well-executed films in the Indian espionage genre. Its strengths lie in its gripping narrative, strong performances, and a commitment to portraying counter-terrorism operations authentically. Neeraj Pandey's directorial style, coupled with Akshay Kumar's portrayal of a dedicated officer, makes \"Baby\" a notable addition to the action thriller genre in Bollywood. If you enjoy espionage films with a focus on realism, \"Baby\" is likely to be an engaging watch. While the film maintains suspense, some viewers may find certain plot developments predictable for a thriller in the espionage genre."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "aakashkedia2009",
        "review_rating": "8",
        "review_title": "A Multiplex Movie it is!!",
        "review_detailed_main": "Movie is a good time pass for males between age 14 to 45 and should belong to hindu religion. Some comedy punches, lots of action, not a single traditional story but a collage of sequences which result in a decent picture(zing!!).\n\nHistory repeats itself and thats what is happening, with Akshay Kumar's movie portfolio. He started with romance, slipped to action than comedy than action than comedy and now in action again. But this movie is not only about akshay kumars performance but is also about other stuff. This movie is about a script writer's failure and a screenplay writer's success. This movie is about a directors success while cameraman's failure. Editing is good enough so is the costume design. Not too realistic though but good enough. Cinematography is terrible. Direction is pretty decent. Looked like first they were in tight budget than midway of the project producer decided to go full throttle(you can see the difference in set design and costume selection). The writers were not worried about being politically correct. Chases could be made more interesting.\n\nI tasted argo, casino royale, and some other movie too."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "yatinspanwar",
        "review_rating": "10",
        "review_title": "What a movie..",
        "review_detailed_main": "Thats a bloody class movie from bollywood... That's what we want... A damn good movie... Salute to Neeraj Pandey... Salute to baby... Do watch.. If this would have been a Hollywood movie.. Oscars would have been blown...\n\nNeeraj pandey.. Where were you?.. We have made thousands of love stories and now we want a real class of movies... Excellent work Neeraj... I was expecting the airport escape to be like argo :p bcz bollywood has a reputation to copy... But this movie is a class apart.. None of the scene has been copied from any of the Hollywood movie.. Keep going and never stop making such fantastic movies... Salute\n\nR.I.P to all old love stories..."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "coolbuddy-bibin",
        "review_rating": "10",
        "review_title": "Blown \"BABY\" Blown",
        "review_detailed_main": "Cheeky yet aesthetic, Baby is one of those fast paced action thriller which will blow your mind bit by bit. Terrific storyline combined with some power packed by Akshay Kumar, Danny Denzongpa this movie is a show stopper of the year 2015.\n\nThe movie will also give an orgasm to your eyeballs with the scenic cinematography zipping between India, Nepal, Turkey and the Middle East, and its performances excellent. Akshay Kumar is terrific as Ajay whose core of steel you can almost feel. Akshay presents top- rung action - you practically hear opponents' bones breaking under his stabbing kicks.\n\nBalancing characters, conspiracies and cities, director Neeraj Pandey admirably keeps Baby rich, yet tight, researched, non- sentimental and steely-eyed. Neeraj's craft has grown - he's taken trademark touches from films like Special 26 and A Wednesday, setting them here on a grand scale, with a breath-taking climax.\n\nAll an all Baby is Bollywood's and Akshay's most grown-up thriller and this Baby's day out is deadly good fun!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "saha-aritra-no1",
        "review_rating": "10",
        "review_title": "Finest Indian movie ever made !! A must watch ..",
        "review_detailed_main": "BABY is one of the finest movies ever made in India. Simply excellent. Rarely you come across an Indian movie that doesn't hit a single false note. BABY is one such film. Writer-Director Neeraj Pandey has made a brilliant film that is not only technically at par with the best in the world, but it's also a dispassionate non-judgmental take on terrorism that's completely devoid of jingoism and is extremely gripping. Full marks to Producer Bhushan Kumar for believing in such a landmark film, backed by exceptional marketing especially when it's devoid of songs. The narrative of BABY flows like a well-made Hollywood film. Actors filter in only where required and they're not repeated just because it makes a commercial sense from a typical Bollywood perspective. If the film was starred by any of the Khan's, it would have smashed all the Box Office records !!! Just go and watch it ."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "samyakrout-65994",
        "review_rating": "9",
        "review_title": "This js what a serious spy thriller movie",
        "review_detailed_main": "Yes movie is not perfect but what a story, what an act by all including cameos.\n\nBaby proved that Indian makers if wished to can make more realistic spy thriller movies. Hope we see more of this and less of Stupid Rohit's cop universe and recently over rated YRF Spy Universe movies which have very little to offer.\n\nWhy are the makers not making these kind kf movies where the opponent or the villain is as tough and strong like Kay Kay Menon and it need brain to foil the plans. Best part was the integration of Danzeopa who played the role so effectively that it looked very very convincing.\n\nI just love this movie."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "ankitcom",
        "review_rating": "9",
        "review_title": "It was a wonderfully directed thriller that will literally show what \"on the edge of the seat\" means",
        "review_detailed_main": "As soon as the movie starts, it gives a feel of a sensible thriller without any unnecessary commercial touch. First half is a little build up and comparatively boring but the second half sets the pace perfectly and justifies all the actions that director wanted to show. There were no dramatic scenes to create needless emotions. Dialogues were very discreet and action scenes looked very realistic. Best part was the inclusion of absolutely correct amount of perfectly suited humor. Movie is lengthy but so detailed and thrilling that you'll not want it to end at all. It keeps you at the edge constantly for a very long time.\n\nAkshay Kumar did almost a perfect job making us think why he doesn't concentrate on only these type of roles. At each instance, he was stupendously delivering what exactly was required. Other actors were just above average but supported Akshay amazingly.\n\nNeeraj Pandey's direction was repetitive but repeating the feel of his earlier flicks like Wednesday and Special 26 will not bother anyone. A lot of hard work was sensed in both direction and cinematography that is really appreciative.\n\nBackground music was attempted with little success albeit it didn't matter at all.\n\nOverall it was a wonderfully directed thriller that will literally show what \"on the edge of the seat\" means."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "chandnair10",
        "review_rating": "8",
        "review_title": "Great professionally made Hollywood-class thriller",
        "review_detailed_main": "Pleasantly surprised with the quality of precision and absence of \"over the top acting\" and loud canned background music...this movie is definitely indicative of a high quality thriller, plausible plot and story line and authentic acting...Im surprised also that this movie is not as well known as it should be...a def must watch, great job Neeraj Pandey, Akshay Kumar ( not someone I usually watch), Danny Denzongpa, Anupam Kher et al. The locations, the ironic sense of humor, the unobtrusive background score, the tight editing all make it a winner. The action scenes are well done and the stars appear fit and appropriate to their roles. There's no mawkish cheap sentimentality or the usual jingoistic drumming up of \"patriotism\" either which makes it a mature approach to India's problems with terror threats."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "valmikshelar",
        "review_rating": "8",
        "review_title": "THIS IS JUST A Beginning",
        "review_detailed_main": "This is the first film I felt to write about! since I opened my account on IMDb.After Madras Cafe,D Day,Aurangzeb,Ugly,Ankho Dekhi...and many more,this is another great movie from India and WE MUST make FORCE our PEOPLE to watch such kind of films by producing more and more MEANINGFUL content. About BABY story and screenplay : story is average but screenplay is really good! Direction : you will never fill that scene is going wrong or acting is looking fake,so direction is good too! Cinematography : It is said that cinematographer is the Right hand for the director on the set (Roger Deakins said that) of the film.And here Sudip Chatterji proves that! Each and every scene is spectacular. on whole movie was really good and something different.And we will have to keep produce such films,because if don't produce more n more number of such films then we will gradually handover our market of films to Hollywood films,Because peoples choice is changing rapidly! and THIS IS JUST A BEGING!"
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "anilverma1010",
        "review_rating": "10",
        "review_title": "First Bollywood movie that matches - A+ Grade Hollywood movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "pats-78165",
        "review_rating": "10",
        "review_title": "Baby 😍 amazing",
        "review_detailed_main": "Its rare, in its extremity, for Bollywood to make a masterpiece. But once in a while they do and this year Neeraj Pandey and Akshya Kumar gave a classic like \"BABY\". Every scene, background score,cinematography and almost everything is done to perfection. And that second half will glue you to your seat! Such a thrill, such a tension,the effort put by director is so brilliant that you will feel like cheering up. None of the characters are wasted. Everyone has a important part to play in. The acting is superb. Everyone, and I mean literally everyone has acted so well amazing movie #masterpiece .."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "shuvosripatra",
        "review_rating": "9",
        "review_title": "Awesome movie",
        "review_detailed_main": "A must watch movie for all Indians. No nonsense straight forward movie. Its good to see Akshay Kumar back in action. Anupam Kher good as always. Awesome acting by K K Menon. Every thing in the movie is good but the faking of the kissing scene can easily be caught. In the day to day commercial movies that are released most of the time in Hindi this is certainly a changeover. After Holiday its good to see Akshay Kumar doing such bold movies, and giving a strong message. Awesome movie I recommend it to be watched by everyone. Every the elderly ones of the family enjoyed the movie a lot. Its has been a long time after Wednesday a great movie with a bold act can be seen."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "saket992",
        "review_rating": "8",
        "review_title": "Awesome direction and acting",
        "review_detailed_main": "Its a genius work by Neeraj Panday. Story and screenplay is just awesome and keep us engaged in entire movie. Action sequence done by Akshay Kumar and Tapsee are very original and even every bit of movie will seem to be real events though they are imaginary creation. Romance and Comedy efficiently supported by dialogs.Those dialogs will convey all feelings in small time.Movie is shot in different locations and present real situations and happenings of events in India after Taj terrorist attacks and how Indian intelligence create a small group named as baby to tackle such attacks. So,Its a one its kind movie and must watch.."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "rahulbnk30",
        "review_rating": "10",
        "review_title": "One of the Best of Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "TheFirstExecutioner",
        "review_rating": "9",
        "review_title": "An Excellent Bollywood Thriller",
        "review_detailed_main": "Baby is directed by Neeraj Pandey and stars Akshay Kumar, Danny Denzongpa, Rana Daggubati, and Anupam Kher. All 4 of them and the rest of the cast did an amazing acting job. Akshay Kumar delivered one of the best performances of his career. It is about India's determination to end terrorism. This is a serious, action movie.\n\nThis movie was very enticing for its long 2 hour and 39 minute run time. It was very thrilling, especially at the end. I never knew what was going to happen next in this very unpredictable movie. Almost every scene surprised me. The only flaw I think this movie suffered was the romance with Akshay Kumar's character and his wife. It gave the film more emotional depth but it wasn't really necessary.\n\nOverall, I had a great time with Baby. It was a lot of fun watching it. Bollywood needs more of these types of movies. From A+ to F, Baby gets an A."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "indianature",
        "review_rating": "9",
        "review_title": "Very Slick",
        "review_detailed_main": "Out of Special 26, Holiday and Baby I would rate Baby as VERY VERY SLICK, but not the best. Whereas Special 26 is outstanding and a class movie.\n\nBaby is action packed, slickly produced and holds the interest for the most part. Everyone essayed their role very well and not surprisingly Anupam Kher was the best in my opinion, as Shukla-ji.\n\nWhat I did not like was the violence as shown in the torture scenes. There is really no need to depict more than a suggestion of violence rather than showing the act. I guess the wider audience likes it:(\n\nThe smile on the face of the local investigator as he allowed them to leave, was the best.\n\nWorth watching."
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "sesht",
        "review_rating": "",
        "review_title": "Taut mainstream thriller that takes its time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "raja-mishra7",
        "review_rating": "",
        "review_title": "High-Voltage Espionage Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3848892",
        "movie_name": "Baby",
        "movie_rating": "7.9",
        "review_username": "artikchopra",
        "review_rating": "",
        "review_title": "A exceptional movie from the Indain movie industry.",
        "review_detailed_main": ""
    }
]