[
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Dannyboi94",
        "review_rating": "2",
        "review_title": "Mindless garbage",
        "review_detailed_main": "I think everyone who watched this movie wasn't expecting anything good, but I wasn't expecting it to be this bad. The first one was garbage too, but at least it had some kind of story to drive it, this movie is basically as 2 hour music video with sex.... yes, that's all it is. The relationship between the two leads is as mindless and unrealistic as the first, and another man joins the scene, who is just as dull as the first.\n\nNothing happens in this film until roughly half way through, and if you even managed to endure the pain that is the awful dialogue, directing and acting, you then have to suffer a boring thriller-wannabe. It's a shame really, because with a good director and writer, you could have had a compelling story with good characters, but no...we get this. The main actors, (I can't even be bothered to look up their names) have little to no chemistry between them, and half of the time they are just standing there looking pretty.\n\nI understand that 20-40 something men aren't this movies target audience, but at least make it bareable for us.\n\nIf you were to take out all the music and sex, you would have a 40 minute short film. Seriously, it's that bad. So many usless scenes that add nothing. The only good thing about this movie is its cinematography, which is surprislingly very good, which is the only thing stopping this from getting a 1."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "quieria",
        "review_rating": "2",
        "review_title": "Surprisingly Bad",
        "review_detailed_main": "The 1st film wasn't a masterpiece, but it at least had a plot to follow. This \"film\"was just sex, sex, with more sex with a teaspoon of a plot line at the end. It was horrible! The only reason I continued to watch is because Massimo and Nacho are beautiful men. I never have to watch this again."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "robkup",
        "review_rating": "2",
        "review_title": "This \"movie\" is a waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "marjoriebrehl-40500",
        "review_rating": "1",
        "review_title": "One of the worst movies i've ever seen",
        "review_detailed_main": "There's probably not more than 10 lines in the script 😂😂 what the hell is that for plot??? 2h to tell a 5min story. Never thought that it could be worse than the first but they definitely proved me wrong."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nettemor-95811",
        "review_rating": "1",
        "review_title": "So dissapointed!",
        "review_detailed_main": "18 first minutes of the movie is just like a music video, no dialogue, just a lot of sex. The rest of the movie has a bunch of music mashups with little to no dialogue and a thin thin story line. I think it was an easy way out, to leave movie 1 on a huge cliff hanger, and just continue movie number 2 like that didn't happen. And if the movie makers thought fans loved the sex, they totally didn't get why. It was the context and the story that made the sex hot. You can't just have a long music mashup with soft porn and no story line or romance building up the tension. Where's the foreplay? Common!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jupitersboba",
        "review_rating": "1",
        "review_title": "What? The?... Horrible sequel!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nicksmoviereviews",
        "review_rating": "1",
        "review_title": "Makes 50 Shades of Grey look like a masterpiece",
        "review_detailed_main": "Well, here it is. The sequel to one of the most uninspired, least-sexy, and tacky movies in recent years, 365 Days. The sequel commits the cardinal sin a movie can make: not learning from its mistakes. The movie is a blatant cash-grab that hardly costs anything to make, and an excuse for actors and crew members to film in luxurious locations. Bad acting, no plot, and an absurd runtime for what it has. No wonder Netflix is losing subscribers, it has more unoriginal garbage like this."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "andrewchristianjr",
        "review_rating": "5",
        "review_title": "NOTHING BUT SX SX AND SX.",
        "review_detailed_main": "Nothing but sx sx sx and sx. The plot started 30 minutes by the end of the movie. The entire movie is a massive cringe-fest, kept skipping through needless pop music montages, the dialogues are terrible, the writing is just so bad."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lenkaweaver",
        "review_rating": "1",
        "review_title": "GOD this is BAD",
        "review_detailed_main": "I watched the first one only because it generated so much noise overall and I though that the first film was bad, but the sequel is a whole new level of BAD. I though films suppose to have some form of development and plot but here 35 minutes in and where is it... frankly the acting on both parts of the leads are worse than in the first film and one get even put off by the sex scenes...it is porn film on Netflix."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mattfrancis-03963",
        "review_rating": "1",
        "review_title": "Had enough.",
        "review_detailed_main": "Blame Italy, or Poland, or Netflix? No just blame people. Nowadays it's about a thrill, not a story meaning the movie was a cringe fest and a laughing stock. Now it's not the dialogue that was bad, the woeful unrealistic story, or the acting, what's bad is the fact people can make excuses for this throwing lot of clever cinematic views and shall we say steamy moments. A movie isn't about the thrill. It's not about filters and fancy clothes, being spoilt as a woman and loaded as a man. No actually that actually is all this is. Netflix throws this at us because of the demands to please the audience with this sort of thing. Any pathetic, girl power, snap chat fish for likes love myself type of person will adore this. As too will any unhappy coupled or bored individual. Point blank doesn't matter how disgusting the male lead is, how bad the story or dialogue, how bad the female leads acting is, it's all about what is pleasing on the eye. That's why a Netflix original cannot be trusted or half of the reviews left by these so called adults. Many of whom are probably underage by the way or only care about a good time and no doubt have everything easy. This isn't about an escape and it's not about putting yourself in the polish girls shoes, or underpants, it's about what is wrong with the every day person these days and how so long as they're enjoying their life nothing else especially not this stuff matters. Shame. A woeful woeful film."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "akimon7",
        "review_rating": "",
        "review_title": "Eye candy at best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "enockquason",
        "review_rating": "10",
        "review_title": "So bad that it's good",
        "review_detailed_main": "This movie was so bad that it was good, but come on, that was to be expected. Now I see all these reviews bashing the movie and I have to laugh.\n\nCome on, aren't we all little hypocrites? Like someone said, we all knew the first movie was bad and this had the potential to be a disaster too.\n\nIf it had been an action movie or something like that, like we wouldn't come back to it or something.\n\nBut no, we still came back knowing very well the sequel could be even worse like has happened to several movies.\n\nWe all came back for one reason and the movie did deliver it on that regard so let's just appreciate that, lol."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "shay-67903",
        "review_rating": "7",
        "review_title": "I just love how we all knew this was going to be a horrible movie yet we all wach this",
        "review_detailed_main": "Is it a good movie ?\n\nNo its horrible we all knew it going into yet yet we all watch it for the same reason\n\nand i love movies that know what they are as from the first scene this movie knows exactly what it is ..\n\nis it good story telling and acting ? No its horrible but again we knew that from the title\n\nthey dont try to make a good story a good acting level a good drama they try to give the viewers what they asked for.\n\nThis movie im sure broke all of netflix limits to what show and what not show on screen\n\nPlease dont be saints we all know why were here and the movie doesnt disapoints in that regards\n\nits still far better then 50 shades of grey nonsense.\n\nAs this one knows exactly what it is.\n\nIf you never watched the first one and just watch this to expect a good movie..lol well your in for a surprise."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "desislavasav",
        "review_rating": "1",
        "review_title": "worst movie ever made",
        "review_detailed_main": "Biggest regret of my life\n\nAfter the opening scene I thought that it couldn't get worse but somehow it did, and it kept going... I'm actually amazed they managed to create something that awful ?!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "larisalatif",
        "review_rating": "1",
        "review_title": "365 this day",
        "review_detailed_main": "Can be something worst than this?\n\nI cant believe what ive just watched Everything just everything is so terrible.. 😩😭😭😭😭 No romance no acting no talking no nothing.."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "maryrock90",
        "review_rating": "1",
        "review_title": "365 Days : Dumpster Fire 🔥",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lauraknezevic-11883",
        "review_rating": "1",
        "review_title": "Trash!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "denizsenler",
        "review_rating": "1",
        "review_title": "I can't even begin to describe how bad it is.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Johndowski33",
        "review_rating": "1",
        "review_title": "Cringe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "MagdalenaFigueroaSaavedra",
        "review_rating": "1",
        "review_title": "My Lord...",
        "review_detailed_main": "I won't say anything, except that I imagine the ''actors'' bursting into laughter while ''performing'' their ''dialogues'' reading their ''lines'' to give life to this ''interesting plot.''"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "marwillreview",
        "review_rating": "2",
        "review_title": "cringe that makes me come back for more.",
        "review_detailed_main": "These movies are my guilty pleasure. They bring nothing to the table. No plot, bad acting, cringe dialogue. Nothing makes sense, but I am invested now. I give it a 2 because, I will definitely will be coming back to watch the last movie, even when all we get is a song list that is 8 pages long, and montages that go along with it. With no character development and the main two characters doing the nasty every 10 min. Also this one was worst that the first. 2/10."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "gk-96217",
        "review_rating": "",
        "review_title": "Worst Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "devonlee",
        "review_rating": "10",
        "review_title": "Fluffy Fantasy, Not That There's Anything Wrong With That",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kaylierose",
        "review_rating": "6",
        "review_title": "weak beginning strong end",
        "review_detailed_main": "The beginning started off corny and cheesy, i was starting to get disappointed , but it got much better , strong cliff hanger ..looking forward to third , just hope the leave the cheese out next time .."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mpetrowaxx",
        "review_rating": "2",
        "review_title": "More like a music video than a film",
        "review_detailed_main": "I give this film a 2 for the beautiful men in it. That's it. Would've worked better as a perfume ad.\n\nKinda sad for the actors, they pronounce the words like robots honestly. Michele Morrone has talent I hope they notice him for a real movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "raykuanlabel-291-473410",
        "review_rating": "3",
        "review_title": "Guilty Cringe Pleasure",
        "review_detailed_main": "3 stars for the gorgeous locations, cinematography and drone shots. Otherwise, from the plot to the dialogues - it's total cringe. Except for the erotic scenes - I feel sorry for the beautiful actors the director made them look so dumb. But we all know it's gonna be bad it's so laughable. Haha."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mstrinagalanos",
        "review_rating": "1",
        "review_title": "TRASH",
        "review_detailed_main": "What a waist of time. This is not what i expected. I would of love to of seen those two in a \"honeymoon phase\" and maybe getting to know about the characters more in depth. Like seriously who the hell came up with this storyline."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lovely1249",
        "review_rating": "2",
        "review_title": "OMG that was bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "man_utd-81303",
        "review_rating": "3",
        "review_title": "+3 for visual pleasure, -7 for mental torture",
        "review_detailed_main": "Who comes up with such scripts and how do they manage to secure budget for such movies???!!\n\nHence, watch it when you are are looking for fornication and one suggestion; keep fast forwarding to moments which you are interested in. There is no story and no need to find one either."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "prolead",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "You could just go to pornhub and find better stories to do watch. This is absolutely a waste of time and garbage. The first part was at way better. It's even difficult to come up with 150 characters to post this review."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Calicodreamin",
        "review_rating": "4",
        "review_title": "So bad. But what's good is amazing.",
        "review_detailed_main": "We're all here for the same reason, right. In that department the sex delivered again and again, oh my. Now unfortunately they ruined this in the second half by trying to add a plot, for which there was no substance. How did they get away with having the same ending as the first movie?"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "fallen_shadowxx",
        "review_rating": "1",
        "review_title": "Cringe",
        "review_detailed_main": "As i tought, When you see Netflix production... you must Close TV... such a waste of time 😟\n\nI cant even realise what i was watching... Netflix should do something to improve their production or they'll support the consequences."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "albertocorral-51082",
        "review_rating": "9",
        "review_title": "Hard to stop watching!!",
        "review_detailed_main": "I don't understand the negative reviews! Hell of a twist! I though it was amazing and can't wait for part 3! No matter what you think of it, you know you will watch part 3!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "annall-01098",
        "review_rating": "7",
        "review_title": "First 365 better",
        "review_detailed_main": "I can say that I enjoyed the first movie, 365DNI, more than This Day. I understand that the Blanka. Lipinska had a hand in writing the screen play for the second movie. Maybe that was the problem. I've read two of three novels so far and thought the books were more pornographic. I was hoping that This Day would contain some of the book plot, but it didn't. In fact, This Day added things that weren't in the second novel. I can say that I was really disappointed with how Laura Beal's character was so whiny and needy. In 365DNI she was much stronger and I admired how she took over the situation of her kidnapping (Some critics compared it to Stockholm Syndrome. NOT!). Also, I hated the ending of this movie. I am waiting for the third novel and I am hoping that the writers don't take their \"artistic license\" and screw the third movie like they did the second."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jhashaily",
        "review_rating": "4",
        "review_title": "Boring😑",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ionutmanole-66304",
        "review_rating": "1",
        "review_title": "The usual abomination",
        "review_detailed_main": "Nothing to see here, just Netflix doing Netflix trash. By now, every rational person should know that watching a Netflix original movie is truly wasting his time."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "maria541",
        "review_rating": "2",
        "review_title": "I'm sorry.. what😂",
        "review_detailed_main": "I just don't know what to say!\n\nI saw someone comment about this movie pretty much being a two hour long music video and that's exactly what it is LMAO\n\nI can see why majority of the ratings are 1/10. The other half is mostly people rating it 10/10 in hopes of boosting the movies on IMDB (but its still so low)\n\nI caught myself wondering what the plot was throughout the whole film, and in WHAT WORLD would this actually happen???\n\nI'm sorry but I would never watch again,\n\nSticking with 2/10 because the cinematography is the only good thing about the movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "Actually two years",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Zi_Reviews_Movies",
        "review_rating": "2",
        "review_title": "Netflix knows you'd watch it.",
        "review_detailed_main": "We all watched it for the same reason, and yet, it was disappointing. I can't believe I'm typing this, but the first one was better. Compared to this. As a movie, NO.\n\nThere's no plot, the dialogues are dull, the characters are lost, and the acting missing. If I type any more, this would turn into a rant.\n\nAnyway, you don't need a review; this is a movie you'll either wait to watch or ignore. For the folks in the former, I know I'll see you all when the next part releases."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "helengracebirdsall",
        "review_rating": "2",
        "review_title": "Abysmal",
        "review_detailed_main": "I can't believe I even made it through the entire movie. The first one wasn't that bad ,but this. I don't know what to say. TERRIBLE. Absolutely Abysmal..."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "caitcarr-29316",
        "review_rating": "2",
        "review_title": "Let's be honest - we aren't here for the story line",
        "review_detailed_main": "Was this movie good? No. Was the story line easy to follow? No. Was the acting good? No.\n\nDoes this matter? Also no. We aren't here to watch it for any of those things. Watch it for what it is meant to be: a corny, sex filled romp with oddly placed party music and a horrendous script."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "UniqueObsession",
        "review_rating": "1",
        "review_title": "It's so terrible that became funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mjpgowler",
        "review_rating": "10",
        "review_title": "Just excellent",
        "review_detailed_main": "Hot, sexy, fun. Everything I wanted it to be. I was just hot and sweaty throughout. Nacho, what a dreamboat. Would love to dip a potato chip in him.\n\nLoved it,\n\nxxx."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nohdsambo",
        "review_rating": "7",
        "review_title": "Last scene",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "RBree",
        "review_rating": "2",
        "review_title": "Rushed and lackluster.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "watf-71144",
        "review_rating": "1",
        "review_title": "Worse than the first",
        "review_detailed_main": "This film is worse than the first and that was awful.\n\nJust a series of sterile choreographed sx scenes.\n\nIf anyone who watches this film expecting a good plot and , fleshed out t characters, with well thought out motivations than more fool you and I have some land on Jupiter that you can buy!!\n\nI am not sure who Netflix think this is aimed at but honestly this is the type of programming we can all do without.\n\nThere are programmes where you think the fee was worth the fee alone. This is just the opposite and I expect money back!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "naymyothein",
        "review_rating": "1",
        "review_title": "Better watch p**n",
        "review_detailed_main": "Honestly no plot ; no interesting things , just nude scenes s*x scenes.. I wonder how dare this compares with 50 shades.. If u want s* scenes ; plz go watch p**n."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "erinbateman-35746",
        "review_rating": "1",
        "review_title": "Hardly any dialogue, just 2 hours of cringe montages",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kreptuz",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "Compare this to the first movie and this one will end up like a pile of molded banana peels, what the actual fridge. What a massivly bad music video!!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "baenenaa",
        "review_rating": "4",
        "review_title": "My eagerness was so disappointed",
        "review_detailed_main": "I was so pumped to see this after the loving the first part, but boy! Was i disappointed!?!\n\nWas a stretch with a lot of potholes, too many ost's, aimless sex scenes, lacked a story. You can't help but wonder what the hell the writers were doing for 2yrs!\n\nA letdown really."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kelly-94007",
        "review_rating": "1",
        "review_title": "Wow. It was BAD",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "alidenver",
        "review_rating": "1",
        "review_title": "Disgusting movie, once again",
        "review_detailed_main": "Again, Netflix doesn't disappoint to shove movies likes this on their platu, movies without a story, without any real goal. Other than showing fake lifes, fake love. Using their own platform to promote things that are not real. You know you have the power to brainwash people into believing things that are not true."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "angel_teen_18",
        "review_rating": "10",
        "review_title": "It's erotic romance, not sophistication",
        "review_detailed_main": "I think people are expecting the wrong kind of movie when they watch this... it is an erotic romance novel made into a movie. It's supposed to be hot sex scene after hot sex scene... and the story line and development was just fine for an erotic romance movie. Not everything can be pride and prejudice, sometimes we need a little 50 shades. Mmmmm perfect movie for a late night."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "guipastura",
        "review_rating": "",
        "review_title": "0/10, there should be more sex!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "zinjo00-587-975183",
        "review_rating": "6",
        "review_title": "Funny to see Puritans try to review this film",
        "review_detailed_main": "I find it amusing to read the reviews of American puritans expecting this film to be some sort of masterpiece of cinema. If you saw the first film you knew exactly what to expect. It is an erotic film, period! Expecting more and worse yet, reviewing it as such, is ridiculous.\n\nAs erotic films go, it is slick and visually stunning compared to its American cousins. The story is mostly predictable, yet there are surprises. The production values and the surprises set it apart from the typical erotic film. The intimate performances are pretty hot and the simulated sex scenes are convincing to any viewer.\n\nI will say as polished as it is, there are moments where the performances are a bit stiff or forced, but overall, a very well done film that could easily be appealing to couples. Exotic European locales, the dangers of mafia life, etc... set up a decent experience. For those who are looking for Shakespear, see a play, this is not for you.\n\nI enjoyed it for what it was and had no preconceived expectations to ruin the experience. I wouldn't say it was plot dense or dialogue rich, but it played to its strengths. That being the on screen chemistry between Anna Maria and Michele. It worked better than others in the same genre, where a poor story was mixed with terrible dialogue and shoe horned in simulated sex scenes between actors with little to no chemistry. If one were to remove the steamy sex scenes and panoramic vistas, it would likely be a 30 - 40 minute short about competing mafia families.\n\nI recommend checking it out if you enjoy erotic films. The staging and erotic performances are remarkable."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "terrykennethbarber",
        "review_rating": "4",
        "review_title": "Awful, but beautiful.",
        "review_detailed_main": "Awful story, Awful acting. Beautiful shots, Beautiful scenery, Beautiful men, Beautiful soundtrack.\n\nI mean, the movie is crap...but its so beautiful you can't stop watching it."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "krisztinaobrien",
        "review_rating": "2",
        "review_title": "Not even a good soundtrack can save this",
        "review_detailed_main": "This is bad... i mean really bad, not even too much sex in this so the dreadful plot just ever more so obvious. I suppose to write more on this but i simply cant, there is nowhere to go, the whole movie feels like a bad Mediterranean video clip, fast cars sunset expensive villas and 2 more characters (beside the next guy)i don't think we have any idea of, their names anyone?"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "radinagrozeva",
        "review_rating": "4",
        "review_title": "If you have some time to waist you can watch it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "rainoncharli",
        "review_rating": "1",
        "review_title": "worst movie ive ever seen",
        "review_detailed_main": "In all honestly i didn't hate the first movie, it was one of those movies that are so bad its good, and i was fairly entertained, but the second movie... wow. Disappointment. I don't think ive ever seen a worse movie. The story-line makes 0 sense, there is no solid plot, and the amount of montage scenes and dialogue that makes zero sense.. I'm usely not picky with movies at all and try my best to enjoy every movie knowing it had effort put in it, but this by far is the worst movie ever to exist."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "bluepink",
        "review_rating": "2",
        "review_title": "The storyline starts 30 mins in...",
        "review_detailed_main": "...but doesn't really get going until 40 mins in. The beginning part of this movie consists of filler scenes with a loud soundtrack on top.\n\nPros + Amazing scenery + I like the soundtrack (abeit played too often)\n\nCons\nTakes too long for the storyline to kick in\nStoryline so basic & unrealistic to the point it's comedic.\n\n\n\n\nMichele Morrone (Massimo) is a good actor. I'd like to see him in something else with a decent storyline."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tkdlifemagazine",
        "review_rating": "4",
        "review_title": "Not A Good movie",
        "review_detailed_main": "Make no mistake this is soft core porn disguised as a sequel to a \"B \" movie. The controversial first one was better. The characters are beautiful. The sex is fun. The music abundant. It's ok so long as you have reasonable expectations."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "fdgvdmqa",
        "review_rating": "1",
        "review_title": "What did i just watch?",
        "review_detailed_main": "This was basically a long music video clip. Non existing storyline, zero dialogue. Oh boy was this bad. Smh. I was really excited for this, to watch the movie develop into something better since the budget probably increased since the first one was such a hit but this is just a huge overall mess.\n\nSkip unless you're bored and have time to waste."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "moniliska-ml",
        "review_rating": "4",
        "review_title": "First hour is about nothing so you can skip it.",
        "review_detailed_main": "I was looking forward to the second part. To be honest the first hour has no story. It's all naked and it would be ok but I was so bored waiting for something to happen. The story was weak. Last 40 minutes something happened but i feel like it should have started earlier. Michele us getting better as an actor definitely. She still has this \" I'm trying too hard \" accent."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "iheartgiraffes",
        "review_rating": "10",
        "review_title": "This movie is garbage I loved it",
        "review_detailed_main": "If they were trying to make a bad film, they did a remarkable job. 10/10. I had high expectations for how trash it was going to be and they went leaps and bounds beyond what I anticipated. Phenomenal job. Looking forward to the sequel."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Mimzzzz",
        "review_rating": "",
        "review_title": "What a low rates haha!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mandaj-02774",
        "review_rating": "6",
        "review_title": "YET AGAIN they leave us with no answers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mayafosdick",
        "review_rating": "2",
        "review_title": "I'm so disappointed....",
        "review_detailed_main": "I think we ALL knew it wasn't going to be as good as the first one.. but the story line... no. The ending... meh. Will there be another one? I have no idea.. it kinda ended like one but not really. I just expected more i guess from the end of the last one and then having the new one start with how the last one ended. It was just kinda weird lol."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Hannankillick",
        "review_rating": "1",
        "review_title": "WHAT A LOAD OF RUBBISH",
        "review_detailed_main": "I have don't think I've ever seen such a load of rubbish, I have no idea what the story line is, let's me honest there is no story line, the acting is terrible and it's like 10 films in one??? I am still no wiser as to what has happened, at least the first film had a story line, this is just a JOKE."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "claudettehasse",
        "review_rating": "1",
        "review_title": "It delivered but......... COME ON",
        "review_detailed_main": "The movie delivered what we were expecting tons of \"hot\" scenes and .... well basically just that.\n\nThe first movie was bad, but not as bad as this one. I mean they could've put a little bit more effort. The story was not coherent, dialogues were lame and didn't make sense like 90% of the time. It felt like the writers were told: Look, we have designed these sex scenes, now you need to fill the gaps, so it's not a 1.5hrs of sex.\n\nPhotography, location and soundtrack are the only good things about this movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "vnjzffyx",
        "review_rating": "1",
        "review_title": "What the absolute heck was that",
        "review_detailed_main": "I am honestly so confused. The first film may have had terrible acting, but at least there was a plot. It also ended with a cliff hanger being that Laura disappeared into a tunnel so we're all super keen to find out what happened to her in the sequel right? WRONG. The second film completely deviated from the cliff hanger, jumped straight into a wedding and doesn't even follow up on what happened? There were only a few comments throughout the film indicating \"something happened\" but no elaboration of what. Then almost an hour of NO PLOT whatsoever, literally just sex scenes and barely any communication. They're supposed to be in love but their behaviours towards another literally right after making \"love\" is so conflicted. Then BAM all of a sudden there's a new guy, barely any context around what's going on, and then we're near the end of the film and there's a scene that leads to several possible deaths, but the scene was SOOOO rushed that it just didn't even make sense. What the actual hell did I just waste two hours on. Sooooo angry that this was the follow up from the first film. It was so messy, really important scenes were completely rushed, and the English was so terrible. Surely they had the budget for a translator to help them with their English ffs. Disappointing!!!!!!!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nicho-16284",
        "review_rating": "1",
        "review_title": "Was there even a plot?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "s_dee",
        "review_rating": "2",
        "review_title": "Very disappointed",
        "review_detailed_main": "Was super excited about this but have been left disappointed!!!!\n\nFirst hour had no story whatsoever, got a bit interesting then got boring again!\n\nDidn't elaborate on what happened in the tunnel when she \"died\".\n\nHow did she loose the baby?\n\nDeffo won't watch again!\n\nUtterly disappointed!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "feelreallove-921-845971",
        "review_rating": "1",
        "review_title": "Soft Core P*rn",
        "review_detailed_main": "This is hilarious! Slo-mo teamed with a soundtrack to get you in the mood, exotic locations and beautiful people ...and somewhere in it there's a story that you kinda forget about after the 5 to 10 minutes of all of the above. Other than having beautiful things to look at there's not much more to it other than softcore p*rn. I'm no prude but these are very cheap thrills."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "marinavelcu",
        "review_rating": "1",
        "review_title": "If you thought 50 Shades was bad, get ready for this one",
        "review_detailed_main": "This is probably one of the worst wannabe 'erotic' movies made so far. Besides the fact that no one can act, but we already knew that from the first movie, the total screentime probably contains less than 20 minutes of dialogue. The rest is composed of cringe p*rn scenes, aerial shots overlayed with music. If you're debating whether to watch it or not, go watch some commercials instead, your time will be far better spent."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "RachelMarieSmith",
        "review_rating": "10",
        "review_title": "Delightful soft core porn",
        "review_detailed_main": "This is an erotica book series. You're watching erotica. Rate it as such. Great and moves the plot enough. Don't hate. Watch for what it was intended to be."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "yvonne-west",
        "review_rating": "6",
        "review_title": "Only makes sense with the entirety of the series.",
        "review_detailed_main": "This movie only makes sense overall once you've read the books. I don't quite understand why they made some of the changes they did with the overall plot, why make Laura pregnant at the wrong time? Totally kills Massimos character drive at all for book/movie 3.\n\nTook out all the character driven plot and left with lots of breathy longing glances. Makes a weird movie but having rewatched it after reading the third book I Can sort of see where they are headed and some of the setup. Watchable, but hey aren't we just here for the Sx anyways??"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "chmuellerwork",
        "review_rating": "1",
        "review_title": "I cannot believe my eyes and ears",
        "review_detailed_main": "I couldn't finish part 1. Part 2 I couldn't handle longer than 15 minutes. It's just sex all the time paired with non existing dialogues and some expensive cars and fancy places. Really the opposite of what we need these days but more of what seems to sell well. I couldn't watch the guy not being able to create an intelligent sentence but licking half her face every few minutes.\n\nPeople, we should be offended by such releases."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Osamathanara",
        "review_rating": "1",
        "review_title": "Objectively the worst piece of media I've ever had the misfortune of consuming",
        "review_detailed_main": "Seriously don't know where to begin with this. I literally just made an IMDb account just to write this review. The plot is non-existent. The dialogue is so bad it's not even funny, there's a million different songs that play throughout the whole movie that make no sense if you consider the \"plot\". The whole story has 0 flow and it's pretty much porn without showing anything too explicit. The ending was abysmal and I'm sure watching a 2 hour porn compilation would be a better way to waste the 2 hours I wasted watching this giant middle finger to the movie industry. Up until now I thought the live action Slenderman movie was the worst film I've ever seen but at least that movie was funny because of how bad it was. Save your time and go watch paint dry for 1 hour and 50 minutes."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mayaro-25415",
        "review_rating": "1",
        "review_title": "Nothingness!!!",
        "review_detailed_main": "I am a \"fan\" of bad movies. Even if it s unwatchable, I am stubborn and waste my time till the end. With this one I had to stop after 25 minutes. It thrown me literally on the floor. IT was all too much. It 's a huge bounch of nothingness. Attractive people that miserably try to act. No plot, no lines, no story to follow. Pretty cars and landscapes, a lot of meaningless songs, maaaaany sx scenes , a lot of nudity. I don't even know if you can call this a movie. At least the first one I managed to watch it till the end."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "robcarpenter-41952",
        "review_rating": "1",
        "review_title": "Who is to blame?",
        "review_detailed_main": "This story could have been great. It is as if the director or writers or whoever couldn't think of anything and decided to have music and sex breaks throughout the movie. Pathetic attempt for a movie bit it is more of a long music video and semi porno. Congrats on the absolute worthlessness of this movie, and the one previous. Waste of time."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "chiaramariecapritta",
        "review_rating": "1",
        "review_title": "Worst than the first one",
        "review_detailed_main": "The first half of the movie is just a music video with them in the background doing sex, even tho I have to admit that without the music it would be just like a porno so it was a good(?) thing that there was music.\n\nThere are more or less 20 minutes of dialogues in the whole movie, the \"plot twist\" was just... CRINGE, as the rest of the movie... Massimo acting just got worst (is it even possible?) At least it was so bad that I laughed for two hours."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "pepperlilly",
        "review_rating": "2",
        "review_title": "Really bad",
        "review_detailed_main": "Ok, one star for the beautiful scenery and one for the perfect getaway atmosphere. Just turn the volume down... Even the sex is absolutely non-inspiring ((("
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "samuelsabigail",
        "review_rating": "2",
        "review_title": "Didnt think it would get worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "alexandru_m-03765",
        "review_rating": "1",
        "review_title": "Simply the worst.",
        "review_detailed_main": "The entire movie feels like you wants music videos on YouTube of popular love/summer songs. In the first hour of the movie there is barely any dialogue, most of it is useless and boring. There are like 3 lines that contain story-related info. The only good thing about this movie was the camera quality, just that, the edit was awful and no matter how much I tried, I couldn't mentain focus for most of the movie.\n\nNothing that happened in this movie had a reason or any sense, you just sit and watch some background footage for the music you listen."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cameolyssa",
        "review_rating": "8",
        "review_title": "Why is everyone being so harsh with ratings!?",
        "review_detailed_main": "I really don't know what to rate it, but I definitely think it deserves more than the low ratings that people are giving. I loved the first movie and this one as well and would watch them both again! It's a mysterious, sexy, love story that keeps my attention and I can't wait to see #3! Oh, and despite what other critics are saying, I like the music - I think it adds to the drama and the amount of it didn't bother me or ruin it."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "suryamahesa-71996",
        "review_rating": "6",
        "review_title": "BEST MOVIE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cardsrock",
        "review_rating": "1",
        "review_title": "Trash trash trash",
        "review_detailed_main": "This hardly qualifies as a film. It's somewhere between a porno and a music video without being anywhere near as interesting as either. This is probably even worse than the first film, which is truly saying something."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "zsofiaszlanka",
        "review_rating": "1",
        "review_title": "I would give 0 if it would be possible.",
        "review_detailed_main": "I hope the actresses and actors enjoyed the work at tne beautiful places. At least they had fun, because for us the complete film was only a torture.\n\nI usually don't skip scenes in films, but in this case I made an exception...."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "evans-j34",
        "review_rating": "5",
        "review_title": "Meh not so good as the first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kfordd-95917",
        "review_rating": "3",
        "review_title": "Not worth it!",
        "review_detailed_main": "Missing details, no dialogue. Although beautiful scenery and good soundtrack. However, no depth, dialogue minimal. I didn't read book two, but I hope it was better than the movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "purkopurko",
        "review_rating": "1",
        "review_title": "Bruh",
        "review_detailed_main": "30 mins of sex and music that does not fit at all 30 mins of shopping dining, driving ferraris corvettes and chirons and Laura complains.. and music that does not fit at all 30 mins of sex dreams and...music..that does not fit at all 5 minutes of plot."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "matteoloubry",
        "review_rating": "1",
        "review_title": "What a poor movie...",
        "review_detailed_main": "The first movie was bad, the second one is even worse. It's a Netflix production so I wasn't expecting something good, but the ten first minutes were way enough for me to say to everyone that reading this: DO NOT WATCH IT, DO NOT WASTE YOUR TIME."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "JessCuhh",
        "review_rating": "4",
        "review_title": "You know what you're getting",
        "review_detailed_main": "Bad. Really bad. The acting was horrible, None of the plot points went anywhere or were explained, and the ending is so bad and cringey. Too much music. But some of the songs were good. I kept waiting for it to be over. But this is a sex movie so just don't go in expecting much of a story. The sex scenes were good."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "geday_1",
        "review_rating": "1",
        "review_title": "Just dont waste your time ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nursektanner",
        "review_rating": "9",
        "review_title": "Great sequel. Unexpected twists. Very entertaining.",
        "review_detailed_main": "Don't listen to all the bad reviews!!! For those who love romance novels and plots twists, and if you really liked the first movie, this is a great sequel and was highly entertaining. It makes no sense why it's getting such bad reviews. It was almost a good as the first, and the ending was unexpected and emotional. Definitely a winner!!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "carolannebronson",
        "review_rating": "7",
        "review_title": "Ending was awful",
        "review_detailed_main": "The movie was pretty good overall compared to the first. There was lots of s*x scenes; however, the ending was absolutely horrible. They could have made it so much better. Very disappointed."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "magicmaker159",
        "review_rating": "1",
        "review_title": "HORRIBLE",
        "review_detailed_main": "This was tragic. 1 hour and about 12 mins was all sex. All! They have made this story into a porn film! Then! They use music, act out the script (which is very lacking and horrible) and no dialogue. This whole thing was a let down. Completely!!!!!!! And a hot Nacho who is a gardener? Really?"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "melinarizaj",
        "review_rating": "4",
        "review_title": "Only cause Massimo is hot",
        "review_detailed_main": "Otherwise, this is movie is a solid 1/10 no .No actual plot and the characters are so boring it is painful to watch. Great for a good laugh with a friend though."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cherrellegriffiths",
        "review_rating": "1",
        "review_title": "Boring and confusing .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kanelske",
        "review_rating": "1",
        "review_title": "Why? Just why?",
        "review_detailed_main": "I mean, we've waited patiently and to be honest, really excited to see the new characters, two really handsome gentlemens and womens as well, yet disappointed.\n\nThere is no backbone in this sequal, their words had no meaning, we didn't get to know what happened with Laura at the tunnel, it's really just a bland movie.\n\nI personally wouldn't blame any of the actors, especially Simone since it's a debut and Michele does good as well, also the lovely womens, but I'll definitely blame the writer, director or whoever decided to proceed with the movie.\n\nThere was only 20 minutes of story through out the movie (which is 1:56 long)... Really sad.."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "enzomalorgio",
        "review_rating": "1",
        "review_title": "Very poor production",
        "review_detailed_main": "Very disappointed, the production made a disaster with the release of 2, I advise against it, it's a boring waste of time.\n\nThe actors are unnatural and there is no original script just basic like the movie.\n\nSince the death of his girlfriend, the film does not have much interest in having a part 2 because the whole scenario is dead because in my opinion and many other people it is a bad choice made by the team of realization.\n\nNetflix produces bad movies!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "albertval-69560",
        "review_rating": "3",
        "review_title": "Tepid",
        "review_detailed_main": "Massimo and Laura get married early on, and it's expected that there would be steamy sex in most of the early scenes. At least, these scenes are tastefully done. New characters (Nacho and Massimo's twin brother Adriano) are introduced to spice up the story but it doesn't quite succeed.\n\nFrankly, not much is going for this story."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "helenelillelund-73996",
        "review_rating": "1",
        "review_title": "The first half was porn, the other half had a nonexistent plot",
        "review_detailed_main": "This must be the most meaningless movie I have ever seen.\n\nThe first 30 minutes was just porn. I truly hoped that there would be a plot after all. That didn't happen."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "eliza_gaskell",
        "review_rating": "1",
        "review_title": "it's so bad that is good",
        "review_detailed_main": "I'll give credit is due and that is the film cinematography, the cars and the scenery....but that's it.\n\nThe film is basically a combination a pop music video and montages of who knows what. The way it was filmed you could tell it the production was under COVID 19 restrictions hence the poorly disguised sets and lack of people except in the ballroom scene. Now there is a \"plot\" that is so thin that a gust of breeze can blow it away.\n\nThe characters are unlikeable...yes very unlikable and Laura is spoilt woman, the guy playing Massimo can't act and the rival is weird and I mean weird. What him act around his \"sister\", I dunno it it's a Poiish or European or Italian or Sicillan thing but it's pretty creepy .\n\nBUT the film is bad it's good because it's a comedy."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "aliisafarnsworth",
        "review_rating": "8",
        "review_title": "Guilty pleasure",
        "review_detailed_main": "Disappointing to see so many low reviews. My husband and I have really enjoyed both instalments of 365 days and looking forward to the third. Straight from the synopsis of this movie you get a good idea of how over the top this film is going to be and it meets expectations! But very enjoyable if you can go along for the ride and have some giggles in some of the scenes. I like to think that the movie was made with this intention. Although, who knows. It's like a porno but with lots more extras to enjoy. Any couples that enjoy a tease, something erotic to get you in the mood...it's worth the watch."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Chantezzy",
        "review_rating": "7",
        "review_title": "Not as good as I was anticipating",
        "review_detailed_main": "The first 3/4 of the movie is just music and it starts off really slow, but the end was amazing though. So make sure you stick it out until the end because it's worth it. It wasn't bad but I was waiting forever it felt like and was a little disappointed but I'm still a fan."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "xmkmrchjy",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Bet that the script was written in max 1 hour. I'm that type who is enjoying and watching low rated movies, but this one is so bad that it should be illegal. I couldn't watch it more than first half. Don't waste your time with this, because you will have a \"brain attack\"."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "olivialewington",
        "review_rating": "2",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ipekgul",
        "review_rating": "1",
        "review_title": "IT WAS DISCUSTING",
        "review_detailed_main": "Please don't do a another movie again. If you do probably our eyes will gonna bleeding. This is a sick movie. Stockholm syndrome is a ilness not a love. Please don't mixing these words. I am gonna peuke."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "petarrrrrrados",
        "review_rating": "1",
        "review_title": "WORST FILM I EVER WATCHED",
        "review_detailed_main": "This director should be banned for making movies ever again! This movie was miserable from the beginning to the end. The acting was awful. There was too much music like it's a music video instead of a movie. The movie is basically a bad copy of the second movie. No explanation of the happenings or good script whatsoever. Wasted two hours of my life. The ending is stupid and makes no sense. The whole movie is basically one big cringe."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "denisp-22246",
        "review_rating": "1",
        "review_title": "Beau paysages",
        "review_detailed_main": "1 pour les paysages et pour LA page A4 de dialogue. A couper le souffle 😅 On ne comprends pas la suite du premier qui était déjà bien bien léger.\n\nUn film inutile. L'actrice principale est sur maquillé du début à la fin, pourtant c'est bien elle qui porte ce long métrage club med."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "awanjiez",
        "review_rating": "1",
        "review_title": "Badly acted",
        "review_detailed_main": "I've never been so confused watching a movie, this movie is so badly acted that you start questioning your self. No time frame suddenly it's 10pm next scene is 4pm and next is 2am."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nurmbergbirgit",
        "review_rating": "1",
        "review_title": "It ain't it yk",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "marshap79",
        "review_rating": "1",
        "review_title": "Y'all?!? Wtf was this hot mess express! HAAAA!",
        "review_detailed_main": "Omg... I can't even begin to tell you how awful this thing was. I can't even call it a movie bc it doesn't even deserve to be called that! And when someone is upset and running away from somewhere who in the everloving heck asks them.... \"Are you feeling ok?\" LMAOOOOOO!!! NO ONE ASKS THAT! They say \"what's wrong?\" Or \"are you alright?\" Ugh this was hours of nothing but a cringe fest and the random music montages haha! I'll still watch the third though, bc I gotta see if they can top this one. The producers are probably like \"sure, challenge accepted!\" Lol. Watch at your own risk. It's wonderfully awful haha!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "naeii_loves_u",
        "review_rating": "10",
        "review_title": "Why break my heart like that",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "RosanaBotafogo",
        "review_rating": "6",
        "review_title": "Weak...",
        "review_detailed_main": "In the expectation that it becomes less bland, misogynistic, truculent, disgusting and deplorable than the original... Well, at least they tried, probably due to the effusive criticism of the first, however it becomes even more frivolous and forgettable, story and script, nor the scenes of sex can entertain, however, I didn't expect much more than what it can offer..."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "timeaviszoki",
        "review_rating": "1",
        "review_title": "Just kept skipping possibly the worst movie ever made",
        "review_detailed_main": "No monologue, just as mentioned before like a music video.\n\nI'm speechless how anyone would even think to make a movie like that or even accepting a role in this. Waste of time and money for whoever made this and for all the crew. Maybe they should think of going on pornhub and make films there might be more successful.\n\nMy recommendation for anyone thinking of watching it : just go and do something else even cleaning your house is more enjoyable than this."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "crnthnt",
        "review_rating": "5",
        "review_title": "Where is all the passion",
        "review_detailed_main": "Part one had a lot more \"passion\" than this one. We all watch it for the \"passion\" so bring some more.\n\nAlso, why was there so much music, it seems unnecessary."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "aljebren-01940",
        "review_rating": "1",
        "review_title": "Worst thing",
        "review_detailed_main": "How could you take something beautiful and butcher it. Like i cant see anything but a trash sequel in all history. Wouldn't recommend watching it at all."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "baderhussain-31448",
        "review_rating": "1",
        "review_title": "Cringe!!!",
        "review_detailed_main": "Another addition in the list of flop eroticas. At least in the first part the intimate scenes were fire and enjoyable despite bad acting and cliché script however second party is not only painful to watch but even nude scenes are also as boring as hell."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kim-hamilton1983",
        "review_rating": "5",
        "review_title": "Is this a movie or a music video",
        "review_detailed_main": "20 minutes of the movie was story and the rest was a music video with Laura and Massimo having sexy time.\n\nGiven five stars as the continuous music video was annoying. How ever I did enjoy the tiny story.\n\nThe first movie was a lot better."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tannakles",
        "review_rating": "1",
        "review_title": "Dissapointed",
        "review_detailed_main": "I actually liked the first movie. So i was interested to see part 2. This movie was terrible. The music actually made it worse for me. I do not know why they chose music they did but whooo. Hopefully this is the last movie of the series."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "rthompsonq-96150",
        "review_rating": "1",
        "review_title": "Terrible Terrible Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "AdventuresOfTheMovieWatcher",
        "review_rating": "1",
        "review_title": "An abomination",
        "review_detailed_main": "Would have given it 0/10, if allowed. Nobody should subject themselves to 5 minutes of this movie let alone 2 hours. Laura should've aborted this movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "onlinevirtual",
        "review_rating": "10",
        "review_title": "Still laughing at all the 1 stars !!! Good movie",
        "review_detailed_main": "If you ever want to have a good laugh check out the comments from the triggered fems who have no problem with fifty shades of grey but are literally lighting up the pitch forks for the sequel to this great movie yet again. Yet another great movie and performance with this sequel."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "carruthers_abbie",
        "review_rating": "1",
        "review_title": "More emotion in my big toe than their acting",
        "review_detailed_main": "I don't know if its the accents or pigeon English at times, but the actors had zero emotion, they just spoke words in one tone. Zero connection.\n\n80% of the film was in unnecessary slow-mo with none corresponding music over the top - basically a 2 hour long music video.\n\nStory line was poor. Ending even worse."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ramangautam-26573",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I would have rated it below 1 star out of ten. But alas, it cant be done. Movie have no plot, bad acting and full of nudity. Wth is this behaviour to make a movie look good just by adding more n more sexual content in it ?? I completely dont understand the motive of producer of the movie. This is the worst movie I have ever seen in my life."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ionelatap",
        "review_rating": "1",
        "review_title": "I've made myself an account just for review",
        "review_detailed_main": "This is the worst movie ever! Almost 90% is just sex, nothing else.\n\nYou no longer have to go to an adult movie site, because you have 365 days.\n\nThink the first part was a little better than that.\n\nI like actors, but the movie is extremely awful ❗❗❗"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "knezevicmia-13338",
        "review_rating": "1",
        "review_title": "Worst movie i ever watched",
        "review_detailed_main": "Worst movie i ever watched.\n\nCringe cringe cringe I don even have words for how bad this movie is.\n\nWorst movie i ever watched\n\nWorst movie i ever watched\n\nCringe cringe cringe."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "h556669",
        "review_rating": "1",
        "review_title": "I'm here for Massimo but...",
        "review_detailed_main": "I need more Massimo's nudity but the sequel didn't give me what I want for that I'm super disappointed!!!\n\nDirector please wake up! Knows what your audience want."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mtuigladie",
        "review_rating": "2",
        "review_title": "Less cringe but still cringe lol",
        "review_detailed_main": "We still watched it anyways...there is no plott!!! Omg worse than the first one imo. Its just a whole lotta s**x that feels more like f**g and less like romance.\n\nI think the problem is they trying to narrate a polish-written book into an english sort of movie that's like Fifty Shades but just cringe to the point of no return."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kormoczid",
        "review_rating": "2",
        "review_title": "Music video",
        "review_detailed_main": "The plot is so boring and during the movie you feel like you are watching music videos after eachother because after 5 minutes of dialogue comes 10 minutes of music."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "rbzkzjph",
        "review_rating": "1",
        "review_title": "Yikes! I didn't expect a gray movie but this is a first!",
        "review_detailed_main": "I saw the first one and even though it wasn't great, it wasn't awful either. There was angst and dialogues and story line. This one...I couldn't believe what I was watching. I've never seen a movie without dialogues, story line or mostly consisting of music. First 20 minutes I thought it was just a recap. Annoying and unusual but I was waiting for the movie to finally start. It never did....:("
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "manesstwo",
        "review_rating": "10",
        "review_title": "MY BEST GUILTY PLEASURE EXPERIENCE ALL YEAR COURTESY of MICHELE, ANNA, & SIMONE",
        "review_detailed_main": "If I wanted to see a bunch of less attractive people in less beautiful places re-telling history, blowing up stuff, engaged in the \"perfect shootout\", or raising a social issue already beat to death instead of solved, I'd watch CNN or the news programs more than I already do. That said, I look forward to more hours of glorious and mindless escapism that one gets from this franchise. I also consider two married people who can't get enough of banging each other aspirational and am thereby headed for my Nordic Track bike right now. My husband accepts and loves me the way I am but would love it if I could wear some of the lingerie Laura wore; and he WILL be working on his six pack alongside me."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "CambronMcK",
        "review_rating": "1",
        "review_title": "Was there a plot and it was edited out?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jmalby",
        "review_rating": "1",
        "review_title": "Probably the worst thing I've ever seen",
        "review_detailed_main": "Going into the sequel, I was already expecting this to be terrible, but it somehow exceeded all of my expectations. This is by far worse than the original and that says a lot. The scenes are aggressively clichéd and corny, the plot is much more ridiculous than it is in the first movie, the acting is laughable and so on. Nothing makes this amusing. Even the sex scenes are bizarre and way over the top."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "klear-19204",
        "review_rating": "1",
        "review_title": "Ummm",
        "review_detailed_main": "Get ready... Its a very long music video. Seggs. Small conversation. More seggs. Lots of Seggs and plot happens only within the last 30 mins. I can't believe a 2nd one was made."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "drewvogelaar",
        "review_rating": "1",
        "review_title": "Who Green-lighted this",
        "review_detailed_main": "The first installment of the 365 Days Saga was one of the worst movies I have ever seen. I felt that the filmmakers owed me an apology for the 114 minutes of my life stolen. Then Netflix, known for its quality and high moral standards, announced a sequel called 365 Days: This day. Since I had seen the original, I knew I had to watch this film. It took nearly every bit of my life force to open up my Netflix app to type the movie. I wish Netflix would have crashed.\n\nWatching this movie felt like my soul was being sucked out of my body. This was one of the most miserable movie-watching experiences I have ever had. Unlike the Fifty Shades of Grey franchise or Mickey Rourke movies, this movie was just sex. There was no plot there were no characters. It was 80% sex, 10% stupidity, and 10% something resembling a story. To paraphrase a quote from Billy Madison, which looks like the Godfather compared to this garbage. \"What you've just watched is one of the most insanely idiotic things I have ever seen. At no point in your rambling, incoherent viewing experience were you even close to anything that could be considered a film. Everyone in this room is now dumber for having watched it. I award you a razzie, and may God have mercy on your souls.\"\n\n0/10 A Steaming hot pile of garbage with no redeeming qualities, possibly the worst film of the decade."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "karken-13825",
        "review_rating": "1",
        "review_title": "I don't even know🤣",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "info-90847",
        "review_rating": "1",
        "review_title": "A Really Boring, Unambitious, Stereotypic, Shallow and Superficial Flix",
        "review_detailed_main": "Even more boring and superficial than real Polish women are, is the plot, but there has to be mentioned, that it could take only a Pole- especially the women - to make a story, normal people tell in 3 minutes, to artificially expand it with cultural crap and pure nonsense conversations to 2h in the real life...\n\nAbsolutely does not worth your time or the money spent for mediocre actors..."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "anna_szpak",
        "review_rating": "1",
        "review_title": "it is terrible",
        "review_detailed_main": "The first part was terrible, but the second part is even worse. It's boring. Me and my friend drink some vodka and even that didn't help !!!!! Please don't watch this !"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "occupier-85882",
        "review_rating": "1",
        "review_title": "Masakra",
        "review_detailed_main": "This review must contain minimum a one hundred and fifty world's but there is nothing to say about this movie ,nothing good it's really bad. Highly not recommended to watch I lost 2h of my life."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cgvsluis",
        "review_rating": "8",
        "review_title": "Super sexy Massimo is joined on screen by equally sexy Nacho...must watch for fans of the series!",
        "review_detailed_main": "When I watched 365 Days...I had yet to read the books and although there were flaws, Massimo's appeal surmounted my grievances and I enjoyed the film enough to want to read the books. Now I have read book one and book two of this trilogy and am watching This Day after reading it. In this sense, I was a little disappointed that the film did not stay truer to the source material it was based on. I realize that they had to tell the story in a short period of time so it makes sense that they condensed it quite a bit and you do still get the sense that Laura is being pretty unreasonable with Massimo while he is trying to please her and do his \"job\". It really made me appreciate the loving care that Passionflix gives to its films in regards to their source material.\n\nHaving said that if I take the film just at face value...it is sexy (now there is not only the sex god Michele Morrone, but new character played by Simone Susinna), it has great luxury locations, a fabulous soundtrack and the fashion is top notch! For those reasons alone I would recommend the film.\n\nWhile I am aware that dark mafia romances are not everyone's cup of tea...for some including myself this is enjoyable escapism which is what entertainment should be. If you have \"triggers\" or only want to see women respected in a safe environment...why are you watching a dark mafia romance? No one says that it has to be your taste. If you don't like it, don't watch it. No one is being forced. Do i believe women should be kidnapped? Absolutely not. Do I want to be kidnapped? Absolutely not. But that is why it is escapism and not reality. Let people enjoy the beauty that is.\n\nMovie 2:This Day picks up jumping a little into the future with Laura back with Mossimo on the brink of their wedding. They marry and Laura quickly becomes bored after their honeymoon because Mossimo has to go to work. Laura flounces around like the pouty, spoiled brat that she is. Mossimo brings her family in for Christmas buying them gifts and Laura a fashion house to run. Then Laura sees what she thinks is Mossimo cheating on her with his ex and goes on the run with new character, \"Nacho\" the new gardener. She spends time learning to surf in a tropical island paradise with Nacho...and if you want any more you will have to watch the film.\n\nWhile not for everyone...I know plenty of people that I will be recommending this film to and I for one cannot wait for the conclusion of this story."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "markov-60089",
        "review_rating": "1",
        "review_title": "Guys if your GF makes you watch this, advice for you:",
        "review_detailed_main": "Just grab a bottle of wine and prepare yourself for the worst movie of your life. After the first hour you start to realize that you are calming down and instead of being mad AF you start laughing how bad it is.\n\nThis is pure art.\n\nBest part is definitely polish SIM card in Italy having english voice mail ."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jessica_dw",
        "review_rating": "4",
        "review_title": "I watched it, no idea what happened. Enjoyed all the sx",
        "review_detailed_main": "I'm very confused. Not really sure what the plot is but all the sx is good. Definitely not what you want to watch if you're after an intellectually stimulating film but if you just wanna see sx and I mean a lot of sx while your husband is at work and your kids are asleep this is perfect."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "pivan23",
        "review_rating": "3",
        "review_title": "Beautiful actress bad plot",
        "review_detailed_main": "Don't want it for the plot, it's 1/0, but it's good they introduce the woman because she's beautiful that' is all there is to it.\n\nStupid movie No Logic High Quality Camera No Sense Sophisticated taste."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "prhncd",
        "review_rating": "1",
        "review_title": "Trash!!!!",
        "review_detailed_main": "The movie did not even have a plot. In addition to that, the ending does not deserve the word trash, as even though it was unexpected and some would say that it was a good plot twist, made the movie even worse than it was. For everyone that is reading this and havent watched it yet, please don't, it it a waste of time!!!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cristina-ro",
        "review_rating": "3",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "softballchick-81898",
        "review_rating": "1",
        "review_title": "No storyline just sex",
        "review_detailed_main": "I actually liked the first movie but was pointless!!!!!!They could have us with the cliffhanger cause this was an absolute waste!!!!! 20 minutes of talking the rest is just sex🙄"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "vittorio-13",
        "review_rating": "2",
        "review_title": "The first movie was excellent the second movies sucks",
        "review_detailed_main": "The whole concept got lost in translation. It looks like they spent less money on this movie than the last she has lost her appeal and the story has so many holes that two trucks could get through my goodness.\n\nThe movie start with wimpier, after a massive cliffhanger. What a waste of an opportunity, so sad that a movie that had so much potential died an early death."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "chounouzidi",
        "review_rating": "1",
        "review_title": "Very bad movie",
        "review_detailed_main": "It was terrible 😂 Basically it's a porn movie with music. Lot's of sex scenes and no plot at all. Nothing makes sense . All the actors are very attractive and sexy but that's not enough for a movie! They try to copy 50 shades of grey and it looks like a parody! Do not watch it , it's a waste of time."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nixeverknowing",
        "review_rating": "10",
        "review_title": "Delivers exactly what is expected of it",
        "review_detailed_main": "Anyone who watches this movie should know what to expect from it, and that is mafia romance ... it delivers puuurrrrrfectly...along with the tons of other romance books, for which there is an incredibly large global market, it is always good to see some of them poured on the screen - which is rare. For those who have done 50 shades of gray, learn something from this one because they eat you for breakfast with that pathetic excuse for the movie. You need to know what key market segment expects from you. Given that this film is based on one of the less popular trilogies, I hope someone will soon catch up with really popular writers like J. R. Ward and her Black Dagger Brotherhood as well as Kresley Cole and her Immortals After Dark or Karen Marie Moning and her Fever or Highlander series."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "abelinasalvatore",
        "review_rating": "5",
        "review_title": "THE CRINGE IS REAL",
        "review_detailed_main": "Did I almost vomit at the intense cringe? Yes. Did I watch the whole movie with the greatest joy ever? Also yes. Man, this was so bad it was good. Loved and hated every damn second. A real roller-coaster of \"oh I can't even watch this anymore\" to \"damn, Michele Morrone is actually not a totally bad actor\". Loved the totally unforseen ending, too, spectacularly underwhelming."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "eduardcg",
        "review_rating": "1",
        "review_title": "Here we go again... Razzie award contender",
        "review_detailed_main": "I guess, like the first movie, this will get a nom for all existing categories... Horrible script, acting, directing, etc.\n\nWhy is Netflix accepting this kind of bad movie? They should keep the good shows running."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "smilesoldier",
        "review_rating": "5",
        "review_title": "Terrible but addictive...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nhkzxyzh",
        "review_rating": "5",
        "review_title": "Lack of focus",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "yencart",
        "review_rating": "1",
        "review_title": "WHAT A WASTE OF TIME",
        "review_detailed_main": "Came here only to post this review because this movie is sooo bad I could not make myself watch the entire film .Ive watched Polish films and they were great but this film? It is a train wreck."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "hamedbahrihb",
        "review_rating": "1",
        "review_title": "Dont suggest this bad movie",
        "review_detailed_main": "It's really bowl shi... And this movie is nothing except sx & por...graghy I waste my time and internet for this bad movie Its just have car's and views but can't even tlaking a good dialogue Shame on you."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "sihabhussain-63870",
        "review_rating": "1",
        "review_title": "Why there is no option for minus 10 . Overacting 10/10",
        "review_detailed_main": "This is very very bad movie . Do not watch it guys . U r just going to waste your time. I never seen such bad movie. This is very very bad movie . Do not watch it guys . U r just going to waste your time. I never seen such bad movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "sue-06239",
        "review_rating": "5",
        "review_title": "Corny but what the hell?",
        "review_detailed_main": "Stunning locations and a drop dead gorgeous leading man. Yes it is corny and the lead actress is so smug I want to slap her, but then if I was having amazing s*x with Massimo I'd be looking pretty smug myself!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "moghaddamalireza",
        "review_rating": "8",
        "review_title": "Good! Because.....",
        "review_detailed_main": "I think that was a good movie you can spend your time and enjoy a good and erotic story , In cinema we are looking for our dreams and reality so let's not be offensive and enjoy...."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "petia9704",
        "review_rating": "1",
        "review_title": "Is this a joke?",
        "review_detailed_main": "I was really curious how bad it can really be. I mean the first movie was bad but this is something else... This is next level... I genuinely wonder who thought this movie has potential for a second part. Or is this how movies work now? You know people will hate on it and you still do it cause they'll talk about it and it will still blow up. Shortcuts to fame, nice."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "xvdhn",
        "review_rating": "1",
        "review_title": "A glorified sex music video",
        "review_detailed_main": "If you like rubbish music videos with 20 lines of dialogue and lots of over the top sex then this is the film for you!! It was honestly the worst film I have ever seen."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "niall-bowen",
        "review_rating": "1",
        "review_title": "Awful even at 1.5 speed Avoid.",
        "review_detailed_main": "Confusing, meaningless pastiche.\n\nNo plot.\n\nNo style- every scene jumped through at high speed. Seems to be someone's self indulgence being satisfied here. Haven't seen the first one but it's apparent I've not missed much.."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ayeshal-65477",
        "review_rating": "1",
        "review_title": "Not a good script",
        "review_detailed_main": "To be honest the movie did not have a proper story line...it was boring..though Laura in the movie has good sexual life but she ends sleeping also with someone else...it did not make sense at all she is sleeping around with men...plus the twin acting was horrid...the script did not make sense.."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Z_Rux",
        "review_rating": "1",
        "review_title": "This is so bad it's almost entertaining",
        "review_detailed_main": "So, so bad. I'm not going to bother writing a proper review, it's not worth it. The actors, if you can call them that, are the worst I've seen. The sex scenes are at the same time explicit, abundant, boring and badly faked. At no point do they make you believe they are actually doing it. The script is a joke. Hard to believe, but this is even worse than the first movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "brxtqqy",
        "review_rating": "1",
        "review_title": "cringing to death",
        "review_detailed_main": "This movie makes shallowness a aesthetic.\n\nWeak storyline, miserable conversations and nothing but montage of sex scenes.. I must admit, I did not expect anything from the movie, but it still managed to disappoint."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "info-95652",
        "review_rating": "1",
        "review_title": "Just a very long, bad p*rn movie",
        "review_detailed_main": "Gosh this was worse than expected. I'll be honest, I actually enjoyed the first 365 day movie but this one takes the cake. It's just a very long porn movie without an actual storyline. There's probably better movies on p*rnhub."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Polotovar",
        "review_rating": "2",
        "review_title": "Even worse than the previous movie",
        "review_detailed_main": "I think the second part is even worse than the previous one. As bad as the first one was, there was a little bit of something going on, and there's perhaps even more sex here, which may be fine with some people, but the thing is, for the first half or so of the film, there's a sex scene every now and then. You're kind of watching sex all the time until about the second half of the movie, where it slows down a little bit with those scenes and a little bit of story comes in, which I think is just as weak. So what does this film have to offer? The first half is all sex, which we can find everywhere on unnamed sites these days, and the second half has some plot, but it's not the best. This film will probably please only the biggest fans of the first part. I would advise others to avoid this one. It has nothing to offer in my opinion. Unless you want a good dose of eroticism without a deeper plot. Otherwise, I don't know. For me, a bad film that I don't recommend."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nicolegittman",
        "review_rating": "8",
        "review_title": "CHILL with the bad reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Nickelzz",
        "review_rating": "1",
        "review_title": "Could have been good",
        "review_detailed_main": "I normally enjoy most movies just because I know a lot of effort was put into them by many people. This is one of those movies where the story could have been good, but with as much story as there is this could have been maybe a 30 minute episode. I skipped so many sex scenes, I'm all for them but at some point there has to be a limit lol the scenery is beautiful, the actors are always beautiful. It was overall lackluster and I unfortunately had higher hopes."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nick-25963",
        "review_rating": "1",
        "review_title": "What a waste of time,",
        "review_detailed_main": "No storyline, First 45 min is dinner music and soft porn lmao Rest is trash as well. First movie 365 was great, it had a storyline.\n\nThis day sucks, I literally mean 365 this day sucks badly."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "adamgeraghty-51989",
        "review_rating": "2",
        "review_title": "Just avoid it, there's nothing really here anyway",
        "review_detailed_main": "Truly one of the most boring and uneventful movies I've ever seen.\n\nThere isn't much I can say because nothing worth talking about. I don't think I've every seen a movie that cares this little about story. Nothing happens for long periods of time and then things happen on a dime with not an iota thought put into them. There are 35 pop songs played throughout the movie and the movie is 111 minutes long, that's roughly a pop song every three minutes. The songs don't hide the lack of story and they definitely don't hide the quality of the movie. It's not even good music it's as generic as possible. In conclusion they made 3 of these, the first one was bad and this one was worse so that leaves one more to watch and my hopes aren't high."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Serenity3000",
        "review_rating": "4",
        "review_title": "The 1 star ratings are not accurate.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "vibhaaawhirley",
        "review_rating": "1",
        "review_title": "It is so bad I don't know from where to start",
        "review_detailed_main": "The storyline is haywire. I had watched the first movie and liked it partly, that is, at least the sex scenes felt part of the story, there was some emotional connection between the characters eventhough the story seemed like it jumped out of wattpad thirst novels.\n\nThis movie is beyond garbage.\n\nStory seems from nowhere, we don't get to know what happened after the accident and bam! Directly to the marriage scene. I got disconnected from the movie there itself.\n\nThen lots of sex! No emotional connection, only the scenes. But I still watched it. Why? Because I think I only had only a few braincells left owing to the fact that I wanted to see where the story led, if ot revealed something. The first movie story was predictable, but okayish. Then after it ended, I regretted wasting 2 hours of my life. Bad acting, bad story, bad direction, and lots of scenes doesn't make one hungry to watch it. There's only wild wild sex thrown here and there and nothing else , totally disconnected emotionally."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "abdulazizhq-86603",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "peterson-76174",
        "review_rating": "2",
        "review_title": "Talk about a let down...",
        "review_detailed_main": "I know a lot of people didn't like the first one, but I actually enjoyed... which is why this second movie is such a let down. No script, all music and sex. Honestly I'm super disappointed because the storyline they could have written for this plot versus what we were given was so bad.\n\nThey only reason I gave it a 2 was because the actors seem to be amazing people outside of the film."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mako-12422",
        "review_rating": "2",
        "review_title": "Expected a cheap and shallow but this was much worse!",
        "review_detailed_main": "Can't even begin to describe how bad this was! Not even a dialogue!! Good job these Guys are well hot, helps to get through the 2 hrs.\n\nI kept watching and waiting for it to get better but that didn't happen!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "manteltje",
        "review_rating": "10",
        "review_title": "Take it for what it is <3 and set your mind to:",
        "review_detailed_main": "A fantasy with hot guys, beautiful cars, houses, fashion, sceneries and hot sex. It's like the smutty book with the Italian mob billionaire come to life on screen. And I think they have it done very well, they certainly did not skimp on the budget. Every scene is a picture perfect. It's just a different kind of movie where not everything is explained. You have to go with the flow and the emotions and just enjoy escaping for a while. It's got a big fan base and I understand why. I can't wait for the third movie! And Massimo, ow my lord, I follow him on Instagram and he doesn't have 13,5 million followers for nothing."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lanquide",
        "review_rating": "2",
        "review_title": "It's unbelievable that this script got produced",
        "review_detailed_main": "An average movie with a 6/10 IMDB rating wasn't a miracle with the cast and the money poured into this series. I get it, It is a chick flick, but they insisted on creating the most expensive clownery possible.\n\nThe root of this horrific cinematic experience is the script. I have not read the books, I don't know if the dialogues are as corny as they are in this film. But jesus christ, everything that came out of the actors' mouths were like sharp nails on a chalkboard. But beyond the arguably worst dialogue in the history of professionally produced filmmaking, the whole thing looks like a collage of rap music videos, something like how \"new money\" people would imagine being rich looks like. Scenes don't add to a story. They are just there to fill the time.\n\nOtherwise, it's clearly not amateur camera work. Actors, are not even particularly bad. The lead guy can give face and emotions. People who performed miles worse in previous jobs ended up wining Oscars in their subsequent works in the past.\n\nBut the script... I have seen nothing like it. There is clearly something wrong at Netflix, if they can't turn down this script, ask the writers to \"kindly revise\"."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mamoty-44986",
        "review_rating": "1",
        "review_title": "Zero",
        "review_detailed_main": "This movie is worst movie ever. I will rate it zero if I can. Acting is horrible. No story lines. Dialogue is bad. It just waste of time. It just a joke!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "genesond",
        "review_rating": "2",
        "review_title": "So disappointed",
        "review_detailed_main": "The movie had almost 0 storyline, you have no idea what is going on, it isn't even close to the book.\n\nSex scenes were fine as that's what most people watch the movie for but the movie strays so far from the book that I found myself highly confused through the whole thing and got more frustrated as the movie went on."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ypccmvwc",
        "review_rating": "2",
        "review_title": "It was sooo bad",
        "review_detailed_main": "I give 2 stars. One, for beautiful places. Second for M. Lamparska. Not for her role, I just like her . How come this could be sooooo bad that I can't think of anything worse I've watched..."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tyylett",
        "review_rating": "1",
        "review_title": "So annoyed that it got me to sign up and write my first review",
        "review_detailed_main": "Clicked in as it was somehow on Netflix's top 10... what kept me till the end was my hope that all those generic plots and unnecessarily long montages would eventually build up to a plot twist. The whole thing is just tacky even though the team obviously made a great effort for all the extravagant settings. Damnnn what's the opportunity cost of this!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jagdeepjutley",
        "review_rating": "1",
        "review_title": "This is a movie to just have on in the background as noise.",
        "review_detailed_main": "Jesus. What an awful film, makes no sense whatsoever, it's as if they just have good looking people having sex and then write an awful story around that. Genuinely terrible."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "qtltldncr",
        "review_rating": "1",
        "review_title": "Major Disappointment",
        "review_detailed_main": "The 1st one was breathtaking!!! This one was horrendous. Michele was as incredible as always but did they change the female lead in this one??? She can't be the same actress. They had zero chemistry and she was overacting the whole time. She was terrible. It seemed like a parody not a drama. The sex scenes were hard to watch and there was no plot. They truly made a mockery of what initially was the steamiest movie in a very long time. Truly disappointing."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jennitaylor78",
        "review_rating": "1",
        "review_title": "Well, as expected to be honest... !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "malogiannisgeorge",
        "review_rating": "10",
        "review_title": "My opinion.",
        "review_detailed_main": "Without wanting to say something bad about anyone, but guys when you watch the movie you know what you are watching. Also this movie is about mafia and I think they show everything a mafia man and his wife is going through. I personally loved this movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nikki-jane",
        "review_rating": "3",
        "review_title": "No way near as good as the first part",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "amaliloveyou-86064",
        "review_rating": "5",
        "review_title": "It's so bad it's good",
        "review_detailed_main": "Very funny movie, you can say whatever you want but the plot and the acting is so bad, it's hilarious.\n\nDefinitely entertaining, laughed my ass off, their facial expressions are gold.\n\nThe sex scenes were very cringy, but that's what made it funny."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ankitakratzel",
        "review_rating": "3",
        "review_title": "Fine",
        "review_detailed_main": "Lot of music story not good. It didn't actually continue the story.. we didn't even know exactly what happened at the tunnel. And others was also just music again and again."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "beridzenatia-49686",
        "review_rating": "2",
        "review_title": "Waste of time",
        "review_detailed_main": "This movie is the dumbest and senseless movie i've ever seen in my life.\n\nActing skills, dialogues, scenario - below zero.\n\nThe only scenes it has are sexy scenes. If you want to see porno, then ok, but don't wait any sense or deep idea here."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "vamkimzd",
        "review_rating": "1",
        "review_title": "This is a music video not a movie",
        "review_detailed_main": "This is the first time that I write a review about a movie.\n\nI saw this movie as a farce and it's TERRIBLE, absolutely TERRIBLE.\n\nIt's a constant music video with max 30' of dialogue."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "theInfamousPeppapy",
        "review_rating": "1",
        "review_title": "hard sheet",
        "review_detailed_main": "How is this so popular? Didn't they could ask for a mafias consultant or they didn't have money for a more mafias' centered movie or a thriller with a Stockholm syndrome abduction victim?\n\nIt is a plain excuse to make soft porn."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "asmithee23",
        "review_rating": "3",
        "review_title": "It's everything critics said the first one was",
        "review_detailed_main": "So, so disappointed. Massimo and Laura have a relationship based mostly on delusion, obsession and lust but seriously, there is so little dialog in this film, I wonder if the actors even had to learn lines. How can this film just gloss over the cliffhanger of the first film? Barely a mention. While the two leads are on fire with their chemistry, scene after scene after scene of Sox and more Sox gets really boring. Another thing that bugged me is how much of a beech Laura was. Snapping at Massimo for arranging a nice weekend away for you with your best friend? Telling Massimo at a party, in front of family and business associates, that you are done and demand to leave? He's a proud Italian mafioso. Very disrespectful to speak to him like that and also unwise. I've watched the first one easily 365 times, ha. See what I did there? But I've hardly watched this one. Maybe 15 times."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "foroughidorsa",
        "review_rating": "2",
        "review_title": "Funny af😂😂",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ezradejng",
        "review_rating": "10",
        "review_title": "Mann... that's what you call a GOOD plot twisy",
        "review_detailed_main": "You should watch de movie, it's simply amazing. I don't get all the critics... it started slow but the end is a mind-blower. MUST SEE MUST SEE MUST SEE MUST SEE!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "smatthews5880",
        "review_rating": "1",
        "review_title": "Sooooo much music!! Why?!?!?",
        "review_detailed_main": "This was absolutely terrible. The first one was a story with sex, this one is all sex with very minimal story. Laura is a bitch. She chose to marry Massimo but either treats him like a sex God or like he's a scumbag. She goes back and forth on playing a victim. There was so much music in this one it was almost unbearable. The only good thing was Michelle's acting. Quite a few scenes were ridiculous and cheesy."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Jackieeeee93",
        "review_rating": "2",
        "review_title": "I'm just confused",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "wojan-21657",
        "review_rating": "1",
        "review_title": "Fast forward",
        "review_detailed_main": "Reminds me worse version of story from Friends with Drake Ramoray, he's evil twin brother Hans, cursed diamond and Venezuela. But here we have Italy, adult boring story and mafia."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "costadaki",
        "review_rating": "1",
        "review_title": "TOTAL waste of time",
        "review_detailed_main": "I guess the actors didn't spend too much time learning their lines, as they are not many. They constantly show sex scenes and scenes with music, not enough talking. The lead actress was terrible at the first movie and yet she continues the same way in this one. Too bad i wasted my time watching it. The only oasis in this movie is Massimo's ass."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "romanaafrosepushpita",
        "review_rating": "1",
        "review_title": "TOTAL GARBAGE",
        "review_detailed_main": "A total waste of time. The worst and the most ridiculous movie I've ever seen in my life. No strong plot, no nothing. Couldn't give it a rating of less than 1, otherwise I would give it a zero outta 10."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "gargia",
        "review_rating": "3",
        "review_title": "SOS",
        "review_detailed_main": "What a waste of time! Artificial screenplay, only made to exploit the success of previous one. Such a boring and irrelevant plot.\n\nIt's agenda based movie without any attention paid to reasoning. Taking audience for a fool to fall for it."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "harshitchaudhary-66647",
        "review_rating": "1",
        "review_title": "Please it's my request don't make another remake of this movie.",
        "review_detailed_main": "This movie was disaster as we know from last movie so why Netflix wasted there money in this movie no one wants this movie. Like previous movie, this movie also has so many problematic scenes. Please Netflix leave making remake of this movie and invest your money on good movies. Please don't watch this movie by mistake."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "dolcee_andraa",
        "review_rating": "2",
        "review_title": "Worst than the book",
        "review_detailed_main": "I watched the first movie (thought was 7 of 10) and than read the book ( which was really interesting, more details, more sense, finished the book in 3 days) Now i bought the second book as i didn't had patience for the movie to come out.... The book was so boring ( maybe 3 out of 10), i forced myself yo read 60 pages out of the whole book as i though maybe maybe it nay get interesting, but nope, so i just gave up and put it away ( couldn't be bother to finish it)..... now i saw the second movie to (well i skip most of the movie) just to realise that is worst than the book What a waste of time, just some arrogant actors and bad acting."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jajacorbin",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Luv the simplicity of the movie yet it's still so captivating with such little dialogue. Brings you back to a time where the movie industry was just that simple beautiful art. No need of big budget and another green screen movie! Luv seeing the different angles of Poland and Italy actually makes me want to visit now. The chemistry between Laura & Massimo and Laura & Natcho is unquestionably so realistic they make you actually believe there's something there. Amazing acting!! With these big blockbuster Typical American movies that spend a fortune to make us believe what we see on the screen to the same typical American actors..... feels good to see something new something fresh."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Fruzsinaaa",
        "review_rating": "1",
        "review_title": "It felt like i was watching a 2 hours long music video..",
        "review_detailed_main": "They used too many songs for one movie, it really felt like a music video! They talked maybe for 5 min..and the acting, i don't even want to mention it.."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "skyforestsong",
        "review_rating": "1",
        "review_title": "Worst Movie I Have Ever Watched!!!",
        "review_detailed_main": "The first 30 min mainly the two characters enjoying some private time if you catch my drift. This movie is so full of adult scenes and montages than if you compile the entire script of the movie, it is about a page long. The first movie was utter crap but the second one is a dumpster fire."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Horrible...but is it IMDB Bottom 100 horrible?",
        "review_detailed_main": "I have an odd obsession in life...completing bad movie lists. Long ago, I was able to see all of the films featured in Harry Medved's brilliant book \"The 50 Worst Movies of All Time\"...and have gone on to complete or nearly complete a few other bad film lists. Apparently I am a glutton for punishment...and I'm adding \"365 Days: This Day\" to this infamous quest. Yes, I watched it because the film is supposed to be terrible...and right now it's on IMDB's Bottom 100 List...with an overall score a measly 2.5....placing it at #60. Interestingly, the film it's a sequel to, \"365 Days\", is also on IMDB's list...though with a score that's recently risen to 3.3, it's apparently better...but I really, really hated \"365 Days\"! It's not hard to guess what I will think of the sequel!\n\nThis film is Polish...the first Polish 'bad film' I've seen. And, for some reason, Netflix has chosen to buy it and market it here in the States...and subscribers apparently are not enchanted with the story!\n\nThe first film had a very sick premise....a mobster kidneaps a woman and he expects her to eventually fall in love with him. And, amazingly, she does...which sends so many inappropriate and weird messages to men and women! Here in the sequel, it begins with the same pair of weirdo lovers tying the knot...but, not surprisingly, problems are on the horizon.\n\nLike the previous film, this one plays much like a porno film where they edited out much of the nudity. Now I am NOT saying it's a PG-13 or R film...so it's still amazingly explicit...especially for Netflix. So what the film emphasizes is a dopey plot more than nudity...which I am sure is the reason most folks watch porn anyway...those great and realistic plots.\n\nSo is it any good? Of course not. While the film looks nice and was filmed in many lovely locations, the story is pretty dumb. Plus, WHO wants to be rooting for a mobster and his kinky new wife?! That's a pretty hard sell!\n\nThat being said, while the film is offensive (again, the wife was kidnapped and made a sex slave....eventually a very willing and frisky one!) and dumb, I don't think it's among the 100 worst films ever made...nor close to it. Technically speaking, at times the film appears to be well made despite the many deficiencies of the writing and silly acting and plot."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "bvtxmvn",
        "review_rating": "1",
        "review_title": "Guys night",
        "review_detailed_main": "This is the perfect film for those long awaited weekends with the boys. You got boobs, you got ass, you got boobs. Everything a man needs. Pop out a cold one, lay back and laugh. Certified hood classic."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Rossis90",
        "review_rating": "5",
        "review_title": "Good actors!",
        "review_detailed_main": "...but i'm wondering how its pissible to have bodygards everywhere and somehow Nacho came from nowhere and say hi, im your gadener :D..........................................."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "melxray-50163",
        "review_rating": "1",
        "review_title": "Awful, just awful",
        "review_detailed_main": "I liked the first one and was looking forward to the sequel. What a disappointment. It's 75% soft porn, 15% music video and 10% storyline.\n\nI gave it 1 star for the beautiful scenery."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "iliana-08203",
        "review_rating": "1",
        "review_title": "Absolutely laughable!",
        "review_detailed_main": "Poor acting horrible scenario! Worst romantic film ever which I have been seen! Usually the Italian knows how to make really good film with excellent actors the polish of another hand never had a good film n their history that's why may be everything in this film is about up Sind down 😂😂😂!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "connibirkenhauer",
        "review_rating": "1",
        "review_title": "AWFUL",
        "review_detailed_main": "Like a music video and porn in one. AWFUL! They have a talking time of 3 minutes TOPS. Absolutely cringe. I got second hand embarrassment the whole time. Also the movie was way too dark to watch. Bad storytime, ending and honestly acting too. No real connection to the first one. No explanation at all. Doesn't make sense at all. Nice locations tho."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cyaramichaels",
        "review_rating": "10",
        "review_title": "Even better...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "prasangaperfect",
        "review_rating": "1",
        "review_title": "Kurwaaaaa!",
        "review_detailed_main": "Kurwaaaaaa! This is the worst movie of all time! Just a cheap porn movie underlined with useless music to make it look more asthetic. No real storyline. Waste of time!\n\nDidnt expect much after seeing the first movie but still managed to be disappointed.\n\nIMDB: 00/10."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "michakurvers",
        "review_rating": "1",
        "review_title": "Why is it even on netflix?",
        "review_detailed_main": "It is utterly garbage. There seems to be no plot, only soft-porn scenes.\n\nI do recommend watching this as a challenge. I lasted only 16 minutes, before I turned it off.\n\nHow long can you watch this garbage?"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ravi-jalani",
        "review_rating": "1",
        "review_title": "Horrible. Terrible. Awful.",
        "review_detailed_main": "This is the worst movie I have seen and I am sure there will not be a movie worst than this. Save your time and avoid this. I am short of words to describe this wonderful movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jennifer_kistruga",
        "review_rating": "1",
        "review_title": "I was totally lost in the movie",
        "review_detailed_main": "First, what beginning was that? She almost died in the previous movie and no one talked about it? The movie is almost p0rn. No dialogues, same facial expressions. It looks like it was written by a girl in puberty."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "bernaproduktion",
        "review_rating": "2",
        "review_title": "HAHAHAHAA!!",
        "review_detailed_main": "I know it's not a comedy but i couldn't help but to laugh out loud serveral times at the cringy, badly written script and acting. The almost Non -existing story is covered with alot of sexual content and also sexualises narcissistic behaviour . Is it good? No.. But to the point. Is it entertaining? Well, depending on who you are and what you need. Sure!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "arielsiere",
        "review_rating": "3",
        "review_title": "Even more disgusting",
        "review_detailed_main": "I would say that this movie is one of the worst movies from 2022 and i think this sequel feels so unnecessary and only made for cash good thing i never watched this movie or else it would be wasting my time and the worst thing is that is going to have a 3rd movie which is gonna suck and i hope this movie gets removed from Netflix and replaced with something better."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "memokeke",
        "review_rating": "1",
        "review_title": "Netflix, Italy and Poland should apologize for this",
        "review_detailed_main": "This movie is so bad, it makes the first one looks like an Oscar worthy. Evil coked out brother, sexy gardener, terrible action and tons of sex with random R&B songs. I guess Netflix doesn't care at all.\n\nInstead of watching this go watch p.rn. I'm hundred percent sure you will enjoy more and get a better plot.\n\nWorst movie ever."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "doublecheesequarterpounder",
        "review_rating": "1",
        "review_title": "This movie is a joke😃...",
        "review_detailed_main": "This movie has got to be the most cringiest and horrible film I have ever saw. It's very confusing, they don't explain anything and there's very little talking. Nothing about this movie is realistic.. not to mention, the soundtrack absolutely sucks. And the end??? Most likely will be a third. Overall, this movie seems like it was rushed."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "forclothes",
        "review_rating": "10",
        "review_title": "I love it",
        "review_detailed_main": "I love this franchise, I love films like this and fifty shades. It's a hate or love film really. Not much of a story line but you fall in love with the characters relationship so you end you watching it all over and over, or at least I did.\n\nThe more I watch it the more I love it.\n\nIf you can accept the lack of a proper story line in the first half then it's worth a watch."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kwizeraelvis",
        "review_rating": "1",
        "review_title": "What in the heavens did I just watch?",
        "review_detailed_main": "The first movie was actually decent and setup a nice storyline. Now comes the sequel and the only question I could ask myself was how, who, why would anyone in their right mind allow such a monstrosity to even exist.\n\nAnd whats up with all the s*x like the movie was 80% s*x scenes, 19.9% scenery and good camera angles, 0.1% actual story and dialogue."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mlwnsf-259-903508",
        "review_rating": "4",
        "review_title": "Disappointing 😒",
        "review_detailed_main": "Beautiful locations, Beautiful clothes, beautiful people but what a sad cliché of a film... Watch for yourself if you can make it through, I turned it off and went to bed."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "DawsonLiri",
        "review_rating": "1",
        "review_title": "I saw some porn movies with a better script than this",
        "review_detailed_main": "Seriously nothing in this film make any sense, the scene they haven't any connection between them, line are few (fortunally) and make no impact on the rest of the movie.\n\nReally I can't made my mind about it, the first chapter was bad but in the end some script was written, for this one they haven't even try.\n\nI really hope some day IMDB introduce zero as a rating, because when they're gonna do it this is the first movie I'm gonna use it on..."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "moodsucces",
        "review_rating": "2",
        "review_title": "Not good",
        "review_detailed_main": "Oh my god the story is even more blurry than the first sequel. I gave two stars because I still appreciate the hard work of the film crew. I don't know what other people think. But this is my personal opinion."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "olga-lunina",
        "review_rating": "1",
        "review_title": "Beautifully shot.....GUESS themed Netflix porn :/",
        "review_detailed_main": "Honestly, the movie is lacking the storyline. Too many songs, no theme music. Hideous blond wig, too many unnecessary close ups (this is not a GUESS ad). I mean....it's bad. Glad, most actors were acting well, but why hire models? *facepalm*. You either make a movie or porn. No connection between the scenes.meh...it's worse than the first movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kqdpgrxpm",
        "review_rating": "1",
        "review_title": "MASSIMO",
        "review_detailed_main": "Right let me be honest, I RUSHED back mainly to watch Massimo! Well after the first movie I bought a personalised love island suitcase with my future planned out, I was moving to Sicily to find my very own Massimo and live a life like my name was Laura, (I should've written the sequel because I had more imagination then the writer herself), so that was my plan before I get too old and have no chance of meeting Massimo and probably get a Mario instead........ speaking of Mario he was the best part of part two....... He wasn't in it! That's my point he made a wise choice! I'm angry that I am actually writing a negative review because I feel I'm cheating on Massimo BUT come on this was bad like really bad! There was no acting, no story line, no talking or anything for the first hour perhaps???? It was tacky! And a waste of beautiful looking actors, scenery, properties and cars it just wasn't a film! I think the writer just got lucky with good looking actors, it was an extended model photo shoot end of there was just nothing, nothing! I'm annoyed like really annoyed. A honeymoon whereby they didn't talk just a few outfit changes and a few 15 second clips, no actual relationship just sex! And then when I finally heard some speaking I checked and only had 15 minutes of the film left! I thought there was a mistake on my Netflix account I was about to log out and sign back in or cancel the whole subscription! I hate knocking people down but the writer failed massively!!!!! I still want my own Massimo though ......... wishful thinking but yeah I'm sad after watching that, I felt like I needed to look over my shoulder and see if anyone actually saw me watching it because it was so bad!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "gkpzhfn",
        "review_rating": "2",
        "review_title": "Made an IMDb account after 7 years. Just for this!",
        "review_detailed_main": "I've been using IMDb for years. This movie finally pushed me to make an account just so I can review how utterly terrible it was. Don't get me wrong I wasn't expecting, an award winning story line. But I had no idea it could worse than the first one. They really outdid themselves there TERRIBLE MOVIE. But I only watched it to see sex and Massimo naked, and that they did not disappoint with."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "aurakzai_ali",
        "review_rating": "1",
        "review_title": "What did I just watch",
        "review_detailed_main": "Not really sure what I just watched tbh. More confused now then when I started. Didn't she get kidnap or die at the end of the first movie?. What a waste of time."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "wilmabergfeldt",
        "review_rating": "9",
        "review_title": "Love but something was missing",
        "review_detailed_main": "Going in to this movie a was so excited because I loved the first movie and the book. But I was also terrified because a knew that Nacho was in this movie and I love Massimo and Laura together. But after finally seeing this film something feel flat. Don't get me wrong the steamy moment was incredible hot but there was no story in the first part of the movie. Only sex scenes with music behind it and when they where having a moment like the wedding or when they talked shortly in bed it got quickly interrupted by music or something else. The only story was when Nacho came in to the picture and that was the part I wasn't really interested in. I did love this movie in one way and one way only because I got some not much but some glimpses of Massimo and Laura together."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ddaqqvas",
        "review_rating": "2",
        "review_title": "Did I wake up in the '80's??",
        "review_detailed_main": "I watched the first one, and yes, it was awful, but in that kinda good way, ya know? A healthy dose of T&A is always a plus for schlock like this and the first one had some pretty good tension built up between Laura and Mossimo right up until she surrenders to her own desires and they finally get it on. The sequel, however, had me feeling like I did as a kid in the '80's and into the '90's when sequels as a rule, with a few notable exceptions, were consistently inferior films.\n\nAnd this was a god-awful meets dumpster fire in ways previously unexplored. I mean, at least they stopped after crap sequels like \"Jewel Of the Nile,\" or \"Weekend At Bernie's II,\" but these guys are likely going to go on to \"Crocodile Dundee in LA,\" or even \"Robocop 3\" infamy.\n\nI'm giving this 2 stars because I did enjoy the soundtrack as much as the first and because, as many have referred to this as a \"guilty pleasure,\" I'll likely succumb to curiosity and watch dumpster fire part III like Cersei walking through Kings' Landing ... ((ding) Shame ... (ding) Shame ... (ding) Shame ... )"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "indrajeetgugliya",
        "review_rating": "2",
        "review_title": "CRINGE",
        "review_detailed_main": "Thank God the hot scenes ended before the story started. A question for story writer: what were you thinking or were you even thinking ? Massimo is not at fault for story but for acting. But I guess story was so bad that Michele would have been thinking what could he do."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "michelleyadav",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Fair enough sex sells, but that's all this movie seems to have. 365 days Porn ! And coupled with the terrible acting / overacting and utter nonsensical dialogues, this was an excruciating watch with an absolute effortless concept of a storyline."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "danasm-41844",
        "review_rating": "1",
        "review_title": "The only good thing in this movie are the music and Massimo acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "niushaparsa",
        "review_rating": "5",
        "review_title": "I am literally disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "reginatx-60627",
        "review_rating": "5",
        "review_title": "What did you expect?",
        "review_detailed_main": "Come on with all the negative reviews. We're not watching this for Oscar winning performances.\n\nThe scenery is amazing.\n\nMusic is fantastic!\n\nThrow in some hot men for eye candy.\n\nIt's entertainment.\n\nI will agree the first half was slow and I was wondering where the storyline was.... But then it finally kicked in.\n\nHad the first half been better, I would have like it more.\n\nThey have made no secret of what type of movie it is. Why are you watching it expecting some great acting? We all knew from the first one what to expect. Yes, there is some horrible and sometimes comically bad acting, but that was expected.\n\nFrom the ending, we know there is a part 3.\n\nYes I will watch it and have the same opinions.\n\nStop complaining and just enjoy it.\n\nIt's a movie folks. Not a documentary."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "elahehiranparast",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Don't waste your time.\n\nThe worst movie I've seen and I wouldn't recommend it at all.\n\nWhat is it?!?!\n\nEven the first one was awful. What made you think that the first one was successful to make the second one. The second one is even worst.\n\nFrom the beginning to the end."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "nadkarnisumeet",
        "review_rating": "5",
        "review_title": "Better than Part One.",
        "review_detailed_main": "365 Days This Day (Netflix) review :\n\nA direct sequel to the Polish erotic drama 365 Days (2020); 365 days This Day released on Netflix early last week and like its predecessor, has been trending in their top ten ever since. I had reviewed the first part as well and so, here we go with my take on the latest one.\n\nFirst the plot : Don Massimo (Michele Morrone) and Laura ( Anna-Maria Sieklucka) get wedded and go for their honeymoon to continue what they did all through the first part. After all kinds of kinky sex, Laura discovers that Massimo is cheating on her and runs away with her gardener (Simone Sussina) whom she develops a crush on...\n\nTo be fair, This Day has a semblance of a plot unlike the original which was just an apology to portray continuous love making scenes. Here, the prime characters like Laura are developed a wee bit even as the sex scenes keep popping up frequently either in reality or a wet dream!! The climax is again kept open ended hinting at a further sequel which I believe is in the making..\n\nOf the cast, Anna-Maria shows improvement from before but the same can't be said for her co-actor Michele. Overall, 365 Days : This Day can be tried by those who have seen the first part though it is not something I would wholeheartedly recommend.\n\nStrictly adults viewing please!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "injaaslanna",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "After watching this great movie I was just surprised how fantastic can a movie be Nice actors with great acting All in all , the best movie I'd ever seen."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "robertw-08205",
        "review_rating": "5",
        "review_title": "it has such promise",
        "review_detailed_main": "They need to hire an American film Director and probably producers. 50 shades darker James Foley would be a good start. There is too much music not enough dialogue. Plot is fine the acting is good."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "barbarasacarvalhor",
        "review_rating": "1",
        "review_title": "It's the worst movie ever made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tausiffaraj-26586",
        "review_rating": "5",
        "review_title": "Not worth it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ashleyayala-58294",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tyalred-91122",
        "review_rating": "1",
        "review_title": "Netflix will fund anything...",
        "review_detailed_main": "The plot of the film was basically none existent throughout the film. The acting was terrible, the dialogue was terrible. Repeated use of the same camera shots throughout the film.\n\nThe fact that there was music playing for 1 hour and 49 minutes (the whole run time) of the film made it feel like I was watching a never ending music video.\n\nThe dialogue made it seem like a 11 year old child imagined how adults would talk to each other if they were in a relationship, with some of the cringiest lines ever uttered by an actor in any film.\n\nThe script must have been 2 pages long with 1 page purely dedicated to the sex scenes and the other 1 page dedicated to the actual dialogue.\n\nMy only question is how on earth did Netflix think that funding this was a good idea? I mean it's no secret that they're heavily in debt. I'm guessing using expensive sets and expensive cars won't exactly be a great idea for them... especially when funding such a ridiculous project. I'd be very interested to see how the sequel pitch went as well as what on earth anyone was thinking when deciding to find this mess of a movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "marijap-83092",
        "review_rating": "1",
        "review_title": "DISASTER",
        "review_detailed_main": "I thought this movie would be good, like it was interesting BUT JESUS CHRIST NE KIDA UOPSTE UZAAAAAAAAAS YOU SHOULD BE ASHAMED\n\nD I S A S T ER DO NOT WATCH DISSAPOINTMENT WASTE OF TIME I COULD BE DRUNK RIGHT NOW AND I DIDNT BECAUSE I WATCHED THIS STUPID MOVIE OCAJ BRE STRASNO :P."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "danaeriley",
        "review_rating": "4",
        "review_title": "Not necessarily a disaster",
        "review_detailed_main": "Most of these reviews seem like this is the worst thing they have seen..... you mean to tell me that this is worse than movies like Bucky Larson or the ultra famous bombs like The Room or Trolls 2?? I mean it's no masterpiece for sure & quite boring but at least there are features that make this film different from some low budget film. (The filming style, locations of filming, etc.) There also isn't a lot of dialogue which is frustrating, IF you would like to follow along. A lot of these reviews are over exaggerated. I can name 5 films off the top of my head that are WAY worse ( Superbabies 2, anyone?) Anyway, if ur looking for hot people with minimal clothing or background noise, dont overcomplicate things. If you dont like a movie within the first 30 mins, just turn it off."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "meaow-49125",
        "review_rating": "2",
        "review_title": "Not recommended -_-",
        "review_detailed_main": "This was a two hour long TikTok video with a huge budget.\n\nI got annoyed because it felt more like a soft porn musical rather than an actual movie. I regretted playing it and I was constantly checking how many minutes are left because i can't leave a movie mid way, no matter how bad it is.. ToT\n\nJust gonna rate it 2 for the shoot locations as they were absolutely gorgeous, otherwise there was nothing else to watch :("
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kelstubrod",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Im sorry but i loved it!. So many twists. I was hooked the whole time. My emotions where everywhere.\n\nSuspense at the end. Wonder if there will be a number 3........."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "annanoiman",
        "review_rating": "1",
        "review_title": "Don't waste your time.",
        "review_detailed_main": "A collection of glorified ads for vibrators, in a movie length clip.\n\nThere is almost no story. I recommend just skipping the first 50 minutes, to get to anything close to an actual plot. But again, that's fleeting.\n\nIt makes the fifty shades movies look like a cinematic masterpiece!\n\nThere's so much disconnect with the characters and cringe in SO MANY moments. I wanted to gouge my eyes out."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "stormriderrx",
        "review_rating": "1",
        "review_title": "What the hell",
        "review_detailed_main": "This movie surprised me at every step by how bad it can be. I know that you don't watch it for the plot, but God there is more emotion in the average porn movie from the internet."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "xafogo-38611",
        "review_rating": "2",
        "review_title": "Insanely bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Hleer",
        "review_rating": "4",
        "review_title": "Well yes, it is BAD. But I can't wait for #3.",
        "review_detailed_main": "In some parts, they're not even trying, it seems. The first one was already a cringefest, but this one definitely tops that. At least the \"baby girl\" isn't there all that much.\n\nBut oh who cares. I can't wait for the third one. It's great fun to watch. The ending was...I have no idea what they tried to do there. Half decent I guess?"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "Carlos_956",
        "review_rating": "2",
        "review_title": "Terrible.",
        "review_detailed_main": "The whole movie was a bunch of montage scenes. There was very little actual dialogue. The acting and the storyline were terrible. I get that this movie is not meant to be a hollywood blockbuster, but come on...we actually found much more entertainment counting and keeping track of the montage scenes throughout the movie than the actual movie itself. What a shame. The first one wasn't mind blowing either, but at least it had a bit more promise. Part 2 killed any and all hope for part 3."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "sophie_burgos",
        "review_rating": "1",
        "review_title": "Just bad!!!",
        "review_detailed_main": "Let's start with the acting, just absolutely disappointing performance. The overload of sexual content is a waste when the acting is so horrible. Waste of time."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mikkamia",
        "review_rating": "1",
        "review_title": "Just so bad!!!",
        "review_detailed_main": "Do they not have enough money to get a half decent writer and director?? And the acting.... Why does everyone have a grumpy face on the whole time? This movie really makes me appreciate good movies out there. This movie officially beat The Room. At least The Room is funny and I would watch it again."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "snailmaillove",
        "review_rating": "3",
        "review_title": "We tried to make it a 50 shades, but with even worse acting and \"script\"",
        "review_detailed_main": "I'm giving it 3 stars just because it kept me busy.\n\nThere is almost no dialogue.\n\n\nActing is horrible.\n\n\nWhatever story there is, it makes no sense. I'm not even sure there really is a \"script\".\n\n\n\n\n50 shades was bad, but this is an entirely different category of bad.\n\nThe outdoor scenery is nice, but that's the only nice thing I can say about it."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "murchg3",
        "review_rating": "10",
        "review_title": "Was a good movie",
        "review_detailed_main": "So of course it's got going to be better than the first!! Everyone has there own opinions. I acted really liked this movie!! Way better than the 50th shades ."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "vessybang",
        "review_rating": "1",
        "review_title": "What did I just watched???",
        "review_detailed_main": "Ok, I understand that this is erotic movie, but I expected at least to have some plot and something to catch you and make you watch...but nothing else than sex sex sex and more sex...the only reason I wasted 2 hours of my day was because of the big noise and that I already watched the first part and was kind of curious. But seriously what a garbage!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "dayzmaa",
        "review_rating": "4",
        "review_title": "What a cheap sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tmalhassan",
        "review_rating": "2",
        "review_title": "I am nice for giving it 2 stars.",
        "review_detailed_main": "Literally a 10 minutes movie stretched into 2 hours. Lost count how many times I fell asleep. And this is coming from a person that liked the first one. Terrible acting and a stupid story. Just absolute garbage."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "gdraper-99424",
        "review_rating": "4",
        "review_title": "Meh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "gmijlai",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen",
        "review_detailed_main": "I can only imagine this movie's author watching 50 shades while riding down on a paper lines (but way worse than 50 shades).\n\nIt has no plot, I have no idea what's going on in this movie and it's all porn.\n\nIt was 100% better if they let the cast speak ONLY italian or cast american actors. Their accent make everything worse and some of they sound like they are just reading the lines while filming.\n\nI really don't understand why the author didn't get any help from others while writing those stupid lines, I do really feel bad for her since everyone hates this movie.\n\nOne more thing: too many songs."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "365 Days: This Day",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "gbemihsolaifeoluwa",
        "review_rating": "1",
        "review_title": "Annoyingly terrible",
        "review_detailed_main": "They should have rest their case with just the first part. This part 2 is terrible, bad plot. It should have just been tagged as 365days of sex. Because that is all what the 2nd part is about."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "usamaalsaher-34418",
        "review_rating": "1",
        "review_title": "Typical Netflix garbage.",
        "review_detailed_main": "Nothing but Sex and nudity. Wished there is an option to give it 0 stars. No story, trash acting and very bad execution. I litrey watched this movie with no Idea what it was and once I watched came here and though it was just me felt confused after watching and wasting my time on it."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tamarabubalo",
        "review_rating": "10",
        "review_title": "A movie that",
        "review_detailed_main": "A find it fascinating that there is always so much hate on the populair and \"feel good\" movies. Movies don't have to be always that serious. It's the feeling you get from them. This movie really brings you somewhere else and makes you forget about everything. It's heaven for your eyes. The scenery is outstanding, the actors are handsome and the story is catchy. Loved the first movie but the second is even better! Also, absolutely love the second handsome gent in it!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "marchedon_rebecarahela",
        "review_rating": "1",
        "review_title": "Super cringe",
        "review_detailed_main": "Is so bad....the action is super cringe and is based only on sex and bad relations. Personally I don't like. I was not able to see more than 20 min. And it felt so so cringe."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "sarahaharrell",
        "review_rating": "2",
        "review_title": "Pornographic Nonsense",
        "review_detailed_main": "The best way to describe this movie... It's like the Walmart brand knock-off of 50 Shades of Grey, except with even less of a plot and a considerably bad ending.\n\nThere are plenty of (vanilla) soft-core porn movies and shows that you can stream that won't feel like an such an epic waste of your time. The first movie is a \"to be continued\" and this second movie didn't even follow that storyline. They just skipped over the whole kidnapping her pregnant situation with some side-bar comments about when it happened?\n\nThe only positive about this movie is how Gorgeous Anna-Marie Sieklucka is.\n\nOverall rate it 2/10, I would not recommend. They shouldn't have made a second one."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mieriks",
        "review_rating": "2",
        "review_title": "A movie or a music video?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ricardomudinyane",
        "review_rating": "1",
        "review_title": "I am even out of words.",
        "review_detailed_main": "It's really just a long music video with a lot of sex scenes. This was just promotions for some songs. The acting is great but it's very short. They talk for like 3 minutes and then have sex each and everything time, I don't know what kind of target group this movie is for but I do not understand."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "r96sk",
        "review_rating": "3",
        "review_title": "At least it marginally improves upon the film it follows",
        "review_detailed_main": "Undoubtedly still awful viewing, but... I found it a tiny bit more watchable than its predecessor.\n\n'365 Days: This Day' still has nothing that even closely resembles a plot, still has extremely limited actors and still shouldn't even exist. However, I'd be lying if I said I disliked it as much as the 2020 original. It's almost like taking out the sexual violence actually makes it more digestable, who'd a thunk it?!\n\nUnlike that other release, this falls into the more common category of just simply being rubbish. I will say, though, the music kinda slaps. The film is pretty much comprised of a series of sexual music videos placed back-to-back-to-back. Some of music used is well chosen I can't deny, I Shazam'd a couple... admittedly that probably says more about my taste in music than anything else!\n\nThere's even some minor neat cinematography, too. The positives I note are minimal, though, and don't overly help this 2022 production. I have more negatives, which also include an overlong run time and that shoddy ending. At least it marginally improves upon the film it follows, I wonder if its own sequel will do likewise? I plan to find out!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "findep",
        "review_rating": "1",
        "review_title": "Worst movie I've ever watched",
        "review_detailed_main": "Create IMDB account just for this review.\n\nWatched the first one, it was bad.\n\nBut the sequel is the worst, no plot, no chemistry between the two leads, non-stop and boring sex scenes, clueless dialogues, cringy acting, non-stop and annoying soundtrack. Stopped watching after just 20 mins into this movie.\n\nI wonder wouldn't the actors/actresses laugh at their ownselves.\n\nDefinitely the worst movie I've ever watched.\n\nWould have given zero star if there is.\n\nIf you want a good laugh, go ahead, otherwise avoid this at all cost."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "asinatkhurshid",
        "review_rating": "1",
        "review_title": "Really!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kis-szabo-timea",
        "review_rating": "5",
        "review_title": "Steaming hot sex scenes",
        "review_detailed_main": "Plot is flatter than in the first movie, but the sex scenes are even hotter!\n\nI think if you are looking for a well written story you shouldn't watch this movie, it's definitely not for you. Stupid conversations, cringy acting and so on... everyone should look at this title as an erotic film, nothing more. If you're not interested in that sort of stuff, no problem, don't watch it.\n\nBut if you like to see some hot sex scenes, go for this movie! All actors are good looking and the sex scenes are very realistic. Although the overall acting is not the highlight of this film, the sex scenes are always on point. If someone told me that the actors really had sex there, I would totally buy it."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "therealwaclaw",
        "review_rating": "10",
        "review_title": "One of the best movies in this genre",
        "review_detailed_main": "Very nice image quality, beautiful landscape footages. The plot is simplified just to don't distract the viewer from idealized image of romantic relationships of main character with \"ideal man\", who is actually the collective image created by modern society and pop culture. The erotic scenes were captured without po*n like stamps, but with true romantic atmosphere and not standard style of cameraman. If you like that oversaturated, fictional, idealized genre - just watch and relax."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jhenellethompson",
        "review_rating": "1",
        "review_title": "No plot.",
        "review_detailed_main": "I watched this show in less than 5 mins, there's absolutely no plot, absolutely no romance just humfing, nothing nice, nothing enjoyable, nothing worthwhile and absolutely nothing to see. They had one minor issue that they blew out of proportion. I hope there's not a fourth movie. It was terrible and Laura's character was horrible. The writer did this movie no justice. So sorry for the main stars."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mbhull",
        "review_rating": "1",
        "review_title": "Worst sleepover movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "pop_catalin",
        "review_rating": "1",
        "review_title": "Total disaster",
        "review_detailed_main": "To be honest? A low budget adult movie from the 80s looks like a masterpiece compared to this. Few good songs on the soundtrack and (maybe?) some good sex scenes, but otherwise... man, what a poor, poor movie! The storyline - junk (almost none, actually)! The acting - amateurs could do better! Overall, 1/10 is the perfect rating for this one. I wasted my time so you don't have to waste yours."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "helenlambert-28180",
        "review_rating": "3",
        "review_title": "So disappointed",
        "review_detailed_main": "Can't describe how disappointed I am. Liked the first one even though it was practically porn but at least it had a decent, original storyline. This... no storyline at all. Literally waited through the first hour and, apart from the obvious, which is now very tedious and blasted with music, nothing happened. No reference to the tunnel until the end, which still didn't explain things. I'll watch the 3rd just to close this chapter but I'm not looking forward to it!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lizxypopcornkid",
        "review_rating": "1",
        "review_title": "I don't know what's worse",
        "review_detailed_main": "I don't know what's worse The acting the script or the music.\n\nThe film as a whole is just bad Instead of lady Gaga quoting \"no sleep bus club another club another club plane next place\" This film can be seen as quite similar Sex scene , bad music montage, characters creating drama for no reason or talking, another sex scene , bad music , massimo talking quietly or getting angry , sex scene , bad music, sex scene.\n\nYh it's worse than bad !"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "klikzg",
        "review_rating": "5",
        "review_title": "European \"50 shades of Grey\" continues",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ernestas2",
        "review_rating": "2",
        "review_title": "So terrible but you must watch it",
        "review_detailed_main": "Its got to the point where the movie is so awful you just have to watch and witness the awful acting and cheesy lines. What truly baffles me is the amount of money it cost to make these movies, the scenery and filming/editing is amazing. The actors really dont give off the vibes that they are supposed to. Massimo, as much as he is good looking, tattoos etc, he just does not give off that mafioso vibe. His girlfriend is just...so annoying! Not sure if anyone else felt the same but I really couldnt stand her character. I cant wait to see if they can go any cheesier with the next one as each movies is worse than the last one."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "chelseajmbelehar",
        "review_rating": "5",
        "review_title": "Okay",
        "review_detailed_main": "The story is good with the twist but that's about it. There was so much pop music it was hard to notice anything else. The story was good with the obvious issues that were foreseen in the first movie but that's not a bad thing. The character relationships weren't really brought deeper except for Laura and Olga. The twist was good for the story but the character wasn't on screen enough to get a real feel of how we should feel towards them. Adding in a new got guy just made it messier. Though I can see how they meant to use it but it fell way flat for me.\n\nOver all I hope the third movie can be more like the original."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "amirtatalooiyuiiii",
        "review_rating": "10",
        "review_title": "GOOD MOVIE REALLY BUT DON'T HAVE viewer im rel really be sad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "koukiscarletta",
        "review_rating": "1",
        "review_title": "Waste of time.",
        "review_detailed_main": "The story is so stupide, a lot of cringe, the scenes were so silly.\n\nLaura's acting was so cringe, the dialogue was also so stupid.\n\nBasically the author was obsessed about italian mafia but has no idea about them, it's looks like a teenage story with a lot of sex scenes and CRINGE again.\n\nA very bad movie, with bad direction and acting and a silly story."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "offthescale",
        "review_rating": "3",
        "review_title": "No Tension- Only S*x and Partying",
        "review_detailed_main": "The movie is all s*x and partying! No tension whatsoever. The first one kept you on your toes, even though it was completely unrealistic and unacceptable for something like that to happen in real life. This new movie was like watching someone's fancy life without anything happening.\n\nEven Laura kept talking about how bored she was the entire movie.\n\nWhoever made the movie better be seeing these reviews and fixing the plot for the next book!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "simona_genadieva-25850",
        "review_rating": "3",
        "review_title": "Meh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "harbisaleh",
        "review_rating": "1",
        "review_title": "*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "leviathan-1922",
        "review_rating": "5",
        "review_title": "Finally the Female Gaze and Emotional Intimacy !",
        "review_detailed_main": "My initial thought after watching this film was: \"This was directed primarily by a woman.\" It was so much better than the first ! Why this one has the lowest ratings is beyond my comprehension. The \"music video\" cinematography is perhaps the weakest aspect. There was probably only a page of dialogue for all characters combined, lol. However, the film almost completely rids of the male gaze and toxic masculinity undertones. You can tell this film was primarily directed by a woman. The camera shots on Laura's pleasure were clear. It focuses on her experience, not Massimo's. There wasn't a single BJ scene ! Also, it shows a bit more chemistry between Laura and Massimo. She is laughing and smiling with him. We even get a small, but significant smile from Massimo. Additionally, it shows Laura and her friend Olga having fun at fancy restaurants and clubs ! This is good ! The writers finally realised that women like buildup and emotional intimacy.\n\nNacho brings some more conflict and plot to the film. However, he's not a bad guy at all. He is more emotional than Massimo. Which is why I am #TeamNacho. His name may be ridiculous, but he is gentle and compassionate, unlike Massimo.\n\nBesides the excessive use of music and the cheesy film archetypes (love triangle, evil twin, etc.), this film was decent. I was not uncomfortable in any of the scenes. My rating was 5/10 because it is not a quality film in a general sense. You cannot take it seriously. It was entertaining, not rape-y, and showed more emotional buildup than its unfortunate predecessor."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "deedoo19",
        "review_rating": "1",
        "review_title": "If there was an Oscar for the worst movie ever, this would win",
        "review_detailed_main": "Okay, I'm here because I watched the first film. It wasn't great, but it had its plus points - a bit of sexual tension, some pretty hot scenes and a bit of a storyline. But I think the writers and producers of this follow-on made the mistake of thinking the only reason people watched the first (and hence the second) was for sex. Newsflash - we're in 2022, we can get soft (or hard) porn any day of the week. If we're watching a film, we also expect a bit of a storyline to go with it.\n\nThis film is so full of (bad) soundtracks and (cliched) montages, it looks like a naff 80s pop video. I think there are about 4 songs in the first 17 minutes of this film alone. It's sex for the sake of sex, and because all the plotline and tension has been lost, it's about as erotic as watching two gibbons mate at Whipsnade. Also, the way those two kiss is quite disgusting - the face-licking and open-mouthed salivating. The two main actors actually become incredibly unattractive.\n\nThe 'plot', for what its worth (when it gets going) doesn't really mean much. The acting is either wooden or OTT (the 'baddies' are like parodies of baddies). And let's not even start on how bad the English language parts are. Now I know that, in real life, non native speakers of English will muddle tenses etc, and that's charming and perfectly acceptable. But in a film, it's grating to hear someone say, for example, 'You've got to take responsibility of your own life' rather than for your own life. Maybe this scripting was intentional. But it just feels amateur when, in reality, many people who speak English as a second language can do so fluently. It was just one more thing, on top of the lousy acting, that's going to jar with an audience, as it makes the scriptwriting values look as shoddy as the rest of it.\n\nAll in all, I'd say to give this film a miss, even if you liked/loved the first one. If you watch it, you WILL be disappointed."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kumar_delish",
        "review_rating": "4",
        "review_title": "Erotic movie",
        "review_detailed_main": "365 sex movie lot of sex scenes story is not strong sex is so strong Anna looks great sexy One time watchable naa If u have lot of free time noting to watch if u have gf or partner watch it with her i have enough mood to do erotic.. Nothing special in the movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "laurasmith-01454",
        "review_rating": "1",
        "review_title": "Words cannot describe how bad this is",
        "review_detailed_main": "Porn movie mixed with instagram like shots of wannabes. It makes me want to cancel my Netflix.\n\nThe acting is poorly, the script is as bad, there isn't one good thing to be said about this movie. It's so bad it made me leave the first review on imdb."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mddd-72858",
        "review_rating": "10",
        "review_title": "It was good",
        "review_detailed_main": "Never watched a movie with this much sex. I thought it was good. Why is there so much hate for this movie? It was simple. You didnt have to think much. Which I enjoyed. I would watch the next one."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "diageoghi",
        "review_rating": "1",
        "review_title": "No! No! No! No!",
        "review_detailed_main": "If we call this thing a movie, then we would offend every movie that was ever made.\n\nI believe that the only reason some s...t like this end up being released is to be bad enough in order to get publicity and become known worldwide. As long as there is no \"bad publicity\", we have 365 days 2. And a third one will come.\n\nWatch something else. A video on youtube. Read a bad book. Whatever you like. But stay away from this.... whatever you like to call it. Except from a \"movie\"."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "wnrycszj",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "First 20mins I kept skipping its either just sexy scenes of soundtrack 🙄 I didn't waste my time finishing the movie. Its simply a waste of time. Its one of the worst movies I have seen."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "i_have_issues",
        "review_rating": "4",
        "review_title": "I liked the first movie",
        "review_detailed_main": "I generally liked the first movie but this one, wow, the acting was terrible. Scenes that required some emotion were monotone, massimo gave one good emotional scene but that was it. I ended up turning it off not even half way because I'm pretty sure my 8th grade drama club could have acted better. Also, to agree with the other reviews, this movie probably had only a six page script. 25 minutes in and I think only nine words were said. Maybe it's because I didn't finish the movie but I feel there were definitely some plot holes. I might finish it one day but as of now I'll just rewatch the first movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "saranicholls",
        "review_rating": "1",
        "review_title": "365",
        "review_detailed_main": "Absolutely dire!! It was actually laughable, bad acting and the plot was unbelievable and one point the gardener picked her up outside the venue where she supposedly saw her husband having sex with someone else,in complete darkness next shot it's in day light when she asks him to pull over!!"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cprvbp",
        "review_rating": "2",
        "review_title": "Literally dog doodoo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "SonyaPuspitaningtyas",
        "review_rating": "1",
        "review_title": "I'm suffering",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lgvillemoes",
        "review_rating": "2",
        "review_title": "Music Montages and S$x",
        "review_detailed_main": "I honestly liked the first movie but this one was pure rubbish. It felt like a constant commercial with endless slow motion montages of hot guys, sexy cars, fashion and lots and lots of sex... There is almost no story at all, actually nothing happens at all until halfway through the movie. The acting is awful, and the dialogue has the quality of a low-level porno movie. The music is annoying at best, way too dramatic and stupid. It seems like the only point of this movie is the soundtrack and to provide sexy scenes, muscled half-naked men and fast cars for the audience to drool over. It is not worth watching as anything other than visual entertainment."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "biancaonofrei-69884",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "The most bad scenario and actors ever🤣 it's more like a porno video. I do not recommend at all. I was laughing while I was watching it. I've waste 2h of my life for nothing."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "priyankawankhade-18384",
        "review_rating": "10",
        "review_title": "Best romantic love story",
        "review_detailed_main": "Very romantic love story I love Laura maussimo pair ...love songs in movie ..cant wait for part 3..story is good ..expecting more emotional love scenes n bonding between them."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mmcoza",
        "review_rating": "1",
        "review_title": "Dear Lord what have I just watched!?",
        "review_detailed_main": "The whole plot line is ridiculous, immature, amateur and so bad it's sad they spend so much money on this whole project. But people will watch it for sex scenes because some how acting is bad all but sex scenes wich are very realistic...so I must ask myself 'Are they really having sex?' Because it can't be that all of the acting is bad but these scenes are the only ones that are watchable."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "anniikalachmann",
        "review_rating": "1",
        "review_title": "Actually a waste of time",
        "review_detailed_main": "I created an IMDb account specifically to write a bad review. It probably sounds like I want to badmouth the film unnecessarily, but the truth is, I want to save people from wasting their time on the second part of this film series.\n\nI actually liked the first movie and was looking forward to the sequel.\n\nAfter 15 minutes maybe 3 sentences were spoken.\n\nI had to stop and watched it a day later because I was like \"you liked the first movie, it have to get better than these 15 minutes\" spoiler - it didn't get any better. The whole movie was either a porn or a music video. The film's story could be explained in 5 minutes, it didn't need all that music and sex.\n\nAnd I know the first film was so well received because of the sex, they know that and they totally exaggerated.\n\nIf I had only wanted to see sex, I would have watched some porn.\n\nIf I had wanted to listen to music, I would have heard my own.\n\nThe story was predictable and the dialogue (if there was any) was poorly written.\n\nI think that might have been the worst movie I've seen so far."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "shaunajanemclean",
        "review_rating": "1",
        "review_title": "Made and IMDb account to leave a review about how terrible this movie is",
        "review_detailed_main": "Worst movie I have ever seen. So cringy. Glorifying a crazy sex life. I could not stop cringing. Don't waste your time watching this movie. You might as well google po.n hub if you wanted something spicy. It's an insulting movie to everyone's eyes."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "legoali",
        "review_rating": "2",
        "review_title": "not good for couples who have problem in their relationship",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "adamkhalfaoui-43863",
        "review_rating": "1",
        "review_title": "Sex, sex and sex",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "charlotte227",
        "review_rating": "1",
        "review_title": "Trash Horrible Waste Of Time",
        "review_detailed_main": "This movie is seriously 1 level away from full porn. No plot. No story line. Scene after scene of simulated sex. The movie is overall horrible & a waste of time to even try to sit thru it. It has a very thinly veiled script going nowhere. Huge let down."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "vanesasanoh",
        "review_rating": "4",
        "review_title": "HIGHLY DISAPPOINTED! Spoilers included",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lindasark",
        "review_rating": "3",
        "review_title": "Made for Netflix or Playboy late night?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "aturz-10921",
        "review_rating": "10",
        "review_title": "Steamy",
        "review_detailed_main": "The small plots that are offered in both movies is great but honestly we all know we are here the eye candy & sex. I thought he was great! I feel we are left with another cliff hanger just like the first one."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "atikaproject",
        "review_rating": "3",
        "review_title": "It got worse despite the fame of the first movie",
        "review_detailed_main": "The first movie had quite horrible acting and the story itself was nonsense, but that was okay. However with this one, they tried to rush a story in less than two hours of film, of which they used the first 30 min for lots of sex between Laura and Massimo. Therefor it was lacking context, scenes and dialogues weren't making any sense and all in all this movie was a lot worse than the first one, despite all it's success made them lots of money that they could've used to this one's advantage. Loved the visuals and the scenery. Also loved the music. The erotic scenes that most of us loved in the first movie were cramped in the first 30 minutes and it was lacking afterwards."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mustafasagun",
        "review_rating": "1",
        "review_title": "A Porn Movie?",
        "review_detailed_main": "This is not movie. This is porn show. What director and what script could make such a terrible movie? Really garbage. If you want to watch porn movies then here you go. The script, the acting, everything sucks."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "sokdarhan",
        "review_rating": "1",
        "review_title": "Mediocre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "justinarndt-54790",
        "review_rating": "2",
        "review_title": "It's a Porno",
        "review_detailed_main": "So it's basically a porno. It's sex, sex and more sex pretty much for the first 30 minutes of the show with a few more sex scenes smattered through the rest of the movie. THERE IS NO PLOT!! There are entire scenes that could very well not be in the movie and the plot and scheme of the movie would not change one bit!!\n\nOne scene has a main character say at the end \"I have an idea!\" very emphatically. The next scene is a sex fest, and the movie continues without ever hearing about or seeing what that idea was. It's horribly terrible, the acting is pretty bad, Massimo looks like he's having an aneurism in almost every scene he's in, and the only reason it's getting watched is because of the first one, which was actually fairly decent.\n\nYou don't watch a movie like this for the plot, just like you don't watch Deepthroat for the acting. It's a porno. Don't get me wrong, the girl looks great, but it's a porno."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "scarlettn-04642",
        "review_rating": "1",
        "review_title": "Babygurl",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "cmcelada-33-210988",
        "review_rating": "1",
        "review_title": "At least the hub admits their talent isn't acting",
        "review_detailed_main": "Any feature on sitehub has better acting with a little more and a little less lines on the dialogue, the disco pop music montage is ad nauseam, the starlets are pretty, they could have spared the beautiful locations and film it in the ussual office with a cheap black couch. Anyway, I suppose this is probably not intended to be viewed by men, the writer had too many Hallmark movies and hard seltzer to write this saga of light porn for women."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jhoanarodriguez",
        "review_rating": "1",
        "review_title": "Welp...",
        "review_detailed_main": "Well that's two hours of my life i will never get back.... honestly i hate to sound bitter but bro... it was 1/2 porn 1/4 musical and 1/4 the actual story line. No offense."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "opinionated-alchemist",
        "review_rating": "3",
        "review_title": "Boring.... and superficial",
        "review_detailed_main": "Hm... what type of genre was intended for this movie?\n\nThe movie is shot quite beautiful. It seems that the cinematographer is shouting out to the world \"I can do so much more\" - regrettably the story and the screenwriters are letting the movie down. And yes, the genre is totally unclear - is it an erotic movie? There are some scenes - but they never reach a real appeal - not in length, not in intensity, not even in nudity. Is it a thriller? Nope again - the story has a twist - which is rather lame. Even there is no mentionable character development. The protagonists are doing their mistakes again and again (even though \"she claims\" to learn out of her prior mistakes).\n\nMaybe it is advertisement? Regrettable even the featured products (for example a beautiful Bugatti Chiron) are cut short. You could not even use the movie to use as screensaver (e.g. In an electronic store) - the few sex scenes are not really adequate for this use.\n\nInstead this movie is dipping its toes into different genres but unfortunately never commits.\n\nWell - maybe it is a dating movie - not intense enough to be a direct sign, but not interesting enough - so it gives plenty time of another focus. But then it showcases that you have got really bad taste when it comes to movies. Also not ideal."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mofadira",
        "review_rating": "8",
        "review_title": "The best movie",
        "review_detailed_main": "I just want to say that........ Please make LAURA and MASSIMO ENDING UP TOGETHER😤💗 if LAURA and MASSIMO doesn't ENDING UP TOGETHER!!!!? I WILL JUMP............................ AT THE POOL😱 and last one.........\n\nI HOPE LAURA ENDING UP WITH MASSIMO!!!!\n\nThank you...😊💗"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "averagedeveloper",
        "review_rating": "1",
        "review_title": "Cinema at its worst - sequel",
        "review_detailed_main": "I watched the second movie just out of curiosity about how far this thing would go, and out of an obsession to finish a series I started, no matter what. I criticized the first movie based on the sick state of the culture of male-female relationships. There are many other things that can be criticized in the script, but they are very insignificant compared to this aspect of the series. The most obvious one is the shoddy plot twist on which the scenario is based. It was needed so that the porn-like aspect of the film would not repeat itself and could be developed further. Another aspect of the movie that bothered me immensely: Claiming to portray a strong female character while destroying the hard-earned dignity of the female figure and making her shallow."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "tph123",
        "review_rating": "1",
        "review_title": "So much worse than the first film.",
        "review_detailed_main": "The first film was a bit of a guilty pleasure, but the second film has absolutely nothing going for it.\n\nI see a lot of reviews saying it is full of sex, but even those scenes are really boring and pointless."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "catherinemalvin",
        "review_rating": "1",
        "review_title": "Somehow more boring than the first one",
        "review_detailed_main": "Somehow this movie is not only more boring than the first one, it has less of a plot than the first one. The movie is just music video after music video. I can't believe I'm saying this but, at least the first movie had the plot of him trying to get the girl to fall for him. But, now that has happened what's the point?! Why are we still watching these two characters who I wasn't even rooting for in the first place just laying around being some of the most unlikable characters I have seen in awhile. It's not like the screenwriters thought to write a story that has us follow these characters through a relatable emotional journey like The Before Trilogy did no, its just music video after music video and maybe 15 minutes in total of plot comes up mostly at the end of the movie. And spoiler alert I still don't like them after this movie. If anything I dislike them even more cause they somehow act even dumber and more insane. The movie if you want to call it that does not earn its over hour and forty minute run time. It felt like an eternity watching this. This movie isn't even so bad it's good kind of like the first one, it's so boring you could you use this movie to torture someone if you ever get so mad at them you want them to suffer."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "chicalicious-16994",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "Somewhere on goggle, this movie was recommended as one of the best movies in 2022. I decided to watch it. To say I was disappointed with the movie is a gross understatement. It felt like I was watching a porn movie with a mediocre storyline. The story is not enough to have a Part 3 so please stop prolonging it already..It should have ended in 1 part.\n\nYou can actually do better. It's 2022..."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "juneen-avery",
        "review_rating": "9",
        "review_title": "Loved It!",
        "review_detailed_main": "I don't understand all the bad reviews? I enjoyed this movie thoroughly..A few twists made me guessing what was going to happen...Characters were played very well...lots of eye candy...lots of sex scenes...this movies sex scenes were exactly what I was expecting with 50 shades of grey which lead me to be extremely disappointed with all three...definitely give it a go and make your own opinions and don't rely on all these bad reviews :)"
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "admhsn",
        "review_rating": "10",
        "review_title": "This is good and a great movie",
        "review_detailed_main": "Does this review contain spoilersA very interesting movie. A wonderful program. I love it. I like this program. Greetings to you. This is good and a great movie."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "mallykimmel",
        "review_rating": "10",
        "review_title": "Love this series",
        "review_detailed_main": "I don't get the ratings or reviews. If you didn't like the first movie why did you watch the second? And why did you watch this if not for the books? After reading the books I found out Netflix made these movies. They are just so good. I am so pleasantly surprised and satisfied by how this is portrayed on film. So much better than 50 shades.\n\nNacho is just yum! Not really how I pictured him but beautiful. This 2nd part is very different than the book. But great direction of plot and where the story turned. Its kind if nice to read one story and then watch another story, like you will have more to enjoy."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "jctshorty",
        "review_rating": "9",
        "review_title": "I liked the sex and the story and the beautiful scenery",
        "review_detailed_main": "This movie is not supposed to a cultural, intellectual experience. It is a escapist movie. Does not have to be intellectual just enjoy the sex and the scenery. There will probably be a third movie. Looking forward to it."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "lanasalh",
        "review_rating": "10",
        "review_title": "Loveyouuu waching film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "shannonbermingham",
        "review_rating": "8",
        "review_title": "Good for a Netflix film",
        "review_detailed_main": "It's good and also had a really interesting plot with lots of plot twists Obviously there are a lot of cringe moments and stereotypes that are used but still enjoyable. Not something I'd rewatch though."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "kelsey-95119",
        "review_rating": "8",
        "review_title": "The Ending!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "LadyMarine",
        "review_rating": "10",
        "review_title": "No matter what you say...you watched it for the same reasons",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "eimming",
        "review_rating": "8",
        "review_title": "Story actually takes flight about 1/3 way into the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "pepus-30427",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": "I love 1 part and second part...everything was nice...very excited....good scenies...perfect...beautiful... nice actors...i like it ..i like it.... i wait for 3rd part...."
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "steven98426",
        "review_rating": "",
        "review_title": "Better than the first part",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "eleanortenne",
        "review_rating": "",
        "review_title": "Sex, scilence, alcohol and fights.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "sil-12",
        "review_rating": "",
        "review_title": "Probably the worst movie I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt12996154",
        "movie_name": "365 Days: This Day",
        "movie_rating": "2.7",
        "review_username": "ezgiiii",
        "review_rating": "",
        "review_title": "Onlu sex it is a netflix porn",
        "review_detailed_main": ""
    }
]