[
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "tributarystu",
        "review_rating": "5",
        "review_title": "A Decent Laugh",
        "review_detailed_main": "I always liked Owen Wilson and Eddie Murphy, so I thought, in case the movie is worth nothing, I'd still get to see some friendly faces. For better or worse, I can say it was about what I expected.\n\nI put this movie in two categories, and I think I placed it right: it's a decent comedy, with parts attempting to live up to an action movie. At its heart though it tries to be comedic and funny, so that's upon what it should be judged. Thankfully, you will get the chance to laugh out loud, but unfortunately not as much as you'd like to laugh out loud at a comedy. I won't even mention rolling on the floor.\n\nThe story isn't something really new, but it has quite a few humorous plot twists. The so-called funny character is Kelly, who really inflicts a fair amount of pain on his adversaries, but he is just such a nicely drawn, egocentric guy, that it actually works on a comedic level. It's always just about him, and him and then some more.\n\nThe actors have their charm but I won't really dwell on this as they are as high profile as it gets, Hollywood style, so you know what you get. Perhaps Wilson could have spiced up his game with a bit of the unexpected, but all in all he does what he does best.\n\nI did feel a bit let down by the special effects, with some flimsy looking explosions placed here and there. However, the host city of Budapest looked really gorgeous throughout, making it well worth it's money shots.\n\nTo draw the line, the film isn't great, but it's fine enough. No brilliant ideas, or anything like that, just the usual comic stuff."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "robo8",
        "review_rating": "6",
        "review_title": "Actually quite okay....",
        "review_detailed_main": "I was expecting something really lame when I slipped this DVD in. However it turned out to be quite okay. Eddie Murphy is in really good shape and Owen Wilson delivers.\n\nIt is well made from a comedy point of view, but surprisingly also fairly well made in the action aspect (for a comedy that is). It has good pace and doesn't leave you bored for long. I actually found some really big laughs in this, especially from Wilson.\n\nI'm not a big fan of director Betty Thomas, I thought \"28 Days\" was really flat. I thought she was a weird pick for this one - however, she surprises me with both comedy and action skills that I've never seen before (but in truth I haven't seen much of her rather extensive work for TV). I tip my hat of to the lady who brings this plane in for a sufficiently smooth landing.\n\nIf you like action comedies and don't expect anything more then to pass an hour and a half, you should be quite fine with this one."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "6",
        "review_title": "An average buddy movie with action , thrills and amusement",
        "review_detailed_main": "It's a typical action , modern film . Owen Wilson plays a good and serious CIA agent , Eddie Murphy plays a humorous and foul mouthed boxer . They are called to action on a risked top secret espionage mission and both of whom join forces to vanquish the evil and nasty person , Arnold Gundars : Malcolm Mc Dowell , who has stolen a supersonic and invisible airplane and to foil his treacherous schemes for the aircraft . Famke Janssen and Gary Cole play other agents , we don't know if they are good or bad guys until the end . Attitude meets espionage .Espionage with attitude . Get another field of view .\n\nThe movie blends action , fun , humor , giggles , emotion , comedy, tongue-in-cheek and results to be quite funny and entertaining . Two protagonists carry out a dangerous assignment , their mission , to catch one of the world's most successful illegal arms dealers : using equal parts skill , action and humor . The characters from the TV series are reversed in this film version . As some roles have diffferent attitude , experience and personalities to the the original TV series. Eddie Murphy , as always , playing the same role , a foul-mouthed as well as sympathetic person , Owen Wilson and Famke Janssen are rightly portrayed . Support cast is pretty well , such as : Gary Cole , Malcolm McDowell, Phil Lewis, Leacock and Lynda Boyd . Good and atmospheric cinematography by Oliver Wood . Thrilling and moving musical score by Richard Gibbs . Direction by Betty Thomas(28 days , Troop Beverly Hills , Dr Dolittle , Alvin and the chipmunks the squeaksequel ), is ordinary , fitting to action film . Rating 6/10 . Average but amusing."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "NoArrow",
        "review_rating": "",
        "review_title": "Hilarious sometimes, annoying at others",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "rrandcoyote",
        "review_rating": "1",
        "review_title": "Why call it \"I Spy\"?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "trouserpress",
        "review_rating": "7",
        "review_title": "I Spy no chance of a sequel",
        "review_detailed_main": "Another Hollywood offering based on the time honoured principle of remaking classic TV shows to guarantee financial returns. However, unlike some that still managed to flop, I Spy for the most part delivers.\n\nThe story is typical Bond-style spy action: Someone has stolen a top secret invisible plane from the American government and is selling it on the black market, and it's up to our heroes to get it back. The story is secondary to the comedy in this movie, mostly between its two stars - Eddie Murphy and Owen Wilson. Murphy reprises his wise-cracking sidekick role, last seen in Shrek. Instead of a talking donkey though, this time he is a world-champion boxer. If you can with-hold your disbelief of this concept for ninety minutes his performance is fairly enjoyable. At times there is a glimpse of great chemistry between his egotistical celebrity and Wilson's downtrodden spy in love.\n\nUnfortunately this is a movie that suffers from an identity crisis: Is this a spy thriller with jokes, or is it an all out spoof of the genre? Because of this the movie falls somewhat uncomfortably between the two, with long periods with no jokes at all followed by hilarious set-pieces.\n\nHaving said all this, I Spy is still fairly entertaining, and if you're just looking for a film to fill a friday evening you could do a lot worse than to choose this one."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "I Spy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "Good chemistry in weak spy movie",
        "review_detailed_main": "Alex Scott (Owen Wilson) is a second tier American spy. He is tasked to retrieve the Switchblade, a prototype invisible stealth fighter, from Arnold Gundars (Malcolm McDowell). Superspy Carlos (Gary Cole) is too recognizable to do the job. Kelly Robinson (Eddie Murphy) is a brash loudmouth champion boxer. Scott works with Robinson to track boxing fan Gundars before he can sell the plane. The duo is joined by Famke Janssen.\n\nOwen Wilson and Eddie Murphy are both great comedic actors. They have good chemistry together having fun trading punchlines. The problem is the serious story. The comedy works better than the thriller. I have to admit that I never saw the TV show. So I have no idea what they're attempting to replicate. Maybe it was an advantage to not have any expectations at all."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "asashanx",
        "review_rating": "2",
        "review_title": "SPOILER ALERT!!! Hold onto your hats, plug your ears, and prepare to sing, \"I can't hear you. La, la, la, la ,la, la!.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "inkblot11",
        "review_rating": "6",
        "review_title": "Enjoyable movie, somewhat of a guilty pleasure, but still loads of fun",
        "review_detailed_main": "Alex (Owen Wilson) is a member of the U.S. spy force, even if he is a bit dim, at times. When he starts an avalanche at a rescue post in a cold climate, he still, nevertheless, manages to rescue the appropriate person. Yet, just as he is being sent to Budapest, to prevent the sale of a super-stealth plane to the enemy, the powers that be decide to give him a partner. Kelly (Eddie Murphy) is a great boxing champion and is slated to fight a big match in Hungary, too. Why not have Kelly tag along with Alex, as a superior \"cover\" for both of them, allowing them time to crack the plane situation? Going along, too, will be Rachel Wright (Famke Jansson), a gorgeous lady agent who is the object of Alex's daydreams. Let the games begin. This is a fun film, based on the old television series with Robert Culp and Bill Cosby. But, in reality, it is nothing like the classic show, except in providing plenty of entertainment. As the principal players, Murphy and Wilson are just right, exhibiting the irreverent but chortling humor we expect. Jansson is quite lovely, too, and Malcolm McDowell comes along to play the heavy nicely. As for the setting, it (Budapest) is beautiful and worth a showing of the film, if for no other reason. The costumes and production values are great, also. If you are looking for something on the level of Out of Africa, you will be disappointed. I Spy is just your usual, manufactured movie. Yet, there is something about this mirthful flick that keeps one interested, down to the last scene. For those who just want to pass a couple of smiling hours, this one is for you."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "bruceflashback",
        "review_rating": "3",
        "review_title": "Did the filmmakers even watch any of the 60's I-Spy series?",
        "review_detailed_main": "The series I-Spy was a great tv show about two competent CIA agents.One was a white man who had the cover as a tennis bum.The other was a black man who was the trainer of the tennis bum as a cover. the movie made both characters idiots .Only one was an actual agent and he was a bigger buffoon then the non-agent.the names of the tv characters were used but the races of the characters having the names was reversed. As a fan of the series , the whole thing was a big Fu to the makers ,cast and fans of the classic tv show it was \"based on\" . that is if based on means use the title and names of the main characters and have no resemblance past that.\n\nEven Malcolm McDowell ,one of my favorite actors couldn't save this piece of crap."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "UniqueParticle",
        "review_rating": "10",
        "review_title": "Love this movie so much!",
        "review_detailed_main": "I use to watch this on VHS back in the day - it was a blast then and still is! I love some of the lines, the energy, music, cast and the far-fetched silly comedy. I'm always pleased with this underrated spy flick. I know I'm In the minority that enjoys \"I Spy\" so much... so be it. this movie makes me smile!"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ccthemovieman-1",
        "review_rating": "7",
        "review_title": "Entertaining, But Murphy's Act Getting Old",
        "review_detailed_main": "This is a re-make of sorts, not from a movie but from a television series that made history when Bill Cosby became the first black actor to star (or co-star) in a regular TV show. He and Robert Culp played in the show of the same name.\n\nHere, Eddie Murphy plays Cosby's role and Owen Wilson takes over Culp's character. As funny as Murphy has been over his film career, I, for one, have gotten tired of his loud and abrasive characters. It's getting tiresome. Even in the animated hit, \"Shrek,\" Murphy was loud, too talkative and obnoxious. He can't seem to get away from that kind of character. Wilson was more likable in this film and Famke Janssen was interesting.\n\nThere are a few wild action scenes in here and this film is played strictly for two things: comedy and action. Another thing: it should have been rated \"R,\" not PG-13. Overall, the story is lame but it is entertaining so, for that, it's worth a rental."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "slijk_der_aarde",
        "review_rating": "1",
        "review_title": "Murphy's out and Owen never has been in",
        "review_detailed_main": "I've got this tape to watch several day ago as a viewing tape. It took me 38 minutes. This is awesome, I already had some negative feelings on Murphy and Wilson, but this is a big 0!!! I've seen some bad movies, but this beats everything.\n\n---JustMyOpinion----"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Slight and nothing new, but enjoyable nonetheless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Don't Spy On This.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "tastyhotdogs",
        "review_rating": "7",
        "review_title": "This teaming could've been funnier",
        "review_detailed_main": "Every ten years or so, a comedy comes along that redefines Movie Comedy. Police Academy, Coming To America, Wayne's World & Austin Powers are some recent examples. This isn't another one.\n\nIt's fair to say I hadn't been as excited about the pairing of Eddie Murphy and Owen Wilson since Pacino and DeNiro in \"Heat\". The movie seemed to have all the ingredients, but an ordinary script and the \"max factor\" of Kelly Robinson made sure this movie never reached it's potential. Don't get me wrong, there's a few gems, most notably when Eddie's character helps Owen pick up a woman and when the two have a brilliant heart-to-heart in a sewer. Unfortunately there's not enough of these moments and we're left wanting more. Still worth seeing though."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "darthsteele-39338",
        "review_rating": "1",
        "review_title": "Maybe it worked 18 years ago?",
        "review_detailed_main": "This film popped up on Hulu so I thought I'd give it a watch. Taking into consideration that it was made in 2002 when Owen Wilson's and Eddie Murphy's personas weren't tiresome quite yet. HOWEVER it does not stand the test of time and Eddie Murphy's schtick is just obnoxious and annoying."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "bopdog",
        "review_rating": "7",
        "review_title": "Better than I'd heard--- Wilson, Murphy, and Jannsen get to shine and dazzle us in the movie's second half",
        "review_detailed_main": "A lot better than I expected! I'd read dreadful reviews, and while I clearly see the bases of the critics' points (I try to only read good critics, critics with useful insights), I must confess I wound up liking the movie.\n\nThe first 45 minutes or so was pretty lame--- slow, awkward, annoying. But the it picked up steam, and allowed Eddie Murphy and Owen Wilson (my two favorite actors, for real) to be their charming and weird selves. And that Famke Jannsen--- Wow! Those Dutch folks grow some hot babes! At least, I think she was Dutch, once??? Whatever--- she's VERY sexy, charming, intelligent, and graceful. All 3 of these folks were largely very watchable."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "red99-1",
        "review_rating": "2",
        "review_title": "Yikes !",
        "review_detailed_main": "Looks good on paper, not so much on film. Thank god I saw it on cable. Had I paid $10 at theater, I would've asked for a refund. 2 much of a good thing. One comic is enough, 2 comics cancel each other out. Sorta reminds me of Owen Wilson and Paul Rudd movie. Great alone, together... not so much."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "Actually, the movie itself is nothing that special, but it has some good stuff. From an artistic standpoint, there were some plot elements and character developments I didn't think were totally needed. They do however drive the story, which seemed to be their purpose, so I can accept them. The leads' combined talents and charisma have a lot to do with this movie's success. I found the acting to be sensational, the dialogue incredible and the director's abilities to be up to par and then some. It reminds me of some of those sombre Canadian films that were popular back in the 1990s. My final rating comes in at seven out of 10."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "philyben",
        "review_rating": "2",
        "review_title": "Lame",
        "review_detailed_main": "My dad told me how cool the TV series was. Bill C was young, thin and good looking. Culp was a 60's version of a Yuppie spy. It was fun and funny. This movie is the same old tired buddy cop movie stuff. The actors want to be funny but it seems forced. Hardly worth the price of admission."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ichabod81",
        "review_rating": "8",
        "review_title": "A positive surprise. *spoilers*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "artzau",
        "review_rating": "6",
        "review_title": "Rush Hour Revisited",
        "review_detailed_main": "Change the Asian face of Jackie Chan with that of Owen Wilson and what do you have? Another Rush Hour. Oh, there are a few different gimmicks but the slick Black hip-hop speak and cockiness of the roles in which Eddie Murphy excels, give this film the same texture.\n\nThe dialogue is often funny but not really witty, the action is hyped and the circumstances are unreal. All in all, I found much of the script to be very predictable but laughed at some of the outrageous scenes anyway. The audience around me was whooping it up big-time and I often found myself laughing more at some of the people around me. Well, it's all grist for the mill. All in all, not a bad show albeit rather low on the cultural scale. The writing lacked much of the tension of Shanghai Noon, Wilson's earlier film with Jackie Chan, but Wilson's repeat of a low key inept character did provide some balance to Murphy's constant ego-driven upstaging.\n\nMy suggestion is catch this at a matinee where you can pay a reduced price for admission. You won't have to worry about being intellectually challenged."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "juldobos",
        "review_rating": "1",
        "review_title": "An extremely premature movie",
        "review_detailed_main": "Though now I live in the US, I was born in Hungary, saw the changes the country went through and know at least the very basics that most everyone knows about this old and beautiful country - except the idiot \"director\" of the movie I Spy. I understand that she's way too old to make movies to begin with and especially old to get at least a little tiny bit close to what you'd call true representation. She must still live in the 60s when Hungary used to be quite different than in the last 20 years.\n\nI mean, come on.... it's not only unfair to use 30-35 years old (!) police cars in the movie that takes place in 2002 but showing the population of the country as if 95% of it was even older the the \"director\" (over 90 years old) and as if all Hungarians were smelly jerks who don't shave their armpits is simple premature, moronic, and above anything: extraordinarily amateurish. Not that the rest of the movie is great - it's not. The acting isn't bad but the dumb, dumb script and the entire production quality (incl. action sequences footage, visual fxs, not-original music and especially the location sound) are awful, match the up-to-dateness of the 35 y.o. police car. Really, really low-key. Just like our pathetic \"director\".\n\nps please, if Betty Thomas or her representation reads this email, email me at hazikristof@yahoo.com I work in the film industry on a pretty high level, and would be very interested in talking to you about this movie. I mean, there must be something that I don't get.."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "It's funny but a bit annoying too",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "gevike",
        "review_rating": "1",
        "review_title": "Budapest deserves more",
        "review_detailed_main": "This definitely was one of the worst films that I have ever seen. The story is stupid, the actors are unconvincing, the stunts are nothing special, the whole thing is a waste of money and time. Budapest deserves more than that, not to mention the audience."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jimorris",
        "review_rating": "7",
        "review_title": "Pleasant surprise",
        "review_detailed_main": "\"I Spy\" is NOT a movie version of the TV series, but rather is a silly spy spoof with all the gizmos, violence, car chases, and explosions. Eddie Murphy basically plays Eddie Murphy but this time without the laugh and less mugging. Don't expect much and you will be pleasantly surprised. GRADE = \"B-\""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "cubbyblu66",
        "review_rating": "1",
        "review_title": "If you've seen the trailer, you've seen it all",
        "review_detailed_main": "Virtually every funny scene in this lame movie was seen in the trailer. I did think the trailer was very funny. I hate that, and I simply hated this lame waste of my time. There could have been much more here. The concept was tried and true, but the talent, (writing) was sorely lacking."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "tmieczkowski",
        "review_rating": "6",
        "review_title": "A worthy entry into the action-comedy genre",
        "review_detailed_main": "By no means a great film, but an entertaining piece of work that has a relatively decent Murphy performance supplemented by a characteristically hard-working Owen Wilson [Is there anything this guy can't do?] The script could have used some work, but the laughs are there. 6/10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "4",
        "review_title": "Nothing new or refreshing",
        "review_detailed_main": "I Spy is apparently a buddy action comedy starring Eddie Murphy and Owen Wilson. The film was seen as a massive box office flop with a budget of $70 million and only making $50 million worldwide. Apparently this was a remake of a classic television show. This film does quite offer much of anything new in which we haven't seen before. It has some decent moments of action and comedy but in general the film isn't too funny and the action doesn't hold up.\n\nAll too predictable. Reminiscence of Rush Hour is some way, but in comparison, those Rush Hour films are far superior in almost every way. I Spy is quite a forgettable film."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Caleb_Everett",
        "review_rating": "6",
        "review_title": "You should call this review the Leafy Bug",
        "review_detailed_main": "I really enjoy the dynamic of Owen Wilson and Eddie Murphy, Owen has this sort of laid back comedy style while Eddie is more in-your-face. Together they create a perfect composition, like peanut butter and jelly. The movie is definitely funny, and Kelly Robinson is by far one of my favorite film characters of all time, but the overall plot is definitely WILD so I can't actually give this anything higher than a six. This is one of those great guilty pleasure films for me that I'll watch on a rainy Sunday afternoon when I'm really bored."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "elshikh4",
        "review_rating": "5",
        "review_title": "5 Suggestions That Would Make This Movie Better !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ashleyw",
        "review_rating": "8",
        "review_title": "Not bad, not great, but entertaining....",
        "review_detailed_main": "Well just about anything with Owen Wilson is worth watching... great as the famous Roy O'Bannion in Shanghai Noon/Nights and damm good in behind enemy lines. Considering the lame TV show (I Spy) they had to work with, they did pretty damm well.....Admittedly the sexual healing secene was about as funny as a nosebleed, but apart from that the movie rolled along quite nicely... started to sound remarkably like a stakeout.... (not the movie Stakeout - which was a solid 8.5 out of 10)... Whats all the fuss about Famke Janssen? Nice, not great, nice.....\n\nLight casual entertainment, just dont dig to deeply! 7 out of 10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "portia17",
        "review_rating": "7",
        "review_title": "yes, it IS underrated, folks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jmh2350",
        "review_rating": "5",
        "review_title": "Should be renamed: Another Shanghai 48 Hrs.",
        "review_detailed_main": "I usually like Owen Wilson, and only occasionally enjoy Eddie Murphy anymore. I must say there was some fun in it, but not for all the right reasons. Wilson plays the same character that he did in \"Shanghai Noon\", a movie in which I enjoyed him, but it did not work in this movie because he is supposed to be a modern spy. On the other hand, the Murphy character totally worked, because he perfectly portrays a successful-egotistical-arrogant-big mouth prize fighter (with a touch of his \"48 Hrs.\" cockiness). Malcom McDowell's talent is virtually wasted because he is used as a one-dimensional villain, almost always just in the background; writing and directing his character as evil up close and personal would have allowed for a far more effective portrayal and would have better utilized his talent. There is only one very good, sustained action sequence in this flick, with excellent effects. But ultimately, this movie plays as just too dumb and it lacks the class of the old Cosby-Culp T.V. series' characters."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "",
        "review_title": "No wonder I Spy died at the box office",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Kamurai25",
        "review_rating": "4",
        "review_title": "\"Go Left: You're Other Left\"",
        "review_detailed_main": "Annoying watch, probably won't watch again, and can't recommend.\n\nI like Eddie Murphy, I usually depend on him to carry movie given he's such a big personality. Unfortunately the character he is playing is every bit as annoying as Owen Wilson and that is amplified as, like I said, Eddie Murphy is a big personality and this character doesn't call for any nuance.\n\nMalcolm MacDowell does a his great creepy villain vibe, and Famke Janssen (\"Golden Eye\": Xenia Onatopp) makes a great spy: I wish she had done more of it.\n\nThe majority of this movie is Eddie Murphy and Owen Wilson playing some stupid characters and getting into situations that they can barely handle most of the time.\n\nIt definitely doesn't feel like a \"spy movie\" the same way that someone knocking over a set of steel plate armor doesn't. This is much closer to an action-comedy, maybe similar to \"Rush Hour\", but not as good.\n\nI'm not saying there isn't anything to enjoy here, I'm just saying you can flip through Eddie Murphy's filmography to find a better movie, and there are a lot of other movies out there to see."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jessie-39",
        "review_rating": "7",
        "review_title": "Vintage Eddie Murphy...Just the way we like it!",
        "review_detailed_main": "A terrific two hours of enjoyment with vintage Eddie Murphy. Just like his best roles in Beverly Hills Cop, he is himself and right at home in this wonderful action film with Owen Wilson who is equally good. So for two hours of fun, escapism and something you can take the big kids to. Go and see it, the critics of course hated it, why? Beats me!"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "questl-18592",
        "review_rating": "4",
        "review_title": "iSpy",
        "review_detailed_main": "When I watched this movie in the past, I never thought it was good but I thought it was an alright enough movie. Watching it now though and... Well it's an alright enough below average movie, I guess. I enjoy Murphy's antics a lot here, Janssen seems to be having fun with it and Wilson is doing his Wilson thing. It's a pseudo-Bond parody, it just doesn't really hit that mark in a great way.\n\nThis is a pretty harmless background watch that I think is worth it just to see Murphy acting like an arrogant jerk and then sing Sexual Healing to Wilson. Not worth spending money on though."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Rob_Taylor",
        "review_rating": "6",
        "review_title": "Pretty average fare. Nothing to go out of your way to watch.",
        "review_detailed_main": "Since I'd never seen the original series this was based on, I guess I have no preconceptions to bring to this review. No biases and no \"It wasn't like the series\" comments. I just watched it as a spy-spoof movie.\n\nUnfortunately, I can't say I was too impressed. In fact, underwhelmed would be a better way of getting across how this movie made me feel. Maybe I'm getting old, but much of the humour didn't work on me and Eddie Murphy's \"Eddy Murphy\" routine is really beginning to grate on the nerves.\n\nI can't be the only one, either, to think that the pairing of Wilson and Murphy just didn't work. Both can be good, with the right partner (Shanghai Noon and 48 hrs respectively), or even on their own, but this match just didn't work well for me.\n\nAnd what on Earth is Malcolm McDowell doing here? He gets a scant few moments of screen time and he's completely wasted here. Must have been doing a favour for a friend, I guess.\n\nOther than that, the film was pretty average. Neither hilarious or dead on its feet, but somewhere in between. There are the usual spy staples, such as car chases, explosions and nifty gadgets, but it's all done pretty poorly. The car chase is nothing special, the explosions are so-so and the gadgets don't make you go \"Wow!\" when you see them. All in all, average stuff, done averagely, by average screenwriters, with average results.\n\nAnd please, scriptwriters everywhere, no more \"invisible\" objects. That's starting to get as tired as the Star Trek \"time travel\" plot device."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "narathip_87",
        "review_rating": "4",
        "review_title": "TV classic remade as a forgettable buddy movie.",
        "review_detailed_main": "This film does no favors to the memory of the I Spy TV series, a genuine original that knew how to pull off a surprise. On the big screen, it is as ordinary as they get."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "dromasca",
        "review_rating": "6",
        "review_title": "Murphy Losing His Comic Appeal",
        "review_detailed_main": "Unfortunately, Eddie Murphy is losing his comic appeal for a while, and this film is one more proof. He became in the last few years a typical star for comic movies that aim high, but do not succeed to extract more than a few polite smiles, and leave the spectator with the feeling that he/she kind of lost two hours of your life. 'I Spy' conforms to this rule. It is a James Bond parody, not crazy enough, not vulgar enough, not sexy enough as other parodies were lately. Filming on location in Budapest is spectacular, a few ideas are nice, but I doubt I will remember them one week from now. Rent 'I Spy' only if you really have decided that you will watch a comedy, and all Austin Power and Steve Martin movies are already rented out. 6/10 on my personal scale."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "echodog-33510",
        "review_rating": "1",
        "review_title": "Ehh",
        "review_detailed_main": "Hands down, the, worst movie I have ever seen. I love Eddie Murphy, I love Owen Wilson. But there is zero chemistry here."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Magow-Intermean",
        "review_rating": "8",
        "review_title": "I Spy Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "7",
        "review_title": "Eddie Murphy's still got it",
        "review_detailed_main": "I Spy was down right funny. Eddie Murphy was an absolute cut up in the film. He is at his best when he is allowed to ramble, because you have no clue what he is about to say next.\n\nIt seems that Eddie was given license to be a little bit liberal with his lines. Without a doubt, if Eddie Murphy were not in this movie it would be a total failure.\n\nThe movie barely held its own with the plot, the action, and Owen Wilson. Eddie propelled it from mediocrity to respectability. There aren't many comedians or actors in general that can give life to a movie the way Eddie can."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Pavel-8",
        "review_rating": "5",
        "review_title": "Only half bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "TheEmulator23",
        "review_rating": "4",
        "review_title": "much funnier than expected",
        "review_detailed_main": "I went with a friend to one of those preview screenings, and it was full to capacity. I was thinking just another buddy movie, but the chemistry between the two stars Eddie Murphy and Owen Wilson, was dead on. These guys ad-libed a lot which was obvious, which made the film even more enjoyable. I have to see it again because i missed so much while I was laughing so hard. This movie might not open big, but the word of mouth will keep the people coming back. Oh, and it really has nothing to do with the TV series it is supposedly a take off of. I highly recommend this film for someone who would really like to laugh hard non-stop. Go see it November 1st when it opens. You will come out of the the theatre still laughing of some of the hilarity that ensues. Oh and don't forget, you never really know who is good or bad, especially at the end which the characters don't either, which makes it even funnier. Editing a couple years later. OK I'm not going to change what I wrote then, but I don't know what I was thinking. After seeing this again I still chuckled at a couple scenes but overall this really is bad. So I just thought I would say what I think of it now, but I like to keep my review for posterity. I would skip this, just like everything else Eddie Murphy has done in the 21st century."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Pangborne",
        "review_rating": "",
        "review_title": "COMEDY, people, not action",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "EmperorNortonII",
        "review_rating": "7",
        "review_title": "Mediocre, and That's No Secret!",
        "review_detailed_main": "A lot of old TV shows have been remade as movies in recent years. \"I Spy\" just seems like a TV-based movie made for no better reason than to make a TV-based movie. There are some good action scenes and clever spy gadgets, and that's what this movie has going for it. Other than that, it just doesn't seem truly inspired. This movie is proof that not all TV shows make good movies."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "chickmagnetcrabbman",
        "review_rating": "4",
        "review_title": "Watchable action comedy,some mindless entertainment",
        "review_detailed_main": "If you are in the right mood,this is a watchable action comedy.The two stars show moments of chemistry but not enough,and some of the dialogue (and scenes for that matter) feel somewhat pointless.\n\nThere are some laughs but not as many as you would expect,and I must agree with others that all the best jokes are in the trailer.The action sequences are pretty odrinary and the beatiful,talented Famke Janssen is largely wasted,unfortunately.This is far from the worst film I've seen but many viewers will find Eddie Murphy irritating to say the least."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "FeastMode",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "Funny with a fun (even if implausible) premise executed well. Very similar to Rush Hour. Eddie Murphy is hilarious bringing that fun character to life. The action isn't special but still entertaining. (about 4 viewings, 5/11/2022)"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "nicholls905-280-546911",
        "review_rating": "5",
        "review_title": "Not great, not bad",
        "review_detailed_main": "Funny at times, but considering the concept and talent, this should be better. Eddie Murphy continues a streak, that has been dominated by misses and shows his eagerness to take on sub par choices. Owen Wilson was attempting to launch his leading role status and this appeared like a slam dunk, but throwing together doesn't result in box office. Odd filmmaker choice for the concept and a poorly developed screenplay, results in a par film, that should've been even slightly better."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "tenn-noodlehead",
        "review_rating": "7",
        "review_title": "okay, but why call it I Spy?",
        "review_detailed_main": "I am not old enough to remember the original TV show, but I have, thanks to the miracle of late night cable, I have seen the reruns. The original show was noteworthy of for three things: first, at a time when the average spy show was flashy with gadgets, super spies and super villains and shot for humor like The Man from Uncle, it portrayed a more dramatic show without gadgets that drew its humor from witty dialogue, second, it was the first prime-time show to have an African-American (Bill Cosby) in a lead role, and 3 it was the series debut of Mr. Cosby.\n\nThe only things this movie has in common with the series, is the title, the fact that you have a white spy and a black spy working as partners, and the names of the main characters, although I believe they may have switched the names. The movies has very little in common with the show, so why even bother trying to link them? Trying to pull the nostalgia element into the picture.\n\nThe movie itself is not bad, but it isn't good either. The jokes and the plot are rehash that's been done before, but better. Eddie Murphy pulls his loud and obnoxious, but funny character out of the closet again, but it only helps a little. Wilson plays a sort of bumbling character that he does pretty well. They had the money for a top-notch cast, and plenty of special effects, where is the story, where is the great interaction you need for a good buddy movie. This movie does have some funny moments, but it doesn't stand up to what you know it could have been with this cast and a little more work. It feels like someone was watching late night tv, and said, hey that could work, let's get a black comedian and a white guy and make them spies, and so they got everyone in place then said, oops forgot a script, whip one up quick."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "MOVIEBUF-32",
        "review_rating": "5",
        "review_title": "A Mediocre Movie That Benefits From Its Stars",
        "review_detailed_main": "This flick would've been a total waste had it not been for Owen Wilson and Eddie Murphy. The plot is bone-headed, Malcolm McDowall comes off as a non-entity, not a villian (he has about three lines in the picture...and two of them are the same!), and Famke Jansenn does admirably with the little she was given. If that isn't bad enough, this movie has a film first: this is the first time I haven't been able to stand Gary Cole. Usually, I love him. Here, I was shocked at how blatantly unfunny he is.\n\nHowever, the interplay between Wilson (who's always interesting to watch) and Murphy (who's always hysterical) is quite a joy. Wilson's Alex reminded me of Peter Venkmen in 'Ghostbusters': someone who knows what he's doing, but wants to have some fun along the way. And the way he and Murphy come together, seperate and come together is, while standard, an enjoyable ride.\n\nSo, the verdict? Without its stars, it's a 2. With them, it's a 5."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "TheEtherWalk",
        "review_rating": "8",
        "review_title": "Unfairly bashed",
        "review_detailed_main": "It is true that Eddie Murphy has made some bad movies recently, namely Pluto Nash and Showtime. I only had the opportunity to see Showtime, and it is worthy of it's bad rep. But Robert Deniro sucked big time as well. Anyways, it is curious to see that I Spy is sometimes included in the list. Just because it has Eddie Murphy doesn't mean it sucks. His character, a very hateable and arrogant boxer, cancels out the 'I hate Eddie Murphy' running through our heads as we watch it because we're SUPPOSED to hate him, or at least his character. This was the perfect way to get around his actual ego.\n\nThe actual movie is pretty funny. I especially liked the 'Sexual Healing' scene where Wilson makes an ass of himself (and still scores!) The action scenes are pretty standard, people getting shot, cars blowing up, but the actual chase scenes could have been more interesting.\n\nThe bottom line: Not the best comedy I've seen, but they did the best they could for an Eddie Murphy movie. 7/10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "LegendaryFang56",
        "review_rating": "6",
        "review_title": "Mediocre movie with not enough enjoyment.",
        "review_detailed_main": "This movie is one of those movies that doesn't necessarily suck but isn't that enjoyable either. It's pretty goofy, cheesy, and ridiculous. It was clearly meant to be funny; it just didn't resonate that way with me. It was very predictable too. I'm not sure whether they were intended to take a person or two off guard, but the \"twists\" weren't as such at all. The first thought that crossed my mind with each one before the twist part came along was correct. Very mediocre film as far as enjoyment goes. But it wasn't that bad in more important aspects."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "blsflnthng13",
        "review_rating": "1",
        "review_title": "Worst Movie Ever!!!",
        "review_detailed_main": "I know what you're all thinking- \"Owen Wilson! Eddie Murphy! Wow!\" Try not to fall too deep into such thoughts though, because this is the movie that would scar any actors career. What makes this movie so bad is the fact that the people involved in it actually Tried to make a decent movie... in other words, they didn't go into the project knowing a 'B movie' or 'cheezy sequel' or 'concept flick' would be created; yet they failed sooo damn miserably! This was supposed to be a serious \"buddy-movie\", but with no chemistry between buddies, no comedy, no action, and No Ending, this movie is my pick for worst film of all time (that I've seen, at least). Plan 9 From Outer Space deserves an Oscar when placed next to this floater."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "skymovies",
        "review_rating": "",
        "review_title": "Undemanding buffoonery",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "mattymatt4ever",
        "review_rating": "3",
        "review_title": "I spy a horrible movie!",
        "review_detailed_main": "What the hell happened to the buddy cop genre? Duds like this make you miss more and more the \"48 Hours\" and \"Lethal Weapon\" movies! I am not exaggerating when I say that I can hardly spot a speck of originality in this film! Is there anything the writers and director came up with that required SOME degree of creativity?\n\nAnd what in the hell is going on with Eddie Murphy? I just saw \"48 Hours\" recently, and it really brought back nostalgic memories of Eddie. Back when he didn't choose ANY script that his agent threw at him. Sure, he was in the poorly acclaimed \"Best Defense,\" which he admitted to do strictly for the money, but he didn't make a habit of it. Murphy said in a recent interview that he never knows whether or not the movie will be good or not until he sees the finished product. That's complete hogwash! A good deal of a film's merit relies on the script! Besides, he always improvises a great deal. And if the improvisation sucks, whose fault is that? He must've had absolutely nothing to work with in the script, because all he kept doing throughout the film was recite the lines \"I'll whoop yo a**.\" I'm pretty sure \"I Spy\" can go into the Hall of Fame for most times that phrase was used in a feature length film. I guess since the movie is PG-13, he didn't get the chance to use his favorite \"f\" word, so he simply kept repeating one of the cuss words that is permitted in a PG-13 movie.\n\nOwen Wilson and Eddie Murphy have fine chemistry, but that's no use in such a lame-o piece of crap like this! There's no memorable gags. The audience seemed to find the \"sexual healing\" gag extremely funny, but then again there were millions of kids in the audience. And I think there should be an unwritten rule that if a film resorts to a gag in which two grown men kick each other in the groin, it has reached the lowest common denominator. Haha. When was that actually funny? Ten...thousand years ago??\n\nBut to give credit where credit's due, the movie did bless us lucky men with the sight of the beautiful Famke Jaansen. Oh man, is she a fox! And I must say, she's never looked hotter!\n\nI never watched the original \"I Spy\" television series, but I know Bill Cosby is a man of great, immense talent and if he were to watch this crusty remake, he wouldn't be able to spout out a single compliment with a straight face. First of all, Cosby never resorts to profanity, which this film resorts to frequently, even while being PG-13. And second of all, there's not a single intelligent or witty gag. A movie like this couldn't do justice to a B-movie short subject, much less a popular television series!\n\nUnless you enjoy stale gags which you've seen millions and millions of times, skip this at all costs!\n\nMy score: 3 (out of 10)"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ghettodogaudio06",
        "review_rating": "6",
        "review_title": "Owen Wilson is Bad, James Bad.",
        "review_detailed_main": "Donkey! Whoops, this isn't Shrek, it's I spy with Eddie Murphy and Owen Wilson. I thought this was a decent comedy. I usually hate Owen Wilson but this time around I liked his acting. Playing a not so stylish, stripped down James Bond. He partners with World Heavy Weight Champion Kelly Robins (Eddie Murphy). Robins in Budapest for an important fight battles not only other boxers but Spy's and Bad Guy's! This movie kind of reminded me of Rush Hour with the odd pairing of actors that just seems to work right and be funny at the same time. I have seen Eddie Murphy in way better movies and the same for Owen Wilson. This film is not a laugh your guts out comedy. It's a good movie but no better then a rating of one thumb up and a bag of half burnt popcorn!"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "meddlinkid",
        "review_rating": "3",
        "review_title": "should have spent more time developing the film",
        "review_detailed_main": "Like finding some room-temperature take-out, I'd like to know: who left this thing sitting out on the counter too long? It should be noted that I like Owen Wilson in most anything and usually get a chuckle out of Eddie Murphy, but for a movie about to open, this film seems much more like a rough cut or proof-of-concept edit (if such a thing exists) than a big-name high-action crazy-comedy box-office-smash -- it felt very unfinished. To be fair, I did laugh out loud... about three times. And I never even noticed that one of the boxing announcers was a famous boxer (a wasted cameo from bad editing). This movie should have been a funny gut-busting laugh-filled flick, but even the actor cast as a Steven Seagal wannabe was completely lame. Wait for this one to come out on network TV... it shouldn't take too long."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Adonna",
        "review_rating": "7",
        "review_title": "Their Mission: Avoid the Obvious.",
        "review_detailed_main": "While not your typical cool, action shoot-em-up or James Bond spy movie, \"I Spy\" holds it own in many ways, mainly by avoiding the obvious in the spy movie genre. The plot is nothing new. A U.S. Military airplane that can cloak itself has been stolen by an international arms dealer whose passion is championship boxing. Secret Agent Alexander Scott (played by Owen Wilson), must use civilian World Heavyweight boxer Kelly Robinson (played by Eddie Murphy) for cover to find the plane. However, the real plot of the story centers around the two different personalities of Scott and Robinson (Owen and Eddie), and how they must learn to work together.\n\nSecret Agent Scott is a good agent, but has a knack for messing things up. He doesn't always get the girl, he's not always the last one standing, and he feels dwarfed by the perfect image and reputation of fellow Secret Agent Carlos, a James Bond lady-killer type. But this does not make Scott incapable. His organization and comrades believe in him, but only so much. Kelly Robinson, on the other hand, is the Heavyweight champion of the world, with 57 straight knockouts under his belt. He is nothing short of confident, proud, and intimidating. His persona threatens to overshadow Scott's abilities as a spy, something that Scott is used to.\n\nAt first I was afraid that Owens' character was just along for the ride, t o be pushed around and manipulated by the overtly arrogant Robinson. However, his role fits him well. He can be funny in a down-to-earth, clueless kind of way, while also convincing us that he has a degree of machismo about him as well as intelligence and skill. He cleverly uses Robinson's giant ego into getting what he needs to get his mission completed. This was a refreshing facet to the movie, and Wilson avoids the \"Inspector Gadget\" character type and we pull for him, instead of dreading his next blunder. Scott appears human, just like one of us, and thus he is believable.\n\nMurphy does a great job of providing comedy relief, but not at the plots' expense. He avoids the common trap of just standing to the side and offering crude, hip-hop humor. His character, while a bit annoying at times, develops and we begin to support him as well. While easily the most confident of the two, Robinson actually becomes Scott's biggest fan, encouraging him to take charge and use his overshadowed talents where they are needed.\n\nA unique twist to this movie is the way it avoids the obvious in characteristics of good spy movies, such as spy gadgets and chase sequences. Wilson has his fair share of technology, but some of it is outdated because he is not looked upon as the most \"capable\" spy in his outfit. Because of this, he has to improvise a lot, or even \"borrow\" more sophisticated tech toys from other spies in his division.\n\nAt times the movie slows down for verbal humor and antics between the two characters, but not long enough to lose interest in the plot. Its a light-hearted comedy with sufficient action, but not to the extreme. 7 out of 10."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "mark.waltz",
        "review_rating": "2",
        "review_title": "Does anybody in this know what side they're on?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Davi16mcmu",
        "review_rating": "6",
        "review_title": "Good Fun!",
        "review_detailed_main": "This movie didn't get very good reviews. Sometimes I think that critics can be too analytical of stuff. It can be fun to just sit back, relax and laugh. Owen Wilson is hilarious in general, and I like Eddie Murphy. I thought it was funny. The plot isn't very thick and there isn't really a point, but I enjoyed it all the same. If you are an Owen Wilson fan or an Eddie Murphy fan, then you should have fun."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "4",
        "review_title": "Who was asking for this? Well, it's not bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "signlady",
        "review_rating": "9",
        "review_title": "Ignore low reviews . . . just have fun!",
        "review_detailed_main": "I realize I'm beyond late to the show - maybe when this movie came out expectations were higher? - or somethin' else was goin' on in politics or culture? I can't recall.\n\nI've owned this movie for years, and rewatch it at least once a year or more. It's pure fun!\n\nI really don't know why so many reviewers are so critical of this movie, (and so many other movies) that are just meant to be fun, no-brainer entertainment.\n\nMost of the gripes I read were lame. Sometimes it seems like people jump on a bandwagon to keep from having to form an opinion of their own. They play it safe with ratings of 5 or 6. They take themselves way too serious and their reviews reveal it, and they take entertainment way to serious. I give the reviewers a 2 . . .\n\nBut wait.\n\nI'm supposed to be reviewing the movie. Not the reviewers, so . . .\n\nThe best part of this movie is the never-misses-a-beat comedy-chemistry between Eddie & Owen as they embody their characters. I love the comedic styles of both guys - Eddie's brashness & wit, & winning smile against Owen's insecure, warm & honest charm. The fact that they both have the ability to improvise, play, and bounce off one another, and were allowed to do so by a wise director, is why it all works so well here.\n\nI never realized a correlation with a Bill Cosby movie. Doesn't matter. This was a fun stand-alone movie that doesn't need to be thought of as a remake of anything else. Sure, comedy-action spy movies have the same general themes - but they don't have Owen and Eddie and that makes all the difference.\n\nGreat location, great action, great cast, great direction. Great fun!!"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "dmuldia",
        "review_rating": "6",
        "review_title": "Murphy and Wilson made it worth it",
        "review_detailed_main": "Not much of a plot, but one of the few comedies in which I laughed out loud atleast a dozen times (the last one I remember was Rat Race) The jokes aren't even that good, and sometimes predictable, but the perfect chemistry of Eddie Murphy and Owen Wilson more than make up for it.\n\n6/10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "5",
        "review_title": "Been there, seen that",
        "review_detailed_main": "What is this new fad with making Hollywood movies out of old TV shows? Mission Impossible, Wild Wild West and now this. They just don't work out well; updates rarely work, unless the subject matter is timeless. The biggest problem with the remakes is that instead of referencing the original series, they try to make them hip and cool, using pop icons and throwing in as much action and as many explosions as they can jam in. MI actually screwed the fans of the series over; WWW managed to make a fairly cool premise really lame; and this also does a somewhat poor job of remaking the series. The film comes off as more of a parody of spy flicks rather than a buddy-comedy with spy-stuff. Personally, I'm fine with that, as I hate the regular James Bond-like spy films with ludicrous gadgets and such, but I can imagine many people expecting the latter kind of film were disappointed. The plot is decent... it's not original in the least, but maybe it isn't supposed to be. The pacing is fair. The acting is fine. The characters are somewhat well-developed and interesting. The humor is pretty good, with only a few gags and jokes falling flat. The casting is quite good... Malcolm McDowell is perfect as the villain, and Gary Cole is inspired as the Latino super-agent. Too bad neither of them have enough to do in the film. Famke Janssen is mesmerizing, but that's no surprise. Obviously, it's carried by Murphy and Wilson, and they do a good job, I suppose. Murphy is refreshingly funny and energetic here... haven't seen him in this good shape for a long, long time. Wilson is amusingly pathetic and loser-like as usual, and it works well. All in all, a pretty average buddy-comedy/spy-spoof, but fair if you're a fan of one or more of the actors in the film. I recommend it only to the biggest fans of one or more actors involved. 5/10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Redriot",
        "review_rating": "",
        "review_title": "Very underrated movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "kelliedeep",
        "review_rating": "3",
        "review_title": "Funny but not very good",
        "review_detailed_main": "The direction of this movie was really appalling. There were many parts of the movie where a good director could have tweeked this up to be very good.\n\nWilson and Murphy were great in their roles. I liked the whole idea of the movie and it did have some funny scenes, but overall it just left me hanging. It needed far more pizazz but was sadly lacking. The script could have been much better. The idea was good but the script and the terrible direction made this movie into a single movie and obviously not worth a sequel.\n\nIt could have been so much better and it could have spawned some sequels but for the faulty direction and a script that was not worked on properly."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "lizgrass",
        "review_rating": "6",
        "review_title": "Funny S***!",
        "review_detailed_main": "This movie was just \"okay\", but would have been \"excellent\" if it weren't for the meddling interference of something known as `plot.' Without the `plot', I Spy would have only been about 45 minutes long, but it would have been about 245% better. Just give me Owen Wilson and Eddie Murphy bantering back and forth about women and cock size and I'm happy.\n\nThe `plot', which I'm told is an integral part of most films, is laughable if not downright s****y. Alex Scott (Wilson) is a government agent assigned to search for an invisible spy plane and fly it home. To be really clever and un- governmenty, his agency decides to pair him up with a civilian, the cocky Kelly Robinson (Murphy), a championship boxer and all-around pimp for the ages.\n\nLet the hilarity ensue!\n\nAnd ensue it does. Hysterical slap-stick comedy and raunchy buddy humor make I Spy a great movie (to rent) and one of the best comedies ever to feature a black man and a white man and Famke Janssen.\n\nCome to think of it, though, the `plot' is pretty funny in its own right. Just wait until a Chinese criminal asks the guy from Clockwork Orange if the plane is `really invisible' (hold your horses, it is!!). You'll be literally sitting camly on your seat and kind of chuckling. And when the love interest (Janssen) pulls a switcheroo, you might just not pee your pants.\n\nFunny for sure. But unfortunately, the funniest scene is the `Sexual Healing' duet that features prominently in every teaser, trailer and commercial."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ArtVandelayImporterExporter",
        "review_rating": "1",
        "review_title": "Might actually be worse than Pluto Nash",
        "review_detailed_main": "Did the studio release this to take away some of the stank that Pluto Nash smeared on Eddie Murphy's career? Didn't work. This might actually be worse.\n\nFirst of all we are treated to Eddie Murphy doing some kind of obnoxious self-absorbed celebrity-athlete shtick. None of it is funny. Then we have Owen Wilson being Owen Wilson, aka white toast. Malcolm McDowell shows up as the bad guy. Famke Janssen is the eye candy. None of it works.\n\nI can certainly see why the Razzies gave Murphy a Special Achievement Award for being the worst actor of the Oughts. I'm surprised his career even survived to 2003, much less 2011."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Mr_Sensitive",
        "review_rating": "7",
        "review_title": "This Movie Doesn't Work Out As It Should Be. Embarrassing To Watch",
        "review_detailed_main": "I am the fan of Owen, but this movie suck. And though the two actors were pretty OK this movie is completely destroyed by it have no plods and no cinematic technical in them.\n\nStory: When the US Govt. Jet was stolen, they sent a spy (Owen) team up with the cocky boxer (Eddie) to track it down through business from the Hungarian Illegal Weapon Dealer.\n\nThe story didn't sound that bad but the movie is. You wouldn't feel like watching it. It is embarrassing to watch, it is not the actor fault but the movie itself is totally wrong. I think it called cinematography and director fault.\n\nAnd It Not Funny One Bit\n\nOverall: Skip It And You Miss No Thing (maybe just Famke Janssen)\n\nRating: 4/10 (Grade: F)"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "4",
        "review_title": "A silly, meandering mess",
        "review_detailed_main": "I Spy is a silly little piece of fluff with not a whole lot of merit to it, besides some slick production design. It's based on a cherished television show of the same name that ran during the mid 60's, starring Bill Cosby and Robert Culp. I have never seen an episode, so I couldn't tell you how that show differs from the film, but the film struck me as redundant and overly shtick-y, even for outlandish actors like Eddie Murphy and Owen Wilson. Murphy is eternally more magnetic and talented than Cosby ever was so I guess there's that, and Wilson does his usual sheepish wannabe alpha thing which holds up for a little while before we want to rearrange that nose of his with our fists for the fiftieth time. He plays a top secret government agent who is attempting to stop the purchase and use of a military prototype jet that can literally turn invisible, from both the naked eye and sonar detectors. To achieve this task, he needs the help of a mouthy, arrogant professional athlete, played by Murphy. Don't ask me why he needs him because I don't remember, but giving him someone to constantly bicker with for the whole movie seems to be the only reason I can think of. They natter at each other for friggin ages on end, until we feel like the film consists more of them bitching at one another than actually... you know.. spying. The quality level spikes a little bit when Famke Janssen shows up as the obligatory Femme Fatale, clad in black leather and dosing out sexy charisma in spades despite the fact that she's ultimately not given much to do. There's an underused Gary Cole and a suave Malcolm McDowell who plays the arch villain and culprit of the whole scheme with class and sass that the film hardly deserves. This one's a dud, there's just no way around it, and there's nothing I hate more than dishing out a negative review, but I needed a spare Famke flick to round out the week's work, so find it in your heart to forgive me pls."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "=G=",
        "review_rating": "6",
        "review_title": "Awful and funny...",
        "review_detailed_main": "...but not awfully funny. \"I Spy 2002\" pairs motor mouth Murphy as a boxer with Owen \"the nose\" Wilson as a 006.5 spy guy who save the day by taking on a bunch of bad guys in Hungary who want bomb W.D.C. with a stolen stealthier than stealth aircraft. A clumsy flick by all counts, Wilson and Murphy are the only two reasons to give this always busy, sometimes funny, and very mediocre comedy romp a look. Best saved for the small screen. (C+)"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "cydonian_warrior",
        "review_rating": "1",
        "review_title": "Worst bad guys ever, and terrible fight scenes",
        "review_detailed_main": "I'll never get that hour and a half back. The bad guys were laughable, and the few guys in the film that were supposed to be great fighters made me laugh out loud. If the film was released as a spoof then it would have been great."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "cankaanpapila",
        "review_rating": "8",
        "review_title": "A Fun Weekend Movie",
        "review_detailed_main": "It's a funny, entertaining movie. And that is what it's trying to be. I wasn't expecting to be blown away I was expecting to laugh and I did. I loved the chemistry between Eddie Murphy and Owen Wilson. The movie just did what it intended to do. The movie is almost as old as me and I just enjoyed watching it. I don't see any reason to give it a score lower than 8. I got what I was expecting and I'm happy about it."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jebiga",
        "review_rating": "6",
        "review_title": "entertaining",
        "review_detailed_main": "I don't understand why people complain about this movie...? It is not Amadeus/Platoon/or Memento but I can not beleive that anyone expects that from I SPY. It is entertaining, stupidish on occasion, and even had few scenes that made me pause the DVD just to laugh....! I was surprised! I can't remember when that happened last time...? 6/10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "KevinB12",
        "review_rating": "4",
        "review_title": "Samuel L. Jackson should play Kelly Robinson",
        "review_detailed_main": "Samuel L. Jackson should play Kelly Robinson because he is more of an action person than Eddie Murphy. He can do better than Eddie Murphy in that movie if he should consider for the part of Kelly Robinson. Apparently Samuel L. Jackson did not know anything about being interested in the movie because I thought he would play a great Kelly Robinson only more aggressive and tough talking action person. Eddie Murphy is not a good Kelly Robinson because he is more of a comedian than an action person. Eddie Murphy should stick to comedy movies all the time and not action movies. Leave the action movies to Samuel L. Jackson only and not Eddie Murphy."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "another abysmal TV retread",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "mikehammond8",
        "review_rating": "4",
        "review_title": "Unless your thinking of visiting Budapest, this is not worth the time",
        "review_detailed_main": "Another pretty lame sidekick movie from two actors who are normally very good. The problem is that Owen Wilson does Owen Wilson very well and Eddie Murphy does Eddie Murphy just as well, but all with very few actual jokes. Interesting to see it filmed on location in Budapest as, at the time of writing this review, I had just visited the city and was pleased to see many of the sights I had visited just weeks before. Other than this the excitement, which should be top draw for a spy movie (even a spoof one), never really appeared and both script and plot are thin and poor. Wilson and Murphy do well playing themselves with very little to work with but I doubt they'll be listing it as one of their career best. If you want spoof espionage stick to Austin Powers."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "bound-to-sanzo",
        "review_rating": "6",
        "review_title": "Cool But Not Cool",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "movieman_kev",
        "review_rating": "4",
        "review_title": "I spy a terrible movie",
        "review_detailed_main": "In this dire remake of the mid to late 1960's Television series of the same name, Eddie Murphy takes over for Bill Cosby and Owen Wilson stands in for Robert Culp. In the version Kelly Robinson is an arrogant cocky boxer who is teamed up with less then stellar secret agent Alex Scott on a secret mission to recover a high tech stealth fighter plane. Unimaginative, unfunny, and VERY generic doesn't help this movie any. Eddie Murphy should just quit making movies while's he's far behind. Give his more talented brother, Charles some roles instead. He sinks Owen down. The 4 screenwriters (yup it took 4 to come up with this crap) sadly are not done with sub-par terrible re-makes. Nope not by a long shot, Cormac and Marianne Wibberley are making re-makes of \"The Shaggy Dog\" AND \"I Dream of Jeanie\", while Jay Scherick and David Ronn are going to be held responsible for an all- black version of the Rodney Dangerfield classic \"Back to School\". All 4 are a great examples of why Hollywood is a barren cesspool of unoriginal crap.\n\nMy Grade: D\n\nDVD Extras: Both Widescreen & Fullscreen versions; Commentary by director Betty Thomas, editor Peter Teschner, producer Jenno Topping, and writers David Ronn & Jay Scherick; 4 featurettes (Cloak and Camouflage, Gadgets and Gizmos, Schematics and Blueprints, and The Slugfest; and Trailers for \"Adaptation\", \"Blue Streak\", \"Formula 51\", \"National Security\", and \"Punch Drunk Love\"\n\n1 Easter Egg: Highlight the motorcycle head light in the Extras menu for an interview with Eddie Murphy about boxing"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "LetsReviewThat26",
        "review_rating": "6",
        "review_title": "another good bond type film",
        "review_detailed_main": "I spy was a lot of fun, dont get why it floped and though it will most likely never get a sequal, its nice to have this. Murphy and wilson just seem to click, both fun actors in their own right and they come together well here. Murphy plays kelly, a boxer that for some reason knows the president and out of the blue he wants him to do a top secret mission. Wilson on the other hand plays alex, and actual fbi agent that is very hesitent to work with the egotistical boxer both of which have to take down mcdales gundars before he can sell and invisible ship. Good cast and it had that fun buddy cop type feel that I always enjoy overall just an enjoyable film."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "thehardyboyz2043",
        "review_rating": "4",
        "review_title": "Fine casting job, but very bad results",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "salciuco@inwind.it",
        "review_rating": "6",
        "review_title": "One of the best Murphy's movie to the later years",
        "review_detailed_main": "Eddie Murphy isn't a great actor, his characters are stereotyped and each of his roles seems equal to himself, but he got a funny and likely personality out the ordinary, because in each of his movie the laughter are safe, and specially if he is served to a good story and directory. Unfortunately the latest movies were based only on his comic verve, but. for `I SPY' isn't so. The movie is inspired by to the old series of the \u0091 70 with Bill Cosby and Robert Culp(only inspired, also the roles are reverse). The story is enough to get to know, but efficacious : the `odd couple' forced to stay together and in the end become inseparable . Here the our two heroes must recover a super airplane steal by a con of Budapest, where the boxer champion of the world(Murphy) go for a match, and in his staff there the spy undercover charged to the mission(A good Owen Wilson). Useless to say that the two men are many clash between them and his comparison is very hilarious. Anyway the story is good constructed and there is a chase absolutely irresistible and funny, where it remember you the old Murphy's movie such as `48 hours' .Few surprise on the end liveliness the story also to more(but its are a little foreseeable), and Eddie Murphy is too funny (as I had already say)in couple to his co-star Owen Wilson( also he very funny and good), that we had the pleasured to saw him in movie as `Meets the parents', `The Royal Tenenbaum' and that soon we see in the movie inspired by the TV serious of `Starsky and Hutch' in couple to his friend Ben Stiller.My rate is 6."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "SinjinSB",
        "review_rating": "5",
        "review_title": "Just a run of the mill spy comedy",
        "review_detailed_main": "I haven't seen the original 60's TV series, so I can't compare it to this movie. The movie itself is just a run of the mill spy comedy, pairing unlike partners Owen Wilson and Eddie Murphy. This movie is highly unbelievable, has a plot that is meaningless...yet, it's not a complete waste. There are a few moments between the characters that are entertaining. That's not nearly enough though. The premise that the government would use a boxer as an agent is silly. Not sure why the rush on these type of films, because none of them have been very good. I Spy, Bad Company, Showtime are all interchangeable...and generally not worth the price of admission.\n\n** (Out of 4)"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "kyle_is_awesome",
        "review_rating": "8",
        "review_title": "Eddie Murphy and Owen Wilson were great toghether",
        "review_detailed_main": "I know most people dissagre but I thought this movie was funny, fast-paced, and action packed. I thought that Owen Wilson and Eddie Murphie were a good choice for this movie. The only thing I thought could be better is that the movie was very very quiet for a part of it (so that I had to turn the volume as loud as It could go to hear them.) Then something loud, like an explosion, happened and you could hear it thoughout the house. Besides that it was great and would recommed it (only to teenage boys though.)"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ozfinn",
        "review_rating": "7",
        "review_title": "Look out Budapest!!",
        "review_detailed_main": "I went to this film just because I'd seen on the trailers that it had been filmed in Budapest (I lived near there for a year) and just wanted to see it on film. I didn't really know what to expect from it. I loved this film from beginning to end. I ended up dragging some of my friends along to see it for a second time. Eddie Murphey and Owen Wilson work strangely well together. Famke Jannsen always works well(!!). In fact the only things I can find to complain about with this film is a couple of geographic errors (in the chase scene after they flee the Buda Castle) and Owen Wilson's, to be frank, horrible attempts at Hungarian. Other than that though this film is excellent. Oh and yes the Gellert Baths really do smell awful (though maybe not quite like ass soup!!). 9/10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "PatrynXX",
        "review_rating": "5",
        "review_title": "So so. Better than Haunted House",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "good casting that's only slightly effective",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "dav7nine",
        "review_rating": "5",
        "review_title": "Quite good",
        "review_detailed_main": "Thought this film was alright..... I think Eddie Murphy is a comic genius! If you disagree... then watch his stand-up film Delirious (circa 1983!!!) and tell me it's cr*p.\n\nHadn't heard of this film at all however and seeing Owen Wilson was in it - thought I'd watch it.\n\nIt was alright, I thought the dialogue was excellent between the two of them. The action sequences were a bit mind-boggling to accept, but I don't think the film was really supposed to contend with the action-blockbuster genre. It's more a spoof/spy/comedy film that all the family can watch.\n\nIf you like Murphy or Wilson, then you'll probably think this is OK, sort of watchable once.....\n\n5/10 Dave"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "spoodie",
        "review_rating": "7",
        "review_title": "Possibly the funniest buddy movie since the end of the Lethal Weapon series",
        "review_detailed_main": "Eddie Murphy and Owen Wilson, as the bumbling secret agents, have good comedy chemistry, although I found myself struggling to understand all the fast-paced dialogue favoured by Eddie Murphy. If you can get past the ludicrous plot and ridiculous set- pieces you will enjoy a good laugh."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "pearlexotics",
        "review_rating": "5",
        "review_title": "Almost funny...almost",
        "review_detailed_main": "I like Owen Wilson and Eddie Murphy, but in this movie they go together like peanut butter and mustard. There simply was no chemistry and very few laughs.\n\nWilson plays the same \"introspective, sensitive guy\" character he played in Shanghai Noon. And Eddie plays the same type of character that he played in nearly all of his movies. Maybe with a better script this flick would have had a chance. But it's all formula and no funny. Bumbling spy recruits tough guy to help save the world. Too bad they couldn't save this picture.\n\nSorry, guys! Better luck next time."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "JurassicPark1988",
        "review_rating": "7",
        "review_title": "Started out good...ended even better!",
        "review_detailed_main": "I saw this movie yesterday at a preview screening at thought it was a really well done, good movie! The acting was good on both Eddie Murphy and Owen Wilson's parts! The comedy may not have been totally original, but it was done well a second time! If you get a chance to see this, I suggest you do!"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "bernd_hohmann",
        "review_rating": "4",
        "review_title": "Plot OK, but Eddie goes on my nerves",
        "review_detailed_main": "A white educated man and a black dumb bigmouth must work together.\n\nThis plot is so worn-out I cannot believe that someone gives a nickle on it.\n\nAfter 30 minutes I had the opinion that Kelly Robinson (Eddie Murphy) understand his job but seconds later he was the usual dumb shitty bigmouthed chatterbox again.\n\nA clever interpretation of this plot can be found in \"Wild Wild West\" for example - but \"I Spy\" is embarassing.\n\nPeriod."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "dolbyboy",
        "review_rating": "7",
        "review_title": "96 minutes of fun",
        "review_detailed_main": "This movie is just what Eddie needed after appearing in that awful Pluto Nash. Eddie and Owen are both fun to watch, but I would have liked to see more gadgets used. Eddie seems like he's having fun and more relaxed. This movie ain't no James Bond or Spy Kids, but it sure hits the spot for action and comedy from two fine actors today."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "movieguy1021",
        "review_rating": "5",
        "review_title": "I Spy: 5/10",
        "review_detailed_main": "I have not seen the T.V. show that this is a spinoff of, so that may have influenced my review some. But I don't think so.\n\nOwen Wilson is Alexander Scott, a bumbling special agent who has a crush on fellow agent Rachel (Famke Janssen), but, of course, never has the nerve to talk to her in other than work-related speeches. When Gundars (Malcolm McDowell) steals a plane that can become invisible (how do you steal a plane?), Alex teams up with \"civilian\" Kelly Robinson (Eddie Murphy), who just happens to be a championship boxer whose ego is greater than this flim's budget. They team up to solve the crime.\n\nThis film is OK, put in layman's terms. I did chuckle a couple times (OK, maybe more than a couple, but not enough to put me in stiches), and some scenes with one-liners were especially good. But this movie is nothing memorable.\n\nIf one actor could be underused, it's Owen Wilson. If one actor could be overused, it's Eddie Murphy. I Spy looks like Eddie's biggest hit of the year (behind Showtime and The Adventures of Pluto Nash), but that's not saying much. When I went, there were about ten people max in the theater. Then again, who goes to a movie on Sunday at 2:45? Anyway, Owen Wilson is in top-form here, clearly loving acting in his comic goofiness. Eddie is OK, but nothing memorable. Am I the only one thinking that his egotistical acts weren't acting?\n\nBilled as an action-comedy, there were only about two action scenes. They had a possibility to use a lot of gadgets, but for some reason decided to only use a few (though the invisible plane was pretty cool). No heart-pounding situations here, but the couple action scenes were OK. There was chemistry between Wilson and Murphy, but goes for those too-often \"buddy movie twists\" where they hate each other for a little but then get back together when one of them's in trouble.\n\nIn the ending, there was much switching sides, nobody knew who was on their side. Even the people who were switching sides didn't know after awhile. Unfortunately, they left off at a \"sequel space\" and tried to wrap everything up in the ending.\n\nThe subplots seemed to be too long and unecessary. It must have been a ten-minute scene where Wilson is trying to \"seduce\" Janssen with Murphy feeding him lines. It didn't do anything for me.\n\nIf you're looking for a mildly funny, interesting but gadget-lacking movie, I Spy is it. If you aren't, steer somewhere else.\n\nMy rating: 5/10\n\nRated PG-13 for language, fake explosions, and sexual innuendo."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "bigv82",
        "review_rating": "8",
        "review_title": "great comedy",
        "review_detailed_main": "Wow, what a surprise. This movie has not received any recognition, but I for one loved it. Eddy Murphy puts out an amazing performance, only surpassed by owen wilson. This movie had me laughing from start to finish. The action sequences are a bit dumb, but the writing makes up for it. I highly, highly recommend this for anyone with a sense of humor. In fact, the writing and acting in this movie rivals \"what about bob\". My all time favorite. Thats all from big V over and out."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "NonnaYobidness",
        "review_rating": "7",
        "review_title": "Much better than I expected",
        "review_detailed_main": "I enjoy the original \"I Spy\" television show as much because Bill Cosby is in it as for any other reason. It's an entertaining show with a nice touch of 60's cheesiness. Robert Culp and Bill Cosby travel the world posing as a professional tennis player and his trainer. Crime fighting tennis players. Good stuff.\n\nAnyway, being a fan of the television series, I naturally expected the movie to suck. My biggest fear was Eddie Murphy being in the movie. Eddie Murphy, in my opinion, is one of the most genuinely talented comedians the modern world has seen. Unfortunately, his movies can also be some of the most genuinely lame schlock that moviegoers have ever seen. Another concern was that the commercials made it clear that this movie was more of a b***ard child of the original series than a remake; obviously geared more for comedy then mystery, action or suspense. Between the hit-and-miss quality of Eddie Murphy's movies and the seemingly drastic departure from the original series, I was apprehensive.\n\nI am glad to say that my fears were unfounded. Eddie Murphy was brilliant as Kelly Robinson and the movie was pretty darn funny. There's one scene in a sewer that drags on a bit and let's Eddie Murphy get a little too silly, but other than that the movie clips right along with steady laughs and good action. Owen Wilson is great in his role as a lovestruck secret agent with Carlos-envy. There is a fair amount of on-screen chemistry between Eddie Murphy and Owen Wilson. They're not quite Gene Wilder and Richard Pryor, but they're off to a good start.\n\nAlso worth mentioning is Gary Cole as Carlos the super-spy. You may remember Gary Cole as the passive-aggressive Bill Lumberg from Office Space (Haven't seen it? Go rent it immediately!) or, more recently, as Bill Owens in One Hour Photo. Carlos has a smallish part in I Spy, but it is deftly and amusingly executed. I hope to see more of Gary Cole in comedic roles in the near future.\n\nOn the whole, I think this movie is well worth going to see. I don't expect it to bring home as many awards as the television show did, but I do expect to see an \"I Spy 2\". If you're looking for some good laughs and cool gadgets, I Spy is a great way to spend an evening. Just don't go expecting to see Robert Culp and Bill Cosby.\n\nAn interesting side note: while the movie keeps some of the same basic elements as the TV series (two male leads, one black, one white, one a professional athlete) and the characters keep the same names they had in the TV show, their names and roles are reversed. In the television series, Robert Culp played Kelly Robinson and Bill Cosby played Alexander Scott. In this movie, Eddie Murphy plays Kelly Robinson to Owen Wilson's Alexander Scott.\n\nI Spy: 7/10 + a few bonus points for the cool gadgets."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Karpy9",
        "review_rating": "3",
        "review_title": "Where's the Funny?!",
        "review_detailed_main": "I rented this movie a little while ago expecting to laugh, I didn't. Eddie Murphy cussed every other word which is usual for him but this just like in Showcrap oh! excuse me Showtime he wasn't funny, I wasted 2 hours watching this so-so movie"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Li-1",
        "review_rating": "",
        "review_title": "Painfully generic and poorly crafted.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "oneguyrambling",
        "review_rating": "7",
        "review_title": "Sunday arvo DVD fare. Heavy on light comedy and light on heavy action.",
        "review_detailed_main": "Alex Scott (Owen Wilson) is a mediocre spy, jealous of the better credentialed, better equipped and better-looking around him.\n\nWhen he teams with a (literal) heavyweight, the undisputed boxing World Champion Kelly Robinson (Eddie Murphy), who boasts not only a 57-0 record (often), he also boasts about just about everything else that one man can boast about.\n\nThe impossible duo try to utilize Robinson's fame and renown to gain access to a top secret US spy plane that has been stolen, using an upcoming Robinson fight in Eastern Europe as cover. Famke Janssen is also on board as a co-spy and love interest.\n\nFortunately to fast track proceedings the new bout for World Title clinching 58-0 is being hosted by Gunders (Malcolm MacDowell), the very same bad guy that is selling the plane to the highest bidder – he too is using the fight as cover.\n\nBeing a long time Champion Robinson is used to being fawned over and getting things his way, he lives 'the life'; jewelry, stretch limousines, private jets, referring to himself in the first person constantly, transvestites\u0085 (whoops confusing real life and movie life there). Robinson and Scott argue over who is controlling the mission, Robinson thinks he should as he is the bigger name, Scott thinks he should because, well he's the spy and all. Scott tries to seduce Robinson into doing things his way by showing him the spy-toys and gadgets, only to repeatedly learn that the only thing to seduce Robinson – is Robinson.\n\nI-Spy is heavy on the light comedy, and light on the heavy action, choosing to favour and rely on Wilson's 'Awww shucks' likability and Murphy's bravado. It is a combination that very nearly works, this is Murphy's best film since Bowfinger, and his cockiness and misguided self confidence complements Wilson's 'Wilson-isms'.\n\nThe ridiculous action is pretty fun, frivolous and forgivable given the chuckles that it elicits, but it must be said that the final 15 minutes are not so successful, and ends the film on a flat note.\n\nI-Spy has a couple of genuinely funny scenes, lots of inoffensive action and enough bright colours to keep most amused. It is the perfect low key Sunday arvo DVD, where it doesn't matter if you sleep through 25 minutes or so.\n\nFinal Rating – 5.5 / 10. I-Spy is a diluted version of many other admittedly better mismatched buddy action comedies. It is a shiny expensive forgery of a superior original, but that by no means makes it worthless. Another film that might be tough to choose, but easy enough to watch."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "dan2058",
        "review_rating": "7",
        "review_title": "Uninsulting, good-natured fun, but in no way memorable.",
        "review_detailed_main": "Owen Wilson is building up quite a reputation for his 'stoned-out' and completely chilled persona. It's amazing really that with the variety of characters he's played, he is always Owen Wilson. Yet his act is at least original and for Wilson fans this film delivers more of the same.\n\nEddie Murphy hasn't really achieved much in recent years apart from being the voice of Donkey in Shrek, so this conversion of a 70s TV show could prove to be the platform that lifts him back into form.\n\nHowever neither Wilson or Murphy are particularly inspiring but yet do deliver a few laughs. The heart-to-heart in the sewer is great comedy. Yet it's all still a bit lightweight and won't leave an everlasting impression.\n\nTo be fair it never sets out to, comedies of this nature never do. As far as buddy movies go, I-Spy is above average and delivers all that it promises but nothing more.\n\nEnjoyable spy-romp but instantly forgettable. 7/10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "hippiegal",
        "review_rating": "6",
        "review_title": "Cute, likable movie",
        "review_detailed_main": "This movie pretty much has nothing to do with the original 60's series. After watching what Hollywood has done with the Avengers and the Wild, Wild West this is most likely a blessing on the part of the classic TV show. Anyway this movie pretty much is the typical standard buddy cop movie mixed in with the standard spy movie. Eddie Murphy hams it up as a very annoying boxing champion recruited to help Owen Wilson find a invisible jet.(Shades of wonder woman anyone?) So of course mayhem follows right after them. Owen Wilson is very enjoyable as the clumsy spy just trying to get his job done. His performance gives the movie sort of a charming feeling that saves it from being a jumbled farce. Overall this movie won't win any Oscars, but it's a nice film for a Saturday afternoon at the movies."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "commodusone",
        "review_rating": "10",
        "review_title": "The kids and I loved it",
        "review_detailed_main": "To be fair I didnt expect alot and you fully expected that all the best bits were in the trailer. I think owen has a very dry wit and engagingly charming persona and when eddie is on form to be fair he hasnt been since donkey in shrek he is fantastic. The plot lets face it is just a mechanism to get these two interacting with one another and I think it works and famke janssen is just so sexy she is fantastic. I dont think this film would have worked without owen and eddie but I laughed out loud a lot."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "score-10",
        "review_rating": "7",
        "review_title": "nice 'un !!",
        "review_detailed_main": "This is an unexpectedly classy spoof, possibly the best in some while and certainly the best that Eddie M has done since Trading Places. The movie obviously spoofs the Cruise Mission Impossible as well as the superspy/secret agent genre in general, including the original TV series but is vastly more amusing than Neilson's and Atkinson's more or less contemporary offerings. The gags are not 'cookie cutter' and the action/drama actually has tension/suspense too.The support cast is fine with femme fatale Fannke (?) playing her part perfectly while Wilson entertains as the Bond wannabe; unless some FX was involved, Eddie is in amazing physical shape. The story, screenplay and direction are well done. The gods were in a sour mood indeed for this film to not have done better at the box office; ce la vie"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "rdoubleoc",
        "review_rating": "9",
        "review_title": "Even in 2021, still a great and underrated movie.",
        "review_detailed_main": "This is one of Owen Wilson and Eddie Murphy's best movie, both. Every time I watch it, it's still entertaining. We need more movies like this.\n\nIt's odd how it didn't even make as much as its budget."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "lukem-52760",
        "review_rating": "8",
        "review_title": "EDDIE MURPHY & OWEN WILSON ARE GREAT FUN",
        "review_detailed_main": "I genuinely enjoyed this action comedy set in the Spy-world with a great casting of the Comic genius Eddie Murphy & the chilled-out mellow Owen Wilson!!! The mismatched buddy-cop formula is used well for this fun spy adventure flick.\n\nI remember going through a fase of watching this like every night as a comfort film for a while because it is a fun flick & i have fond Nostalgia of watching it at the cinema.\n\nI still remember going to the Cinema & seeing \"I Spy\" & i remember how empty it was & what a small little screen it was on, almost like they knew it was a box office bomb already? As it turned out they was right as it only lasted a couple of weeks i think at the cinema & no one seemed to Like it all...but i did & i laughed alot at the hilarious banter between our two mismatched heroes with Eddie Murphy as the cocky boxer Kelly Robinson who is teamed with a silly Spy agent named Alex Scott (Owen Wilson) & there's the super sexy spy Rachel (Famke Janssen) also there to help the foolish duo, now these two have got to learn to work together to find a stolen Spy Plane that is in the hands of dangerous arms dealers & the fun Villain here is played by the great Malcolm McDowell & he makes a great badguy & is alot of fun on screen.\n\nThere's plenty of Awesome action set pieces & cool gadgets & special effects & this Action comedy had a big budget so everything looks great & the cinematography is slick but alot of people just didn't like it? I don't know why? I suppose we all like different things & i never listen to the \"Critics\" when it comes to films because i usually love the films the Critics hate & hate the films the Critics love lol, so i found \"I Spy\" to be a good fun Action Comedy with alot going for it to be very entertaining & a nice easy watch, also like i said Eddie Murphy & Owen Wilson really do make a great odd-couple & reminded abit of the 80's Classic Spy Comedy \"Spies Like Us\" with the great teaming of Chevy Chase & Dan Aykroyd.\n\nA genuinely fun Comedy with some good action scenes & some nice chemistry from its two leads.\n\nVery well directed by Betty Thomas who also directed Murphy in Dr. Doolittle."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Catherine_Grace_Zeh",
        "review_rating": "9",
        "review_title": "Absolutely hilarious film!",
        "review_detailed_main": "I SPY, in my opinion, is an absolutely hilarious film! I thought that Kelly (Eddie Murphy) and Alex (Owen Wilson) were absolutely comical guys. You guys are great together! My absolute favorite quote of this film is, \"Yeah, except I'm going to be double-09½.\" The part I really like is when Alex is singing Marvin Gaye \"Sexual Healing\" to help Kelly speak to Rachel (Famke Janssen). When I first saw Gundars (Malcolm McDowell), I thought Arnold Schwarzenegger was playing him. Before I wrap this up, I'd like to say that I hope Eddie Murphy and Owen Wilson make another film together in the future. Now, in conclusion, I recommend this film to those of you who like Eddie Murphy or Owen Wilson."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "guisreis",
        "review_rating": "8",
        "review_title": "What if Apollo Creed and Xenia Onatopp were in a James Bond spoof?",
        "review_detailed_main": "Funny 007 spoof, full of nice jokes and with not 100% predictable clichés. In the middle there are some too conventional action scenes that worsens the movie's quality, but it goes back quickly to what it does better: the mockery gags. Arrogant boxing champ Kelly Robinson and sensible and not confident special agent compose a great duo, Carlos is a very funny Latin James Bond, and gorgeous Famke Janssen delivers us a Rachel that makes us feel that we may have Xenia Onatopp once more."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "gavansimkin",
        "review_rating": "10",
        "review_title": "I SPY",
        "review_detailed_main": "After 20 Years this is still one of Eddie Murphy's best Movies made, makes me laugh so hard."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "maggsy69",
        "review_rating": "10",
        "review_title": "awesome!",
        "review_detailed_main": "when this film came out 2 summers ago, i was working at my local cinema. although the trailer looked funny, i had a feeling all the good stuff would be in that. how wrong could i be?\n\neddie murphy and owen Wilson bounce off each other as if they were a comedy double act who've been working together for years. the sexual tension between Wilson and famke janssen is so funny that i nearly split my sides when he compliments her on her stick shifting! never before has a more goofy line made such an impression!\n\nthe story may not be up to much but you will laugh your head off all the way through it so it doesn't really matter.\n\nthis may not be to most peoples taste's but i believe its a cult classic.\n\nif you want an easy going film with plenty of laughs, watch this film. i guarantee you won't be disappointed. 8.5-10"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "george.schmidt",
        "review_rating": "",
        "review_title": "NO CULP & COSBY BY A LONG-SHOT!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "DarthJordan",
        "review_rating": "10",
        "review_title": "A Classic!",
        "review_detailed_main": "This isn't for everybody, but I've always loved this movie. It's hilarious and one of Eddie Murphy's most underrated movies. It's not an award winning movie but it's a 10 in my book!"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "perni",
        "review_rating": "",
        "review_title": "The most boring action film ever made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "rock31620",
        "review_rating": "10",
        "review_title": "90 minutes of fun and entertainment",
        "review_detailed_main": "I thought I Spy was a great movie. Eddie Murphy and Owen Wilson have great chemistry. Murphy is hilarious as Kelly Robinson, the undefeated boxing champion. It was very funny- especially the \"Marvin Gaye Scene\". It also had some good action, but the comedy is still present. I want to see it again. Go out and see it if you need some time to kill. It is a very short film."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "Surprisingly Funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "kemedlin",
        "review_rating": "9",
        "review_title": "pretty good! I was pleasantly surprised!",
        "review_detailed_main": "I think this was Eddie Murphy's best picture since Beverly Hills Cop. This film will not be winning any Oscars but it was very enjoyable. Eddie and Owen Wilson make a good pair. Eddie's outrageous and over the top character contrasts well with Owen's shy, slightly geeky and mischevious character. There were actually a couple of scenes I thought I was going to bust my gut laughing, and I wasn't the only one. I was in a packed theater and everyone was having a good time.\n\nThe movie has action, drama, and funny comedy. It is rather predictable but overall a good evening out."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "The Spies Who Bored Me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "PopaSmear",
        "review_rating": "8",
        "review_title": "Good against all odds.",
        "review_detailed_main": "This movie has EVERYTHING going against it, and yet it prevails. The script is great, the action stays funny instead of trying to get serious. Owen Wilson and Eddie Murphy both do a great job, even if Murphy is basically playing Donkey from Shrek. I saw this at a free preview, and will be sure to see it again when I get the chance."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "mitnaheem1",
        "review_rating": "8",
        "review_title": "I laughed my ass off",
        "review_detailed_main": "I laughed so hard my stomach hurt and my eyes watered. To all those saying it's not a good as the the TV series I say \"and you're not 15 anymore so get over it!\" Did you really expect that duo to artfully reconstitute history? I expected to laugh and was not disappointed"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "saberx",
        "review_rating": "10",
        "review_title": "Very funny movie!",
        "review_detailed_main": "Previews for I Spy made it look like it was gonna be a very lame movie, but I saw it on DVD and couldn't stop laughing! I'm not sure why it got such low reviews; I thought it was great. I guess it all depends on your opinion of what's funny. I give this movie a B+."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jeekthegeek",
        "review_rating": "10",
        "review_title": "great movie and comradery between Murphy and Wilson",
        "review_detailed_main": "I loved this movie. It was great entertainment which is what a movie is really supposed to be. Wilson and Murphy play off eachother wonderfully. There may be some holes and what not, but what movie doesn't when nit picked."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "harasylime",
        "review_rating": "8",
        "review_title": "All about the chemistry",
        "review_detailed_main": "This movie is a must see for anyone who enjoys Eddie Murphy or Owen Wilson. I like Eddie Murphy fine, but Owen Wilson is the one who drew me to the movie. His dry humor has ample time to shine in this film. It was great to see him get a chance to be the \"hero\" more than the sidekick for a change. If you came looking for a big-screen adaptation of the TV show, or for an intricate plot with great action - well, you came to the wrong place. The plot and action serve only one purpose - they are a background in which Murphy and Wilson can do their thing. I watched the movie only to enjoy the banter between the two of them and I was not disappointed in the least. They work well together - the comic timing, the muttered lines by Wilson, the flashiness of Murphy, all melds to form some great moments. So, it is a must see in my book. It isn't really an action movie - it is a comedy, and in that vein it succeeds. 8 out of 10."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jonelvandemark",
        "review_rating": "8",
        "review_title": "An awesome adventure",
        "review_detailed_main": "The movie was a great adventure. I love spy gadgets. I even visited a spy shop in queens where I purchased this movie and they sell tons of spy wear. The creative forces behind the show were writers David Friedkin and Morton Fine and cinematographer Fouad Said. Together they formed Triple F Productions under the aegis of Desilu Studios where the show was produced. Fine and Friedkin (who previously wrote scripts for radio's Broadway Is My Beat and Crime Classics under producer/director Elliott Lewis) were co-producers and head writers, and wrote the scripts for 16 episodes, one of which Friedkin directed. Friedkin also dabbled in acting and appeared in two episodes in the first season.\n\nActor-producer Sheldon Leonard, best known for playing gangster roles in the 1940s and '50s, was the executive producer (receiving top billing before the title in the series' opening title sequence). He also played a gangster-villain role in two episodes and appeared in a third show as himself in a humorous cameo. In addition, he directed one episode and served as occasional second-unit director throughout the series.\n\nI Spy was banned from being shown by certain television stations in the South due to the showcasing of an African-American (Bill Cosby) in a leading role.This movie is great for kids and the family."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "death2steelers",
        "review_rating": "10",
        "review_title": "Do you like Murphy and Wilson?",
        "review_detailed_main": "Really what it comes down to is whether you like Eddie Murphy and Owen Wilson. Personally, I think they're two of the funniest actors out there. Wilson and Murphy play off each other extremely well. Owen Wilson plays his typical role, almost making fun of himself throughout the movie. Eddie Murphy plays an egotistical celebrity. I'm reading a lot of reviews about how their characters get on peoples' nerves. If you have any sense of humor, then they won't, trust me. The only people who don't like this movie are 9 times out of 10 the ones who thought Leave it to Beaver or Maximum Overdrive were good movies. Some of this film's most hilarious moments are when it's making fun of celebrities who are in love with themselves. For example, Eddie Murphy's character refers to himself in the third person constantly. There are so many funny parts in this movie, I've watched it a million times and it's still funny every time. It's definitely not a movie steeped in a complex storyline, but if you're looking for something light and funny, I don't know how this movie can go wrong.(9/10)"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "bsarte",
        "review_rating": "8",
        "review_title": "Not a bad combination",
        "review_detailed_main": "It's so popular not to like Eddie Murphy anymore. But, I have to say that this movie was pretty good. It was not a block buster, and I haven't a clue as to why it was called \"I Spy\", but I enjoyed the movie. It had some comedic moments, and Owen Wilson's pairing with Eddie Murphy worked well-enough."
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "intheriver",
        "review_rating": "10",
        "review_title": "My stomach still hurts...",
        "review_detailed_main": "When some friends of mine took me to this movie, I thought \"how boring!\". Was I ever wrong! I don't know if I've ever laughed at a movie so hard in my life! The plot was average, but the characters were great. A great movie to de-stress with!"
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "SquirePM",
        "review_rating": "",
        "review_title": "A whole lot better than I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "msbeek",
        "review_rating": "",
        "review_title": "the trailer is enough",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Tregfilms",
        "review_rating": "",
        "review_title": "Two Great Actors, One Bad Script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "elissa211",
        "review_rating": "",
        "review_title": "entertaining and clever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "superjxiv",
        "review_rating": "",
        "review_title": "Completely unfocused attempt at farce",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "jwpeel-1",
        "review_rating": "",
        "review_title": "I SO hate this movie!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "CamaroLuvNgal84",
        "review_rating": "",
        "review_title": "Funny!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "chuckrules",
        "review_rating": "",
        "review_title": "Chemistry makes this movie work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "luedoulphe1",
        "review_rating": "",
        "review_title": "overall pretty funny,gotta watch it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "rjhoment",
        "review_rating": "",
        "review_title": "The Funniest Film Of The Year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "divine_madness",
        "review_rating": "",
        "review_title": "Truly Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ThirtyNineWinks",
        "review_rating": "",
        "review_title": "I haven't walked out of a movie in a long time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "luc2071",
        "review_rating": "",
        "review_title": "What a waste!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Unimatrix4567",
        "review_rating": "",
        "review_title": "Awful...Just Plain Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Joe-Cuba",
        "review_rating": "",
        "review_title": "Another bad Murphy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Dr_Sagan",
        "review_rating": "",
        "review_title": "Decent Action Comedy based on the chemistry of its actors.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ikramerica",
        "review_rating": "",
        "review_title": "Eddie doesn't ad lib...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "cjw4473",
        "review_rating": "",
        "review_title": "'I Spy' with my little eye Eddie Murphy's Career about to die.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "GabSZ",
        "review_rating": "",
        "review_title": "Offends the hungarians",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "stargirlrk",
        "review_rating": "",
        "review_title": "This was a horrible movie with an old, worn-out concept and you should not spend a single dollar on it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "kraley",
        "review_rating": "",
        "review_title": "I Spy Something Brown and Smelly",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "rachdewsnap",
        "review_rating": "",
        "review_title": "Pretty good overall",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "ksheyman",
        "review_rating": "",
        "review_title": "Casting is very important",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "aaron_tp",
        "review_rating": "",
        "review_title": "Better than I expected (Pushing it though!)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "R. J.",
        "review_rating": "",
        "review_title": "Forgettable comedy wondering whether it should have been an actioner",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "slightlymad22",
        "review_rating": "",
        "review_title": "Murphy's Kelly Robinson Deserved A Better Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Chris_Gardner",
        "review_rating": "",
        "review_title": "James Bond had better look out as Eddie Murphy and Owen Wilson are vying for the top spy spot in I Spy (M).",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Decath",
        "review_rating": "",
        "review_title": "I thought it was really funny.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "lclujan",
        "review_rating": "",
        "review_title": "If you have any character and humor you will Enjoy this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "sluggg1",
        "review_rating": "",
        "review_title": "A Product of the Marketing Age of Cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0297181",
        "movie_name": "I Spy",
        "movie_rating": "5.4",
        "review_username": "Chances911",
        "review_rating": "",
        "review_title": "I wish it was better then it really was",
        "review_detailed_main": ""
    }
]