[
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "keiichi73",
        "review_rating": "6",
        "review_title": "About as good as a movie called Paul Blart: Mall Cop could be",
        "review_detailed_main": "If Paul Blart: Mall Cop had been made 20 years ago, it would have starred John Candy. That's a complement, by the way. Candy had a knack for playing bungling, yet good-hearted people who mainly wanted to please. He certainly specialized in playing people who tried too hard to be nice to cover up past pain. There's a lot of this in Kevin James' performance as the title character here. He's more than just a comic goofball. James turns him into a likable and surprisingly sympathetic hero that we find ourselves cheering for by the end.\n\nKevin James rose to fame on television starring on the sitcom, The King of Queens, and has been trying to break into movies for a while now. He's acted along side stars like Will Smith and Adam Sandler, but this is his first shot at a stand-alone starring role. Sandler is still there behind the scenes (His Happy Madison production company produced the film.), but this is James' film all the way, and he doesn't waste the opportunity. His Paul Blart is admirable in a way. He's overweight and he suffers from hypoglycemia, but he always tries to do the right thing. He's passionate about his job as a mall cop, but he'd really like to be a police officer on the street. He's taken the physical entrance exam many times, but his health problems have prevented him from finishing. He makes up for his shortcomings by being the best mall cop he can be, and by also being a good single father to his teen daughter (Raini Rodriguez), who respects him and wishes he could fall in love again. Paul has his eyes on a young woman named Amy (Jayma Mays), who also works at the mall. The first half hour or so of the film is devoted to Paul's life, and it certainly helps us get into his corner when the actual plot kicks in.\n\nIt's Black Friday, the busiest shopping day of the year, and some high tech criminals stage a lock down and a hostage situation at the mall as they pull off their theft plan. They place motion sensors and small bombs at the entrances, so no one can get in or out. They think they've removed everyone from the building, but didn't notice Paul was in the back of the arcade playing Guitar Hero. When he emerges from the arcade, he quickly learns about the hostage situation, and discovers that both Amy and his daughter are amongst them. This kicks off the main action, where Paul must use his resources around him to out think and outrun the criminals while keeping everyone alive. I liked this aspect of the story, and how Paul Blart actually has to be clever in order to outsmart the captors. The movie is rated PG, so it's never too violent or scary for kids, which is the perfect target audience for the film. They'll like the film's gentle and goofy humor, and accompanying adults may find themselves charmed by Blart himself.\n\nI never laughed out loud while watching this movie, but I did smile a lot, and I found myself caring more about the main character than I imagined. Let me tell you, that's more than I expected walking into a movie called Paul Blart: Mall Cop. There's plenty of sweetness during the early moments, establishing Paul's shy relationship with Amy, and the caring one he shares with his daughter. When the time comes for him to be a hero, we can cheer for him, because the movie makes him into a true underdog. He's constantly battling with his own shortcomings and health issues, and it's clever the way he keeps on finding ways to keep himself going, driven by saving the ones he loves. If I'm making the movie sound too serious, it's not. There's plenty of slapstick gags, surprisingly no bodily fluid or toilet humor to be found, and some pretty good physical comedy on display. If there's any major shortcoming to be found, it's that the movie is pretty inconsequential, and will probably be forgotten by me a few months from now.\n\nStill, considering the kind of junk that usually clogs theaters in early January, Paul Blart certainly is not bad. I imagine the movie will make a good rental, since its somewhat small scale will make it perfect for watching on TV rather than the big screen. If anything, it's one step closer to making James the cross-over star he obviously wants to be. I wouldn't mind seeing the same kind of likability he gives here in a less juvenile script. He's on to something here, he's just gotta find the project where he really knocks one out of the park."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "poolhus",
        "review_rating": "6",
        "review_title": "Not A Kevin James fan, this is a positive review",
        "review_detailed_main": "Never watched King of Queens, never have been a Kevin James fan but always liked him better than his pal Ray Romano. I was coerced into seeing this Mall Cop movie. I give it a 6 out of 10. Now some may say that is a low rating, some may say better than mediocre.....for me who normally does not like this guys type of humor, this is a great rating!!! It was mildly entertaining...for me it gets the extra star to put it at 6 because it's refreshing to see some humor that's not overly sarcastic, deeply degrading to someone else (except the title character), or just downright cruel. This relied on what I call \"Bill Cosby\" sense of humor. Funny but overall clean. A bit cheesy, but I think that's what Kevin and the screenwriters were going for. Normally I don't get why people think he's funny but in this case, I did get it....and you can't help but like the guy. Without giving any detail, the bar scene for me was one of the most Laugh Out Loud moments in the movie. The way KJ zips around on the Segway is pretty hilarious although because of it's consistency throughout the movie it wears off a bit. I agree with previous reviews of how the villains kind of downgraded the movie a bit. If that was smarter, or those parts were rewritten, it could have been a lot funnier. Another surprising aspect is Kevin's agility, and athleticism. In this particular movie he is very physical (or at least stunt doubles allow him to appear that way) Overall my 6 out of 10 rating should be perceived as a great rating for this movie. I previously never liked this actor, I thought the title was dumb as dirt, and although I always keep an open mind I would be lying if I didn't say that my expectations were very, very low for this. Certainly not as bad as I thought it would be, and not as great as I thought it could have been. Kevin and cast made this a little better than average...and it changed my mind about my hesitation with this guy....I hope someone puts him in a good movie with a great script in the future (better than Chuck and Larry, Hitch). I believe it will do well on cable. One last thing that I must mention was great, at 82 mins...it was just long enough to not overdue what should be viewed as a kinda silly concept."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "log1324",
        "review_rating": "3",
        "review_title": "Needed Another Re-Write or Two",
        "review_detailed_main": "When I saw the premise of this movie, I had a chuckle. It had the potential to be a decently funny movie, something perhaps with heart, something that delivered a good deal of laughs and you walked out feeling good. I wasn't expecting an Academy Award winning movie. Its definitely not Oscar-worthy. The real disappointment lies in the lack of humor in it.\n\nPaul Blart (Kevin James) is a mall cop that seems to have no direction in his life. They go to good lengths to show how truly depressing his life is. Paul sees a woman in his mall, Amy (Jayma Mays), running a stand for hair extensions. He realizes that he needs to be with her and tries to woo her, even though he has no self-esteem. Just as the story is falling apart, the mall where they both work is robbed in a supposedly sophisticated scheme. Suddenly our slovenly friend is thrust into a role where he can try to impress the love of his life and excel at his job at the same time. Easy to guess where this story is going, no?\n\nThe acting was okay, the direction was tolerable. The problem is the script. As I said, the story itself had potential. It just felt as if the writers could decide where this was a character they loved or hated. It really could have used another re-write or two to develop the script a little more. The movie is tolerable, but realize that not only are you not seeing an Oscar-worthy movie, but you'll be a little disappointed in the laughs as well. 3/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "J_Trex",
        "review_rating": "7",
        "review_title": "Good, Light-hearted Comedy",
        "review_detailed_main": "I wasn't too sure about this movie when I saw the trailers. It looked like it might be a total waste of time, along the lines of \"Delta Farce\" or \"Meet the Spartans\". However, after reading some of the reviews, and being a fan of \"King of Queens\", I decided to check it out and was pleasantly surprised to have enjoyed it. The casting was excellent, the screenplay was very good, and Kevin James fit the bill perfectly. I can't imagine anyone other than him playing the role of Paul Blart, Mall Cop.\n\nPaul Blart is an overweight, hypo-glycemic (prone to fainting spells), shopping mall security guard who lives with him Mom and teenage daughter somewhere in North Jersey. Paul aspires to be a NJ State Police officer but cannot pass the required physical, and thus is consigned to his present job at a West Orange, NJ shopping mall. While Paul is on duty, a group of armed robbers attempt to steal the credit card receipts. The remainder of the film is Paul doing battle with this group of robbers. This sounds more serious than it is. Rest assured, it's a fun comedy with many funny gags / bits.\n\nI'd recommend this movie to anyone who liked \"King of Queens\" or has an affinity for light-hearted comedies."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "cmariegs",
        "review_rating": "5",
        "review_title": "kinda silly, kinda dumb, kinda fun",
        "review_detailed_main": "This film is kinda silly, kinda dumb, and kinda fun. It is the type of film I would take my 12 year old daughter to see. It seems to be made for preteens and teens. The film was slow to start so have some patience at the beginning. It was a cute movie. Very fun, kid friendly and gives you warm fuzzy feelings at the end. The hero is very likable and you always cheering him to come out on top. I wouldn't say it's a hilarious movie or keep you on the edge of your seat, it had its moments. I would consider the movie a good waste of time. It's nice to have a film out there that is light and avoid bathroom jokes and video-game type violence. I enjoyed it and my daughter liked it even more. It is recommended for young people but not fully recommended for adults."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "blanche-2",
        "review_rating": "6",
        "review_title": "You know what you're to get with that title",
        "review_detailed_main": "\"Paul Blart: Mall Cop\" from 2009 stars Kevin James, Jayma Mays, Shirley Knight, Bobby Cannavale, and Keir O'Donnell.\n\nPaul Blart works for mall security after not making it to the police academy. He acts as if he's guarding the White House, stopping people in motorized carts for infractions, reporting in even though his boss asks who it is, and going a little overboard in his handling of a new trainee.\n\nHe hasn't dated since his green card marriage blew up, but he sees a young woman at one of the kiosks, Amy (Jayma Mays) and falls head over heels. After he makes a complete fool of himself at a bar, she seems less friendly.\n\nWhen a gang announces the mall is closing early and starts an organized takeover and captures hostages, including Amy, Paul is fooling around with a guitar and singing in one of the stores. Therefore when the mall is locked, he's stuck in the mall. And it falls to him to do something about the robbery and the danger to the hostages.\n\nNormally the last thing I watch is films like this. These past two weeks I've seen two. It's since the election. I have needed films to numb my mind. Kevin James makes me laugh with his slapstick and cluelessness, so it was fine.\n\nIt's predictable, it's funny in spots, it seems to go on longer than necessary, but by far it is not the worst thing I've ever seen. And for a change with today's comedy, it didn't have vulgar jokes.\n\nThis last week I watched Netflix's True Memoirs of an International Assassin, also with Kevin James, to give you an idea of what all the divisiveness and hate of this election has done to me."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Mark-InTheUK",
        "review_rating": "2",
        "review_title": "Disappointing",
        "review_detailed_main": "I saw the trailers, enjoyed King of Queens, and thought I'd enjoy this Kevin James jaunt as a Saturday afternoon film. A film which should be quietly enjoyable and give a few laughs.\n\nWhat I watched was mind-numbing garbage. Whilst I didn't expect anything too original, I didn't think I'd get such unoriginal, factory fodder. There was nothing to be enjoyed, and almost everything was too expected. The little that was marginally original was creepy. I felt like screaming to the love interest, don't go any near that stalker as he zoomed in on CTV then offered a lift on his mop-mobile. Would anyone say yes if a creepy guy offered to put his arms around you on his Segway when you just met the guy; especially one with stalker tendencies? The scene in the bar that followed was just as painful to watch, and even more reason for the love interest to run a mile.\n\nThe writers seemed to forget that if you're going to create formula movies, with a loser you need the audience to like, that there has to be something positive and likable about the character. I can't think about anything redeeming during the first twenty minutes. The writers took too many liberties with the audience and just presumed, 'Hey, this is an actor everyone likes, we don't need to make any effort in the script to support this.' This is not Kevin James greatest moment. The box office receipts merely show how successful good advertising can be, no matter how bad the product is."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jace_the_film_guy",
        "review_rating": "7",
        "review_title": "Stupid, Unrealistic and Entertaining",
        "review_detailed_main": "Is it stupid? Yes. Is it unrealistic? Yes. What I wildly entertained? YES! While I can see the flaws in logic and absurdity in Paul Blart: Mall Cop, I also feel that the film has a lot of heart. I enjoyed the time that I spent watching Blart ride is Segway around the mall, fail at his social interactions and ultimately come out the hero in the end. It is not my favorite comedy of all time, but I think that it is pretty dang funny."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "caraduradelulu",
        "review_rating": "5",
        "review_title": "Almost painful...",
        "review_detailed_main": "When I saw the trailer for this movie, I was more than anxious to see it. Then I saw another one and it made me see it even more. Then I saw the movie and guess what, all the good scenes were those that I've already seen and nothing more. The idea itself is a very interesting one at very least, but it's the realization is where the movie fails. The story begins to borderline on being boring halfway through, and it all begins to be more than predictable. Once or twice the story takes an engaging turn, but it's really not enough. The funny parts are to be counted on the fingers of one hand, and the ending is -again- so predictable, it hurts. Which is a shame, because the acting is really good, Kevin James is truly shining through and proving that he's a really good actor; again, not nearly enough to salvage the shortcomings of the plot and the lack of jokes. Which is a shame. Movie starts really promising, but the further we go into the movie, the more painful it becomes to watch it. As if the makers gave up on it after shooting the first 30 minutes. I'm giving it 5 stars only because the first half an hour is really decent. And I gotta admire James doing all his stunts. So do yourself a favor. Don't watch the movie. Watch the trailers. That's all you need to see."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "captainshoosher",
        "review_rating": "10",
        "review_title": "Paul Blart: Mall Cop changed my life",
        "review_detailed_main": "Never did I think a movie about a Mall Cop could change my life. I walked in laughing at the idea. However once inside the theater pure emotion segwayed from the screen to my heart. Sadness, joy, terror, all at once. This movie revolutionized the movie industry for me. I recently re watched it to see if it stood the test of time. I Was more than surprised to see the themes relating to us now more than ever. Themes of bravery, the kindness of a good mans heart, and not succumbing to the fear within you in the face of danger. That is why this movie gets ten whole stars. Kevin James brings phenomenal acting as always to his role as the titular Paul Blart. His performance is on the same level as Emma Stone's in La La Land. Kevin James is a prime example of someone who deserves an Oscar and for this movie that particularly shows. He plays the tough and emotional role of a single father trying to provide for his elderly mother and child. He is a failure to the world and needs to bring himself up to a higher standard. Masterful writing and acting compliment this piece well.\n\nThank you Kevin James for this creation."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "tomfsloan",
        "review_rating": "6",
        "review_title": "Stupid but funny",
        "review_detailed_main": "To those who gave this a three stars or less, what did you expect??? The movie is stupid alright but it is funny. Like a stupid but funny Die Hard. Many funny little stupid things. The air vent scene was funny. The squeaking shoes in the bank were funny. My only real complaint was the guy who they cast in the Hans Gruber role. He wasn't right. Maybe not a bad actor, just grossly miscast. Nimble Kevin was fine and so were most of everyone else. Above average musical score, which was a pleasant surprise."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "vsdobbs",
        "review_rating": "1",
        "review_title": "What is wrong with you, America?",
        "review_detailed_main": "Seriously, this was the worst movie I've seen in years.\n\nI didn't laugh once.\n\nI shook my head a lot and asked myself over and over again, \"This was the number one movie in America the week it came out? What is wrong with the USA?!\"\n\nTruly, the film is *horrible*. It is start to end horrible.\n\nSeriously, if the best thing about your movie is music by Survivor, what does that say about your acting, directing, screenplay?\n\nThis film is an embarrassment.\n\nAmerica, you deserve the sequel you'll no doubt get."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "bopdog",
        "review_rating": "4",
        "review_title": "Likable cast, but simply NOT funny. Whole film falls flat",
        "review_detailed_main": "I was set for a goofy and silly comedy, but wound up being disappointed. This movie had a very good cast--- all of the actors are competent and likable. The film's big problem was that it simply was not funny. It wasn't even interesting. Do note the film was not bad. It was not a disgrace or anything like that. The basic idea is a good one, and could have resulted in a great night out. Don't know what happened, or why, but the jokes didn't work. The set-ups fell flat. The otherwise likable people and potentially interesting scenarios never went anywhere.\n\nA few of the running gags were OK--- such as the motorized wheel things being used as the quasi-cop chase vehicles. But having the portly fellow try to pull a crippled man in a motorized wheelchair over (for what? He was going 1/2 mile an hour) on one of those \"copped-out\" wheely things simply did not fly. No spark. Flat. Zilch. Nada."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ccthemovieman-1",
        "review_rating": "7",
        "review_title": "No Award-Winner But Has A Lot Of Charm, Some Good Laughs",
        "review_detailed_main": "Lame-but-charming with some laugh-out-loud moments is the best way I can sum up this comedy. Overall, it's pretty innocent, especially considering most comedies today. There is very little material that could be offensive.\n\nIt's a cliché these days in films, made popular by guys like the late John Candy - fat guys picked up and proving to be heroes and getting back at the thinner-and-nasty folks who torment them. Here, it is a few co-workers at the mall and the bad guys who want to rob it.\n\nMeanwhile, our plump policeman, a security cop at a New Jersey mall, has his eyes on a pretty girl who runs a kiosk.....and you just know he'll win her - \"Amy\" (Jayma Mays) - in the end. (Hey, it's not real life, but we fat guys can dream, too!) Kevin James plays the Candy-esquire \"Paul Blart,\" a state policeman-wannabe who winds up on his scooter being the ultra-straight cop/nerd for the mall. He, of course, is unlikeliest of heroes, but turns into Rambo when needed. Along the way are a bunch of sight gags and some insults, most of which produce laughs. Some are very funny.\n\nIn fact, overall the individual sight gags are funnier than the overall story but it want some nice humor and corny story that doesn't offend much, you could do a lot worse. It's got charm."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jimmyhenry",
        "review_rating": "3",
        "review_title": "Skateboarding Ninja Terrorists?!?!!?!",
        "review_detailed_main": "This movie had potential, or so I thought. Kevin James is a pretty funny guy and the premise seemed like a good one, if well written.\n\nJames plays a Mall cop who's a bit of a loser but has a good heart. The first half hour or so is pretty funny. Not hilariously funny mind you, but a chuckle here and there. It looked like it could shape up to be a goofy comedy with a goofy but lovable character. But the movie peaks about 20 minutes into the film when Kevin James \"accidentally\" gets drunk at a bar and makes a fool of himself. And then it's all down hill from there.\n\nNext thing you know, his mall is overrun by terrorists on bicycles and skateboards who are flipping through the air, jumping off balcony's, flying through glass. It's absurd...and not in a funny way, it's just bizarre. Well maybe I did chuckle once or twice at how absurd it was...once or twice...literally.\n\nDon't waste your time.\n\nJust like all of the latest Happy Madison productions, it's crap. I'm convinced that Satan exists and Adam Sandler did indeed sell his soul...cause somehow his pieces of crap continue to consistently make money."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Wuchakk",
        "review_rating": "7",
        "review_title": "Blundering, but well-meaning mall cop tries to be John McClane (\"Die Hard\")",
        "review_detailed_main": "An affable mall officer in New Jersey (Kevin James) takes his job seriously while taking care of his daughter and pursuing a cute kiosk attendant (Jayma Mays). When the mall is taken over by a gang of organized thugs, can Paul Blart rise to the challenge?\n\nWhether or not you'll like \"Paul Blart: Mall Cop\" (2009) will depend on if you appreciate Kevin James and his goofy, unprofane brand of humor, as depicted in The King of Queens, \"Zookeeper\" (2011) and \"True Memoirs of an International Assassin\" (2016). While it's not as good as \"Zookeeper,\" it's not far off. After the first 25 minutes or so you'll find yourself engrossed in Paul's life; you understand him and like him. You feel for the man as he gazes longingly at a receipt with the handwritten name of his romantic interest. And you'll root for him and laugh when a serious threat engulfs the mall.\n\nKeir O'Donnell plays Paul's greenhorn partner, Veck. He's reminiscent of a young Tim Roth. In other news, Mays has the cutest wide-eyed face.\n\nThe film runs 1 hour, 31 minutes and was shot entirely in Massachusetts (Burlington, Braintree, Peabody, West Roxbury and Bedford).\n\nGRADE: B"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "onetruedeath",
        "review_rating": "3",
        "review_title": "Is it really worth making a film like this?",
        "review_detailed_main": "I watched this film ignoring my original resistance to such a concept for for a film, I hoped that I would be proved wrong that a potentially great concept for a film would be ruined by unthoughtful sub-plots... Paul Blart although a seeming lovable character falls prey to being a typical bumbling underdog character and the overall acting of the majority of the actors falls short of convincing. The \"bad guys\" of seemingly unexplained origins felt like they were cast not as actors but as stunt performers/free runners and as of such were just used as some form of \"dramatic effect\" to make Blart seem like he was overcoming more than their poor acting. The final plot twist was ABSOLUTELY senseless as we were given no proper background to any of the characters involved. This film may have improved upon its shortcomings if it was humorous but it was not with only a few jokes making me raise the corner of my mouth, although the style of humour starts to make sense when you realize that the directors previous films are the such of 'Dr. Dolittle 2' and 'Daddy Day Care'.\n\nPerhaps I did not enjoy this movie because I watched it expecting more than it could offer, Perhaps it does not fit my sense of humour, or even my annoyance at the script getting through Hollywood whilst so many more well thought out scripts lay unnoticed."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "brooke-98054",
        "review_rating": "7",
        "review_title": "It's funny!",
        "review_detailed_main": "Kevin James always makes me laugh! And with this movie, he did not fail. The characters and actors are great along side him. And the story is so entertaining! The action goes well with the comedy. Give it a chance!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "armalite1016",
        "review_rating": "4",
        "review_title": "It's not but, but it isn't anything to write home about.",
        "review_detailed_main": "I went to a preview screening today at the Mall of America, where Kevin James was doing a signing to promote his new movie. I didn't get an autograph, but I was able to go to the preview screening of the movie, and although we got into it a couple minutes late, I was still able to see the bulk of the movie.\n\nIt definitely isn't bad, but I wouldn't put it up there as a top comedy either. It's decent at best. There are actually a few genuinely funny moments, but there aren't many. The rest of the jokes throughout the movie aren't bad in the sense that you cringe at them, but they aren't really what I'd call funny either. Really though, the movie is highly tolerable, and doesn't overstay it's welcome, ending at a good time. I didn't have to pay for it, so maybe that's why I enjoyed it so much, but as long as you aren't looking for the next great comedy, at the very least, you won't be disappointed.\n\nThe main weakness of the movie is the main villains in the movie, the \"X-TREME T33M!\", turn what is a pretty good movie into a pretty mediocre movie. You just can't take them seriously, as usually bad guys in movies don't jump around as if they believe they are the evil twins of Spider- man, and to make it worse, they also equip themselves with skateboards and BMX bikes, because apparently free running around the wall wasn't XTREEEEEEEM enough for them. They really make the movie seem more like a kid's movie than it already did, which I guess it is more of a kid's movie, but still.\n\nKevin James himself isn't bad, and he has most of the best jokes of the movie come from him, but he isn't really at the top of his game either. Really no complaints; the only thing holding him back is the somewhat sloppy script. If you liked him in \"King of Queens\", you'll probably like him in this, yet he is a little underwhelming to be honest.\n\nThe plot is very simplistic, Hollywood routine stuff here, no surprises, except one last minute twist that is actually unexpected, mostly because it was so unnecessary to move the plot forward. It was just so unneeded that it really made no sense, and was almost shocking. It's like someone who says they are going to count to 100 and then they count to 105. What was the point of that? They already accomplished their goal when they got to 100. Kind of a bad analogy, but you get the idea.\n\nOverall, it's nothing to write home about, but it definitely isn't bad. If you are a huge Kevin James fan, then go ahead and see it, and if you have kids, then they will most likely like it. I was going to give it a 6/10, but seeing as how it is more of a kid's movie, I decided to give it a 7, also because it is very tolerable, and there are some actually pretty funny parts, so it is an enjoyable movie (although again, I could be a little more accepting because I got to see it for free). You might enjoy it, you might not. Really, just watch the trailer. It pretty much captures the spirit of the movie."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "thetatlocker",
        "review_rating": "10",
        "review_title": "What does god look like?",
        "review_detailed_main": "This is a simple question, with a simple answer. Kevin James riding a segway while making hilarious but also thoughtful political comments on modern socioeconomic issues."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "gccuconati",
        "review_rating": "7",
        "review_title": "Dated and dumb sometimes, but funny",
        "review_detailed_main": "I was introduced to Paul Blart: Mall Cop by my older brother when he got it on DVD in 2012 or 2011 (don't remember exactly when). I'm quite amazed that this movie came out during my final year of preschool. And I'm gonna be honest, I've always enjoyed it, but it definitely doesn't hold up in places.\n\nSet in West Orange, New Jersey around the holidays of 2009, Mall Cop focuses on Paul Blart (played by Kevin James), a middle-aged single man who lives with his mother Margaret (Shirley Knight) and teenage daughter Maya (Raini Rodriguez). Paul dreams of becoming a state trooper and has tried out several times, but his hypoglycemia constantly holds him back. In the meantime, he works as a security officer at the local West Orange Pavilion Mall, a job that he's held for a decade, and takes great pride in, though his colleagues and customers couldn't care less. On Black Friday, the busiest shopping day of the year, Paul seizes the chance to shine when seven hooligans, led by Veck Simms (Kier O'Donnell), who has been posing as a security trainee, invade and shut down the mall, and take hostages inside the bank, including Maya and Amy (Jayma Mays), a weave and wig saleslady who Paul has become infatuated with recently. Determined to protect his cherished mall and save his loved ones, Paul mounts his trusty Segway and revs into action to stop Veck.\n\nThe acting in this movie, while nothing spectacular, is good enough. Kevin James brings his A game to the role of Paul. Raini Rodriguez is fine as Maya. Jayma Mays is sweet and kind as Amy. Shirley Knight is good as Margaret, even if she has only two scenes. Although, Kier O'Donnell does fall a little short as Veck. Everybody else isn't too bad.\n\nThe writing is a little more hit-or-miss. Mall Cop is definitely packed with some really exciting action, especially all the scenes of Paul taking out Veck's thugs. There's also some really great comedy in here that manages to make me laugh. Examples include Paul getting drunk at American Joe's (\"I BELIEVE IN MAGIC!!!!\" *SMASH*), and his one-liner before using a scuba tank to take out one of Veck's thugs: \"Hey, you. SCUBA-dooby-doo.\" HA! The movie is even heartwarming in places, especially the scene of Maya comforting a despondent Paul after he finds no online dating matches, and of course, the ending. But here's where the shortcomings arise. Some of the movie's comedy comes across as less funny and more cringeworthy. One key example is the scene of Paul getting in a physical tussle with an angry fat lady at Victoria's Secret. I'm not gonna lie, I hid from that when I was younger. While I've grown more tolerant of it, it's still cringeworthy, and it basically stops the whole movie dead. And the fact that it's only addressed by one passing reference just a little later in the movie just adds to how pointless it is. Another issue is how incredibly dated this movie is, because the mall is filled with stores that are no longer in business, namely KB Toys (appearing in a deleted scene, but only listed on the store lists that Veck gives his thugs in the finished film), which I loved to visit all the time as a kid before it went out of business (just around the time this movie was released), Sharper Image, where Paul grabs a camera from (which ended its retail stores before the movie was even released!), and Sears, which, as of today, only has a few stores that are still in business. It's especially harsh to see Lord & Taylor, now that thanks to COVID, that store saw its end just two years ago.\n\nMall Cop is also filmed quite nicely, but there are problems. Throughout the movie, the Massachusetts filming locations are all too detectable. As someone from Pennsylvania who's been to New Jersey millions of times over the years, I can tell that this movie wasn't filmed in New Jersey. And when calling Paul over a borrowed cellphone, his friend's daughter's ex-boyfriend Pahud (Adhir Kalyan) pulls up a cell-tracking map that shows the mall's located in Trenton, New Jersey, right near Cadwalader Park. West Orange is in northern Jersey, nowhere near the Delaware River. Added to which, the mall's inside constantly fluctuates between scenes (store front arrangements change, architecture changes, etc.). That's because the movie was filmed at two different Massachusetts malls: Burlington Mall in Burlington, and South Shore Plaza in Braintree, and I visited both these malls with my family during Spring Break back in 2018.\n\nOkay, finally, music! Composer and record producer Waddy Wachtel's score for this movie is pretty darn good, I must say, especially his exhilarating main theme, and his music for the opening credits. It also sounds energetic and suspenseful when it needs to. And the movie chooses some great songs that fit well, especially \"I Can't Hold Back\" by Survivor. But that's not all; the end credits use \"Think I'm In Love\" by Eddie Money, and it works extremely well! Also, I'm not a particularly big fan of Barry Manilow, but his song, \"Weekend in New England\", is perfectly used for the aforementioned scene of Maya comforting Paul.\n\nAll things considered, Paul Blart: Mall Cop has flaws, some minor, some severe, it's dumb at times, and it's certainly dated, but, ultimately, I love it. In my opinion, I think it's Happy Madison's best effort. If you like to see movies that are centered around mall chases, watch this movie!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Cocacolaguy912-2",
        "review_rating": "1",
        "review_title": "Maybe it will make the 7-12 kids laugh, but in technicality it is a horrible film.",
        "review_detailed_main": "If you are over 12 expect to need a lot of your friends present to make fun of it for Mall Cop to be anything near funny. The film's plot is in two parts really. Part 1 is seeing how much of a fat loser he is with his old mom and fat daughter, trying to get the girl and what not,. Part 2 is seeing how much a fat loser he is and him fighting the bad guys. The film is peculiar because it is somewhere between being a stupid PG comedy for the kids and a very bad homage to Die Hard. The funniest lines are those that aren't intended to be humorous. Seeing the bad guys jump around the mall (and I mean literally jump) spitting out their terrible lines was the best part of the movie. Some parts of it just don't make any sense. Overall if you are going to be close minded it is a terrible film. If you have an open mind, it will still be a terrible film."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "iainsteeves",
        "review_rating": "1",
        "review_title": "Worst Movie Ever Made",
        "review_detailed_main": "I am a man that enjoys a bad film. I have endured such films as Monster Man, Man-Squito, and all three Maniac Cops. Paul Blart: Mall Cop had zero redeeming qualities, and the part where he squirts hot sauce in the eye of the main bad guy from 30 feet away is the single worst scene in movie history...it actually made me angry. My roommate and I, who can sit thru any and all Charles Bronson and Chuck Norris movie with pleasure, feel the need to burn the Mall Cop DVD in order to cleanse ourselves of the shame inflicted by Paul Blart. I think Lucifer himself forces the likes of Adolf Hitler, Josef Stalin, and Ted Bundy to watch this film confined in the gates of hell. If you are thinking about watching this movie, do yourself a favor, and punch yourself in the groin for an hour and a half instead."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jamesoshea91",
        "review_rating": "7",
        "review_title": "Wow,a movie without low brow humour,puke jokes and nudes scenes,this must suck!",
        "review_detailed_main": "In fact this movie does not suck,i found my self laughing out loud at this movie,it actually manages to be stupid without using dirty,lowbrow jokes and gags.some of the scenes are so stupid like him trying to slide across the floor and getting stuck,hilarious... or there is this one scene where he is on his segway and tries to out minouver the guys by dodging side to side,which obviously doesn't work on a segaway.understand that this movie is not a rogan movie or a ferrel movie this is a family friendly comedy which is quite rare these days.\n\nKevin James...not a fan but he does a great job in this movie,he does the great stupid guy and his faces and actions are great,i hope to see him again but i also hope he doesn't get stereotyped because i hear hes doing a movie where hes a zoo keeper which i presume is identical to this. Now of course the premise is quite stupid,with the villains riding skateboards and such,but kids will love that i guess AND i guess its hard to believe a smoking hot young girl would fall for a dumb fat smelly single father who lives with his mum but you never know.\n\nYou know what...give this movie a chance because it is pretty funny and adults will enjoy countless references to 80s early 90s movie such as die hard and beverly hills cop..."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "linkmario123",
        "review_rating": "2",
        "review_title": "not worth your money",
        "review_detailed_main": "After watching all those commercials for about five weeks, I was somewhat excited to see this movie. I came with low expectations, but left the theater throughly disappointed.\n\nBasically, the movie is about Paul Blart (Kevin James), an awkward, hypoglycemic mall cop who takes his job a little too seriously. He meets a wonderfully nice and pretty hair extension saleswoman, Amy (Jayma Mays), whom he instantly falls for. Things take a turn for the worse however, as a group of thieves take over the mall. Anyways, I thought it would be A lot funnier than it actually was, not to mention there were a few scenes where I couldn't even bear to watch.\n\nBottom line, save your money and go see something else. You won't regret it. (sorry if my review sucked, this is my first)."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "tammynelson-94904",
        "review_rating": "7",
        "review_title": "About a Cop who saves the mall.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jpyovanoff",
        "review_rating": "1",
        "review_title": "If I laughed once I'd be surprised",
        "review_detailed_main": "If you have a chance to see this movie, find a blender and put your hand in it because you will actually laugh more times while doing it.\n\nIf your even thinking about renting this movie, get a wiffle bat and knock yourself unconscious because your time will be better spent.\n\nInept bad guys, with ninja like moves who ride BMX bikes and skateboards in neither funny nor understandable. You have a gun. Get off your skateboard, aim and shoot him! The guy is on a segway for goodness sakes. They are not that fast.\n\nI can not, not recommend this movie enough.\n\nYou want to see a movie about a lovable loser rent a John Candy movie...any John Candy movie will do. Even his worst movie is ten times better."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "inkblot11",
        "review_rating": "6",
        "review_title": "Rats, this mall tale falls short but, I give James an \"A\" for effort and I hope he tries again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "zchomyn",
        "review_rating": "2",
        "review_title": "Paul Blart: Mall Cop: A real sock thrower!",
        "review_detailed_main": "Here are a series of comments I have to share with you about this movie:\n\nI created an IMDb account just to criticize this movie\n\nI now hate Happy Madison productions\n\ni vomited in my mouth and it tasted good compared to this movie\n\nThis movie is like rice pudding with raisins, and I hate rice pudding with raisins.\n\nThe ringer was a better movie than this.\n\nMan, this movie sucks.\n\nThis movie will make you take your dirty sock off and hurl it at the screen"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Staymetal8390",
        "review_rating": "8",
        "review_title": "Pefect start for 2009",
        "review_detailed_main": "After waiting opening night in the freezing cold to see this, I was happily not disappointed in Paul Blart: Mall Cop. Yes, we all know it's not meant for critical acclaim but for pure comical entertainment and it delivers. I'm sure after anyone sees it, they're going to want one of the little vespa vehicles he drives.\n\nAnyway, Kevin James is Paul Blart, an overweight suburban dad wanting to be a cop but instead he's a security guard at a mall. He has a daughter who's mother left him once she got citizenship. Paul has a crush on the new girl at the wig kiosk but of course he's conscience about his weight. Then one day, some organized crooks take over the mall and Blart is unaware. Once the crooks have hostages including Blart's crush and his daughter then he decides to take things into his own hands and save the mall.\n\nAt first I was terribly disappointed to see this was PG-13 because I thought it was then going to be a little contrived potty/stupid humor film for kids. Yes some stupid humor was there but in the best way. I think this would be the perfect family or date movie (as it was for me) so take a trip to comical fun."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "theinaniloquent",
        "review_rating": "7",
        "review_title": "\"Don't mess with his mall\"",
        "review_detailed_main": "When a shopping mall is overtaken by a gang of organized crooks, it's up to the a mild-mannered security guard to save the day.\n\nPeople listening to the hard-ass critics and ones who believe this was terrible, stop listening. Walk in, expect a comedy, and receive. In fact, I don't find this to be an average comedy. I actually found it to be hilarious! So many genuinely funny moments that'll be sure to lift you up. I don't understand the criticism towards this film AT ALL. Every movie people walk into has to meet their expectations. And their expectations are way over the top. Impossible. Paul Blart may be called a parody of Die Hard or a try-hard comedy film. Again, I don't exactly know what you thought this movie was (what the Godfather?) but it meet my expectations. The comedy is a perfect balance between adults and children, so no hard times there. And everything else was just great. But overall, all in all, in conclusion; this film is an underrated comedy film that needs to be more appreciated. I thoroughly enjoyed myself. One thing: DO NOT LISTEN TO THE CRITICS. That is all. 7/10."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "maxbrothersinc",
        "review_rating": "1",
        "review_title": "It's funny how 1 star is too good for this....because its a star!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "eyeNoflix",
        "review_rating": "3",
        "review_title": "An hour and a half I will never get back.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "henriknymoen-64651",
        "review_rating": "6",
        "review_title": "A funny underdog movie!",
        "review_detailed_main": "This movie is a classic underdog movie with funny moments to back it up with! I do recommend watching this movie with some good friends! A good 6/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "Missing out",
        "review_detailed_main": "I really liked the \"King of Queens\" TV show, as many did. Especially those who are tempted to watch this movie. Unless you are still a teenager (or younger), you might not care about the lead role. But while Kevin James seems to promise a few \"belly laughs\" (no pun intended), the jokes are more miss than hit.\n\nWhich is the biggest problem of the movie. Not the story (what would you expect from this really, story-wise), nor the actors in general (they need better material to work with). The movie solely relies on Kevin James and while that worked with the TV Show, it does not work here. You will eventually get tired of the jokes, but it happens to quickly.\n\nSo if you're not a Kevin James fan or like to be entertained in a better way, than this isn't the movie for you"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "MayuMG",
        "review_rating": "7",
        "review_title": "Fond memories",
        "review_detailed_main": "-i still remember that finale.\n\n-I should probably rewatch it to update my opinion though."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "AlanSKaufman",
        "review_rating": "",
        "review_title": "Paul Blart Outshines Forgetting Sarah Marshall",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "JimD73",
        "review_rating": "3",
        "review_title": "Harmlessly Unfunny",
        "review_detailed_main": "Having already seen (and liked) Observe and Report, it was almost necessary to see the year's other mall cop movie to make sure my experience was well-rounded. O&R was a very dark and disturbed comedy, and while not the funniest movie of the summer was certainly very different from anything else that came out. Paul Blart is almost the same movie with the edge smoothed to a curve. There's nothing really wrong with it, but there's nothing quite right either, and while its harmless enough, I can definitely say that Paul Blart is a waste of time.\n\nKevin James is Paul Blart, a lovable schlubb of a mall cop. He has a daughter from his ex-wife, who used him for a green card and then ran off. He has a crush on the new girl as the hair extensions booth (which almost borders on stalker-ish at the start of the movie). He is constantly put down by the worst people imaginable, including a pen salesman who is unfortunately never punched in the face. He has hypoglicemia, which causes him to pass out without the proper dosage of pixie sticks. And he loves his segway. Admittedly, its a badass segway.\n\nThe character of Blart is certainly the strong point of the movie. Unlike the tendency nowadays for anti-heroes and sarcastic twits leading in comedies (think the Stifler influence), Paul Blart is wholesome, sympathetic and never unlovable. He's a big guy, but in a cuddly rather than pokeable way. James plays the character very well, and may very well have a future in films. He's put on a lot of weight, but he plays it to his advantage in the movie.\n\nHalfway through, a group of criminals invade the mall in an attempt to steal Black Friday credit card revenues. Their plan is inconcievably stupid, as is par for the course, but the fact that the criminals are made to look smart just adds insult. The movie also tends to just ignore certain pieces of information, making some of their plot ridiculously random. The criminals themselves are ridiculous. Someone thought throwing in some parkour jumping would spice up the movie, but instead is just face-in-palm bad. One in particular is a lunatic to the point of absurdity, especially for light fare as this.\n\nThe biggest sin of the movie is that its mostly laughless. There's a couple chuckles throughout, but no real laughs. When Blart must defend his mall, a laugh or two is finally emitted. Most of the good stuff is in the trailer, although Blart taking on a Predator-esquire role in a Rainforest Cafe is admittedly pretty funny.\n\nDespite trying to promote self-esteem for our heavy-set protagonist, Paul Blart relies heavily on fat-man-fall-down humour, which is a little puzzling. Regardless, the important part is the movie just isn't that funny. Its a harmless kind of funny, and is certainly not intolerable, although the editing is quite horrid. Its not the worst movie in the world to be dragged to, but I can't help feel I just wasted 90 minutes of my life."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "elizabeth-12994",
        "review_rating": "7",
        "review_title": "Loved it. For all the family",
        "review_detailed_main": "I loved this movie. I thought it was very funny and meant for all the family. I think the reason why it was given a slightly lower rating was because most people were expecting a full on spy movie or police investigation, which I am here to tell you, it's not. It kind of gets to that towards half way through the movie, but it's meant to be a comedy, so isn't necessarily going to be taken seriously.\n\nThe storyline overall was great and easy enough to follow. A man got a job as a mall cop and all the way through the movie is trying to impress a girl. I won't say any more than that as I don't want to spoil anything, as there are some plot twists.\n\nThe casting was spot on perfect. It wasn't like 'woah that acting is amazing' because it is hard to pick those people out when they don't have a scene where something has gone wrong or given a very powerful line. Nothing very special but at the same time, I doubt we could have gotten any better. There were no weak moments from any of the actors.\n\nThe comical side of things was also perfect. They didn't try to force jokes or funny scenes, you could tell it just all lead on naturally, which is a good thing. You can really tell when ideas have been forced and then it doesn't work.\n\nThe music wasn't anything you'd really pick up on but it was still there and wasn't bad but wasn't absolutely amazing either.\n\nThis movie is definitely for all ages. It is a family film as well, and fit for most people, unless they don't like a good laugh.\n\nFor some reason, the guy at the beginning who goes round with Paul Blart reminds me of Moriaty from the TV series Sherlock, no clue why but he does. (Moriaty in the TV series is absolutely brilliant, just saying)."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Buddy-51",
        "review_rating": "4",
        "review_title": "Falls apart in the second half",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "usumgal",
        "review_rating": "10",
        "review_title": "Couldn't be happier with this movie",
        "review_detailed_main": "For once a film is exactly as advertised. This is Die Hard with Bruce Willis played by an overweight Security Guard.\n\nThere was no crude humor, really. At least none that was direct, so its VERY kid friendly.\n\nThe story delivers, Kevin James delivers perfectly on Comedic Moments as well as Heart Warming ones.\n\nThere is product placement in this movie by Sony, although it is very low key. And to anybody in the Pennsylvania, NJ, Delaware Tri-State area you will feel right at home in this mall, as it is obviously a Simon/Kravco Property given the decor and the usual assortment of Simon Mall Staples such as Legal Seafood ( whatever their name means. Still not sure I'd eat there.)\n\nUntil this film I do not believe I've seen James in anything where I don't think its an extended episode of King of Queens. In this film he was pure Blart.\n\nVery well done. I may even go back a second time."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jack-a-burns",
        "review_rating": "6",
        "review_title": "a fun light hearted comedy",
        "review_detailed_main": "By no means was this a bad film but nor is it a brilliant film. Kevin James is brilliant and his acting was the highlight of the film for me. The story was pretictable but there was a few chuckles.\n\nThere is a few laugh out loud moments and overall it was a good comedy but the flaw was that after about the first half hour it started to get less funny which is annoying considering how funny it was for the 45 minutes.\n\nAnother promblem was that there was big gaps inbetween the funny bits which made it become boring in certain scenes.\n\nA good film for for a Saturday afternoon laugh.I would recommend it to who wants a bit of light hearted comdey."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "killa3",
        "review_rating": "1",
        "review_title": "You call this a movie??",
        "review_detailed_main": "Unfunny, over-the-top, poorly written and acting ,lame, stupid- Exactly what I predicted from Adam Sandler's Happy Madison production. I am glad that I didn't pay for this piece of crap and so called \"comedy\". Just Starting from the beginning to the end, I didn't even chuckle for one time. All the jokes are clichéd, predictable and dumb - probably cater to the below the age of 12 audiences. It clearly demonstrates that Kevin James cannot carry the movie neither could all the supporting casts. I am still floored by the fact that it cashed in more than 100 million in box office (Must be no big animation released at that time so parents had no choice but were forced to take their kids to watch this awful flick since it was PG)."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "eagle804",
        "review_rating": "3",
        "review_title": "Somewhat Disappointing",
        "review_detailed_main": "Kevin James is funny and so was the preview to this movie, unfortunately they put most of the funny bits in the trailer. It's a PG movie which probably should of been PG-13. -No kid would of gotten much from this and it wasn't mature enough for an adult to get anything from it either. My advice: If you really like Kevin James like I do, wait till this comes out on DVD, rent it, watch it and return it...on time. -You don't want to catch a late fee for something as disappointing as this.\n\nOh, and if you did see this and really liked it, I recommend 'Employee of the Month' with Dane Cook."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A film that offers entertainment, truly...",
        "review_detailed_main": "Kevin James wrote, produced & acted in this film.... Multi-talented fat-so. Luckily, he succeeds in all the 3 departments. He has written the film along with Nick Bakay neatly {keeping entertainment & only entertainment in mind}, as an actor he's done a brilliant job. And as a producer.... he made a Blockbuster hit, thus earned money, money all the way to the bank.\n\n'Paul Blart: Mall Cop' is entertaining fare with hilarious moments attached to it. The film promises to entertain, not enlighten... and it's true to it's intension. This is no way a fantastic watch, but surely a entertaining, light-hearted & well-made film, which springs up the mood.\n\nActing-Wise: Kevin James is excellent. He plays the Mall Cop with the correct amount of confidence & style. Keir O'Donnell is good as the menace. Jayma Mays does a fine job. Others give a good account for them self's.\n\nOn the whole 'Paul Blart: Mall Cop' lives up-to the mark. A joyride!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "grenmonkey",
        "review_rating": "2",
        "review_title": "already outdated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Kevin James's 'One Man Show'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Krusader_Donkey",
        "review_rating": "7",
        "review_title": "DHKR: Paul Blart: Mall Cop(2009)- \"My Guilty Pleasure is Die Hard Junior\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "mgallimore-1",
        "review_rating": "3",
        "review_title": "This is not a comedy!",
        "review_detailed_main": "What a disappointment to see this and expect a comedy. This movie should be categorized under Dramas. There are only 2 or 3 funny moments in the entire movie. Paul Blart is a loser who failed at becoming a policeman so has a job as a mall security worker and runs around on the mall on a segway. If him on a segway is supposed to be funny, I missed the humor there. On Black Friday, the mall is overtaken by a group of thieves who want to steal the credit card information from all the stores. The police and the SWAT team are called in so the thieves take some of the mall workers as hostages. With the help of Paul Blart the thieves are caught and the hostages are released and Paul gets the girl in the end. Kevin James tries so hard to make this poor script funny, but the movie is a bore."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "Kevin James rose to fame on TV starring in the sitcom The King of Queens. Now he's Paul Blart, overweight and suffering from hypoglycemia. James is a unique presence in American cinema and hopefully will do more of these kinds of austere, gripping character pieces more often in the future. The movie is rated PG, so it's never too violent for kids. The cinematography is stark and bare, with only the soundtrack adding some effect. From an artistic standpoint, there were some plot elements and character developments I didn't think were totally needed. They do however drive the story, which seemed to be their purpose, so I can accept them."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "3",
        "review_title": "Rent-a-cop plays Die Hard",
        "review_detailed_main": "Honestly from the moment when I saw the trailer for Paul Blart: Mall Cop, I knew I wanted to see it. It looked like a great new comedy that we needed, it's always fun to root for the underdog, right? But I did have to wait for the rental, fun economy, right? So I was able to get it today and you know what? It really wasn't what I had expected at all, even though it had some really fun moments, over all the story was way too much and tried too much to be like Die Hard. The film took a complete 180 where this sweet lovable guy turns into Travis Bickle(Taxi Driver). I don't know why they kept turning this film around, not to mention that with the exception of Kevin James, they picked the most horrible cast to carry this movie.\n\nWhen Paul Blart fails the New Jersey State Police training, he is reduced to being a \"rent a cop\" security guard at the mall. During dinner with his mom and daughter, Maya, they try to cheer him up and want him to start dating again. Blart's ex-wife had married him for the green card, had a daughter with him, and then abandoned them. While on patrol at work, Blart passes by Amy's kiosk and she gives him a smile which distracts him enough for him to run face-first into a display car. Back at base Blart has to take the new guy, Veck Sims, out on another patrol to train him. On Black Friday Amy, Stuart, and Veck are in the bank to cash their paychecks. Blart is heading there too but the owner of the arcade asks Blart to help him close the store. When a gang breaks in through the service entrance and prepares to take over the mall by force, Blart is focused on playing Rock Band. The robbers clear the mall and take hostages in the bank. When Amy tells Veck to get down, he reveals that he is the ringleader of the gang. Veck plans to use credit card codes to steal $30 million, in order to fly to Cayman Islands, and to take the hostages with them. It's now up to Paul to take the bad guys down Die Hard style and save Amy and the day.\n\nOver all, I would not say this is the worst movie I've ever seen, not by far, it does have a few good laughs here and there. It just went into different directions and most of the funny scenes were used in the trailer already, so it was something that I was expecting. Also not to mention that this movie had the most unrealistic situations, for example, Paul tries to leap from a speeding car to a speeding van, but he misses and falls down, somehow he gets back up like nothing happened and continues to run and climb fences. I know fear makes you do some crazy things, but that was just completely unbelievable as well as the \"love story\" and there was no chemistry with James and Mays. I would say if you want a couple little laughs, rent it, but otherwise, I wouldn't really say go out of your way to see it, it's not Kevin James' best work, he can do much better.\n\n3/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "shannalyn85",
        "review_rating": "9",
        "review_title": "I really enjoyed this movie!!",
        "review_detailed_main": "I saw this movie at a Preview screening and I really loved it! I'm so sick of seeing and hearing about sex in every movie, I'm sick of killing in movies and I definitely needed a good laugh. This movie had no sex, no killing (some violence), but A LOT of laughs! The whole theater was cracking up.\n\nIt's a typical Happy Madison film in that it shouldn't be taken too seriously. I was afraid the previews may have had all the funny parts, but I was wrong. There was definitely a lot more greater moments to be had. The film is obviously stretching reality by quite a bit in parts, but that's what comedy often times is about. I disagree with the many of the comments before me. I would recommend seeing this movie. Kevin James was great and newcomers Keir O'Donnel & Jayma Mays were impressive and adorable as well. Go see it if you get the chance!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ryancm",
        "review_rating": "2",
        "review_title": "How dumb? Very...",
        "review_detailed_main": "If you're in the mood for a movie that makes no sense, is completely unbelievable and dumb, dumb and DUMBER...This is the movie for you. It doesn't even TRY to make sense so I guess the writers and producers got what they wanted. Consider this a live action cartoon with a couple of amusing incidents. But a couple of amusing incidents do not make a movie. Good thing I got a free rental on this one. If I had paid to see it I would have asked for a refund. The leading lady looks and acts like a store dummy in a window and acts like one. The best that could be said of the other (actors?) is that they take direction. Kevin James should stay away from the big screen."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "treadwaywrites",
        "review_rating": "1",
        "review_title": "Don't Give This Movie Any More Money",
        "review_detailed_main": "Normally I would refrain from adding my 2¢ to a movie like Mall Cop. Not that I'm too good for Mall Cop. No no. I just don't know of too much more that can be said after viewing either the trailer (preview) or the movie poster. Too me this is the kind of movie I might have sneaked into in my youth simply because I had watched all the other movies in the metroplex. Those were the days, when I would pay $7 and then hop from theater to theater until I had gobbled up every movie playing. Of course there was also no cable TV then either.\n\nBasically this is the story of a security guard working in a New Jersey mall. His dream has been to join the police force but his weight has always disqualified him. One day some criminals take over the mall and take hostages. Mall Cop Paul Blart is trapped inside and decides to help the police regain control and attempts to take on the gang on his own. Hilarity ensues.\n\nThis movie is the dream child of comedian Kevin James who wrote and then stars as the main character, Paul Blart the Mall Cop. The director is Steve Carr of Daddy Day Care fame. I won't lie, there are a couple of times that I may have shaken my head with some inner prepubescent laughter. Over all this is what you would expect, bad jokes about being fat from a fat guy. I have chosen to give it a few words because as of January 30 this movie has made a little over $83 world-wide. It was finally removed from 1st place on the charts by the movie Taken with Liam Neeson. I can only hope that by giving this movie some air time here it will have brought some people that will discover some good movies that I have written about. I beg you to go see them and not give your money to films such as this one. 1/10*"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "hnutz_",
        "review_rating": "",
        "review_title": "Don't Waste Your Time or Money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Sirus_the_Virus",
        "review_rating": "7",
        "review_title": "I actually liked it more than Observe and report.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "izzx",
        "review_rating": "1",
        "review_title": "absolutely HORRENDOUS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kleivens_papaya",
        "review_rating": "6",
        "review_title": "Not an adultly movie",
        "review_detailed_main": "It is not a good comedy or a good movie for adults. I thought it was pretty stupid at first and it is. But after some minutes i thought \"what the heck i miss this type of movies\", its an 90s style family comedy. And if you just don't take it seriously at all, its OK entertainment.\n\nThe story is nothing new. Its the classic thing about an outcast that has been bullied all his life, will he become the hero and get the girl???? hmmmmmmm.\n\nThe jokes is nothing new and very often is about fat stuff jokes etc, classic style. And the lines i general are nothing new. And its a late 90s acting style with stupid villains.\n\nKids will laugh and most grown ups will kinda watch it without throwing up or being mad. And maby laugh sometimes. Its a feel good movie.\n\nRecommended if you are tired of watching disneychannel stuff with your kids. Or if you want light entertainment."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "frogsupmyarse",
        "review_rating": "3",
        "review_title": "wasted opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "dbborroughs",
        "review_rating": "6",
        "review_title": "Funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "happycarrot68",
        "review_rating": "2",
        "review_title": "You'll struggle to find a poorer film....",
        "review_detailed_main": "I read that this topped the US box office and thought it must be worth a look.....it is so bad it's difficult to find words to describe this atrocity of a so called comedy. The laughs...well there isn't any to be fair and the story is so predictable and stupid you do wonder about people's mentality who would give this a positive review.. US audiences do seem to find humour in this kind of nonsense and Nutty Professor kind of films so I should have seen the signs. The fact this had a sequel is even more baffling than people enjoying this lump of rubbish. If there are 5 comedies worse than this then I have yet to see them thankfully- unfunny and abysmal ."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "twanster-97655",
        "review_rating": "9",
        "review_title": "Good fun",
        "review_detailed_main": "Don't understand the low ratings, it's a good fun film, Kevin James is great, plot moves along nicely, supporting cast are all good. Great comedy. Well worth watching."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "haw-98949",
        "review_rating": "7",
        "review_title": "Freakin Legend",
        "review_detailed_main": "Now I definitely enjoyed this movie but it would've been better if the entire thing was good. Because I didn't really like the start of the movie all too much and I understand that it sorta set up what was to come but it just wasn't that interesting\n\nBut it did 100% get better and that second half was really good.\n\nBut Paul blart is a freakin legend\n\nAt first I thought the villain was gonna be the hero of the movie but nope.\n\nIt has weird pacing but it fits with the movie so it's fine.\n\nThis movie wasn't really that funny even tho I think it's an action comedy atleast that's my guess. I laughed maybe twice but not too often\n\nIt has a good soundtrack. It has some good moments. And the story Is nothing special It just felt like It had a mixture of a love story and home alone but it doesn't matter if the story is been done 2 million times as long as I enjoyed it will get a good rating by me\n\nThat being said I will rate it a solid 7/10 I enjoyed this movie but if the first half of the movie was better it probably would have got a 8/10 or maybe a 9 but that first half is just not that interesting to me though I do like the characters and there were some pretty good twists in there but I think 7/10 is pretty good for this movie\n\nIf you do end up watching it. Just don't take it too seriously."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "JackRJosie",
        "review_rating": "2",
        "review_title": "As good if not better than Shawshank Redemption",
        "review_detailed_main": "Wow i hate this movie. Its not funny at all. The whole premise is so stupid i cant even. I was constantly jumping forward ten seconds in this movie, just so i wouldn't have to bear 10 extra seconds of this garbage. In what world are all robbers BMX, skater, Cirque du Soleil little genies, jumping around the crime scene like little jungle rats??!! Just bad. So stupid. What did i expect though? Ive hated this movie with a passion since i saw it the first time in 2009. Not sure why i gave it a chance this evening. I will say though it is really funny to see Keir O'Donnell try so hard in this stupid role. \"Im the leader of bad guys!\" Oh man he tries so hard, and fails so miserably. I almost wonder if he thought he was going to get an oscar for his role.He was definetley going for that heath ledger joker vibe. But yeah he really killed it!!! It being his career of course. :)"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "tadejlog",
        "review_rating": "2",
        "review_title": "Oh boy...",
        "review_detailed_main": "Not worth watching. This is probably one of the carppiest movies I have ever seen. Im not sure how I could have ever expected something more."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "DrScore",
        "review_rating": "",
        "review_title": "Are you allowed to review a movie you couldn't finish?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "masercot",
        "review_rating": "6",
        "review_title": "Good Concept",
        "review_detailed_main": "I like the concept: Die Hard, but with a fat mall cop. Unfortunately, it was not directed with physical comedy in mind. The good physical comedians, like Peter Sellers, Roland Atkinson, etc, were more painstaking in their planning of physical humor.\n\nThe performances were okay. A bunch of criminals running around on mountain bikes and skateboards was a bit labored. I liked the free-running, but I don't imagine that, in real life, a master criminal would've hired more than one...and that one would've been just coincidence...\n\nThis film had the perfect mix of humor, pathos and action, it just lacked that punch that a conscientious director would've given it. Better luck next time..."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "guyzer6945",
        "review_rating": "2",
        "review_title": "My life is now an hour and a half shorter",
        "review_detailed_main": "I just don't understand what's happening with Happy Maddison lately, usually in a recession, you try to release decent films, because your audiences are down in size anyways, but this piece of crap wasn't even worth a blank disk and some bandwidth. I just don't understand how Kevin James can be so amazing in King of Queens, and I'll even give chuck and Larry some credit, but this plot just dragged along and at times I think its safe to say was down right depressing. If you're in a mood to throw on some background noise while bustin out a mean game of scrabble, then this is an excellent choice, but if your in a mood to actually enjoy a nice piece of film, I'de make your way over to the Benjamin Button section of the video store."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "abovethelaw-95473",
        "review_rating": "6",
        "review_title": "Super security.",
        "review_detailed_main": "Paul Blart is a security guard who works in a mall. When a group of criminals try to rob the mall during Black Friday for creditcard numbers, Paul Blart has to use all his skills to stop the heist."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "mlhewitt1",
        "review_rating": "3",
        "review_title": "Very funny at points but otherwise dismal.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "fcullen",
        "review_rating": "7",
        "review_title": "A true comedian at work",
        "review_detailed_main": "If any other comedian of Kevin James' generation played Paul Blart, Mall Cop, the film would haven't merited more than a 4 or 5 rating (out of 10). That Kevin James co-wrote the script and created a well-defined character AND knew how to act physically (and take falls) is evidence that, given script and director, he is a true comedian. I'm disgusted by SNL alumni that think banging into things and shooting for an ironic persona is the stuff of comedy. Most of them are clumsy and obvious in both regards. Quick cutting masks the use of stunt doubles doing the physical gags these ersatz comedians should be able to execute. That Mr James can act physically as well as verbally, and knows how to write for his character puts him in proximity of the silent and early sound film comedians and well above most of the other comics of today. To see Kevin James to good advantage, see Paul Blart: Mall Cop. It's not great---only in comparison with other alleged comedies of today. Despite my dread of sequels, I look forward to Mall Cop II in 2015."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "mr2cool",
        "review_rating": "4",
        "review_title": "Paul Blart Misses the Mark",
        "review_detailed_main": "When I first saw the previews for Paul Blart back in January they looked pretty funny. Accordingly, I thought that the movie would be very similar to most comedies that Kevin James has appeared in including: Hitch, I Now Prounounce You Chuck & Larry, and You Don't Mess with the Zohan. However, just to be safe I decided to wait until it was released on cable to watch it instead of paying the cash for the theater experience and I'm glad I did. Paul Blart was actually much worse than I expected based on the advertisements. The plot was pretty unbelievable and the acting wasn't that great either, not to mention that the majority of the cast consists of no names that aren't that convincing in their roles. If anybody ever criticizes one of Eddie Murphy's movies again, then they need to watch Paul Blart which was terrible. Even The Golden Child, Norbit and Meet Dave look good in comparison to Paul Blart. Finally someone produced a movie that makes Will Ferrell, Chris Kattan and Pauly Shore look talented which Paul Blart managed to accomplish with it's underdeveloped script."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "fentontommy",
        "review_rating": "10",
        "review_title": "A hero in every sense of the word",
        "review_detailed_main": "Most people would fantasize about what they would do if their loved ones and friends were in harm's way and they are the only person who could save them. None of these people also imagine that it's in the place they hold most deadly to their heart. Paul Blart is a man of action, a selfless hero who springs into action at a moments notice and will do whatever it takes to thwart his foes of their plans. He doesn't do it for the fame or glory, he does it because he doesn't have a choice. He has an inner voice, he hears an altruistic echo that resonates through those hallowed halls of the mall that call him to action. Sure he doesn't appear to be a hero, someone may see him for the first time and think of him as a \"fat guy with a glorious mustache \" or a \"rent a cop with above average Segway skills\" or \"a person struggling with hypoglycemia, heartbreak, and copes with the pain by patrolling the grounds of the West Orange Pavilion Mall\". It doesn't matter to him what they think because he knows when the time comes for him to strap on his helmet, put down a quick pixie stick, repeat his core values \"detect, deter, observe, and report\". He doesn't need the world, but the world needs him. He is Paul Blart and he is our Mall Cop."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "melanie-pansy",
        "review_rating": "6",
        "review_title": "I enjoyed watching it",
        "review_detailed_main": "Because of negative reviews of this film, I thought it would be bad, but I bought anyway to watch for myself. After watching it, and liking it a lot, my only negative review is of the negative reviewers. Kevin James does great physical comedy in the movie, and it was entertaining to see some real-life reflections of things like some security/law enforcement thinking everyone is a civilian except for themselves. The story line is a sappy nonsense cliché of boy meets girl and encounters an unreal challenge scenario where he proves to be a hero. Even so, I enjoyed watching it and think it is a great movie for kids. It's rare to find a well done, clean movie, that's not all computer animation. The PG rating is appropriate for some violence and vulgar language."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "BA_Harrison",
        "review_rating": "2",
        "review_title": "Paul Blart: Mall Crap.",
        "review_detailed_main": "Paul Blart Mall Cop has to be one of the least funny comedy movies I have ever seen. It's essentially Die Hard in a mall played for laughs (or at least that's the intention), with the John McClane character replaced by an obnoxious, bumbling, fat loser (Kevin James) whose dream it is to become a real cop. Even a truly gifted comic actor like John Candy (when he was alive, of course) would have struggled to make this poorly written garbage work, and Kevin James is no John Candy.\n\nA charmless central performance, an incredibly unlikely romance (Blart falls for, and ultimately wins the affection of beautiful mall stall owner Amy, played by Jayma Mays), some ridiculous but not at all funny action, and lots of cringe-worthy gags all go to make Paul Blart: Mall Cop a total stinker. What I don't understand is how this film made so much money that someone has actually green-lighted a sequel. Yes folks, Paul Blart: Mall Cop 2 is on its way"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "chanellygrace",
        "review_rating": "5",
        "review_title": "A Happy Madison production...but not really",
        "review_detailed_main": "Okay, so I was one of many people who were anxiously awaiting the release of yet another Happy Madison production and was especially excited about the fact that it would be starring Kevin James. What I think I didn't pay much attention to was the rating. A very important point of note about this movie is that it's rated PG! Now, if you love movies produced by Adam Sandler and such, you will find that this movie has funny parts. The plot, however, is overwhelmingly geared toward presenting a somewhat funny film for the entire family; as opposed to the raunchy, adult humor that Happy Madison usually presents.\n\nI just returned from a matinée showing of this film, and if I'd paid full price for what I thought was another Happy Madison hit, I'd have been sorely disappointed. If you're looking for a movie with good, clean humor that you could take your kids to see, then you should love this movie. However, if you were hoping for a bit more...as I was...then you might want to wait until the DVD release."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kirk-246",
        "review_rating": "7",
        "review_title": "A decent and funny look at overweight security.",
        "review_detailed_main": "Kevin James(King of Queens & I Now Pronounce You Chuck and Larry) scores at playing Paul Blart in his new comedy 'Paul Blart: Mall Cop'.Paul Blart is an overweight mall cop who is a little lonely.He hasn't had any girlfriend throughout his entire life.Well, he had a wife who was so fat, she was comparable to Rosie O'Donnell.While on his shift at the mall, he falls in love with a woman named Amy, who is willing to accept Paul as a friend, but that's about it.Everything goes from bad to really bad for Paul when thieves come in and take over the mall.Now it's up to one mall cop to stop the thieves and save the day.Look out world, because justice has a new name, and it's name is... Paul Blart.\n\n'Paul Blart: Mall Cop' is a fine film with some big laughs and lots of heart.I really liked Paul Blart being a big hearted guy and not a sex crazed deviant like Will Ferrel in 'Blades of Glory'.If you have kids who are at least 11 or 12 years old, they'll probably be able to handle the content of this movie.Afterall, it is rated PG.So ignore some of the hate that the movie has been receiving and just enjoy the movie for what it is.If not great, 'Paul Blart: Mall Cop' is a fine and funny movie that really should be given a chance to watch."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "bigpappatrader",
        "review_rating": "1",
        "review_title": "Horrible. Just Horrible",
        "review_detailed_main": "I created an account here on IMDb just to rate this movie. It is now listed as the worst movie I have ever seen. Do not waste your time. It went from horrible to god awful as the movie progressed. I kept expecting something good to come out of it, but it's like watching a train wreck. I am in awe of how utterly terrible it was. The lead actor does, I think, the best he possibly could with such a horrible script, horrible supporting cast, and horrible directors. How it grossed $183 million dollars is beyond me. It really says a lot about the quality of advertising and the effect it has on us. Again, this is easily the worst movie ever created and you'd be doing yourself a favor to just rent something else!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "StevePulaski",
        "review_rating": "6",
        "review_title": "Mall of Duty",
        "review_detailed_main": "It's cute and cliché plot may be good for five, six, and seven year olds, but for adults and teenagers my age. We want something a little more mature or funnier. It's a good kids movie, though the kid level in it could really be toned down a little bit. I'm surprised Kevin James got the role of Paul Blart. I was sure that John Goodman would have this in the bag.\n\n\"Mall Cop\" seems a lot like a 90s nostalgia movie. A movie that someone like John Candy or Chris Farley could have made back when they were still with us.\n\nThe movie revolves around the life of single dad Paul Blart (Kevin James). His dream of becoming a police officer is jeopardized by his low blood sugar. He trains to become one, but gets rejected when collapsing. He is raising his teenage daughter, living with his mother. To prove to them he is worthy of a real job, he gets the closest job he can get to a police officer, a mall cop.\n\nThere he meets Amy Anderson (Jayma Mays) who works at a kiosk called \"UnbeWEAVEable\". After numerous attempts and fails to amuse her, the mall becomes invaded by crooks who plan to rob the mall. They take Amy and store her in a place where they are keeping various other hostages. It's up to Paul Blart to take the down the criminals (in comical ways of course) and save the mall.\n\nDespite the film's overwhelming supply of fat jokes it isn't an awful movie. A harmless kids movie, just for kids. Thats what brings it down, because I don't really think adults will laugh to really at this. If they do, their sense of humor must be far stretched than mine. To conclude, it's harmless, made for kids, and ignored by adults.\n\nStarring: Kevin James, Jayma Mays, Keir O'Donnell, Peter Gerety, Bobby Cannavale, and Adam Ferrara. Directed by: Steve Carr."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "pkittybrainpuke",
        "review_rating": "2",
        "review_title": "Plot holes and an unlikeable protagonist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "raisleygordon",
        "review_rating": "",
        "review_title": "An ideal vehicle for Kevin James",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "mrush",
        "review_rating": "7",
        "review_title": "Very funny !",
        "review_detailed_main": "Right off the bat I'll tell you Kevin James is one of my heroes.I saw him years ago when he was a stand-up and then later his show \"The King of Queens\" became one of my all time favorites,ranking right up there with \"Barney Miller\" and \"Mash\".I still watch the reruns every time I can.So my comments may be a little bias but truthfully this movie was very funny and I don't think you have to be a James' fan to appreciate it.\n\nJames essentially plays his \"King of Queens\" character ,Doug Heffernan,here although he is named Paul Blart.He is an overweight security guard,or security officer,as he prefers to be called ,at a large mall.He's wife has left him so he lives with his mother and daughter.He pretty much is a miserable lonely guy who takes refuge in his mother's cooking.His mom and daughter are always trying to hook him up with a date but without much success.He dreams of being a state trooper but his blood sugar crashes makes it hard for him to pass the physical exam despite having some pretty incredible skills for a fat guy.\n\nBlart doesn't fare much better at work where is is the butt of jokes by his fellow security guards and generally ignored by the mall patrons.Blart is a bit of a Barney Fife in that he takes his security guard job way too serious which irks his co-workers,who tend to be a slovenly bunch.\n\nBlart's mundane routine suddenly changes when a group of high tech thugs take over the mall in an attempt to steal millions the mall has raked in during the Christmas shopping season.Thanks to a loud game of Guitar Hero ,Blart comes out of the arcade and finds himself locked in the mall with the thugs.He becomes determined to save his mall.But what can a overweight security guard ,who doesn't even have a gun,do? This movie is family friendly with mild violence and no nudity.This movie was consistently funny .It was well written and acted by all those involved.It has some pretty good plot twists too.\n\nWhile maybe not a great movie it is heads above what passes for comedy these days.I saw this movie when it first came out and I'll rent it and watch it again.\n\nHopefully the success of this movie will open more movie doors for Kevin James,who is a great comedy talent.\n\nRock on,Dougie!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "the_illusion_of_democrac",
        "review_rating": "1",
        "review_title": "Complete Waste Of Everything",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "huntingjake",
        "review_rating": "10",
        "review_title": "very good movie masterpiece",
        "review_detailed_main": "well, what can I say about this very good movie masterpiece? firstly, credit to Kevin James. If I believed in reincarnation, I would want to live my second life as either Kevin James or the very good movie masterpiece Paul Blart: Mall Cop itself. On Blu-Ray though, not DVD. There is at least 15 very very good jokes and scenes in this film & that is possible the most of any mall-based comedy-drama I have seen in the last decade. If there was an Oscar for \"best very good movie masterpiece of the year\", this would have won. If this movie masterpiece was a facebook post, I'd either react with a wow or a haha. The decision would be hard. I once watched the sequel with my friends and it wasn't as good. i fell asleep quickly, but woke up in time to see the scene with the swan or goose (can't remember which). Very good comedy gold and a good return to form for the series that reminded me of this very good movie masterpiece original! Could only be improved if lead role or main bad guy was played by Pierce Brosnan, or another ex-james bond actor such as \"Sean Connery\".\n\nVery good movie, very 10/10!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "unsalakgun",
        "review_rating": "7",
        "review_title": "Good concept with some weird things",
        "review_detailed_main": "Loved the concept but some weird things. Although it is still a great movie with several funny scenes.Worth watching."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Sandoz",
        "review_rating": "1",
        "review_title": "Doesn't this movie make you proud to be an American?",
        "review_detailed_main": "Really, what's more indicative of our (and by \"our\", I mean, yes, American) way of life than a disposable movie about our disposable culture and our disposable society that values churning out product for instant and mass consumption that can take it's place as forgettable fodder on a thousand or so screens in our googleplex distribution assembly line of worthless crap that we foist onto the nerve endings of popular culture? C'mon, really, is there anything more worthy of a Friday or Saturday night spent out with the family or significant others than getting at least a few chuckles from watching a obese clown stumble, bumble, and oaf his way through misadventures at the modern American temple of worship that is...the American Shopping Mall? And who could begrudge Kevin James actually getting the opportunity to STAR (that's right--STAR--not play the good-natured overweight friend in a rom-com, or even play the slightly seedy peripheral character in a want-to-be-cutting-edge-neo-noir film) in a laugh riot, er, maybe just a chuckle-riot, or even only a smirk-riot like Paul Blart Mall Cop? (Hey, ever notice that Paul BLART rhymes with FART?! and not only that, but BLART actually has an onomatopoeic resemblance to the actual sound of flatulence? Just think of the extra $ this could bring in at the b.o..."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "beer_and_cookies",
        "review_rating": "1",
        "review_title": "Seriously, Don't see this film. - very minor spoiler, wont ruin movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "nathanhmcdonald",
        "review_rating": "",
        "review_title": "Review of Mall Cop by a Mall Cop!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jacksoncnielsen",
        "review_rating": "7",
        "review_title": "Iconic!!!!",
        "review_detailed_main": "Paul Blart presents an anarchist view on the world and crime. Paul Blart himself commits a list of felonies in this movie but stills sees it fit to take justice in to his own hands. It is a perversion of our innocent view of justice and the men who seek to carry it out. Truly Great!!!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ironhorse_iv",
        "review_rating": "5",
        "review_title": "Here is a shopping tip: Paul Blart is stupid, but likable if you turn off your brain.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "gavin6942",
        "review_rating": "6",
        "review_title": "Has Moments, But Nothing Special",
        "review_detailed_main": "When a shopping mall is taken over by a gang of organized crooks, it is up to a mild-mannered security guard (Kevin James) to save the day.\n\nKevin James is a funny guy, and I like his Paul Blart character. I like how he moves, how he acts, how he uses his body not just for fat jokes (and there are many) but as a bombastic prop. He flies over fences, breaks through glass, and allegedly James did all his own stunts.\n\nSome jokes were good, some average, but the main issue I had was the creepy age difference between Blart and his crush. She's roughly thirty, while he is in his mid-fifties. That may work for George Clooney, but it defies believability to think a middle-aged, overweight security guard has a chance with a reasonable attractive young woman. And it is a little bit gross."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "nastynate69",
        "review_rating": "2",
        "review_title": "Please don't",
        "review_detailed_main": "Spoiler alert !!! This movie Stinks! Please if you haven't seen this movie ....Don't! Don't waste your time. This movie lacks all that is good with our beloved king of queens. Stop any of your friends from watching this movie. Its the best gift you can give them. If i was locked in a room for year , and all i had was a TV playing this movie , suicide would be my first choice , other then watching this HORRIBLE movie again. please don't make a sequel please consider burning any copy you come across. Naw but really this movie was great . a real feel good. ha ha ha Movie stinks. 2 out of 11. Never again will i even look at kevin james the same way."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "tavm",
        "review_rating": "7",
        "review_title": "Paul Blart: Mall Cop makes a nice time-filler for fans of likable Kevin James",
        "review_detailed_main": "After previously starring with Will Smith and Adam Sandler in their hits Hitch and I Now Pronounce You Chuck and Larry, respectively, Kevin James has his own solo success with this movie-Paul Blart: Mall Cop. It took a while for me but after the first 20 or so minutes, I was very willing to go for the ride and just laugh my ass off at the physical comedy that James provided especially as it seemed to threaten to get serious during the hostage scenes. Some of those bar scenes were especially funny. All I'll say now is, if you just want something to make you forget your troubles for a couple of hours, Paul Blart: Mall Cop makes a swell time to relax with."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "StastyRain",
        "review_rating": "3",
        "review_title": "The movie was boring and Amy was hands down the best character",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "DarkVulcan29",
        "review_rating": "8",
        "review_title": "John McClane has nothing on Paul Blart, okay not really.",
        "review_detailed_main": "The movie was a funny send up of Die Hard(1988), not a rip off. I'm amazed how the critics don't always see the funny side of it, they just have to be harsh.\n\nPaul Blart(Kevin James) a mall cop, who longs to be a state trooper, but his low blood sugar system seems to be prevent it, not to mention he seems not to have the knack for danger and adventure, although he likes to make us think he does. But in one day that all changes, when a bunch of high tech thieves take control of the mall, and some hostages also. And the only one who is left inside to watch them is Paul Blart. Will he save the day, or will he mock it up?\n\nAn enjoyable slap stick comedy, and who can do it better then Kevin James. Every joke and prat fall where all perfectly timed. Believe me you'll just be having fun. What a way to begin 2009."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kneejack",
        "review_rating": "7",
        "review_title": "Nothing heavy, no message, just fun",
        "review_detailed_main": "Sometimes we are in the mood for a funny movie with no stiff-necked \"message.\" no high speed chases nor sex stuff one would not feel comfortable with sitting next to your child, etc. This movie is a lot of fun, has preposterous plot lines, and certainly delivers for 101 minutes of levity. As a child I saw the same with Abbot & Costello followed by Martin & Lewis until their breakup. In recent years the heavyweight solo artist has been the since deceased Chris Farley and John Candy. The lost soul Mall Cop is played by Kevin James who at least looks more solid than the aforementioned two who imploded early in their career. This movie is a no-brainier so just sit back and laugh and enjoy just like a cheap novel you read through the middle of on an airplane flight and leave the rest on the seat for someone else. Enjoy. /s/ Jack"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "gary-444",
        "review_rating": "2",
        "review_title": "Grossly Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "magnetic-04465",
        "review_rating": "2",
        "review_title": "what a crappy movie",
        "review_detailed_main": "This \"movie\" is utter rubbish. I've seen \"King of Queens\", and always wondered how a fat waster like that got a reasonably attractive wife, but this movie just takes this to the extreme. Is this guy an actor? or just a fairground attraction. Hated it. Everything about this movie lets the viewer down. The attractive (goldie Hawn) lookalike girl, is nice, but, would she look twice at that fat idiot......NO. The daughter? the less said the better. The storyline is rubbish. It's as if they were just making a vehicle for Kevin James, to accelerate his career, I'M SORRY THEY FAILED. Got to make ten lines, so the film is rubbish rubbish rubbish rubbish rubbish rubbish rubbish rubbish rubbish rubbish rubbish rubbish rubbish."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "RoboGarrett",
        "review_rating": "",
        "review_title": "Pretty Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "callanvass",
        "review_rating": "6",
        "review_title": "Amusing family entertainment, much better then I expected.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "trick_morr",
        "review_rating": "2",
        "review_title": "uncomfortable, unfunny",
        "review_detailed_main": "At about 8 minutes in I was not once amused, and beginning to be uncomfortable. At about 16 minutes in, I'm fully uncomfortable with the main character and his inappropriate attention to the woman, not to mention her completely unbelievable response, and his complete lack of perspective after supposedly ten years as a mall cop.\n\nThere has not been one funny moment. This is the kind of movie which seems to derive it's humor from just putting a loser idiot character in embarrassing situations, reminiscent of Meet The Fockers and other such garbage.\n\nAt about 22 minutes in I'm thinking about turning this trash off. I only watched it to see what the jokes were about but it's not worth this discomfort."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "FloweryUnderscoreGuy",
        "review_rating": "7",
        "review_title": "Yippie Ki Yay, Mall Cop!",
        "review_detailed_main": "If John McClain over-ate, or if jack Bauer grew Man-boobs, this would be the result. \"Mall Cop\" is a Disney-is hero tale of an overweight security guard at a local mall, who is trapped in the building during a hostage-take over. Actually a quite fun movie for kids and it will keep the adults interested, but, Mall Cop has a hard time falling into a perfect category. There are scenes of hilarious, fun which include fat men running over dogs, fat men running into cars, and fat men becoming raging drunks. Then, there are scenes of intense, dark action, like elevator-fight scenes, several gun shoot-outs, and a car chase. So, the movie does have a bit of everything in it. which is a good thing, since it hasn't been shown in flicks for awhile, but, it's also a hard thing, since it isn't impossible to notice that the directors only really use a big man as they're hero for crude jokes, and a original plot, since the fight-scenes go a little out of they're reach. But, no need to harsh at all, because this is a triumph amongst corny-action films, a hilarious, funny and intense thrill-ride that will keep more then enough audiences drawn towards it. Next up, Mall Cop: With a vengeance."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Angelus2",
        "review_rating": "2",
        "review_title": "Something to pass the time....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "KdramaInStudio",
        "review_rating": "7",
        "review_title": "Funny movie with the kids.",
        "review_detailed_main": "My kids don't even know what an inside mall looks like - ours are all outside venues. But, we all found this funny especially if one understands the social arena of malls.\n\nWe look forward to watching Mall Cop 2."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "bob-rutzel-1",
        "review_rating": "2",
        "review_title": "Embarrassing to watch, not funny",
        "review_detailed_main": "Paul Blart (James), a Security Guard at the local Mall tries to rescue hostages when a gang of thieves come to rob it.\n\nThe only thing that works in here are the Segue machines and James works them just fine. One would think if you are going to have a comedy there would be some lines or sight gags that actually can make people laugh. Not so here. Very sad, and embarrassing to watch. James' Paul Blart reminded me of Jackie Gleason's The Poor Soul, which would have been funnier, but alas, Gleason has passed on. It is a real shame today's comedians do not go back and look at the comedic masters of the past. They could learn so much. But, alas, they think they know better. Believe me. They do not. Alas, alas and alas, I give up trying to remind them.\n\nThe story does get interesting, sort of, when Blart is alone in the Mall with the crooks who still have the hostages. Kind of like a Home Alone movie, but Mall Style. So you see where this is going. Interesting but still not funny or clever.\n\nI recommend that Kevin James either go into drama or sell cars. But, with all the car companies going kaput and laying off tons of people maybe drama would be the better choice. For some reason these so-called comedians do not have the timing for comedy, but they do have it for drama. I know this doesn't make sense but there you are. It's true. It's one of those mysteries like how were the pyramids built. Look it up. One clear cut example that comes to mind is Will Ferrell in the drama: Stranger Than Fiction. He was great in it . In comedy, no.\n\nDoes the movie save itself? I say no, but you know the outcome even without actually going to the movie. As long as millions of people pay millions of dollars to these so-called unfunny \"comedians\" nothing will change. And, that is sad.\n\nI think I will get one of those Segue machines\u0085\u0085\u0085\u0085\u0085.\n\nViolence: Yes Sex: No. Nudity: No. Language: No"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Roxburyfunny1",
        "review_rating": "10",
        "review_title": "Such a Great Movie!~!",
        "review_detailed_main": "Aside from Kevin's stand up comedy being hilarious this movie definitely showed his true comedic talent. The storyline was believable and the cast was perfect. The little girl who played his daughter Raini Rodriguez was so cute, very talented and believable as his daughter. This movie had so many twists and massive amounts of great comedy. It was so cool Mike Vallely had a cameo and of course I recognized his skateboarding skills and then who he was. Jayma Mays was so fantastic and hysterical. The bad guys were so believable and moved like it was nothing. The mall was perfect and extremely cool for shooting this movie and gave a lot of room to play around with the film and expand shooting scenes. I am so buying this when it comes out on DVD and I love Paul's Cell Phone!~!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "MartianOctocretr5",
        "review_rating": "6",
        "review_title": "Routine slapstick, has its moments",
        "review_detailed_main": "A rotund hypoglycemic mall cop who eats too many donuts dreams of being a real cop, but has been frustrated in his efforts. He rides around on one of those electric scooter things, and gets beaten up by weird lady customers. One day fate puts him alone against a violent group of thieves.\n\nThe action is sometimes fun, but unbelievable. The set-up sequence is awkward. It's too depressing, especially when Blart humiliates himself at an employee get-together, and injures himself in a stupid accident while on duty. It's a conventional underdog trying to make good story, and Blart seems like a nice enough guy to root for. Kevin James is good enough in the lead (he also co-wrote), but some supporting actors are weak. The bad guys, the pen salesman, the daughter, the bully-turned cop guy, the girl-friend; all overdone at times. Some of them are annoying. The ending throws in a bunch of unnecessary twists that mean nothing.\n\nStill, this is just shooting for low-brow slapstick, and is OK on that basis. But turn off your brain before watching."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "wkozak221",
        "review_rating": "2",
        "review_title": "disappointing film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "joejhrobinson",
        "review_rating": "5",
        "review_title": "Paul Blart: daddy cop",
        "review_detailed_main": "Kevin James is on point here (as always). While not up there with the likes of Zookeeper or Grown Ups 2, this is a HILARIOUS outing with this GODLY man. Mmmmmmmm tasty!!!!!!!!!!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Otoboke",
        "review_rating": "",
        "review_title": "Mall Cop is one big fat-guy gag.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "xherridea",
        "review_rating": "6",
        "review_title": "It's so dumb but I love it",
        "review_detailed_main": "This is one of my guilty pleasure films. I know it's formulaic, and some of the jokes are just bad, but I can't help but like how dumb it is, I have a soft spot for stupid humour and that's the entirety of this film. This won't be for everyone but I don't care."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "metalrage666",
        "review_rating": "1",
        "review_title": "Aren't comedies supposed to be funny?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "BachLynn23",
        "review_rating": "6",
        "review_title": "Stargate SG1 fans, anyone notice a similarity?",
        "review_detailed_main": "Are there any Stargate SG1 fans out there that noticed a similarity between this movie and Season 10 episode 16 (Bad Guys)? It came out 2 years before Paul Blart, I didn't think about it when I watched Paul Blart for the first time, but the other night I saw that particular Stargate episode again and it was like watching the movie only the bad guys weren't technically \"bad guys\" taking hostages, just SG1 confused for bad guys, but there's a \"security guard\" on the inside that at first isn't noticed by the \"bad guys\" and tries to do his part being the \"ears and eyes on the inside\".\n\nAs quoted from IMDb the info for that episode is: \"When SG-1, minus Carter, investigates a previously unexplored planet expecting to find themselves in a pyramid, they are astounded to find themselves in a museum. Finding a party occurring in the lobby, they decide to leave and make first contact later, but they find that the DHD is a replica and thus incapable of getting them home. They are discovered and believed to be rebels and are forced to take hostages to buy time for their escape.\"\n\nIt just made me curious if the writers for Paul Blart were perhaps stargate fans or if it was just a coincidence.....hmmmm"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "JungleBunnyBastard",
        "review_rating": "2",
        "review_title": "Just embarrassing to watch. That's all I can say.",
        "review_detailed_main": "Kevin James stars as Paul Blart, a likable, yet recycled character archetype, who just happens to be in the wrong place at the wrong time when a bunch of sport punks (?) decide to take over the mall.\n\nThis just felt like a seemingly overlong failure of bad, cringe-worthy dialogue, un-funny jokes, and stupid characters and situations. Not once did I care about anything going on on-screen, nor did I laugh once. The only thing saving this film from a pure 1 star rating is it's brilliant selection of classic rock songs that play few and far between. Even then, don't torture yourself. Just turn on the radio.\n\nYes, it's family friendly. Does that equal good family entertainment? I honestly think not. If you're looking for good family fun, rent a good classic and don't wast your time on this rushed, muddled mess of a film (it's obvious that they tried to get it in theaters for the holiday season, but failed at that as well)."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "mike683",
        "review_rating": "7",
        "review_title": "Not an Appalling Malling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ComedyFan2010",
        "review_rating": "4",
        "review_title": "Not so much a comedy, more a family movie",
        "review_detailed_main": "The first problem with the movie is that they sure take way too much time to introduce Paul Blart. Considering that he is not a very deep character (he is fat, lonely and loves his job. this is basically it) it could have been done in much less than half an hour that this movie takes\n\nWhen the bad guys come the movie becomes better. It is basically a Die Hard parody. I love the idea of the bad guys being on skateboards because it makes the action scenes so much more fun. In my opinion this is the best part of the movie.\n\nMy problem is that I didn't laugh through the whole movie. So it is hard for me to rate a comedy that wasn't funny not under 5. I think the genre is more family movie than comedy. It seems to me that this movie would be liked by younger audience, preteens and earlier teens. It is sure safe for them to watch, no swearing not too much violence.\n\nI also would like to give credit to Kevin James. His acting was great and he made Paul Blart a very likable character. He should just make better written movies. While I didn't find it funny, it seemed like a very cute movie to me"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "muhammad-66903",
        "review_rating": "8",
        "review_title": "Amazing",
        "review_detailed_main": "This movie is funny and good I don't know why the hate of this movie. I am not a Kevin James fan but this is a good movie."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "7",
        "review_title": "Decent enough old fashioned family comedy",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nThe titular Paul Blart (Kevin James) is an overweight, goof prone security guard at an American shopping mall who is disrespected by most people, with the exception of Amy (Jayma Mays) a pretty new girl he develops a crush on. But he gets a chance to be the hero of the day when the mall falls under siege from a gang demanding a ransom, where his bumbling heroism sets out to foil the terrorists.\n\nThis probably isn't the kind of thing I'd generally give much attention to, but everyone needs to watch something a bit light every now and again and this fit the bill perfectly. As others have commented, the tubbier leading man has always been delegated to the comic buffoon role, most notably the late John Candy, whom lead star James matches quite well indeed. He gets a great deal of his laughs from how laughably over the top the script requires him to go at times and make such a prat of himself and indeed how silly the script itself is in places, in amongst a lot of the more slapstick and pratfalls kind of stuff.\n\nThis is simply gentle, light, family entertainment that you could comfortably sit around and watch as a family, which is a type of comedy that's becoming less and less nowadays and so you can appreciate that bit more. ***"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "moskiter",
        "review_rating": "2",
        "review_title": "Not funny at all",
        "review_detailed_main": "I had an occasion to laugh twice during the entire movie, the whole rest was extremely stupid, I guess it was supposed to be a comedy version of \"Die Hard\" but completely failed. This movie may be good for under 13 watchers or for marijuana smokers... The movie is about a fat security guard who falls for some attractive woman. He has an opportunity to win her heart by outwitting terrorists who take her for a hostage at a mall. This might have been a good movie if they put some more realistic themes, not people popping up out of nowhere. The only reason why I watched this movie to an end was because I \"admired\" the stupidity of people who made this film. Don't waste your time watching this."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "spencejoshua-22736",
        "review_rating": "3",
        "review_title": "Felt like a TV movie.",
        "review_detailed_main": "Very few laughs. The campiness is over the top. The script was terrible. Characters were predictable. Paul Blart is one of the saddest characters I've seen. I will never watch this again."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Enchorde",
        "review_rating": "6",
        "review_title": "Easy watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "baumer",
        "review_rating": "1",
        "review_title": "This will be one of 2009's worst films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "antonidziewirz",
        "review_rating": "7",
        "review_title": "It's what you excpect from a movie containg a mall cop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "t-d-t-m82",
        "review_rating": "2",
        "review_title": "Cringey Rip-off of Die Hard",
        "review_detailed_main": "Ok it's incredibly tacky. Silly. Stupid jokes. Weird sequences which don't make sense or match the plot. Inept editing at weird angles often in the movie.\n\nBad guys who are just really dumb. Why would you write an account number on your body? It's from 2009 so it's got a lot of weird stuff which will be dubious now and maybe cancelled like the aging guy and his stupid young love interest and severe gap of 14 years.\n\nThe obese guy doing everything ott is just hilarious. The entire script rips-off Die Hard. Loads of extras for no apparent reason.\n\nJust a really dumb movie. The soundtrack is good and it gets a star for that. Edgar Winter is in it. Survivor. Old classic rock."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "undeaddt",
        "review_rating": "6",
        "review_title": "Fun movie to watch on a cold weekend night.",
        "review_detailed_main": "Not much to say about this movie. It is a pretty fun and relaxing movie in which Paul Blart takes the main role who is a very funny character that manages to become a hero by using his flaws. Everything that he does wrong suddenly become the right thing to do which is a classical comedy hero idea. Anyway, a very chill movie to watch with your family, just laughable without any dirty and unneccesary jokes."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "supernj",
        "review_rating": "5",
        "review_title": "Life is Heavy!",
        "review_detailed_main": "Kevin James only has a few movie's that are worthy of the title (Movie). Right next to \"Here Come's the boom\" this Kevin James film stands out mainly because of the hilarious edgy material."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "sirguitarist",
        "review_rating": "10",
        "review_title": "There is a reason they make movie trailers...",
        "review_detailed_main": "The reason they make trailers is so moviegoers can gather at least an idea of what to expect. \"Paul Blart: Mall Cop\" delivered exactly what I expected after seeing the trailer. The demographic here was people who like silly, action comedy with a pinch of romance on the side, perhaps a parent or parents looking for a movie to share with their tween or teenage kid. I fit that demographic. My young daughter and I laughed all the way through it - it was genuinely funny and I actually cared about the main character. Why some of the reviews on IMDb even get posted will never cease to amaze me - they aren't even reviews in some cases. The person who \"reviewed\" this movie by essentially blaming movies like Mall Cop to be why America has its issues is one that left me scratching my head. My advise to those that feel inclined to give ANY movie 1 star: Watch the trailer before you see a show...oh...you didn't even see it? Then don't review it! I gave it 10 stars based on the fact that it delivered what it promised."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Anonymous_Maxine",
        "review_rating": "7",
        "review_title": "Fun for security guards and civilians alike!",
        "review_detailed_main": "Shortly into Paul Blart: Mall Cop, I was struck by a sudden realization that I wasn't sure if the movie was making fun of all security guards or just the ones that take their jobs too seriously. In pondering that question, I realized that the fun-poking that the movie does could wreak devastating havoc on the rent-a-cop industry in the United States. Can you imagine the terror if it suddenly became cool for security guards to slack off on the job? I don't even want to think about it.\n\nThe next thing I did was mourn the sad fate of the Segway, which was introduced to the public back in 2001 and was intended (and many people believed it would) to completely redefine the way we travel within cities and even design the cities themselves. It's easy to have believed that, too. Merely a year into the 21st century, the realization that flying cars remain distantly in the future (or, more likely, forever limited to fiction) paves the way for a strong belief that the futuristic vision of 21st century Americans that we have been waiting for might be something as simple as this curious little vehicle on which Americans of the future must soon be zooming around on.\n\n8 years later, however, the Segway remains wildly over-priced and conspicuously absent from the general public. At most it's a curious oddity occasionally glimpsed in public, popping up more often as a sight gag in movies like Paul Blart or Ron Howard's brilliant televisions series \"Arrested Development\" than as an everyday means of transportation.\n\nAnd it's use on-screen is doing nothing to improve it's public image! Paul Blart is a mall security guard who believes that his job is not only on par with a police officer, but even a member of the military. He zooms importantly around the mall on his Segway, calling codes and status updates into his shoulder radio even as his superiors sit in the main security office teasing him for being so serious.\n\nPaul is a lovable guy but the movie tries so hard to get us to laugh not only at his dead- serious attitude about his low-profile job but also at his weight and hypoglycemia issues that it becomes nearly impossible to accept his budding romance with a local hair-extensions salesgirl. Kevin James, of \"King of Queens\" fame, is a wonderful comedic actor who brings back fond memories of John Candy, but most of the movie hangs from him like a wet blanket.\n\nI do appreciate, however, that the movie attempts to get us to laugh without a single sex joke or body noise or any other such nonsense, and it's not overflowing with pointless profanity like so many other low-brow comedies these days.\n\nThe action and romance are both thoroughly ridiculous, as are the bad guys who take over the mall (with an intricate plot to steal, I kid you not, credit card numbers) and then race around it on skateboards and BMX bikes, , but it's important to realize that the movie is a fun romp around a barricaded mall, sort of like what you would get if you combined Dawn of the Dead, Die Hard, and Home Alone, and removed any possibilities of zombies or bloodshed. Home Alone, for example, was gorier than this movie.\n\nAnd besides, it also features the funniest Indian accent since the 1986 classic Short Circuit. Peanut Blart and jelly!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "oprlvr33",
        "review_rating": "3",
        "review_title": "Comedy is not the appropriate label",
        "review_detailed_main": "How in the world this thing got labeled a Comedy is beside me. We didn't laugh even once. In fact, we barely got through 20 minutes of this before becoming bored stiff, then turning it off. And we've seen our share of bad or flat Comedies. They last maybe a week or so at the box office before going video. And I vaguely recalled the premier for this thing: it didn't look too funny then, but that was several years back. At least we gave it a shot.\n\nNow granted, I was never a King of Queens fan; never quite got its humor. But that's okay; it wasn't for every audience, and it was a TV show. However, James' comic-film performance here is weaker than yesterday's coffee. He tries way too hard: timing stunk, and his \"jokes\" got lost. And I'm not singling out James here. Most of the film's action was flat or lost all together.\n\nAnd Carr is not one of my favorite directors. I've seen the trailers and excerpts from a few of his comedy films, like DADDY DAY CARE and DR. DOOLITTLE 2. Was unimpressed. And obviously, he gave James little or no direction to work on this film.\n\nWe've all heard of Bad Casting and Bad Scripts. Well, this film was one of those.\n\nAnd agreed with a few other reviews: John Candy would have aced this role. Kevin James does not."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "alex-caruso1",
        "review_rating": "",
        "review_title": "This movie knew how to be funny.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "e_nugo",
        "review_rating": "6",
        "review_title": "Die Hard - on the mall",
        "review_detailed_main": "There is really not much to say about the movie. It has several funny moments and some interesting scenes which are enough to make you smile, but nothing more.\n\nThe movie doesn't have much to offer, accept a beautiful Jayma Mays as a leading actress. Don't take me wrong, Kevin James is a capable actor, but really for me, Jayma Mays is the pearl of this movie (and the reason why I add 6 star even though I believe the movie only deserve 5).\n\nThe story was OK, but the way they developed the story was not enough to invite great laugh. But nevertheless, they provided some funny moments which will definitely bring some smile.\n\nIf you a fans of Bruce Willis Die Hard - you can consider this movie as a light version of that movie, but with heavier leading role.\n\nIf you looking a funny movie - this movie is OK, but I will not recommend you to go to the Cinema. Just wait for the DVD...so the price that you pay will make your smile come more easy."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "DJ_Shilo",
        "review_rating": "5",
        "review_title": "A Hero Shall Rise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "george.schmidt",
        "review_rating": "6",
        "review_title": "Predictable and occasionally humorous mix of comedy and action - a \"DIE HARD @ THE MALL\" if you will; James acquits himself as a latter-day John Candy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kevcoop7",
        "review_rating": "4",
        "review_title": "Paul Blart is a decent movie",
        "review_detailed_main": "I'm not one of those critics who blast movies out of proportion and out of context. This movie is a movie in which I can have a good laugh at how cheesy, stupid, and bad this movie is.\n\nFor this review, I will be talking mainly about the acting, characters, and the comedy.\n\n1) The characters- For one, the characters aren't all that bad. The character of Paul Blart to me if a lovable, goofy, and funny character who should be a sympathetic character. HIs daughter, on the other hand, is just plain annoying in this movie. This character got on my nerves, but that's just what the actress worked with. The love interest is also kind of an airhead and the romantic subplot is think is just shoehorned in this movie.\n\n2) The Acting- The Acting was okay for the most part. The guy who plays the new guy, Vec Simms, he does well as well as the main star, Kevin James. Kevin James is a funny and goofy comedian who can make me laugh no matter what he's in.\n\n3) The comedy- To be honest, the comedy in this movie is a little bit lame, but still, it makes me laugh at loud in several places, and when it does work, it works well.\n\nAll in all, I consider this movie a guilty pleasure movie, and when I want some mindless comedy, Ill watch this."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "nckmear",
        "review_rating": "7",
        "review_title": "Kevin James plays Paul Blart, who is a mall cop. On Black Friday the mall is taken over by a group of skilled robbers. It is up to Paul Blart to save the day.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "KineticSeoul",
        "review_rating": "3",
        "review_title": "Not even worth renting, it's kid friendly though",
        "review_detailed_main": "This is a pretty bad movie, that tries to make a parody of \"Die Hard\" movies. Watching the this was like watching a obese and retarded John McClane running around and doing stuff to take down the bad guys in a very unfunny way. This movie would have been alright if the mall cop or Paul Blart use the mall more as his advantage to beat down the bad guys, but most of the movie relies on fat man humor and that is basically all this movie is when it comes to try to be funny. This is a kid friendly movie though, so you can watch it with your kids if you have any.\n\n3.5/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "SnastyZ",
        "review_rating": "9",
        "review_title": "Really good movie............and I mean it.",
        "review_detailed_main": "This movie was really good. It is the story of how Paul Blart, a semi- useless mall cop has his mall invaded. He has to save the woman he loves and his daughter from the invaders, who are lead by double agent Veck, a mall cop in training. This movie is funny mainly because of the physical comedy. The words that are said are not really that funny, but the actions are hilarious. Paul Blart does everything from falling out of an air vent to faking hypoglycemia. This movie is only funny if you are really stupid, but it if you are really stupid, you will love this movie. I recommend this movie for anyone who is either five years old or will Laugh at anything."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "KUAlum26",
        "review_rating": "6",
        "review_title": "Another poster said it,but it's so true{{Spoilers??}}",
        "review_detailed_main": "Another person,writing a review of this not long after its release,entitled his comment\"About as good as a movie named Paul Blart:Mall Cop could be\". I felt like I couldn't have said it better.\n\nThe title character is what he is,but he's also a gentle,idealistic guy who is very proud of his work,his work ethic and takes his roles as a security guard,son and father--a single dad,at that--very seriously. Paul(Kevin James,who really IS the sum total of much of what is good about this movie) cannot get most anyone at the mall,even most of the other mall workers,many of whom like him,to really respect him. He longs for companionship and love,which he seems to find in the sweet but somewhat vacant hair-piece saleslady(Jayma Mays,who has the best set of \"Carol Kane eyes\" since,well...Carol Kane!)who runs a Kiosk in the center of the large new Jersey super mall he trolls. When a group of physically skilled and mostly(stress mostly)well-trained burglars overtake the mall,take hostages and lock out much of the post-Thanksgiving \"Black Friday\" crowd,they don't count on locking in our hero. Of course,Blart's size and seeming inability to control simple conflicts(getting his butt kicked by an irate portly woman inside a Victoria's Secret a day or two before)would seem to make him hardly a match for well-armed thugs but,well...you know how this'll go.\n\nA respectable supporting cast that includes Shirley Knight(as Blart's sweet,well-meaning mom),Rani Rodriguez(as Blart's adoring daughter),Peter Gerety(Blart's boss,who utterly doesn't get him),Adam Ferrara(as the chief of police),Bobby Cannavale(as the uber-macho SWAT commander)and Keir O'Donnell(as the mastermind of the crime)are pretty much window dressing for James' movie,an obstacle course of various physical stunts and pratfalls that he executes with as much plain,honest effort as it does over accentuate his size. Another thing that the previous poster(among others)got right was the fact that James is as much picking up the mantle for the proud tradition of \"fat guy\" comic actors playing erstwhile lovable lugs/heroes such as John Candy,Chris Farley,John Belushi and Dom DeLuise. His ability to play both sympathetic yet fitfully funny big guys who are prone to disaster but also heroism is a somewhat untapped quality(outside of the occasional plucking of his non-verbal comedy on the long-running series \"The King of Queens\")that gets PLENTY of work and good use here.\n\nThis film has producer Adam Sandler ALL over it,which,while very easily identifiable(right down to Sandler longtime fave Allen Covert in a bit part),is more of a help than a hindrance to this very light,very easily digestible comedy. Not what many would call a \"high dollar\" or \"priority\" movie experience,this is a perfectly good rent or second-hand theatrical buy(i.e. \"cheap movies\")and,with your expectations kept low(perhaps VERY low),one can get the desired effect out of Paul Blart,New Jersey's best and bravest mall cop."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "scootrah",
        "review_rating": "1",
        "review_title": "Why was this made?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Ruskington",
        "review_rating": "2",
        "review_title": "Ninety minutes you'll never get back",
        "review_detailed_main": "How on earth did this ever get commissioned? I can't remember being so utterly bored by a 90-minute film before. I mean, it's not just that it's atrociously acted and embarrassingly unfunny, it's mainly just really boring.\n\nKevin James isn't generally too bad but I don't know what was going through his head when he took on this role. He manages to make his character reasonably likeable I guess, but that's about the only positive thing to say about this debacle. Well, I suppose you could argue that it's not as lewd, cheap and grotesque as certain other Hollywood comedies when it comes to sex jokes and toilet humour.\n\nThis film almost nudged it's way into the 'so bad it's good' category but the pretentious portrayal of the 'bad guys' put a stop to that, showing that the writers had no such wryness when concocting this monstrosity. Truly dreadful."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ichocolat",
        "review_rating": "",
        "review_title": "Goofy Goofus Cop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "reb-warrior",
        "review_rating": "7",
        "review_title": "Endearing comedy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Dr_Death666",
        "review_rating": "7",
        "review_title": "Doesn't deserve all the abuse it gets, but has some flaws.",
        "review_detailed_main": "Paul Blart: Mall Cop is another Adam Sandler made Happy Madison movie. It is pretty funny, but also a bit boring for a few reasons.\n\n1) Some comedy is just too exaggerated. Like when Paul got drunk, that was just a pathetic attempt at comedy.\n\n2) The acting. Kevin James was good as Paul Blart and so was the actress for that girl he liked, but the other acting sucked pretty bad.\n\n3) It kind of ran on. I mean, stop the burglars already and stop going through all these stunts.\n\nTherefore, this is worth watching if you can, but otherwise you're not really missing much.\n\n7/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "heorgehaywood",
        "review_rating": "1",
        "review_title": "Horrific",
        "review_detailed_main": "How this film has a 20% approval rating is beyond me it is absolutely one of the most disgusting things I have ever seen produced and the loveliest piece of work (of any form) that I have ever experienced. It is an absolute disgrace and if I could remove it from the world I would. I genuinely have only made a account on this site to leave a review on this film because I genuinely feel scarred at what I have just witnessed."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "artnouveaustyle",
        "review_rating": "6",
        "review_title": "Clean Comedies are Rare",
        "review_detailed_main": "As someone who enjoys well-made films with intelligent story lines and inspiring cinematography, I found Paul Blart to nearly tortuous to watch. The humor was mostly slap- stick and the plot turns were predictable.\n\nSo why did I rate this film a 6 out of 10 instead of lower? Because unlike most comedies of this type, Paul Blart was fairly clean in its content. It was a movie I could sit down and watch with my in-laws and nephew without being embarrassed. They enjoyed it thoroughly and laughed through the entire film. There was little, if any, profanity or sexual references. It's a comedy that many adults could take their children to and enjoy without having to worry, a quality you will be hard-pressed to find in many live-action comedies today."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "j-lacerra",
        "review_rating": "3",
        "review_title": "Not So Good",
        "review_detailed_main": "The only thing this movie has going for it is Kevin James' ability to do pratfalls and stunts. He seems to excel at this. But his character, obviously meant to be a lovable schlub, turns out to be not lovable at all. He is a glutton, a stalker, and a ridiculous low-rent martinet. The movie offers few laughs, but does provide a bit of interest by satirizing DieHard. The supporting cast turn in journeyman performances. The movie suffers from a lack of funny."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Dante_The_Weedeater",
        "review_rating": "9",
        "review_title": "Kevin James at his best!",
        "review_detailed_main": "This movie is hilarious, I was laughing through the entire thing. Its gotten some low ratings for whatever reason, but I highly encourage you to see it; I was unsure of whether or not I would like it at first (Being deterred with the infamous 'PG' rating) but it exceeded my expectations, and I left the theatre with a sore face from nonstop laughs. See this movie! It's Kevin James' best film since 'Hitch'.\n\nI had really high hopes for this movie, especially after being so disappointed by 'Chuck & Larry'. But this movie's comedy does a much better job of mirroring that of 'King of Queens' only with whackier subject matter. I think I may have bit my lip when I saw the 'PG' rating, but there isn't a single kiddy or immature joke to be found. I hardly ever say this, but in the laughter department 'Mall Cop' is practically flawless.\n\nTake a chance on this movie; you won't regret it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kingstew2000",
        "review_rating": "6",
        "review_title": "Somewhat funny but intelligence assaulted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "optimusprime12345",
        "review_rating": "1",
        "review_title": "The worst movie ever and ever",
        "review_detailed_main": "I was watching this and I did not laugh one time there is nothing funny about this movie.\n\nI would leave it like that but I have too write 10 lines so why are people saying the segway scooter are going too be popular they been out since 2001 and they still cost 4 grand.\n\nSo anyway this movie was a little on the boring side and I almost was falling down sleeping.\n\nI had too literally make my self stay awake too see this garbage.\n\nI'm not putting down the actors they can't tell too be a really dumb movie from the script can they. There was some decent acting in this movie but this movie is as stupid as that Love Guru I could not stand that movie it was just as bad except it had Mike Myers in it.\n\nI just have too say stay away from this movie go see a decent movie like Marley and me that has some soul."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "b105110",
        "review_rating": "3",
        "review_title": "Absolutely pathetic! NOT EVEN REMOTELY FUNNY!",
        "review_detailed_main": "Okay guys Hollywood is just mass producing garbage! Paul Blart is an absolute loser, I mean he just was piece of shi*. There was really no satire that made me feel, remotely sorry for him. I wish I could have wrote the end of this story, because really anyone that pathetic doesn't deserve to live. I feel like this was Kevin James biography, but his career was disguised as a mall cop. They both are horrid at what they do and get some much recognition. HUGE WASTE OF MONEY AND TIME.\n\nThank you for your time\n\nCarl the critic"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Ddey65",
        "review_rating": "",
        "review_title": "Raini Rodriguez actually sold this one for me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "socrates4",
        "review_rating": "4",
        "review_title": "Dumb Comedy Done Poorly",
        "review_detailed_main": "PAUL BLART: MALL COP is the typical formulaic dumb comedy, with corny humor and cheap laughs. Sometimes these are done well, and the dumbness actually leads to a good movie. That was not the case here.\n\nThe story is boring and the jokes are never quite funny enough to laugh at. The acting is bad and the story is completely unbelievable and often too dumb. I didn't like Kevin James before I watched this movie, but now I like him even less. It was made quickly and cheaply. And badly. Do not recommend."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "sanadalsalt",
        "review_rating": "6",
        "review_title": "Finding the John Candy Spirit in Kevin James' Latest Comedy",
        "review_detailed_main": "This film is receiving an unexpected amount of criticism, and I'm unsure why. It contains minimal violence, even less in terms of sexual content, and the gross-out humor is far below the usual level seen in recent comedies. The antagonists navigate the mall using mountain bikes, skateboards, and impressive parkour moves. Clearly intended for a PG audience, it succeeds in that regard. It's a wholesome family comedy that everyone can enjoy. When I watched the movie, the theater was filled with families, all of whom seemed to have a great time. They laughed and giggled, and there was very little of the bored chatter often heard at kids' or family movies.\n\nAfter watching this, I couldn't help but think about the John Candy movie \"Summer Rental.\" Candy had played various roles in films prior to that, but in \"Summer Rental,\" we see the classic John Candy affable lug character that served as a template for many of his subsequent roles. His characters were typically some variation of that, and he portrayed them well, earning the adoration of many. Kevin James possesses a similar likable quality, and I hope that he carries on the easygoing legacy that John Candy left behind.\n\nTo echo Paul Blart himself, \"Don't dismiss this movie.\" As I mentioned, there were numerous scenes that had both children and adults laughing together. Isn't it worth at least the price of a matinée ticket to share some laughter with your kids?"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "unfunny bland PG humor",
        "review_detailed_main": "Paul Blart (Kevin James) can't get in as a New Jersey State Police for his hypoglycemia. He's a single dad, a super nice guy, and takes his job as a mall security guard seriously. He's infatuated with the really nice Amy (Jayma Mays). When the mall gets taken over by some bad guys, Paul rises to the occasion even if the police doesn't want him to.\n\nThis is the blandest of PG humor from Kevin James. It has no bite and neither does his character. This super nice guy doesn't have anything funny. He's mostly sad and pathetic. Sometimes it's almost chuckle worthy but it's mostly snooze ville. The whole mass robbery scenario is just stupid and so is the movie in general. The bad guys are a strange mix of trying too hard to be hard, and hopelessly unweaponized puppies. Why try to be dangerous when the PG humor won't let it go there? It's all wrong."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "meeza",
        "review_rating": "6",
        "review_title": "\"Mall Cop\" is criminal in plot but James' comedic acting development saves it from being arrested!",
        "review_detailed_main": "Kevin James is king in the comedy \"Paul Blart: Mall Cop\". He plays the title character. Blart is a\u0085. (well, just read the rest of the movie title) who is a single father, lives with his mom, is a cholesterol poster boy, and is a klutzamaniac clown. But that is what makes Mr. Blart a piece of comedic art. He definitely takes his mall security job way too seriously probably due to the fact that he has never been able to be a full-fledged Police Officer because of failing endurance physical exams to get into the Police Academy. Blart goes into \"Die Hard\" radar when a group of criminals seize the mall where he secures. In the style of the Bruce Willis classic \"Die Hard\", Blart is entrapped in the mall with the criminals. He must use some John McLaneish magic my friends to save the day. The criminals do have held hostage several of Blart's loved ones including the female object of his mall desire Amy and his daughter Maya. Blart does do a lot of \"Yippe Me Calle\" falls through his slapstick stumbling adventures to catch the bad guys and rescue the hostages. Kudos goes out to Director Steve Carr for creatively incorporating the \"Die Hard\" homage within the \"Mall Cop\" plot. But Carr ran off the road way too many times with physical-comedy overkill turns, and gave bad directions with all the redundant subplots within the \"Paul Blart: Mall Cop\" storyline. Kevin James' screenplay of \"Paul Blart: Mall Cop\" was not an easy sale at times, but thanks to his acting of his words it justified its existence. King James dunks it through with his side-splitting performance in \"Paul Blart: Mall Cop\" but the rest of the film's components died easy and was close to mal! *** Average"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "wwnelson",
        "review_rating": "1",
        "review_title": "Are you kidding me",
        "review_detailed_main": "This with out a doubt is one of the worst movies ever, I am surprised people would waste an hour and a half of there lives to watch this movie, please if you have to choose between watching your dog do bum skids across the carpet or watch movie....watch the dog it is much more entertaining. I really enjoyed Kevin James in Hitch but since he was in that movie he has relagated himself to \"B\" movies which is really to bad because in the right movie he is really a wonderful actor. There are few scenes which will make you smile but if you older then 5 years old the dog will definitely make you laugh more then this movie. If you have to watch it buy lots of popcorn it will keep you busy."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jjjimena-63307",
        "review_rating": "10",
        "review_title": "Best. Movie. Ever.",
        "review_detailed_main": "My dad once told me \"Paul Blart: Mall Cop will be the turning point in your life.\". He told me this on his deathbed June 7th, 1990. He knew this masterpiece was coming, he saw it in my future. And now, I would like to explain how it has impacted my life. I was at a movie theater during the good ol' days of '09. I was very lonely, I came to the movie theater just for casual human interaction; I did not know what to watch. Suddenly, I overheard two teenage girls talking about a movie on display, \"This is such a stupid movie!\" one said \"Yeah, I can't believe losers are actually paying to watch this LMAO!\" the other said. As soon as I heard \"losers\", I knew this movie was for me. I went to go see what had caused all that fuss and it was Paul Blart: Mall Cop. No. Way. My father's voice engulfed my thoughts. \"Watch it son, watch it now\" and I did just that. I bought a ticket, the teenagers snickered as I passed, I got some popcorn and coke, and I made my way to my seat. Next to me, there was this middle-aged man. I accidentally placed my drink in his cup holder, so I said my simple \"Sorry\" (a riveting moment for me, for I had not spoken to a person whom was not forced to talk to me in a long time) and I started watching the movie. Paul Blart was so funny, he inspired me and made me feel less self-conscious. The middle-aged man then spoke up \"I wanted to be a mall cop since I was 7 years old, but now I have to live off mall cop movies because I am a criminal and they would never let me be mall cop\"; by the end of his sentence, he was almost in tears. I consolidated him, I told it was okay, that I too had a dream that I could no longer pursue. I forgot to mention, but I am SUPER rich, so I told him, \"You know, what if I buy a mall and just hire former criminals? I would hire you!\". He kissed me on the cheek \"You are the best! What could I ever do to repay you?\" he said. I said \"Marry me?\" (I am very rich so I had been carrying a ring with me just in case) and I got on one knee. He said yes! At this point, the movie was ending, and this is when I decided that I wanted Paul Blart to do our wedding vows. We got a look alike and he performed our wedding vows, and to this day, we are happily married. Thank you Paul Blart: Mall Cop for giving me the confidence to propose and being a movie about a mall cop!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "barrys82",
        "review_rating": "6",
        "review_title": "Watch it if you have nothing else to do",
        "review_detailed_main": "Mall Cop tells the story of Paul Blart (Kevin James), a mall security guard. When the shopping mall is overtaken by a gang of organized crooks, it's up to the a mild-mannered security guard to save the day. The movie is flat and the plot is kinda predictable, you can know from the very beginning the the leading character, a dumb, overweight person will become the hero and will end with the hot girl of the movie. It has its funny moment, very few but funny anyway. The cast is good, Kevin James is the one that carries all the movie, his performance is hilarious, Jayma Mays was good, convincing enough. In conclusion, Paul Blart: Mall Cop is OK movie which only purpose is to entertain. Recommendable if you have nothing else to do."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "gilgongo1980",
        "review_rating": "4",
        "review_title": "weak comedy, probably made for children",
        "review_detailed_main": "I liked King of Queens because it was comedy for the whole family. But this film is too childish and too stupid for me."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "MB-reviewer185",
        "review_rating": "5",
        "review_title": "Mall cop",
        "review_detailed_main": "Kevin james is funny and had interesting action, stunts and over the top robbers.\n\nThe third act was the best of the movie"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "zkonedog",
        "review_rating": "5",
        "review_title": "Okay...In Small Doses",
        "review_detailed_main": "The type of physical humor perpetuated by Kevin James is worth a few good chuckles, to be sure. The trouble, though, is that it is only good for \"X\" many jokes.\n\nFor a basic plot summary, \"Mall Cop\" focuses on Paul Blart (James), an overweight mall \"security officer\" who continually fails to become a true gun-toting policeman. Just when his life seems to be at the lowest, however, he is thrust into a high-pressure hostage situation that tests his mettle.\n\nThe first thirty or so minutes of this film are legitimately funny, watching Blart blunder through situation after situation. James is an accomplished physical comedian who knows exactly how to comically move his oversized body.\n\nYet, the jokes stop being funny in the second half, when the film gets a little too repetitive. Those same \"fat jokes\" that worked so well in the opener are old hat once the climax approaches.\n\nThus, this is a decent little family-friendly comedy. It isn't great, but you'll genuinely laugh on more than a few occasions."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "JoeytheBrit",
        "review_rating": "3",
        "review_title": "Like a fruit cake without currants...",
        "review_detailed_main": "This pallid offering barely qualifies as a comedy because it barely possesses any humorous moments. Its plot is so predictable – and mechanical – it might have been written by a computer. Kevin James plays an overweight loser who channels all his energies into his job as a security officer at a shopping mall. He lives with his mother and his daughter and suffers the mocking of his workmates with wounded dignity. Although he has a daughter, a five-line conversation informs us that she is the consequence of a marriage that was merely a trick on the part of the guy's wife to get into the States. He worships the owner of a stall that sells wigs, but lacks the necessary courage to ask her for a date because he believes she's out of his league (she is).\n\nIt doesn't exactly sound like a barrel of laughs, does it? But while the film is focusing on the pathetic slog of our hero's life, it is at least bearable. Although he's depicted as a loser, Blart doesn't have a malicious bone in his body, and he's amiable enough to make you want him to come through a winner. But then the story takes a Die Hard twist when a gang of thieves seal off the mall with the intention of stealing the takings from the major shops. From this point on, the story grows increasingly silly but still manages to avoid any humorous situations. Any meagre laughs are won by James' attempts at physical comedy as Blart tries to skid and roll around the mall like an action hero.\n\nThe lead bad guy pretends to be a decent sort for the first half of the film, and it's a little strange that he's more believable as a good guy than a bad"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "AlphaBravoCheesecake",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Literally didn't laugh once throughout the entire film. It was simply awful"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "xinzhaorekter",
        "review_rating": "10",
        "review_title": "Some say its painful, i say its extremely fun",
        "review_detailed_main": "I mean seriously, as a good movie, it falls flat, but as a so bad its good movie, this is incredibly fun, if you want to have a good time and see one of the best so bad its good movies them go right in"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "DanTheMan1982",
        "review_rating": "1",
        "review_title": "So not funny",
        "review_detailed_main": "I'll make it short:\n\nI did not laugh once. It was just a waste of time. It must be really hard to direct a comedy by trying to keep out everything that could make it a least bit funny. I went with my wife to see the movie and I was the one who picked it: I was embarrassed and almost lost my saying in any future movie choice. But I've learned one thing: Kevin James just isn't enough. I like him ever since King of Queens, but here he was just a disappointment.\n\nSince some people laughed at the cinema, I'm maybe not getting it. Or they are just easy to impress. I'm guessing the ladder."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "dave-sturm",
        "review_rating": "5",
        "review_title": "The movie theater was pleasantly warm",
        "review_detailed_main": "I woke up one morning to find my house was 40 degrees because my furnace was on the fritz. I called for a repairman, but realized I had to get out of the house in the meantime. I headed for The Avenue in White Marsh, Md., which is a fake main street with a multiplex next to a mall. The earliest movie was at 10:15 a.m. and it was \"Paul Blart \u0097 Mall Cop.\" I bought a ticket for $6. My feet were blocks of ice.\n\nI got to see a preview of the next \"Fast and Furious\" showing a raid on a \"land train\" carrying gasoline. Wow! When I got home I watched it again on YouTube.\n\nThe movie has some laughs. His Segway has a revolving cop light on top. I chuckled at the car-to-car leap scene.\n\nDuring the romantic parts, God help me, I started thinking about King Kong and Fay Wray.\n\nThe gang that takes over the mall is a bunch of acrobats on skateboards and mini bikes. If one has to leap from place to place, he does a somersault in mid-air. Food on the table for stunt folk, I guess.\n\nBlart's boss, the chief mall cop, asks Blart, Why? \"I took an oath,\" Blart says. \"We don't have an oath,\" chief says. Blart replies, \"I made up my own.\" That's clever.\n\nHe ends up wrestling with an aggrieved fat woman and her blouse pulls up, revealing a bra strap as wide as your hand. WTF?\n\nAll in all, pure out-of-the-can Hollywood B product. Professionally done, though.\n\nWhen the movie was over, my feet were nice and warm. I headed over to the mall to buy a space heater."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "lgalloway-92845",
        "review_rating": "1",
        "review_title": "No suprise. Yet another Kevin James film that sucks.",
        "review_detailed_main": "I don't understand why EVERYTHING that James does had to be terribly stupid, boring and NOT funny. Watching the washing machine provides a much higher entertainment value. Please Mr. James stop making films. Being overweight and acting like your clumsy and stupid doesn't help anyone....just stop."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "llVIU",
        "review_rating": "1",
        "review_title": "Research material",
        "review_detailed_main": "If you ever need ideas on finding unfunny jokes or cringy moments, just pick this movie.\n\nOh, by the way, it also includes nonsense about how it's legal to harass people, stalk them, not do your job and somehow not get fired, and other things.\n\nSorry but I couldn't get past half an hour. I couldn't get over the fact that an attractive woman was interested in a complete and utter loser. Dragons, aliens, sure, whatever, I can accept magic wizzards, but any fictional story has its limits. A 10/10 girl will never date a 1/10 manchild."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "maryntom2",
        "review_rating": "3",
        "review_title": "Should have been PG-13",
        "review_detailed_main": "The trailers and commercials for the movie \"Mall Cop\" were very misleading. They implied that this would be a family-friendly movie with plenty of slap stick humor. Since it was rated PG, we took 5 children between the ages of 7 and 13 to see this 'comedy'. We ended up walking out after 45 minutes after being offended countless times with the sexual suggestiveness, profanity, bullying and lack of humor. This movie unrealistically depicts an antiquated security department where the officers are untrained with basic technology like cell phones.\n\nWe did appreciate the way that the main character stood up respectfully for his ex-wife in a conversation with his daughter.\n\nThis is NOT a movie for preteens at all - parents beware!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "mattkratz",
        "review_rating": "8",
        "review_title": "good KJ vehicle",
        "review_detailed_main": "If you like Kevin James, then you will like this movie. This succeeds mostly as a comedy and a vehicle for him. Just don't examine the movie and/or the plot too closely, and you will enjoy it. James plays a mall security officer with state trooper aspirations and frustrations over his love life and problems at home. (I love the scenes at the beginning setting these up!) He starts training a new recruit at work and develops a crush on a lady employee at the mall. New problems start to develop when she gets held hostage by the bad guys in the bank, and he has to come to the rescue. One of the rescue workers has a great role. This is a good movie for any comedy fans. I liked it.\n\n** 1/2 out of ****"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "petit76",
        "review_rating": "3",
        "review_title": "awful.. a great deal of frustration",
        "review_detailed_main": "When I saw the premise of this movie, I had a chuckle. It had the potential to be a decently funny movie, something perhaps with heart, something that delivered a good deal of laughs and you walked out feeling good. I wasn't expecting an Academy Award winning movie. Its definitely not Oscar-worthy. The real disappointment lies in the lack of humor in it.\n\nPaul Blart (Kevin James) is a mall cop that seems to have no direction in his life. They go to good lengths to show how truly depressing his life is. Paul sees a woman in his mall, Amy (Jayma Mays), running a stand for hair extensions. He realizes that he needs to be with her and tries to woo her, even though he has no self-esteem. Just as the story is falling apart, the mall where they both work is robbed in a supposedly sophisticated scheme. Suddenly our slovenly friend is thrust into a role where he can try to impress the love of his life and excel at his job at the same time. Easy to guess where this story is going, no? The acting was okay, the direction was tolerable. The problem is the script. As I said, the story itself had potential. It just felt as if the writers could decide where this was a character they loved or hated. It really could have used another re-write or two to develop the script a little more. The movie is tolerable, but realize that not only are you not seeing an Oscar-worthy movie, but you'll be a little disappointed in the laughs as well. 3/10 .Evren Buyruk from USA"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "nains-1",
        "review_rating": "1",
        "review_title": "cow-dung productions: Straight to DVD \"art\"",
        "review_detailed_main": "Hey guys, I've just finished watching Paul Blart/Mall Cop, and now I really think I need a CAT scan to make sure I didn't get brain cancer....This movie is SOOOOOOOOOOOOOO bad it will make you puke..literally.\n\nLow budget would be a compliment...Acting.. what acting? If an average Joe grabbed an entry level (no focus setting or white balance) NTSC camcorder and re-shot this cow-dung-of-a-movie, than maybe this could be a bad C-category flick. I watched the whole thing, by-the-way. The beginning looked promising, I mean a couple of popular actors, Adam Sandler's name on the credits, etc. About 15 minutes into the action it looks like the screenwriter, director and actors said: \"F*** it! - Let the cameras roll and lets wrap this beotch up\". I have seen many bad movies, but this one takes the cake.\n\nQuestion for Kevin James: Dude, what the hell? Who's your agent? You were OK in that flick when you were a pretend gay fireman with Sandler, but now this? Hope you realize you just committed career suicide: you'll join Chevy Chase and John Travolta... RIP my friend\n\nJayma Mays (hope I spelled your name right) - history should be your major now, 'cos that's what you are about to be...i mean \"Epic movie\" was bad-ish, but this is rat-poison to you cutie pie...however, I got good news for you: you don't have to start waiting tables at Applebees - I'll help you out: hit me on my IM - na21ins@yahoo.com (I've been known to always help a damsel in distress)\n\n... In conclusion: If you want to buy a new flat screen and you're looking for reasons to destroy your old set, watch this \"movie\". Seriously, don't waste your time on this genital wart!\n\nPS: How in God's name did this flick get a 5.4 rating from almost 10,000 peeps? - Was that you Kevin James? Giving a 5 star to your own excrement is not cool... (or maybe Sandler got bored and hit the keyboard with his awesome good for nothing talent).\n\nHollywood, take notes: this kind of movie gives p2p sharing(you know what that means, amigos) super powers...If anyone had to pay to see this \"artistic creation\" you'd have a class law action suit on your hands....long live the Swedish pseudo-pirate guys!\n\nPPS: I am adding this to my original post: how the hell is it possible that some people gave a POSITIVE review to this crap...more than a star, etc... To the people who thought this was \"a funny movie\" , \"a great time\", etc: YOU ARE BRAIN DEAD... The world would be a better place without you, morons. You give America a bad name...your IQ all put together is - (minus) 500...etc. I admit that is is possible that Sandler and James hit the web with positive comments to their common diarrhea inducing flick... This is my 1st post on IMDb...this flick was so terrible it made me waste an additional 30 minutes to post this and warn potential viewers. This, for me, is like preventing a crime: DO NO WATCH THIS CRAP, it will hurt your insides and dumb you down!...no joke... read the rest of the comments here."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "4",
        "review_title": "Paul Blotched: Meter Maid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "eminkl",
        "review_rating": "3",
        "review_title": "While a couple of the sketches are funny, overall the film is extremely stupid",
        "review_detailed_main": "Kevin James is a one man army in the goofball comedy Paul Blart: Mall Cop. When a skater gang attempts to rob a shopping mall on Black Friday and takes hostages, it's up to security guard Paul Blart to save the day. The comedy is poorly written and incredibly juvenile, yet James and co-star Jayma Mays manage to make some of it work. However, while a couple of the sketches are funny, overall the film is extremely stupid. Paul Blart: Mall Cop delivers a few laughs, but it's just too dumb to enjoy."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "beal_brad",
        "review_rating": "5",
        "review_title": "Wait till this one comes out on DVD",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "oisinstack-97331",
        "review_rating": "10",
        "review_title": "mall cop, best movie of all time? lets talk about that..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jim-2441",
        "review_rating": "4",
        "review_title": "Slightly tolerable",
        "review_detailed_main": "Everyone in this film seems willing to read their lines and hit their marks. There's lighting and direction. The sound seems to match what's going on in the film. The characters remember their names. The mall appears to be an actual mall.\n\nThe star has reasonably good control of the Segway he rides in nearly every scene of the film. His character calls for him to be fat, which he appears to be.\n\nI might have laughed once. I don't remember. I felt more discomfort than interest. I don't imagine the cast or writers ever imagined the film might be very good, but it appears to be making money.\n\nI think I've written enough words now."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Prismark10",
        "review_rating": "4",
        "review_title": "Segway patrol",
        "review_detailed_main": "Kevin James continues his quest to be a leading man in light comedy/action films.\n\nHe plays an overweight security guard in a shopping mall with a dream of becoming a cop. Paul Blart is an amiable, likable guy as he patrols the mall in his Segway and hoping to keep his diabetes in check which causes him to suddenly pass out.\n\nPaul Blart is dedicated to his job, he lives with his mum and is a single father. He likes a lady (Amy) who works in the mall but becomes too shy when he is around her.\n\nIt just happens that the mall is robbed and Amy and his daughter are held as hostages.\n\nThis allows Blart to spring into action using improvised measures (almost Home Alone like) against the gang of robbers. This is also at odds with the advise of the SWAT commander who also happens to be his old high school bully.\n\nThe film is wholesome but just too damn predictable. Its light, likable but also lame with Blart acting daft in some inopportune moments."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Hayden-86055",
        "review_rating": "5",
        "review_title": "Not a well made film but genuinely funny",
        "review_detailed_main": "Paul Blart: Mall Cop is a perfect comfort movie, it's funny, it stars Kevin James, it's silly and has lots of slapstick jokes. As an actual film is it well made? No not at all, but as a comedy it's good and I really did enjoy it, the villain was a good character and so was Blart's girlfriend Amy (played by Jayma Mays).\n\n5/10: There's lots of fun to be had here, just don't expect a cinematic triumph"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "cricketbat",
        "review_rating": "5",
        "review_title": "This ain't no Die Hard.",
        "review_detailed_main": "Not that funny, but strangely endearing. Kevin James is likeable, even if the premise is ridiculous, the plot is predictable and the supporting cast could have been played by cardboard cut-outs. This ain't no Die Hard."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Mr_Sensitive",
        "review_rating": "5",
        "review_title": "Nothing New",
        "review_detailed_main": "Should have I blame myself for having a pretty good hope that this is going to be a \"pretty\" funny when I should have exactly know what to get from watching Billy Madison production film or was it the fact that it earn over 100 millions in US alone on its opening and making it the first film in history to do so in January –these thing still disturb me to this day.\n\nThere is nothing much to say about the story as it is pretty much a comedic (if it still is) version of Die-hard – About a mild mannered over serious Security trying to stop the criminal from taking over his mall and save the girl of his dream. Yeah that is pretty much about it with some really overly use and predictable mild joke throw into the story from time to time, though I highly doubt anyone beyond 13 might actually these kind of comical joke.\n\nOne of the main reasons why anyone might watch was because of Kevin James; he is everything to this movie that I pretty much certain that if it wasn't for him this would have gone straight to DVD rack. So consider what he have to do is single handedly save the whole is pretty much impressive.\n\nAnyway the movie wasn't all that too bad, pretty OK for its genre of movie but I highly doubt I would ever watch it again even in the most boring of the day but still give it credit for it managed to do what they have meaning to achieve (even though I never really have that laugh out loud moment) but there are couple of scene that can make one smile with it.\n\nReason to Watch: Kids below 13 who still enjoy Airbud will absolutely loves this movie; for others - if you didn't watch it-> you won't miss a thing.\n\nReason Not to: Not Funny and Not Much Reason to Watch.\n\nRating: 5/10 (Grade: D)"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "thesar-2",
        "review_rating": "8",
        "review_title": "Disney Does Die-hard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "MovieGuy01",
        "review_rating": "5",
        "review_title": "Good film comedy!....",
        "review_detailed_main": "I have just seen Paul Blart: Mall Cop this evening, and i thought that it was a good film comedy. It is about a man called Paul Blart who is a family man and a single parent, Paul lives with his daughter, Maya, in New Jersey. He has a job as a security guard in a New Jersey mall. he has tried to apply to become a cop, for years but he always fails the exam because he is overweight. He gets attracted to a mall employee called Amy, His efforts to try to get a date with Amy are hilarious as he must first know how to work mobile phones and text messaging. One day, a gang of criminals put the shopping mall under siege and take hostages. Paul Blart becomes trapped inside, and because of his sense of duty, he refuses to leave. And he attempts to stop the criminals on his own, with very funny results. I found this to be a good comedy film which i would recommend to people of all ages as it is rated PG so it is suitable for everyone to watch."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Systreco",
        "review_rating": "3",
        "review_title": "Bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "hrogers5",
        "review_rating": "3",
        "review_title": "I could crash my car in the plot holes.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "lagarda-90639",
        "review_rating": "1",
        "review_title": "Disappointingly Unfunny and Cringe-Worth",
        "review_detailed_main": "My perspective Is I was really looking forward to watching \"Paul Blart: Mall Cop,\" thinking it would be a light-hearted comedy. Unfortunately, it turned out to be a painful experience. The humor felt stale and forced, relying too heavily on slapstick gags that just missed the mark. Kevin James' character, while intended to be relatable, came off as more embarrassing than endearing, leaving me uncomfortable rather than entertained.\n\nThe plot was predictable, and the dialogue was often cringeworthy, making me question if anyone involved had ever been in a real comedic situation. Instead of feeling joy for Blart's underdog journey, I found myself rolling my eyes at the repetitive antics and lack of character development.\n\nOverall, \"Paul Blart: Mall Cop\" felt like a missed opportunity, with little substance and far too many cheap laughs. I wouldn't recommend it unless you're in the mood for an hour and a half of frustration. Save yourself the time and watch something else!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Snowgo",
        "review_rating": "3",
        "review_title": "Script Error/Needs Rewrite",
        "review_detailed_main": "I really liked this movie, and watched it up until the most berserk and impossible script twist I have ever seen: Blart's childhood schoolmate and head of the local S.W.A.T. team turns out to be the \"mastermind\" of an elaborate mall heist involving hostages. Why would someone devote their life to law enforcement and then decide to stage a heist like this.., in their own home-town? I had to turn the movie off when I saw this happen. Someone took a perfectly-good movie and tried to get clever with it, and in the process, ruined it by overstepping the normal person's ability to suspend disbelief. One scene I loved: Blart, his wife and daughter were eating breakfast and his wife was getting on his case for eating too much, and Blart replies, \"I'm just going to say what the kids say. Whatever. Whatever!\" His daughter comments, \"Daddy, kids don't talk like that.\" On the ropes, Blart counters, \"Yes they do dear.., the older kids...I've heard them at the mall\"."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "huubvisserajax",
        "review_rating": "9",
        "review_title": "Great comedy",
        "review_detailed_main": "The movie does exactly what is should do; it makes you laugh. The plot in the movie is not amazing, but is good enough. If we are talking about the jokes, this movie deserves a raise. They were original, and James performed them sublimely. The Adam Sandler and Kevin James duo strikes again in this funny masterpiece. To sum it up, great movie that will certainly make you laugh. Rating : 9/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Thanos_Alfie",
        "review_rating": "5",
        "review_title": "Average...",
        "review_detailed_main": "\"Paul Blart: Mall Cop\" is a Comedy - Action movie in which we watch a security guard trying to protect himself and the people of a shopping mall when a gang take over it. He has to try really hard to save the day without making any mistake.\n\nFirst of all, I have to admit that I did not have high expectations from this movie so, I was not disappointed by it. I am not saying that it was a bad movie but it was a bit boring since in many moments I knew what I was about to watch or what will happen next. I believe that the predictability of this movie had as a result to make it boring and dull. The interpretation of Kevin James who played as Paul Blart was nice and he did his best. To sum up, I have to say that \"Paul Blart: Mall Cop\" is an average comedy movie and I do not recommend anyone to watch it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "policy134",
        "review_rating": "5",
        "review_title": "Low on laughs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "MLDinTN",
        "review_rating": "5",
        "review_title": "mostly a waste of time",
        "review_detailed_main": "This movie was not that good; not really anything original about it. A lot of the jokes concern Kevin James' weight. James plays Paul Blart, a mall cop that takes his job a little too seriously and has a crush on fellow mall employee, Amy. The crush on Amy was weird too me just because he's 15 years older and I don't think a young girl like Amy would really be interested in an overweight guy with a kid. Amy should have been played by someone older.\n\nOne night, some crooks take over the mall and it's up to Paul to save the day. They have Amy and his daughter and he does all these silly things to knock the young, in shape, crooks out.\n\nFINAL VERDICT: Not worth your time."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "willcundallreview",
        "review_rating": "3",
        "review_title": "A pretty awful attempt",
        "review_detailed_main": "Paul Blart is a mall cop with aspirations to join the police force but he always seems to fail with every test when he tries to get into the New Jersey State Police. The movie is all about how he deals with a certain incident at the mall one night and how he has to try and prove himself, you know what it's like, typical plot with typical characters and the people behind this don't even try to make this new or fresh. You see this movie is not well in my opinion an awful one, just a kind of very poor attempt at making a funny movie and what could have been a bit of guilty pleasure kind of silly fun, turns into something silly but dumb. From the team at Happy Madison Productions (who else do you expect) comes this movie and it definitely has the hallmarks of something Adam Sandler is involved in, just too reliant on Blart being inept and then the story is too.\n\nKevin James plays Blart and he is not very good in the role, I'm not saying he is again awful but he doesn't take the opportunity even with the slightest of possibly funny bits. The entire cast are pretty badly put together, its not that anyone acts really poorly other than James but the characters are so badly made that they are typical of a film like this but then really annoying as well. Kevin James and Nick Bakay write the film and don't do a good job at all, you know it feels at times like a decent joke is coming but then it is ruined by either James's acting or the direction of Steve Carr who seems to make jokes drag out more than these kind of jokes should.\n\nThe movie has very very few laughs but can raise the slightest of laughs, more of a laugh where you might feel guilty afterwards or just wonder why you found it the slightest bit funny. Most of the funny parts if there are truly any come from the physical side of the movie which is both it's best and worst attribute, Kevin James is no doubt game for the physical things going on humour wise but can't actually make it funny. Another thing the movie does is it takes itself a bit too seriously, I mean sure this obviously is trying to be a comedy but can weirdly try really hard to be serious and create emotion and thrills, that sort of stuff is not needed in a movie like this, especially one this dire.\n\nSo yes Paul Blart: Mall Cop, a film that gets a little but too much hate from some around but it is still a pretty bad film and one that should not have grossed into the hundreds of millions at the box office. I really can't see why we have to put up with films like this in the movie market these days, they are just too silly but not in a funny way and they serve as seemingly only money makers and the kind of film you see once and never again will you want to view it. I do actually think this kind of movie could have worked though but only with James not in it, James not writing it, James and Adam Sandler not producing it and basically Happy Madison having nothing to do with this, then maybe this could been a satisfactory comedy watch."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "teebear817",
        "review_rating": "3",
        "review_title": "Tired, predictable drivel",
        "review_detailed_main": "Just watched it on TV. I am a huge Kevin James fan. I think His acting on King of Queens was brilliant. But the man just cannot find good movies to do. This movie was so unfunny, and predictable it was painful to watch. Sadly, James is a modern day Don Knotts with a fat belly. What I mean is, Knotts played the same character all his life. Everything he ever did was Barney Fife. Every movie, he was a bumbling, likable dunce who always got the pretty girl in the end. Same with James. James is the same thing. Everything is Doug Heffernan. Adding a mustache doesn't change anything. This movie was awful. Virtually every scene was predictable, and of course, a happy ending where he gets the girl that he could never get in real life. Yawn. His movies make money but they aren't very good."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ryans-84390",
        "review_rating": "10",
        "review_title": "Perfect movie 10/10",
        "review_detailed_main": "This is the greatest movie of ALL TIME My eyes are getting weary My back is getting tight I'm sitting here in traffic on the Queensborough bridge tonight But, I don't care 'cause all I want to do... is cash my check and drive right home to you 'cause Baby, all my life I will be driving home to you"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "trevrex",
        "review_rating": "5",
        "review_title": "Quite possibly the single greatest film ever made.",
        "review_detailed_main": "Is there a film that so expertly captures cinema?\n\nPaul Blart, the most amazing character to ever fight hostile baddies taking over a giant building around Christmas time (forget McClane!), will be a stunning hero you never forget.\n\nLook at the way the criminals use a bicycle at one point. Did you catch it? Clearly an amazing reference to Bicycle Thieves (1949)\n\nOr the fact that the lead SWAT office seems inspired by Michael Mann's HEAT? Another expert reference clearly woven into the screenplay.\n\nOr the Hello Kitty band-aid? Yet another reference, this time about a Japanese character being wrapped around a bloody finger, clearly about the J-Horror industry.\n\nNotice the way Blart moves from store to store, gathering and using supplies from each location. Clearly Director Steve Carr had a contemporary vision and message based on popular consumerism and their effects on people.\n\nFinally, let us look at the way Blart is connected to his Segway.\n\nEven Charles Kane, in all his glory, all his misery, searching for joy, wasn't as connected to his Rosebud."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "An entertaining comedy with uplifting and heartwarming elements",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ferguson-6",
        "review_rating": "5",
        "review_title": "Segway Security",
        "review_detailed_main": "Greetings again from the darkness. What I will give this one credit for is being a comedy that is not profanity riddled or consumed with bodily function humor (except for the tummy rumblings in the air vent). Mostly though it suffers the same plight as most comedies ... it's just not very funny.\n\nNow there are some funny moments and it is really a pleasure to see a very NICE character in the lead, but just not enough laughs to keep the audiences coming back. Kevin James stars (and helped write) here as Paul Blart, who ended up as a mall cap because he couldn't control his blood sugar levels, and passed out during the state trooper camp. The bit here is that he takes his mall job very seriously and to no one's surprise, is a loser in love.\n\nI found his initial physical attraction to kiosk salesperson Jayman Mays (Epic Movie) a bit ironic ... since there are so many jokes about James' weight. I can only assume that Mays' performance is so over the top bad because that's what director Steve Carr (Daddy Day Care) takes has humor. Better support work was delivered by Keir O'Donnell (very funny in Wedding Crashers), Bobby Cannavale and the very classy Shirley Knight as James' mom.\n\nKevin James is talented and he likes to compare himself to Jackie Gleason, Chris Farley and John Belushi - other comedy \"heavy weights\". After Mall Cop, Hitch, and Chuck and Larry, he is still searching for just the right movie vehicle to compliment his TV success on King of Queens."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "djfrost-46786",
        "review_rating": "5",
        "review_title": "The carb movie",
        "review_detailed_main": "The carb movie. All humor deals with carbs/sugar. It was huge back in the day when this movie came out."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "view_and_review",
        "review_rating": "5",
        "review_title": "Ho Hum",
        "review_detailed_main": "You'd think that a role like this was perfect for Kevin James. A lovable loser who's security guard at the mall. His wife left him and he's yet to get back into the dating scene.\n\nI like Kevin James in other things, but this movie just wasn't funny or all that entertaining. This movie hinged on Kevin James' character and he couldn't make it work. There were a couple of chuckle moments but it was mostly uncomfortably unhumorous.\n\nI think James did OK with what he was given to work with. This was simply a case of getting less than I expected. It happens from time to time and it's always annoying."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "scoutcraftpiratess",
        "review_rating": "4",
        "review_title": "Psychotic thief threatening to kill hostages--this is supposed to be funny?",
        "review_detailed_main": "This is hard for me. \"Mall Cop\" is one of those movies I wanted so much to like! I find Kevin James hilarious in just about everything he does, and frankly, this looked like a pretty decent setup for a \"dumb comedy\" (I love dumb comedies, so that's not an insult in the least.) However, though this certainly had its funny moments, as a whole it really did not fit together as I found myself wondering if I were watching a Home Alone-reminiscent comedy about an under-appreciated maul guard protecting his mall in humorous ways or something serious. Not a good thing to be wondering.\n\nIt began well. It wanted to be good. However, there was a little too much exposition before the mall was actually taken over by baddies. All right, now the rest is funny stuff. But it seemed that most of the funny stuff was what was in the trailer, leaving us with awkward hit-and-miss humor and clumsy action.\n\nAnd then they started threatening people. And then Paul Blart's daughter got involved. And I started thinking \"This is pretty scary for a PG comedy\". Seriously, folks, these people were hostages. There was a little girl. Discussing shooting them dead isn't very funny.\n\nIt was well-intentioned, this movie was. Don't get me wrong. But the ingredients were, frankly, a mess.\n\nI'll stick with \"King of Queens\" reruns. It's funny and they don't threaten to kill people on it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "benjaminweber",
        "review_rating": "10",
        "review_title": "Paul Blart: Mall Cop was a blast!",
        "review_detailed_main": "Paul Blart: Mall Cop is a wonderful and funny film. Paul Blart is a very relatable protagonist, who loves his family and strives to achieve his dreams, despite being constantly let down by his hypoglycaemia, a moving metaphor for the hurdles we all face in life that can seem insurmountable. The plot itself is fairly solid, with constants twists and beautiful comic timing. We see a squad of villains who are both professional and quirky, which makes for a perfect pairing with the professional and quirky Paul Blart, as well as helping to establish a visual feel for the world of Paul Blart: Mall Cop. Add to this a great performance from the cast and you have a nearly perfect movie, and while there may be mistakes, the pacing and soundtrack will immerse you to the point where you barely notice. 10/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "studioAT",
        "review_rating": "3",
        "review_title": "A mildly funny comedy starring an actually funny man",
        "review_detailed_main": "Take a likable comic actor hot off the back of a long running TV sitcom and dump him in a film that isn't half as funny as it likes to think it is. Ladies and gentlemen- 'Paul Bart'.\n\nThe crying shame here is that Kevin James, much like Ray Romano before him, is a likable, funny guy, who deserves to make the leap to the big screen. It's just a case of choosing the right films to take that leap in. 'Ice Age' aside, Romano hasn't made it, Kevin James in contrast has, but not in any films that earn him the credit he deserves.\n\nThere's some decent slapstick here, some nice verbal bits, but it all feels like a sketch show about a bad mall cop rather than a film.\n\nAs I said, it's a shame, I like Kevin James. I just think I'll stick to seeing him in 'King of Queens' reruns instead."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "lastliberal",
        "review_rating": "5",
        "review_title": "I wish I had a bat. I would bust you open, see how much candy fell out.",
        "review_detailed_main": "Kevin James? He's that guy that is married to Leah Remini on TV. His primary feature for me is a source of consternation as to how he got someone as hot as that, even on TV. Outside of that, there is not much I have seen him in.\n\nI'm not familiar with Jayma Mays, but she is cute, and I may check her out in that new show \"Glee.\" She has a '65 Mustang convertible, so she is certainly cool.\n\nThat's it for anyone I could remotely remember from the movie.\n\nSo, the key question is, \"Was it Funny?\" Basically, NO. About as funny as Wild Hogs, and that was a big zero. The one chuckle I had was when he slid behind the column, but that was prominent in the trailers."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "girlggc",
        "review_rating": "5",
        "review_title": "Movie was alright",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "WankerReviews",
        "review_rating": "4",
        "review_title": "Not bad",
        "review_detailed_main": "A mall cop who failed at trying to join the police academy, and gets bullied by co workers, tries to stop bad guys from holding a mall hostage.\n\nI went into this without watching the trailer. I didn't expect to find it funny, even thought I like Kevin James. I did laugh a handful of times. My favorite part was him trying to stop an old man at the mall. It did however make me sad when he kept getting picked on for his weight from various people.\n\nBeginning was funny and is basically him trying to get close to a woman who also works at the mall. But after a while I started to wonder where this was all going. What is the main plot? Towards the middle, it did drag, and then the final reveal comes, and I'm not into it. But slowly it does start to pick up again, and has a home alone vibe to it, but with an adult man battling other adult men. And it did get funny again in some parts, and was pretty violent for a movie like this.\n\nI did think it was endearing see the lead put himself through hell to try and rescue the woman he was interested in. My only gripe with this was that why couldn't he fall for someone who had the same body type as him? All the overweight women he does interact with, is in a negative way, besides his daughter. It would have been perfectly fine to have two overweight people fall in love.\n\nOne other thing, if the lead had a fainting condition, why didn't he carry sugar on him at all times?"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "As average as you expect – only a spirited comic turn from James saves it from being awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "moonspinner55",
        "review_rating": "4",
        "review_title": "Kevin James channeling John Candy in a family-friendly \"Die Hard\"...",
        "review_detailed_main": "This is what passes for family entertainment these days: a shopping mall security guard has to take charge when the building comes under-siege of post-teenage masterminds (and apparent gymnasts) out to crack the banking codes in the individual stores and collect the money out of the country. Star Kevin James, who also co-produced the film and co-wrote the screenplay, is a handsome, huggable cut-up who knows how to play to the camera; he gets easy laughs with a mean John Candy impersonation, and perhaps slips into Chevy Chase-mode for the 'poignant' moments, but he has no depth. When James is stumbling around drunk or bumping into things, our sympathies don't go out to him--it's just mean-spirited slapstick. The story is comedic \"Die Hard\" (with a little \"Bad Santa\" envy) and barely engages the attention. Jayma Mays is the wan salesgirl/love-interest with no personality or background; she's flung together with Paul Blart without us ever seeing how she really feels about him. Blart makes a cute video where he shows off his nerdy-cool moves, but it doesn't win the girl over (does she even see it?). Apparently, because she has big, round eyes and talks like a little girl, Mays is meant to be the perfect woman for our hero. It's an underachiever's idea for an action-comedy-romance, with moronic segues and supporting characters, and a child who keeps yelling \"Daddy!\" but is never allowed to lend a hand. *1/2 from ****"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Scar38",
        "review_rating": "9",
        "review_title": "Great fun film",
        "review_detailed_main": "I was never a fan of Kevin James to be honest as I didn't find him funny but this is a really good film and actually very funny.\n\nThe cast are pretty good, I thought Kier O'Donnell was excellent as was Bobby Cannavale and Jayma Mays is beautiful and very talented.\n\nAll in all its just a bit of fun for an hour and a half."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "baby-girl-10409",
        "review_rating": "1",
        "review_title": "Awful Movie of Epic proportions",
        "review_detailed_main": "This is the most idiotic movie that I have ever seen. I definitely expected better from a Happy Madison Production. Paul Blart is an overweight mall cop that rides around on a scooter. The comedy is lack luster that I find better enjoyment passing my time banging my head on the wall. This was a complete waste of my time. The writers of this movie should seriously reconsider writing. Or better yet, take the trailer and sell it for a dollar and everyone wins because that was the only good thing about this movie. No movie should be this painful to watch. There was not nearly as much comedy as what was portrayed in the trailer. Honestly the trailer was the highlights of the movie and the only parts that were semi-decent and should never be repeated. I lost brain cells watching this movie because it was so dull and boring."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "PhantomAgony",
        "review_rating": "",
        "review_title": "Please tell me this was a Parody!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "marimbadaddy",
        "review_rating": "5",
        "review_title": "Die Hard! Suburbia",
        "review_detailed_main": "This was definitely a so-so movie. A few funny moments born of the physical comedy; however, not much on dialog. Kevin James is usually pretty funny, but in this movie he seemed restrained. I'm not sure if it was because the script lacked substance, or the director didn't let James let loose or what. Part of the problem may have been that the director and writer beat the audience over the head with the concept that James's Character, Paul Blart, is basically a total looser. We get it. We got it in the first ten minutes. We didn't need an additional 20 minutes of being shown that he was a looser.... get on with the plot!\n\nAnd predictable, oh my gosh, could they have followed \"the formula\" any closer? Looser, faces challenge, overcomes personal problems and idiosyncrasies in a ridiculously short period of time, he defeats all enemies, the end. And, they unfortunately also showed many of the best physical comedic moments in the trailers. The film took itself way too seriously, they would have been better off to more closely follow a Die Hard plot, and really spoofed it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "RECB3",
        "review_rating": "1",
        "review_title": "Bad First Instalment Film",
        "review_detailed_main": "I sort of understand what the crew were thinking and trying to do when they were creating this film but it did not exactly fully work. This film could have been better and stronger if the crew had added some extra effort and strength. The storyline of this film was too simple and straightforward and did not really have any real direction. The cast selection was fine enough. They did not exactly fully commit nor connect to the storyline nor to their respective characters. There was not any sign of real chemistry displayed throughout this entire first instalment film between the cast members. The crew missed an opportunity with this film."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Boba_Fett1138",
        "review_rating": "5",
        "review_title": "Only mildly entertaining at best.",
        "review_detailed_main": "Well this is hardly the best genre movie you'll ever see but this movie is also yet better to take than some other similar type of movies from within the genre.\n\nThe movie can be called mildly entertaining, fore it's not really a movie that will make you laugh out loud. The movie is just too standard, predictable and just too plain lame for that. It uses lots of recycled and predictable comical moments, as well as some fat and racist jokes, like you can expect from such a movie like this one. Yet the movie is not as annoying as it probably sounds. It will entertaining you throughout, though you'll also constantly have the feeling that you could spend your time some better way probably.\n\nThe movie is like a simplistic comical version of \"Die Hard\" in which an overweight loser mall cop gets right in the middle of a dangerous hostage situation which only he as an insider can resolve, when a couple of crooks take over the mall for all of its money that is in the safes and registers.\n\nIt basically has all of the ingredients you can expect from such a movie like this one, including a love interest, a bully and a main character that is a big loser. No, it's not very surprising or original all but it's quite entertaining enough to still consider this a somewhat watchable movie.\n\n5/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "alexpeychev",
        "review_rating": "5",
        "review_title": "\"Paul Blart: Mall Cop\" is a comedy film released in 2009, directed by Steve Carr and starring Kevin James in the titular role. The movie follows the story of Paul Blart, a mil",
        "review_detailed_main": "\"Paul Blart: Mall Cop\" is a comedy film released in 2009, directed by Steve Carr and starring Kevin James in the titular role. The movie follows the story of Paul Blart, a mild-mannered and dedicated security guard who finds himself thrust into action when his mall is taken over by a gang of criminals.\n\nPaul Blart (played by Kevin James) is a hardworking but socially awkward single father who takes his job as a security guard at a suburban shopping mall very seriously. Despite his dedication, he is often ridiculed by his peers and longs for respect and recognition.\n\nWhen a group of highly organized criminals led by Veck Sims (played by Keir O'Donnell) takes control of the mall on Black Friday, Paul finds himself in a position to prove his worth. Armed with his Segway scooter and unwavering determination, Paul takes on the role of an unlikely hero as he attempts to save the day and rescue the hostages, including his teenage crush, Amy (played by Jayma Mays).\n\nThe film combines slapstick humor with heartfelt moments as Paul Blart uses his unconventional tactics and resourcefulness to outsmart the criminals and protect the people he cares about. Kevin James delivers a charming and endearing performance as the lovable underdog, earning sympathy and laughter from audiences.\n\n\"Paul Blart: Mall Cop\" is a feel-good comedy that offers plenty of laughs and an uplifting message about courage, perseverance, and the importance of never giving up. While it may not break new ground in terms of plot or character development, its light-hearted humor and entertaining action sequences make it an enjoyable watch for audiences of all ages."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "paulcanning-26087",
        "review_rating": "10",
        "review_title": "Criminally Underrated",
        "review_detailed_main": "This is sensational from start to finish. Get it watched."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "brianlion",
        "review_rating": "5",
        "review_title": "Usually Like Kevin James But ...(And It's a Big But-Pun Intended)",
        "review_detailed_main": "I am a big Kevin James fan from watching him on \"The King of Queens\", but, this movie was really uneven. I'll give Kevin his props. He was pretty agile, and on the motorized cart he was good on that- whatever it is called. But the story line was slow at times, and sometimes just downright silly-stupid. I enjoyed seeing all the old crew from the \"King of Queens\" episodes. In fact, it would have been nice to see Jerry Stiller make a small cameo. That would have helped. I just got the feeling from watching some of the scenes, they weren't worked out as well as they should have been. And the script itself needed some over haul, especially the ending. I did laugh at a few pranks, but I didn't connect with the girl who played his daughter, for starters. That was bad casting there. Some scenes appeared rushed, or just didn't fit the flow of the movie. It just seemed the director and producer said to Kevin, \"well, it's not great, but , what the heck, it's done, I laughed, let's go to the next shot.\" We kind of felt like that when we left the theater. \"it's not that great, but what the heck. I laughed at a few things. Let's move on.\" Chances are, if you haven't seen this movie, you'll say the same thing."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jaredlemin",
        "review_rating": "4",
        "review_title": "It Delivers what it promises",
        "review_detailed_main": "It is silly, the underdog finally wins and gets the girl, and there will be a few laughs mixed in throughout. The reason for the low rating is that you don't get anything extra with this one. The story is weak, the action is weak, the jokes are weak, but somehow it all comes together into something respectable (and apparently deserving of a sequel). Kevin James is good at this kind of movie and he plays the character well, but you almost don't need the movie to understand the character with him and I think that is why the movie ultimately falls short. I hope the sequel is better, because there is a lot of opportunity with this one. I would say the battle of the Rainforest Cafe is the best part of this one and even that one fell short of what could have been."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "JoeKarlosi",
        "review_rating": "5",
        "review_title": "Paul Blart: Mall Cop (2009) **",
        "review_detailed_main": "Kevin James (from \"The King of Queens\" TV show, which I do like) plays the fat Paul Blart, a man in his forties who lives at home with mom and has a daughter from a foreign woman he used to know who only put up with him until she got her green card and then split on them. Unable to make the grade as a policeman, Blart has resorted to spending the past ten years as a security guard (or \"officer\" as he likes to call it) in the local mall. He falls in love with a young saleswoman where he works who sells hair extensions, but he's so clearly out of her league that all he does is make a fool of himself in trying to impress her. But Blart may get a chance to make a hero out of himself when \"his\" mall becomes overtaken by a group of amateur thieves one evening. About what I expected, which was pretty much nothing. I went to see it because my wife and I wanted to take our 13-year-old niece to the movies and after all, I am a fan of \"The King of Queens\" show. I didn't think this was too funny, and the character that Kevin James plays is his typical one-note type. But in this case, Paul Blart is so obnoxious and such an annoying \"wannabe cop\" to the mall shoppers that it's also not that easy to generate sympathy for him as we're expected to. I also can't believe that James has allowed himself to become way fatter than he's ever been before at this point of his life. I guess the short-lived period late on \"King of Queens\" where he had lost a lot of weight was just some kind of a temporary kick for him. ** out of ****"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "hodgesdaniellel",
        "review_rating": "10",
        "review_title": "Truly Uniting Me with Friends and Making Christmas Special",
        "review_detailed_main": "Paul Blart's endearing character and heroic actions brought my friends and I closer together this Christmas. I became a \"Die Hard\" fan moments into the film, even looking up Paul Blart merchandise to purchase later since I am a newly enthusiastic and proud Paul Blart fan. I relate to Blart's hypoglycemia and enjoy the use of humor to lightheartedly cope with the condition. Many people will relate to the themes in the film such as lonliness, doubt, insecurities, and overcoming adversity. This film will bring joy to all people just like it has brought joy to me. It has had a positive impact in my life. Some critics may be negative by calling the film kitschy and insignificant, but it is really a projection of their personal failures and lack of redemption arc in their own lives. I hope you all enjoy this film and it changes your lives as well."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jakburton76",
        "review_rating": "5",
        "review_title": "A Simple Review",
        "review_detailed_main": "I've just finished watching this movie and as always I refuse to give too much away on the plot and characters so here is my simple review.\n\nThe good points - Love him or hate Kevin James seems to have a John Candy kind of feel about him of whom I was a huge fan, loved the premise you can't go wrong with a shopping mall.\n\nThe bad points - Too thin, this movie was just too thin the characters just weren't engaging enough and the few laughs you get is of Kevin making a fool of himself, it's been done so many times before but better it's all just a bit clichéd.\n\nSome people might love this movie but I feel most will be like me and come away from watching a comedy feeling that you haven't laughed enough.\n\nDistinctly average.\n\nTry and enjoy if you do watch it though."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Fips2701",
        "review_rating": "5",
        "review_title": "If they say it is funny,it has to be funny.",
        "review_detailed_main": "This is another one of those \"comedy light\" movies,where basically you can see all the funny moments in the trailer.Just like \"Nacho libre\" they put a more or less funny actor in a movie with what looks like a more or less funny premise.Then the average person sees the trailer,hears about the story,recognizes the actor and immediately thinks:\"Wow,this must be really funny\". \"XXX as a wrestler in Mexico,can you believe this?\" Or \"XXX as a security guard in a ....Mall! Ha,ha,ha,ha\". That is what the producers count on and that is what the average moviegoer in the US will go for! I totally agree with Jlayman920 in this."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "michaelRokeefe",
        "review_rating": "5",
        "review_title": "Seriously dedicated Mall Cop.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Vincent_B",
        "review_rating": "5",
        "review_title": "Family Show: A movie that any child can follow.",
        "review_detailed_main": "Paul Blart played by Kevin James, is the likable underdog in a movie that any child can follow. This is -after all- a PG rated comedy and exactly what I would expect from a family oriented movie writer. The story was your basic knight on electric Segway saves a damsel in distress.\n\nThe one critical point this movie missed on was the \"Black Friday\" build up. The plot could of had much more slap-stick gags added if they had expanded on the \"Black Friday\" being the maddest shopping day of the year.\n\nUnfortunately nothing happens in the movie on \"Black Friday\" and we jump from Thanksgiving Day directly to the mall closing up on Friday evening. Then we slide into the typical \"Die Hard\" spoof that will make the young children laugh.\n\nKeir O'Donnell and his crew was the poorest actors as they attempt to ninja their way through the last part of this movie. The director should have told them this wasn't a serious remake of \"Crouching Tiger Hidden Dragon\". Having the new guy as the criminal isn't that much of a surprise or plot twist.\n\nA few plot holes weren't filled in very well but this is a children's comedy and not to be taken as a serious real life drama. If you rent this expecting to see raunchy humor, action, or a deep meaningful plot with twists and turns you will be disappointed. If you plan to rent a movie for little kids to enjoy with their grand parents, then you won't be disappointed."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Falko_h1",
        "review_rating": "5",
        "review_title": "A lighthearted comedy with a few laughs",
        "review_detailed_main": "\"Paul Blart: Mall Cop\" centers around the titular character, played by Kevin James, a well-meaning but clumsy mall security guard. The film follows Paul as he navigates his mundane job, dreaming of becoming a real police officer, until he finds himself in a situation where he must rise to the occasion and save the day.\n\nKevin James brings his signature physical comedy to the role, resulting in a few genuinely funny moments. The film's humor is largely slapstick, appealing to those who enjoy light, family-friendly comedy. However, the plot is predictable, and the jokes can sometimes fall flat, making the movie feel formulaic at times.\n\nDespite its shortcomings, \"Paul Blart: Mall Cop\" has a certain charm, thanks to James' likable performance and the film's heartwarming moments. While it may not be a cinematic masterpiece, it provides an easy, entertaining watch for those looking for a simple, feel-good comedy."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "SiLenTxfAiRy",
        "review_rating": "5",
        "review_title": "love kevin james!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "HorrorDisasterGuy-90617",
        "review_rating": "5",
        "review_title": "It's one of those movies that has some moments",
        "review_detailed_main": "This is a alright movie that I watched that have some moments. The movie focus on Paul who works as a mall cop while having affection over Amy. While it's your usual stuff that you see in any movies, it does do something different with the whole mall cop aspect. Paul Blart is a pretty developed character with his loneness on not finding a lover while grows attract to the wig shop worker. He's also does anything to protect the ones he care about and won't stop at all. The comedy itself is one of those that has a couple of funny moments in it, but some of it feel the same or dragged on too long. Half way in the movie he goes against robbers who trying to rob the mall while holding people hostage. That parts contains decent action scenes in it and the ways he take down the bad guys. Although the reveal of two of the characters aren't that impressive. The acting itself is fine for the most part and Kevin James does a good job on making the character likable to root for.\n\nMall Cop is one of those movies on if it your type of comedy or not."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kidmoe",
        "review_rating": "10",
        "review_title": "Blart Friday > The Purge",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "fignewtonanon",
        "review_rating": "10",
        "review_title": "Kevin James",
        "review_detailed_main": "Mall cop has Kevin smith in it. I liked how keven Bacon acted in Pixels so I watched mall cop with my cousin. He laughed at how funny mall cop is when he trips and falls on his buttocks. I didn't like this movie very much, but at least it made my cousin laugh so that's why I'm giving it 10 stars."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "tofuwewu",
        "review_rating": "10",
        "review_title": "best movie ever made",
        "review_detailed_main": "Better than the god father, what more do i have to say. Its literally paul blart mall cop. A masterpiece that will bring tears to your eyes, a smile to your face, and poignant socioeconomic political commentary to your mind. Must watch NOW !!!!!! 😡😡"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Freshponds5",
        "review_rating": "10",
        "review_title": "Amazing!!!!!!!!",
        "review_detailed_main": "I have never laughed so hard in a movie in my whole life. The plot seems dumb...an overweight wannabe mall cop brings down bad guys, but this movie is amazing! I was laughing the entire movie. Mall Cop has a perfect mix of action, comedy, and some romance. There are nonstop laughs, and action scenes that put you on the edge of your seat. Believe it or not, there are several twists that you would never expect in a movie like this. The background music is awesome, it always fit perfectly with the scene. The acting was superb, the actors took on their characters and there was some great chemistry between Jayma Mays and Kevin James. This has to be Kevin James funniest movie yet. If you feel like laughing till your cheeks hurt, Mall Cop is the movie to see."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Pratik112",
        "review_rating": "10",
        "review_title": "Stitches of Laughter.",
        "review_detailed_main": "I was in a total shock when viewing the movie as I hadn't heard anything about it at all and the shock led to what I can only describe as a good one.\n\nPaul Blart, a diabetic, whose aim was to become a state trooper in New Jersey but fails to do so and instead ends up becoming a security guard in a mall, lives with his daughter and mother, who encourage him to go online and meet women \u0096 to find a woman who is able to love him for who is. However, he meets a woman who owns a kiosk in the mall but soon his life takes a twist and has to jump into action.\n\nStarring Kevin, Keir O' Donnell, Jayma Mays, Raini Rodriguez, Shirley Knight, Stephen Rannazzisi and Peter Gerety, this is directed by Steve Carr and written by Kevin James and Nick Backay.\n\nThis action / comedy genre movie has all the ingredients that can perhaps be said that, if this was only action then one can think of Bruce Willis. However, this is an action comedy genre and will have one in stitches of laughter all the way through. But one particular point that this movie has highlighted is that of being a diabetic has to be very careful when going into action \u0096 always keep something that has sugar in it with you in the event if the sugar levels in the body go down.\n\nNever the less, this is a good action / comedy genre movie and it will have you in stitches of laughter all the way through. So if you are wanting to watch a good comedy then this is the one to watch."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "writeeveryday-1",
        "review_rating": "10",
        "review_title": "Thank you to writers of Mall Cop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "amber_suda",
        "review_rating": "10",
        "review_title": "Very well done and enjoyable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "zachhasemail111",
        "review_rating": "9",
        "review_title": "This was a very funny movie!",
        "review_detailed_main": "Before I comment I's like to tell all who read this that I am a very young person and prefer more action/adventure than anything else. I went to this movie with a family member of mine and loved it. The only part I didn't like was all the cussing.\n\nThe movie would deserve a ten out of ten, but there were a few parts that spoiled the movie. But don't take much of it seriously. It was a Hilarious clever movie with good humor and Hysterical \"Action\"!!\n\nI recommend Parental guidance for ages under 10. There is drinking and a little bit of perverse language and some things that some people wouldn't want there 4-year-old watching.\n\nLoved this movie!!!!!! Go To the NEAREST MOVIE THEATER AND WATCH IT!!!!!!!!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "callumocox",
        "review_rating": "10",
        "review_title": "Had all the hallmarks of an absolute classic",
        "review_detailed_main": "Paul Blart Mall Cop (\"PBMC\") was thoroughly enjoyable a real classic in a world full of lazy productions. PMBC had a well thought out storyline, gripping twists and turns and even a few light hearted gags. The flamethrower and I absolutely loved it and actually went round to our friends and watched it with them over some popcorn and bud lights. Would recommend 10/10."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "aaran-14882",
        "review_rating": "10",
        "review_title": "AMAZING",
        "review_detailed_main": "One of the greatest films I've ever watched. Instant classic!!!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "heynaomi",
        "review_rating": "10",
        "review_title": "Friggin' hilarious!",
        "review_detailed_main": "My fam. And I love this movie! 😂🤣 You will def. LOL! Silly and ridiculous but that's what makes it funny!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "joel212004",
        "review_rating": "10",
        "review_title": "Small time mall guard becomes the cop he dreams of being.",
        "review_detailed_main": "Hilarious, kept me laughing throughout the whole movie. One of the best comedies in a long time. Paul Blart (Kevin James) is awesome in this movie. I love him in King of Queens, so I knew I could expect the same quality out of this movie, and I was not disappointed one bit. It has a mix of comedy, determination, and love story to it. This movie shows that you cannot let anything stop you from achieving your dreams. This movie is full of surprises. Never a dull moment in the entire movie. In this movie Paul has to overcome a problem he has with sugar (hypoglycemia), which stops him from passing his tests to become a big time cop. Almost giving up hope, his daughter pushes him to make something more of himself. He is then determined to make his daughter and mother proud."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "leslymill-973-549610",
        "review_rating": "10",
        "review_title": "Jayman Mays",
        "review_detailed_main": "Actress who played Amy. Had to look her up because she has the eyes and smile of Goldie Hawn. Nope, no relation, but she does have the smile of her mother being the daughter of Susan Paulette ."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "rachelbotros",
        "review_rating": "9",
        "review_title": "Kevin James IS the Mall Cop",
        "review_detailed_main": "This is is Kevin James' best movie series. He truly shines as this character and no one else could have brought Paul Blaurt to life. If you haven't watched this why aren't you watching right now. Please do yourself this favour and watch this movie."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "loozahgnomedk",
        "review_rating": "8",
        "review_title": "A decent movie despite the awful name..",
        "review_detailed_main": "I waited a long while to see this movie until it aired on television one day. Granted it's a good movie, I wouldn't exactly pay to see it. Hoorah cable! Anyway, I noticed before that there were quite a few people who found this offensive. Why? The main character was a large man with diabetes. What madness say ye!\n\nI found this to be a good movie because he simply tried what anyone else in a movie would've tried to do, it favors no one, it's only a script. There were a few parts that yielded laughs,but nothing truly noteworthy. This seems to have a watered-down Home Alone comedy to it, so there are some creative and amusing parts. You just don't laugh the whole time. I do note that in regards to the treatment of the character, however, there is a terrifying realism to it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jerekra",
        "review_rating": "8",
        "review_title": "Good mixture of action and comedy",
        "review_detailed_main": "Paul Blart Mall Cop is not the best action slash comedy film out there, but it is good fun. Kevin James does a great job, and it has a solid story and plot as well as some good action in it.\n\nPaul Blart is a mall cop who wants to be a police officer but cannot because of physical limitations. He lives with his mother and daughter and soon falls for an attractive female co worker at the mall. On black Friday a group of criminals take over the mall and hold other mall co workers at ransom and it Blart takes it upon himself to save the day.\n\nJames I feel is good in the lead. His sense of humor fits the role well. Just dry humor that makes you chuckle. Good job. He also plays the character well and makes the character one that you sympathize with and root for towards the end.\n\nThe plot worked too. At first when I saw the trailer I thought that it would be a lame story that would be overly reliant on lame jokes. But it really is not. The villains in this film have a legitimate plan to take funds from the mall. SO the overall conflict of the film is real and I think this helps the film a lot.\n\nSurprisingly there is some really good action in this film. Its not often that you see great action in a film that is pretty much a comedy by all accounts, however this film has it.\n\nSo basically I feel James does a great job, it has a good story, good action, and its a good watch. I recommend it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Kittenstreet",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "We'll I made an account just to rate this because the reviews were pissing me off mall cop is a nice and clean comedy , usually it take me a lot to laugh during a comedy but this one scene where he's talking to a statue and having a staring competition with it (he was drunk) he says bay you blinked you blinked I laughed so hard I cried it was hilarious the way he did it , maybe some of it wasn't thought all the way through at the parts where they take over the mall. But only like one part or 2, but Kevin James is hilarious so I doesn't really matter to me but there is no reason to give this movie a terrible rating I just think people rather see a stupid comedy that has a lot of sex jokes and pretty much every line has a cuss word , but personally I like clean ones better sometimes it's nice to watch with your dad or mom without sex scenes every 5 seconds . And there's way more movies that are stupid than this and yet people choose this one cuz it's not a dirty movie and the movie the interview has a higher rating than this . MY POINT EXACTLY the interview was horrible and dirty and stupid . People are just retarded. This movie is very funny and a good clean comedy and I recommend it ."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Theodre_thebestreviewer",
        "review_rating": "10",
        "review_title": "Funny,sexy and damn right amazing",
        "review_detailed_main": "Hands down the greatest film ever! Some might deny or disagree but deep down we know this is a masterpiece. ITS PERFECT FOR EVERYTHING!! How? You might ask well let me tell you! It's perfect for a laugh,a cry,drama,action,thriller,and gooning to! Perfect for all types of people! This movie could solve all wars and cause world peace,we could even live in a utopia if people gave Kevin's James magnum opus a watch. However watching it once won't mean you know all the answers in our life,to really understand this movie you must atleast have analysed every scene,dialogue and detail to really understand! It took me 10 years to fully understand this movie and the answers aren't truly there we haven't got to the end,could you help??"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "bonczewskif",
        "review_rating": "9",
        "review_title": "Relly good and entertaining movie for nights with friends",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "danmcn61-1",
        "review_rating": "9",
        "review_title": "Very cute, dumb, feel-good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "cg-104",
        "review_rating": "10",
        "review_title": "Oscar worthy! Kevin James best actor of year!",
        "review_detailed_main": "Wow! Going into this movie I had really low expectations. I have always been a fan of Kevin James from King of Queens, I had no idea what to expect. This movie had EVERYTHING... romance, drama, plot twists, life lessons and amazing acting. Paul Blart is a nobody wannabe cop who works at a local Mall. His quest to win over the new girl was heart warming and romantic. He loves to ride his segway, and even offered to give her a ride. He *was* the knight in shining armor. The rest of the movie is focused on how he is going to save the day from the bad guys. Let me tell you, these bad guys are very high tech! Watch out. Even though Paul doesn't have a gun, he uses his wisdom and intelligence to beat the bad guys. I hope they decide to make Paul Blart action figures, because I would get 3 of them for myself. During the movie at times, I was day dreaming about how I too, wanted to be a mall cop. I believe Kevin deserves an Oscar for his acting in this movie. He does an amazing job by offering life lessons and encouraging big guys everywhere they too can get the girl of their dreams through dedication and persistence! Go Paul Blart!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "GirlRaisedintheSouth",
        "review_rating": "10",
        "review_title": "A Perfect 10 for Kevin James",
        "review_detailed_main": "This movie is exactly what I want to see when I cough up my hard-earned money to see a comedy! No vulgar language, gratuitous sex or violence (I mean REAL violence) and lots and lots of shoot-soda-out-of-your-nose laughs! I liked Kevin James in the King of Queens and fell for him in Hitch but this movie pretty much clinches it for me....I LOVE Kevin James! How can you not love this guy? He's cute, cuddly, smart, funny and doesn't take himself too seriously. But enough about the man, let's talk movie.\n\nThis movie is GREAT family-friendly entertainment. These days, you don't get much of that at the theaters, except maybe in an animated flick - and even those are sometimes iffy. This film has some of the best and most perfectly timed slap stick that I have seen in years. Paul Blart is a guy you can root for and probably see a little bit of yourself in, if you're honest. Plus, the values this film projects are those of family, honesty, integrity, hard work, love, friendship and honor. When was the last time you got all of those and popcorn too?"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "NJRocker091188",
        "review_rating": "8",
        "review_title": "The Mall Cop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "samit_d",
        "review_rating": "9",
        "review_title": "Thoroughly Enjoyable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "pzknox",
        "review_rating": "9",
        "review_title": "Great Comedic Fun",
        "review_detailed_main": "This is a movie for the whole family to enjoy. There is a lot of humor throughout almost every idea in the plot. It was great to see Jamal Mixon, the too precious kid in Nutty Professor, as a young adult. It does go a bit far in the constant loser bashing verbiage, however the viewer will want to support the main character through to the end.\n\nMost of the fun was watching Blart move around the mall on his Segway while having hilarious encounters with the shoppers. Blart's love interest was a refreshing change from the usual loser girls with no values. This movie was well acted and the action scenes were impressive at times. I could watch Blart on a weekly series and never miss an episode as long as he is on his Segway and dealing with shoppers. This movie is Die-hard with a comedic twist and it works well."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kyzmit25",
        "review_rating": "10",
        "review_title": "Mindless fun",
        "review_detailed_main": "I really love this movie. It's just fun and something I watch every holiday season. Kevin James is so lovable as Paul Blart. The guy's just trying to catch a break and get the girl. Sometimes it's nice to just keep it simple and watch something that is just meant to make you smile."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "justincoastalconstructors",
        "review_rating": "8",
        "review_title": "Funny, and filled with good 80s music",
        "review_detailed_main": "My kids love this movie, it's got some great parts, overall it's not a masterpiece of cinema but it's entertaining, funny, and has some great 80s music. Give it a shot you might just enjoy it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "zardoz-13",
        "review_rating": "8",
        "review_title": "Die Laughing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "danhundt-18597",
        "review_rating": "8",
        "review_title": "Shockingly, I loved it.",
        "review_detailed_main": "My wife and I have been mocking this movie for years, having never actually watched it. We just assumed it must be dreadful; it certainly appeared to have all the ingredients of an absolutely awful movie.\n\nBut somehow... it isn't. I'm telling you, this movie is about a billion times funnier than it has any real right to be. It certainly isn't high art, and there's nothing really resembling a unique and original storyline, and it's utterly rife with cliche.... and yet somehow it all just works. I can't quite put my finger on whether Kevin James just carried the day by being so all-in on this ridiculous character or if there was some other sort of voodoo magick at play here, but I absolutely laughed my ass off from beginning to end.\n\nI rarely write reviews on here. I had to write one for this movie, because it's middling rating is an outrage to me. Before I saw it, I assumed this film sucked. Now that I've seen it, I'm calling it one of the best slapstick comedies in recent memory. If you're looking to turn your brain off for a bit and just chuckle at a doofus being dopey for a while, this movie will serve that purpose superbly."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "1969VIETNAM",
        "review_rating": "10",
        "review_title": "Genius Kevin James Physical Comedy !",
        "review_detailed_main": "Pure Kevin James physical comedy ! Funny movie with no stupid cuss words ! Should have included some Christmas songs in the movie. Love this movie, funny with some great stunts."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "cgbossi",
        "review_rating": "8",
        "review_title": "Good movie for when you feel down.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "jnschrmns",
        "review_rating": "8",
        "review_title": "Excellent movie with subtle jokes",
        "review_detailed_main": "Feel good movie that deserves much more credits than a low rating."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "cyko79",
        "review_rating": "8",
        "review_title": "Way better than the title implies.",
        "review_detailed_main": "I didn't want to see this movie, but it was the only one my wife and I could agree on, and we were on a date. I figured some cheap laughs and then I'd soon forget the movie, like most movies I watch. I couldn't have been more wrong.\n\nThe previews and even title suggest it's about the misadventures of a fat guy as he fumbles his way toward inadvertent success sustained by fart jokes. In fact, it's about a pretty athletic guy, who just happens to be overweight because of his hypoglycemia, and then gets the courage to use his abilities to defend the mall he's sworn to protect. Sure there's some bumbling along the way and a few lucky mishaps, but not nearly what I was expecting. It actually becomes a pretty bad-ass action movie.\n\nNow for the best part. It's clean. there's some semi-vulgar humor, but nothing I'd cover my 5-year-old's eyes or ears from. No real swearing, no real violence, no one dies, and it is still entertaining. It's not a 10 out of 10. I don't expect any Oscars, but you will kick yourself for missing this movie when you had the chance. Quit reading about it and go watch it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "alanrayford",
        "review_rating": "8",
        "review_title": "Grudge Match: Paul Blart Vs. Observe & Report",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "elshikh4",
        "review_rating": "8",
        "review_title": "The multiple victories' dream !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Jackpollins",
        "review_rating": "8",
        "review_title": "Surprisingly very funny, mostly thanks to Kevin James",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "rhoda_s_girl",
        "review_rating": "8",
        "review_title": "Wayy better then critics say...",
        "review_detailed_main": "So for those critics who may diss it- is it a little predictable? Maybe, but 1. Is actually pretty funny, unique and alot better turn is given credit for. The main guy is genuinely funny, has some sweet moves with a scooter surprisingly, villain is believe able and also kindav funny and 2. Movie although a little repetitive at end has refreshingly good ending. It's funny, original, light and perfect if want a laugh."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "sharkattack1978",
        "review_rating": "8",
        "review_title": "Die Hard for kids yippee-Ki-yay mothershopper",
        "review_detailed_main": "If Die Hard had made a version for kids, this would probably be the way it would have been done, except without the laughs. Paul Blart is a great funny family movie with plenty of fun to be had from all the family. The laughs for the kids, and the tongue in cheek gags to former action movies for the adults. The plot was in most parts fairly predictable but the laughs did do their best to help veer away from the obvious plot twist. Kevin James from King of Queens fame does a great job playing the bumbling no-body that ever one takes for granted but soon shows them that he is more clever and cunning than anyone gives him credit for. I'm sure that once in our life we ourselves have felt the same way so you can sympathise with the character and thats's where Kevin James and producer Adam Sandler hit the nail right on the head. They could have made this character into a know it all mall cop who always gets his man but they chose (and it was a wise move) to make him as bumbling and clumsy as Inspector Clouseau but with a hint of John Rambo and John McClane thrown into the mix. All in all Paul Blart: mall Cop is a fun filled laugh fest from beginning to end and yes it will even make you cheer by the end. \"Scuba-dooby doo\""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "crossbow0106",
        "review_rating": "8",
        "review_title": "Pure Escapist Fun",
        "review_detailed_main": "Obviously a movie for people under 30, this film stars the likable Kevin James as the title character, who is mostly a loser and way too into his job as a mall cop. When a band of thieves take over the West Orange Mall in New Jersey (where else?), only Blart is still inside save for the thieves and the hostages. Can he stop the thieves? This film has some funny moments and not just the pratfalls and fat jokes. Kevin James, who co-wrote this, is not meant to be a leading man, so he's everyman. Films like this are either enjoyed or not, so don't take it too seriously. Of course some of it is ridiculous. However, I recommend it as escapist fun, so check your brains at the door and enjoy it."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "disdressed12",
        "review_rating": "8",
        "review_title": "i'm afraid i can't agree",
        "review_detailed_main": "my hopes for this movie were pretty low,so imagine my surprise when it shattered my expectations and it turned out to be a very good movie.sure,there's a bit of corn and cheese and a few slices of ham,and what's wrong with that,in moderation?.but there are also some good laughs,some touching moments and a what i thought was a fairly solid story with heart and depth.call me crazy,but i liked it and i just can't agree with the current rating of 5.3 on this site.Kevin James is pretty easy to like.throw in a possible romantic love interest and you can't help but root for the guy.all i know is, my fiend and i had a great time with this movie.for me,Paul Blart:Mall Cop is an 8/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "loufalce",
        "review_rating": "8",
        "review_title": "Absurdist Fun",
        "review_detailed_main": "This film amazed me.I wasn't expecting too much, but sometimes you can be pleasantly surprised. Kevin James is at his best as a mild mannered-and lonely security guard at a shopping mall in the shopping mall capital of the world-New Jersey. He could't pass the physical for the police department, so he took this job. He is divorced, has a teenage daughter and lives with at home with his mother. He takes his job pretty seriously even though the other employees couldn't care less, and has the responsibility of training the new employee.One day at the mall, he meets a beautiful salesgirl at a kiosk, begins to fall in love with her. He also has to compete with her asinine boyfriend who really doesn't care too much about her. His mother and daughter have also signed him up for a computer dating service. Get the picture? After what is probably the most depressing Thanksgiving Day ever seen in any movie, he goes to his room, turns on his computer, puts on Barry Manilows \"Weekend in New England\" and sees if he has any replies on his on -line dating service. Nothing today, maybe better luck tomorrow.\n\nNext thing you know, on Black Friday, bike riding and skateboarding baddies take over the mall. Since he is not on his Segway scooter and playing a video game at the arcade, he is the last one to know. When he discovers the plot, its like \"Die Hard\" in a mall. He singlehandedly takes on the bad guys while the local police and a SWAT team wait outside and encourage him not to do anything. The film is fast paced, has some very funny scenes, and is comparitively non violent. You'll recognize all the standard mall stores like\" Sharper Image\", \"Victoria's Secret\" and the kitschy \"Rain Forest Cafe\" which is also used for good measure.The cast is likable and James, with a walrus mustache shows that he is a fine comedic actor. Even if you never watch \"The King of Queens\", his character is fairly convincing. You can believe that he is real and able to handle any situation that his thakless job hads him. The results are hilarious and heroic at the same time. With far, far too many terrible movies that come our way, this one stood out and delivered a good 91 minutes of fun and laughs. It was pretty heart touching too. You just want Paul to win the girl of his dreams.Definitely worth the rental, you won't be disappointed. Scooby doobie do!"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "ajk718",
        "review_rating": "8",
        "review_title": "Better than expected but still just a silly comedy",
        "review_detailed_main": "I like Kevin James. I liked his role in the King of Queens and in Hitch and looked forward to finally seeing him a starring role in a film. I liked him enough to go see the movie in the theater, mainly because there was nothing much else to see at the theater at the time. I didn't expect much out of this movie being but it did end up being better than I expected it to be.\n\nI wouldn't say that watching this movie in the theater was a waste of time-- it did have its funny moments-- but I would have been just as happy watching it on DVD in the comfort of my own home.\n\nI do have to say that Kevin James fit perfectly for his role in this movie."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Pro Jury",
        "review_rating": "8",
        "review_title": "In the spirit of SCTV comedy",
        "review_detailed_main": "If you liked the John Candy / Eugene Levy movie ARMED & DANGEROUS, you will like PAUL BLART.\n\nSaw this movie during an overseas flight. Of the current batch of mall cop films, this is one of the best.\n\nThe lead actor has a gentle SCTV accent (Joe Flaherty, Eugene Levy, John Candy). If you liked ARMED & DANGEROUS, you will like PAUL BLART.\n\nIt cannot compete with the better John Candy movies, but close your eyes and you might think you are hearing a homage to the late great actor.\n\nIt is very interesting that SCTV had its home in Melonville, while in real life the lead actor of PAUL BLART, Kevin James, was raised in Melville. That Kevin James reminds us of the SCTV giants is a compliment to his talent.\n\n8 out of 10 stars."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "g-bodyl",
        "review_rating": "8",
        "review_title": "Enjoyable!",
        "review_detailed_main": "Despite all the negative reviews(of course), I have found this movie to be enjoyable if not somewhat too kid-friendly. There were some funny moments especially when Paul Blart first gets drunk.\n\nKevin James star as Paul Blart. He wants to be a New Jersey State Police Officer but cannot be one because he's overweight and fails the physical test. So he has to be a mall security officer. One night, the mall gets hijacked by a group of criminals. Now, Paul Blart is here to save the day! Kevin James is a funny man. I believe he's too underrated. He knows his comedy well but he's not Adam Sandler. The supporting cast does a nice job.\n\nOverall, this is a funny, enjoyable movie. I believe people of all ages will like this. I rate this film 8/10."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "chez123-836-329812",
        "review_rating": "8",
        "review_title": "Funny!",
        "review_detailed_main": "Funny Funny Funny!! Yes it was that funny. I am slightly biased because I just think Kevin James is hilarious. I was gutted when King of Queens came to an end. This film is short and sweet, which is good for me because I do tend to have the attention span of a nat (I'm assuming they have little or no attention span but I'm sure you get my point). Towards the end I found myself repeatedly turning to my friend in surprise (to her surprise) and saying 'I was not expecting that!!'. If you're looking for laughs a plenty (albeit a little silly) and you like Adam Sandler humour (this film is made by his or the production company HappyMadison which makes a lot of Adam Sandler films) you must go see this."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Floated2",
        "review_rating": "8",
        "review_title": "Entertaining Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "stainluss",
        "review_rating": "9",
        "review_title": "If you like King of Queens...",
        "review_detailed_main": "You will like/love this rom-com. James plays a similar, more innocent (but just as lovable) role as a mall cop in his second major role in a feature film. (I doubt it will be his last) And because of that, i think he plays it well (he has years of this PG-style performance from sitcoms) This film is getting a lot of hate due to its innocence and cliché-edness. Any old intelligent dude can make up something original, but it takes skill to mold existing gags (jumping into break proof glass) funny in a new dimension, and i think Kevin James and Happy Madison handle this task excellently. And despite a lot of the trash talk this film has put up with there are a few twists which you won't see coming. I hope we see more of these performances from Kevin James in future, its what he does best! 8.5/10"
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "levinmaxwell",
        "review_rating": "10",
        "review_title": "this movie cured my son's cancer",
        "review_detailed_main": "This is the best movie I have ever watched in my entire life. I own about 495 blu ray copies of this movie. I watch Paul Blart every single day, it is soooooo good. I will forever love this movie. I want to kiss the man who made this movie on the cheek, and give him all my money. I love both this movie and the sequel, they should make a third movie. I bought all the official merch and tickets to both when they came out. If they were to make a third I would buy tickets to the screening, please make a third one. Kevin James is a comedic genius, I will vote for him as president. If you hate this movie I will find you."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "mirosuionitsaki2",
        "review_rating": "8",
        "review_title": "Too Much Hyped.. I think.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "peewak-05041",
        "review_rating": "10",
        "review_title": "Paul Mall Blart Cop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "keithbate75",
        "review_rating": "8",
        "review_title": "Kevin James.....The new John Candy??",
        "review_detailed_main": "I can't believe that I've read so many bad reports about this film, I almost didn't bother watching it based on what I'd read, however I'm a fan of King of Queens so I thought I'd give it a look.\n\nI have to say that I'm very glad that I did because this film has some laugh out loud hilarious moments, a lot of smirk inducing stupid moments and buckets full of soul. I felt genuinely sorry and frustrated on Paul Blarts behalf during parts of the film and exhilarated and happy for him during other parts.\n\nThe only reason for this is Kevin James breathing life into the character in exactly the same way that John Candy did with films like Uncle Buck, Planes Trains and Automobiles and Cool Runnings. James has taken a rather sad, unfulfilled, unhappy character and turned him into a lovable, heroic, accident prone oaf that you will definitely have an affection for come the end of the film.\n\nThe storyline is weak, obvious and totally unbelievable but thats what makes it so enjoyable because you can just sit back and watch the hapless hero bumble his way through numerous hilarious set pieces. The parodies of other action films like Die Hard and Rambo are done brilliantly, the use of a Segway as his vehicle of choice is a master stroke and the warmth conveyed into the character of Paul Blart by Kevin James shouldn't be underestimated. I honestly felt like I'd gone back in time and was watching an old John Candy film. Bring on Paul Blart 2 because i'll be first in the queue to watch it.\n\nA great film for all the family and a solid 8 out of 10."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "kalebtle",
        "review_rating": "10",
        "review_title": "Just beautiful",
        "review_detailed_main": "\"Paul Blart: Mall Cop\" is a masterpiece in the realm of feel-good comedy, and here's why it deserves a solid 10/10.\n\nFirst, it's a unique blend of heartwarming storytelling and slapstick comedy. Kevin James' portrayal of Paul Blart, the lovable, well-meaning mall cop, is endearing and relatable. Blart is an underdog in every sense-overlooked and underestimated-but his relentless drive to protect his mall showcases the spirit of the everyday hero. This relatable setup makes his triumphs all the more satisfying to watch.\n\nThe movie also perfectly balances comedy with genuine warmth. Paul Blart isn't your typical hero, and the film revels in that. His quirks, his Segway, and his sense of duty all make him unforgettable. The humor might seem simple, but it's executed with such charm and sincerity that it elevates the film. Blart's awkward physical comedy and relentless optimism in the face of danger are not only hilarious but deeply humanizing.\n\nFurthermore, the action scenes are unexpectedly entertaining. The mall setting is clever and filled with opportunities for creative physical comedy, which James embraces with enthusiasm. Each set piece feels original, making use of the mall's unique features, from the play areas to the food court. The film makes you root for Blart not just because he's the hero, but because he's so earnestly himself-flaws and all.\n\nUltimately, \"Paul Blart: Mall Cop\" isn't just a comedy; it's a feel-good story about perseverance, heart, and heroism in unexpected places. It celebrates the unsung heroes among us, wrapped in a layer of humor that's both accessible and universally funny. A true 10/10, this movie is a joy to watch from start to finish."
    },
    {
        "movie_id": "tt1114740",
        "movie_name": "Paul Blart: Mall Cop",
        "movie_rating": "5.3",
        "review_username": "Boristhemoggy",
        "review_rating": "6",
        "review_title": "I'm not going to give this film a mall-ing",
        "review_detailed_main": "Kevin James plays Paul Blart, a failed cop who is employed as a mall cop. He's pretty ineffectual at most things, still lives with his Mam, is obese and immature. But, he has a heart of gold. So when some creeps try to rob his mall he springs into action. How will things pan out?\n\nLet's be very clear about this: this is a comedy film, of the style of frat boy/slapstick variety. It's not utterly hilarious, but it is amusing and innocent in a naïve sort of way. There's some scenes that in a more serious film you would cringe at, but this is light entertainment that the whole family can watch, and aside from latent heroism, it also features romance.\n\nIt's a far cry from some of the great comedies I've watched but it is non stop fun and sometimes laugh out loud. I really enjoyed it so gave it a solid 6."
    }
]