[
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jrmbarnach",
        "review_rating": "4",
        "review_title": "Escapism at its finest.",
        "review_detailed_main": "The real purpose of a movie is to entertain (escapism) - to distance you from your problems for a short period of time. If you will look at this movie from the perspective of a person viewing movies for entertainment purposes, then this movie is good (not very good since there are a lot of better escapist movies out there). If you look at it from the perspective of a movie critic, then this is a horrible movie, filled with clichés and poop jokes.\n\nThe first film of this franchise may have had some cliché plot points, but it didn't rely on poop and fart jokes to move the story or try to make the viewer laugh.\n\nThis movie has the usual 'stepdaughter-hates-stepmom' and the 'geeky brother' story lines along with the happily ever after ending. It seems the movie thinks that watching these story lines is entertaining to kids, when in fact, it's not (speaking from my perspective as a 13 year old kid). To be frank, it's quite annoying.\n\nHowever, this movie doesn't lack on the entertainment value. CGI all-around, gadgets everywhere, this movie has tons of cool stuff to keep the viewer at the edge of their seat. There are jokes that if you watch first may seem funny, but in the end will make you think \"is that joke really funny, or is it offensive\".\n\nBottomline is, this movie can be good or bad, depending on your perspective. To me, it's escapism at its finest."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "capone666",
        "review_rating": "3",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "Spy Kids: All the Time in the World in 4D\n\nWhen you've got two active adolescent agents in your home, you've got to ensure you have plenty of Flintstones Cyanide Pills on hand.\n\nFortunately, the step mom in this family adventure is an ex-intelligencer.\n\nTrading in her cloak and dagger for diapers, femme fatale turned housewife Marissa (Jessica Alba) is called back into action after the villainous Timekeeper (Jeremy Piven) begins to steal time.\n\nBut when the Timekeeper targets her stepchildren (Rowan Blanchard, Mason Cook), Marissa must divulge her past, which ultimately leads to their tutelage under a former Spy Kid (Alexa Vega).\n\nNow, the new recruits and their robot dog (Ricky Gervais) must stop the Timekeeper before it's too late.\n\nThe fourth installment of the Spy Kids franchise, All the Time in the World is a fart infused, infantile, chroma keyed atrocity.\n\nBesides, as an undercover child agent, wouldn't most of your assignments involve you luring in online predators? (Red Light)"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "slightlymad22",
        "review_rating": "4",
        "review_title": "Kids will get a kick out if it, but it's not a patch on the first movies",
        "review_detailed_main": "Like Jaws 4 and Superman IV: The Quest For Peace. Spy Kids 4 or \"Spy Kids: All The Time In The World\" is a Franchise killer. Although it was a moderate financial success against its $27 million budget. It is such a poor movie, it ended any interest in any future movies.\n\nMason Cook (in his first movie) and Rowan Blanchard (in her 2nd) are not as annoying as most child actors and are certainly cute enough, but they lack the chemistry that Alexa Vega and Daryl Sabra had in the first three movies.\n\nSo Jessica Alba is pretty much left to carry the movie on her own. She tries hard but the movie is missing some of the charm and magic that made the first movies so likable. It also misses the talents of Antonio Banderas and Carla Gugino.\n\nI give it 4/10 1 for Alba, 1 for Vega. 1 for Sarba, and 1 for the kids\n\nI'm sure most kids will like it, mine certainly enjoyed it, just not as much as the original three."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "freemantle_uk",
        "review_rating": "2",
        "review_title": "A unimaginative, pointless, cheap family film",
        "review_detailed_main": "Hopes were not high coming into Spy Kids: All the Time in the World. It is the fourth film in a franchise suffering from diminishing returns, plus it was using the stupid idea of smell-o-vision. And this family film does not disappoint.\n\nMarissa Wilson (Jessica Alba) is a top OSS spy who retires after capturing a super villain, Tik Tok, and starts a family with her husband Wilbur (Joel McHale) and stepchildren Rebecca (Rowan Blanchard) and Cecil (Mason Cook). A year later a new villain has emerged, the Time Keeper, who speeds up time using the Armageddon Device to punish humanity for wasting time. Marissa is called back by the OSS director, Danger D'Amo (Jeremy Piven), to recapture Tik Tok which should lead them to the Time Keeper. But the Time Keeper sets out to kidnap Rebecca and Cecil because Rebecca has the only thing that could stop the Armageddon Device.\n\nThere are many problems with Spy Kids: All the Time in the World. It's a cheap and unimaginative film where you could easily predict how they would play out. We have seen these story elements so many times before: the dad is a workaholic; there is animosity between step-mum and step-daughter as the step-mum tries to get closer to the children; the revelation of a lie, and so many others. The humour is crude, mostly poo, fart and vomit gags, basically the lowest common denominator which most children will easily outgrow. The other major route of humour is the barrage of puns: time puns, dog puns and smell puns – we're not stupid! The action is rudimentary; it is easy to expect much better from Robert Rodriguez who just uses poor CGI and quick cuts. And if you can't guess who the Time Keeper really is then you haven't seen enough movies. Spy Kids: All the Time in the World feels like it is a movie that is only made for a quick buck, not for any love of the material or the need to tell a good story.\n\nA movie aimed at children should be able to enliven their imaginations: Spy Kids: All the Time in the World is not going to do that. The artificial CGI scenes just look too fake for children to accept and buy into the action and the basic predictable plot will mean that children will not love it. Adults and parents will feel nothing but suffering when watching this movie. This is just a mindless movie with no imagination, which is ironic considering it makes a point that children make better spies because they have more imagination. Children are smart; they ask questions, see plot holes and come up with ideas involving sci-fi concepts. The best family and children's movies are clever, well-plotted affairs and often have good ideas behind them. Spy Kids: All the Time in the World does not share those traits. Plus this movie carries on the awful trend of spies with babies not working.\n\nMost of the acting is sub-par. The child leads are bland and not natural actors; it's your typical weak-child acting, and they are no Chloe Mortez or Kodi Smit-McPhee. McHale was truly unconvincing as the father and again a typical bad performance in a bad family movie. Alba was a punch bag for gags to be bounded off on. Ricky Gervais seemed to be having fun, but I'm sure that's because he got a paycheck for saying bad lines in a recording studio. Piven is much the same, having fun and just being over the top.\n\nAs movie fans we expect better from Rodriguez, who's done great movies like Sin City, From Dusk to Dawn and the \"Mexico\" Trilogy. Let's hope he is doing this movie so we can finally get Sin City 2.\n\nAnd I am sure you are asking the big question – what was the Scratch-and-Sniff card like? It was just a bunch of sickly sweet smells and simply just a gimmick. But you already knew that."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "The worst of the series, and one of the worst movies so far this year",
        "review_detailed_main": "I thoroughly enjoyed the first two Spy Kids films, they were fun, entertaining and ideal family films. Spy Kids 3 was rather mediocre and disappointing, but any horrible assets that film had was nothing compared to this.\n\nWhen I entered the theatre to watch this, yes I wanted to see it despite the trailer not looking that good, I thought if it is bad surely it can't be as bad as The Adventures of Sharkboy and LavaGirl. I was wrong, as awful as that film was Spy Kids 4 takes the cake as Rodriguez's worst film.\n\nThe film for starters looks cheap. The camera work at best is odd, and the effects lack clarity. The gadgets looked cool from the outset but once the nappy bombs for instance are introduced they lose their appeal very quickly.\n\nI didn't think much of the soundtrack either. I found it rather generic here rather than jaunty and memorable. And Rodriguez's direction is his most unfocused and inept directing job in my opinion of his career.\n\nThe script is awful, relying far too much on tired slapstick and heavy-handed messaging, while the story is rushed and much too thin for the film's running time and the action is dull and not helped by the haphazard editing.\n\nActing-wise, this film is disappointing. It was nice to be Daryl Sabarra and Alexa Vega here but other than the basic concept of the movie, them and Rodriguez, there seemed to be no connection to its predecessors. The new kids do what they can, but they aren't as confident or as appealing.\n\nJeremy Piven does give his all into a very underwritten and uninteresting villain part and his two other roles as well but at points it feels like he's overdoing it. Danny Trejo is wasted, Antonio Banderas was cut which is yet another reason why this doesn't feel like a Spy Kids movie, Jessica Alba does nothing with her role other than look pretty, while even Ricky Gervais is flat.\n\nThe cast are not helped by how their characters are written. The characters here are so cardboard, it is difficult to engage with them on any level.\n\nOverall, despite the trailer I was all for seeing this film. But it was awful(as part of a franchise and on its own terms) and a big disappointment. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "changmoh",
        "review_rating": "",
        "review_title": "A Juvenile Effort Meant for those Under Five",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "doomedmac",
        "review_rating": "1",
        "review_title": "Dumpster fire of a film",
        "review_detailed_main": "This movie is utterly terrible and should have never been made. Awful in every way."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jwidner76",
        "review_rating": "2",
        "review_title": "Not worth it (warning, spoiler)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "wgrima1",
        "review_rating": "1",
        "review_title": "Possibly the worst movie of all time!",
        "review_detailed_main": "This movie is not only the worst movie of the summer, it could possibly be the worst movie I have ever seen. I took my two boys aged 7 and 4 to watch this sorry excuse for a movie. The boys actually were fairly entertained, but I must say they are not exactly seasoned veterans of the movie watching experience.\n\nWe saw it in 2D but also had the '4th D' experience. This amounted to a card they gave you that you scratch and sniff at certain points during the movie. It is a horrible gimmick that does not even work. I scratched as hard as I could and could only smell a faint flowery smell. That is only one minor flaw of the movie.\n\nThe other flaws are as follow. The acting is horrendous. How they continue to let Jessica Alba act and even STAR in a movie is a decision that some Hollywood exec will eventually pay for with their job. Her lack of acting abilities were only surpassed by the rest of the cast. But it was not entirely their fault as the film's basic plot and script was about as thin as Kate Moss on a hunger strike.\n\nSo what do you combine with horrible acting, a thin plot and countless moronic lines written by the worst screen writers they could dig up? Mindless violence that is not suitable for small children. This movie is supposed to be about spy kids I presumed, based on the title. Most of the scenes and actions were played out by adults and the plethora of punching and kicking scenes was immature and detrimental to young, easily influenced minds.\n\nThis movie is disturbing for young children and is completely inappropriate for children of all ages. It also is so horribly acted and the screenplay so ill-conceived that adults are left wondering how in the world Hollywood can continue to put out such dribble and expect us to shell out our hard earned dollars on such mindless 'entertainment.'\n\nTo sum it all up, avoid this movie at all costs. Even if your children have seen the other versions and beg you to see it be strong and suggest alternatives. Show Hollywood that you will not be swayed by their slick advertising and inept film-making."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Spideyfan-963-246215",
        "review_rating": "1",
        "review_title": "Spy Kids All The Time In The World",
        "review_detailed_main": "Spy Kids: All the Time in the World(2011) Starring:Jessica Alba,Joel McHale,Jeremy Piven,Alexa Vega,Daryl Sabara,and Simon Pegg Directed By:Robert Rodriguez Review And to think I use to enjoy these pieces of crap when I was a kid. When I was little I was having fun with the Spy Kids sequels,Lost dreams and Game over 3D. But I watched them again and had a second opinion thinking that they were stupid. This sequel makes them look like the godfather. In the most recent Spy kids movie Jessica Alba is playing a spy who has character name that I really don't remember or care about,who has her last mission catches the bad guy has a baby. Year after that some time keeper villain or whatever the heck his name was,makes time go faster and wants to go back in time to spend more time with his father.Jessica Alba recruits her kids and they must take some diamond and stop the Armageddon device and the time keeper. What immediately ticked me off about this movie is all the marvel references like for example , there is a chase scene in the beginning where the kids are in some CGI spacecraft and there being chased by the time keepers henchmen and it looks like there on the green goblins glider. But wait the references don't stop there,they also have a fight sequence going on and one of the kids have some hammer hands and guess what he says \"it's hammer time\" and then he lifts one of his hands and lightning is surging through it. That's when I lost it. The movie of course even brings back the original spy kids,but here's a problem with that,they do the cliché of he/she is dead but they come back for the finale of the film for fan service although I doubt this series has fans and with this movie they lost them. Spy Kids all the time in the world is one of those family movies that make me hate live action family movies while the sequels before this were bad this is the worst. I give Spy Kids:All the Time in the World a half out of five."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "paulww",
        "review_rating": "4",
        "review_title": "Robert Rodriguez has still got the magic !",
        "review_detailed_main": "Yes, Robert hasn't lost his touch. When a man has that much talent and imagination, you wonder how long he can keep it up. He is a genius, and I don't use that word lightly. He has invented a new kind of movie here, with the spy kids series. A movie that empowers children instead of what Hollywood has always done with children's movies. The spy kids movies are a refreshing change and I'm glad to see it continuing. The first three were ground breaking and very special. I was so glad to see that this one lives up to that. Although not as good as the first two, which were superb, I rate it about the same as the third one. It may be hard for some to embrace the new cast, which happens every time a new James Bond is cast. I think everyone is just as likable as the originals. Reviews that cut down the acting, plot or whatever don't understand what Rodriguez has done. This movie, as with the other three, is for children and people who love children. If you don't consider yourself in one of those categories then you won't get it."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "asherrbh_15",
        "review_rating": "10",
        "review_title": "I love this piece of absolute garbage",
        "review_detailed_main": "This is honestly one of the most enjoyable movies I've ever seen, I love just how atrocious it is.\n\nI love this piece of trash, it's honestly a guilty pleasure and it was one of my favorite films when I was little, embarrassing."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "drew_atreides",
        "review_rating": "6",
        "review_title": "I rate this film as a parent who took his kids...",
        "review_detailed_main": "...Took the family (5 year old son, 2.5 year old daughter) to see Sky Kids 4 today..\n\nSpeaking as an adult who saw all 3 of the original SPY KIDS movies in the theatre, this is easily the worst of the series. Joel Mchale (who i have actually become a fan of based off his THE SOUP and COMMUNITY work), Alexa Vega and Daryl Sabara give some incredibly bad performances. Embarrassingly-so. Jessica Alba does what Jessica Alba does (thank the Gods she's cute and met Robert Rodriguez), and Jeremy Piven....actually i liked Piven. His character had an interesting story- arc, and he gives a solid performance.\n\nSome of Ricky Gervais' one-liners were funny, too.\n\nThe rest of the film was pretty unbearable.\n\nHowever, speaking as a parent who was out hoping to show his kids a good time, i actually have to give this movie a solid rating. My 2 kids enjoyed the heck out of it, from the talking dog to the baby decking a bad guy, the kids loved it. And my son had a lot of fun keeping track of when to engage the AROMASCOPE scratch card.\n\nA nice film for younger families, i think."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "debruin1975",
        "review_rating": "1",
        "review_title": "Horrid... just plain HORRID!",
        "review_detailed_main": "What can I say, I thought it was a good movie. I already watched the last ones which were quite good (part 1 and 2 were very nice! After that it went all down-hill). But part 4 really beats the cake. Alright, special effects are OK, but the rest is just hogwash. There is just no tempo in this film whatsoever. I think even tiny toddles will cry when they see this piece of garbage!!! Please, I beg you. Let the Spy Kids grow up to be real men and stop with the series!\n\nNow I know why this film was chugged on DVD as fast as it could: to rake up even more money from gullible customers... well, one things for sure. I saw this movie for the first time last week and it was immediately the LAST TIME!"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "xibchel",
        "review_rating": "",
        "review_title": "I'm closer to my inner child!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "sonnavfenrir",
        "review_rating": "3",
        "review_title": "Messy and heavy handed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "Smell it",
        "review_detailed_main": "The movie tries something that hadn't been done for a long time. It tries to reach out and tickle the one sense that isn't being reached out to: smell. The fact that you have to scratch a number on a piece of paper you get, every time it appears on screen, can be a pain though. Still kudos for trying something.\n\nThat won't help with the story, that is too easy to see and guess for any adult. But they are not the main audience for this movie. This is aimed mostly at kids. They might kinda like it. It's not as bad for them and if you watch it with them, you might enjoy it because of that. I'm not sure if they will include \"smell\" cards for the DVD/Blu ray ... and how long the smell lasts. Apart from the gimmick there is not that much more there."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Leofwine_draca",
        "review_rating": "2",
        "review_title": "The worst yet",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "I wish they'd just stopped after the first one.",
        "review_detailed_main": "The original \"Spy Kids\" movie was a cute little kids film which was actually enjoyable for adults as well. So, the studio did what they often do...take a good idea and beat it to death with sequel after sequel! As a result, his fourth installment managed something no other \"Spy Kids\" movie did...it managed to make IMDB's infamous Bottom 100 List. In other words, it's among the 100 wide release films that are hated most by IMDB users.\n\nIn order to try to keep interest in the franchise, later films added gimmicks to keep the kids interested. This one has several....it's in 3D, it has 'smell-o-vision' (theaters were equipped with machines that dispensed scents) and there's a talking robotic dog....all of which loudly scream out 'jumped the shark'.\n\nWhen the movie begins, you'll notice that barely anyone from the original movie is here. This makes sense, as the two children from the first one were no longer kids...as a decade has passed. Interesting, the fully grown kids from the original films DO show up later in this movie as their original characters. And, since the kids in the film are new, so are the parents. One is a TV host of a show called \"Spy Hunter\", the step-mom is an actual spy for OSS*.\n\nWhen a super-villain named the Time Keeper starts affecting the passage of time, the step-mom is called into action. Almost immediately after, minions of this baddie show up and try to abduct the kids...and they realize their step is a spy! How do the kids defeat this first wave of minions? By hurling puke bags at them...an excellent metaphor for this picture!\n\nSo, was there anything I liked about this film? A few things. I appreciated how the boy in the film wore hearing aids. You rarely have deaf or hard of hearing characters in movies. The only sad part is that it didn't look as if they hired an actual hard of hearing kid for this part. The look of the film is also nice...they clearly spent money on the movie and came up with some cool gadgets. And, finally, I did appreciate that they brought back the grown up spy kids...a nice touch.\n\nWhat I disliked mostly was the scatological nature of much of the film. These were just gross and unnecessary...and guaranteed to offend and bring down the quality of the production. The film also lacks originality and it looks like there have just been a few too many trips to the well, so to speak. What was original, but unwanted, was the robot dog. While a few of his comments were kind of clever, mostly he was there to provide potty humor.\n\nThe bottom line is that I definitely did NOT like this film but feel that kids may like it...parents certainly won't in most cases. The same things that turned me off might be enjoyed by some kids...especially the robotic dog. So, I'll give it a 1 for parents and a 5 for kids...and will split the difference for my overall score.\n\n\n\n*There really was an OSS. The Office of Strategic Services was created for WWII and later was renamed the CIA.Three times could be the charm...but what about four??"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jordan-shepherd1020",
        "review_rating": "1",
        "review_title": "Spy-Kids: All the Crap in the World",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Vezon123",
        "review_rating": "3",
        "review_title": "Director in poorly lit?",
        "review_detailed_main": "It's terrible. It's a tragedy that both Jessica Alba and Joel McHale from The Soup played characters in this. Butt-bombs, barf bags, etc. It takes toilet humor to the extreme. Sure little kids will find it enjoyable, but anyone over the age of 10, stay away from this and never look back! Also 4D, really? Doesn't most moviegoers hate 3D? Why 4D? It's just 3D, but with those stupid pop-up numbers to make you scratch the number and smell those stickers that smell worse the cigarette smoke. And one last thing. A TALKING Australian-ACCENT DOG (no joke) with face-palm inducing one-liners such as \"Somebody put that on YouTube.\" and stuff like that. But there is only one thing that I like about this movie. Carmen and Judi are back. They got the original actors that played them and was defiantly a nostalgic tribute to the first 3 movies. All in all, just save your money. If you really want to see how bad it is, wait till it comes on RedBox."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "CaptMTS",
        "review_rating": "4",
        "review_title": "Fun for the Right Age",
        "review_detailed_main": "I took my four kids (6-13) to see it knowing ahead the risks, having seen one or two of the earlier Spy Kid movies. For a kids movie, Spy Kids was just average. The movie worked great for the younger audience (6 & 9 year old), as they enjoyed the physical humor, frequency of jokes related to bodily functions, and baby humor.\n\nMy older sons found the movie boring, and one even feel asleep. So, if you are looking to kill two hours, Spy Kids would work for a younger audience (under 10) - but be forewarned about the numerous bodily function jokes related to many parts of the body.\n\nA final word on Aromascope - it doesn't work. All of our scents smelled like strawberry kool-aid, except #4 was kind of minty. While a fun idea, I'm glad to have missed out on the blue cheese, fart, and vomit smells."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "MsDanaGold",
        "review_rating": "8",
        "review_title": "Not Oscar-caliber, but high-concept family fun-oh, and 24 Pivens!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "kjm92",
        "review_rating": "6",
        "review_title": "It's a kids movie after all...",
        "review_detailed_main": "I don't think this was a bad film, granted it wasn't a good film but for me I couldn't help relate it back to the original movies and in that sense I think it did well, it didn't stray too far from the original plot lines and I liked that because I was afraid after all these years it would have changed completely.\n\nSo many of these reviews rate it as \"cheep and crappy\", well it's definitely cheap, the graphics are pretty much exactly the same as the original films and its not going to win any awards for being a brilliant flick but the movie wasn't made for YOU, it was made for the kids.\n\nI think as a kids movie, or family movie, it does well and I believe the children will love it just as I loved the originals when I was younger. Yes the plot is cliché and predictable but to a kid it's a whole other world where they can be a hero without growing up."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "nickmesafilms",
        "review_rating": "3",
        "review_title": "Spy Kids: All the Time in the World in 4D (2011) - Aroma-Scope is So Obnoxious These Days!",
        "review_detailed_main": "So, it's been a while since we have seen the \"Spy Kids\" in a movie, and the last time we saw them was in the 3-D movie \"Game Over\". Which was okay, but I was just there for the 3-D. Now, we get newer characters, a newer 3D technology, and we get \"Spy Kids 4-D in Aroma-Scope\". You know, \"Aroma-Scope\" is where they give you this card, so when a number pops out during the movie, you scratch the number on the card, and you smell it. That's pretty much it. But there are so many disgusting things in this movie that you just don't want to smell. I'm glad I didn't see this movie in Aroma-Scope, cause I honestly didn't want to sit through that torture. The 3-D is okay, though! Anyways, Jessica Alba, who is incredibly hot, is a retired mom who now is the stepmother to two crazy kids, one who is this cool kid with a hearing aid, and always bugs into situations, and then you have this annoying little girl pulling out all these pranks, and you just want her to shut the hell up. Their dad, played by Joel McHale, is a television star who doesn't have the time in the world to spend time with them, that's because this stupid villain named the Time Keeper, portrayed by Jeremy Piven, is trying to change time itself, and such bull-crap. So, they meet up with the original Spy Kids, Carmen and Juni, played by Alexa Vega, who's so hot today as an adult, and Daryl Sabara, who wasn't as good as he was as a child. They gear up, and they try to stop the Time Keeper. Then, we have our movie! What? I was just sitting there, listening to the jokes and gags, and they're just not funny. But the only thing funny about this movie was the talking dog. Ricky Gervais plays the voice of the talking dog, and he says jokes that are funny. The rest is just nonsense. Also, when you put Jeremy Piven, Jessica Alba, and Joel McHale in a movie like this, and they were all dumb, you just start to wish that they got good paychecks for this mess. Besides, the movie throughout was just so weird. Director Robert Rodriguez really wanted to make a family film for everybody, but all he made was a family film for nobody at all. That's why Rodriguez should never take movie ideas from his kids. The 4-D Aroma-Scope was super annoying, the cast looked embarrassed to be a part of this mess, the directing was childish, two hot chicks, and a dog that's super funny. All of that lead to a surprisingly annoying family flick. \"Spy Kids: All the Time in the World in 4D\", in my review, \"a lazy and childish excuse for cinematic technology\"."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Multiple Copies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "bent-mathiesen",
        "review_rating": "3",
        "review_title": "If you are a kid and like poop comedy it is OK",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jboothmillard",
        "review_rating": "2",
        "review_title": "Spy Kids 4: All the Time in the World",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "chrissy-adigun",
        "review_rating": "2",
        "review_title": "The audiences aren't stupid",
        "review_detailed_main": "After watching about two scenes from the movie, my thoughts were, \"if this were a 90s movie, I'd probably give it a 6/10\" but it's 2011 for crying out loud. I read some reviews saying it's for kids, leave your minds by the door to enjoy the movie. Speaking as someone who watched the first three installments as a kid and teen, this was a disappointment. Bland humor, terrible effects, bad lines and delivery. Maybe it's similar to the first installment in effects but that was 2001 and that was the best they could do. And that's why we enjoyed it. My parents enjoyed it then and they didn't have to drop their brains and forget every ounce of sensibility to do so. We saw the best effects, animations and adventures of that time and we had to think outside the box to understand it. It's different with this movie, it was 2011, better technology, new ways to add elements to the movie and this was the best you could come up with? I hope by 2020, we won't be asked to act like zombies, forget we have brains or go with the excuse \"for 4 year olds only\" to enjoy epic fails like this. You know how you can do better? Don't treat the audience like senseless carrots."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "studioAT",
        "review_rating": "2",
        "review_title": "A surprise return of the Spy Kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "bazmitch23",
        "review_rating": "1",
        "review_title": "Arguably the worst film Senor Rodriguez ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Edvis-1997",
        "review_rating": "1",
        "review_title": "1",
        "review_detailed_main": "Please no more. It is possible to watch first pat of spy kids but other.. God please no just no..."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "leftistcritic",
        "review_rating": "3",
        "review_title": "Ok action movie, but not a comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jamiedarlow-37510",
        "review_rating": "8",
        "review_title": "Rodriguez's most delightfully surprising film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "DarkVulcan29",
        "review_rating": "7",
        "review_title": "Not bad, but please be more original.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "boydmatta",
        "review_rating": "1",
        "review_title": "The death of a franchise",
        "review_detailed_main": "An early Hollywood cash-grab, clearly riding of the success and cult surrounding the original Spy Kids trilogy. Lost all the charm the originals had, and the surprisingly good child actors of the first 3 films, have been replaced by the blatantly terrible child actors in this one. The humour went from quite witty, with some elements for adults too; to the expected toilet-humour you get from and lazy kids film. The beauty of the originals, was that they weren't rated 'U' for kids, they were 'U' for everyone. Anyone could watch the originals, whereas this can only be watched by children not smart enough to understand why they're seeing."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jason-pyktel",
        "review_rating": "",
        "review_title": "regards above review/Spoiler above",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "ecekivanc",
        "review_rating": "1",
        "review_title": "A star for the crew",
        "review_detailed_main": "I've seen the previous movies and I can't say they were excellent, but somehow they caught the audience with the scenarios'. In the first 15 minutes of this movie, I started watching it with hope and painfully pressed the close button. I wasn't expecting anything realistic, I like absurd comedy and watch a lot of it, even I have a side to watch and love movies that most people find bad. I like the actors here, but for the first time, I couldn't watch a movie. Effort and time wasted, so I'm giving one star for the staff. Still, those who want to watch should give it a chance, it can be ideal for distraction."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "reboot ultimately fails",
        "review_detailed_main": "OSS agent Marissa Wilson (Jessica Alba) retires after capturing time manipulating villain Tick Tock (Jeremy Piven). Her husband Wilbur (Joel McHale), step-kids Rebecca (Rowan Blanchard) and Cecil (Mason Cook) don't know her secret life. Wilbur creates a TV show hunting spies. A year after having a baby daughter, OSS director Danger D'Amo (Jeremy Piven) recalls Marissa to battle villain Time Keeper (Jeremy Piven) who is speeding up time to destroy the world. Marissa had given Rebecca a necklace with the Chronos Sapphire which is the only thing that can stop the device. When bad guys come looking for the Sapphire, Rebecca and Cecil discover Marissa's secret and their dog Argonaut (Ricky Gervais) can actually talk. Carmen Cortez (Alexa Vega) reveals that Marissa is her aunt and the Spy Kids division was deactivated after something happened with Juni Cortez (Daryl Sabara) seven years ago.\n\nI like the idea of two new kids taking over. I even like Ricky Gervais. However, I would have prefer Robert Rodriguez do more to update the series. Also Marissa bringing the baby along isn't cool or even funny. Carmen and Juni don't need to return for this installment. It may work better to reboot the franchise without them. This reboot obviously didn't work unless Rodriguez want to continue with a lesser straight-to-video production."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "ericstevenson",
        "review_rating": "2",
        "review_title": "Stop dropping the title",
        "review_detailed_main": "I have very fond memories of the original \"Spy Kids\" movie that came out in 2001. Ever since then, a sequel was made once a year probably so the lead kids wouldn't get older. They ended up making a sequel eight years later and it's even more pointless than you would imagine. This movie features a new stepmother who's a spy trying to stop a villain named Tick Tock (really dumb supervillain name) along with the Timekeeper. We get this tired cliché that actually happens to both parents in different jobs, not having enough time for their kids. The worst thing about this movie is the crude humor.\n\nThere's a robot dog that literally pees oil and poops bombs. Oh, and he can fart for no reason other than that it entertains him. Farting dogs didn't work in \"Space Buddies\", why did they think they would work here? There's even one scene where the boy character has to throw up in barf bags so he can throw his barf at the bad guys. This was released in something called 4-D, which apparently added smells or something when it was in theaters. The 3D looks horribly out of place and if 3-D is dead, 4-D was the nail in the coffin.\n\nThe special effects are really bad and I read that this movie was mostly made because of something Robert Rodriguez had in his contract with Harvey Weinstein. We should have been to tell he was a huge scumbag for being responsible for this atrocity. These movies started out great, but declined in quality with every sequel all leading up to the worst one of them all. Seriously, the original only has a rating of 5.5 here? It's got a 93% on RottenTomatoes! Any film with a baby throwing food in her mother's cleavage can't be good. *"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "temo",
        "review_rating": "2",
        "review_title": "Such a disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "BA_Harrison",
        "review_rating": "2",
        "review_title": "What a load of shitake mushrooms!",
        "review_detailed_main": "Robert Rodriguez's Spy Kids franchise has gone seriously downhill since the first movie, with All The Time In The World in 4D easily being the worst adventure yet. An incredibly messy story, a glut of cheap-ass CGI special effects, godawful direction, a pair of bland moppets in the lead roles, enough dreadful 'time' puns to last me until the end of time, and the inclusion of a scratch-and-sniff gimmick that smacks of desperation, all go to make this film a real stinker.\n\nAbout the only good thing about this Spy Kids flick (for me at least) is the return of Alexa Vega as Carmen Cortez, who has grown up very nicely indeed and who looks fantastic in her body-hugging spy outfit (far better than Alba in my opinion). Vega's presence made it a tad easier for me to stomach all the puerile toilet humour and crap one-liners from smug comedian Ricky Gervais (as a talking dog), but I still found it hard to make it through to the end."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "FlashCallahan",
        "review_rating": "4",
        "review_title": "Tick Tock.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "david-gouldthorpe",
        "review_rating": "1",
        "review_title": "Absolutely horrendous. My childhood memories have been spoiled.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "ofranklin-149-709555",
        "review_rating": "9",
        "review_title": "Why the hate?",
        "review_detailed_main": "Why are so many people hating on this film? I took my kids (6 & 8 y.o) and we thoroughly enjoyed it. I thought the action was very well done and the acting was sound. Loved Alba, thought Piven was great. Re. Joel McHale: so often talk show hosts can't act (they play themselves), but though he wasn't called on for much, he was believable as someone other than Joel McHale. I enjoyed the head-twisting Guillermo Del Toro-esque stuff. Loved the art design. The inside of the machine and all the swirling gears...that was cool.I know the text about family is maybe a tad hackneyed but it was more strident than before in this one, which made me wonder a tad re Rodriguez's own anxiety. IN any case, I was entertained and the kids were too (which made me feel good about time with the kids!) I loved it. We even kept the 4-d smell card (which admittedly did not work very well) so we could remember the experience. Summary: We have seen all the Spy Kids movies and I thought this one was the best. I felt like RR finally hit his stride. Honest. Maybe I'm missing something but I loved it."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "g-bodyl",
        "review_rating": "7",
        "review_title": "Not Bad At All!",
        "review_detailed_main": "In one of the most surprising happenings that occurred to me, I found out that I actually liked the fourth installment in the Spy Kids franchise for the most part. The first two films are definitely better but this is way better than the horrid third film. I guess I liked this film because it brought back so many memories from my childhood. That was true when Carmen and Juni appeared on screen. I know the acting was cheesy and there were plenty of potty humor, but I couldn't bring myself to hate this film.\n\nRobert Rodriguez's film is about an evil guy who is bent on making time go faster so a retired spy and her kids are recruited to turn time back to normal.\n\nAs I mentioned earlier, the acting is kind of cheesy. Jessica Alba is pretty good and is quite nice on the eyes. The kids are decent even though they say some weird stuff. Ricky Gervais makes an awesome dog with his voice.\n\nOverall, this is a decent film but I can see why many people despised it. Despite my thumbs up, I think it's time for this franchise to hit the bucket as I can see some wear and tear. This film wasn't even asked for in the first place but it's a nice distraction for the kids. It doesn't have the great visuals as the earlier films, but it wont matter to the kids. I rate this film 7/10."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "rahtho",
        "review_rating": "5",
        "review_title": "Average Film",
        "review_detailed_main": "\"Spy Kids: All the Time in the World in 4D\" does not have interesting end it's little dis-pointed if you watch all spy kids movies. Story is created only for kids. The film has good 3D effect and from the Aroma Scope is good. Watch it in 4D you will like it. Average film for me. card of 4D has good smell , but only children will love it. for me this film is Average film. 5 points from me. If you want good time with your children then go go go... At an innocuous hour and a half, the connect-the-dots simplicity of the plot goes down smoothly, while the oft-recited platitudes about family and time actually hold some water given that most of them are being recited— and learned by—children. As far as babysitting devices go, you could do far worse. Visual effects range from passable to pitiful, and the film has the overall look of a direct-to-video quickie."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "garrisonaw",
        "review_rating": "",
        "review_title": "Every bit as enjoyable as the first three!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "kallin-efremidis",
        "review_rating": "2",
        "review_title": "it's funny cos it's crap",
        "review_detailed_main": "terrible movie!!\n\nas soon as i saw the advert in a shopping center, i thought, \"thats gonna be a terrible movie\". as soon as i saw the trailer i thought, \"wow, that is going to a pathetic movie\"\n\ni watched this movie with a friend and we spent the whole movie insulting it, pointing out flaws, mistakes and holes (which came up often), bad acting and basically predicting the entire movie, which was very easy.\n\nthis movie was a miserable effort, and the only reason i gave it 2/10 was because the dog Argonaut was absolutely HILARIOUUUUUUUUUUUUUUUUUUUUS, loved that British accent and his smart ass attitude. if not for him, it would have been a 1/10."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "ryancahoon",
        "review_rating": "4",
        "review_title": "Worth the watch. :)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Mr_McGee",
        "review_rating": "1",
        "review_title": "Crappy Cash Grab",
        "review_detailed_main": "Shame on this film....shame. This 4th instalment to the fantastic Spy Kids franchise is extremely disappointing. Spy Kids 4 was made ages after the first trilogy as if someone thought it would be pretty cool to bring back the series. It was not. Instead of bringing a new generation to the amazing adventures of Spy Kids, it's filled with extremely cheap fart jokes and horrible writing. I went to see this film in the cinemas and it claimed to be in '4D' what they really meant was a scratch and sniff card that was all just fart smells. The main conflict of the film is that time is speeding up, however the film does not show that at all apart from clocks functioning faster. Remember show don't tell? This movie doesn't. Overall pretty dumb and cheap cash grab and I'm glad no one remembers it."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "tfbowler314",
        "review_rating": "1",
        "review_title": "I SPY with my little eye something awful",
        "review_detailed_main": "This is definitely the worst spy kids movie ever made and 1 of the worst of all movies. The scenery was too boring or twisted. What is with a spy baby, a spy dog, and a villain who doesn't know what he was doing until the kids showed him the real truth? The kids who played the spy kids didn't even go on a mission until the last 20 minutes of the movie to experience being spies. The father was creepy showing an eye brow look to his son to look tough and his show was dumb. How dare filmmakers imitate a similar home to where The Cortezes lived in! Acting was poor. Same goes for the gadgets. What was ironic was the new spy kids looked much younger than the original spy kids, when they started being spies. I think this was just a movie to laugh at how poor of a job it was made."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "nate-217-195312",
        "review_rating": "4",
        "review_title": "Better than what I expected, but it was still awful",
        "review_detailed_main": "This movie that I realize has a great 4D option that was great, but the story and how the characters work and relate is okay. The worst part, well there's a lot of stupid and useless parts. The first one is the story line. The story line was a little waste of time for most people, but some people really loved it, unlike me. Second was some of the animations that were used in some of the scenes. If you've seen the trailer of how the dog talks, in the movie it was ten times worse than the trailer by far. Third, well there's nothing else awful. On the other hand, there was some good family humor that I loved, but it wasn't the best out there."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "damionmezuko",
        "review_rating": "3",
        "review_title": "Not Good",
        "review_detailed_main": "I must say after taking my brother to see this in cinema, I was annoyed.\n\nFirst off I have been a fan of Spy kids since I was a child, always said I was going to be a spy like them. The first two was good... The third, was okay but this? It was a waste of my money and in my opinion ruined everything else.\n\nEven the 4th dimension was rubbish. I couldn't smell a thing, not matter how hard I would scratch it. Another pointless thing.\n\nAll in all, I wouldn't recommend this movie for anyone, not even the young. My brother even hated and he usually loves these types of movies. It was a waste of time."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "vito-dida",
        "review_rating": "4",
        "review_title": "Another stupid Spy Kids movie.",
        "review_detailed_main": "This movie is a beginning of a new era of Spy Kids. Robert Rodriguez once again wrote the script and directed a movie by himself. This information tells us how big egomaniac he is. This is also the reason why all of the Spy Kids movies were bad. Even the world crisis could not stop Rodriguez; some people are broke and hungry, while he spends a lot of money for such junk, also called as a disaster. I was also at the premiere waiting in a big, long line of people with my 3 friends and all I learned from this movie was that Mason Cook and Rowan Blanchard (Cecil and Rebecca Wilson) are only ''wannabe'' superheroes or spies or whatever they should be. I also have to mention that one of my friends(I'm not gonna mention names) had to change his pants after the premiere, but not because he was scared or anything like that, it was because I threw up all over his pants, because the movie was so bad. The idea of ''Aroma-Scope cards'' was dumb such as the story. I give this movie a thumbs down and a rating 4 out of 10 (only because I fell sorry for the ''Spy Baby'' and that dog; they were fantastic)."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Atomic_Peace",
        "review_rating": "10",
        "review_title": "Spy Kids: A So Bad it's Good Review",
        "review_detailed_main": "This is arguably the worst film that Showtime currently has to offer, so far.\n\nI don't know about you, but I was raised on the Spy Kid films, I loved the first one, it introduced me to a brand of films: the slapstick Three Stooge-Esq animation and action captured my attention as a small child, and this was even before I had a conception of what good acting was, truly, if you place a child in front of a monitor and put such a laughable film like this on, they'll think these are real people sadly. But, if you plop it front of them 10 years later, they're going to be laughing like a pack of hyenas, not at the jokes, but the story and acting. ﻿ Now that I am in my teens, I have a good conception of what a good movie is, and what a bad movie is, and I can say with pride; that this, Is the Worst Film 2011.\n\nA few weeks-ago, I put the original trilogy on, because I hadn't watched it in a while, and I can still say that the movies still holds up, even after the 10 year gap of not watching them, they still manage a smile to my face, not out of stupidly, but because of the jokes and characters, (not to mention that they are one of many childhood gemstones of mine.) ﻿ This morning I was surfing Showtime and saw this listed, with no mind to the universal panning by critics, I put it on, because I'm one of those guys who, if I start something, I gotta finish it, and oh, my. Am I regretting that decision. ﻿ There are so many problems with this movie, that I could actually list them.\n\n1) Jessica Alba, she is still acting 2) The kids in the movie are extremely annoying 3) The acting is just... terrible. 4) In the beginning of the movie, Jessica Alba's character is on mission during pregnancy. This is a recurring joke in the movie, in which while she fights crime, she has her toddler in a baby holster.\n\nThe extremely slow paced film soon becomes an bother of the viewer,to the the point where I checked the clock, what felt like 50 minutes, was a mere 20. If a film goes that far down the cutting room floor, I am forced to give the film, a:\n\nNegative 10.5 Ticket Stub out 10 Tickets.\n\nA Note to Parents: if your kids ever misbehave, put this on, it Will scare them back into line."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "critterdhs05",
        "review_rating": "7",
        "review_title": "Back to the old classic spy kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "ahmedn32004",
        "review_rating": "3",
        "review_title": "Very exaggerating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "khannasameer85",
        "review_rating": "",
        "review_title": "Must Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "torfarrells",
        "review_rating": "1",
        "review_title": "Trash. Watch the first 3, then dump this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Hellmant",
        "review_rating": "2",
        "review_title": "I really wish I could enjoy Rodriguez's kids' movie ventures as well but I just can't!",
        "review_detailed_main": "'SPY KIDS: ALL THE TIME IN THE WORLD': One Star (Out of Five)\n\nRobert Rodriguez's fourth film in his popular kids' movie franchise in which he performs his usual writing and directing duties as well as several other functions including producing, cinematography and music. I'm a big fan of Rodriguez, he's actually one of my favorite writers and directors, but I hate his kids' movies; I love all of his films except the ones he aims at children. I admire him fully embracing his inner child, creativity and unchecked imagination but I just don't think it works with his kids' films. Sure they're entertaining and amusing to children but they offer them no other value and have absolutely nothing at all to offer adults (except a painstakingly annoying film going experience). A good kids' movie should be entertaining to adults as well as children and Rodriguez's films definitely don't have that quality. As far as the 'SPY KIDS' films go (as well as his other kids movies) this one is by far the worst as well. It was simply painful to watch and one of the most unpleasant film going experiences I've had all year!\n\nIt's been eight years since the last 'SPY KIDS' film and stars (of the first three films) Antonio Banderas and Carla Gugino are nowhere to be found in this installment. Jessica Alba stars this time around as retired spy Marissa Cortez Wilson. She's married to a TV 'spy hunter' reporter named Wilbur (Joel McHale of TV's 'THE SOUP' and 'COMMUNITY'), who has no idea she's an actual spy. The two have a newborn baby together but Wilbur's ten year old twins Rebecca (Rowan Blanchard) and Cecil (Mason Cook) don't appreciate their new stepmother. All that changes when Marissa is called back into action to stop the evil villain Timekeeper (Jeremy Piven) from taking over the world and the kids get involved in the action. The original 'Spy Kids' Carmen (Alexa Vega) and Juni Cortez (Daryl Sabara), Marissa's niece and nephew, return to help the new 'Spy Kids' out. Ricky Gervais costars as the voice of the family dog and is the film's one saving grace!\n\nThe movie completely scrapes the bottom of the barrel clean! There's not much lower Rodriguez could have gone in trying to appeal to the laziest part of children's minds. One could argue that movies like this make kid's dumber but I wouldn't go that far. If I had kids that wanted to watch this and just be entertained for 90 minutes I'd probably let them but I certainly wouldn't want to watch it with them (unless I hadn't already seen it I guess, because of the Rodriguez factor, but under no other circumstances). A good kids' film should be one you can enjoy watching with your children and get something out of as well (like 'THE MUPPETS' from earlier this year, or the 'STAR WARS' films). I really wish I could enjoy Rodriguez's kids' movie ventures as well but I just can't. It's too bad he doesn't put that amazing talent to better use; I know there's a truly great family film in him, he just doesn't know how to channel it yet.\n\nWatch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=ioQaCI5Qk34"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "ricderob",
        "review_rating": "1",
        "review_title": "Very Disappointing",
        "review_detailed_main": "Remember the movie I Robot? There's a scene where Will Smith puts on a pair of brand sneakers. I believe that's called product placement. If throughout the movie, on the other hand, the sneakers had come on screen again and again, with Smith repeatedly saying how great they are, then it wouldn't have been a movie, but a commercial. That is what Spy Kids IV is. A huge 121-minute long commercial for \"family\".\n\nWhile Rodriguez's movies usually have a \"family\" message to them, in this case it's way over-the-top. The word \"family\" is endlessly repeated until it bogs the story and the mind down. Even worse, the plot itself seems to exist only as a means of allowing the \"family\" message to thrive. The fact the puns with \"time\" and \"clock\" are equally endless doesn't help one bit. I've simply no time for them.\n\nAs for the characters, the only interesting one is the dog. But it's not nearly enough. If you're a big Spy Kids fan, you'll enjoy seeing Juni and Carmen all grown up. Again, it's too little. And to be honest, their presence doesn't help the plot at all. There's too many adult non-essential adult characters using up screen time.\n\nI've read other reviews and, trust me, this is not about grumpy adults who don't get it. Sure, some kids may like the movie. But that doesn't mean it's good. Just like adults like crappy movies that no younger person could enjoy, this is a movie that might be enjoyed by some kids, but that very, very few adults will be able to watch through until the end.\n\nTo summarize, adults might consider spending time with their family instead of watching Spy Kids IV. Or, you know, simply just watch a different movie..."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "dan181818",
        "review_rating": "1",
        "review_title": "Plain cheesiness for little kids",
        "review_detailed_main": "The movie itself was pretty awful. The plot, the CGI, the humor-everything. The idea to put in a couple of hotties may have got a few million profit, but still it was pretty cheesy. By the end of the movie, I just wanted to get away from all the clocks and gears in my sight. I mean, how was there a color video of an experiment in 1930? 1/10, unsuitable for everyone.. I don't suggest you \"waste your time\" on this movie. I hope there won't be an even worse \"Spy Kids 5\" . . . Because of movies like this kids start To think that planes can fly with one wing and that AI has already Been invented. I do not recommend this to anyone"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "MLDinTN",
        "review_rating": "3",
        "review_title": "only for 12 year olds",
        "review_detailed_main": "I remember when Spy Kids first came out. I really liked it. Of course, I was also a kid back then. This movie isn't for anyone over the age of 15. It's filled with barf and gas jokes, the older crowd will be just disgusted by it because they aren't funny. And there wasn't a whole lot of cool spy devices in this. Seeing a spy on a mission carrying her baby around is just too much on the silly side.\n\nThe dog was cute, he should have been the babysitter. Jeremy Piven wasn't much of a villain as Tick Tock. He's trying to steal time and as we find out it's because of his tragic childhood.\n\nFINAL VERDICT: Not worth it"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "EdwardNashtonReeves",
        "review_rating": "3",
        "review_title": "And I'm a Spy Kids fan!",
        "review_detailed_main": "What to say? Me and my brother (18) and his friend (also 18) went to the cinema and decided on Spy Kids 4D most based on our previous liking original 3 movies and the fact that 4D could only be interesting in cinema, not video. And so I expected a decent and fun children's flick, with warm message and lot of fun action.\n\nSo, I was ready to love this movie in a children's kind of way and to see the Spy Kids legacy was supposed to be fun. BUT, when I saw the movie, I was totally disappointed. It was awful. The real value of this pic is exactly that three stars that average ratings gave, but I gave it more due to my admiration for Rodriguez, Alexa Vega and Daryl Sabara. And seeing them all grown up and looking so cool and attractive was the best part of the movie, although their characters didn't do squat this time. They were kinda just... there, even more than Banderas and Gugino were before. But it was nice seeing them anyway. Although, for Alexa and Daryl fans out there, if you really wanna see them now in something worthy, go see Halloween, Repo or Machete.\n\nI know that the story is supposed to be bubbly and childish, but I think that they were totally out of proportion with plot-holes and defying gravity and common sense, for anyone older than 7. And there are many children's movies who are still innocent and fun, but far more realistic anyway. I didn't expect much realism anyway, but 30% of realism couldn't harm even the most imaginative films in the world. The talking dog-robot, shiny colors, gadgets who look more like MacDonalds toys than anything else (I suppose their replicas are supposed to be in promotion), ALL IS OK by me. BUT, I draw the line at villains WHO NEVER PUNCH OR TRY PUNCHING ANYONE, not even adult characters! They just stand there and wait to get hit!! Also, performances were OK, adequate for this kind of film, no one's acting was above or below the OK level. Jeremy Piven was actually really fun as the main villain (Gosh, I 'spoiled' the 'unpredictable' plot twist!) and his image was kinda cool.\n\nAnd I usually like kids, and I'm ready to defend them any day, but the little girl was SO ANNOYING!!! If she was an adult she would be called a name starting on B, no doubt. And the way she treated Jessica! I never thought I would say that, but she needed to get hers, and not her brother instead, who was kinda cute.\n\nEffects were decent, but 4D was awful! At least in my cinema. NOTHING was going out. Numbers couldn't be scratched out, just on them, and all smells were kinda similar, mostly like peppermint.\n\nAnd yeah... 'Spy Detector'... right! But I guess it is OK if you are 7."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "smckissock",
        "review_rating": "8",
        "review_title": "A Great Kids Film!",
        "review_detailed_main": "I think the film has been given a lot of negative reviews on IMDb but the intended audience is for children. I loved the film, the combination of new characters with the previous Cortez kids, to me, improved the film and made it a fun watch. There were a few moments that I found humorous and moments where I actually felt for the characters.\n\nJessica Alba (Susan Storm in Fantastic 4) was an amazing addition to the cast and really brought her character, Marissa, to life. Overall the acting was really good for such a young cast and the story line was different from the first 3 films but I believe the third spykids film (Game Over) was not a very good story line. This film is slightly dark at times but the quality of the film and the issues tackled within the story make it a fantastic watch.\n\nI think as a kids film it is pretty awesome and I loved watching it. I would definitely watch it again."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "fritzlang",
        "review_rating": "7",
        "review_title": "fun family film",
        "review_detailed_main": "I honestly do not understand the hate/low ratings of this movie.\n\nI took my 11 year old daughter, saw it in 3D and had a BLAST!\n\nIt was just a silly, fun film with lots of cool action scenes and a great message on how important it is to make the most of every minute, because you can never get time back.\n\nThe trailer pretty much sums up the movie, so I felt we got what we expected.\n\nI am not going to spend too much time on the plot - the trailer and other comments have done that pretty well.\n\nThe good:\n\n1) lots of action\n\n2) I was never bored - and based on the previous comments I really expected to be looking at my watch (pun intended) but never did.\n\n3) The message. I feel living in the 'now' is more important than ever before.\n\n4) Special effects, while nothing to win any awards, were both functional and frequently interesting.\n\n5) Having the original spy kids back (as adults) was a REAL treat, and - for me- the real highlight of the film. I kept thinking - why didn't they have Carmen as the mother and Juno as her brother that had to help fight the bad guys? They would have been SO much better!\n\n6) It was truly a FAMILY film! Not that many films I feel comfortable taking my child to, so that in itself was great.\n\nThe okay to bad:\n\n1) The aroma card was really, well, strange. It COULD have added something. But the #'s flashed on the screen so fast, and it was so hard to see the # and scratch it off, that by the time I was finished on one # it was already time to do another! I couldn't smell ANY difference between the smells, though my daughter definitely could! But it really didn't add anything.\n\n2) The dog. 90% of the jokes from this creature were just unfunny. I think one - maybe - two jokes made me smirk.. That as about it.\n\n3) The kids were okay, but definitely didn't have the appeal of the original spy kids.\n\n4) The high-voice time keeper REALLY got to me, it was so annoying!\n\n5) Jessica Alba was just so-so. Would have preferred to see the original Carmen in this role.\n\n6) The 3D was 'eh.' There were a LOT of times it COULD have been used to great 'in your face' effect, but never was. While it did add 'some' depth to the film, I felt the movie would have been just as fine in 2D.\n\n6) The husband and Jeremy Pliven were also - okay. Nothing special.\n\nThe ugly:\n\n1) Okay, I REALLY loved the message of the film. But did it have to be HAMMERED into our heads EVERY scene? I lost track of how many times I heard \"spend more time with you kids\" \"you can't get back time\" \"make every minute count\" etc. Subtlety this wasn't. I kept thinking that somehow this was an apology from the director to his kids for not being with them for some extended time. Have no insight into this, but it seemed that he felt he had to prove this point as hard as possible.\n\n2) The barf and poop jokes needed to go. Really.\n\n3) The time travel motif was WAY too confusing for kids - and even me! Unless you feel comfortable explaining the movie \"Primer\" to your child, be prepared for some MAJOR confusion. Time travel is difficult enough -they didn't have to make it even more complicated!\n\nAll in all, we enjoyed this film and there were some really fun scenes.\n\nI actually liked this a little better than #2 (never saw #3).\n\nNormally, I would say 'good film, but wait for the DVD,\" but I do think seeing it on the big screen helps - even in 2D.\n\n7/10"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "niks_yo",
        "review_rating": "1",
        "review_title": "Not worth the time",
        "review_detailed_main": "I adored the old spy kid movies and really looked forward to this one but the out of the box concept and the repeated irking TIME jokes, especially by the main villain, just lost the focus and the essence of the movie. Also the fact that the scenes just blared out the movie without proper direction and flow caused, at least me, to get annoyed and a bit perplexed within the first few minutes. It would have been better for the franchise if they had left it at the 3rd part or made kind of a spin off or something with some kind of side mission of Juni.\n\nSorry if I was too harsh but i just watched this movie and wanted to convey my point of view to somebody."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "neil-476",
        "review_rating": "",
        "review_title": "Farty fun for kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "badar-bdr",
        "review_rating": "1",
        "review_title": "Slows down your brain function, thats how bad it is!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "claudia_rocks_today",
        "review_rating": "1",
        "review_title": "Not expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "RichardSRussell-1",
        "review_rating": "2",
        "review_title": "I Hate You, Stepmom! Really Resent You. Can't Stand You. And Some Spy Stuff Thrown In.",
        "review_detailed_main": "Spy Kids [4]: All the Time in the World in 4D (1:29, PG, 3-D) — SF, 3rd string, sequel\n\nRobert Rodriguez seriously needs to set 4 = end for this series. It's lost any zip it may once have had.\n\nThe plot make Inspector Gadget look like Dostoyevsky, and the kid actors (Rowan Blanchard as Rebecca Wilson and Mason Cook as her hearing-impaired younger brother Cecil) are either painfully inept, badly directed (by Rodriguez), or both. Jessica Alba plays their stepmother Marissa, a retired spy, and the script totally beats to death the idea that Rebecca has never accepted her and continues to resent her, despite Marissa's plaintive overtures. Really, when I say they beat this theme to death, it's almost as if that was the primary plot of the movie, instead of what I guess was intended as a fun-filled romp with gadgets, talking robot dogs, a mad scientist, and Beagle Boy henchthugs.\n\nAlexa Vega and Daryl Sabara return as the now young-adult alumni spies from the previous movies. Corny dialog, preposterously cheap special effects, bright colors, blatantly badly choreographed fight scenes, and many other wink-wink-nudge-nudge, \"see how you're in on the joke\" corner cuts also make a return engagement, but it's as if everyone involved had been thru them a thousand times before, and the result is like overcooked celery: It just lies there, limp, soggy, and unappetizing.\n\nI write my reviews for adults, who should definitely, absolutely stay away from this turkey, but I can't imagine that kids of any age would find it interesting or exciting, either.\n\nThe 3-D was a post-production conversion hatchet job, probably the worst I've ever seen, and if for some reason you feel compelled to see it despite the above warnings, for heaven's sake save your money and see it in 2-D instead.\n\nOh, the 4th D in the title? It's supposed to be for Aroma-Scope, an 8-spot scratch-and-sniff card that apparently was distributed in some theaters so you could snuffle along with the story. I noticed that 1 numbered star flashed on screen (the \"scratch now\" cue) in company of the line \"Never underestimate the power of puke.\", and I was grateful that my theater hadn't provided me with the full 4D experience.\n\nWhy does it get a 2 instead of a 1? I did allude to Jessica Alba, right? Did I fail to mention the black-leather jumpsuit?"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "akshatmahajan",
        "review_rating": "4",
        "review_title": "Underwelming",
        "review_detailed_main": "The trilogy was silly and good in some way but this movie is neither entertaining nor enjoyable. Instead, it is just boring with forgettable story and characters. The story was average and ineffective, the screenplay was uneven, the direction was below average and the performances were not that good; you will neither enjoy nor connect with the characters.\n\nThe original spy duo also failed to make an impact. Other thing this movie was lacking was the family bond as shown in the original.\n\nOverall, you will not love this movie and I would recommend you to just watch the first two parts. They are enough to entertain you."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "scottthegoodfella",
        "review_rating": "4",
        "review_title": "Why such hate?",
        "review_detailed_main": "I just don't understand the common hatred this movie gets, it's nowhere near perfect, but what movie is? I've always enjoyed this franchise, especially Spy Kids 2. And honestly I found Spy Kids 3 to be more atrocious than this one, even though I still enjoy that as well. My daughter loves all 4 of these, and we visit this one the most. So in my opinion, this lives up to the name Spy Kids!"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "MB-reviewer185",
        "review_rating": "2",
        "review_title": "Spies saving time",
        "review_detailed_main": "The other three Spy Kids films were not good, but they were at least entertaining to watch; compared to the other three films, Spy Kids 4: All the Time in the World (2011) is the worst movie in the franchise. The movie Spy Kids 4: All the Time in the World (2011) was just annoying to watch and was hard to watch from beginning to end; I would rate this movie lower than what I am giving, but the movie is aimed at kids, and they might be entertained by this movie. Also, I think director Robert Rodriguez should do better movies than these Spy Kids movies like he has done in the past.\n\nThe new kids we follow named Cecil and Rebecca Wilson played by Mason Cook and Rowan Blanchard I am sure are doing their best with what they are given, but I hated these characters; they were very annoying, unlikable, and hard to watch. The parents played by Jessica Alba and Joel McHale are good actors, but they were too stupid in the movie, and the mom was not that convincing as a professional spy with the dad only showing up for certain scenes and the very end of the third act climax of the movie. Also, the mechanical talking dog named Argonaut voiced by Ricky Gervais was so annoying I wanted him to shut up because he would not stop talking with his stupid one liners and immature jokes that involves bathroom humor or fart jokes that I was getting tired of.\n\nThe villains named Tick Tock and Time Keeper played by Jeremy Piven standard; the villain Time Keeper was a standard villain that did not do much but want to manipulate time for a certain reason, and the villain Tick Tock had an annoying voice and made jokes about time that got annoying to listen to. The CGI effects are not good with the third act obviously taking place on a green screen that leaves no impact on anything; the gadgets had harmful effects and the humor is bathroom humor and fart jokes that are clearly aimed at children that might make them dumber while watching, but I merely hated when I was watching the movie from beginning to end.\n\nSpy Kids 4: All the Time in the World (2011) is the worst one in the franchise with bad acting, harmful effects, bad villains, bad humor, and characters who are hard to watch; this movie is clearly aimed at children, but some of them might like and others might be bored by it and the constant stuff it throws at the screen. I would recommend watching Spy Kids (2001) and Spy Kids 2: Island of Lost Dreams (2002), even Spy Kids 3: Game Over (2003) because those movies were at least entertaining to watch and was at least funny, while this movie was hard to watch and not funny at all."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Classic_Boxing_Matches",
        "review_rating": "5",
        "review_title": "\"No one ever notices time, until it's gone.\" - Tick Tock.",
        "review_detailed_main": "A couple children discover their step-mom was a spy and become unwitting targets of the super villians, Tick Tock and Timemaster.\n\nI've never seen any of the other Spy Kids films. I was in the generation where when the original trilogy came out (2001-2003) I was in high-school and the film was targeted at a much younger audience. However, I am a 3D aficionado so when Spy Kids 4-D came out I was very much aware of it but only got around to watching in on 3D bluray very recently. The film is extremely childish, its a kid film after all, but I actually didn't mind the premise of it and the child actors were surprisingly likable. The action scenes aren't anything to write home about but they were fun and it's very family friendly so long as you like fart and poo jokes. The cast was interesting and it had some great names in this like Jeremy Piven, Jessica Alba, Joel McHale and Ricky Gervais as a talking dog. They arnt exactly used to their fullest potential but as an adult, I appreciated the star power. Although the jokes are aimed at children and not overly funny to me, there is one or two which I genuinely laughed at such as Jessica Alba trying to look cool and bonnet slide across a car while pregnant and chasing a bad guy! And even though I have no nostalgic connection to the first 3 films, I appreciate the fact that they got the original child actors back (now both in their 20s at this time) to resume their characters. There is a little twist in the tail I didn't see coming in regards to the bad guys, the story wasn't as cut and dry as I had expected and I lobe it when a movie is unpredictable for good reasons. But the twist in the story also leads to one of the films biggest let downs - the kids play almost know role in the eventual ending, and argument can be made if the kids were never around the outcome of the story would of remained the same. Maybe I missed something though... but to me, the ending would of happened with or without them which is odd considering the film is named after them! The only other big let down is the overreliance on CGI backgrounds. They are not looking good or holding up that well after all these years... has a very fake look to it all and sometimes took me out of the film. The 3D was noticable and had a few gimmicky shots, but I don't feel it was as well utilized as it could of been. The smell-o-vision cards that came with the movie also didn't impress me. When the number flasher on screen that's the number your rub n sniff to help create the immersion of if you were actually there and could smell what they smelt but the numbers all ended up smelling the same anyway and I don't know if that's because the cards are old, spent too much time trapped in a bluray case together and tainted one another OR were they never that great to start with and all smelt the same anyway???\n\nFinal Verdict: As a kids action film, I think it's more than adequate and children under 10 or 11 should really enjoy it. It's easy to understand (mostly), plenty of cheap laughs for young ones and it has likable, relatable characters. For us adults, it's not fantastic but then again it's not for us! But I have to say, Jessica Alba, in a full body leather suit is a winner any day of the week ..."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "asinyne",
        "review_rating": "9",
        "review_title": "This is for kids and young of heart, not critics",
        "review_detailed_main": "I took my kid to this so I wouldn't have to sit through The Help. I wasn't bored and my kid liked it too. I have no idea what all these other people are whining about...its a kid movie that tries to throw in some humor for the older crowd. The smell thing was kinda dumb but it was a promotion gag...what did you expect...maybe you wanted to sniff real dog gas? Not me. OK, it probably doesn't really deserve a nine but I tried to make a point after seeing the stupid 2.8 rating that it sure as heck doesn't deserve. All you people canning this fun little flick need to get a life and maybe STOP GOING TO KIDS MOVIES IF YOU HATE THEM ALREADY. Heck, seeing Jessica Alba and the grown up hottie from the old spy kids movies was well worth the admission for me. Thank goodness I was able to talk my daughter into seeing this instead of The Help which everyone is TELLING YOU TO LIKE. Later film goers!"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Caesarboy5",
        "review_rating": "6",
        "review_title": "Not That Bad; Analysis of Rodriguez",
        "review_detailed_main": "This movie is a very interesting thing indeed. Most people have given it terrible reviews.... And I completely understand why. This film has a lot of bad going for it. But it somehow still works.\n\nIn my opinion, a bad film is a film that can't decently handle it's plot and pacing. The Room serves as a good example of a really bad film. Production comes second, which is what everyone is criticizing, and within reason.\n\nI think understanding this film all comes down to one thing: the director. Rodriguez is a good director and knows what he is doing (he made Sin City after all). The plot and script, while not to my taste (and with too many puns), work. Everything is tied up, the plot is consistent, and the lessons are learned without feeling forced.\n\nWhat makes the film really weird (emphasis on the word weird and not bad) is the production. The effects are really bad (and cheap) and the acting is just... Weird (there's no other word to describe it). The script is also just weird. Sort of \"trippy\" in a way. I felt like maybe the script writers were on some hardcore drugs at some points.\n\nObviously, though, that's not the case. Rodriguez was just having fun making an over the top kid's movie. He didn't take it seriously, and neither should the critics. I think the most important thing to find out is do kids like the movie. Because if they do, Rodriguez definitely achieved his goal and this film was a success. Unfortunately I have no idea since my younger cousins haven't actually seen it.\n\nWhy did I watch the film then, you ask. Curiosity on how one of my childhood movie sagas would continue. And in all honesty, while I haven't seen the originals in over a decade, I remember them a lot better. But maybe my expectations were just lower back then and this is a decent follow up.\n\nEither way, I give this film a 6 on 10. While the film has a strong script (as far as weird kid's movies scripts go), which makes the film watchable and definitely entertaining if the subject matter tickles your fancy, just everything else about it is a turn off for anyone but a kid. I would not recommend it to adults or teenagers. If you happen to have Netflix and are running out of good kids movies to occupy your child's mind, this isn't a bad choice. Otherwise, do not go out of your way to get this movie."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jeremyagrina",
        "review_rating": "1",
        "review_title": "DO NOT WATCH THIS FILM IF YOUR IQ IS ABOVE 50",
        "review_detailed_main": "This movie is a complete insult to anyone who watches its intelligence. It's like this movie was directed by the little kid secret agent that \"stars\" in it. Spy kids 1 was not a masterpiece but it had so many of those indescribable characteristics that makes a classic kids movie that we can all go back to for a laugh if we want to. In spy kids 4 the creators have taken the last thread of that nostalgia and perverted it into poop for the eye. I recommend that no one watch this movie if you consider yourself anything but stupid. For me, this is one of the worst movies ever made and that's including Troll 2 and Emoji movie."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "makes good on its promise, it's just that the results are uninspired",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Mysterygeneration",
        "review_rating": "3",
        "review_title": "A Forgettable Misfire that Fails to Recapture the Franchise's Former Glory",
        "review_detailed_main": "Spy Kids 4: All the Time in the World, despite its attempt to revive the once-popular franchise, falls flat with a lackluster storyline, uninspired performances, and a disconnect from the charm that characterized the earlier installments. The film introduces a new generation of spy kids, but the characters lack the charisma and depth that made the original Spy Kids films endearing. The attempt to blend action, comedy, and family dynamics feels forced, resulting in a jumbled narrative that struggles to find its footing.\n\nJessica Alba's performance as the lead spy mom lacks the gravitas and comedic timing required for a role that should anchor the film. The reliance on 4D gimmicks, such as scratch-and-sniff cards for the audience, adds little to the viewing experience and feels like a desperate attempt to compensate for the film's shortcomings. Spy Kids 4 ultimately fails to capture the magic of its predecessors, leaving audiences with a forgettable and disappointing addition to a once-beloved franchise."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "RECB3",
        "review_rating": "1",
        "review_title": "The Crew Did Not Spend Enough TIME In Creating This Film",
        "review_detailed_main": "I did not enjoy this film. The storyline needed more work. The series should have ended after the first two films. The cast selection was alright. This is not a great film at all for viewers. It simply is a real waste of time. There was so much room for improvement that the crew obviously missed. In my view, it did not look like the cast was fully committed to the storyline of this film. It messed up the storyline of the whole series. There were many parts that could have been created better. Viewers would not learn at all from watching this film. I did not enjoy watching this film. This film should not have been created."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "isalyer-18069",
        "review_rating": "1",
        "review_title": "An awful film.",
        "review_detailed_main": "The only reason I even watched this in the first place is because I noticed that Joel McHale was a cast member. I regret that decision, because I realized that I just wasted about 1 hour and 50 minutes of my life watching this uncomfortably bad, cheap, and terrible film. Do NOT watch this! It is most certainly not worth the time it takes to watch it."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Hayden-86055",
        "review_rating": "4",
        "review_title": "Pretty bad",
        "review_detailed_main": "Spy Kids 4 is an improvement on 3, so it at least gets credit for that. Unfortunately it is a rather bland adventure without the best acting, there are a couple of fun moments and children may enjoy.\n\nPlot is average and the acting from the main kids was actually not bad, I thought. And I have to admit the talking robot dog (played by the excellent Ricky Gervais) did get a couple of laughs out of me. Jessica Alba also gave a fine performance and the villain was not too bad, despite his weird squeaky voice, and had a decent backstory.\n\n4/10: Below average children's film, not particularly amazing in any category but it's not horrendous."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "adamprice-60108",
        "review_rating": "1",
        "review_title": "Probably the worst film I've seen in recent times.",
        "review_detailed_main": "I know it's for kids, but really.\n\nSomeone stumped up with $27 million dollars to make this load of rubbish, and some half decent actors actually saw the script and agreed to participate. I can't believe it."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "gianmarcoronconi",
        "review_rating": "2",
        "review_title": "Tremendous",
        "review_detailed_main": "This is not really a review, it should be taken more as a collection of impressions of the film.\n\nRevival of the saga of spies that could and should not have been done or at least shouldn't have been done so badly because I really appreciated this saga as a child and when I grew up, while recognizing its limits, I still appreciate it, but this fourth chapter is almost everything to throw away, the only nice things are the old actors who make the viewer experience a bit of nostalgia but besides them everything else is worth it. Obviously the special effects are very cartoony but the whole saga is made like this and so I'm not complaining, it's the plot which is terrible, very banal and without inventiveness, it doesn't even manage to be as nice as the predecessors of this film, truly a terrible waste of a really nice story."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "nimagumm",
        "review_rating": "2",
        "review_title": "Oh god. Put me out of my Misery",
        "review_detailed_main": "Seriously. What did I just watch?. Cringiest movie ever. I had to right this review down the millisecond the movie ended. I was watching with my siblings. We absolutely hated. Not funny. Terrible TERRIBLE CGI. This just couldn't get any better. If your a Sht movie enthusiast. Go ahead. Take a look. You'll love this one. Be sure not to die of cringe. Cuz this movie is disgustful."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "rawiri42",
        "review_rating": "6",
        "review_title": "Remember who you are!",
        "review_detailed_main": "There are lots of reviews about Spy Kids on here that are obviously written (I suppose) by adult movie buffs who criticice just about everything about it from an ADULT point of view. Come on people, this movie was made for kids - not for you! A rating of 3.4 is grossly unfair to the producers and the director and everyone who helped make a great movie for under-ten-year-olds. OK, it isn't the greatest kids' film of all time but it IS certainly worth more than that!\n\nI didn't have the benefit of 4D (or even 3D) at home and so I can only imagine how exciting it would have been on the big screen with all the latest technology thrown in. But I will happily watch it again with my grandkids - and I'll bet THEY will give it more than 3.4!\n\nFrom an adult point-of-view, I thought Ricky Gervais as Argonaut the dog was very funny - which, in itself was good because it just goes to show how funny he can be without needing to resort to profanity.\n\nI was very tempted to give Spy Kids a 10 out of 10 just to drag the average up a bit but then I figured one vote isn't going to make that much difference so I gave it what I really thought it was worth - a 6 (but then maybe I should have waited for my grandkids to tell me what they think it's worth). I'm looking forward to sharing it with them."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "boblipton",
        "review_rating": "5",
        "review_title": "A Bit Tired But Still Fun",
        "review_detailed_main": "Checking on the IMDB, I found viewers were upset because it's a movie made for five-year-olds. Yes indeed, it is, and visually striking and a lot of fun, as the next generation comes online.\n\nI have a soft spot for Robert Rodriguez' movies -- and not just because he has a cool first name -- ever since I talked a bunch of people into seeing EL MARIACHI; we had a fine time with its comedy elements, while the rest of the audience stared dourly at the screen at the Angelika expecting Cinema. Tio Tortuga is a genius, I tell you, and Rodriguez' efforts in making low-cost movies, using computers well, is a far more worthy use of my viewing time than seeing the latest Transformers garbage.\n\nThinking like a five-year-old for an hour or so is a pleasant occupation, I can tell you. And do."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "KingFarticus",
        "review_rating": "",
        "review_title": "just beyond garbage.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "tafariahd",
        "review_rating": "3",
        "review_title": "Incredibly disappointing",
        "review_detailed_main": "As a fan of the first two films, I went into this really hoping that Rodriguez had learned from his mistakes from the third one and use them to make improvements but unfortunately, this is the worst one yet."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Kamurai25",
        "review_rating": "5",
        "review_title": "\"Spy Hunter: The Hunt for Mommy\"",
        "review_detailed_main": "Decent watch at best, probably won't watch again, and can only recommend for younger audiences.\n\nWell, they definitely managed to get weirder by using time dilation and time travel, it's the worst. Time travel is way too deep a concept to do properly in children's entertainment, but, that said, they did a decent job of dumbing it down so maybe some of the kids could grasp it.\n\nAgain, it weird to see big celebrities come in when I don't think kids would appreciate it, especially Jeremy Piven, who I know is hard to get signed onto a movie.\n\nAgain, they spent a lot of time on weird effects or yada-yadaing through a sequence instead of concentrating on a movie of substance.\n\nAdmittedly the deliveries were pretty good, and the script was alright, despite including time travel, but with all the time spent on the dog, and avoiding action or spending too little time building a scene, the movie evens out with there being less interesting things that good.\n\nI think kids will get into, and find a lot of the movie, especially that poor dog, hilarious."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "TheMysteriousReviewer",
        "review_rating": "2",
        "review_title": "The Worst Spy Kids Film",
        "review_detailed_main": "Spy Kids: All The Time In The World goes even lower than the previous two to the point of being unbearable. I'll admit the one and only redeeming quality is at least it's not like the third film and unfinished. But it doesn't forgive everything else is unfunny in so many levels. From my view, I never once either laughed or even chuckled. The film is filled with disgusting jokes and awful gadgets. The story has came out broken down and a disaster. It does not have a proper continuation after the trilogy. The action in this movie is completely outdated and cringy. The logic in this movie makes absolutely no sense. The visuals look like it cannot be afforded to upgrade considering this is the lowest budget of the franchise. And the characters are completely unappealing and have little to nothing to put effort into. Do I really need to say something to anyone? Don't watch this movie. I'm not even sure if fans of the trilogy are gonna like this as much. Because this is one of the most soulless films I've seen in my life that doesn't want to continue its story. So please, stay away from this movie. I'm not afraid to admit, the franchise is better off to stop right here. In fact, it should've been a stand-alone film. Because Spy Kids is an example that would be fun for the kids. But with the sequels, they've gotten stupider and stupider and stupider. And this brings the franchise to an entire new low. This thing even feels it's the end of the world for the franchise."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "ThereelscoopwithKK",
        "review_rating": "1",
        "review_title": "Clearly Needed More Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "TheUnknownReviewer",
        "review_rating": "1",
        "review_title": "The Spy Kids Franchise Should Have Stopped At The Third Movie!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jaemiewaters",
        "review_rating": "10",
        "review_title": "great",
        "review_detailed_main": "it was great the 4d rocks it was funny it was cool, it was fun it was packet you will like this movie a lot it was a really good movie to see it was a good 3d movie i think you will like it too it was funny i think it was a blast go see it today before it gets sold out i really enjoyed it you will too it was a silly movie it was i enjoyed it so much i give it a 4 to of 4 stars that is how good it is it was the best spy kids move ever it was the bomb to watch to see to smell it is the best popcorn movie you could see it was a really funny movie for the family to see it was better than glee 3d it was better than toy story it was better than toy story 2 it was better than toy story 3 it was funny you will have to see because if you don't you missed out on this good movie it was really funny you will see 3d the whole way though the it was great for everyone whole movie to see it was a blast to see it in 3d it was just a good movie you will like it a lot because it was just a good movie to see it was funny it was silly it was stupid my mom said it was for kids but i loved it a lot it was a really good movie i enjoyed it a lot and you will like it too it was funny it was so good it was funny it was a great 4d movie it was a great 3d movie you will like it was so good it was a funny fun movie to see go see it today before it gets to be a sold out movie it was really really good 3d movie you will like it a lot it was a great 4d movie to see you people\n\nwill like it a lot go see it today it is a funny funny funny movie you will like it so much it is a 4 star movie by me 3 stars by my mom it was a hoot it was a really good movie this was the best movie i saw this year please hit yes that you liked my review it was a blast it felt if you ware in the movie it was a movie that should play for a year it was a funny funny funny funny movie to see it was a funny movie i hope you enjoy it i like this movie in 4D a lot and the 3D was good"
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "melimelo-3",
        "review_rating": "",
        "review_title": "Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "absolutemellow-12402",
        "review_rating": "8",
        "review_title": "10 years later",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "T_ana",
        "review_rating": "7",
        "review_title": "A family movie with good core values",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "derek-511",
        "review_rating": "",
        "review_title": "The children really enjoyed this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "icepenguinoooo",
        "review_rating": "10",
        "review_title": "Great with friends",
        "review_detailed_main": "If you like among us jokes you'll like this movie. As long as you watch this movie with some friends with objectively bad humor its a great time. The dog is a great prop at some points, especially with the void black eyes."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Joejoesan",
        "review_rating": "",
        "review_title": "It's okay family fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "abousamraadel",
        "review_rating": "10",
        "review_title": "Childhood favorite movie",
        "review_detailed_main": "I really don't get the hate and all these low reviews. I was shocked, when i was young and growing up i loved this movie and i kept on watching it and now coming back to it i saw the low reviews and i'm so confused. I still love the movie and it's only movie i watched in the sequel maybe i'll watch the rest but for now and from what i can remeber this was one of my favorite movies. I can tell many of the reviews were from old people who didn't really understand it and didn't like it.\n\nEach to their own but I loved it when i was young and i still love it now. I will watch it again now. 10/10. The little gadgets are the best and talking dog, the room they were forced to be in together with so much bowls of chips and stuff. A tv and so much, i always wished i could just be there and i still do. Ah this film brings back memories so many. I still find the diaper throws funny and when the bottle falls and she grabs it with her foot last second is amazing. HOW ON EARTH ARE YALL rating it this low 2011 people ..."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "dtucker86",
        "review_rating": "",
        "review_title": "Pants poopingly awful?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "jan-biebaut",
        "review_rating": "8",
        "review_title": "Don't be mistaken it is a movie for kids",
        "review_detailed_main": "And my son adored it so an eight is only fair. Asking him it would have been 1.000.000 points but you have to understand through the eyes of a child, like in the movie."
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "edwbur",
        "review_rating": "",
        "review_title": "entertaining. better than i thought it would be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "JohnDeSando",
        "review_rating": "",
        "review_title": "It smells . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "Quietb-1",
        "review_rating": "",
        "review_title": "Makes time stand still.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "estreet-eva",
        "review_rating": "",
        "review_title": "Way too ambitious for a sequel in a bad franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1517489",
        "movie_name": "Spy Kids 4: All the Time in the World",
        "movie_rating": "3.6",
        "review_username": "gavin6942",
        "review_rating": "",
        "review_title": "Not Particularly Enjoyable Film",
        "review_detailed_main": ""
    }
]