[
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "sidharthgupta",
        "review_rating": "7",
        "review_title": "The Lion Returns",
        "review_detailed_main": "Looking at the remakes in The Hindi film industry I can say Rohit she tty knows how to woo the audience. Yet another successful sequel of a south Indian film remake and the result is overwhelming. Ajay Devgnn is at his best and complemented by Amol Gupte and for a comic role Daya (CID Door Banger) and Kareena played the trick. The action scenes are really good unlike some of the movies where there is slow motion action picked scenes. Talking of storyline, Rohit Shetty tried a new wine in the same bottle and succeeded in creating a good , enjoyable movie. I personally enjoyed the theme music which is the same from Singham 1. I will give it a 7 star rating and is a good watch."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "jmoneyjohal",
        "review_rating": "5",
        "review_title": "The lions meows this time but Devgn does not disappoint",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "vegetarulzagain",
        "review_rating": "5",
        "review_title": "Achieves what it tries to. Nothing more!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "adityamestry16",
        "review_rating": "7",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "Singham Returns & How!",
        "review_detailed_main": "Singham back in 2011 packed a punch, with the Combo of Rohit Shetty & Ajay Devgn proving successful. And with 'Singham Returns', the deathly Combo strikes back & how! This Sequel is power-packed, explosive entertainment!\n\n'Singham Returns' Synopsis: Owing to the wrongdoings affiliated with evils similar to black money, an honest but ferocious police officer returns as the Deputy Commissioner of Police with the prospect of wiping out injustice.\n\n'Singham Returns' rests on an outdated plot, no doubt, the battle between the Good & Bad has been witnessed on the big-screen an umpteen number of times, but Shetty's Crisp Execution to the material, Yunus Sajawal's Fast-Paced Screeenplay, Maddening Action-Sequences & Devgn's electrifying performance as the ferocious cop, take this sequel to dizzy heights.\n\nThe film is fast-paced & the explosive action-sequences leave a solid impact. The first-hour is well-handled, however, the romantic-track is a yawn. And Kareena Kapoor Khan's hammy performance also doesn't help. This track could've been trimmed, if not removed. But, The second-hour is unstoppable. Its consistently engaging & the clap-worthy climax is top-notch.\n\nSajawal's Screenplay does not boast novelty, but its one ride! A special mention for the enjoyable dialogue. Shetty's Direction is crisp. He has handled the film with tremendous force. Cinematography is perfect. Editing is sharp. Action-Sequences are maddening! Music by Various Artists is wonderful.\n\nPerformance-Wise: Ajay delivers an electrifying performance as Singham. The intensity & power he displays on-screen, is simply amazing. He's the life of the film. Kareena Kapoor Khan hams. Amole Gupte is marvelous as the despicable villain. He's loathsome all through! Zakhir Hussain, too, is quite menacing. Anupam Kher is effortless in a small, but significant role. Mahesh Manjrekar is decent. Dayanand Shetty is super. Sharat Saxena stands out in a cameo. Others lend the required support.\n\nOn the whole, 'Singham Returns' is power-packed! Go, Have Fun!"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "usyoume",
        "review_rating": "4",
        "review_title": "typical rohit shetty entertainment movie... IGNORABLE",
        "review_detailed_main": "If you are expecting something new in this second part of Singham, then you will be totally disappointed like me.\n\nThere's nothing great about story and script, its average. Kareena Kapoor is okay to watch. Amol Gupte is good but not excellent.And Daya is doing only fighting.\n\nDialogues are not good as they were in the first part. You can predict almost the movie, except the end, which is again tried to be similar as of first part of the movie.\n\nIf you like seeing some bullshit fight scenes, almost duplicate macho dialogues as were in first part, if you like to see Kareena Kapoor's similar role as of golmaal 3, if you like to listen below mediocre music, want to see again Ajay Devgan killing bad people like one man army... then of course, this movie is totally for you!!"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "Ansango",
        "review_rating": "7",
        "review_title": "A step down from the first",
        "review_detailed_main": "I liked singham very much so my expectations with this movie were very high.Upto some extents this movie fulfilled my expectations.This movie was not completely boring as well as was not very great but was entertaining.The story was nothing new but its approach is fresh.Good cop fighting against corruption is certainly not a new idea and we have watched it before many times on silver screen still it looks fresh.Rohit shetty's movies are known for their fun and excitement but this movie lacks it.Comedy is the worst part of this movie followed by its music.The film is filled with action scenes for which proper situations has not been created that's why after sometimes they feel irritating.In acting AJ was just OK.The aggression which he showed in Singham was superb but this time he misses it.Kareena was very bad.She overacted too much.Her hammy acting was SO irritating.Climax of the movie was unbelievably over the top.The plot also contained some plot holes but could be forgot because screenplay is smooth and keeps you entertained.I never felt boring while watching it.I loved the music of Singham but this movie is too weak in this department.Rohit shetty has always made mindless but entertaining movies appealing to masses as well as classes and this movie is no exception but this movie lacks the trademark humour present in rohit's movies which makes it a little weaker as compared to his previous films.Still it is an enjoyable movie for action lovers.If you are an AJ's fan then you will surely like it. RATING : 6.9 out of 10"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "skarmoker23",
        "review_rating": "2",
        "review_title": "Very poor film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "achyutaghosh",
        "review_rating": "6",
        "review_title": "More of the same",
        "review_detailed_main": "Crash. Boom. Bang. Dialogues. Angry but well intentioned cops, evil and slimy politicians. Earth shattering music. Irrelevant dance numbers. Slow motion walks. Physics defying stunts. Never ending guns. Speeding cars. Even flying cars. More crash boom bang. Recognize the flow? That is any modern mas-ala Hindi movie, specifically of the Rohit Shetty variety. Other than the settings and the heroine, there is virtually nothing different in Singham Returns over Singham.\n\nAjay Devgn is back as super-cop Bajirao Singham, and he is going to clean up Mumbai of all evil by any means possible, whether that means going undercover, or showing up in underclothes, or by indulging in wanton lawlessness himself. Guruji (Anupam Kher) is a virtuous politician, his idealistic agenda takes the best of all current political parties- BJP's development agenda, AAP's corruption, and Congress's woman empowerment, and drives involvement of today's youth in politics. Opposing him is a political-religious nexus, fronted by Amol Gupte's Asaram Bapu styled sleazy god-man, Babaji and Zakir Hussain's Prakashrao.\n\nWhen one of Singham's compatriots is found dead with a large stash of cash, the standard hero versus villain storyline takes over. He also has to play lover-boy to Kareena Kapoor's near mental character Avni, deliver whistle inducing dialogs, position himself as the solution to all the problems that beset India, lead a ludicrous police uprising which involves the 47,000 strong Mumbai police force going shirtless, and deliver his own brand of justice, which includes shooting folks in their bums. Twice.\n\nAjay and Rohit are a hit combination, whether the nonsensical Golmaal or the all too serious Singham series. This is an out and out Ajay Devgn show, and he is in roaring form, after the monstrosity that was Himmatwala. It helps that the script gives him a tailor made role to shine in all his brooding glory, and topics that the audience will relate to easily- black money and divisive politics. Ajay is permanently in Hulk mode, however, it is the vigilante like message that is worrisome. We see the police as the most effective arm of the system, but are they that honest and so utterly frustrated that they need to take the law in their own hands?\n\nBut the movie does not disappoint on the action front. There is some great choreography and stunt-work, so long we have established that Devgn's guns never run out of bullets, and he can still manage 20 bad guys on his own. The comedic moments are genuinely bad, and gluttony being Avni's standout quality so we can understand how poorly written her character is, but Amol Gupte's Babaji is hilariously hammy, while for TV fans, there is CID's Daya in a meaty role.\n\nSingham Returns is yet another movie that espouses the thought that the only solution to crime is violence. Good idea? No. Entertaining? Maybe for some. Must watch? No."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "akiondgme",
        "review_rating": "5",
        "review_title": "Singham 3 should do the justice to Singham fans",
        "review_detailed_main": "The script of the film is poor, lack of kick and not convincing(compared to Singham 1). Sure there are some masculine dialogs by Ajay Devgan. But the unsteady and senseless script make the film a below average and kind of boring one.\n\nAjay Devgan is the main reason for this film to be a commercially successful one. He does his part as expected and the police people work with him do their job too.\n\nThe character of Kareena Kapoor is pointless. By using her it is tried to create some humor forcefully. But it has not happened. This makes the film boring because she is the 'main actress' of the film.\n\nI think the character of 'Baba' is the worst object of the film. It is ridiculous how easily he can deceive people. His character is not properly built as the main villain.\n\nIt is very unnatural how the villains act like jokers when they are caught(happened in the Singahm 1 too).\n\nSo we hope 'Singham 3' will be a film with a better script, good main actress and a good villain(Basically like Singham 1)"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "doctanwani94",
        "review_rating": "8",
        "review_title": "bajirao singham back with a Bang......",
        "review_detailed_main": "This time singham (ajay devgan) returns as deputy commissioner of police. The movie gets more good with supporting actors like anupam kher, kareena kapoor and Daya.... the fight is not against one villain its about one honest and fearless officer tackles with politics people. the dailogue screen play and stunts are great as usual for which Rohit Shetty (director) is known. kareena plays role of girl in love with ajay devgan and girl who is full of fun. The fight against evil is not tough but singam leaves nothing to win this battle to wipe out crime. And one should not forget his famous dialogue ''Aataa Majhi Satakli''..its complete entertainment for audience who loves fighting with little comic thing. In a nutshell it is a movie that one should not miss...."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "tejasghalsasi",
        "review_rating": "7",
        "review_title": "More Fun ! More Action !",
        "review_detailed_main": "Its definitely better than the 1st singham. it has lots of action and meaningful story. Kareena Kapoor definitely has performed better than kajal aggrawal. Ajay Devgan has played his part pretty well. He by-far outperforms everyone. Daya! God hes the sweet inclusion in the film taken as it is from the CID franchise. He's done pretty well too. The film is watchable , a small part of it felt boring but overall its pretty entertaining.. The plot involves a lot of twists and action packed which will entertain u throughout. BEWARE!!There's a stupid honeysingh song at the end which will give u a headache . Please avoid it at all costs!! Leave the Theater as soon as the movie ends and do not wait fr credits. Its the most bullshit song till date."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "silvan-desouza",
        "review_rating": "3",
        "review_title": "Old Wine in New Bottle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "mrohan-56380",
        "review_rating": "7",
        "review_title": "An eye opener to the gullible audience",
        "review_detailed_main": "We have read and seen Ramayana for years together,there is a part where Raavan disguises himself as a priest to abduct Sita and Sita falls into his trap too. This is what this movie depicts and it has happened in real-life also. When i saw this movie in a multiplex, this is what struck me saying that, there are Raavans in real life too disguising as priests and doing atrocious activities. The movie had a OK storyline as it was more of CID without ACP Pradyuman and Abhijeet. Daya pulled off really well playing a role of the cop just like in CID. Eye openers to youth and old alike. More than the main cast, i liked Anupam Kher, i idolized his character a lot.It's a must watch for our Indians."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "anupapu8",
        "review_rating": "6",
        "review_title": "Rohit Shetty only wants money nothing more....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "advaitkamat",
        "review_rating": "3",
        "review_title": "Positively dreadful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "dpkbalaji-84-427326",
        "review_rating": "7",
        "review_title": "Singham Roars!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "bobbysing",
        "review_rating": "3",
        "review_title": "Gives a clear message that sequels should strictly be made only if you have got something novel to add.",
        "review_detailed_main": "The first thought I had after watching SINGHAM RETURNS was, that is this really a Rohit Shetty film? The hit-machine's latest project with no spirited highs, no great entertaining moments, no jaw dropping action and all repeated seen before stuff served uninterestingly? Or to put it in different words, a product unlike Shetty, which was supposed to be a power packed entertaining explosion but sadly keeps dropping constantly till the end with no exceptional climax which was actually the USP of its first part.\n\nIn short I found only three positive points in SINGHAM RETURNS. One the repetitive yet spirited performance of Ajay Devgun, second (thankfully) only two mediocre songs in the narrative and most importantly one particular sequence guiding the viewers about how a lady can only be arrested by the lady police officers alone as per the strict law.\n\nBut apart from that, frankly I found nothing to be discussed in details as there is no novelty in the story progression at all and other than Ajay Devgun (and to some extent Mahesh Manjrekar & Anupam Kher) not even a single actor comes up with a worth mentioning act to be straight. In fact the two villains Amol Gupte and Zakir Hussain never seem to be any kind of powerful opponents as compared to Prakash Raj witnessed in the earlier part and no-one else in the supporting cast gets the attention of its writers too. Kareena remains the usual glamour doll in all forced in sequences falling flat and their love doesn't even seem to be a part of the film throughout.\n\nHence this time Rohit is not well equipped with many enjoyable peaks in his script and the film keeps moving at the same level with no major twists & turns (with an excessive use of Marathi) shattering all reputation built by the director's earlier blockbusters. The action isn't any step ahead than his previous works and neither are the dialogues which formed the backbone of SINGHAM as everyone strongly remembers. Moreover both the cinematography and background score continuously give you an impression of 'Deja Vu' with nothing fresh or path breaking. So the part two is not able to surpass its prequel by any standards (including the scale) and putting it rightly this can easily be stated as a step backward, both in terms of execution as well as entertainment offered to its viewers.\n\nHowever with SINGHAM RETURNS, Rohit strangely tries to walk on the path of Madhur Bhandarkar in a different way by mocking few known personalities like Smriti Irani, Barkha Dutt, Asaram Bapu, a major political party and its leaders. The basic plot line reminded me of Chiranjeevi's PRATIBANDH released in 1990 and the climax made me recall Rupa's undergarments advertisement hilariously. The famous Daya from the never ending serial CID continues breaking the doors in the film too and it sounded quite weird to hear a devotional kind of song calling for the Almighty's help (at the Dargah) made purely like a love ballad with all slow western beats instead of a traditional Indianised rhythm.\n\nWith a more than 140 minutes of duration, the film becomes all predictable and boring towards the end. Because of which as the Honey Singh song's started playing along with the credits, I was also whispering the same words in desperation saying Aata Majhi Satakli\u0085\u0085\u0085.in literal sense!\n\nSo ending with a request to the reputed film-makers, the trend of sequel is acceptable only if the Part Twos and Threes have something novel, better and substantial to give to the viewers expecting a lot. Therefore please make any sequel only when you have got some newness to add to the hit concept, otherwise let it be."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "ahwaan_padhee",
        "review_rating": "7",
        "review_title": "Singham Returns Movie Review",
        "review_detailed_main": "\"Darwaza tod do Daya!!\" roars the scathed lion, DCP Bajirao Singham to his burly assistant and within seconds, the locked door hiding the horrified baddies is decimated into pieces. The ballistic combo of Devgan and Shetty is back ! And this time, it's bigger and deadlier. Rohit Shetty's Singham Returns takes us back to the Bollywood of 80s which was characterized by formulaic plot, over-dramatic dialogues and emotional outbursts which didn't require any mental exertion.\n\nIt's evident that Shetty wants to make Singham an enviable franchise. More importantly, it projects the protagonist, Singham(Ajay Devgan) in the larger-than-life avatar who takes on the corrupt system replete with conniving politicians and a sleazy, malicious Baba. It's the same old fight of good vs evil. Goodness is in the form of an unflinchingly honest leader ,Guruji(Anupam Kher) whose party has a vision of a corruption-free nation through the synergy of fervor of the youth and experience of the old. With a money scam demeaning an innocent constable under Singham's stable and the subsequent killing of Guruji, Singham swears vengeance! And Aai-Shapath, he vanquishes enemies with gusto and swagger.\n\nShetty has all the trappings of a commercial blockbuster in the sequel. While the action sequences are of volcanic proportions, he connects with the pulse of the masses through a hard-hitting social message that triggers even the conscience of the dead with dynamite dialogues (Sajid Farhad).Some of the scenes involving the plight of the poor is bound to move you emotionally. Shetty's signature car-blasts, explosions, deafening bullet-combats and aerial shots act as testimonial for the technical superiority and production values. Shot at real locations like the Mahim Dargah and Gateway of India, the concrete jungle of Mumbai is beautifully depicted with occasional escapades to the lush greeneries for some romantic interludes. An overdose of Marathi lingo and rudimentary screenplay might irk you at times. Nevertheless, the glorification of Mumbai Police comes out magnificently!\n\nAt the helm of affairs is a beefed-up Devgan delivering a power-packed act.'Main Leta nahin Deta hoon' is his new mantra which is bound to garner whistles and claps. Kareena,aka lady Singham shines in the comic moments and shows a natural flair for humor. She looks glamorous and her costumes would make good fashion statements. The film draws voluminous support from the ensemble of accomplished actors - Amol Gupte as the corrupt god-man, Zakir Hussain as the rival politician, Sarad Saxena as the principled Police Commissioner, Mahesh Manjrekar as the righteous CM are convincing in their respective parts.\n\nIt goes without saying that Shetty's school of cinema should not be taken too seriously. With fultoo entertainment being the focus,Singham Returns definitely is a money-spinner which would certify itself as another member in the 200-Cr club !"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "nairtejas",
        "review_rating": "1",
        "review_title": "Spare The Horror. ♦ 14%",
        "review_detailed_main": "The film gradually builds up to become a torture.\n\nIf you have watched Singham, then consider that you have watched Singham Returns as well, because other than few character build ups and Devgn's weight loss, nothing has changed in the film filled with explosions, gunfires and cliché.\n\nIt is a good example of \"been there, done that\" type of cinema which uses the same old technique of storytelling about a grumpy villain and a crowd-backed hero. And at the end, we all know who wins. While Ajay Devgn is average as the titular hero, I may totally stop watching future Kareena Kapoor films.Jab We Met was fine, but her over- acting shoots up the star here, annoying as ever when she shares the screen space. Amol Gupte is fine, although I hated his non-vindictive character who looks more like a joker.\n\nThe blame is on the writers for creating half-baked characters who fool around with the janta who are both shrewd and dumb at the same time. It samples various current affair elements but provides no explanation or solution, other than violence and selfish righteousness. I can understand the emotion behind the film-making and releasing it on Independence Day, but when the plot lacks substance and logic, deviating extensively from reality, I wonder if the definition of cinema has not been understood by the makers.\n\nIt is a crime in itself in expecting good stuff from Rohit Shetty, but after the prequel, I was expecting something powerful from this franchise. I also don't know whether it is an exact remake of the Tamil version, but hell, I don't even care anymore. The first half is average, but the scenes after the interval is either the chants of \"Singham, Singham\" played as Devgn walks here and there or eye-straining melodrama. And what's with the superficial touch of Marathi and its infamous expletives?\n\nBOTTOM LINE: There's not a single point that I can write about this film that will stand as a reason for me to recommend it. And if it's the Indian Constitution's IPC or CrPC that you are interested in, why don't you buy the book and spare this horror?\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "Aata Maji Satakli!! SINGHAM RETURNS is a mind-blowing thriller!!!",
        "review_detailed_main": "Many movies have showcased us about the police and the chain of events they face in their daily lives! But no one has shown it with such compassion, intensity and strikingly than what Rohit Shetty had shown us in SINGHAM (2011). And now again, he comes up with another sequel and one of the most anticipated films of the year: SINGHAM RETURNS! When the spectators will go to watch the film, they would have only one question in mind: Will SINGHAM RETURNS be able to surpass and deliver more entertainment than its predecessor? Let's find out:\n\nStory: The story is set in Mumbai where Bajirao Singham (Ajay Devgan) now D.C.P (Deputy Commissioner Of Police) tries to eliminate crime with his own methods which brings his influence to many people! But the stake he would face this time would be more challenging and will he be able to fight it back or resist it covers the rest of the film!\n\nCast: Ajay Devgan: Ajay is in top form yet again! He has played a cop who possesses remarkable qualities like determination, resourcefulness, influence and toughness with such dedication! The intensity that he delivers truly proves that he is a star performer! In short, SINGHAM is incomplete and vague without Ajay Devgan! Another smashing performance!\n\nKareena Kapoor Khan: She has a limited screen presence but the effort that she puts in playing a fun-loving and bubbly girl is truly adorable and admirable! She has the power to stand on her own feet!\n\nAmole Gupte: This actor has made a refreshing comeback in the film! his dialogues is another fact that adds to the power of the film! He pulls his negative character with efficiency! If you liked his performance in KAMINEY (2009), then you would surely like him in this one also!\n\nAnupam Kher: He is just remarkable! Although having a limited role, his quality of acting is just like an icing on the cake! Another commendable performance!\n\nZakir Hussain: His acting is quite good and he compliments very well especially in scenes with Amole GUpte!\n\nDirection: Rohit Shetty as we all know is the master of film-making! His effort was truly wonderful especially when he made the predecessor and now has delivered yet another power-packed film!! The screenplay and the story is riveting and absorbing! Dialogues are also charming and the writing is truly striking! And the action moments are incomplete without the blasting of cars which is formula in every movie that he has delivered and let me tell you, the actions in this film are truly jaw-dropping and more powerful than the predecessor!! Way to go Rohit and keep making these powerful films!\n\nMusic: The music is although very less as compared to its predecessor but with the exception of 2 songs which are truly remarkable: \"Aata Maji Satakli\" which is a rage among people as it is composed and sung by \"Yo Yo Honey Singh\" and \"Kuch Toh Hua Hai\" which is so melodious and a soulful song!\n\nOverall Verdict: On the whole, SINGHAM RETURNS is a hi-octane thriller with jaw- dropping actions, powerhouse dialouges and smashing performances especially by Ajay Devgan who is the soul of the film! And it has the trademark of one and only Rohit Shetty who has given a powerful film once again! It will shatter the records of its predecessor and is a sure-shot blockbuster! Go, join the fight!\n\nRating:****"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "shiraj-dakshy",
        "review_rating": "7",
        "review_title": "A complete Rohit Shetty masala fare",
        "review_detailed_main": "There are some movies which defy all logic but still you enjoy it and \"Singham Returns\" is one such movie\u0085 The movie begins with a startling message \"There are only 47000 people employed in the Mumbai Police force to protect 1.85 cr civilians of Mumbai\", this message actually started me thinking. Well this movie is Rohit Shetty's tribute to Mumbai Police.\n\nThis time Bajirao Singham (Ajay Devgn) is posted in Mumbai where he finds himself in between political tussle between Guruji's (Anupam Kher) party and their coalition party headed by Prakash Rao (Zakir Hussain). Prakash Rao has a strong backing in the form of Baba (Amol Gupte) who runs an Ashram which finances Prakash Rao's party. Things turn worse for Singham when a constable of his team is found dead in an ambulance with heaps of cash. How Singham solves the mystery of his constable's death and brings law and order in Mumbai forms the rest of the movie.\n\nStory by Rohit Shetty tries to touch upon issue from corrupt politicians with black money to God man and politician nexus, and the role of a policeman and their sacrifices which keep the civilians safe. Screenplay by Yunus Sajawal is packed with clichéd situations of how police are puppets in the hands of the politicians, but where Sajawal's screenplay differs is the way the police is shown to solve the issue, though a bit too far-fetched especially the climax, still it conveys a very strong message. Some sequences stand out like the dead constable's wife is forced to work as a domestic help to run the household expenses or when a women lambastes Singham when he beats his son for taking money from the corrupt politician. I thought the villain's characters were too much of a caricature especially Baba's. Overall the screenplay is tight and crisp but with enough cinematic liberties.\n\nWhat elevates the screenplay are the impactful dialogues by Sajid-Farhad, some of the dialogues are clearly for the gallery and gets enough whistles.\n\nAjay Devgn as Bajirao Singham again gives an impactful performance or should I say a seeti maar performance with his trademark dialogue from the previous Singham \"Atta Mazhi Satakli\", well in some scenes Ajay goes a bit overboard but looking at the response of the crowd I should say it was worth it. Kareena as Avni has nothing much to do other than looking pretty and mouthing some comic dialogues, I think Kareena should take a break from the bubbly roles that she is portraying since \"Jab We Met\" days. Amol Gupte's portrayal as Baba goes overboard and he hams all throughout the movie. Zakir Hussain as Prakash Rao is a caricature, which even an actor of his caliber could not salvage as the writing is weak. The rest of the ensemble cast Anupam Kher, Mahesh Manjrekar, Ashwini Kalsekar, Dayanand Shetty, Sharat Saxena, Savita Joshi do a good job, though I felt Govind Namdeo as Singham's father is wasted.\n\nAction is a highlight of all Rohit Shetty movies, and this movie does not disappoint. Action designed by Rohit himself in collaboration with Jai Singh Nijjar and Suneil Rodrigues is filled with cars being blown, people flying and enough fisticuffs to keep the adrenalin rush and Dolby Sound blaring. Overall the action is typical Rohit Shetty style which an audience expects from his movies.\n\nCinematography by Dudley captures Mumbai well and the aerial shots and action sequences are worth a mention. Music is a big disappointment although it had an impressive lineup of composers from Jeet Ganguli, Ankit Tiwari, Meet Bros and Yo Yo Honey Singh. Rather Yo Yo Honey Singh's song \"Atta Majhi Satakli\" sounds like a rip off from \"Lungi Dance\".\n\nRohit Shetty clearly plays to the gallery and the masses and gives a paisa vasool entertainer worth an addition to the 100 crore club."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "mp2877168-140-116396",
        "review_rating": "1",
        "review_title": "Nonsense movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "prashantsaini76",
        "review_rating": "7",
        "review_title": "Replica of earlier Version i.e Singham (2011) Movie...but a one time watch",
        "review_detailed_main": "Talking about story: Bajirao Singham (Ajay Devgn) is still the strict, disciplined cop who believes in changing the society more than punishing. He has his own norms of functioning but it is expected of him that he tones down. Afterall, the supercop is now posted in Mumbai. He is given the responsibility of providing protection to Guruji, a political stalwart who dies under his custody.\n\nSoon after, his head constable is found with crores of rupees in a van, dead! Singham traces all of this to the alliance party who weren't satisfied with the main party's agenda of supporting youth power in politics. He wants to take them to task. But it isn't that easy for him to disband the men in power. After the death of the stalwart in custody, Singham resigns.\n\nBruised and down on morale, will Singham rise to avenge? Does he defeat the men in power and how is what the film's story traces.\n\nWhat's Bad in Movie: Nothing new and one thing is that the people who have watched its prequel i.e Singham (2011)movie, they can predict most of the actions and dialogues on their own. Same kind of unity of Police officers is depicted in the movie as in its prequel.\n\nWatch or not? : well!!! the movie is strictly for Fans only...otherwise you will find nothing!!!!\n\nAny one under 12 years of age can watch...there is no romance in the movie...no sexual explicit content....no vulgar dialogues...besides this, the use of Guns and Revolvers is there throughout the movie as it is based on Crime...."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "smg242",
        "review_rating": "7",
        "review_title": "Darker and better than the first one.",
        "review_detailed_main": "The funny thing is that I went into Singham Returns, without having seen any of the trailers or songs for it (I usually always do). The only expectations I kept were memories of the first Singham movie. I remember the first movie being a pretty OK remake of the Tamil movie Singam. The first Singham definitely had its moments.\n\nHowever, Singham Returns has an original story, one which is pretty illogical at times (be used to this kind of thing, it's Bollywood), but surprisingly tight and has the right amount of mystery and suspense to keep you hooked.\n\nSingham Returns did the one thing I didn't expect from it, and this is probably what shocked me the most, considering it's a Bollywood film. Bollywood sequels are usually shoddy rehashes of the first films, trying to cash in on their success, whereas this movie actually EXPANDS on Singham's character, which is exactly what a movie sequel is supposed to do. And this movie actually got that right.\n\nSure, there are some iconic lines repeated from the first movie, which is sort of tacky, but I guess I can let that pass for its feat of character development.\n\nThe acting is pretty good all around. Amole Gupte and the lady playing the reporter are excellent in their roles, and Zakir Hussain and Anupam Kher are subtle and shine in their roles as well. As for the lead roles, Ajay Devgan is good but his Marathi seemed a little accented, like in the first movie. Kareena Kapoor is flat-out GREAT with EXCELLENT Marathi diction. The action is much more grounded than the first movie, although ludicrous at times. Most of the explosions actually hurt people and affect the story instead of just 'being there, for action'.\n\nThere are some funny moments, although not too many. The movie is surprisingly bleak and dark, like famous second acts of trilogies like The Empire Strikes Back, The Dark Knight, and The Two Towers. That's another first for Bollywood. A bit after the interval, I was actually concerned about how this was going to end up. The story had reached such a low, that I was actually considering that they might have went for a depressing ending, where nothing works out, like the ending to The Dark Knight. Whether that's the case or not, I'll leave aside. I won't spoil anything.\n\nIt feels sort of dumb even mentioning Dark Knight on a review of something like Singham Returns. But the similarities are uncanny. Watch the movie to see what I mean.\n\nOverall, Singham Returns is just a darker masala movie, at heart, but one that actually expands the characters and the setting. It feels good to know that Bollywood actually knows a little about how to make a good movie sequel now. Also, C.I.D. fans won't be disappointed as Daya is actually in the movie! And he kicks ass. And doors.\n\nThis is a masala movie that actually makes you think. Not just of the social commentary that the Singham movies are so used to bringing us, but of the characters and story as well. From Rohit Shetty, this was something I expected the least."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "soum-nanda",
        "review_rating": "3",
        "review_title": "Trivea - Goof",
        "review_detailed_main": "In a particular scene the chief minister of the state asks the police commissioner(wearing the insignia of an Additional Director General) of Mumbai to step down and is lured to be given a promotion to the rank of Inspector General, whereas a police I.G is junior to an Addl DG/DG.\n\nThe movie lacks conviction and simply wanders around without direction. The role of Kareena is unclear and is quite insignificant. The producers could have done with any average actress instead of roping in a star like Kareena.\n\nMore or less - Just a tolerable flick with nothing memorable. Rohit Shetty not up to his mark at all except his trademark vehicle blowing and shooting up stunts. The punch line - \"Ata maji satakli\" has been overused."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "Rohit Shetty Proves Yet Again that He's the Undisputed King of the Masala Genre",
        "review_detailed_main": "Reviewed by: Dare Devil Kid (DDK)\n\nRating: 3/5 stars\n\nThoroughly entertaining to its core, \"Singham Returns\" proves yet again that Rohit Shetty is the undisputed king of masala films (India's very own genre), while the other Directors of the genre are just cheap, second-rate, knockoffs. This is Mr. Shetty's second endeavor at the action-potboiler type of masala entertainer (after the overrated \"Singham\"), and this time he delivers the goods without taking himself too seriously, a glaring folly he committed in this very film's first installment.\n\nYes, there are major plot-holes, and sometimes you are asked to suspend your disbelief beyond permissibly limits (and Devgn once again hams it up way too luridly without the script demanding such over-zealous prerequisites), but the film is just so exciting, with loads of engaging action sequences, and riddled throughout with so many arousing dialogues, that in the end you forgive all the glaring errors, and just sit back, relax, and enjoy heady concoction that Mr. Shetty delivers in a familiar, overtly large cocktail shaker."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "camayanknailwal",
        "review_rating": "5",
        "review_title": "Ajay Devgn is the sole reason to watch Singham Returns",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "Singham Returns is a high-voltage action drama which is a definite improvement over it predecessor.",
        "review_detailed_main": "Some of the Bollywood potboilers are meant to entertain you with mindless screenplay and half-baked story. Rohit Shetty has mastered the art of this kind of cinema. Only this time , he goes one step back and gives you a delightful action-drama.\n\nAjay Devgan returns as fearless and relentless Bajirao Singham who has been promoted to DG commissioner of Mumbai. As he gets into a murder case where one of his junior cop is murdered, he soon realizes the true story of Dhongi Sadhu Baba(played by Amol Gupte) who is also involved in money-laundering case and murder of social activist Guru ( played by Anupam Kher).\n\nFrom the masala entertainments like Golmaal series, Singham , Bol Bachan and Chennai Express, Rohit Shetty gives yet another spineless film which is enjoyable but easily forgettable once you are out of theater. The silver lining is Singham Returns is better than the original part, thanks to the superb acting by Ajay Devgan. The movie does have some glorious moments which will engage you especially the well-executed action scenes on the sea-link and punching drama baazi. The second half becomes drag and the climax becomes typical bollywood melodrama with hero delivering high-content dialogues and blowing few punches. Editing could have been better and songs becomes hindrance to the pace. Art direction and cinematography is outstanding. Ajay Devgan is the scene stealer despite so many shortcomings in the movie. The actor is brilliant and handles the drama scenes with maturity. Kareena Kapoor lends a good support though a better role could have been made for talent like her.\n\nOverall , Singham Returns is a high-voltage action which is a definite improvement over it predecessor. It does have few glitches but Ajay Devgan compensates for that and you are entertained for 142 mins. Decent 2.75/5"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "rihaans",
        "review_rating": "4",
        "review_title": "See it for Ajay Devgn",
        "review_detailed_main": "Emtertainment:2.5/5- it misses the over the top confrontation fun, and doesn't have the power that singham contained which entertained us, amazing moves and villain engagement\n\nStory: 2.5/5- if you have watched singham then you won't enjoy this because it misses the continuous storyline that keeps you engaged at all times, but gives you a story that is made for multiple reasons and is just finding its way to make a movie\n\nEmotion: 3.5/5- the emotion has hit the right place, but gets too deep and gets the fun quotient of what we except from singham to go of full disappointment\n\nComedy:4.5/5- some unintended comedy were awesome and also kareenas awesome act will give u a good laugh\n\nFighting:2/5-didn't enjoy the fighting. Missed the cars smashing and Ajay Devgn action\n\nOver all a one time watch, go for Ajay Devgn because he has given the little entertainment that we got from singham returns, and has done justice to singham again"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "arpitpandey97",
        "review_rating": "10",
        "review_title": "singham returns well!",
        "review_detailed_main": "To begin with ,we have Kareena kapoor khan doing the comedy to lighten our moods ,but its just to gear us up for the ultimate adrenaline pumping action coming just before the interval and going till the end. AJAY DEVGN uses the hand as paw ,roaring with singham in the background,hitting the evil and rapturing the audience to ask for more.The movie well looks into the common folk and the life of policemen when they are dead ,their family has nothing to do,except working as maids and cleaning the houses ,while the corrupt politicians are enjoying in their houses and distributing money among the oppressed mass ,who knows that they are wrong but sadly they have to look for their family and cannot just be right at all times.One song is good and romantic and has a good music,the direction is too good and ROHIT SHETTY has really worked on his skills ,,its a deserving sequel and must be watched for not just action or Ajay devgn but also the message it has to bring out"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "n_dhruv",
        "review_rating": "",
        "review_title": "One Man Show",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "rakesh-alva212",
        "review_rating": "6",
        "review_title": "a Fine acceptable concept but failed to have an impact it could have",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "vitthalmisal",
        "review_rating": "1",
        "review_title": "Agenda over agenda nothing else",
        "review_detailed_main": "Oh what you Bollywood film makers thik that going to dargah will make you successful And a hindu baba tease girls and makes money Such movie makers have sick mentality nothing else Uttering waste of time."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "ashis-aks24",
        "review_rating": "6",
        "review_title": "If Singham went Goa with a 4 star, it returned Mumbai with a 2.75 star",
        "review_detailed_main": "Watched it today morning at PVR. It's a feel good type or more accurately feel excited type action movie except the time when Mrs. Kareena Kapoor Khan is on screen. Singham-2 is an extension of the original Singham movie, but this time it's more of money (/black) over matter. Our hero fights for dignity of Mumbai police dept. as well as for black money. Many a time, the audience connects with his fight for justice but not always like the original Singham. Acting wise, Ajay Devgan, Zakir Hussain and Anupam kher did fine, Amole Gupte gone slightly overboard, Daya is an extension of his CID avatar. Daya has performed his trade mark-Darwaza tod do act par excellence and it's a moment of applauds too. Thankfully, Kareena's screen time is too less and that too, totally unnecessary.\n\nIt's the timing of release that mattered and may favour also. Independence day and singular win of Bharatiya Lok Party, both. Most of the scenes are lifted from the recent political happenings in our country and remaining from Singham-1.We almost get a de-ja-vu feeling before someone utters-aata majhi satakli or aali re aali. Lastly, if Singham went Goa with a 4 star, it returned Mumbai with a 2.75 star."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "sanahashamkhan",
        "review_rating": "6",
        "review_title": "Singham Returns: Action in Mumbai",
        "review_detailed_main": "\"Singham Returns\" is a thrilling rollercoaster ride through Mumbai's underworld, led by the formidable DCP Bajirao Singham, portrayed with gusto by Ajay Devgn. The film boasts a superb storyline that keeps you engaged from start to finish, with twists and turns that keep you on the edge of your seat.\n\nDevgn's performance is undeniably stellar, embodying the righteous and unyielding nature of Singham with conviction. Kareena Kapoor Khan adds a delightful touch of comedy as Avni Kamat, bringing a refreshing levity to the intense narrative.\n\nThe plot, revolving around the investigation into the mysterious death of Singham's team member and the tangled web of corruption involving powerful politicians and fraudulent religious leaders, is both gripping and timely. The clash between good and evil is portrayed with palpable tension, keeping the audience invested in Singham's quest for justice.\n\nHowever, despite its strengths, \"Singham Returns\" does suffer from some pacing issues, particularly in the latter half of the film. Certain scenes feel drawn out, and the resolution of the conflict comes across as somewhat rushed and overly convenient.\n\nNevertheless, the film's action sequences are adrenaline-pumping, and the chemistry between the lead characters adds depth to the narrative. Overall, \"Singham Returns\" is a worthy addition to the action genre, elevated by Ajay Devgn's powerhouse performance and a compelling storyline."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "sidhique-mulanthala",
        "review_rating": "4",
        "review_title": "Below Par of High mounted Expectations::: Avoidable",
        "review_detailed_main": "There is nothing new in this flick. Having seen the superb south Indian (Tamil) version of Singham 2 (A sequel to singham, both brilliantly presented by Hari, starring Surya) rented this film with a lot of expectations. First few minutes told me what was to be expected, but still I waited to see whether this got any connections with the first singham movie other than the name hero (and his name), or does this have anyway related to Tamil version of Singham 2, and ... nothing... that was it! I was totally disappointed.\n\nMy opinion for the viewers is that TO BE AVOIDED iff you are expecting a sequel to first successful singham."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "ashoklich",
        "review_rating": "6",
        "review_title": "Aam janata appeal",
        "review_detailed_main": "Having enjoyed the first outing of Devgn as Bajirao Singham, I knew that I would be watching the sequel, irrespective of media reviews.\n\nI cannot say that I am completely in tune with the ethos of the movie going Janata in India, but surely there is some appeal for a movie where cops and politicians are honest and unwavering in their beliefs.\n\nShetty does what he does best - blowing up cars, big & violent crowd scenes and Singham taking on multiple goons in a style that also seems to be a favorite of Salman Khan. There is no gore and no killing; just a lot of bad guys flying in the air and crashing through furniture, glass and other props.\n\nFor the serious minded viewer, the movie has plenty of moments where it gets side-tracked, but the aam janata will get a comedy scene, a religious scene, a romantic song, parental bliss and so on. Everybody hams But Devgn's angry old man somehow holds it all together. As long as he looks angry.\n\nHis role is designed to dominate the movie and so it does. Kapoor looks pretty in heavy makeup and Shetty himself is often seen by Devgn's side as a cop. Dayanand Shetty as Daya is Singham's strong, silent sidekick and satisfies. The others are mostly caricatures of themselves.\n\nAnd so the franchise continues. Aai shapath."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "jambawala",
        "review_rating": "3",
        "review_title": "Much worse than the first film (Singham)",
        "review_detailed_main": "Wow. How can Ajay Devgn get things so wrong with a formula that was already working? The original Singham film, from 2011, was successful at the box office but that didn't make it special, since many mediocre films in India find commercial success. What made Singham special was that it was a genuinely watchable film on some levels despite being a mass entertainer. In my opinion, the following factors (among others) made the original Singham film very good:\n\n1) Ajay-Atul's music. Singham only had three tracks and each was very good. The title track was especially a stand-out\n\n2) Kajal Aggarwal. Her beauty, charm, elegance and the-girl-next- door-like approachable quality made it easy to fall in love with her as you got to know her character better. The film's romantic story track, which might otherwise have been forgettable, was definitely elevated by many miles because of her presence\n\nGuess what? Singham Returns doesn't have either of the above factors! Both the music composers and the lead actress were replaced by sub- par choices. You just have to listen to the title song of Singham Returns to know what I mean. Unlike the first film's title song, this song reminded me of beggars belting out tunes at India's railway stations.\n\nAnd Kareena Kapoor was the replacement for Kajal Aggarwal? Why? Seriously, why? If Ajay Devgn had convinced his wife and once-upon- a-time reigning queen of Indian cinema, Kajol, to act opposite him in Singham Returns, then maybe he could have gotten a pass for not having Kajal Aggarwal in this film. That itself is a pretty big 'maybe'. But Kareena Kapoor? She lacks the attractiveness, charm and presence of Kajal Aggarwal. The romantic story track became totally hackneyed and forgettable once again, as they often are in mass action films.\n\nIn fact the entire film became forgettable. The first Singham film was interspersed with Ajay-Atul's stand-out compositions and Kajal Aggarwal's ability to make you fall in love her with every scene. Singham Returns, on the other hand, makes you want to fast-forward through the songs and Kareena scenes so you can get back to the boring action scenes."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "saratdasisback",
        "review_rating": "4",
        "review_title": "SAFARI blasted my brain",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "bittuds",
        "review_rating": "9",
        "review_title": "Complete entertainment",
        "review_detailed_main": "Behold all the 'Singham' fan because 'Singham returns'. A tight and crisp story with amazing stunts and action which will make you want for more. Fantastically directly by Rohit Shetty and makes you think if it is the same person who directed Chennai Express which is no way comparable to his direction in this movie, it's just superb. The visuals are a treat for the eyes and the cinematography is more than you expect. This time the story had more depth and not just merely gravity defying acts.\n\nAjay Devgan with his macho instincts, fierce looks and well built body is just perfect for the role. I can't imagine any other actor playing the role. Kareena Kapoor I felt was annoying and her bit of the story looked forcefully added to the story just for the typical bollywood romance and songs and terribly obliterates the suspense. Nevertheless please bear with it as it is again back on its track post that. The surprise package was 'Daya' from CID fame. And you can see him beating down goons like anything. It was great to watch him. Anupham Kher did his bit well and Amole Gupte for the villain role was apt. Other supporting actors did their bit well. The entire film had just two songs and they were a treat for the eyes and came where needed. The song 'Sun Le Zara' by Arijit added the much required emotions. It also has the title track of 'Singham 1' and bits and pieces of it is added where required which brought the feel of Singham, sometimes enough to give goosebumps.\n\nSo, my final verdict, go and watch the film, if you to want to experience a fresh new story, new stunts and good direction in this generation of bollywood, which only talks of 'inspired remakes'. You won't be disappointed. I give it 9/10."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "jfh_dragonfly",
        "review_rating": "1",
        "review_title": "CONTINUITY, PLEASE!",
        "review_detailed_main": "If you're able to look past the pointed denigration of Hindus, you'll arrive at a film where the continuity is appalling - arrival at the same site twice, people walking out of three doorways on the same short walk - you'll have to agree that this attempt to glorify Ajay Devign is strictly for third-standarers."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "mrsas32",
        "review_rating": "5",
        "review_title": "If these sort of movies cross 100 or 200 Crores then watch movie WAAR ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "ragingbull_2005",
        "review_rating": "5",
        "review_title": "Could have been a cult classic",
        "review_detailed_main": "2.5/5 The first half of Singham Returns is high on entertainment and surprisingly, doesn't fare too badly on logic. Devgan's Singham is posted at Mumbai where he is friends with an Anna Hazare clone, Guruji (Mr. Kher in an impactful cameo) who is trying to cure the system of the malice of black money. Thankfully, the state's Chief Minister (Mahesh Manjrekar in a very restrained performance does a good job of portraying Maharashtra's CM Mr. Chavan) is his ally.Against him is a fake Godman and a corrupt ally of the ruling party. The movie starts on the right foot and builds beautifully up to the half way mark. There is an extended shoot out which has been shot very competently. Also, helping matters is the fact that the first song comes just ten minutes before interval. In the second half, the film, however, comes crashing down. It seems as if the writer / director Mr. Shetty suddenly ran out of ideas and decided to just display bullets being fired and the cars going kaput. As the body count started spiralling, I found myself losing all interest. The last thirty minutes of the movie are a joke and point to the paucity of new material in the \"cops gone rogue for justice\" genre. I liked the fact that the police are shown as the defenders of law for a change. Mr. Shetty obviously has a positive image of the police force and it manifests itself in nearly every frame of the film. Ajay Devgan is excellent and does justice to his character. His ever expressive eyes get to say a lot. There are a couple of jokes cracked at his age. However, his rippling chest and the trade mark swagger are a killer. Kareena Kapoor is a useless appendage. It would not have made an iota of difference if her role would have been scrapped. She actually starts the film's slide into mediocrity in the second half with her role as Singham's confused love interest. The hunt for the villains is not as thrilling as the first part and it all ends very tamely and predictably, which is a pity as this could have been an Indian action genre classic."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "nilabhverma",
        "review_rating": "1",
        "review_title": "Sick of such agenda film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "sonofbloke",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "Amazing fights and awesome storyline, good songs in small amounts. Cushty!"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "mssharma",
        "review_rating": "5",
        "review_title": "OK, unrealistic heroics, appeasing muslims",
        "review_detailed_main": "Good movie with usual masala. There is not a single person in India who can achieve what Sigham did today. The story is real (or close to real world modern India). Hero's capabilities are unreal and he is the best problem solver in India (as Mr James Bond in UK). As usual to appease minorities they show a Muslim prayer by a hindu hero (get real folks this is a marketing trick). And they project a hindu saint as the corrupt person. There is no doubt there are 100's of bad hindu saints but are 10 time more in the Muslim community. But the director does not have the balls to show bad guys are muslims because it will hurt the sentiment of muslims in India and movies will get banned. The term \"secular\" in Modern day India is a joke, it essentially mean appeasing the muslims (started from Indira Nehru)."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Not Recommended 👎",
        "review_detailed_main": "Please someone tell me why did he returned? please tell him to go back lol"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "labeebster",
        "review_rating": "3",
        "review_title": "Better action but worse story and the characters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "prashant_dhama200",
        "review_rating": "1",
        "review_title": "Awful and I want my money back",
        "review_detailed_main": "I am feeling to puke on every thing related to Singham returns.... No roar............or story.......bad acting and actress like Kareena can't do anything good......on her own... hence became a part of successful predecessor.\n\nAfter watching Singam 2 (south Indian)....... I can't be satisfied.......with this bullshit.\n\nHighly recommended for ignorance.....\n\nNothing Good, actions are creepy and unwillingly stretching the story line with no mean.\n\nNo direction at all, villains are easy prey and acting is just pathetic....\n\nI hate every movie from you Rohit Shitty....."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "iamkaushalmodi",
        "review_rating": "8",
        "review_title": "A Sure Shot Success...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "winak",
        "review_rating": "4",
        "review_title": "Series that has run its course",
        "review_detailed_main": "Ample Gupte worst casting in the movie. He was inept for his role and lost all respect he gained from Stanley ka Dabba. I believe without him the movie would have done better. Ajay Devgun looked tired so the movie meandered at times. Kareena Kapoor brought mirth to the film and lifted it up better than Kajal Aggarwal did in the first part. Nevertheless the movie has run out of steam and hopefully we don't get a 3rd part. Ok watch if you dont have any other options."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "pritambajare",
        "review_rating": "10",
        "review_title": "Beast movie",
        "review_detailed_main": "Although a remake, Singham is treated quite differently, especially towards the final act. It's the kind of \"mass\" action film we all love to watch, and there's no doubt over its massive commercial success in 2011, which in my opinion was the best year for movies. Having seen the Tamil original \"Singam\" which I felt was better in many ways, I think even Singham also has a lot of positives that make it stand at par with the original.\n\nI have lost the count of how many times I have seen this film. Whether on TV, internet or DVD, I have never forgot to watch the action sequences again-and-again, if not the whole film. It's one of the best cop action movies in Bollywood, and has got some of the best fight/chase sequences you'll see in a Hindi film. I think I really need to buy a Blu-ray copy to experience all the action and intense dialogues in high quality as I, sadly, couldn't see it in cinemas.\n\nAjay Devgn has perfectly played Bajirao Singham and has pretty much lived the character. He's one of the finest actors we have in India, not just Bollywood. This is the particular film that made me a big fan of him, and I would never be bored watching this film no matter how many times I watch it. And yes, kudos to Rohit Shetty for not just adapting the Tamil film but also making interesting and significant changes wherever needed. This film is just successfully standing the test of time, and will forever do so."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "mxpayne75",
        "review_rating": "8",
        "review_title": "Review of Singham Returns",
        "review_detailed_main": "Rohit Shetty's SINGHAM -- his best effort to date, in my opinion -- was a forceful blast from the past. A film that faithfully followed the rules of entertainment to the T. A remake, the first part brought back memories of the classics that were attempted by our peers. SINGHAM emerged a solid hit for varied reasons: high-voltage drama, raw action, dialogue-baazi during the confrontations and of course, power-packed performances by Ajay Devgn and Prakash Raj that elicited wolf-whistles. Quite obviously, the expectations from SINGHAM RETURNS, which brings the unbeatable combo of Ajay and Rohit Shetty together, are gargantuan. On the whole, SINGHAM RETURNS is a complete mass entertainer with power- packed drama, hi-intensity dialogue and towering performances as its aces. The brand value attached to it coupled with a long weekend will help the film reap a harvest and rule the box-office in days to come. A sure-shot WINNER!"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "kunder-akshay3",
        "review_rating": "10",
        "review_title": "Singham Saaheb!! You Rock!!",
        "review_detailed_main": "Ajay Devgan's character Bajirao Singham is now in people's heart and you can understand it by hearing the whistles every time he comes on the screen. As always Ajay is in top form. Kareena has been utilized well here without getting overboard. A bonus treat here for all the CID TV serial fans is Inspector Daya who is addressed without any doubt with the same name that he is been known since years. Yes yes there is a door opening sequence for which he is known for.\n\nAshwini Kalsekar and Anupam Kher are flawless in their respective roles. Amol Gupte and Naser Hussain as antagonists are superb. Rohit Shetty and team have given yet another entertainer for the audience with a message related to Mumbai police which we have seen in many Bollywood pot boilers but this ones handled well.\n\nWithout any doubt Singham Returns will now join the 'better than first' rank of sequels. Singham was a classy mass entertainer. The team has done a brilliant work to make the sequel a better treat to their fans and they have succeeded all to the top."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "swarup-gorai",
        "review_rating": "8",
        "review_title": "excellent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "ghazwan124",
        "review_rating": "10",
        "review_title": "very very good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "VikasBansal",
        "review_rating": "9",
        "review_title": "Lion Roars and Rattles Corruption Once Again",
        "review_detailed_main": "Movie packed with real time drama and sequences which we see every day in these corrupt politicians and fake baba's on which we Indian people trust blindly. Movie depicts the Story of a new Nation that whole nation wants to see as Corrupt free and clean Bharat, the hurdles they face in achieving so, a rare and mild hope of an old and experienced politician (Anupam Kher) along with his young blood team, story of an honest and aggressive Cop who hates bribes and who loves his duty more than his life. Movie carries very nice story throughout with so many climaxes and anti-climaxes that we see, at no pint of time you would want to leave your seat to miss even single moment, it keeps you intact even till end where you want this story to continue as it's inspiring every individual. Action packed sequences, rains of bullet in fight scenes keeps you excited. Rohit sheety knows best to create Action from nowhere. Ajay devgan proves once again that no one can beat him when it comes playing the role of an Dashing Cop. Daya from CID, played his part with too much perfection where he was standing all the way from shoulder to shoulder with Ajay. However, movie had some flaws as well, Role Kareena is doubtable as she actually needed in movie? Music is also not enthralling but when one you have strong story and amazing background score, you don't need Baisakhi of music to stand upon. The lion roars and enthralls. Must watch for every individual. My verdict 3.5/5."
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "navvenjain",
        "review_rating": "8",
        "review_title": "very good",
        "review_detailed_main": "LVUWAASAAAglE+oHFnl+NwoXhNCpDSJok0l7o+4zbMfFLDbla5LKI6lR0zdzVvr8 RxYiDZUrCVZB7KFAtQFo5loFZrWM9u3j741RheTlMOtsQBW6Y7HwQ6ki5f80ZV7n a7N58ButZlPy2q2pjbkgWhCjGtQvT081rgzmzKOO0VYT5BDZtLP4Lpr6CH82WfWE ItG4PES5TgQ2iQtErjK8LOaAYNnQDRzHZtTSiCieIrN8NDEIS4SAR9dRTpDAb8Vy 9e/XY/N16NfxfSRT8HnntRva+br4llNf4wLpwkS0hy8oo8tlEPYvBTLkPS5AveMC vDIG2dk5q90u/F1HzJps8U97vEFhtzhx1/DmHFea3XkddhR/MDm4I9/Z9Bt2BUvu bZGfne0sgl4fD86B12C/xUXSbDSgbpkp"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "SohailH22",
        "review_rating": "9",
        "review_title": "A great sequel to Singham (2011) with amazing performances, perfectly executed and fantastic action scenes, and great writing and direction!",
        "review_detailed_main": "Ajay Devgn sir as Bajirao Singham, till date is one of my favourite performances of his!! I absolutely loved Singham (2011)!!! Can't wait to see him return as Bajirao Singham in Singham Again!!!!\n\nBebo as always, gives a fantastic performance!! The chemistry between Ajay sir and Bebo was really good!! And Bebo looks so damn gorgeous, hot and stunning!\n\nDaya sir in this movie was the best part!!!!!! I loved the part where Ajay sir says his iconic dialogue from CID, \"Daya darwaza tod\" GOOSEBUMPS!!!!!\n\nThe action scenes in pre and post interval and BGM are amazing!!!! Action scenes in Rohit sir films are too good!!!!!\n\nThis film deserved better music like the first part! Wished Ajay-Atulji composed music for Singham Returns!"
    },
    {
        "movie_id": "tt2309764",
        "movie_name": "Singham Returns",
        "movie_rating": "5.7",
        "review_username": "NijazBaBs",
        "review_rating": "10",
        "review_title": "not much different from previous sequel",
        "review_detailed_main": "Good, perfect, inspirative, motivative, graphic, exciting, emotional, realistic. One of best movies in bollywood and maybe even in hollywood. Hope there will be more sequelse like in long sleeping movies like Top Gun there is a sequel incoming. Good topics: corruption, moral, revenge, justice, government. I am only disappointed for this movie not being as famous and as reviewed as it deserves. Singham is a hero just like Superman or Batman or Spiderman or Robin Hood. He is a new character that will be remembered by whoever watched his movies."
    }
]