[
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "culwin",
        "review_rating": "3",
        "review_title": "Author! Author!",
        "review_detailed_main": "Wow, this movie has to be seen to be believed! I can't believe that Arnold \"Pretzie\" Stang was overlooked AGAIN by the Academy! A finer piece of work I have not seen! Except perhaps by that guy in the bear suit. Now that was some great acting as well.\n\nOf course, this is all from the perspective of being drunk, which is what you would have to be to like this movie! :P"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "zetes",
        "review_rating": "3",
        "review_title": "Might actually be fun, but Arnold Stang hangs around like a wretched fart and ruins everything",
        "review_detailed_main": "Over a decade before his movie career exploded and eight years before even Pumping Iron, Arnold Schwarzenegger starred in this cheapie B comedy playing the Greek demigod Hercules, who has been banned from Olympus by Zeus. Schwarzenegger can barely speak a line of coherent English at this point (the film is probably more commonly seen with his performance dubbed, but his original voice is available nowadays). Funny thing is, he's by far the best actor in the picture. Everyone else is just cringe-inducingly awful. The movie as a whole might have actually been watchable, if it weren't for the painfully stereotypical Jew performance by Arnold Stang, who dominates much of it. The film has Schwarzenegger (dubbed Arnold Strong) doing Schwarzenegger-ish activities like weightlifting, throwing cars around and getting into various fights. What would you do if you ran into a 22 year-old Arnold Schwarzenegger and he was annoying you? Start a fight? Well, if you're in this movie, that's what you do. It happens like ten times."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Great for a laugh...",
        "review_detailed_main": "This is a very bad film--there's no denying this. Imagine having a young Arnold Schwarzenegger (whose command of English was MUCH worse than when he did his movies in the 1980s) playing a Greek god who comes to New York for a few laughs! Now the concept COULD have actually worked--if the leading man hadn't been barely cognizant of the English language. And, had the writers not been chimpanzees, the story could have been turned into a cute little tongue-in-cheek tale. But, in the end, through total incompetence, it's a dreadful movie. BUT, for people who like watching stupid films and laughing at them, then they are in for a treat with HERCULES IN NEW YORK!\n\nThe film begins in a very minimalistic Mount Olympian headquarters for the gods. Including the cost of the pillars, I think the set was created for about $47.50. Well, in this sketchy looking layout, the gods are all standing around when Hercules announces he's bored and wants to go back to Earth. Zeus forbids him and they argue. Ultimately, Zeus tosses him out of the sky onto the earth and from here on Hercules has a lot of adventures. For the most part, Schwarzenegger plays the role like he's a lovable moron...goofy and looking a bit like Jethro Bodine when he first went to the big city! Among the exciting(?) adventures he has are various wrasslin' matches, fighting an escaped bear (a guy in one of the worst bear suits I've ever seen) and hanging out with Arnold Stang--a man who has somehow learned to talk entirely through his nose. I'd tell you more about the story, but really don't think it's all that important. Suffice to say, Jethro runs around New York (often with no shirt) and gets into wacky trouble.\n\nAs far as the research for the writers goes, I think they'd have been better off if they'd read a few comic books or asked the average high school student for advice. When it comes to knowing even the basic information about the Greek gods, they often got is completely wrong--mixing Greek and Roman names for the gods again and again (for example, Juno, Venus and Hercules are Roman names and Zeus and Nemesis are Greek) as well as having little understanding (or care) about the gods themselves (Mercury was NOT Hercules' brother, Pluto was NOT the Devil nor did he live in Hell, etc., etc.). In addition, at the end of the film, Samson (from the Old Testament) and Atlas (whose job it is to hold the Earth) come to the rescue!\n\nThere are also two versions of this film. Traditionally, the version most have seen has a dubbed voice for Arnold, as he's occasionally barely comprehensible. But, this is also really silly as the voice is very robotic and obviously not his. This is the case with the version posted on IMDb (though, oddly, this version also lacks music and many basic sound effects). For those wanting to see and hear Arnold, the DVD has the original restored voice--but won't give you the option to hear either one. Additionally, at the end, when he talks to Stang from the radio, it's NOT Arnold's voice but that of the robot-dude.\n\nOverall, the film was a shoddy and silly mess. But there was a certain goofiness that make it fun to watch despite its many, many obvious shortcomings. Not a good film at all, but fun to watch if you need a laugh."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "DarthVSith",
        "review_rating": "",
        "review_title": "Arnold VS. The Bear in Central Park.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "NoeMan",
        "review_rating": "1",
        "review_title": "\"How dare you strike Hercules\"",
        "review_detailed_main": "If I feel down, all I need to do is think of Arnie fighting the grizzly bear in Hercules in New York and it cracks me up. The grizzly bear is actually just some big guy wearing a Halloween costume, he even moves like a human. But thats not the silliest scene. Arnold also fights a group of sailors with a plank and throws them in the sea, the sound effects and horrible choreography in that scene is hilarious. I've got the version of this movie with Arnies real voice, and just hearing that makes this movie worth getting. But Arnold is not the worst actor in this movie, his partner, Arnold Stang is much worse. The Mafia is even this movie, well, three guys...played by actors who probably auditioned for The Godfather but didn't make it. Yeeeaaahhhh....\n\nThe \"brilliant\" theme song in this movie is played about 500 times.\n\nI would give this movie a one, but it made me laugh...so I guess it deserves a 2. Hoo-Ya."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "funkyfry",
        "review_rating": "4",
        "review_title": "Goofy comedy with very early Arnie appearance",
        "review_detailed_main": "A film of at times incredible and hilarious ineptitude (scenes of the \"gods\" on Mount Olympus are interrupted constantly by the sounds of honking horns, which are often louder than the heavenly dialogue) saved to some extent by the sincere starring duo of Stang and Schwartzenneger (whose voice is dubbed in the theatrical version, perhaps unintentionally making this film funnier for those like myself who've seen more than a few Italian \"pec epics\").\n\nNot a true action picture, more of an attempt at comedy that is more often funny against its intentions. Try to count how many times Arnie says \"I am Hercules\" (as if to convince HIMSELF that he's truly acting), and if you can make it to the end I'll give you a cracker or something.\n\nYou gotta love this film."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Dave-430",
        "review_rating": "1",
        "review_title": "The horror...",
        "review_detailed_main": "This is one of the worst movies of all time. The four-hundred-and-something witless souls who awarded this a 10 should be permanently banned from voting.\n\nForget that it was made on a shoe-string budget, and that at one point Arnold fights the worst bear costume in movie history; forget that he takes his shirt off in every other scene, often with zero motivation; forget that the Mount Olympus scenes are obviously shot in New York; forget even that the acting is of such monumental ineptitude that James Karen (one of the worst actors in \"Return of the Living Dead\") is far and away the finest thespian in sight. The fact that anybody invested as much as a nickel in a script that one monkey working for one hour could easily have done better is what really blows my mind. The premise is painfully stupid, and the execution of it is as heavy-handed and amateurish as anything you're likely to see. Most porn movies are produced with more consideration for plot.\n\nI recommend \"Hercules in New York\" to anyone who likes to go to the dentist or enjoys a hard punch in the nose. This is an hour and a half of pure agony."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "gridoon",
        "review_rating": "3",
        "review_title": "What a goofy film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "StevieBaby05",
        "review_rating": "5",
        "review_title": "An awful film - but still great to watch",
        "review_detailed_main": "The title itself sums this film up in a nutshell. \"Hercules in New York\" just screams cheese, low budget and ludicrousy. And that's exactly what you get.\n\nAs far as the film is concerned, there's probably more goofs than words. The sound is all over the place, and so is the camera! The acting is abysmal (apart from Pluto, he was alright) and Arnie is as stiff as a board.\n\nHowever, I really enjoyed this film. It's silly, it's fun and it's Arnie! If anything it's great to see just how far you think he's come over the years. The unnecessary moments that all Arnie fans are used to, in which he'll decide for no good reason to reveal his phenomenal body structure are as prominent as ever, and this is another plus point for me.\n\nIt's a bad film, but you cant come away feeling cheated, watch it for what it is.\n\n2* for the film. And 3* for Arnie.\n\n5/10"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "meddlecore",
        "review_rating": "5",
        "review_title": "So Bad...It's Spaghetti!",
        "review_detailed_main": "Having met his mother while on vacation, Zeus fathered the mighty Hercules (played here by Arnold Schwartzenegger as Arnold Strong aka Mr Universe, though, with a more tolerable voiceover for American audiences), who gives him nothing but trouble up on Mount Olympus.\n\nSo he smites him into the sea on Earth, where he is picked up by a ship from America.\n\nThey bring him into New York, where they try to force him to work in the port...but all they get are knuckle sandwhiches.\n\nAfter fighting his way to freedom, he tries to steal a chariot (in the form of a forklift), before being whisked away by, Pretzy, a local bagel and pretzel hustler.\n\nHe takes Hercules to Central Park, where he exhibits a number of feats of strength- showing up anyone who dare challenge him.\n\nA college recruiter has his eye on Hercules, and invites him over for drinks, where he becomes infatuated with his daughter.\n\nInevitably, he gets into a fight with her boyfriend, and wins himself a chance to take her out.\n\nThey go for a carriage ride in Cenral Park, just as a grizzly bear escapes from the zoo.\n\nSo, of course, he fights and subdues the beast...which is actually just a dude in a poorly designed bear costume.\n\nThe newspapers pick up on the story, so to exploit his newfound fame...they throw him into the (American) wrestling ring.\n\nThe mafia sees this and strongarms their way in to \"sign him\" so that they can cash in off his back.\n\nZeus, however, feels this brings him shame, and thus seeks to punish him further.\n\nBut the Goddesses of Olympus intervene in his favour.\n\nSo Mercury is sent to bring him back to the realm of the Gods.\n\nHercules, meanwhile, is living the tourist life...checking out the sights, sounds and tastes of the big apple.\n\nThus, when Mercury comes to fetch him, he refuses to return, as he's become accustomed to his new life on Earth.\n\nNow, he risks the almighty wrath of Zeus' rage.\n\nZeus plans to send Hercules to hell with Pluto for 100 years as punishment, but Juno overrules him and tells his interlopers to leave Hercules down on Earth- where she plans to render him fully mortal...while sending Pluto to murder him.\n\nBut Pluto doesn't like to murder, so he concocts a scheme instead.\n\nKnowing Hercules is set to face off against Monstro the Magnificent in a weightlifting competition on a tv variety show, while backed by the mafia, Pluto sets him up to take the fall, after placing a large bet against him.\n\nCue the chariot chase...and let hilarity ensue...\n\nNo divine intervation required (ok, well...maybe a little).\n\nAn absolute cheesefest from start to finish.\n\nSo bad...it's spaghetti!!!\n\n5.5 out of 10."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "CinemaSerf",
        "review_rating": "4",
        "review_title": "Hercules in New York",
        "review_detailed_main": "Ha! This is hilarious. Arnold Schwarzenegger - going by the name of \"Strong\" on the titles, is the demigod son of Zeus (Ernest Graves) and he's bored hanging around Olympus keeping out of trouble. Finally his father loses his temper, hurls a thunder bolt at him and he ends up down on earth befriending the weedy \"Pretzie\" (Arnold Stang doing a vaguely Phil Silvers impersonation) and getting involved with some crooks who see his might as a meal ticket. What now ensues is just harmless, witless, fun with a confused mythology - Roman and Greek names for the gods are interchangeable; an Olympus that looks like the herb garden of an English stately home and luckily Arnie doesn't have to wrestle with ancient Greek, just with 1970s English. There can't have been much budget so don't be looking for visual effects or a tangy script - nope, none of that, just the future Governor of California looking almost cherubic in his spray-on shorts demonstrating the truthful nature of the American dream. Anyone can make it, however humble the beginnings."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "superman002100",
        "review_rating": "10",
        "review_title": "Arnold's First",
        "review_detailed_main": "I don't know if it wasn't meant to be but this movie is hilarious. How can you downgrade a movie that offers Arnold in his true form, no facial expressions, an accent that can hardly be understood, and muscles on top of muscles. If you have seen the DVD version you can watch the movie with his voice, which makes all the difference in the world, if you're an Arnold fan that is. My personal favorite is, \"I do nots care abouts ze zundaboats.\" I don't think that line can ever be topped. And who can not laugh at the New York traffic sounds on Mt. Olympus. This movie may be the most underbudget, worst film of all time, but it's Arnold and it's great for a laugh. If stupid things make you laugh then this movie is a must."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "EasternZZ",
        "review_rating": "7",
        "review_title": "Honestly, it is kinda funny at points",
        "review_detailed_main": "This movie honestly is kinda funny. The acting is okay, but silly. The dialogue is bad, but at the same time funny. The story is silly, and random things just sort of happens. Hercules wants to come to earth, his father refuses, he pisses his father off and he send Hercules to Earth, and because Arnold speaks with such a thick accent, all the characters in the movie can't really understand him. Lots of random stuff happens, and then all ends good.\n\nFunny scenes: 1. Arnold waves at an old lady from outside a plane and she overacts afterwards 2. Arnold fights with a bunch of sailors with a block of wood 3. Arnold refuses to pay a taxi driver for his services and destroys his taxi 4. Arnold fights a guy he just met inside a house 5. Arnold goes on a date with a girl and takes his shirt off and starts flexing in public 6. Arnold fights with a grizzly bear who happens to be at Central Park 7. Arnold becomes a wrestler and his manager signs him to a bunch of mobsters 8. Arnold walks around destroying a bunch of college athlete's records\n\n7/10 \"It is really not THAT bad. It is bad, but not THAT bad.\""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "breakdownthatfilm-blogspot-com",
        "review_rating": "5",
        "review_title": "An Awkward Children's Movie",
        "review_detailed_main": "As a child, I have seen movies that really grab the viewer's attention and have lovable characters that make a lasting impression. Children's movies like Gumby: The Movie (1995), Thomas and the Magic Railroad (2000), and Space Jam (1996) all have the things a child could ask for. As for Hercules in New York, the film definitely made a lasting impression but on the weird side of things. Sponsored by the Tooniversal Company, this piece of cinema is fun to watch for nostalgia purposes only.\n\nThis is Arnold Schwarzenegger's first film debut as the man who is part god, and part human. The story starts off when he is up in Olympus where he wants to be sent down to Earth because he is tired of hanging around with the Gods. So he argues with his father Zeus, who gets so livid that he sends him down to New York. Wait a minute, Zeus didn't want Hercules mingling with humans, so why was he sent down to New York in the first place? Why was there even an argument? Whatever.\n\nAlong with Schwarzenegger is Arnold Stang, who plays a character called Pretzie, a wimpy man who carries a basket of pretzels in the first part of the film that he's seen. From there, he no longer holds a bag of pretzels, what a surprise. I will say, the actors picked for the roles of each character were picked accurately, but I'm not saying their acting is good. Stang plays as good wimpy character, and is funny to see his eyes bulge. Even Schwarzenegger is good as Hercules, but that's because of his physique and I assume that's really all he needed. That is one of the nostalgic points in this movie; Schwarzenegger's muscles. It's amazing to see how big he really was in the 70s. The other part that is nostalgic about this film is to see what SOME of New York looked like back then, but that's about all the viewer will get.\n\nWhat makes this movie so awkward are how the scenes are done. There are moments where Hercules is supposed to be doing something extraordinary. Instead what he does looks cheaply done and the sound effects don't help. Hercules knocks (more like love-taps) a man into a bay, and the splashing water makes it sound like a pebble was tossed. What? Who would have thought these brutes were made of confetti? There's even a scene where Hercules fights a bear. Yes a bear, and it doesn't even look like a bear. The viewer will be able to tell that this is not a bear, but a person inside a bear suit. To make matters worse, Hercules attacks the bear by slapping it; yes slapping it. Schwarzenegger slapping? It's really ridiculous to see The Terminator (1984) beat up a bear so poorly.\n\nAs for the damsel in distress, Deborah Loomis, I have never heard so much screaming, almost as much as Kirsten Dunst in Spiderman (2002), if not more. My ears were ringing after hearing her. She even faints in once scene, and it didn't even look real. As for the music, which was composed by John Balamos, is not a whole lot better. I can't even tell what kind of instrument is used but it's not an orchestra I'll say that much. A lot of the music is the same and it sounds really corny. I'm really surprised Schwarzenegger has become such a box office hit by starting from this movie. This film obviously did not get him famous but if he had not auditioned for the role, we may not have any of the Terminator movies or Total Recall (1990), whatever. When the film finished, I was barely entertained and shocked to how bad the film was compared to its trailer. What shocks me even more is that the director of this film is still making movies today!\n\nHercules in New York is a very silly kid's movie that may not even entertain the smallest of ages. Much of the scenes in this film are stupid and the only thing that may catch the viewer's attention is Arnold Schwarzenegger's bulging biceps."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "furrd-2",
        "review_rating": "",
        "review_title": "The governators' craptacular romp through New York",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "MyOpinionIsFact",
        "review_rating": "1",
        "review_title": "Herc and Pretzie Forever",
        "review_detailed_main": "This film is God-awful and as goofy as they get. Be glad that Arnie's career survived it! It's one of those rare movies that are so bad that they gain something from it. I love the ridiculous scenes where Hercules picks fights for no reason which adds to any campy fun that might be had. And Pretzie has to be the weakest lamest film buddy/costar ever put on film. Everyone has to see this movie at least once. I found the DVD in a bargain bin and now own it. For a few bucks its worth helping to complete an Arnold fan's collection. One warning: hopefully you won't get the movie's soundtrack stuck in your head because it can drive you insane. Enjoy!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Ricky-Roma",
        "review_rating": "3",
        "review_title": "Awful. But Unintentionally Hilarious",
        "review_detailed_main": "Now, there can be no real doubt when you watch this movie that it is absolutely awful. Bad as bad can be. Because it is. \"So why oh why have you given it a score of three as opposed to a score of one or two?\" you might ask. Well, the reason is that it is the most unintentionally hilarious movie that I have ever seen. It is listed as being an \"Action/Comedy/Fantasy\" which would lead one to believe that it is meant to be funny. I saw the version in which the mighty Arnold speaks for himself in his customary Austrian brogue. I have not seen the dubbed version so I don't know how much of the comedic value the movie loses based on Schwarzenegger and his dialogue being the funniest part of the movie.\n\nIt's the parts that are supposed to be serious that are the really funny bits of this movie. Such as Arnold regularly proclaiming (with an even thicker Austrian accent due to him not yet mastering the English language) \"I am Hercules\". Having a weightlifting contest with Arnold Stang and pushing over N.Y taxis.\n\nI'm a huge Schwarzenegger fan. I always have been. But the irony is that in the late-1980's he felt the need to display \"range\" as an actor by trying to branch out from his heavy-hitting actioners into comedy with movies such as \"Twins\" and \"Kindergarten Cop\" but the fact of the matter is that Arnold for all his trying was at his funniest right back at the start of his movie career.\n\nIf you are a fan of Arnold and love his inimitable manner of delivering lines. You need to see this. Ignore the non-existent plot and acting and just roll along on the river of cheese in a film that is so bad it is hilarious.\n\nThree is a low score, yes. But when you consider that this movie should have a score of one you know that those additional points are on comedic merit alone."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Pldn",
        "review_rating": "1",
        "review_title": "My god...What were they zhinking?",
        "review_detailed_main": "Oh my god, this movie was horrible.. Possibly the worst I've ever seen. But at the same time, it was the greatest comedy ever.\n\nIf you consider the movie as a serious piece of some directors pie, it truly earns it's place at the bottom 100. Most of the time during this movie, a thought was knocking in the back of my head: \"Were they seriously trying to make a movie?\" I guess they were. The directing, acting, special effects.. mein gott! The acting is so bad, that it makes you squirm in your seat. Arnold is trying soo hard to remember his lines, that most of the time it shows on his face. I guess they just needed a big muscular dude to walk around NY and reading a few lines.\n\nAnd the banjo... Ooooh the banjo.. My god make it stop! The banjo is played during all of the action scenes, and it's almost always the same tune. In the beginning it makes you laugh when you hear it, but when the movie is halfway through, you start to tear your hair out because of it.\n\nBut when not watched seriously, this movie is so hilarious, that I almost crapped my pants in many of the scenes. One of the first lines that Aahnuld says always gets me:\n\n\"Let me be ze judge of dat, I am tired of ze zame old facez, ze zame old zings!\" - Dear Christ Jesus help me Lord that accent is damn thick. Sometimes you can't even totally understand what he's saying.\n\nIf you are to watch this movie, don't watch it seriously. I also recommend to watch it with friends, and maybe a couple of cold ones, and I'll bet that it'll crack you up.\n\nFor the crew's serious intentions to make a good movie, and utterly failing., I'll give this movie 1/10.\n\nBut, because the movie is so bad that it actually becomes good, I'll give this one 10/10."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "tavm",
        "review_rating": "2",
        "review_title": "Hercules in New York was a pretty bad movie though the actual Schwarzenegger's voice-dubbed version was the most interesting of the two",
        "review_detailed_main": "With today the day Maria Shriver officially files for divorce from Arnold Schwarzenegger (serves him right too since he betrayed her by cheating on her with the maid and had a baby with her, to boot!), I thought I'd watch the former Governator's first movie that he made way back in 1969-Hercules in New York. I saw two versions: the first that I watched on Hulu had no music score and Arnold's voice was badly dubbed by another though compared to his real one, you could hear each word clearly and the second one I saw on YouTube which had his accented voice not always easy to understand (which made his confused mix-up on \"bucks\" and \"dough\" with \"bucs\" and \"doe\" not as funny) though it had a good Greek-like score. The rating for the first version is above while the other take gets a 4 from me. Arnold is credited as Arnold Strong since, I guess, his co-star happens to be Arnold Stang. Stang is such a one-of-a-kind presence that he brightens most scenes he's in. The only other player I recognized was James Karen who I knew from Poltergeist as well from a guest spot on \"The Golden Girls\". By the way, when Stang died in December '09, I couldn't help but think of his other roles like the voice of Herman the mouse in those Herman and Katnip cartoons, his role as Frank Sinatra's friend in The Man with the Golden Arm, and his recent roles in \"The Cosby Show\" and Dennis the Menace. Oh, and while I knew one player couldn't be John Candy since this guy was much older but Abe Holiday on that dock sure looked like him. So on that note, Hercules in New York is interesting for the early role of Mr. Schwarzenegger, not to mention his thick accent, and not much else though one can't completely hate a movie where Hercules fights an obviously bear-suited man. P.S. It was disappointing to hear that dubbed actor again instead of Arnold on the radio at the end of the second version especially since it was much softer this time around."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Stay_away_from_the_Metropol",
        "review_rating": "4",
        "review_title": "Started from the bottom now we here",
        "review_detailed_main": "Is it really that bad? Yes. It is.\n\nThe version they currently have streaming on Amazon Prime (it's April 2020, one month into the global quarantine) is the version that was otherwise unavailable throughout history. It is the version with the original audio with Arnold's voice. Now, I don't want to have to watch this movie again, but I at least need to see some of the version with the voice dubs at some point - all of the 10/10 reviews I've seen are of people being stoked about how bad the voiceovers are. I feel like I've missed out.\n\nThat aside, this movie fully sucks. I found it quite endearing for the first 20-30 minutes. It was quirky and cute, and fun to see Arnold give his acting debut, but after 30 minutes... there's almost no cohesive story at all, and the co-star ARNOLD STANG as PRETZY THE PRETZEL GUY, who is in almost every scene, is UNBEARABLE. He's like a cartoon version of Woody Allen who tries to be funny but isn't, ever. There are a couple standout scenes, like when Hercules fights \"a bear\" in Central Park, LOL.... but, The last hour is VERY difficult to enjoy. It just meanders and even Arnold can't save it. I guess I understand why Arnold wouldn't allow this movie to be played on broadcast television, ever."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "sauravjoshi85",
        "review_rating": "4",
        "review_title": "Just an above average film.",
        "review_detailed_main": "Hercules in New York is a fantasy-comedy film directed by Arthur Allan Seidelman. The film stars Arnold Schwarzenegger, Late Arnold Stang, Deborah Loomis, Late James Karen and Late Ernest Graves.\n\nAdventure ensues after Hercules moves to New York and learns that his ancient Greek lifestyle is not compatible with the modern life. To add to the woes, his father sends a few gods to bring him back.\n\nThe film is a cheesy and gets clumsy sometime but still the film entertains and apart from the poorly executed climax the major part of the film will not disappoint you.\n\nThe film which is the debut film of Arnie has a decent plot and more than an average execution, we know that the film is a B Grade film with budgetary constraints but still the film could've been made little better.\n\nActing is average to decent and apart from Arnold Stang all of them looked average to terrible.\n\nScreenplay of the film is decent to average and has some of the entertaining moments. Climax of the film is terrible and if the climax would've been more refined the film could've been much better. Can be watched once."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "dakki78",
        "review_rating": "5",
        "review_title": "So crap it's great!!",
        "review_detailed_main": "I didn't really know how to rate this movie. When it comes to the storyline I give it a 1, but when it comes to Arnie I give it a 10! I mean I thought Arnie was stupidly funny in Twins but this one definitely takes the prize!! I once heard that the makers of the movie had dubbed over Arnie's voice because his English was so utterly crap at the time, but I was pleasantly surprised when I bought the DVD because there was an option on whether you wanted Arnie's voice or the dubbed one. So if you haven't seen this one and you plan to see it on DVD, YOU MUST CHOOSE ARNIE'S VOICE! Or you will miss out on all the fun of the movie.\n\nOh, and try to spot Richard Herd who played Supreme Commander John in the sci-fi show \"V\", he is in there!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "poldemol",
        "review_rating": "10",
        "review_title": "Hercules in New York is the ultimate comedy",
        "review_detailed_main": "To me, it doesn't matter if things are intentionally or unintentionally funny. Intentions just don't matter that much in the real world. Hitler might have intended to make the world a better place, I don't think his intentions matter when you judge him. This is simply one of the most hilarious movies you'll ever see, it's filled with absurd scenes. And it's acted out to perfection. The combination of Arnie, and Pretzie, it's just magic. Pretzie overacts as badly as you can imagine, Arnie doesn't act and he does that as badly as you can imagine. But those aren't the only noteworthy performances in this movie. Check out the refinement of the screaming girl, in the infamous bear-attack scene. There are just so many little things in this movie, little details in every single aspect of this movie, that make this so extremely funny and entertaining. It just ignores even the most basic of things needed for a good movie, and it is exactly that, what makes this so good. Watch this movie, you won't be able to say that it is average, that's for sure. I've seen this movie 2 times, and I still regularly think about it. I would buy the DVD without a second thought if I would encounter it."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "QUASI-5",
        "review_rating": "6",
        "review_title": "Fine family entertainment for a rainy weekend afternoon!",
        "review_detailed_main": "I found this to be an affable and enjoyable film to watch, quite silly and good-natured overall. Both Arnolds (Schwarzenegger and Stang) are fun to watch, and the rest of the cast is okay if not particularly memorable. The original version of the film had another, un-credited actor providing the voice of Arnold's Hercules due to his thick accent, but the DVD version, as well as the version you can catch on TV these days, have restored Arnold's real voice to the soundtrack, which really helps. Overall, it's good fun and if you go into it not expecting too much, you'll emerge at the end having had a pleasant if not unforgettable experience."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Bernie4444",
        "review_rating": "5",
        "review_title": "Far in the dim past when myth and history merged into a mystery.",
        "review_detailed_main": "Far in the dim past when myth and history merged into a mystery.\n\nStarring Arnold Stang and Arnold Strong \"Mr. Universe.\"\n\nExcellent moderne dialog. However, Hercules has a thick Austrian accent.\n\nHercules is bored with Olympus after centuries of the same old faces. He takes a sojourn to New York against his father's wishes.\n\nHercules (Arnold Schwarzenegger) does not count on culture clashes and loose animals (wild zoo bear.)\n\nThere is even the obligatory chariot, oh um car chase.\n\nWill Zeus, thinking that Hercules is making a spectacle of himself, send someone to New York to retrieve his son?\n\nOr will he be influenced by a wild Hera?"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "trevorwomble",
        "review_rating": "4",
        "review_title": "Terrible but strangely watchable.",
        "review_detailed_main": "If you haven't seen Arnies first film, made when he was 21, you haven't lived.\n\nPlaying the titular hero, Hercules descends on New York and that's about it. But the fun is watching inept direction, some truly awful acting, a terrible script and on existent production values.\n\nPitched as a comedy, I didn't laugh once such is the puerile nature of this film. The low budget is obvious (such as the scenes supposedly set in Olympus complete with the sound of New York traffic in background due to the fact they filmed it in Central Park) . And there are two versions of the film, one with Arnold's real voice and one with it dubbed into an American accent.\n\nThis film is a real curio, like a prototype Crocodile Dundee tale of a fish out of water, but missing that films quality. However its still entertaining but harmless kiddie friendly trash and worth a watch.\n\nOh, and if Arnold Stang, who plays Pretzie, sounds familiar thats because he's the voice of Top Cat from television.\n\nEnjoy yourself."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "DeathFish",
        "review_rating": "1",
        "review_title": "Oh my god! :)",
        "review_detailed_main": "OMFG that freaking bear scene! O.K on with it. I have to say that this is indeed one of, if not the worst movie i have ever seen. Even though it was funny beyond words it is still a very very bad movie, everything in it, there is now faint sign of hope for any of those people who participated in it. The funny thing about that is, that history proved that wrong, Arnold actually turned out to be an extraordinary actor with a successful career. See thats surprising when you watch this movie! And back to that god forbidden bear scene. I must say that from the moment I saw the bear I cried with laughter. I really can't see how anyone, anyone of any time can be so thickheaded that they actually make such a costume, and even worse uses it for the movie. And well there is a lot of other unbelievable details in this movie, in fact the entire movie is a huge surprise, I mean Zeus' thunderbolts are actually made of steel bars normally used for supporting concrete structures, and it is obvious if you look at them. Well I could go on with these, excuse me, hopeless and stupid details ( as well as the entire main plot )but I guess there is nothing more to say, a very very bad movie beyond words. I encourage ANYONE with my heart and soul to watch it. Better laughs are rarely found, and besides it is a suitable tribute to Arnold to watch this one from start to finish, a never forgotten movie in history, and it really sucks! Though it is indeed supreme if you need one and a half hours of cheep laughs i rate it 1 because it is technically the worst movie i have seen. 1/10"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "fegorleo-1",
        "review_rating": "1",
        "review_title": "Obscenely bad",
        "review_detailed_main": "It has to be the worst movie ever made, indeed. At first, I thought the nicknames - \"Pretzy\", for instance- of some of the characters, plus Zeus' fake lightnings would make me laugh, but no. Not even. It's so bad you can not laugh. Oh yes, sorry ! there is the scene where our hero -Arnold himself- beats a wild bear in Central Park. It's night, but no, actually, it's day most of the time, they just forgot to shoot some parts of it, so it's day, and Hercules has to save a precious young lady from a wild bear that escaped from the zoo...the only problem is that the thing never looks like a real bear. It is just so bad, it's no funny at all. A clumsy man -probably forgot to dig the holes for the eyes in the material- wearing brown pajamas and pretending to be a bear is attacking Mr. World...Great. I can't wait to see the sequel. Thanks again, Mr. Arthur Seidelman, for this wonderful piece of s###. I almost cried at the end."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Biggs-4",
        "review_rating": "1",
        "review_title": "Dubbing at its best",
        "review_detailed_main": "A bad bad bad movie, yet hilarious. Who would have thought that dubbing Arnold could provide laugh after laugh? Hours of fun I tell you. And even better, the voice that they give him incredibly funny because we all know how he actually sounds. Watch this and see how far Arnold has actually come as an actor."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "mtyrrell77",
        "review_rating": "3",
        "review_title": "Fighting amongst the gods...",
        "review_detailed_main": "As Arnold Schwarzenegger's first film it was the reason I had as a child for become interested in mythology. The field of films regarding the subject of the gods is horribly inaccurate. Once you accept the mistakes the joke become funnier. Arnold in his prime body builder form makes an interesting choice with an impossible to understand accent.\n\nAs Hercules struggles through New York in the modern times, he met with users and abusers who would try to take advantage of a god-like naivety. He woos a woman with an ancient times kind of charm. The Gods are shamed by the actions and send his half-brother to beg his return to Olympus. Refusal would bring retribution from Olympus on himself\u0085\n\nNeedless to say the story goes on and on and the plot is uninterestingly bad\u0085\u0085\u0085.. BUT\u0085\u0085.. It just so hard not to watch it as it goes on\u0085 It just makes me laugh! Arnold would go on to be the Action Hero of the 1980's.\n\nWith Hercules in mind this movie is pretty Badass if give up storyline, acting and a lack production"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "djecatepec",
        "review_rating": "1",
        "review_title": "just go and see it..........",
        "review_detailed_main": "There are so many really great comments on this movie, that I really can't add anything much better. Except to tell you that you really owe it to yourselves to actually find a copy and see it. It WILL be worth it. It is perhaps one of the all time worst movies ever made, but so bad and because it includes the Governor of California in the all time worst performance of his career well, its just priceless! After you watch this you will never again be able to watch Arnold doing anything without a feeling of complete awe and respect. That the dumb body builder who played \"Hercules\" could possibly end up where he is today...........\n\n(If you had been watching this movie in 1970 and somebody had said to you, \"that guy is going to be a great star AND the future Governor of California\" you would have laughed until you peed yourself!)"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Libretio",
        "review_rating": "1",
        "review_title": "Appalling drivel, but Arnie's got a fantastic body!!...",
        "review_detailed_main": "HERCULES IN NEW YORK\n\nAspect ratio: 1.37:1\n\nSound format: Mono\n\nAgainst his father's direct orders, Hercules (Arnold Schwarzenegger) leaves Olympus and journeys to Earth, where he enjoys a series of wild adventures.\n\nMicro-budget fluff, designed to showcase the strength, agility and fantastic physique of bodybuilding champion Schwarzenegger (billed as 'Arnold Strong'), here making his feature debut. Production values never rise above porno level (Zeus' kingdom consists of nothing more than a plastic throne and a couple of drapes, filmed in a public park!), and the sound quality fluctuates from shot to shot (you can hear traffic somewhere beyond the aforementioned 'magic' kingdom!!). On top of the meandering plot and rotten visual effects (get a load of the 'rampaging grizzly', actually a guy in flea-bitten bear suit!), the movie is further handicapped by Schwarzenegger's dreadful performance - he's fine while showing off his torso, but his flat monotone delivery is in sharp contrast to some talented supporting players, including well-known character actors James Karen and Richard Herd (what were they thinking?). If nothing else, however, the movie provides an opportunity for viewers to feast their eyes on Schwarzenegger's magnificent body, which he displays at every opportunity. Oh, and look out for the scene in which he steers a horse-drawn carriage down the middle of Times Square, an iconic image which transcends the rough material in which it's featured. Directed by Arthur Allan Seidelman.\n\nNB. In an alternate version of the film, Arnie is dubbed with god-like hamminess by an uncredited voice artist; reports suggest the movie is even funnier this way!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jgray-2",
        "review_rating": "10",
        "review_title": "What a pumped up movie!",
        "review_detailed_main": "I love it! Hercules in New York was the best laugh I've had in a long time! Reminds me of something my sister and I would have done with our old video camera. If you're in the mood for 100% cheese, this is your movie. Who directed this? Ed Wood?"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "indiedaze",
        "review_rating": "6",
        "review_title": "bad acting, bad film. but damn i love it.",
        "review_detailed_main": "this is an excellent film. such bad acting, it is quite hilarious. Arnold Lang is great in this film as he plays the annoying idiot sidekick who takes the whole film to work out who Hercules actually is. i think the best part is when Hercules is bragging to some college athletes, he rips off his shirt, and they still think they can do better. even though he does better at every single sport competition they still think they can beat him. lovely. i understand the guy before me when he says he cant watch it, it is absolutely unbearable as a movie-buff and practising director myself, but sh*t. thats what makes us better isn't it! learning from these films is essential. and there is a lot to learn on how not to make a film while watching this."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "JMASTERprime",
        "review_rating": "1",
        "review_title": "Holy mother of CRAP!!!!!!!!",
        "review_detailed_main": "This movie simply sucks. The only movie I have seen that can match this is Logans Run from 1976. Arnold Schwarzenegger usually gives an uneven performance but this is really truly BAD acting. The acting in this production truly sucks. Arnold Stang is on hardly the worst thing in this production and gives a pretty even (but still pretty bad) performance. Deborah Loomis should not be an actor and Ernest Graves should have been playing a role more suitable (like Santa Claus) to not suck totally. The terrible guitar playing which every time there was a fight or a car chase came poring out of my poor speakers made my ears bleed. Aubrey Wisberg should have done the world a favor and stayed out of the filmmakingbusiness. The story is simply stupid and gives no meaning what so ever. The fact that you in the scenes that were you see Zeus in heaven can hear traffic in the background did not help this movie. This movie might not have been this bad if they had had a big budget and good actors and would have left out the Greek music. If you get a chance to see this movie - DON'T!!!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "ma-cortes",
        "review_rating": "3",
        "review_title": "Hercules journeys to Earth from Mount Olympus to Manhattan and gets mixed up with nasty wrestling promoters",
        "review_detailed_main": "Ridiculous fantasy/comedy motion picture debut of Arnold Swarzenegger with his voice badly dubbed in a comic role as a Herculean mass of muscle sent by dad Zeus residing at Mt. Olympus to New York where he becomes involved with a botcher man (Arnold Strong) , while he falls in love with a beautiful girl (Deborah Loomis) and befriends her father, Professor Camden (James Karen) . Hercules eventually becomes a professional wrestling superstar . Once on earth he encounters some adaptation problems but thanks to his enormous strength he manages to compensate them . Boys! Girls! It's Big Fun!. See Him Topple Two Ton Newspaper Rolls! See Him Toss Tough Men Like Toothpicks!. It's Tremendous!! It's Stupendous!! It's Fun!!.The Legendary Hero...The movie with Muscle.\n\nThis muscle-man epic displays action , adventures , mythology, bizarre and luxurious scenarios and results in a quite amusing flick , but being a really inferior film . The movie has not mythological accuracy , neither expectation historical ; however , showing up here and there some Greek Gods , such as : Zeus , Nemesis , Juno , Venus , Mercury, Atlas and Pluto .There're 300 pounds of stupid , being a lighthearted fun in which Hercules appears in Manhattan and he beheaves likes a geek fish out of water and eventually becomes a professional wrestling superstar . Arnold's original classic with a lots of fights , muscles , and several silly scenes. He plays a comic role that allowed him to develop his humorous talent while showing off his prodigious muscles. Stunningly cheap special effects like the shots and close-ups of a giant bear that's a man suited struggling against Hércules . Despite its appealing nature to the general public, the film failed to arouse much interest , but today it is considered a cult movie due to being Arnold's debut film. A few years earlier , some hunk men played this hero in great number of movies and was randomly assigned the identity of Hércules , Goliath or Samsom for US version . As Arnold Schwarzenegger took the role from his American weightlifting companions , such as : Dan Vadis who played Hercules the invincible (1964) , Triumph of Hercules (1964) ; Brad Harris who acted in Samson against Hercules (1961) , La furia d i Ercole (1962) , Hercules (1983) ; Mark Forest who performed : La vendetta di Ercoles (1960) ; Peter Lupus or Rock Stevens in Ercole contro i tiranni di Babilonia (1964) ; Reg Park, who had previously played Hercules in the Haunted World (1961), and Hercules the Avenger (1965) , Gordon Scott in Ercole contro i tiranni di Babilonia (1964) , Hercules and the pricess of Troy (1965) and , of course , Steve Reeves in Hercules (1958) , it is followed by Hercules unchained (1959) . So Reeves paved the way for other pumped-up acting hopefuls as Ed Fury, Mark Forest, Reg Park and others to seek their fame and fortune in Italy as feature-length Samson, Ursus or Colossus, and nobody, came close to topping Steve in popularity ; however , the giant Arnold Swarzenegger stayed in the US where he got big hit . This lumbering motion picture was lousily directed by Arthur Allan Seidelman. And subsequently , reissued track was restored . This Hercules in New York(1970) film also titled Hercules goes Bananas at 75 minutes and Hercules , the movie at 82 m. Is listed among the 100 Most Enjoyably Bad Movies Ever Made in Golden Raspberry Awards . Only for Arnold fans as an inept but irresistible opportunity to watch a a newcomer actor to be followed much success."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Sandcooler",
        "review_rating": "2",
        "review_title": "Hercules has massive cleavage",
        "review_detailed_main": "I've only seen a shoddy German dub of this prize pony but I guess the idea remains the same. Hercules is tired of laying around in Greece all the time speaking German and takes a trip to New York. A guy that vaguely looks like Woody Allen takes him under his wings and they get into oh so lighthearted adventures. To be frank I expected more ass-kicking from Ahnuld. He barely ever gets into fights and when he does he really just pushes the bad guys around a little, probably because the production values are low and they couldn't get those cool sound effects you get after punches(that go \"doosh\" and stuff). To give you an idea of the massive thought put into this movie,the script called for a bear and the director had a brilliant idea, putting some hobo in a bear suit bought from some guy's trunk. Luckily our hero Hercules is on the spot real quick to not punch the,ah well I'm in a good mood,bear. Meanwhile the not so pretty love interest is screaming her lungs out dead afraid of this short, skinny bear that has been standing on two legs for ages. Another action scene breaks out when Hercules joins a contest that should determine who the strongest man in the world is. And of all the ways that can pop up in your head, they go for the very lame idea of just lifting three different weights. I was at least expecting some wrestling or so but no, just lifting stupid weights. And if his opponent can lift 1000 pounds, why the hell did it already take the guy so much effort to lift 500? All these comical misadventures (there's more,but I can't work up the courage) are constantly interrupted by scenes of Zeus sitting in the director's back yard, I mean uhm, Greece. Yeah that's what I meant. This movie is even too stupid for my taste."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "BA_Harrison",
        "review_rating": "2",
        "review_title": "We all have to start somewhere I suppose.",
        "review_detailed_main": "Screwball comedy Hercules in New York sees a 22-year-old Arnold Schwarzenegger (billed here as Arnold Strong) making his screen debut as demigod Hercules, who visits Earth against the wishes of his father Zeus. Falling from the sky into the sea, Hercules is picked up by a ship travelling to New York, where he meets friendly pretzel salesman Pretzie (played by Arnold Stang, the voice of Hanna-Barbera's Top Cat), falls in love with professor's daughter Helen (Deborah Loomis), enters a strongman competition against bodybuilder Monstro (Tony Carroll), and upsets local mobsters in the process.\n\nArnold Schwarzenegger's screen debut is shoddy nonsense that will test the patience of all but the most dedicated Arnie fan. The star's thick Austrian accent renders his dialogue laughable, the movie's intentional humour falls flat, and the plot is a meandering mess that feels like it was thrown together on the fly. Production values are incredibly low, most notably in the scenes set on the supposedly tranquil paradise of Mount Olympus (actually filmed in Central Park), where the props are cheap and nasty and the action is frequently interrupted by the sound of New York traffic and car horns.\n\nThat said, Hercules in New York is almost worth seeing just for the hilarious sight of the future governor of California wrestling a grizzly bear (actually a man in a very unconvincing moth-eaten bear costume).\n\nAlso look out for a guy who looks a lot like John Candy (the jury is still out on whether the bloke in question is actually the portly Canadian comedian in an uncredited role, but I wouldn't have blamed Candy one bit for not owning up if it was him)."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Girl-nextdoor80",
        "review_rating": "4",
        "review_title": "So Bad it is Good",
        "review_detailed_main": "I am a big Arnie fan, have been since I was old enough to operate a V.C.R and I will defend him as charismatic Actor who has been in some brilliant films. However this is not one. Arnold himself would agree. But as a young 22 year old Austrian Bodybuilder's first film it's not his fault at the time he couldn't even speak full English.\n\nAs a comedy this film is hilarious I just played a little bit of the film for my friend and he fell to the ground laughing at the part where Arnie flys past the plane window. The editing is terrible sound keeps changing per frame (As a film student I would get failed for such sloppiness), the lines are cheesy but funny in an unintentional way and that bear fight.\n\nI guess the reason I find it so funny is it reminds me of the half assed films me and my friends have done bored when nobody can act and lines seem stupid.\n\nI urge you to watch this film at least once big Arn has come along way."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "tuomas_gimli",
        "review_rating": "2",
        "review_title": "Historically horrendous",
        "review_detailed_main": "With sets about as convincing as an F-grade porn production, acting so wooden you could easily pass it off as construction material and a soundtrack so ear-splittingly awful that it'll likely make you scream in agony, Hercules in New York is definitely a classic in the \"so bad it's good\" category. I'm giving it 2 stars on a \"real\" grade scale because of its camp appeal, but that doesn't mean it's not an entirely enjoyable film.\n\nThis is Arnold Schwarzenegger's first screen role, and you can really tell: his delivery is stiff as a frozen tree, his expression more dead than a zombie that's had its head removed, and his English is nearly incomprehensible gibberish that will make you laugh at every turn (\"I am tired of ze zame old zings!\").\n\nEverything else in this movie goes wrong too in about a 100,000 ways: for example, the gods are supposed to be Greek, but they often refer to their comrades by their Roman names, which were invented centuries after ancient Greece's prime. The effects are a riot: Look out especially for Zeus' \"lightning bolts\" and the unforgettable bear fight scene where Ahnuld fights some poor guy in a bear suit.\n\nEven the sound isn't right: you'll hear cars humming in the background during scenes that are supposed to be set on Mount Olympus and the dialogue is occasionally out of sync. But the crowning achievement of this film's awfulness has to be the soundtrack, which is basically one song playing during every important scene over and over and over again. Despite being completely hammered during watching this film, I still wanted to launch the DVD into outer space.\n\nRecommendation: In all seriousness, this film is T-E-R-R-I-B-L-E. But it is a marathon of laughs if you get hammered with your friends and pop this camp turkey in. Just remember what I said about the soundtrack."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "peterchr-rude",
        "review_rating": "",
        "review_title": "Arnold's promising debut",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "slightlymad22",
        "review_rating": "3",
        "review_title": "Not A Promising Start for Arnie",
        "review_detailed_main": "After working my way through Sly Stallones filmography. I decided to do the same with Arnold Schwarzenegger. First up is Hercules In New York\n\nPlot In A Paragraph: Hercules (Arnie) is sent to Earth, where he finds true love and starts a career in the bodybuilder business.\n\nIn his feature film debut, Arnie is billed as Arnold Strong in the movie's credits, The DVD obviously has Schwarzenegger in huge letters across the top, and his voice is dubbed.\n\nThe premise behind Hercules in New York is certainly strong enough to carry a movie, especially a comedy like this one, but it's very cheaply made, the scene with Hercules fighting a grizzly bear has to be seen to be believed, and no matter how bad the performance, everything seems to be the only take they filmed.\n\nArnold Stang gives your typical comedians acting performance and Deborah Loomis is quite cute. I know it's Arnie's first movie, but he is awful. There is not one scene where there is any hint at a successful acting career in his future.\n\nSince the US production company went bankrupt, the movie was never released in theatres.\n\nIn his Autobiography Total Recall, Arnie recalls how he was thrilled to be paid $1,000 a week for his work on the movie, and best of all, he sent a photograph home to his parents saying \"You see? I told you this was going to work. I came to America, won Mr. Universe, and now I'm in the movies.\"\n\n3/10"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "nolan-09154",
        "review_rating": "2",
        "review_title": "I hate Pretzie",
        "review_detailed_main": "The first 30 ish minutes of this movie are worth the watch. You get; Arnold in a sailors suit and cap, Arnold doing track and field, Arnold fighting a man in a bear costume in central park. When the mob shows up you could probably quit the movie. Also after this mark you have to endure another full hour of Pretzie and his stupid face, voice and all the other bulls**t that is Pretzie. Arnold's bits are worth the watch in the first leg of the movie then he gets phased out throughout the movie to include useless plot points and Pretzie. Give it a watch I guess, you won't enjoy it but you may get a few laughs in the first 20-30 minutes."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "fantastique53",
        "review_rating": "10",
        "review_title": "HAhahahaa...",
        "review_detailed_main": "If you think this movie isn't worth watching, then you obviously have no sense of humor. Stop taking life so seriously and go watch \"Hercules Goes to New York.\" If you can't laugh at this movie and appreciate it for the horrible piece of seventies anti-porn money at work that it is, then perhaps something along the lines of, oh, we'll say that Mariah Carey movie put out a number of years ago, or perhaps a documentary on the Exxon Valdez disaster would be more up your alley. Either way, when you die, you'll be glad you saw it at least, or more likely, at most, once. It beats being mean to people. You also get to witness firsthand the glorious age before dubbing was perfected, and hear Arnold as you've never heard him before."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Stevieboy666",
        "review_rating": "6",
        "review_title": "Sounds like they have motor vehicles on ancient Mount Olympus, ha ha!",
        "review_detailed_main": "Arnold Schwarzenegger is one of my all time heroes, as a bodybuilder and as an actor. My first Arnie movie was Cactus Jack, not a great introduction to his movies! Hercules in New York was his first movie, at 22 he looks so young. But physically he looks incredible. This is a perfect opportunity to see him at this stage in his life, he frequently removes his top showing off his massive physique, plus of course plenty of muscle flexing. I know that this film got dubbed but thankfully my DVD actually has Arnie's real voice. He was nicknamed the Austrian Oak and acting doesn't come any more wooden than his performance here! His very thick Austrian accent is occasionally difficult to understand but I wouldn't have it any other way. Pairing up with Arnold Stang Herecules is a straight up comedy, silly and very cheap looking, but funny too. Shot entirely in New York the numerous scenes of the Gods and Goddesses on Mt. Olympus features the background sound of motor vehicles, very funny! Arnie versus the bear (man in bad suit) is one of the so bad it's funny scenes. I've seen most of Arnie's movies, The Terminator being my all time favourite movie, but this was my first time viewing Hercules. It is without question a bad movie but it has plenty of laughs and for fans of Arnie such as myself then it makes interesting viewing."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "EijnarAmadeus",
        "review_rating": "1",
        "review_title": "Silly and boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Hilariously bad \u0096 only worth seeing out of curiosity value due to Schwarzenegger's presence",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "aesgaard41",
        "review_rating": "2",
        "review_title": "Good Idea, Bad Movie",
        "review_detailed_main": "There ought to be a very good movie available out of the gods being alive in the Twentieth Century (And not just those of the Greeks, but ALL of them), but this ain't it. This one is played out like a high school play with bad dialogue and some bad interpretations of the myths. Arnold could be a fair Hercules, but not then, and obviously not now. The actors playing the gods have no idea of the characters they are trying to play; I would have thought the Olympians to have kept up with the times. The music is also lousy and the plot is quite ridiculous as it goes no where. It merely circles Hercules confusion and disenchantment with modern civilization. Lets face it, Vanna White in \"Goddess of Love\" looks like Emmy material compared to this."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Bunuel1976",
        "review_rating": "3",
        "review_title": "HERCULES IN NEW YORK (Arthur Allan Seidelman, 1970) *1/2",
        "review_detailed_main": "Being on an epic movie kick lately, I decided to check out again this \"lost\" debut of Arnold Schwarzenegger's where not only is his then unpronounceable surname changed to the unimaginative Strong (in the manner of the stars of Italian peplums) but his voice was also dubbed by an American actor for U.S. theatrical release (which is unsurprising as his original vocal track - which is how I watched the movie myself - is virtually unintelligible at times)! Anyway, the \"Greek god in modern NYC\" plot had comic potential to be sure but, despite the scarce felicities (Hercules is insulted on seeing an impostor posing as himself in a fictional sword-and-sandal flick playing in a movie theater), it is generally hopelessly squandered by the sheer amateurishness of it all. At least, despite its blandness and derivativeness, the Greek-style musical score alleviates one's pain from time to time..."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "shellshell",
        "review_rating": "1",
        "review_title": "it has to be seen to be believed",
        "review_detailed_main": "I was torn between scoring this 1 and 10. It is an amazing film on so many different levels.\n\nThe bear scene is like the worst pantomime. The young Arnie is monosyllabic. Yet this film has a charm that possibly even the cast and crew didn't recognise. You can't deny that Arnie has an amazing physique.\n\nIt's a(n) homage to New York and a reflection of the late 20th Century\n\nIt is some of the worst acting you will ever see and there is a total absence of decent special effects.\n\nSo bad it's good, see it now!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "TimeForChillie",
        "review_rating": "2",
        "review_title": "Blakespot Reviews: Hurcules in New York",
        "review_detailed_main": "Hurcules in New York, 1970 2/10, Worst movie of 1970, Second worst of the 1970's, 1214th overall\n\nI didn't actually see this movie recently. However I did see it back in Jr. High. Recently while looking at IMDb.com's \"100 worst movies of all time\" I saw it and realized I hadn't ranked it yet. Let me assure you it is on that list for a reason. It is not a good movie, or even an adequate movie. Here are the only reasons I can recall that would make it worth watching. Aarnold Swarzenager stars in it, but they dub his voice to make him sound American, which is especially awesome since he's Hurcules who would have been Greek. Also this movie had a gorilla in it who was VERY VERY clearly just a man in a gorilla suit... that was fairly awesome. Anyway, those are pretty much the high points of the movie. I gave this movie a two because it never made me want to kill my self... but its still very, very bad."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Marty_T_McFirefly",
        "review_rating": "1",
        "review_title": "A Lesson in how a film should be made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "neo_odin_1",
        "review_rating": "1",
        "review_title": "You have struck Hercules!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "joshuasyoung-1",
        "review_rating": "10",
        "review_title": "A film of staggering genius",
        "review_detailed_main": "Don't let the awfulness of this film fool you. Arnold's first and greatest film is, in fact, one of the greatest of all time. Just as financial firms regularly turn losses into gains by multiplying their balance sheets by -1, this film uses awfulness as a deus ex machina to capture the profound depths of our mortal fallibility. Pretzie is the ultimate everyman, selling pretzels by the water and figuring out ways to nickel and dime everyone and pocket the loose book every now and then. But he gets into trouble and has moments of revelation and regret. Hercules' simplicity and god-like physique, as well as Monstro the Magnificent's lopsided hair cut, symbolize the yin and yang of life and death, bigness and smallness, truth and the GOP.\n\nThe frequent unfocusing of the shot shows that mankind's mind is frequently unfocused and Arnold's partially literate accent represents the garbled marbles we often use to express the inner desires of our hearts. On a daily basis we are tempted by god-like greatness but frequently fall short of the world's expectations for our bulbous necks and mountainous pecs. Hubris is a 1000lb barbell and it kills. So we are frail, so we must crawl.\n\nDon't be a long shot plunger. We can not temporize the mighty Zeus. This film must be cherished."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Haplo-4",
        "review_rating": "6",
        "review_title": "An excellent movie - if you just want to kill some time",
        "review_detailed_main": "This is NOT a great movie. This is NOT a movie with excellent actor-performances. BUT this is a classic. Imagine, You are at home, having nothing to do and you know that you ain't up for a movie with a lot of action, a lot of comedy, a drama or a thriller - you just want to lose an hour and a half doing nothing important. Then this is the movie for you. This is one of the movies that actually is so bad that it is good. And the best part - nothing in this movie is correct with the original mythology of Greece."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "kcirevam",
        "review_rating": "1",
        "review_title": "Shut that bloody bazouki off!!",
        "review_detailed_main": "I finally got around to seeing this movie, mainly for the sake of seeing the Governator's first movie.\n\n*shudder*\n\nI've never felt like I've lost a significant portion of my brain while watching a movie before.\n\nDon't get me wrong, I'm a huge Arnie fan, I love most of his movies. Even the bad ones. *cough* Red Sonja *cough*\n\nBut I couldn't find any redeeming features in this one. Let's all just be glad that movies like this are rare, and that Arnie has definitely come a long way since then.\n\nThough I did keep expecting John Cleese to come in feeling all peckish, and proceed to start trying to purchase some cheese. Compliments to the bazouki playing throughout most of the movie.\n\nStill... wasn't as bad as Manos."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "gwerq",
        "review_rating": "",
        "review_title": "Ridiculous!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "bad-films-r-good-4-brain",
        "review_rating": "1",
        "review_title": "Hercules in garbage...",
        "review_detailed_main": "It's not a secret,Arnold Swarzennegger is a very veeeeery bad actor! But after this film,at the beginning of his career,how could it be possible somebody trusts him to use him in other films? Zeus was looking after him!!! He's acting so bad! He's so inexpressive... So transparent... He was good in Conan and Terminator,because he has a great body and very few words to say... But when he talks,when he's trying to be humorous...Aaaarrrrrgggggghhhhhh! Zeus,help me to endure that !!! So this film is made on a big biiiiiig casting error! But,unfortunately,it's far from being the only problem!!! The story is sooooo stupid,dialogs are so awful and the director so ineffective,that this film is simply and terribly boring! Too bad to be funny!!! Lots of bad films can be seen at 2nd degree! They became funny,sometimes great!!! Not this one! Perhaps it could be a little bit,with another (unvolontary-funny) actor like Lou Ferrigno,but Swarzy was always so sure to be good,so self-satisfied,but it's so sure his performances are so bad (exclude Conan and Terminator)!!! Don't look this!!! You want to laugh at bad films with bad actors? Just take a look at \"Hercules\"with Lou Ferrigno,\"Masters of universe\" with Dolph Lundgren,\"Streefighter\" with JC Vandamme,\"Invasion USA\" with Chuck Norris,\"Beastmaster 2\" with Marc Singer,\"The Barbarians\" with David and Peter Paul,\"Bronx warriors 1 and 2\" and \"Thunder 1,2 and 3\" with Mark Gregory,or \"Oscar\" with Sylvester Stallone...And the very best of all: \"Hamlet\" with Arnold Swarzennegger! No it doesn't exist,but it should be..."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "basrutten",
        "review_rating": "1",
        "review_title": "What were they thinking?",
        "review_detailed_main": "\"Hercules in New York\", the first movie to star Arnie, kind of makes you wonder how the guy ever got a movie career going. It certainly isn't due to the makers of this movie.\n\nThis \"movie\" has amateurism written all over it. The plot (if you can call it that) is dumb and pointless beyond belief and seems like it has been ripped from a (bad) cartoon show. The movie is full of errors (Greek mythological names are confused with Roman names) and emberassing signs of amateurism (the lightning bolts thrown by Zeus are bent pieces of iron, New York traffic can be heard in the background in scenes that apparently take place on Mount Olympus). The action scenes are laughable (expect to see the worst-looking bear suit ever) and none of the actors can even act the slightest bit (just watch the facial expressions of \"Pretzy\").\n\nI think that nobody who made this train wreck of a movie had any idea of what they were doing. This movie is a failure in every aspect, except that it's actually so bad that it becomes unintentionally funny again.\n\nNO STARS, but definitely worth a look"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "hotfox-2",
        "review_rating": "4",
        "review_title": "yes it could have been better!",
        "review_detailed_main": "this would have been a better movie had arnold been allowed to speak for himself. hercules was not an american so he would not have our dialect or speech down to perfect english. he's new in town so give him a break. you know practice makes better not perfect. it's not always the actor or actress' fault that a movie is not up to par. give some of the credit to the writer and director."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "words_like_violence_brea",
        "review_rating": "1",
        "review_title": "worst film EVER!!!",
        "review_detailed_main": "Those who have already seen this film automatically know how bad this film really is. I would like to let others know how much i would like to stress to you never to watch this film.\n\nWARNING:once you have seen this film you will never get back those precious wasted minutes in your life\n\nArnie still cant act for toffee (and everyone wants toffee). His struggling English mixed with confusion about whats actually going on is amazing the film was ever made entirely.\n\nThe poor costume and cheap settings let alone the pointless crap story.... i mean WHAT were you thinking , i mean REALLY.....What a waste of money!\n\nTHIS IS A MESSAGE GOING OUT TO THE CREATERS OF 'HERCULES IN NEWYORK' AND ALL THAT WAS INVOLVED.....you make me SICK!!!\n\nIf it were up to me i would scrap the film from existence, and attempt to redeem any pride from the Hollywood industry.\n\n.....its a MUST SEE"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "lecarre",
        "review_rating": "1",
        "review_title": "Worst movie i ever saw",
        "review_detailed_main": "This is the worst film I have ever seen. If the writers associated with this film ever worked again I would be shocked. I detected the lameness of writing in about 30 seconds into the movie, at the beginning of the show, a short story line was put forth and it seemed to be written in a 3rd grade class. And it went downhill from there. The acting is over dramatic, and has the emotion of a chalk board. I have made more fun of this movie showing others how bad it is than to seriously contemplate actually watching it to the end. I would only recommended it to Collectors who must have every film with Arnold Strong (Swartzenegger) in their library."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jelli28",
        "review_rating": "1",
        "review_title": "Hilarious Hercules",
        "review_detailed_main": "I have seen 5 minutes of this movie when I woke up with the TV still on in the middle of last night! To begin with it really freaked me out - seeing a young Arnie competing with an athlete at the discus, javelin and long jump. It didn't surprise me that Arnie outperformed him but it was really weird when he said he was from Greece! I had no idea what I was watching but now I know what it was and I've read all these other reviews I can't wait to see whole thing - especially the bear fight! I would recommend this to others just on the basis of my first five minutes enjoyment, thankfully I saw the version with Arnie's real voice which was wooden as usual ... Conan this was not but Hercules was a great start."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "srobi280",
        "review_rating": "10",
        "review_title": "The funniest movie of all time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "bsinc",
        "review_rating": "7",
        "review_title": "An underrated movie",
        "review_detailed_main": "This has got to be the funniest movie ever!!!!!!!Arnie obviously hadn't learned proper English yet, so his voice is never heard, instead they used someone else's voice, how lame. The bear scene in the park is a killer, I laughed so hard , my cheeks started to hurt, I'm laughing right now, as I'm writing this -DEAD FUNNY, but overlooked, (OK it's made very poorly and you just shouldn't pay any attention to the story , but considering it's was supposed to be a serious movie the effect is even greater. Rated as a serious movie 1/5 rated as a comedy 5/5\n\nRecommendations: if you're having a day when you want to pee your pants because of laughing hard...well, it might just work with this movie"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Chase_Witherspoon",
        "review_rating": "4",
        "review_title": "Sword & sandal on the streets of NYC",
        "review_detailed_main": "Cheerful homage to the sword and sandal epics of the early-mid sixties with Schwarzenegger appearing straight-faced in his film debut, opposite the neurotic, pained expressions of self-described squirt Stang as his unofficial minder. There's some fun action designed to showcase Herc's superhuman strength (and Schwarzenegger's physique obviously) intermixed with vision of Zeus (Graves who bares more than a passing resemblance to Frank Thring who could've also been perfect for the part) lamenting the plight of his son whose been permitted to visit earth after he complains about the sedentary lifestyle on Olympus.\n\nThe clean & jerk contest with Mr World Tony Carroll was a highlight for me, building some semblance of tension as the mighty Herc tries to elevate an impressive half-tonne of steel in a televised strong-man event as greedy gangsters watch on eager to convert Herc's incredible strength into an ongoing racket.\n\nFamiliar supporting cast features James Karen and Richard Herd in early career roles, whilst attractive theatre actress Tanny McDonald is effective playing the sarcastic Juno, adorning the throne at Zeus' right arm, intermittently dropping disapproving remarks about Herc of whom she is spiteful.\n\nLight, fun entertainment which I've seen alternately with Arnold's natural voice and with the painful dubbing, suffice to say neither is a masterpiece, although I personally found the undubbed version less irritating."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "saturday79",
        "review_rating": "2",
        "review_title": "lots of laughts... at the film's expense",
        "review_detailed_main": "this film is truly magnificent. there really are parts where you cannot understand what arnie is trying to say. think of the acting in red sonia, add some more wood and you get the standard in this film. go to your local charity shop, collect some materials together, make a camera and that's what they used to film this (i love the background noise of the camera, i feel that particularly adds to the film). that said, the decision to film mount olympus near a main road also adds to the atmosphere. perhaps the most, um, experimental part of the film is its ability to have one scene in both night and day at irregular intervals along with conversations between people where their clothes change halfway through. some of the actors sadly seem to genuinely have believed that this would further their careers, but the lady who pretends to be godzilla when she sees arnie floating at 30,000 feet (i think she was trying to scream, but am still not sure), i think realised that was it for her career, although through a marvellous stroke of genius, she also appears in the trailer. as do all the action scenes, naturally. all four of them. once throwing around cardboard drums (although they're not meant to be cardboard, but they get dented as they hit the ground, what a superb effect), once being hit by a able in a not overly staged stunt, and a couple of times where arnie makes his pecs bounce. there are films which are worse than this, but it certainly had me creasing up, especially at the start. and, yes, you guessed it, not WITH the film..."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "user-469",
        "review_rating": "1",
        "review_title": "Traffic congestion on Olympus",
        "review_detailed_main": "I've just watched this film for the first time and my sides ache. Arnie is Herrrrkooooleeez the Greek god with an Austrian accent who sets off to explore the world. The comedy is dismal but the real laughs come from the sheer ineptitude of the film in every regard. The best bits are without doubt the wrestling match with a bear in the park, the costume is so poor that it looks like the bears head is in danger of coming off as Arnie gets stuck into it. I also loved the loud traffic in the background on mount Olympus and the underworld. I was weeping with laughter as Zeus made declarations about the peace and quiet of Olympus while someone in the background was blasting their car horn. Definitely one of the worst films I've ever seen but hilarious from start to finish. I'm surprised nobody else has mentioned the entirely random flying rabbi at the end!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "mybah",
        "review_rating": "1",
        "review_title": "Got to see this movie ONCE!!!",
        "review_detailed_main": "This film is bad, bad, BAD The plot, the props, the stunts, the action sequences are all chronic in there absolute patheticness. The acting is even worse, and Arnies voice is dubbed. By gosh, if you had to introduce Arnie into the movie world, couldn't the producer and director at least have ATTEMPTED to make it reasonable?!?!\n\nHaving said this, if you're an Arnie fan, you may well find this highly amusing nostalgia. If there is ANY benifit in this rediculous flick, is that you may get a great laugh out of it, and may even want the DVD so you get a good laugh with your friends.\n\nThis movie was done when Arnie was current in the world record book as the \"most perfectly developed man in human history\". (Quote: Guiness book of records)\n\nI gave it 1/10. But I would be tempted to give it more if you are turned on by sentimental starting points and/or movies for now famous movie stars"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jadewood",
        "review_rating": "1",
        "review_title": "Not the worse movie I've ever seen, but real close.",
        "review_detailed_main": "This is such a bad movie it has too be seen, at least once. I'd say it put Arnold's career back 5-8 years. I can't point to one actor that wasn't terrible in this bomb. If Arnold had not made it big we'd have never seen this stinker. I have to hand it to Arnold he took this awful experience and turned it into one of the most inspiring stories in all of Hollywood. Not that he will win any awards, but he at least makes movies I love to watch. Not to mention that he makes a pretty good living doing them. You've come along way Arnold, a true all-American story."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "elo-equipamentos",
        "review_rating": "5",
        "review_title": "Schwarzenegger entering in Hollywood by Big Apple's door!!",
        "review_detailed_main": "The former bodybuilder Schwarzenegger first entry on cinema industry acting in New York in a silliest movie that allowed he reaches later at stardom in Conan the Barbarian, his very first major successful picture, the rest is history, looking at for the low ratings gave by large majority of IMDB's users often bordering on lowest rating, it wondering myself why so hardheartedness in a funniest picture where was a vehicle to upcoming star with strong humor oriented, I'm not lawyer of Schwarzenegger at all, however it deserves more than the meager 3.3 medium rating.\n\nHe plays Hercules at Olympos ruled by God Zeus, as semi-god for an extramarital relationship of Zeus with a human woman, actually Hercules is upset living an everlasting boring life, thus Hercules asking for your father an opportunity to go down the Earth to learning over the humans there, even against his will Zeus surrenders, letting Hercules tore his head living among human scum down there, after takes a ride in airplane Hercules dropped at ocean rescued by a cargo boat, where he refuses to work due he is a semi-god, then all ship's crew should be proud by his presence there.\n\nOn the arrival at New York's harbor after a small fighting with the local guys he meets with a trickster guy Pretzie (Arnold Stang as pun Arnold Strong) that offer a help him at New York, what a disaster, wherever he goes end up in a mess, causing many damages, then Zeus demands Nemeses (Taina Elg) brings back Hercules to Olympus at once, June's Zeus wife (Tanni McDonald) underhanded she ordaineth to Nemesis poison Hercules to becomes weaker as human there, Pretzie gonna crazy with Hercules enters in a profitable contest of weightlifting imposes by Italian mobsters on high stakes, aside that Hercules beating up the bear at loose on Central Park is hilarious and fooling around on Big Apple with a claim on a chariot ride on Times Squares, not so bad!!\n\nThanks for reading.\n\nResume:\n\nFirst watch: 2023 / How many: 1 / Source: DVD / Rating: 5.5."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "dvdmrp",
        "review_rating": "4",
        "review_title": "Funny and weird",
        "review_detailed_main": "This is my first review so bear with me. I am an Arnold freak so I just had to watch it when it was on late night WGN. It was neat to see Arnie in his first role. Now I will admit it, it is a strange movie but it is funny at times. Arnie's dubbed voice is just retarded. The part when Arnie first comes to Earth is funny. So if you are an Arnold fan give it a look, and if you aren't it's totally up to you. Movie wise 4/10 Arnie wise 4/10"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "BandSAboutMovies",
        "review_rating": "2",
        "review_title": "Really rough",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Woodyanders",
        "review_rating": "8",
        "review_title": "A hilariously horrendous hoot and a half",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "mark.waltz",
        "review_rating": "3",
        "review_title": "This should have been a cartoon.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "sveknu",
        "review_rating": "2",
        "review_title": "I hope \"The Governator\" has forgotten this one",
        "review_detailed_main": "Arnold's acting debut came in a period in his life when I guess bodybuilding was his main interest. I certainly hope so, for he acts so bad in this movie that it's torture to sit through it. Bad acting from one person only doesn't necessary make a movie a total disaster, but when just EVERYTHING ELSE also are as horrible as they can be, then we have a movie that never should've been made. Here, I'll mention a few things that I especially noticed as bad:\n\nIn the fight at the wharf, you clearly see that the people who get pushed into the water stops at the edge, and then jumps into the water themselves. I guess they just found some workers at a ship nearby and offered them a dime each to take part in this scene.\n\n\n\n\n\n\nThis flick is only suitable for die hard-fans of muscle-flexing and bad German accents. Everybody else, Arnold-fans included, should avoid this movie at all costs."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Hercules in New York",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "thomas-hardcastle-2",
        "review_rating": "2",
        "review_title": "They tried to make a serious film, and made a hilarious comedy...",
        "review_detailed_main": "Ever heard the phrase, \"it's so bad that it's good?\" Well whoever said that never saw Hercules in New York.\n\nYou know the different factors one takes when analysing a film? Direction, acting, casting, editing, sound editing, cinematography, screenplay, etc. I don't think this movie has any of these factors.\n\nIt would be very tempting to say that this is the worst movie ever made, but Gangs of New York beats this comedy by a country mile in those stakes. Gangs of New York has to be the worst film ever created. If you want to waste three hours of your life when you could be painting a black wall black again, then watching it dry, watch Gangs of New York.\n\nHercules in New York is a comedy, and should be viewed as such. If you've bought it for a couple of quid/bucks/yen/euros, and you've got a bunch of stoner friends round for a sesh on the pipe, tell them that this is a comedy, and they'll believe you. I found it hilarious. It taught me nothing about film, but its complete and utter shite-ness generated more laughs than a night at a comedy club - so in some respects, it is genius. Enjoy, but don't even think about taking it seriously."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Richard Keith Carson",
        "review_rating": "1",
        "review_title": "Hilarious",
        "review_detailed_main": "This is on my list of the greatest bad movies ever, right up there with Robot Monster. Perhaps the funniest thing about it is that Arnold Stang seems like a really big star compared to everything around him -- his performance is the most professional thing in the movie."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "WillAtkinsonUK",
        "review_rating": "1",
        "review_title": "Definitely a must see movie!",
        "review_detailed_main": "So bad my sides were hurting! As one of the other reviewers has said: 'who cares if it is intentional comedy or not?!! ' Hercules is a BAD film - make no mistake! Forget about the blockbuster millions spent on his later movies - this is definitely from the other end of the scale!!! But if I am being honest - it is the most memorable Arnie movie of the lot!!! Only the most humourless souls will fail to be tickled by it....it is SIDE SPLITTINGLY FUNNY. Possibly as much as any other movie I have ever seen - including classics such as Spinal Tap and The Pythons etc I'm just disappointed that Arnie's best work is so rarely scheduled on British TV!! Watch it - and prepare to cry with laughter!!!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Enchorde",
        "review_rating": "3",
        "review_title": "Think I saw something like it with Pamela Anderson...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jkite",
        "review_rating": "1",
        "review_title": "See This Movie!",
        "review_detailed_main": "The worst movie ever! You must see this to believe it; bad acting, bad directing, bad editing, bad plot. Need I say more? Oh yes, Arnold speaking his most incomprehensible English. New York has never looked sillier. A possible sub-title: Crocodile Dundee on Steroids.Seriously, see this movie and hate it."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "noisyjam",
        "review_rating": "8",
        "review_title": "A comedy classic.",
        "review_detailed_main": "Many people have asked how and why I like this movie. The answer is that it is so bad, it's good. Yes it is probably one of the worst movies of all time, but the films many short comings make it extremely funny. If you don't believe a movie can be so bad it's good, avoid this film with a barge pole. If however, like me, you do, this is a comical classic. The plot, music and acting are terrible. Arnie is dubbed, and heaven looks suspiciously like central park. How this got made, I don't know, just be grateful it did."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "izzy4reel",
        "review_rating": "4",
        "review_title": "Lower your standards to sea level, and this is Steven Speilberg",
        "review_detailed_main": "True, this movie is as lame as you can get. But hey, give Arnie some credit! This was his FIRST movie. He didn't know what the hell he was doing! The material is cheap and grossly unoriginal and the SFX are unbelievably fake looking. You should watch this because it is a true peice of Schwarzenegger history. It is actually quite funny and very watchable. Don't expect quality, but you can expect a few good laughs. 1 of 5 stars."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "akpiggott",
        "review_rating": "2",
        "review_title": "Essential Viewing (but not for the right reasons)",
        "review_detailed_main": "I saw this for three quid on a web site once and couldn't resist. I'm not a fan of \"bad movies\", but I'd seen clips of this on television and it looked like an interesting debut for Arnie.\n\nThe clips I'd seen were dubbed by some American actor, which looks ridiculous now that Arnie has become so established. However the DVD only had the original Schwarzenegger soundtrack, which proved to be just as ridiculous. People complain about Arnold's accent now? It was so thick in this film, backed up with terrible acting (made his performance in \"Commando\" look Oscar-worthy), it's no wonder he was dubbed. You can barely understand a thing he says. As terrible as this is though, it's one of the main reasons to see this.\n\nThe concept of the film is ridiculous, it perhaps could've worked if it didn't take itself so seriously (ironically, it wouldn't have been as funny though). The thing that really disturbs me is that human beings conjured up this film, adult human beings. They wrote it, it was approved, people agreed to have a part in it, it was directed, it was shot, it was acted, it was edited, it was released, and people actually watched it.\n\nI only watched it once in its entirety, and that took a few sittings (despite its short length). It is mostly a very tedious experience. Thankfully there are some stand-out scenes that are absolutely (and unintentionally) hilarious. The bear wrestling scene for instance, it was like something from a Monty Python sketch. I found scenes like this were actually worth re-visiting, and the only reason anyone would want to keep this in their collection. I later sold it though, it just had no place on my shelf.\n\nOf course this film would be so much easier to dismiss (probably less ridiculous, and even more tedious), if it weren't for Arnie. It is the fact that he has since been cemented as one of the biggest movie stars of all time, and this is where he started. Although he'd already established himself as a body builder at this point, he continued to win more contests, became a huge international movie star, is now the governor of California, and might even be President one day, all with a thick Austrian accent. Looking at \"Hercules in New York\" is a reminder, there's hope for us yet. 2/10"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jfgibson73",
        "review_rating": "5",
        "review_title": "Silly Fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "derviodestro",
        "review_rating": "1",
        "review_title": "Awful acting",
        "review_detailed_main": "Awful acting and there is nothing else about it.\n\nArnold voice was dubbed then they abandoned that and eventually released it with his original voice. You can't get the dubbed version anymore.\n\nHe can't act, he can't speak... wtf is he even in movies for...\n\nI wish people in charge of these things spend their money on more useful things or AT LEAST hire someone who can act for a change.\n\nThere are so many talented people yet most movies are filled with people who are not even actors at all."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "erwan_ticheler",
        "review_rating": "1",
        "review_title": "Watchable for just one evident reason",
        "review_detailed_main": "The fact that this ridiculous movie is to be seen is the fact that Arnold Schwarzenegger plays in it,even more so,it's his screen debut. And what a laugh!The man is totally failing in every aspect of acting and his speech is so bad that it becomes absolutely funny.That's where the charm of this movie lies cause in every other way it is a bad 90 minutes of celluloid.The story sucks,the acting is worse and the camera-work is terrible.\n\nNevertheless,a must see for everyone who wants to know something about cinema and it's rather strange history.We had to wait another 10 years before Arnie came back in a big way with Conan the Barbarian.\n\nCinema history,for sure,although it will never be written down in any book about the subject."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Harlekwin_UK",
        "review_rating": "2",
        "review_title": "Messy and dire movie, the £1 price tag over values this movie, very very poor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Btc400",
        "review_rating": "3",
        "review_title": "Hilarious, but worth watching!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "diavlo-1",
        "review_rating": "10",
        "review_title": "I am ERCULEES....need i say more??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "ian-78",
        "review_rating": "1",
        "review_title": "Possibly the worst film I have ever seen!",
        "review_detailed_main": "In the whole of my life, out of all of the films which I have seen this must be the most atrocious one of the lot. When I saw this movie all I could think about it was bad things, it was a real poor show, even worse than some of the really old stuff from the twenties or something. The only thing that boosted this film for me was the fact that Arnold Schwarzenegger was in it. But to add insult they didn't even use Arnie's voice. This film just isn't worth the time of day, it should have been burnt the moment it was maid. Fancy not using Arnie's voice, what a disgrace!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "rick_z13",
        "review_rating": "10",
        "review_title": "this was a fantastic movie",
        "review_detailed_main": "i thought it was a fantastic movie. i loved it! the music helped me out with my decision too. the music was great. im not being sarcastic. it was really funny too. i liked the part when he fought the bear, lol. i was looking around to see if i could buy it somewhere but unfortunately i couldnt find it. it was a good movie and for all you other people who said the opposite, you all have your own opinions, but i am sorry, they are wrong. arnold was a good actor in this movie, assisted by \"Prezi\", or however it is spelled. the movie was entertaining to me. arnold, you are nummer EINS! JA! Sehr gut film Arnold, Sehr gut! well, all you other people, the movie was great and i will see ya'll later TSCHUS!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "fiiig99",
        "review_rating": "10",
        "review_title": "The Bear Scene",
        "review_detailed_main": "This movie was hilarious. So bad it's good.\n\nSurprisingly good supporting cast. This movie is so insane, cardboard performances, ridiculous chase scenes.\n\nHercules has no need of money. Hercules stiffs everyone in new york then beats them up.\n\nWatch it for the bear scene alone.\n\nRecommended to people who have a sense of humor."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "rvnc",
        "review_rating": "10",
        "review_title": "Magnificently bad, a work of art",
        "review_detailed_main": "The tag 'it's so bad, it's good' is banded around too much but this is one film which truly embodies that sentiment. From a serious cinematic view it's appalling in every category, but at the same time it may be the funniest film ever made because of it. I watched it on recommendation recently and it had me stitches. There's so much to laugh at and so many hilariously stupid sequences that this is required and essential viewing for anyone. Regardless of whether the comedy is intentional or not, it's one of the most entertaining films ever.\n\np.s If you thought Arnie was bad in the 80's and 90's you should see him here. He's clearly trying his hardest, but he's so bad it makes you wonder if it's deliberate. I've seen slabs of concrete with better acting skills than this."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "crip1163",
        "review_rating": "10",
        "review_title": "Pretzi!",
        "review_detailed_main": "There is only one reason to see this movie and it is not the wonderful Governor of California...it is the small Jewish sidekick that makes this movie a masterpiece, one for the ages...my man PRETZI!!! That's right, the man is the epitome of the Jewish New Yorker and I have never seen a more lifelike portrayal of one since in a movie. In fact, he does not even need to speak at all. His amazed facial expressions during the scene where Hercules throws the discus and then the javelin are moving and touching. I love when that man opens his mouth in astonishment. It is too bad that he did not make any more substantial films, most likely because he was just fed up with stardom. Pretzi is a film character that will live on throughout the ages and Arnold would not have the fame that he does today without the amazing portrayal of Pretzi by the true Arnie, Arnold Stang."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "bfp06-1",
        "review_rating": "10",
        "review_title": "Hilarious!!!!",
        "review_detailed_main": "OK, having only payed one pound for this in a DVD sale, i can safely say i had very low expectations and i had only bought this to watch for a laugh, well me and my mate have never laughed so much in a movie before! Its obvious Arnie could'nt speak barely any English and it just adds to the humour, some of the acting is just appalling the grisly bear fight will stay in my mind forever, the actor in the suit acts more like a gorilla than anything and as soon as Arnie sees the poor bear he begins to beat the crap out of it, well more of a play wrestle than anything then his girlfriends actress trys to faint.... after looking at the camera and screeching some garbage about beating him up. How she became an actress is beyond me. Anyway if you want 90 minutes of unadulterated crap that will make you cry with laughter then check out Hercules in new york!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "chefrichard-707-557493",
        "review_rating": "10",
        "review_title": "Bahahaha",
        "review_detailed_main": "This movie is epic! Pure unintentional comic gold!!!! So so bad... so bad its good!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "moviefan-85",
        "review_rating": "10",
        "review_title": "Arnolds classic debut!",
        "review_detailed_main": "I just bought this movie on DVD. I really liked it! It was funny. Im Arie fan so it was to me treasure. I kinda liked more than Arnies other films. It was great movie. Arnolds debut on the screen. Luckily I got both audiotracks on DVd, Theatrical where Arnies voice is dubbed and original not dubbed track. GREAT! I cant imagine why they dubbed Arnolds voice. I understood everything that he said in the movie. So funny movie! This is Arnolds mark in his career, I dontt mean Conan and Terminator, I mean this was ARNIES FIRST MOVIE EVER!If you are Arnie you just must see it! And if you are not, see it anyway, because its so good comedy. How somebody cant like it? Great movie! overall: ****/*****. SEE IT NOW!!!!!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jacksflicks",
        "review_rating": "9",
        "review_title": "Of course it's great!",
        "review_detailed_main": "How this missed the Mystery Science Theater 3000 canon I'll never know. Did they want too much for the rights, or did Ahnold want every copy destroyed? But why? Hercules in New York -- aka Hercules Goes Bananas -- is a classic! I don't understand how those who, like me, fall off their chair laughing can give this movie only one or two stars. A flick with this entertainment value should get a high rating, not a low one. I mean, do you not want to share the joy it brings with others? For me this one ranks up there with Plan 9 from Outer Space and Manos Hands of Fate as the best worst movie ever made. Ahnold should feel honored, and he has such a great sense of humor, I doubt he really wants to burn the copies -- I'm sure he showed it to his kids, and it will be passed on to his grandkids and great grandkids. Same with you. Wouldn't you like to see your grandkids's faces -- let's say, as teens, so they can be in on the joke -- when you show them one of your \"favorite movies\"? Not Apocalypse Now or Sleepless in Seattle, but Hercules Goes Bananas!\n\nOK, let's start with Ahnold. Yes, I think his is his first real dramatic movie, and I use \"dramatic\" only technically. I mean, this is pre-Conan, and you know what a wonderful actor he was in that. Then there's the voice dubbing. Now, in my copy, the voice has nothing to do with Arnold. (I know others insist it's his.) I hope your copy has this voice, because to hear it coming out of Ahnold's mouth is very, very moving. Then, there's the soundtrack. Bazuki music! What can I say? Then, there's Arnold Stang. Arnold Stang??? Stang was one of the more serviceable comic supporting actors of his day, which by the time he made this was long past. But never mind...to cast Stang as the sidekick reveals to me that the producers really didn't mean to make a serious movie. It's like casting Woody Allen for the part and making him play it straight. The result is beyond bizarre.\n\nWhat you do, if you're still young enough to have fun being silly, is to find a Friday night or Saturday afternoon and invite you best friends and have brewskies and weed and watch as this thing unfold.\n\nBy the way, I took off a point because, after all, it is terrible."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "khim",
        "review_rating": "9",
        "review_title": "\" But I am [Hörkulies]\"",
        "review_detailed_main": "Arnold's föerst movie is a \"must-see\" for every Arnold fan on the planet.\n\nYou shall not see this movie if you want to be stimulated intellectually, but instead see it and be enjoyed by it. I think this movie is so cool because Arnold seems so stupid and it is sometimes hysterically funny. Some moments in the movies makes it all worth to see it.\n\nThe plot is kinda weird and the lasts scenes is very hard to understand, but still the entertainment is in frontseat.\n\nOf course is it primitive and the dialogs are stupid but it is cult! The whole idea with this film is (to my opinion) to gather with your best arnie-friends, buy a lot of beers and then see it. Trust me, that will be the event of the year.\n\nI'm out"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "joachimto",
        "review_rating": "9",
        "review_title": "Arnolds first movie?",
        "review_detailed_main": "This is such a fun movie! Of course only fun in the sense of being terrible awful. But if you happen to like those crabcake movies, like me, its simply one of the best! The movie shows Arnold in his true form; I mean, he is gigantic! As big as a horse! He is even bigger than when he was shooting Conan the Barbarian. And his English - HAHA! - its fantastic. I'm so glad that I bought this title.\n\nI've heard this is Arnolds first movie, though I'm not sure. I think maybe it was the \"prize\" from winning the Mr. Universe.\n\nThe best thing in this film, and maybe in every film I have seen, is the awesome actor in that bear costume! I'm laughing just thinking about it! It was so awesome! Cheerio"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "ghettosvend75",
        "review_rating": "10",
        "review_title": "A brilliant experience....",
        "review_detailed_main": "When I first heard about this movie, it sounded to good to be true. A movie about Hercules going to New York, featuring Arnold Schwarzenegger in his first lead role and if that was not enough - not at a single time in this movie do you hear his voice. His English was so bad that they actually dubbed him through the entire movie.\n\nI went to my favourite videostore and was thrilled to find it, and I was not disappointed. I won´t go into detail about the plot, but I can reveal that this was truly a masterpiece. It tells the classic story about a man who goes on a quest to find himself and to be reunited with his true love, and on his way he has to overcome various obstacles to reach his goal. What more can you possibly ask for?\n\nIf your a fan of movies made that are made by people who truly believe in their work, if your an Arnold enthusiast, if you were touched by Titanic, if you love action scenes where the film makers have used the forward button to create the effect of a car driving fast - then this movie will be guaranteed a top spot on your personal top ten!\n\nIn other words if your a b-movie fanatic, do not miss this movie!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "PaulEspoz",
        "review_rating": "8",
        "review_title": "Best unintentional comedy!",
        "review_detailed_main": "i went into this film with low expectations...So happy i watched this epic film. As bad as the film is i still found it one of the funniest films I've seen in a long time,the acting is awful, the plot does not really make any sense at all.their is a scene where Arnie is fighting a bear (I'd watch the whole film just for that scene).if you are a fan of Arnie or just bad acting then this is the film for you.this film deserves a higher rating,10/10 comedy.I found myself in a laughing fit every few minutes its that good/bad? I would easily recommend this film to anyone,I'm looking forward to watching it again soon, A MUST SEE FILM!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "manuel-b",
        "review_rating": "10",
        "review_title": "Hercules, a son of god-father Zeus is sent from Olympus to earth by an accident. Visiting the earth is his dream by chance and so he enjoys his time there.",
        "review_detailed_main": "I'm sorry but I simply have to vote 10 points for this movie. But I also have to add that this voting refers to a special version, namely the unsynchronized one. This version charmless uncovers Arni's real voice during a period of time when he just mutated from a bode builder to a kind of actor. People in Germany must cry because of laughing when watching the movie and especially listening to Schwarzenegger's English with Austrian pronunciation. If you pay attention the every detail of the movie you will detect some traffic noises during the scenes on Olympus. It seems to be made in Central Park. (?) The real fans of this movie even knows the best phrases of Arni by hand. But I hope that there are also some English or American English speaking guys who agree with that kind of humor the dialogs offer. If you visited Austria and remember the characteristic dialect you know what I mean.\n\nMy thesis: One of the funniest movies ever! See it!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "yorio23",
        "review_rating": "8",
        "review_title": "Awesome",
        "review_detailed_main": "So Arnold, straight out of the Mr. Universe contests, plays (what else) a god in this 1970 movie, that gives laugh after laugh after laugh. With hysterically clumsy dialogue (\"The way you were staring at me, I thought I had a hair out of place or something of the sort\", and \"Tea- the conventional social drink!\"), honking cars in the background of Olympus, and a short-haired Samson (the biblical Samson, who happened to be summoned by the gods), the enjoyment never wanes."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jmanj78",
        "review_rating": "8",
        "review_title": "Fantastic--one of the best bad movies I have seen",
        "review_detailed_main": "This is an amazingly bad movie. It's so bad, it is downright hilarious. My friends and I watched this (knowing full well it would absolutely terrible), and within the first two minutes we knew we had a winner. The opening narration had us rolling on the ground. For a while it was just bad, but then there was the fight with a bear, which had escaped from the zoo. First, you hear on the police report that the bear is a \"grizzly,\" one of the largest and most aggressive bears in the US. When the camera pans over the cage where the bear was held, the sign distinctly says \"black bear,\" a much tamer species. Then we actually see the bear. Or, at least I think we do. It looks more like a small ape with a bear's head. Probably because it's a guy in a really horrible bear suit. Ah-nuld proceeds to lay the smack-down. Hilarious scene. And then there is Hercules' sidekick, a Jewish guy named Arnold Stang, and the most stereotypical Jewish character ever. It's terrible, but ironically funny. What's even more strange is that the director and the producer were both presumably Jewish, and yet they wrote in a ridiculously stereotypical Jew.\n\nThis movie jumps into my number one spot of \"Movies that are so bad they are great,\" leaping over \"The Scorpion King.\""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "WesTurner",
        "review_rating": "8",
        "review_title": "Make certain you see the ORIGINAL version",
        "review_detailed_main": "The first released version had all of Arnold's lines dubbed! Apparently they thought that his heavy accent wouldn't make it. The only version I've had the luck to see was the ORIGINAL with his voice. It's obvious that they knew he was to be dubbed out from the way he just (boringly) says his lines, no emotion, no feeling, just words.... of course it MIGHT be that he really WAS trying, but <shrug> he just wasn't an actor!\n\nObviously that's changed now! What a way to start a career, and am I glad he did it! All of his recent movies are GREAT. This one is a good one to see, if just to see really how far he's come!\n\nKeep in mind the era, and don't laugh too hard at the fake fighting. :-)"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "luukjordens",
        "review_rating": "9",
        "review_title": "If you're looking for a fun, solid movie with unmatched acting skills and great music soundtracks...WATCH THIS!!!!1",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "davedavidedwards",
        "review_rating": "10",
        "review_title": "Amusingly Bad",
        "review_detailed_main": "Stronk Austrian Hercules fights bear that looks suspiciously like a man in Central Park to Grek music whilst woman screams his name and faints.\n\nWat means?"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jwilbers-81233",
        "review_rating": "10",
        "review_title": "The best movie ever!!!",
        "review_detailed_main": "The bear scene was amazing and the actor Arnold is the best in the world! Amazing plot twist and very intense!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Logixp13",
        "review_rating": "10",
        "review_title": "Entertainment",
        "review_detailed_main": "Entertainment. That's why I gave this movie a high score. Hercules in New york is the kind of movie you can watch with you friend's (if your not up-tight about movies) and laugh. I found Hercules in New York at a video rental agency down the road in a bargain bin, \"Arnold's real voice for the first time ever!\" It proudly exclaimed. I bought it for £2 ($3) and it was definatly worth the money. It's filled with pointless fights and pointless dialog, in one scene during the film 'Hercules' grabs a fork-lift truck and holds it, then he says \"TIS A FINE CHARIOT BUT WARE ARE ZE HOURSES!\" Then he lets it go. It's one of those so bad it's funny, much like plan 9 from outer space, accept it doesn't take itself as seriously and is much more enjoyable.\n\nI guess what i am trying to say is it's fun, it's silly and it's enjoyable. Buy it cheap if you can. 7/10"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "mladenilic",
        "review_rating": "10",
        "review_title": "Schwarzenegger's fans must see this movie!",
        "review_detailed_main": "Listen, this is a very entertaining movie. It's hilarious. I laughed my ass off while watching this stupid but very funny movie. I mean, here we have Hercules (Arnold) with a terrible German accent?!? How funny is that??? :)\n\nMinor spoiler here: The funniest scene to me was when Arnold fights with a bear who is very poorly animated (You can clearly see that the bear (man that wears the costume) is smaller than Arnie !\n\nNevertheless, I'm a Schwarzenegger fan. I've watched all of his movies and enjoined in single one of them , including this one! Like any other Arnie fan , I strongly recommend for you to watch this movie. I ain't gonna say that this movie is underrated, it's not, but that doesn't mean at all that it's boring , on the contrary , it's very enjoyable to watch! :)"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "thegosv",
        "review_rating": "10",
        "review_title": "Does he? DOES HE!!?",
        "review_detailed_main": "Arnold Schwarzenegger, now the Governor of California, started his illustrious movie career in this film. He was credited as Arnold Strong, because it was suggested that it would be a more suitable name for him.\n\nHercules in New York is the story of a man born of the gods who travels from Mount Olympus to New York due to his current lack of excitement. He instead finds a female companion and ends up with a rival in the form of a fellow body-builder.\n\nThe most important thing to remember when watching this film is that you must not take it seriously. Arnold obviously was still perfecting his use of the English language (some argue that he has yet to do so) and his errors make for the some of the films funniest scenes. The film is supposed to be comedic, as shown by the track and field events, but it's Arnold who makes the film as funny as it is. No film can be so bad it's funny, because laughter is evidence of enjoyment. It's one of those films you love to hate. Definitely one for a rainy day!\n\nLOOK OUT FOR: The boyfriend of Arnold's female companion. He was also the track and field contender and seems to take losing in sport (and perhaps love) pretty well!\n\nLOOK OUT FOR: The bear. Made the film cheaper than you could ever think possible."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Sporty",
        "review_detailed_main": "I like the bit when he throws the javelin really far"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "mr_facehead",
        "review_rating": "10",
        "review_title": "another Arnold classic",
        "review_detailed_main": "Schwarzenegger is, and probably will always be, the best action hero in the world.\n\nthis film, contains: amazingly bad acting random scenes, music, and direction the stupidest story in the world the cheesiest lines you'll ever hear\n\nwhich is why this film goes down as one of Arnold's greats! Arnold\n\nfilms are like marmite, you either love them, or hate them, and it doesn't matter what you feel about it, it's always because the films are crap. obviously this isn't enjoyable because of how great a film it actually is, it's because of how bad it is. so, if that kind of thing has the potential to make you laugh, then you will definitely be entertained with this one. but if you simply do not find Arnold like bad films funny, and only like film that are actually good, then you'll be terribly disappointed."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "fence10",
        "review_rating": "10",
        "review_title": "Greatest Movie of All Time!!!!",
        "review_detailed_main": "Heh, Heh, Heh:). One of those classic movies that is so bad that you have to watch it again and again. Now we can even see this movie with the original audio track. I can understand what Ahh-Nuld is saying. Why would they need to dub an Oscar deserving performance like that???? I think I'm going to watch again right now!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "chicago1177",
        "review_rating": "10",
        "review_title": "Pretzie is my father",
        "review_detailed_main": "This is easily one of the best films in the history of cinema. I don't see why we can't have Hercules represent us in the summer Olympics either...based on his very measurable feats of strength, speed and agility in the park, I believe he deserves a spot on the US roster.\n\nI bought this movie on VHS via Amazon.com in 1997, and remember with excitement the day I was able to pick it up...\n\nIowa City had never seen a shin-dig as big as the one we threw at Mayflower Residence Hall that evening, celebrating the arrival of Arnie as one of the finest actors of our generation. And then J-Bob Peacock asked us to quite down.\n\nGreat movie!\n\nYOU CAN'T DO THAAAAAAT!!!!!!!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "terminated7203",
        "review_rating": "10",
        "review_title": "The bear scene made this movie awsome",
        "review_detailed_main": "I gave this a movie a 10 cause it was pretty darn funny. It wasn't exactly Arnold's type or best movie but the bear by far, saved this movie. Arnold's voice being dubbed I didnt like even if you couldnt understand what he was saying. This is a must see for all people!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "MovieAddict2016",
        "review_rating": "10",
        "review_title": "One Of the Most Hilarious \"Cheap\" Films Ever!",
        "review_detailed_main": "I can't believe how hard I laughed at the \"Grizzly Bear\" scene, which magically transforms from an \"American brown bear\" to a \"Grizzly bear\" (look at the sign at the zoo, then listen to the radio transmission by the police).\n\nThe seen where \"Herc\" fights the bear is so ridiculous, that you just have to laugh! This film is one of the all time best \"cheap\" films, following in the steps of all the others before it.\n\nI was lucky enough to view this on AMC, where they provided the version where Arnold \"Strong\" Schwarzenegger ISN'T dubbed.\n\nHe got the part of Hercules because his agent told the director of the film that Arnold spoke great English.\n\nIf you enjoyed such \"classic\", dare I say, films like \"Santa Clause Conquers the Martians\" then you'll love Hercules in New York, which co-stars Arnold Stang as \"Pretz\" I believe was his name. 5/5 stars on a scale of stupidity at the movies!\n\nBTW: Was that Nikes the \"bear\" (which looked more like a gorilla costume on Halloween-a bad one, mind you) was wearing?\n\nJohn Ulmer"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "kingdaviduk",
        "review_rating": "9",
        "review_title": "Great movie but do not expect the most professional",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "asenstoyan4ev",
        "review_rating": "9",
        "review_title": "Early, raw, excellent version of young Arnold",
        "review_detailed_main": "o you know why Arnold is flexing? Because this is the first ever film starring the then- aspiring bodybuilder Arnold Schwarzenegger. In fact, this is the only thing that he is doing the right way in the whole movie-flexing.arnold is flexing\n\nArnold's debut motion picture is a raw and hilarious representation of the young version of one of the most successful men in the world.\n\nSchwarzenegger's evident lack of on- screen experience make this movie looks more like a documentary on bodybuilding.\n\nBut first things first.\n\nThe plot:\n\nTaking place back in 1970 when Arnold is still an adolescent, the movie tells us the story of the powerful gods of Olympus- the home of the Greek Gods.\n\nThe plot centers more on the life of Zeus and mostly on his son Hercules (guess from the first time, which Austrian oak took the role).\n\nThe young Hercules is spending his glorious but boring adolescence in Olympus- a kingdom far above the clouds among his divine family. One day he decides to disobey his father's will and escapes to earth.\n\nThere, he is starting to explore things he has never experienced before- he falls in the trap of love and he struggles to become an undisputed bodybuilding champion.\n\nThe cast:\n\nWhat cast?! Only Arnold is important here. He is also the only known name in the production.\n\nIn fact, by the time, he was only a young bodybuilder who was trying to make his way to the Hollywood top, just like many other aspiring actors with a certain amount of self-esteem.\n\nThis is a Funny Action Movie because:\n\nLike previously noticed, this is the first Arnold movie ever! He is so inexperienced in acting that you risk to have shortness of breath from laughter while watching the young Austrian desperately trying to be an actor.\n\nOriginally, Schwarzenegger's voice was dubbed because he barely spoke English at the time. Later, however, when the DVD version was released, his own voice was included in the movie.\n\nIt won't be far from truth to state that once the DVD version of the film was released, it gained international success. It is just my personal opinion here but I believe that it is due to the fact that then, for the first time, the world heard Arnold's legendary and ridiculous Austrian accent. And that changed everything.\n\nThe plot is so primitive, the directing so poor and the acting so bad that it hurts. The whole movie is a complete nonsense from the beginning to the very end.\n\nIt is like someone decided on Tuesday to make a movie and on Wednesday it was all wrapped up and ready to be on screen.\n\nThe cast is disturbingly inappropriate and the acting is pathetic.\n\nBut wait!\n\nIsn't it exactly what we are looking for? That's right. That is the whole idea of it.\n\nIt is a sick fun and be sure that it is enjoyable. Arnold's accent is terribly hilarious and God forbid, don't watch this movie dubbed!\n\nJust experience Arnold crying out like a five year old retarded child \"I am Hercules\" a thousand times or \"No man is superior to Hercules\". The accent, combined with his funny face moves can easily make you go into spasms of laughter.\n\nMake sure that you don't miss the part at the beginning of the movie when he complains to his mighty father Zeus that he is \"tired of the zame old zings, the same old facezz\".\n\nAt this time, you won't be sure if by the end of the movie Hercules will become bodybuilding champion but somehow you feel that he will definitely win the \"who got the most ridiculous accent\" competition.\n\nThe funniest part is when Hercules is walking on the street along with his hot date and spots a bodybuilding competition poster with some tough man on the cover.\n\nHe immediately goes angry and jealous. With the blink of an eye, he tears up his tight t-shirt and starts flexing his giant muscles in order to prove to his girlfriend that his is the God of the gym. He moves like a wounded panda. It is truly spectacular to observe.\n\nAnother great scene is the scene with the bear. The extraordinary muscular Schwarzenegger takes his girl on a romantic carriage ride. All of a sudden, a bear comes out of nowhere and stands in front of the carriage roaring loud and menacing the lives of the couple in love.\n\nWhat do you think happens?\n\nArnold jumps off the carriage and starts a spectacular one on one fight with the bear. I won't put spoilers here. I would just mention that the animal activists might get angry.\n\nDuring the whole movie Arnold's expressionless gaze and stiff acting are combined with the boring and inappropriate soundtrack, dramatically dull actors and poor directing. The dialogue is also very, very bad.\n\nConclusion:\n\nNot only this is a must-see movie but if you ask me, it even should be included in your bucket list right after the \"parachute diving\" check off.\n\nSeriously, this gem perfectly serves its purpose-to distract you, to make you feel good and to make you laugh no matter if you are an Arnold Schwarzenegger fan or not.\n\nwww. funny action movies.com"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "slimer8489",
        "review_rating": "9",
        "review_title": "Underrated Enjoyably Bad Fun!",
        "review_detailed_main": "Okay, I first heard about this movie when it was reviewed on Cinematic Excrement, an online show that I enjoy very much. Then one day, I was walking down the aisles of Walgreens when I saw this in their DVD selection. I had no money at the time, so I didn't get it. Then, in May, I was walking down the aisles of Walgreens, but this time, I had four bucks to kill! So instead of blowing it on candy, I blew it on this movie, and it was a four bucks worth blowing. This film is very enjoyably bad. Arnold's acting is very wooden, and I always make fun of the way he says \"Hercules\". The budget looks very TV movie-Esq. I love Zeus, even though he looks like he really doesn't want to be in this movie. I love how the fight scenes are barely fight scenes, they're either pushing or tossing. The editing is very bad, as well, mainly the scene where Hercules is showing off his \"mad\" Olympic-like skills. We see him jump, then people with wide-opened mouths, and then Arnold land.\n\nIt's a shame that this movie isn't celebrated like the way I do. It should be worshiped for how bad it is, like Plan 9 or Manos. I say, whenever there's a new movie about Herc coming on TV or to theaters, forget that and pop in this flick!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Gimili10",
        "review_rating": "8",
        "review_title": "I hate Schwarzenegger, but I like this movie.",
        "review_detailed_main": "I am not the kind of person who enjoys Arnold Schwarzenegger movies. I find them rather annoying, and I wonder what society has come to when a man with the all-around ineptitude of Schwarzenegger gains the demigodhood moviegoers have known him for. \"Hercules in New York\" is an exception. Not because it's a good movie--it's definitely horrible. But it does have an unintended laughter quality that redeems it.\n\nIt's common knowledge that this is Ah-nold's first movie. Fresh off his bodybuilding days but pre-steroid abuse (you can tell these things by looking at him), he is Hercules, half-mortal and half-god son of Zeus, king of the Olympian gods. Well, kinda. There's a crapload of stuff taken from other myths as well. Anyway, Hercules has lived on Mt. Olympus for thousands of years, and is bored. So against Zeus' wishes, he goes down to Earth to have some fun.\n\nBy now, you gotta be thinking, \"what a stupid plot.\" True. The acting is also mostly, but totally, bad. There's also really bad dialog. And the action scenes look like a the writer based them off a playing session two children had with action figures.\n\nBut that's the charm. You'll laugh throughout the movie, particularly young Arnold's miserable attempts at acting. It's the kind of movie that you'll laugh at, make fun of, and have a howling good time watching. Particularly when Arnold is driving a chariot and wrestling an obviously fake bear that moves like a gorilla.\n\n\"'Hercules in New York' is the touching tale of an Austrian bodybuilder who thinks he is a Greek demigod. he doesn't fit in, but a little bad dialog and flexing of his body gain him instant adulation.\"\n\nYeah, that's the kind of bashing you might give this movie.\n\nSo go get a bag of popcorn, a bag of popcorn, and enjoy this movie. Hey, you should; it spawned a video game for the Nintendo Entertainment System. Agh..."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "lebbon",
        "review_rating": "10",
        "review_title": "Best Film Ever!",
        "review_detailed_main": "Those who have already seen this film automatically know how good this film really is. I would like to let others know how much i would like to stress to you to watch this film.\n\nWARNING:once you have seen this film you will become enlightened and will treasure these moments forever.\n\nArnie's acting is amazing he acts for toffee (and everyone wants toffee). His word perfect English mixed with understanding about whats actually going on is amazing and keeps the film going.\n\nThe incredible costume and expensive settings let alone the intellectual story.... i mean WHY wasn't this film made earlier? What a productive use of money!\n\nTHIS IS A MESSAGE GOING OUT TO THE CREATERS OF 'HERCULES IN NEWYORK' AND ALL THAT WAS INVOLVED.....you make me giddy like a little school girl!!!\n\nIf it were up to me i would re-release the film on special addition, and attempt to redeem any quality from this film that was once lost.\n\n.....its a MUST NOT SEE"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "carsonj-1",
        "review_rating": "10",
        "review_title": "The greatest Old Movie that has ever existed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Da Governa Of Cal-if-ornia...!",
        "review_detailed_main": "Was Comin' To New Yawk City As Her-cu-les, Ja? This was Auh-nulled Schwarzenegger during his early days.\n\nBefore \"The Terminator...\" Before \"Jingle All The Way...\" Before he became the governor of California...\n\nHe starred...in very not-well-known films. This movie was one of them. I know \"Pumping Iron\" was another such example, but this review focuses on \"Hercules in New York.\" I don't want to give out too much detail; I just want y'all to go watch this movie so that you, too, can experience the excitement that are known as...early Auh-Nauld Schwarzenegger movies!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "fuzileer",
        "review_rating": "10",
        "review_title": "Its fantastic. Its Stupendous. Its crap.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "eatpajdittsvin-520-811150",
        "review_rating": "8",
        "review_title": "Scores highly on So Bad It's Good scale",
        "review_detailed_main": "Arnold Schwarznegger (whom you've heard about) and Arnold Stang (whom you probably haven't heard about) is certainly among the most (unintentionally?) funny comedy duos in film history... Stang manages the most awfully hilarious facial expressions while Schwarznegger has none at all in this early stage of his acting career, giving the no brains only muscle stereotype a (false) play here.\n\nOther highlights:\nTHE BEAR vs ARNOLD\nAn incredibly annoying music loop on repeat throughout the film."
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "panny180",
        "review_rating": "10",
        "review_title": "This movie is pure unintentional genius!",
        "review_detailed_main": "I recently bought this on DVD for a heavy price of 1p (Yep, I was well pleased) and it is among the funniest movies I have ever seen! Be amazed at awkward acting taken to the extreme! Gasp at random reaction shots of one of the lamest comic characters ever! Wonder at a man in an ape suit interrupting the most unintentionally funny romantic scene in memory! This is Arnie's first lead role as an actor. And I use the term \"Acting\" to it's very loosest extent. If your hoping for a quality comedy, your looking in the wrong place. It's cheesy, it's poorly directed, it's sometimes difficult to keep up with what's going on and the \"Action\" scenes look like they were Choreographed by a six year old. Despite all this movie's shortcomings, you can't help but love it. The director (And Arnie) have clearly tried their best and the results are jaw clenchingly hilarious.\n\nEd Wood would be proud!"
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jeffhardy1",
        "review_rating": "",
        "review_title": "Wacky!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "felsenheimer",
        "review_rating": "",
        "review_title": "what a movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "airyanne",
        "review_rating": "",
        "review_title": "Confusion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Dr Banzai",
        "review_rating": "",
        "review_title": "The film that launched a career",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "morke",
        "review_rating": "",
        "review_title": "The Oak's kick-starter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Big Movie Fan",
        "review_rating": "",
        "review_title": "Very Good Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Bobs-9",
        "review_rating": "",
        "review_title": "Arnie speaks again!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jimhass",
        "review_rating": "",
        "review_title": "Bad acting except by the pects",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "LOK-3",
        "review_rating": "",
        "review_title": "Arnold Schwarzenegger in his prime, as a schmalzy Hercules",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "grinch-2",
        "review_rating": "",
        "review_title": "What No Oscar?? :)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "illusion123",
        "review_rating": "",
        "review_title": "wow... that's all i can say about that.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Sparki",
        "review_rating": "",
        "review_title": "Sensational Strongman!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Corky1984",
        "review_rating": "",
        "review_title": "Arnie at his absolute worst!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "amol_gh",
        "review_rating": "",
        "review_title": "Hillarious !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "giatime",
        "review_rating": "",
        "review_title": "Arnold Rules!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "sebpopcorn",
        "review_rating": "",
        "review_title": "The Gods of Central Park",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jellyneckr",
        "review_rating": "",
        "review_title": "The only bad Schwarzenegger flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "Harry_Tasker",
        "review_rating": "",
        "review_title": "UNBELIEVABLY AWESOME!!!!!!!1",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "jazzsafari",
        "review_rating": "",
        "review_title": "Saw it on AMC with HIS voice!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "fleischwolf",
        "review_rating": "",
        "review_title": "Great fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0065832",
        "movie_name": "Hercules in New York",
        "movie_rating": "3.3",
        "review_username": "CableCow",
        "review_rating": "",
        "review_title": "\"HA HA HA! YOU HAVE STRUCK HERCULES!\" a instant classic",
        "review_detailed_main": ""
    }
]