[
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "danielmanson",
        "review_rating": "8",
        "review_title": "One of the best endings I've seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Hitchcoc",
        "review_rating": "9",
        "review_title": "I'm Glad I Finally Got a Chance to See It",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "thinker1691",
        "review_rating": "9",
        "review_title": "\" The Greatest Trick The Devil Ever Pulled\"",
        "review_detailed_main": "Out of the mind of Christorpher McQurrie comes this incredible story of a man in search of the devil. The film is called \" The Usual Suspects\" and what could be more appropriate than an unusual movie about five suspects who are anything but usual. The story originates with the only survivor of what the police conclude was a murderous and explosive drug deal gone bad. His name is Roger Kint (Kevin Spacey is perfect) also known as 'Verbal.' From the mouth of this innocent storytelling, con-artist comes the fantastic tale of how he and his fellow criminals, Stephen Baldwin, is Michael McManus, Benicio Del Toro is Fred Fenster and Kevin Pollak as Todd Hockney were originally assembled and then set-up. Beginning with a mix-up by law enforcement to put several guilty men together in the same line up, the tale proceeds cross country and culminates with a powerful, but mysterious kingpin by the name of Keyser Soze. It's through his attorney, Kobayashi (Pete Postlethwaite), the men learn they are marked for death unless they undertake a dangerous assignment. The center piece of the Unusual group is their leader, a remarkable individual named Dean Keaton (Gabriel Byrne, incredible performance). What transpires in this movie from moment to moment is a lesson in sleigh of hand. What we and the police Dave Kujan, (Chazz Palminteri) are told is not what we see. Conversely, what we see is not what we have been told. In the end, this film with it's haunting theme by John Ottman, is nothing short of incredible. A superb classic in both mystery and action entertainment, by Bryan Singer. A great film indeed. ****"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "TIDQ",
        "review_rating": "10",
        "review_title": "The most enjoyment you'll have seeing a movie for the *second* time",
        "review_detailed_main": "Ah, the Usual Suspects. My personal favorite movie of all time. Don't let my bias be a fool. Perhaps it's not THE best movie ever, but it's one that I never get tired of.\n\nIf you like flash and bikinis and breath-taking camera angles, you won't find them here. Usual Suspects is not an \"epic,\" and it doesn't pretend to be. It's a modestly-budgeted piece by a fresh director (who later went on to do the X-Men movies, a FAR departure).\n\nA great, gritty script, beautifully-acted characters, and what many have called the greatest movie ending of all time, are some of the shining qualities that make the Usual Suspects an object worthy of praise above its humble-looking shell.\n\nThe casting is very unusual but somehow fits perfectly. Gabriel Byrne is convincing as the ex-con trying to build a new life when he gets drawn back into his old life. Stephen Baldwin has the role of his career as the smart-mouthed and cocky professional. Kevin Pollak takes a big departure from his usual good comedy self to take a more dramatic role. Benicio del Toro literally takes a one-dimensional character with absolutely nothing in the script to give him character, and he fleshes it out with brilliant mannerisms and memorable mumbling to show incredible acting creativity. Kevin Spacey as we know him was born from this movie. His manners and fast-talking yet shy gimp nature are a treat to listen to throughout the flick.\n\nWithout giving away the plot, the best and most genius parts of the movie are the subtleties. After you see the ending, and the truth hits you like a ton of bricks, you have to watch it again. On the second time through, you'll jump up and point at the screen whenever you spot a clue you missed the first time. It's even possible to watch the movie multiple times and see something new with every viewing. It's that attention to detail that make the deceptively innocent-looking Usual Suspects one of the greatest movies of all time."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "TheShape_UK",
        "review_rating": "",
        "review_title": "A Modern Masterpiece...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "dbdumonteil",
        "review_rating": "10",
        "review_title": "the American thriller of the nineties",
        "review_detailed_main": "One day in a bookshop, I flipped through a book entitled: \"the movies of the nineties\" and this movie wasn't included! How can a book specialized in cinema skip such a milestone of the last decade? Any movie buff, any cinema critic must have considered the nineties a fruitful era for the American thriller. According to one's tastes, some will say that the best thriller of the nineties is \"Silence of the Lambs\" (1991). For others it will be \"Pulp Fiction\" (1994) while others will praise to the skies \"Se7en\" (1995). For me, the pinnacle is this present movie, \"the Usual Suspects\" (1995) with its staggering story (to put it mildly). It's a sensational debut for Bryan Singer which enabled to put him on the map. With a little help from his accomplice Christopher McQuarrie, he signed an unparalleled gem in the landscape of the American thriller, even the whole cinema.\n\nThe average viewer who watches \"the Usual Suspects\" for the first time might think that the whole crew concocted him a meandering story with as a leading thread, Spacey's convoluted story. At the end of the projection, he may feel puzzled and will probably wish to watch the movie a second time. He won't regret it and Singer and McQuarrie will rejoice at it. Their masterwork gains by several repeated viewings to appreciate the subtleties of a rich movie with a convoluted construction which will take its seemingly definitive form in the five last minutes. To watch \"the Usual Suspects\" is like gathering the pieces of an intriguing puzzle, a little like any other suspenseful movie but in the case of Singer's flick, one will never really be able to completely end it. So many things happen in less than two hours that we are never really sure of what we watch and this is reinforced by a breathtaking unexpected twist at the end which makes our assumptions falter. Singer and McQuarrie take a mischievous delight in taking the viewer in their nebulous scenario and to follow it according to Spacey's declarations and it's obvious that they raise more questions than answers. It's up to the viewer to make his imagination work and to bring his thoughts on the film. This is what inspires its pernicious charm.\n\nFrom Spacey's story, the authors developed a top quality script, set with clockwork precision. Singer's directorial style virtually evolutes on the razor's edge and conveys an increasing tension. It is filled with ingenious visual ideas and served by fluid camera movements. Singer was in his early thirties when he shot his film but it presents the signs of a seasoned author. There's also a tight editing and a unsettling score which cement the movie in its place of winner. More remarkable, the authors pull off with gusto to increase the audience's curiosity throughout the film in spite of a somewhat deliberate confusion and the interest won't weaken until the end which constitute the apex: an unexpected twist which will leave the audience speechless once they understood it. In Singer's flick, it doesn't disappoint because there are little but noticeable visual and verbal clues which justify it. However, it has something unsettling. We believe that we are at the end of the maze but there's more to the picture than meets the eye. Maybe this \"coup de theatre\" veils one more truth. Maybe also the shrewdest ones will have guessed it but the result is the same for any viewer: Singer puts a baffled spectator in his pocket.\n\nSinger and Quarrie show a perfect master in the domain of the film noir: an ominous atmosphere, nocturnal scenes which stay rooted in the mind and a deep psychology of certain characters which give more substance to the film. Considering the last point, the character of Gabriel Byrne is the most interesting one: a former crooked cop who seemingly redeemed himself in catering but caught up by his past and forced to come back to work. I personally think that Byrne is the stand-out of the topflight cast the movie boasts. But don't neglect the other members. Kevin Spacey pocketed a deservedly Oscar in 1996 and the rest of the cast doesn't stay on the bench. Maybe Singer grants a little shallow attention to the three others baddies in the gang but in a way it's necessary to underscore the fact that they're lousy gangsters embroiled in a infernal spiral and unable to perceive what lies beneath all this. Pete Postlewhaite and Chazz Palminteri make their scenes count too.\n\nA riveting storytelling, a painstaking flash-back, a tight and first-class directing, a thoughtful twist, a topnotch cast, \"the Usual Suspects\" includes almost everything a director would sell his soul for. Everything contributes to make it a stalwart model in the suspenseful movie and the whole cinema. After the first vision, be prepared for mental gymnastics and for a second screening..."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Sleepin_Dragon",
        "review_rating": "10",
        "review_title": "It's a brilliant Thriller.",
        "review_detailed_main": "When you think of 90's thrillers, you will probably think of Heat, Pulp Fiction, Silence of The Lambs and many more, and whilst Goodfellas is perhaps my favourite of them, but close behind is The Usual Suspects.\n\nIt's a wonderful, clever thriller, it's full of twists and turns, with surprises galore, it's a film that makes you think. Just when you think you know all, they pull the rug from under you, and make you think again. Direction is taut, the script is impressive.\n\nI would argue this is one of Spacey's best ever performances, if not the best of the lot, he is phenomenal here, and really does stand out in a crowd of immense talent, hopefully he'll get his career back on track.\n\nGabriel Byrne and Pete Postlethwaite shine, as does Stephen Baldwin, a time where that handsome brotherhood seemed to pop up everywhere, but he was excellent also.\n\nIt's a super slick production, with some pretty fine special effects, and good use of pyrotechnics, a polished production, one that's not overdone.\n\nThis is one of those movies that you can watch and watch again, it simply doesn't diminish or lose any of its intrigue. You know there's a twist coming, you'll sit there waiting for it, and the first time round your jaw may drop, it's a very well delivered moment. The ending of this film is fabulous.\n\n10/10."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Slarkshark",
        "review_rating": "8",
        "review_title": "Spacey's Best",
        "review_detailed_main": "The interrogation, the lineup, and the story telling are all intricate to this film and really is what makes this a great movie and a 90's classic.\n\nThe lineup scene is iconic and absolutely a fan favourite no doubt. Each characters personality is defined in that one sentence.\n\nKevin Spacey gives a heck of a performance and for me it's definitely his best."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Agent10",
        "review_rating": "10",
        "review_title": "Not enough good things to say",
        "review_detailed_main": "Such films like this should be enshrined in museums, simply due to the fact it destroyed the entire genre of mystery films. While this film was unique and captivating, no other mystery will ever accomplish this sort of cult status, single handedly shaping a genre. While most mysteries try to shock you too often with twists and even more twists, it turns out to be overkill. This film encompassed such ideas with flair and originality, which is probably the reason Brian Singer is sticking to sci-fi action films. Only Memento and The Game are the only recent mystery movies worthy enough to stand beside this film. Sadly, Singer has somewhat sold out by doing the X-Men movies, but I guess trying to make films like this would be too taxing. This film will always bring a smile to my face when I watch it with someone who hasn't seen this movie. A good viewing every time I watch it, the new special edition DVD is awesome."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "briancham1994",
        "review_rating": "6",
        "review_title": "Relies too much on its twist",
        "review_detailed_main": "The Usual Suspects only works because of its infamous twist ending. Until then, it is simply a convoluted mess that does not offer any ways to resolve its twisting and unreliable plot threads. Films with plot twists work well if they are enjoyable up until the revelation, like The Sixth Sense (1999) or The Prestige (2006). They offer enough mystery to tease a potential revelation and enough clues to figure it out. The Usual Suspects, however, revels in sheer incomprehensibility and hollowness that necessarily demands an explanation to appreciate even at a basic level. Even afterwards, the revelation clearly exists more for the audience's emotional reaction rather than making any sense within the scenario of the film. Gimmicky storytelling aside, the acting, production values and sense of suspense were all handled quite well for a low budget film."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "illbebackreviews",
        "review_rating": "8",
        "review_title": "At first, wasn't the biggest fan but.....",
        "review_detailed_main": "I couldn't help but set rather high expectations for 'The Usual Suspects' as I went into watching this. I knew this was no action movie or any of the crap we get nowadays. This was true cinema! I was excited 'The Usual Suspects' is a mystery film about what cargo was on board the ship when it was destroyed and the events leading up to it as we are told from the only known survivor of that accident.\n\nAround 45-50 minutes into the movie, I was starting to find myself a bit tired and thought the movie may perhaps have dragged along just a bit. I was becoming rather disappointed. Then the film truly began to change in such a way that I find it rather hard to explain. The characters began to get a little more entertaining, the pacing certainly began to pick up, the dialogue was getting more interesting and overall, I was more excited.\n\nThen comes the amazing final twenty minutes with the plot twist and the story finally closing in perfectly, making the story more understandable. However, the final 5 minutes of the movie are some of the best moments of movie ever made and that is the ultimate plot twist which surprised the hell out of me! It was a cheering end to what ended as a great movie and a movie I would be more than happy to check out again and again! A-"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "scaevola",
        "review_rating": "6",
        "review_title": "Excellent production, but relies WAY too much on the surprise ending--which may not even be a surprise.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "litenv",
        "review_rating": "5",
        "review_title": "SPOILERS: Totally Fun but Totally Over-rated once you think about it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "tjowen",
        "review_rating": "",
        "review_title": "Better than the sum of its parts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "www.britneyobsession.com",
        "review_rating": "10",
        "review_title": "The best film I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "BobHalfa",
        "review_rating": "10",
        "review_title": "A true thriller!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Vishal_s_kumar",
        "review_rating": "10",
        "review_title": "\"and like that...he was gone.\"",
        "review_detailed_main": "Boasting petty criminal characters conceived so brilliantly they achieve near-mythological status, The Usual Suspects is known for riveting suspense and action, an intriguing plot line and a jaw- dropping twist at the end. It also features some of the most memorable lines of the 1990s: \"How do you shoot the devil in the back--what if you miss?\" The characters, Roger \"Verbal\" Kint (Kevin Spacey), Dean Keaton (Gabriel Byrne), Michael McManus (Stephen Baldwin), Fred Fenster (Benicio Del Toro), Todd Hockney (Kevin Pollak), Dave Kujan (Chazz Palminteri) and Kobayashi (Pete Postlethwaite) have real character details and cues.\n\nThe film is set in the aftermath of a ship fire that totally burns the cargo and crew. Though meek and disabled, Verbal is the only survivor to walk away from the incident unscathed. He is taken into custody and grilled by the police. Brilliantly played in a characteristic, understated style that earned Spacey an Academy Award for Best Supporting Actor, Verbal is cleared and allowed to leave. But before he can go, agent Kujan from US Customs shows up to interrogate him. Kujan is trying to build a case against Keaton and he wants Verbal to testify in exchange for immunity. Verbal refuses, but Kujan still bullies Verbal into recounting his story of Keaton, McManus, Fenster and Hockney, leading up to the explosion on the ship.\n\nWhat follows is a fantastic yarn of lies and half-truths sprinkled within the facts of the case. It is all masterfully portrayed as a series of flashbacks while Verbal and Kujan sip coffee and talk in the LA police station. The story begins six weeks earlier in New York City as Verbal and the other four criminals are brought in to stand side-by-side in a police lineup. None of them are formally charged with a crime, and there are indications Keaton has actually gone straight prior to the roundup. But before they are released, the five hatch a plan to get revenge on the corrupt NYPD and make a large sum of money in the process by robbing a police-protected jewel smuggler and leaking news of the police involvement to the press. Keaton is reluctant and must be coaxed into it with the promise that no one will be killed in the heist. He agrees and the quintet pulls off the robbery to perfection. The acting and writing take chances that pay off, with each actor fully immersing himself in his role. Del Toro creates a uniquely colorful persona in his portrayal of Fenster, Baldwin conveys a reckless abandon and lust for violence, Pollak shows steely courage and resolve, Byrne is a complex mesh of toughness with motives pulling him in all directions. Each actor is at the top of his game.\n\nThe five criminals go to Los Angeles to lay low in the aftermath of the New York heist. There, they are enticed into another robbery that is also supposed to involve no killing. Unfortunately, this LA heist goes horribly wrong. As Verbal recounts this carnage, its aftermath and the growing problems and hostility in the crew, agent Kujan receives a tip from one of his colleagues who has a survivor pulled from the water near the charred wreckage of the ship. The witness is badly burned and cannot speak English, but insists that the man responsible for the destruction of life and property on the ship is named Kaiser Soze.\n\nWhether it is attributable to lies in Verbal's yarn or odd casting decisions, several characters in The Usual Suspects add to the film's mystique. Chief among these is the Irish Postlethwaite cast as the Japanese Kobayashi. There is a strong clue at the end that the name Kobayashi is used solely to mislead Kujan. But Kobayashi is not the only instance of a character's name failing to match his appearance. Another example is McManus' contact in LA, Redfoot, which one would expect to be the name of a Native American. But Redfoot appears to be caucasian. Again, at the end there is an indication that Verbal used Redfoot to avoid giving Kujan a real name. Strange ethnic inconsistencies crop up constantly. Kaiser Soze is said to be Turkish, possibly with a German father. These mixed-up character portraits add a layer of complexity to the plot, but one must always consider the source, Verbal Kint, and his motives.\n\nThe dynamic between Kujan and Verbal itself is pure entertainment. A kind of cat-and-mouse game, nuances are thrown into the proceedings that make it more interesting and add depth to the characters. Even the way the interrogation is filmed is unique. Verbal didn't achieve his nickname for no reason. He knows how to run his mouth and Kujan has a difficult challenge in corralling him. Underlying the interrogation is Kujan's suspicion of Keaton and his belief that Keaton manipulated Verbal. But Verbal is hard to pin down and Kujan occasionally resorts to bully tactics. But who is Kaiser Soze? Did he orchestrate the police lineup in New York, and pull all the strings ever since? Is the cargo of the ship drugs or only human cargo? Why did Verbal survive unharmed while so many others did not? Did Keaton really die, as Verbal insists, or did he slip away, as Kujan believes? Is Verbal telling the truth? Much is revealed in the final moments of the film, which wash over the viewer like an enormous wave of recognition. Snippets of dialogue from earlier in the film are montaged over the complex score, providing spine-tingling clues about exactly what part of Verbal's yarn was fact and what was fiction. The final snippet of dialogue, followed by a fortissimo string finale is especially powerful: \"and like that...he was gone.\""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "hitchcockthelegend",
        "review_rating": "10",
        "review_title": "Keaton always said, \"I don't believe in God, but I'm afraid of him.\" Well I believe in God, and the only thing that scares me is Keyser Soze.",
        "review_detailed_main": "The Usual Suspects is directed by Bryan Singer and written by Christopher McQuarrie. It stars Gabriel Byrne, Kevin Spacey, Kevin Pollack, Stephen Baldwin, Benicio Del Toro, Chazz Palminteri, Pete Postlethwaite, Giancarlo Esposito and Dan Hedaya. Music is by John Ottman and cinematography by Newton Thomas Sigel.\n\nHeld in an L.A. interrogation room, Verbal Kint (Spacey) attempts to convince the feds that a mythic crime lord, Keyser Soze, not only exists, but was also responsible for drawing him and his four partners into a multi-million dollar heist that ended with an explosion in San Pedro harbor - leaving few survivors.\n\nIt sort of sidled into movie theatres in 1995 with no fanfare or heralded notices. Yet it wasn't long before word of mouth got around that The Usual Suspects might actually be the must see film of the year. Fledgeling director and writer - Singer and McQuarrie - produce a masterclass of crime/mystery/noir plotting in a whirl of intricate plot shifts and deft sleights of hand.\n\nThe core essence of the story is simple, just who is Keyser Soze? His reputation is one of utter fear, he may even be the devil himself. What transpires throughout the film is a number of scenes told in flashback form and narrated by Kint as the cops put the heat on him.\n\nWe are introduced to the five criminals who make up the suspects of the title, where dialogue pings with machismo laced humour. The addition of Postlethwaite's Kobayashi character, one of Soze's harbinger's of doom, further ups the ante of the story's deliciously corkscrew intrigue.\n\nIt all builds to a climax that - has you pondering just what you have watched previously. Yet here's the key as to why the pic still holds up on repeat viewings, we have been outsmarted, for as we dive in and enjoy the across the board great perfs, we have been privy to something that will stand the test of time for the genre it sits in. The repeat viewings factor still, some decades later, is as strong as ever.\n\nThe advent of time and home format releases etc have only improved the pic's own mythical status. Behind the scenes egos and dislikes on set only add further strength to the characterisations, as does one main man thinking he himself must be Soze when in fact he was way off. There's a trail of clues in the film that will reveal who Soze is - who knew!? - and on it goes. The Usual Suspects is the filmic gift that keeps on giving. 10/10"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Macca31",
        "review_rating": "10",
        "review_title": "Frighteningly excellent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "bandw",
        "review_rating": "6",
        "review_title": "Stylish crime drama with little content",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "SnoopyStyle",
        "review_rating": "10",
        "review_title": "Then comes the twist",
        "review_detailed_main": "Death and mayhem comes to the docks. The police picks up Verbal Kint (Kevin Spacey). In the interview, he recounts the events leading to the havoc at the docks. The crew meets at a sketchy line up after a truck robbery. They start working together until they are contacted by the mysterious Keyser Söze.\n\nThis is densely packed crime drama. For most of this, the audience is working hard to keep up with the characters and the story. It all makes sense but every once in a while, something sounds suspicious. When I first saw it in the theater, more than once it left me scratching my head. Then the twist comes, blows my mind, and explains all the suspicions I had.\n\nThe five men crew is played expertly by Kevin Spacey, Gabriel Byrne, Kevin Pollak, Benicio Del Toro, and Stephen Baldwin. They are all acting at the top of their games. They needed to be great to sell this noir crime drama. This is one of the best."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "paulclaassen",
        "review_rating": "7",
        "review_title": "Pay close attention to every detail.",
        "review_detailed_main": "'The Usual Suspects' is a rather unusual film. There's so much detail here that it definitely would benefit from more than just one viewing.\n\nThe entire cast gives wonderful performances, but Kevin Spacey stood out among the rest with a stunning performance. He stars as Verbal, and the entire film is based on his version of events.\n\nThis is the type of film where you very carefully have to pay attention to every detail, and every bit of dialogue. This will make you understand everything much better as it can be confusing if you don't follow closely. The film revolves around a group of criminals who came together to pull off an impossible job, and the events leading to that fateful night.\n\nThe characterization is excellent as we deal with five very different characters, and we're told about each character in a way we can make up our own minds whether we're rooting for them or not. The writing really is fantastic, with good dialogue - and funny even! And then there's the mysterious Keyser Söze. Is he real, or a myth? No spoilers here, so you're going to have to find out for yourself!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "hovering_above",
        "review_rating": "1",
        "review_title": "The cake is a lie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Infofreak",
        "review_rating": "",
        "review_title": "A stone cold CLASSIC!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "dillylamar",
        "review_rating": "10",
        "review_title": "The Usual Suspects",
        "review_detailed_main": "The Usual Suspects remains a style of it's own. It a masterpiece of suspense and putting wonder into the audience. This film has great performances, dialogue, and story elements. The film's twist is the perfect. It makes the viewer unlearn everything they have learned throughout the film, as most of it fabricated, coming from an unreliable source, who is thought to be the man behind it all. Is Verbal Kint actually Keyzer Soze? Or is Verbal Kint one of Keyzer Soze's men. Or did Verbal use the myth of Keyzer Soze to get away? Or is Kobayashi Keyzer Soze? Even Keaton could be Keyzer Soze? It's not definitive. This film is a high achievement, it entertains with dialogue, flashbacks, suspense, shocking moments of realization followed by more shocking moments of realization. Most of the plot relys on the flashbacks told by Verbal Kint, leaving the audience stunned after viewing it. As Keyzer Soze is the myth the criminals fear, and may or may not be real."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Tony-Kiss-Castillo",
        "review_rating": "10",
        "review_title": "MOST Definitely... NOT Your \"USUAL\" Movie!",
        "review_detailed_main": "\"The Usual Suspects\" certainly defies pigeon holing or labeling! Its larger-than-life allure results from a seamless blending of elements: Psychodrama, Action, Suspense and Mystery, all built on intricate storytelling, a dynamic screenplay and taught direction, by Bryan Singer. The aforementioned are all bolstered by credible in-depth character development, brought to life by an outstanding cast, who flesh out each role to chilling near perfection. (Kevin Spacey, seen here before most people would have recognized his name, received an Oscar for his \"supporting\" role!)\n\nBut let's not get sidetracked. More than anything else,\"SUSPECTS\" is about the unparalleled unsettling reaction you get from viewing it! From the first scene to the end credits, it gets a headlock on your psyche, while sending the pit of your stomach into endless free fall! The only way to illustrate this, without giving away any key elements of the film, is a detailed look at the opening scene....a peerless example of instant timeless classic film noir.\n\nOn a boat, docked in San Pedro Harbor, the dying sole-survivor of an apparently devastating bloodbath shootout, painfully ignites a thin trail of gasoline. His obvious intention: Destroy EVERYTHING...himself included! From a deck higher up, an unseen someone pisses out the trail of flames.\n\nThe shadowy figure then casually walks down the stairs with an unhurried deliberation and saunters over to the agonizing man he has just saved. They exchange somewhat forced greetings and a few disjointed words of banter.\n\nWithout warning, the intruder firmly raises a pistol, his unblinking gaze reflected in eyes locked in contact with his own. Unhesitatingly, he fires two consecutive shots. A brief pause of contemplation ends when he casually lights a cigarette, strategically dropping his lighter to rekindle the liquid fuse, and then beats a hasty off-board retreat.\n\nWhat better way to introduce a character whose twisted iron resolve is so perverse, so deranged, that he saves a doomed man seconds before certain death, solely for the unmitigated pleasure derived from looking him squarely in the eye, his victim looking right back, while pulling the trigger himself. Without uttering a syllable, his actions shout out, \"I piss on you and your puny existence!\" His victim's final moments are thusly converted into a living/dying testimony, clearly demonstrating who it is that decides the particulars of when and how he will die!\n\n\"SUSPECTS\" has been severely critiqued by a vocal minority (to paraphrase another reviewer) for not knowing the difference between a plot twist and a non sequitur. With all due respect to the reviewer, who painstakingly highlighted the difference for us, perhaps a careful second viewing would shed some light on the source of this common confusion. After watching \"SUSPECTS\" four times making every effort to employ my most discerning eye, I am convinced the true genius of the movie hinges on this particular point!\n\nLet me underscore my unequivocal recommendation of this film with a special note to those of you who avoid the Action or Suspense genre because of your distaste of the excessive violence that generally characterizes them. Well, THIS IS NO Robert Rodriguez FILM! A lot of the scenes are done in the \"Old School\" style, where the violence is kept off-screen.\n\nAlthough there is considerable TALK in \"SUSPECTS\" about some of the most dastardly deeds imaginable, virtually none of this is graphically portrayed. So, PLEASE, if you have not seen it yet, because of this reason, I urge you to make an exception in this case...\n\n10* STARS! YOU MUST GET IT AND WATCH IT... CAREFULLY!!!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "mstomaso",
        "review_rating": "10",
        "review_title": "A Perfectly Crafted Mystery - (very ambiguous spoiler)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "AlsExGal",
        "review_rating": "10",
        "review_title": "There isn't enough chamomile tea in the world...",
        "review_detailed_main": ".... to calm me down after watching this thriller. It's absolutely perfect, an edge of the seat experience. I usually don't hand out perfect grades, but from beginning to end it takes you on a wild ride. And you will want to see it again to see if there are any \"tells\" you missed the first time. Somewhat like the fantastic \"Prestige\" of ten years later, except that was in the realm of magic and this is a thriller/heist film.\n\nFive guys who have absolutely nothing in common but a criminal background meet during a line-up over a hijacked truck full of gun parts and then team up in two different heists and then a third job on a boat. The first two heists they do willingly, the last job they are compelled to do. What do I mean by compelled ?- Watch and find out.\n\nThe first five minutes are confusing - You see two characters on a boat, one in full view, one whispering and seen only in shadowy profile. One shoots the other with the victim's seeming complete consent. The shadowy profile then sets the boat ablaze, escapes, and then the boat explodes. The film then starts out answering the question of what exactly it is you've just seen, and for that matter, what it is you haven't just seen.\n\nI wish I could say more, but I really can't without spoiling it, at least to a degree. With a brooding score full of regret, a first class ensemble cast, and the point being the power of story, I wouldn't suggest you watch this close to bedtime if you intend to sleep."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "BEST Thriller movie in the world.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "claudio_carvalho",
        "review_rating": "9",
        "review_title": "Who is Keyser Söze?",
        "review_detailed_main": "After a bloodbath and fire on a moored ship only the badly burned Hngarian mobster Arkosh Kovash (Morgan Hunter) and the crippled small- time crook Roger \"Verbal\" Kint (Kevin Spacey) survive. Agent Dave Kujan (Chazz Palminteri) interrogates Verbal that explains what happened to Dean Keaton (Gabriel Byrne), Michael McManus (Stephen Baldwin), Fred Fenster (Benicio Del Toro), Todd Hockney (Kevin Pollak) and him in the vessel. Six weeks ago, they met each other at the line-up in the police station and decide to team-up for a heist under the command of the former corrupt cop Keaton. After delivering the jewels to the fence Redfoot (Peter Greene), they are hired for another heist and then the lawyer Kobayashi (Pete Postlethwaite) approaches to them and tell that the notorious Hungarian gangster Keyser Söze had offered them to go to the ship to destroy the cocaine they are transporting. They go to the ship and do not find any drug, and Keyser Söze killed each one of them. Who is Keyser Söze?\n\nTwenty-two years after the releasing date, \"The Usual Suspects\" is still a great film that has not aged. The impact reduces a little if the viewer still recalls who Keyser Söze is, but the film is still one of the best of the genre. Kevin Spacey was not well-known and Bryan Singer was in the beginning of his career, but the direction and performances are top-notch. The screenplay is one of the best written in the cinema history for a mystery film and the result is a fantastic movie. My vote is nine.\n\nTitle (Brazil): \"Os Suspeitos\""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "cjm1d",
        "review_rating": "7",
        "review_title": "Great movie",
        "review_detailed_main": "I started this movie a few years ago but didn't get past the first 15 minutes. I found the jail and lineup scenes hard to follow me quite slow. On a recent rewatch, I got past that part and the story picked up a great amount. The acting was great, tons of symbolism and little details. The movie had me to the very end, and mad me want to rewatch immediately."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "MovieAddict2016",
        "review_rating": "8",
        "review_title": "Not flawless, but comprised of many individually terrific scenes, including THAT ending...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "gsaltfmz",
        "review_rating": "7",
        "review_title": "Movies that use one's own brain",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "gbound2009",
        "review_rating": "5",
        "review_title": "The Usual Overrated Suspects",
        "review_detailed_main": "This movie is way overrated. It doesn't deserve a 8.7 rating, 6 should be the highest for it. Guess IMDb's ratings are not that accurate. The film's plot and the so called twist in the ending are so predictable and boring, and the acting is not great either.\n\nIt's an average film at best, and nowhere near a masterpiece. Just don't have high expectations when you watch it, if you don't want to be disappointed.\n\nThe ratings here are so unreliable. Lots of movies are overrated. It's extremely misleading and annoying. What happened to you, IMDb, you used to be cool."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "The Film That Made Kevin Spacey a Star",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "chiragrathod19",
        "review_rating": "10",
        "review_title": "A Masterclass in Suspense and Deception",
        "review_detailed_main": "Bryan Singer's *The Usual Suspects* is a riveting thriller that has cemented its status as a modern classic in the mystery genre. With its intricate plot and masterfully woven narrative, the film keeps viewers on the edge of their seats, expertly balancing tension and intrigue.\n\nThe story unfolds through the perspective of Roger \"Verbal\" Kint, played exceptionally by Kevin Spacey, who recounts the details of a shocking crime to a police interrogator. As Kint, a small-time con artist, spins his tale, the film artfully reveals layers of deception and misdirection that keep the audience guessing until the very end.\n\nThe screenplay, penned by Christopher McQuarrie, is tightly constructed, filled with clever dialogue and unexpected twists that challenge the viewer's perception of reality. The performances are stellar, with an ensemble cast featuring Gabriel Byrne, Benicio del Toro, Kevin Spacey, and Chazz Palminteri, each bringing depth to their roles and contributing to the film's overall tension.\n\nVisually, the film employs a gritty aesthetic that complements the story's dark themes. The direction by Singer, combined with a haunting score, amplifies the suspense and pulls the audience deeper into the convoluted plot.\n\n*The Usual Suspects* is more than just a typical crime thriller; it's a labyrinth of manipulation, exploring themes of loyalty and betrayal. Its iconic ending and meticulous storytelling have left an indelible mark on cinema, making it a must-watch for anyone who appreciates expertly crafted suspense and character-driven narratives. Highly recommended for fans of clever mysteries and cinematic twists."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "kevin_robbins",
        "review_rating": "10",
        "review_title": "The storyline and characters for this picture is brilliantly written and presented to the audience in a perfectly paced manner",
        "review_detailed_main": "The Usual Suspects (1995) is a move in my DVD collection that I recently watched again for the first time in a long time on Tubi. The storyline follows a heist that the police can't figure out what was stolen. They have dead bodies everywhere but no missing product and one arrested suspect/witness. The police interrogate the witness and hear an unbelievable tale of a drug kingpin and a band of misfits who come together to pull off a heist like the department has never heard of...\n\nThis movie is directed by Bryan Singer (X-Men) and stars Kevin Spacey (House of Cards), Gabriel Byrne (End of Days), Chazz Palminteri (A Bronx Tale), Stephen Baldwin (Fred Clause), Benicio Del Toro (Crash) and Pete Postlethwaite (The Town).\n\nThe storyline and characters for this picture is brilliantly written and presented to the audience in a perfectly paced manner. The cast is well selected and everyone executed their character perfectly, especially Spacey who delivers my all time favorite performance of his. The sub plots were very well developed and presented to the audience and police officers. The interrogation scenes are so good. The soundtrack is also epic and the conclusion is cinematic gold.\n\nOverall this is a masterpiece and an easy 10/10. I would strongly recommend seeing this."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "kosmasp",
        "review_rating": "10",
        "review_title": "More than usual",
        "review_detailed_main": "Another day, another rewatch. A classic in the thriller genre, with a cast that is exceptional. But also with a script that can be considered tight. It does hinge on something that actually is able to bring the whole house down. Considering what the aim was or one of the target in the movie, certain things seem to make not much sense.\n\nBut suspend your disbelief and just enjoy the ride (and keep guessing where it's going) the first time around. After that you can watch it again (and again?) to see the clues and disect the movie in your head. Try to connect the dots and maybe understand what really went down .. then again, considering the premise and the twist, are we actually able to tell? You'll understand once you've seen it ... because it does leave a lot in the open. It does however also have lots of clash between characters and the spite they have for each other ... I won't go into detail, but there are certain convenient (timing wise) incidents. Just accept them and don't overthink them ..."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "TheLittleSongbird",
        "review_rating": "10",
        "review_title": "Magnificent film that deserves to be re-watched over and over",
        "review_detailed_main": "As an avid cinephile, who watches a lot of films to help me to be distracted from the pressures of everyday life, old and new and of all genres (have never had a bias against any genre and never love older films and dismiss new films, or vice versa), 'The Usual Suspects' was one of the finest films personally seen in a while.\n\nOther films to have that effect on me (and garnered 10/10 ratings, a rare rating for me these days) are 'LA Confidential', 'Amores Perros', Orson Welles' version of 'The Trial', 'City of God' and 'The Song of Bernadette', though some films came close as well as re-watches of favourites like 'Se7en', 'Much Ado About Nothing' (1993) and 'The Remains of the Day'.\n\nSimply put, 'The Usual Suspects' is a magnificent film all round that deserves to be re-watched over and over again, one of the few films seen recently to not find any fault with it. Fully deserving of its reputation as one of the best modern, and perhaps overall, films ever made. Not everybody is going to disagree and that is fine.\n\n'The Usual Suspects' is slickly and audaciously made, filmed with a lot of style and is atmospherically directed. It is also hauntingly scored. It is intricately and intelligently written by Christopher McQuarrie, some of the best screen-writing he ever did. It is beautifully and deftly directed by Bryan Singer. If remembered correctly, neither McQuarrie or Singer were well known at the time and it was 'The Usual Suspects' that put them on the map.\n\nFilm is famous for the iconic line-up scene, the noticeboard that haunts everybody forever and its killer twist, one for the ages and not one to forget in the long one. Twists have wildly varied in film, there are some ingenious ones but also some naff ones, 'The Usual Suspects' is one of the ingenious ones. 'The Usual Suspects' as said before doesn't just have its twist going for it. The flashback-packed story is similarly intricate and never feels muddled or convoluted.\n\nIt has some of the finest ensemble acting there has ever been. This is especially true for a mesmerising Kevin Spacey in one of the most deserved Oscar Wins that year. Spacey is just one of the all round brilliant performances. Pete Postelthwaite, an always dependable actor who is still very much missed, is suitably mysterious, and Dan Hedaya and Chazz Palminteri make their mark as the confused cops. Steven Baldwin doesn't have a particularly challenging role but has never been better, Gabriel Byrne is also solid.\n\nOverall, magnificent film in every sense. Recommended with no hesitation. 10/10 Bethany Cox"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "MilosH18",
        "review_rating": "10",
        "review_title": "The mastermind fooled us all",
        "review_detailed_main": "When I finished watching this, I could not sleep that night and started walking like Verbal for the next few days. The \"Usual Suspects\" is a solid journey that explodes as the film comes to a close. With many hints portrayed as the film progresses, Bryan Singer smartly presents this fiction through Verbal, primarily filmed in a police station. Kevin Spacey's performance of Verbal deserves the Academy Award that it won for Best Supporting Actor in 1996; I would consider it one of the best performances of a character in film history. Brilliant execution from the rest of the cast, each bringing their piece to the table. There were notable standalone scenes that have been valuable to the success of this production, and I loved every part of it. Thank you, Christopher McQuarrie, for writing this gem."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "amraampk",
        "review_rating": "10",
        "review_title": "when its identity is revealed the devil is disappeared",
        "review_detailed_main": "a very great film . contains so much twists and turns u wont believe. The only main thing is who is the devil, Kyzer soze. He is keeping his identity secret and playing his games right in heart of the underworld. He himself using 5 brave but misguided and frustrated young men by exploiting their weaknesses and compulsions. In the whole movie you will keep on wondering who is kyzer soze in reality and when u know in the end u will be taken aback and shocked , on the other hand u ll also praise his genius of deception and elusiveness. This film contains suspense with action in a far better way the stereo type action movies contain. The most inspiring actors are here Kevin spacey and Gabriel Byrne. Highly recommended , if u like movies , must see it. i believe every one can enjoy the film , it makes one totally absorb in the story , u ll always like to know the complexity of the characters in the film."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "kanoolg",
        "review_rating": "6",
        "review_title": "Another twisted movie",
        "review_detailed_main": "If you didn't like the movie as me don't worry; it simply isn't for us, this movie is for those who loves twisted ending without caring for the movie itself, the ending was good no doubt but as a whole the movie is not"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "nathanmanson",
        "review_rating": "9",
        "review_title": "Wow!! that ending was crazy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Horst_In_Translation",
        "review_rating": "6",
        "review_title": "Perfect example on how a twist makes the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "perew",
        "review_rating": "1",
        "review_title": "Ending Not a Surprise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "chucknorrisfacts",
        "review_rating": "",
        "review_title": "Overrated! SPOILERS AHEAD!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "vitormallis",
        "review_rating": "10",
        "review_title": "\"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\"",
        "review_detailed_main": "What a movie. It has a story from beginning to end with a lot of sense and intelligence. This is a film that makes you think and we as viewers need to pay attention to the details otherwise we will get lost. I got a little confused at first (probably because I was sleepy) but that doesn't make the film worse, it's just a detail that happened to me. Just like I said before, if you don't pay attention you will get lost in the story. Probably one of the best movie endings I've ever seen in my life without exaggeration. Of course I couldn't help but comment on the plot twist, probably one of the best I've ever seen but I won't say what it is, I'll leave it for you to see 😉. For these reasons and many others, I give this film a 10. I loved watching it!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "aidanmurphy-17583",
        "review_rating": "8",
        "review_title": "Great Film, One of the Best Crime Movies",
        "review_detailed_main": "'The Usual Suspects' is a classic. A great crime movie with a great director and a great cast. Plenty of twists and turns, with the ultimate twist being what makes this film so entertaining when realising for the first time or rewatching and knowing all along, making the movie that more impressive.\n\nStephen Baldwins performance as 'Micheal McManus' was funny and entertaining. Learning that the lineup scene was unscripted made watching it so much more entertaining. This was also the case with Benicio Del Toro's 'Fred Fenster' character whose brilliant mannerisms and memorable lines shows top tier acting.\n\nThis film made Kevin Spacey, his performance as 'Verbal' was interesting and iconic, making the ultimate twist that more satisfying to watch. Admittedly, this film would not be as good as it is without the twist but to think this is to be in denial that this is an incredible film with a great script and praiseworthy performances by a great cast.\n\nI would give this film a more accurate 8.4/10, definitely worth a watch for one of the greatest twists in movie history."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "rami-abulfadl",
        "review_rating": "9",
        "review_title": "the ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "adriaan-smalbraak",
        "review_rating": "10",
        "review_title": "The Usual Suspects: A Mind-Bending Journey Through the Twists and Turns of Criminal Intrigue, Where the Line Between Truth and Lies is as Thin as a Razor's Edge.\"",
        "review_detailed_main": "\"The Usual Suspects\" is an absolute masterpiece of a film. From start to finish, it grips you with its masterful storytelling, breathtaking performances, and mind-bending twists and turns. This movie is a cinematic tour de force that deserves every bit of the praise it has received.\n\nAt the heart of \"The Usual Suspects\" is its brilliant screenplay, which expertly weaves together multiple narratives and timelines into a seamless and unforgettable experience. The film's characters are complex, nuanced, and utterly captivating, with each actor giving a truly unforgettable performance. Kevin Spacey, in particular, shines as Verbal Kint, delivering a performance that is both subtle and powerful.\n\nBut what truly sets \"The Usual Suspects\" apart is its ending, which is perhaps the greatest twist in movie history. I won't spoil it here, but suffice it to say that it will leave you stunned, amazed, and wanting to watch the film all over again just to catch every little detail you may have missed.\n\nOverall, \"The Usual Suspects\" is a true cinematic masterpiece that is not to be missed. It is a film that will leave you breathless, reeling, and completely in awe of the power of cinema. This movie is a perfect 10 out of 10, and one that everyone should see at least once in their lifetime."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "jparkergomez",
        "review_rating": "10",
        "review_title": "A different gangster story.",
        "review_detailed_main": "A different gangster story.\n\nI watched the film with an open mind. I did not watch the trailer or read the plot. After watching 'The Usual Suspects', I can now say it is now one of my favourite films.\n\nI was confused at the beginning; the film switches from the past to the present so often which made it difficult to follow. They lay out the backstory and how the group forms quickly; this gives the viewer context and the film is able to jump straight into the story. Pacing is one of the film's fortes; it moves swiftly with not a tedious moment. We are introduced to the characters and their backstories instantly. The main focus of the film then moves to a police interview between Verbal (Kevin Spacey) and Dave Kujan (Chazz Palmintetri). This is the narrative. Everything that happens is explained through this interview.\n\nThe story is compelling and entertaining right from the start. With an amazing performance from Kevin Spacey. We are taken through many sequences in which we see the characters' relationships build and the plot slowly builds up to a climax. The characters seem to develop close relationships; they form trust, friendship and a sense of love between each other. Ultimately, the character development is something that also stands out to me. As the film progresses the characters become more likeable. Developing the plot further through every story told, we are introduced to the bigger picture of how their gang works.\n\nThe cinematography matches the film very well as does the colouring. It gives the film a mysterious effect whilst giving it a dark aesthetic that matches the tone. The mood shifts around the middle when we are introduced to a character: Keyser Soze. He is portrayed as a demonic figure, someone everyone should fear. The Usual Suspects are made to do a job for him. Infiltrating a drug trade (this is the climax) is the final scene where everything happens.\n\nThe final sequences are exciting and engaging with the big question being asked: who is Keyser Soze? No one knew. As anyone who knew his identity would be killed immediately. As the interview between Verbal and Dave slowly comes to an end, a very big plot twist is revealed and it leaves us questioning everything about the whole story. The film then ends with perhaps one of the best lines in cinema history: \"The greatest trick the devil ever pulled was convincing the world he wasn't real\"."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "eva3si0n",
        "review_rating": "10",
        "review_title": "Usual Suspects is one of the best detective thriller of the 90s",
        "review_detailed_main": "Usual Suspects is one of the best detective thriller of the 90s. Great story, strong cast (Kevin Spacey played his role perfectly) and crazy ending in the last 15 minutes. The plot twists worked perfectly, I, as a viewer, did not see the tricks in the flesh until the end of the film. Bryan Singer made his best film of his career and went to make numerous X-Mens films."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Hairy_Lime",
        "review_rating": "6",
        "review_title": "Perhaps the most overrated movie of the 90's",
        "review_detailed_main": "Oh, come on. Yes, Spacey is excellent, and the rest of the cast does fine work. But the whole movie is like a magic trick, and once the trick is explained, what is there left? When I saw the movie the second time, I wasn't fooled by it, and I could see the machinery working - the wire we had been misdirected from, the card being palmed. Is there any reason to watch this movie a third time? I got annoyed with it half way through when it was on last, and have no desire to see it again.\n\nSo, a well made little trick that I enjoyed when I saw it, but nothing classic."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "screenman",
        "review_rating": "10",
        "review_title": "Beyond Superlatives.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "jef-frisone-1",
        "review_rating": "6",
        "review_title": "It was obvious that there was no Cake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "greggman",
        "review_rating": "1",
        "review_title": "The movie lies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "A twisty classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "credgrave-90342",
        "review_rating": "9",
        "review_title": "Classic films at budget levels that aren't made anymore",
        "review_detailed_main": "This movie did for Kevin Spacey, what primal fear did for Edward Norton Junior. It's a great performance in both cases. But the bigger star in both cases is the writing. I could watch both of these movies on repeat. So good.\n\nThe rest of the cast is stellar as well. Every one of these guys went on to have a great career. I wish they had the budget to do these mid budget feature films nowadays. It makes me sad that the death of DVD killed the mid budget level movie. The only movies they make nowadays are the big tent, pole movies, or the super mini budget that a studio has nothing to do with. In other words, someone's grandma paid for the film and you're praying that it comes out OK. Classic films that will never be made again."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Judimex",
        "review_rating": "10",
        "review_title": "Left handed Soze",
        "review_detailed_main": "OK. In the movie they show several time that Soze's character is left handed. Do you think they do this to try and throw you off who Soze actually is? I know the first time i saw it i was watching for the left hander. Another thing that i don't understand is why does Kobayashi have such a strange accent in the movie? He's an English guy and i think it's mentioned in the movie that he is English/British. I just couldn't make out where the accent was supposed to be from and why he would have it, so you think he may be Soze? Turkish nationality? Before i leave i want to say i really love this movie, but let's think about the plot for a moment. This is Soze's plan all along to get rid of an eye witness on board the vessil right? He goes to ALL that trouble to shoot the witness and in the end the police, everyone knows what Soze looks like anyway as they had the sketch faxed while he was being questioned. Why, if he was so smart and calculating, would he risk all of this to almost be caught in the very end?"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Tweekums",
        "review_rating": "10",
        "review_title": "What really happened?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "BroadswordCallinDannyBoy",
        "review_rating": "10",
        "review_title": "Composition",
        "review_detailed_main": "Subtlety is a very important thing in any good thriller. Not only does subtlety reduce the ridiculous amount of \"in-your-face-quality\" that today's thrillers seem to love, which effectively makes then just plain old action movies, subtlety shows that a film has respect for its audience. It doesn't feel like it has to explain everything at every step of the way since it knows that an interested audience will be on the lookout for hints as to what is going on. That's what makes films like this enjoyable. In fact, that what makes any film enjoyable. It isn't just a barrage of images, but rather an engaging sequence of them. This sequence can be unchronologically organized or in any number of ways obscured to create suspense, but as long as it is engaging, the audience will be happy.\n\n\"The Usual Suspects\" is such a thriller. It can be enjoyed with the eyes as much as the brain. There are numerous hints as to what is really going on and the final climatic twist is really a great one. Even then, upon seeing the whole film, the second viewing only gets better as that is when a keen viewer will pick up on all those subtleties that hint at the result which they are now familiar with. These subtleties are not just obscurely placed props but are woven into the film's montage with clever camera angles along with certain key objects seen on screen. It is a thriller worthy of Hitchcock or the best of DePalma. Nothing is in needless excess and even the profanity is well written and there are no pointless macho wisecracks. Simply put, everything works in this movie. And it works very well. Even upon multiple viewings the film captivates with its clever composition and that can only be a good sign. --- 10/10\n\nRated R for violence and profanity. Ages 13+"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "appleminiami",
        "review_rating": "10",
        "review_title": "Im the biggest fan!",
        "review_detailed_main": "The usual suspects is a movie about... forget about what it is about. Just stop what you are doing and go watch the film! NOW! I promise you that you will be amazed. Hurray! The Usual Suspects rules!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "bypeterfenton",
        "review_rating": "8",
        "review_title": "Really masterful ending; a touch difficult to watch in the present day",
        "review_detailed_main": "I went into watching this movie knowing only two things about it: I knew it was a project that launched Kevin Spacey's career (and say what you will about him as a human being, but he did a damn good job acting in this movie), and that there's a mind-blowing twist at the end that is pretty much the dictionary definition of a twist ending. And I will say, it's very difficult to discuss the film at any length without giving away the ending. The script is good, the visuals are fantastic at points (that shot of the shattering coffee mug will live rent-free in my head for quite some time), and the acting is pretty spot on. You can tell these boys had a fun time making this movie. I will say though-some gripes that I'm not faulting the movie itself for, since it was made in 1995-it's difficult in the year 2022 to watch a movie with so much unchecked casual homophobia, and it's genuinely a little hard to differentiate five individual main characters when they are all white men.\n\nAll told, though, this movie is good. As a screenwriter myself, I'm definitely taking notes on how to craft a satisfying ending that ties just enough up to be satisfying and still leaves you with a lot of questions. The last 15 minutes of the film alone are worth the price of admission. I'll be curious to watch it a second time knowing the ending and see what I pick up on that I didn't on this first time through."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "drystyx",
        "review_rating": "7",
        "review_title": "total of all stereotypes in formula routine film with no assets",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "blairgallop7",
        "review_rating": "10",
        "review_title": "Not your usual crime-drama/thriller",
        "review_detailed_main": "One of the best crime/thrillers out there,The Usual Suspects has one of the best plot twist endings ever for a movie.Five criminals are lined up and really have nothing in common.The film is told using flashback and narration as it tells the story of Roger \"Verbal\" Kint (two time Academy Award winner Kevin Spacey who won his first Oscar for this film-Best Supporting Actor)who is a small time con-man being interrogated by U.S Customs Agent Dave Kujan(Academy Award nominee Chazz Palminteri) over an incident that takes place near a shipping yard in Los Angeles.The film has a great ensemble cast to it with the likes of ,Stephen Baldwin,future Academy Award winner Benicio Del Toro,Kevin Pollak,Gabriel Byrne and Academy Award nominee Pete Postlethwaite.It also won the Best Original Screenplay(Christopher McQuarrie) and was directed by Bryan Singer(X-Men)Bravo to all those involved in a spectacular crime classic like The Usual Suspects!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "aDamRulz69",
        "review_rating": "1",
        "review_title": "Stupid gimmick stupid movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Menina",
        "review_rating": "",
        "review_title": "Am I really getting it? Are you? (brain hurts)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "martinpersson97",
        "review_rating": "9",
        "review_title": "Twists and turns makes greatness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "RafiSteinger",
        "review_rating": "10",
        "review_title": "Brilliance in Movie Making",
        "review_detailed_main": "The film \"the usual suspects\" is brilliant by means of many different facets of film making; and brought together perfectly to comprise one of the most historic and critically acclaimed films of all time. To start, the plot alone is intelligent and baffling, so much that the general public is challenged to piece together a seemingly surrealistic account of mystery and murder. However, there's more to this movie than just the mere genius behind the plot. For starters, the cinematography, editing, and acting are captured perfectly to not only portray a story, but involve the audience as though they were to experience the story themselves. Additionally, the actors are brilliant and capture each character as precise as necessary to accurately forshadow the climactic point of the movie that leaves audiences breathless.\n\nHowever, behind the brilliance of the film, the editing, the acting, the storyline, the script, and the cinematography; are the ingenious facts hidden within the movie's composition. The antagonist himself was based off of a real-life serial murderer, whose actions are depicted in the film under alternative pretenses.\n\nIn all, this movie portrays the perfection of cinematography and should be the precedent that movie-makers strive to achieve."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "PaulJurma",
        "review_rating": "10",
        "review_title": "Second times the charm",
        "review_detailed_main": "This movie is way more enjoyable the second time, at least for me. The first time i watched it i got the time line confused and i didn't really know what was happening until i asked one of my friends who i was watching it with to explain the time line to me a little. It's a very good movie, it's just that the beginning is a little confusing, and that's why i say it's better the second time around."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "wad-alameddine",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "A masterpiece. The casting, the acting, the script, the score, the story structure, the use of light, the sets and locations, the angles and shots, etc etc etc. One of only 2 films I've ever described as a \"masterpiece\". I truy believe this one of THE greatest movies ever made, and influenced so many movies that came after, particularly in story telling."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Lovesspuds",
        "review_rating": "10",
        "review_title": "must see",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "acontardi",
        "review_rating": "9",
        "review_title": "A shocking ending paired with fabulously written characters to create a masterpiece",
        "review_detailed_main": "An ending no-one could have seen coming, a fabulous plot that oozed with deceit and red herrings. Everyone who has seen this film wouldn't hesitate to wipe their memory just to be able to get that same feeling of suspense and utter shock that those final few moments gave. The loss of one of my favourite characters in this movie (Fenster) could have been changed, in my opinion, to Todd Hockney since I felt as if he didn't bring as much to the 'lineup' as Fenster did with his comic relief. The momnenti had finished this movie I had decided instantly that deserves a spot in my hall of fame along with another of the great Kevin Spacey's movies (American Beauty). I will finish with one of my favourite lines from any film: \"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\"\nKeyser Söse."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "etc_fotbal",
        "review_rating": "6",
        "review_title": "what?",
        "review_detailed_main": "Could anyone please tell me what is so GOOD about this movie???What makes this one of the best in history???\n\nReally,I wasn't impressed by the acting..only kevin spacey a little,but he doesn't deserve the Oscar!!!.Then,what so COOL about the story?it was obvious!I just can not figure out how a film like this beats so many other magnificent movies that are rated much lower???\n\nSo,the acting wasn't fascinating.The plot was only ordinary,if not worse.The directing doesn't bring anything special...it's obvious why this wasn't even nominated fot best picture!!If it was as good as everyone thinks,it would had been much more appreciated by the professionists...\n\nThis is only one of the many movies that tell one of those stories(which are all alike)but that got lucky and got some good votes.\n\nIf you enjoy ordinary,not so good movies,watch this USUAL movie"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "bkoganbing",
        "review_rating": "9",
        "review_title": "A Gang Formed During A Police Lineup",
        "review_detailed_main": "Five hoodlums are hauled into a police station in a dragnet roundup of The Usual Suspects that are brought in for questioning when something big breaks. Good chance any one or all could have been involved. If you remember in the film The Brink's Job, there is a scene where within a day a lot of Boston's known hoodlums are brought in for questioning. The dragnet brought in Stephen Baldwin, Bernicio DelToro, Kevin Spacey, Gabriel Byrne, and Kevin Pollak. From this motley crew a gang is born.\n\nFlash forward to several years later when there is a horrific fire on board a freighter where there has been a gun battle with many deaths. Kevin Spacey managed to survive along with two others of the freighter crew and is being questioned in the police station by US Customs Agent Chazz Palmenteri and LA cop Dan Hedaya.\n\nAfter a couple of other jobs, this crew winds up working for a criminal mastermind from the Balkans who is known as Keyser Sose who is known to be so ruthless that the criminal population itself is scared to death. This guy is spoken of like he was Satan himself and of course the police want him big time also.\n\nI can't say much more because the plotting of The Usual Suspects is so intricate and filled with unexpected twists that to spoil this film would be a crime itself. Some here like Stephen Baldwin give their best performances on screen. Kevin Spacey won his first Oscar, this one in the Best Supporting Actor category. The category has me stumped because it's his character that's the key to the whole film. The other Oscar The Usual Suspects won was for Christopher McQuarrie for one highly original Screenplay.\n\nThe Usual Suspects has enough action for those who crave that, especially when we do see the final battle on that freighter and it's also some highly literate dialog for those who appreciate that. It's best compared to that granddaddy of all caper films The Asphalt Jungle, it's that good."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "steiner-sam",
        "review_rating": "7",
        "review_title": "An entertaining, if unbelievable plot",
        "review_detailed_main": "It's a crime movie set in the 1990s in New York City and Los Angeles, California. It rests almost entirely on the plot rather than on developed characters. It follows five criminals who seem to be thrown together by circumstance. Michael McManus (Stephen Baldwin) and Fred Fenster (Benicio del Toro) are two hardened criminals who have worked together for five years. Todd Hockney (Kevin Pollack) is a loner. Dean Keaton (Gabriel Byrne) is a former bent cop who spent five years in prison and continued in crime but is now trying to escape the underworld because of his lawyer girlfriend, Edie Finneran (Suzy Amis). The fifth hood is a seemingly low-level con man, Roger \"Verbal\" Kint (Kevin Spacey), who limps because of a twisted foot and crippled hand.\n\nCrooked cops set up the five for a crime in New York City, but they are released. They take revenge against the police and head to California to fence the jewelry they stole. There, they encounter a fence named Redfoot (Peter Greene), a lawyer named Kobayashi (Peter Postlethwaite), and hear of a Turkish crime godfather named Kayser Söze, who involves them in a climactic caper that results in 27 deaths, and only one of the five survives. As the only survivor, Verbal Kint is interviewed by LAPD Sgt: Jeff Rabin (Dan Hedaya) and Federal agent Dave Kujan (Chazz Palminteri). The film follows this interview, interspersed with flashbacks to events going back to New York City. Verbal spins a very complex story to Kujan, who leads the interrogation. The movie's ending reframes everyone's assumptions about what has just been seen.\n\n\"The Usual Suspects\" is an entertaining, if unbelievable plot. Spacey is excellent as the \"everyman\" who is not what he appears to be. One reviewer compared this film to \"Pulp Fiction,\" but it doesn't come close. In this film, the viewer needs to work to track the plot, and at the end, you scratch your head at gaping logical holes. But Spacey's performance under interrogation is worth a watch."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "kon-tiki-2",
        "review_rating": "1",
        "review_title": "Pretentious",
        "review_detailed_main": "A fine example of a movie trying really hard to be a Rubik's Cube. When a movie starts tripping over itself just for the sake of complicating the plot--that's when I throw up my hands and say, \"Enough already!\" It stops being entertaining and enjoyable and begins to be nothing but a chore. I tried to like this movie, but after being introduced to about 300 characters who all look and act alike (their names even rhyme, for God's sake!), and when the plot demands that we memorize all sorts of details about each one of them to follow the story, that when it stops being fun. I felt like I was working overtime just to keep up with this mess.\n\nWhen the ending is finally sprung, and I thought about it in the context of the rest of the movie, it should have all made sense, justifying the over-complicated story, but it didn't. Holes opened up large enough for houses to fall through. It seemed as if the writer just threw in the most unlikely possibility to astonish the audience. After the maze he leads us through, it's easy to forget why this doesn't make sense. It's a real cheap shot."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "lagudafuad",
        "review_rating": "8",
        "review_title": "one of my favorite interrogations",
        "review_detailed_main": "A movie whose name is gotten from a line in the old classic, Casablanca \"The Usual Suspect\" is about an interrogation gone wrong. The movie is very hard to connect together, and the masterful twist ending for some did more harm than good, but for me it was the thriller of the whole movie. The fact that after the movie is over I still have to sit down and think about it, connecting the dots and wanting to have another re- run of the movie to be sure that I don't miss any dot, that is the reason why this movie is a master piece.\n\nWritten by Christopher McQuarrie, the Keyser Söze character is based on the accounts of John List, an accountant who murdered his family in 1971 and then disappeared for almost 20 years by assuming a new identity before he was eventually apprehended in 1989. McQuarrie got the name Keyser Söze from the name of his former supervisor Keyser Sume, and the last name Söze is Turkish which is translated as \"talk too much.\"\n\nThe Interrogation scene was first shot and it ran for 6 days, and the rest of the movie was put together next and editing was the grand touch that made this mystery thriller that good a movie to see.\n\nThe movie plot is about the interrogation of a small time con man named Roger \"Verbal\" Kint (Kevin Spacey), who is a one of the only two survivors of a heist gone wrong that resulted to a fire on a ship. He tells the interrogator the series of events that led him and four other criminals to the boat.\n\nThis series of events are shown to the viewer in the form of flashbacks as Kint narrates his story to the over confident interrogator. As the story goes on and gets complex the interrogator connects the dots and explains the story better to Kint, only to get the shocker of his life when he releases Kint believing he was used by the other four.\n\nDone with a 6 million dollar production budget, the movie recouped its production cost and more; the well crafted screenplay by Christopher McQuarrie gained him an Academy Award for Best Original Screenplay and Kevin Spacey won the Academy Award for Best Supporting Actor for his performance as the criminal Keyser Söze.\n\nThe Usual suspect is a fine film, well developed to push the imaginations of the viewer, the unexpected ending is the cream on the top of this delicious masterpiece and one thing is sure, you will be asking for seconds after you are done seeing it the first time.\n\nwww.lagsreviews.com"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "toseale",
        "review_rating": "10",
        "review_title": "You'll Never See it Coming",
        "review_detailed_main": "As I was watching The Usual Suspects, I found it enjoyable, but not quite at a 5 star rating. But as it progressed, I changed my mind. It's an airtight movie with so many small details and clues that create a sense of misdirection to the twist near the end, and the storytelling itself is amazing. And that twist gets twisted with more details and clues, ultimately making this the perfect crime/mystery. The comedy lands correctly when its needed. Every character is great, and the actors all sell their roles perfectly. I love this movie, and it's a major recommendation from me."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "mrawat",
        "review_rating": "",
        "review_title": "Great movie, here is a critique of the criticisms",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "shadowman123",
        "review_rating": "8",
        "review_title": "Good film , if not a little too over hyped.",
        "review_detailed_main": "The Usual Suspect is one of those films which tell you that seeing is believing. Don't get me wrong it was a very good film and I am glad I finally got the chance to see it but with critics going on and on about it, they kind of kill the magic of the movie. However that really did not hinder my enjoyment as I decided to treat this just like any other movie. Basic concept of 5 cons on various heist missions until one goes terribly wrong and then the authorities try to establish what went wrong hearing this from the account of one of the crippled crooks (Kevin Spacey). Gabreil Bryne was a excellent in his role as the lead crook and Benico Del Toro was also a stand out performance but we all know that Kevin Spacey was the man who took joy in playing the audience like a piano. A film can start of slow but the ending is the most important thing in the whole thing and I am glad to say that this ending was nothing short of a slap in the face.\n\nTHE USUAL SUSPECTS - 8.1 OUT 10\n\nTHE GREATEST TRICK THAT THE DEVIL EVER PULLED WAS CONVINCING THE WORLD THAT HE DOESN'T EXHIST AND JUST LIKE THAT..... HE'S GONE !"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "basrutten",
        "review_rating": "9",
        "review_title": "Magnificent thriller",
        "review_detailed_main": "This movie is a great thriller that has something that very little movies have: an intelligent plot full of twists, that holds up even after several viewings and becomes more fascinating every time you watch it. No really ! Every single detail of this movie simply matches up. And the ending is the best I've ever seen, barring maybe only Fight Club.\n\nOf course, the cast, lead by Kevin Spacey and including Gabriel Byrne and Pete Postlewaith, is excellent as well with the exception of Benicio del Toro, who seems to do his best to come across as creepy as possible but fails miserably.\n\nAll in all, one of the best thrillers ever made. If you haven't seen it, go watch it NOW, or Kaiser Soze is coming to get you...\n\n**** out of **** stars"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "shagibaba",
        "review_rating": "9",
        "review_title": "An absolute beauty!!",
        "review_detailed_main": "I went to watch the usual suspects and was thrilled! The movie was amazing. I loved the way Kevin spacey acted throughout this movie. I didn't give it 10 out of 10 because of one huge reason. I went to watch this movie with someone under 18 years old. The amount of bad language in this movie should have been less. I don't know why people put so much bad words. If you use foul languages a few times its okay but you cant say it in every minute. Anyways leaving that aside the movie was brilliant. All the actors came together well and the director did a great job along with the producer.I will ask everyone to go watch this movie if they can censored or if they want the original versions fine."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "RayCharles81",
        "review_rating": "10",
        "review_title": "A Detective Tries to Solve an Important Case While Interrogating an Invalid Witness Who Has Won Immunity",
        "review_detailed_main": "This is a stylishly made, crime film noir with a surprisingly brilliant script that will literally sneak up on you in how detailed and creative it is. I think that word- creative- is what so many people like about this film. It takes risks and has the gall to stick to them, and that seems to be something that has tended to work in this genre with the favorites it generates.\n\nFor those who dismiss this as a one-watch film, they are sure missing out. I was one of the skeptics who felt it may not be rewatchable originally, but the truth is that the script writing is that good that it holds up in quality on repeat viewings.\n\nAnother misconception some have noted is that they have concluded that \"none of the story was true\", which is not the case at all. The detective is investigating the crime scene at the dock. He even details who was on the boat and how they were connected to the ringleader, the infamous Kaiser Soze.\n\nIn addition to the scriptwriting, this film uses understated and subtle music and camerawork that distinguishes it from a majority of other run-of-the-mill heist or crime films, but where it really excels is its handling of its mysteries, revelations, and its own mythology.\n\nWhen watching this film, you may enjoy the conventional crime suspense as you would in the genre, but what you may love is how it messes with your head. With so many remakes, clichés, and dumbed down movies that have all been done before, real movie lovers sometimes have an innate desire for a film to totally screw with their head, and the way the Usual Suspects does it is not through horror, excess gore, or outlandish jump scares or CGI; it does it through intelligence, subtleties, and outstanding film editing overlapped with unforgettable musical scores that all can combine to send chills down your spine.\n\nBut to make it even more eerie and somewhat profound, it even includes classic lines like this: \"Dean Keaton once said, 'I don't believe in God, but I fear him. Well, I believe in God, and the only thing in this world that scares me is Kaiser Soze\" and \"The greatest trick the devil ever pulled was convincing the world he didn't exist.\"\n\nThis crime world blends elements from the underworlds of Argentina, Hungary, Russia, and elsewhere, as mythological, notorious villain, Kaiser Soze, makes chess moves around the globe to protect his assets, as well as his identity. His underlings handle all of his dirty work, as would likely be the case in the mob hierarchy, so there is definitely an element of realism within the story and script. But with his obscure existence, can Detective Kujan identify him with the help of the one person who may be able to finger him in a lineup?\n\nThis is a low budget, indie hit that won't be for everybody, but most fans of artistically-made original movies will probably like it. Strong performances by Chazz Palmieri, Gabrielle Byrne, Giancarlo Esposito, and Kevin Spacey, as well as a creatively strange one by Benicio Tel Toro carry this unusual entry to the crime thriller genre. Hold onto your hats."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "vailsy",
        "review_rating": "6",
        "review_title": "Not all its cranked up to be",
        "review_detailed_main": "while this is certainly not a bad film, i would not consider this movie to be classic material. it doesn't deserve the 8.7 or so rating is has here currently\n\nwhile the plot twists are clever, the film always strikes me as distinctly hollow. mainly because Keyser Sozes' motivations are never given any clarity or urgency. we really have no real idea why this man has gone to all this incredible trouble to maintain anonymity. the background of the character could have been given more substance without compromising the mystery\n\non the flip side of that, if the aim was to maintain an air of mystery or the supernatural.. then the film falls short on that count also. the ending in particular is distinctly flawed. this man of mystery with no acquaintances would surely disappear independently. blend in to the background. not get a lift home after\n\nin addition to that, i find some of the acting in this movie to be second rate. spacey plays more or less the same character he played in seven, and no one else here is exceptional\n\noverall this is still a good quality movie, but i would not regard it as a classic.\n\none movie deserving of that accolade that was around shortly before this one, and a film that suspects borrows from rather massively (as did many movies made around that time) is pulp fiction. now that is a classic film. it has style, great acting and a substance and momentum that suspects truly lacks"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "arthur_tafero",
        "review_rating": "8",
        "review_title": "The Usual Suspects - Not Your Usual Crime Drama",
        "review_detailed_main": "This is a wonderful ensemble piece with a pack of talented actors. And it is a male tale without any complicating romantic entanglements; just pure Alpha Male stuff. The movie is primarily dark (most scenes are at night) and it is as noirish (a new adjective) as you can get. There is one enormous surprise which I will not reveal to you, as it would ruin your viewing experience. But suffice it to say you will not figure out what it is. Del Toro, Byrne and Spacey give outstanding performances, and the writing of Chris McQuarrie is first-rate.\n\nSteve Baldwin is entertaining in his roles, but there is one actor who steals the show; and once again, I will not tell you who that actor is; it would spoil your enjoyment."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "sol1218",
        "review_rating": "7",
        "review_title": "Making a simple plan complicated doesn't make one brilliant",
        "review_detailed_main": "******SPOILERS****** Highly overdone movie about a mass killing in a shoot-out and explosion of a ship docked at San Pedro Harbor with connections to a notorious Hungarian drug gang. As well as a crew of hoods recruited out of NYC who tried to rip the gang off of the 91 million dollars of coke on the ship. Added to that a mysterious mob kingpin who set up the whole operation, for very personal reasons, to use as cover for him to knock off a witness on the ship that was to be turned over by the gang to the FBI as a witness against him that could land the mob kingpin behind bars for life.\n\nAll this is seen in flashback, at the San Pedro Police Station, with Special US Customs Agent Dave Kujan, Chazz Palmintri, interviewing Roger Verbal (Kevin Spacey),the only survivor of this holocaust, for what seems like the time you would have sat through an old movie triple-feature with cartoons newsreels and coming attractions added on. We're bombarded by Verbal's story that goes on endlessly about how he and his fellow hoods were recruited by Mr. Kobayashi, Pete Postiethwaite, back in New York City some six weeks earlier to do a job for the mysterious Kayser Soze (?) ,whom they are told by Kobayashi that they are in debt to. Verbal goes on endlessly talking about this very strange and confusing plan that the Kayser concocted which in the end turns out to be an elaborate hit, by himself, of a protected government witness.\n\nYou would think if this Kayser Soze was as smart as the movie makes him out to be why didn't he or his mouthpiece, Kabayashi, tell these hoods just to knock off the witness instead of having all this killing going on at the San Pedro Harbor as well as all over the country with all of them ending up dead except Verbal? And even more important why did he, The Kayser, have to kill the witness himself leaving himself open to being killed or captured by the Hungarian drug gang as well as the recruited hoods themselves if they ever found out who he was, and what he was planing for them, or the police?\n\nAnother thing that doesn't make sense about the movie \"The Usual Suspects\" is that this Kayser Soze who is so unknown and secretive even to his fellow mobsters, it seemed that only Mr. Kobayashi knew just who he was, would be that well known by the FBI or local police to be identified and arrested? And who would their protected witness know who to finger if this Kayser Soze was so unidentifiable? What was so important about this person that the Kayser was dealing with, and wanted to knock off, that he would reveal his real identity and place of residents to him where he would blow the cover that he so painstakingly built up over the years? Was this individual involved in preparing the Kysers Federal and State Income Tax returns?\n\nEven at the end of the film when it was finally revealed just who the Kyser was you still didn't really know who he was since he was using an allies just like the name Kayser Soze itself obviously was. And even if the FBI and local police really knew who he was and where he was and went to arrest him would the murderous and cunning Kayser Soze just stay there and let himself be taken into custody? With all the avenues of escape and control with his mob's vast resources available to him?\n\nThe ending of the movie shocked you only because it seemed to make sense at the time that you were exposed to it but after getting over the shock and realizing just how irrational it was, as well as the whole film, you began to see that's all it really was: An end to the movie."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Ben_Cheshire",
        "review_rating": "1",
        "review_title": "Over-wrought.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "FARFAREE",
        "review_rating": "9",
        "review_title": "Perfect movie",
        "review_detailed_main": "Immersive, action, fun and thought-provoking movie. I never expected the end like this, it's a really great movie."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "mutanthunter-95753",
        "review_rating": "10",
        "review_title": "Greatest Plot Twist of Cinema History!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "louannsorrylowed",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": "After a truck hijack in New York, five criminals are arrested and assembled for questioning. Since none of them are guilty, they plan a revenge operation against the police. The operation is going well, but then the influence of a legendary criminal genius named Keyser Söze is felt. It becomes clear that each of them has offended Söze at some point and must reciprocate now. The revenge work leaves 27 men dead in a boat explosion, but the real question now arises: who is Keyser Söze really?"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ihorkovich",
        "review_rating": "8",
        "review_title": "The usual masterpiece",
        "review_detailed_main": "Impressive, stylish, classic, brutal, serious, impressive, guns, drugs, gangs, murders, blood, explosions - this movie definitely worth your attention if you like such movies. The movie is watched in one breath. Everything in essence, no water, no extra and unnecessary details, only those that slightly mislead the viewer, but they are not superfluous either.\n\nThe plot of the film is quite simple and straightforward, but at the same time it is played incredibly cool. Extraordinary and fascinating characters are one of the strongest points of the film, they are perfect. The acting, as you already guessed, is also at a high level and in general, the whole movie is gorgeous."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "adambartaaa",
        "review_rating": "9",
        "review_title": "The Usual Suspects",
        "review_detailed_main": "This movie is the best movie in its kind. It's a 1995 crime-drama featuring stars like Kevin Spacey (who by the way won an oscar for this film) or Benicio Del Toro And if I haven't mentioned it, this movie is perfect! It's dramatic, thriling, really mysterious, and really funny! You cannot make a mistake by watching this movie. \"The greatest trick the devil ever pulled, was convincing the world, he didn't exist. And like that, he's gone!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "MK_Movie_Reviews",
        "review_rating": "9",
        "review_title": "You can't judge a book by its cover.",
        "review_detailed_main": "What this film teaches us \"You can't judge a book by its cover.\" \"Truth is stranger than fiction.\"\n\nWhile we were watching this film for about 90 minutes, we were looking for the hidden true devil.\n\nAnd the shocking ending!!\n\nThe fact that was revealed 5 minutes before the movie ended was unexpected.\n\nKevin Spacey's monstrous performance is superb.\n\nThere are many good quality suspense movies in the 90's."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ccthemovieman-1",
        "review_rating": "",
        "review_title": "Okay, But Let's Not Get Carried Away",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "vampiremeg",
        "review_rating": "6",
        "review_title": "I don't get it!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "hlee-74887",
        "review_rating": "10",
        "review_title": "Guilty Pleasures",
        "review_detailed_main": "\"The greatest trick the devil ever pulled was convincing the world he didn't exist. And like that.....\n\n....he's gone.\"\n\nA movie you have to watch again to appreciate the full effects."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "kaos-23",
        "review_rating": "7",
        "review_title": "Good, but not THAT good",
        "review_detailed_main": "For some reason, I didn't get round to seeing this film until quite recently (just one of those weird things). I was excited to finally see it since I'd heard so many people rave about it, but I have to say I was somewhat disappointed. Without question it is an entertaining, surprising, and well-acted film, but I can't see why it gets quite such high ratings on here.\n\nKevin Spacey does a fine job of playing the part of Verbal, and Gabriel Byrne is okay too, but otherwise there were no outstanding performances. Similarly, while the plot was clever, it was nothing that amazing, and I saw the twists coming a mile off. Unlike something like Reservoir Dogs, which gave the gangster film a much-needed injection of not taking itself seriously, the crims in The Usual Suspects are just the typical bad-boys-who-fancy-themselves. Also, maybe Americans can accept Pete Postlethwaite's bizarre accent and make-up, but for me it really detracted from the film - what WAS he supposed to be? Indian??? If so, why on earth didn't they get an Asian actor? Sorry, I don't mean to slag off a film that I know a lot of people really like, I'm just giving my honest opinions. I suspect if I'd seen it when it came out, I too would have found it an amazing groundbreaking piece of cinema, but IMHO it hasn't really stood the test of time.\n\nStill, it was a decent way to pass a couple of hours, so I've given it 7/10."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "fog-9",
        "review_rating": "2",
        "review_title": "am i missing something? nope.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "johnsa13",
        "review_rating": "10",
        "review_title": "The Usual Suspects should be a classic someday.",
        "review_detailed_main": "This movie was directed by Bryan Singer and was released in 1995. This is a great action, drama, mystery movie all wrapped up into one. It is a movie about five criminals that are well known in New York. These five criminals were initially brought in for a police lineup but then the movie really builds from there. These five criminals all vow to get back at the police force. This takes them on a journey of criminal activity. First they get back at the cops by exposing dirty cops. Then they start working other various jobs together. Then one turning point in the film is that they are called upon by Kaiser Sosa to take on a dangerous job. Kaiser Sozas character is then built as spooky, vicious underworld figure that even the most notorious criminals are afraid of.\n\nThere are five main characters that this movie is based around. Verbal Klint, played by Kevin Spacey is a crippled conman that doesn't like violence. Michael McManus, played by Stephen Baldwin, is a top level entry man that is deemed to be a little psychotic. Todd Hockney, played be Kevin Pollak, is a hardened criminal wise cracker. Fred Fenster, played by Benicio Del Toro, is a partner of Michael McManus. Dean Keaton, played by Gabriel Byrne, was and ex cop turned notorious crook.\n\nThe movie goes throw many flashbacks to give you pieces to the big puzzle that unfolds. There are many details in this movie and after watching it 30+ times I still don't understand all of it. Maybe Bryan Singer wanted it that way, to keep you intrigued and wondering.\n\nThe movie really was edited and directed in very sophisticated way. All scenes were masterfully directed. The lighting was great in various sense throughout the moving. This lighting really accentuated the scenes. All of these aspects gave the film a great visual style and a truly grandiouse feel.\n\nThis movie continually builds to the conclusion. In the end of the movie Kevin Spacey pulls off a great performance. He is being interrogated by agent Kujan. Verbal Klint is making up a very details story about what he is being interrogated about. As soon as Verbal is released Kujan realizes that he had been duped. Virbal then enlightens the viewers that he is the notorious non gimpy criminal called Kaiser Sosa.\n\nThis movie really doesn't have a parity that I am aware of. It is unique, intriguing and keeps you mentally engaged throughout the movie. One quote and really the central theme to this movie is: \"the greatest trick the devil ever pulled was to convince the world he didn't exist\"."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "marshsmith-40400",
        "review_rating": "10",
        "review_title": "My thoughts on this movie totally changed throughout this movie",
        "review_detailed_main": "Initially, I thought this movie was boring for about the first hour. Then it got a little better. And by the end, with the very unpredictable twist, I was wondering if it was the best movie I had ever seen. I highly recommend this movie if you're into mystery, or even if you're not, the movie has action, drama, and very good acting."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "grahapar-58942",
        "review_rating": "9",
        "review_title": "One of the best crime movies ever!",
        "review_detailed_main": "This movie keeps you hooked from start to finish. This movie is great especially when it comes to attention to detail and is amazing it being very subtle with foreshadowing to the point where if you don't know what is going on you won't catch it. This is one of my favorite performances by Kevin Spacey because the great execution of his role and because, he is great at portraying an emotion perfectly. All in all I would definitely recommend this movie to anyone that loves a good classic."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "damianphelps",
        "review_rating": "10",
        "review_title": "Nothing Usual About it!",
        "review_detailed_main": "I save this for the movies that truly deserve it and this one does.\n\nIts a Masterpiece.\n\nThe performances are among the best of all time but on this occasion they come second to the story, both writing and directing, for the tale that is woven.\n\nFIlm noir is one of my favourite genres and this is the best of the lot."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "angelika-esquillo",
        "review_rating": "10",
        "review_title": "Beautiful Bait",
        "review_detailed_main": "From the witty title to the execution of the plot, I am amazed and truly bewildered by this story's beautiful bait. After watching this, you will realize the value of thinking out-of-the box.\n\nI love each character, they all gave justice to their roles as 'felons'; Each surprised me with their wits and their weaknesses, too.\n\nIf you want a beautiful bait, a forward-thinking suspense and thriller, count this movie in. The plot is brilliant so as the script, I had to re-watch it and see where did I miss. It is fast, it is witty and it will need a nanosecond speed-of-light mind to solve this puzzle. You will never get bored with this one I swear."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "SPZMaxinema",
        "review_rating": "8",
        "review_title": "Acting within acting.",
        "review_detailed_main": "While it's a little overhyped I'd say, I did like the twist at the end and the acting from most of the crew, particularly Spacey (of course) and Stephen Baldwin mostly. The story can be a bit to take in at certain points but Spacey is kind of a Heath Ledger Joker type of villain for the 90s. He makes the movie what it is, being a good film!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "drqshadow-reviews",
        "review_rating": "7",
        "review_title": "Not Entirely Unusual",
        "review_detailed_main": "This might be one of those films where all your buddies talking it up turns what would've been a solid experience into something of a let-down. A good enough crime saga with some great one- liners and several sharp twists and turns, it's not something I'd revere alongside the all-timers. I felt like there was too much reliance on name dropping and intentional complications, which I guess fits in with the big twist at the very end, but that doesn't suddenly make it excusable. Tough to follow at many times, with some interesting storytelling experiments along the way; it's a good-to-very good story that often gets too caught up in itself."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "advaitkamat",
        "review_rating": "10",
        "review_title": "Mysteries don't get any better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "bholly72",
        "review_rating": "6",
        "review_title": "Great until the surprise ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "krakatoa1883",
        "review_rating": "5",
        "review_title": "\"Why'd you wanna' treat me like a Keser!!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "maedurant-238-444230",
        "review_rating": "9",
        "review_title": "I guessed the ending but when it panned out even better than I thought",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "yellowtail_tuna",
        "review_rating": "10",
        "review_title": "You will be drawn to the mystery in the film noir",
        "review_detailed_main": "This film is mysterious from the beginnig. Night on the deck of a ship strewn with bodies, apparently an aftermath of a shoot-out, a wounded man, who later we know is a criminal Keaton, resignedly looking up at a figure who he calls Keyser, then Keyser aims a gun at him, and bang, bang.\n\nThen it is exploring what has lead to the culmination. U.S. Customs agent Kujan sets up an unofficial investigation into a survivor Verbal, through whose statement we follow the series of events that he, Keaton and other three fellows went through for weeks.\n\nThe five men's mug-shot scene, six weeks before the ship and just after a truck-hijacking, is iconic. I already know in terms of plot, Keaton and Verbal are the main, and other three are something like supportive. But each man is equally attractive as a character. I love especially Fenster's babbling. And each man is a man who 'never bend over for anybody'.\n\nAfter released, the five men go on to the next heist, and next. But pursueing is somehow turning into being pursued and manipulated. A lawyer calling himself Kobayashi shows up, and alleges his employer is Keyser Söze, who is told in the fearsome underground urben myth.\n\nThe plot is so complicated that you will hardly keep track of everything. But no matter how well you comprehend the plot, you will be drawn to the mystery anyway. As Keyser Soze's invisible influence is looming, their fate become desperate. This is a film noir, all about the misery of criminals, and that is poignant joy to us viewers.\n\nI'm sure it must have been very astonishing Kevin Spacey's acting as Verbal was, as he was much less known back then. His expression is interpretable as A or B, which in turn irritates Kujan, played by Chazz Palminteri, who is also excellent. It often uses close-up shots, and every character's close-up face is tight and powerful. The suspense will never loosen you up to the ending, one of the best ending scenes I've ever seen."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Dan_W_Reviews",
        "review_rating": "10",
        "review_title": "Timeless Masterpiece, Intricate Storytelling, Fantastic Performances and Directing",
        "review_detailed_main": "The usual suspects is an absolute masterpiece of cinema that delivers a riveting and thought-provoking story with incredible performances and masterful directing.\n\nWhat makes this film so impressive is the way it weaves together its complex narrative, with cleverly placed clues and red herrings that keep you guessing right until the very end. The writing is fantastic, with sharp dialogue and a well-crafted screenplay that makes for an engaging and thrilling watch.\n\nThe performances from the entire cast are outstanding, with Kevin Spacey giving, what is is my eyes, his career-defining performance. His subtle nuances and mannerisms add depth and intrigue to his character, and he delivers some of the film's most memorable lines. The rest of the cast especially Benicio Del Toro and Stephen Baldwin, all shine in their respective roles, with each bringing a unique energy and personality to their characters.\n\nThe directing by Bryan Singer is also brilliant, with his use of camera angles, lighting, and music hightening the tension and atmosphere of the film. The music is also excellent, its haunting melodies and intense percussion do a great job of adding to the film's suspenseful moments.\n\nOverall, this film is a brilliant and timeless classic that will continue to stand the test of time. Its intricate and clever storytelling, coupled with outstanding performances and direction, make it a must-see for any fan of crime and thriller movies. It is a solid 10 out of 10 and a true masterpiece of cinema in my opinion."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ozcanozen-14704",
        "review_rating": "10",
        "review_title": "A Stunning Masterpiece",
        "review_detailed_main": "This is not the best performance of Kevin Spacey I have ever seen, but it is unlike any script I have ever seen before. You may get bored until the last 15 minutes of the movie. But the last 15 minutes are delicious like the icing on the cake.\n\nThe movie already proves this with the best screenplay Oscar. But if you are really patient and put your prejudices aside, you will enjoy the movie you watch.\n\nWho knows how many people turned off this movie because of the first few minutes and were deprived of such a masterpiece.\n\nIf you watch the movie in the rain with the sound of light rain coming from the window, you will enjoy it even more."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "PredragReviews",
        "review_rating": "10",
        "review_title": "\"I believe in God, and the only thing that scares me is Keyser Soze\"",
        "review_detailed_main": "Wait a minute... five criminals in one lineup? There's something wrong here, right? Right... In \"The Usual Suspects,\" not only every line but every gesture, every facial expression and every camera cut counts. Even if you distrust the story being told, you can't exactly pin down everything that's wrong with it. The plot unfolds through the tale extracted from Kint, one of two survivors of a massacre and subsequent explosion on a boat docked in San Pedro Harbor, by U.S. Customs agent David Kujan (Chazz Palminteri). And at the same time as Kint is spinning his yarn, in a nearby hospital the other survivor (badly injured and fresh out of a coma) helps a police sketch artist draw a picture of the mastermind behind the scheme - \"the devil,\" Keyser Söze. You can watch this movie countless times, and you will still discover new subtleties every single time. Not only will you find that it still makes sense after the story line has been unraveled at the end (which therefore is a plot twist, not a non-sequitur). You'll also discover nuance upon nuance in Kevin Spacey's incredible performance. You'll see that tiny apologetic grin on Todd Hockney's face as attorney Kobayashi (Pete Postlethwaite) lists a weapons truck heist - the very act which brought them together in the initial lineup, and which they have all come to believe to have been a trumped-up charge - as Hockney's latest sin against Keyser Söze, now forming part of the debt to be repaid by participating in the suicide mission in San Pedro Harbor. And at some point you'll also have figured out all of Fenster's lines (not being a native English speaker, I am relieved to find that I wasn't the only one struggling with them at first)... although the mumbling is of course part of his character, and is as excellently delivered as every other aspect of Benicio del Toro's acting, his lines are so funny and to the point you almost wish he'd speak more clearly so you wouldn't miss half his punch lines the first time around.\n\nThis masterpiece of cinema deservedly won the best screenplay Oscar and best supporting actor Oscar for the wonderful Kevin Spacey in 1995. The film is a modern day classic with all the elements of great film making coming together. A fantastic script combined with brilliant direction and a cast that seemed to be thoroughly enjoying itself, this is 1940's film noir at its very best, brought thoroughly up to date for the 1990's, combining clever little references to the past with very modern settings at that time. Action, suspense, plotting, double crossing - the whole kit and kaboodle.\n\nOverall rating: 10 out of 10."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "KevinReal310",
        "review_rating": "9",
        "review_title": "MASTERPIECE",
        "review_detailed_main": "A perfect movie from start to finish really no other thriller since this in the 90s has even come close. The twist at the end is hard to ever top.\n\nThank you to the filmmakers!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Ismaninb",
        "review_rating": "7",
        "review_title": "Don't read Agatha Christie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "thantri",
        "review_rating": "10",
        "review_title": "Masterpiece!",
        "review_detailed_main": "The Usual Suspects in one of the greatest movies ever made.I loved everything in this movie.Great plot and great performances from the actors."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "jacobbjacob",
        "review_rating": "7",
        "review_title": "An Unusual Thriller",
        "review_detailed_main": "As the plot unfolds, we as the audience, unknowingly becomes a part of the investigation of the truth. Glimpses of evidence and certain references are given from the very beginning."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "andrewmil",
        "review_rating": "1",
        "review_title": "Usual Suckspects",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "richardtownsley-19550",
        "review_rating": "9",
        "review_title": "\"The greatest trick the Devil ever pulled was convincing the world he didn't exist.\"",
        "review_detailed_main": "The Usual Suspects is the kind of movie that you either love or hate. There is no in-between. You either consider it to be a masterpiece or a blot in cinema history. As I'm sure you have guessed, I am among those who consider it a masterpiece. The Usual Suspects is the type of movie where your heart is pumping so fast, you can't feel your arms after watching it because all your blood went to your head. It is expertly shot, written, and acted. This movie, along with Seven, L.A. Confidential, and later American Beauty are the movies that launched Kevin Spacey, and all four show off his incredible acting skills. He went on to win an Oscar for his performance in this movie, although I believe the only reason he won over Brad Pitt (12 Monkeys) that year was because he was also brilliant in Seven, but I digress. But, let's be honest for a moment. The real reason this movie is brilliant is because of the total knock-out ending. It is the kind of ending that pulls the rug out from under, and right as you stand up and figure out what happened, they do it again."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Harlekwin_UK",
        "review_rating": "9",
        "review_title": "Many twists and turns superbly done",
        "review_detailed_main": "This is an all time favourite!\n\nAlmost any discussion with any detail risks spoilers so let's keep it generic if we can.\n\nIt won two Academy Awards (Original Screenplay, Supporting Actor) and it is easy to see why.\n\nDuring interrogation Verbal Kint (Kevin Spacey) tells the story of how five normally solo criminals are lured into a plot by a criminal mastermind.\n\nAs the plot unfolds via many twists and turns the audience are driven on with these five to an amazing and much admired final twist.\n\nEach of the characters gets a clear moment to show more of what they are about. And the set piece \"major event\" is shown from so many perspectives - superb.\n\nOh, and have a go to at deciphering (the great) Pete Postlethwaite's accent!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "dhruvpathak-07950",
        "review_rating": "9",
        "review_title": "Crime Thriller gone right",
        "review_detailed_main": "This is one of the classic Crime Thriller movies and is responsible for shooting its lead Kevin Spacey to the top, as well as shooting the genre in the limelight of other filmmakers. The beginning of the movie is a bit convoluted, but it resolves itself out as it goes on. The strongest part about the movie is that the climax doesn't feel either uncanny or unpredictable, and yet it still manages to pack a punch of surprise. This movie quite easily features one of the best storytelling mechanics, and ironically runs storytelling as its core plot point."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "selenamsmith",
        "review_rating": "10",
        "review_title": "The best ever twist to a film",
        "review_detailed_main": "First watched this masterpiece when it first came out and I have to watch it at least once a year. The first time I watched it I was mind blown. Great acting and a great story line. I wish I could watch it for the first time just to watch that amazing ending. I'm actually jealous for people out there that have not watched it yet. Enjoy because I did."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "akrahul",
        "review_rating": "10",
        "review_title": "Genius masterpiece with breathtaking climax twist.....!",
        "review_detailed_main": "I saw a movie and it stuck in my head for ever i.e \"THE USUAL SUSPECTS\".....No word's......that climax gave me some serious goosebumps.Best thriller I have ever watched in my life."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "actualbookworm",
        "review_rating": "9",
        "review_title": "\"The Usual Suspects\"",
        "review_detailed_main": "One of the best neo-noir movies in the 90s with an intriguing ending."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Rerun-2",
        "review_rating": "",
        "review_title": "Less than meets the eye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Euphorbia",
        "review_rating": "6",
        "review_title": "Sorry... What's the big deal here?",
        "review_detailed_main": "The supposedly \"trick\" ending became obvious less than half way through, and the movie was soporific anticlimax after that. Even before that dim-bulb revelation, it was only mildly engaging, with essentially two-dimensional noir characters, none of whom were interesting or sympathetic. 6/10\n\nIf this is really the 17th best movie ever made (current IMDB standing), then cinema is in even worse shape than I realized."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "stallone-9",
        "review_rating": "10",
        "review_title": "Greatest plot twist ever!!!",
        "review_detailed_main": "This movie has the greatest plot twist ever.I'm not gonna risk and spoil it for you if you haven't watched the picture yet but be sure to do so immediately.Great actors who deliver great performances and the biggest question of them all-Who is Kaiser Soze?What a movie!Edge of you seat stuff.The building tension explodes in the end.The 1st time you view the film you may be confused a lot but it's normal.Just pay close attention to all the details on the 2nd viewing.Don't know what to say that hasn't already been said great movie,simply great.Brian Singer is a God for coming up with such a unique story and directing it as the professional that he is."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Kazetnik",
        "review_rating": "7",
        "review_title": "Very clever but rather empty",
        "review_detailed_main": "Well, I waited a long time to see this...and I'm left shrugging my shoulders. On the plus side, it's fast-paced, wonderfully acted (Kevin Spacey doing something that little bit different and oh so well), with exceptional camera work and lighting. But, but, but. The twist is a classic, sending you back to the rest of the movie with all kinds of questions. I just wish those questions extended beyond the details of the plot or the nature of the plotting. As an enquiry into the nature of telling a story, it languishes in the remedial class, opting for a cute but rather cheap revelation rather than any serious interrogation into the nature of a thriller, which is what it seems to want to be.\n\nA good watch and never dull or dragging, but a movie which leaves me with a rather hollow feeling. Disappointing, particularly for something which came heaped with so much critical praise."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "johnfliu",
        "review_rating": "1",
        "review_title": "great trick or dirty trick?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "jjjcp",
        "review_rating": "8",
        "review_title": "great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ethanbresnett",
        "review_rating": "8",
        "review_title": "Brilliant",
        "review_detailed_main": "The Usual Suspects takes a little while to come into its own but once it does it really excels.\n\nThe 5 central characters are all pretty intriguing, with an interesting chemistry and solid performances behind all of them.\n\nThe story is strong, with a non linear, flash back style, told by an unreliable narrator. This is what really marks the film out as something special. The way the story unfolds and how it is told is very clever and entertaining, building towards a fantastic ending.\n\nSeveral elements and stylistic choices haven't aged awfully well in the 27 years since release, but this is a minor point.\n\nA terrific crime thriller."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "brian-mata",
        "review_rating": "9",
        "review_title": "Years later still superb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "from_christmas_past",
        "review_rating": "8",
        "review_title": "Gripping!!",
        "review_detailed_main": "The problems with movies like \"The usual Suspects\" is that they are taken too seriously. People flock to identify a hidden meaning, a socially relevant message or a reflection of time when it was made. While a good movie may and, sometimes, does have one or more of these attributes, still the basic point of every good movie is to entertain. If the movie has involved me in it, made me suspend my disbelief to move along enthusiastically with the story, it has done its job. The Usual Suspects does just that. You may sit comfortably long after the movie is over and think about how some parts make no sense or are improbable. But, while watching it just sweeps you, partly because of its same improbability and also because of its pace. The pace is just right, not fast enough to make you lose track of what is happening, or slow enough to second-guess the motives and figure out the plot twists. The way the movie unfolded and ended was enough to keep me interested throughout. The ending is a classic, even if you guess it a little before you are expected. Of course, the delight in watching it the second time is immense as armed with the revelation at the end, you can view a lot of scenes with an investigative interest and come off totally consumed. Besides its plot, TUS has brilliant performances to keep you entertained and some great dialogs. It is one of those movies form which you can take nothing home, apart from the pleasure while watching it. I say, thats enough!!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "MildInconvenienceMan",
        "review_rating": "8",
        "review_title": "Intricate Storyline, complex but is made amazing by its ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Hitchcock-3",
        "review_rating": "6",
        "review_title": "Overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "johnnyboyz",
        "review_rating": "10",
        "review_title": "Quite ingenious crime film that lets you in and then doesn't give you so much as a sniff unless you can spot all the visual clues and then some more.",
        "review_detailed_main": "Only a film as cryptic as The Usual Suspects could keep you coming back for more and more. A film that is so involved and so smart and engaging in its delivery that it drops several clues to its ending while simultaneously not entirely making them obvious for first time viewers. In fact the series of clues; ideas and the overall ending is so famous, it's been referenced and spoofed in so many other pieces of text that these days it would be almost impossible to watch without knowing what everything revolves around. The mere fact the ending and whole idea has featured in these other texts only confirms The Usual Suspects' cult status and is really just an appreciation or 'acceptance' that it is truly a fantastic film.\n\nThe film is an all over the place (in the nicest possible way), crime drenched neo-noir which cuts back and forth from police station to detective trying to get to the bottom of a supposed drug deal gone wrong on one equilibrium; but also to the flashbacks which are the making of the drug deal on another equilibrium. The film sees visual references, audio references, what characters do as well as general dialogue drop hints as to what is coming and what the truth really is \u0096 hell; in one instance, where a certain character looks is an important clue. But The Usual Suspects is more than a series of tricks and gimmicks masquerading under a decent cast and a well shot, well lit crime saga. It is a journey into a world of the detective; it is a race against time and it is a non-linear crime saga revolving around organised crime, criminals and drug lords.\n\nI have to admit that I didn't fully understand the film first time I saw it, but with the added aid of research and DVD extras, The Usual Suspects quickly became one of my favourite films in terms of atmosphere, narrative and the general pacing of the story being unfolded. The film also carries a certain air of manipulation and ambiguity in its presentation, forcing us to think one thing; forcing us to recognise with seemingly the most unnecessary things imaginable: the way a certain character speaks nearer the beginning; the direction a certain character looks and what they're looking at as well as what certain characters are telling other characters and how they're reacting to it despite the fact we've already seen it.\n\nIf it all sounds complicated then that's because it is, but that's the beauty of the film when it comes to multiple viewings. Everything is set up in a fast and urgent manner after a more sedate and much more calmer opening in which the aftermath of a shoot out on a boat introduces the prologue to the main strand of the film: an interrogation (or a 'friendly chat' according to the interrogating police man) between Verbal Kint (Spacey) and the officer, David Kujan (Palminteri). The brilliance in the delivery of Kint's story to Kujan lies in its parallel placing with the scenes revolving around the rounding up of the criminals which culminates in that famous line up shot; the developing of their friendship/hatred; the jobs that they do for a mysterious figure known as Redfoot (Greene) and the situation they all find themselves in once crime king Keyser Söze (can't put actor's name in brackets) catches up with them.\n\nIf we look at how the criminals consisting of McManus (Baldwin); Keaton (Byrne); Fenster (del Toro); Hockney (Pollak) and Kint are rounded up in the first place, we can see that out of all the arrests Keaton's is given the most dramatic and most coveted. When he is arrested, he is in an expensive restaurant indulging in a rich conversation as opposed to the others whom are crudely rounded up on street corners and in garages. From here Keaton is made to look, perhaps not the most criminal, but certainly the most intelligent of the band but the rest of them are petty criminals or in Kint's case, crippled. This immediately places a higher opinion on Keaton in our minds and already, the film is attempting to brainwash us with its 'who's who'. The extensive dialogue later on constantly keeping Keaton in the dark as to who he could really be helps maintain this doubt as does his scrachy background and his failure to get a business empire off the ground.\n\nThen there is the manipulation of the supporting characters. I mentioned Redfoot being mysterious, something the film establishes with eerie music as his car rolls up to the gang. They meet amongst some odd looking Japanese mise-en-scene definitely un-associated with the location they're currently in: Los Angles, further adding to the bizarre and somewhat surreal nature of both the scene and the film. But there are several incidences where what you think was right, indeed wasn't and as the film develops things become increasingly dramatic culminating in a scene involving a notice board that still chills me even after so many viewings. Quite simply; The Usual Suspects is a smart and engaging film, the likes of which can be revisited time and time again."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "andrewchristianjr",
        "review_rating": "7",
        "review_title": "PREDICTABLE ENDING.",
        "review_detailed_main": "Good ending but I think its predictable. Overall a good film. Great acting by Spacey."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "GeorgeBailey",
        "review_rating": "4",
        "review_title": "If anything can happen, who cares what happens?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "angelgrlsixx",
        "review_rating": "10",
        "review_title": "All time Favorite",
        "review_detailed_main": "Favorite movie, and best movie ever in my opinion!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "leftwichzachary",
        "review_rating": "10",
        "review_title": "As an avid cinephile,",
        "review_detailed_main": "Who watches a lot of films to help me to be distracted from the pressures of everyday life, old and new and of all genres (have never had a bias against any genre and never love older films and dismiss new films, or vice versa), 'The Usual Suspects' was one of the finest films personally seen in a while.\n\nOther films to have that effect on me (and garnered 10/10 ratings, a rare rating for me these days) are 'LA Confidential', 'Amores Perros', Orson Welles' version of 'The Trial', 'City of God' and 'The Song of Bernadette', though some films came close as well as re-watches of favourites like 'Se7en', 'Much Ado About Nothing' (1993) and 'The Remains of the Day'.\n\nSimply put, 'The Usual Suspects' is a magnificent film all round that deserves to be re-watched over and over again, one of the few films seen recently to not find any fault with it. Fully deserving of its reputation as one of the best modern, and perhaps overall, films ever made. Not everybody is going to disagree and that is fine.\n\n'The Usual Suspects' is slickly and audaciously made, filmed with a lot of style and is atmospherically directed. It is also hauntingly scored. It is intricately and intelligently written by Christopher McQuarrie, some of the best screen-writing he ever did. It is beautifully and deftly directed by Bryan Singer. If remembered correctly, neither McQuarrie or Singer were well known at the time and it was 'The Usual Suspects' that put them on the map.\n\nFilm is famous for the iconic line-up scene, the noticeboard that haunts everybody forever and its killer twist, one for the ages and not one to forget in the long one. Twists have wildly varied in film, there are some ingenious ones but also some naff ones, 'The Usual Suspects' is one of the ingenious ones. 'The Usual Suspects' as said before doesn't just have its twist going for it. The flashback-packed story is similarly intricate and never feels muddled or convoluted.\n\nIt has some of the finest ensemble acting there has ever been. This is especially true for a mesmerising Kevin Spacey in one of the most deserved Oscar Wins that year. Spacey is just one of the all round brilliant performances. Pete Postelthwaite, an always dependable actor who is still very much missed, is suitably mysterious, and Dan Hedaya and Chazz Palminteri make their mark as the confused cops. Steven Baldwin doesn't have a particularly challenging role but has never been better, Gabriel Byrne is also solid.\n\nOverall, magnificent film in every sense. Recommended with no hesitation."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "vladconeschi",
        "review_rating": "10",
        "review_title": "Great suspense...",
        "review_detailed_main": "What a great movie to watch alone. In my opinion, I would watch it several times just to pay more attention to every facial expression of the character. It is a great movie, that requires digesting it a little, but i must call it a must-watch."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Gabriel_Kuntze",
        "review_rating": "9",
        "review_title": "What can I say about this movie that hasn't been said already?",
        "review_detailed_main": "What can I say about this movie that hasn't been said already? It's an absolute classic, even when, after repeated viewings, I realize more and more that it's nothing but a one-trick pony. Still, it's strangely compelling, and I'm always waiting for that ending to come again. For some reason, I feel it different every time, as if I keep finding clues that I missed in my last watch.\n\nKevin Spacey is great on this one, you end up feeling sorry for the guy at some point. The rest of the characters make a beautiful team, and I wish we had a little more banter between them. Especially by the Benicio del Toro character, who's totally nuts.\n\nThe movie looks great, especially considering its budget. The actions scenes are nicely done, it has awesome shots of the sun above the river and the city, disturbing flashbacks scenes, and cool dialog. The duration is perfect, it doesn't go overboard.\n\nA must see!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "rozaliaszopa",
        "review_rating": "9",
        "review_title": "Great criminal",
        "review_detailed_main": "When I first watched this movie, it seemed a bit confusing to me, which did not diminish my delight. In my opinion, it should be watched at least twice to appreciate the incredible plot presented and the involvement of all the characters.\n\nWe learn the stories in the form of a retrospective, from the mouth of one of the criminals, and although we know the end of their action, we still feel the excitement during the preparations.\n\nA great design, rightly appreciated by the Academy, which awarded an Oscar for the screenplay. Kevin is brilliant, but Gabriel Byrne partners him well.\n\nI can recommend this film to everyone!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "nakeane09",
        "review_rating": "9",
        "review_title": "yea, this movie sucked",
        "review_detailed_main": "this movie is umm, queer. completely overated and boring. wanna watch a real crime movie, watch pulp fiction. 10000x better. And what else, its boring. -1/10 ... yes, its really that bad"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ajdagreat",
        "review_rating": "",
        "review_title": "a mixed review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "tinyfordst",
        "review_rating": "6",
        "review_title": "Extremely predictable",
        "review_detailed_main": "I saw this movie for the first time in 2020 after my friends pestered me for years to watch it because it \"is so great\". The acting was good, the directing was fine, but the storyline was so predictable I couldn't manage to watch all of it beyond the first hour. After they kept beating around the bush and I got frustrated by them trying to keep the audience uninformed while at the same time trying to give you clues to solve the \"mystery\" wrong. I forwarded to the end and it panned out EXACTLY as I expected withing the first half hour of the movie.\n\nIf you didn't see the plot twist coming perhaps you weren't paying attention or really just aren't smart. But for this film to enjoy the status it does as one of the bests is a disgrace for me."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "homer34",
        "review_rating": "8",
        "review_title": "Ok",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Scurfield",
        "review_rating": "7",
        "review_title": "The plot has more holes in it than Bonnie and Clyde's death car.",
        "review_detailed_main": "Based on the high IMDB user rating, I rented The Usual Suspects and looked forward to enjoying an intelligent and entertaining movie. Unfortunately I found the film to be grossly over-rated. I attribute the failings of this movie equally to both the director and writer. The direction was slow and even confusing at times. The dialogue was solid, but the story was completely unbelievable and, upon reflection, the plot has more holes in it than Bonnie and Clyde's death car. No blame to the excellent cast of actors, but next time I plan to watch such a highly IMDB rated film, I'll try to keep my expectations grounded."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "rjkardo",
        "review_rating": "1",
        "review_title": "Why bother with a plot?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "utzbfn",
        "review_rating": "10",
        "review_title": "AN ALL-TIME BEST",
        "review_detailed_main": "This is one of my favorite movies. The acting is top-notch. The cast alone is a tip-off it's something special, featuring Spacey, Benicio del Toro, Gabriel Byrne and Chaz Palminteri. Even Stephen Baldwin turns in what might be his best ever performance. Then there are a number of perfectly cast character actors throughout.\n\nThe plot manages to remain gripping and grounded throughout, even with a series of unforeseeable twists and backstories that border on the realm of fantasy.\n\nIf you haven't yet seen this, I'm jealous! If you have seen it, in my own experience, it's just as enjoyable the second time.\n\nIn fact. I believe most people - like me, will want to watch it again. It was during my second viewing that I looked for and identified the subtle cues that are in there that point to the solution of the puzzle. Enjoy!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Blumanowar",
        "review_rating": "9",
        "review_title": "It's better every time I watch it",
        "review_detailed_main": "It's better every time I watch it I haven't watched 50 movies twice in my life and I watch a ton... but I've seen this at least 5x. It's such a great flick, great plot and story and a great cast. It's a real mind f-:) If you've not seen it, don't let the fact it's 27 yrs old stop you.. it's timeless."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "jonathancruano",
        "review_rating": "9",
        "review_title": "The Usual Suspects: A Conman's Tale",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "mooconnor-79099",
        "review_rating": "10",
        "review_title": "1million review 24K not good",
        "review_detailed_main": "How can you no tlike this movie?? Its amazing in every way! All star cast, amazing writing, twists and turns, and 24,000 people gave it less than a 5/10?\n\nJust goes to show that no matter what, there are always some that gotta be too cool..."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "tomgillespie2002",
        "review_rating": "8",
        "review_title": "Riveting stuff, even after its umpteenth viewing",
        "review_detailed_main": "Thanks mainly to Quentin Tarantino's Reservoir Dogs (1992), the 1990's saw the re-emergence of crime noir - talky, violent thrillers packed with colourful characters and even more colourful language. Bryan Singer's The Usual Suspects was one of the best of the bunch, thanks mainly to the director taking influence from past masters such as Hitchcock, Lang and Kurosawa, rather than the many Tarantino copycats that flooded the 90's cinema market, who did little but poorly imitate the big-chinned one's chatty screenplays and outlandish, darkly humorous violence. It also had a killer twist; one that will baffle as much as it will surprise, or possibly induce cries of cheap manipulation.\n\nAfter what appears to be a heist gone wrong on an exploded boat, the only surviving witness, Verbal Kint (Kevin Spacey), a disabled con-man, is brought in to be interrogated by customer officer Dave Kujan (Chazz Palminteri). Having already been acquitted by some mysterious higher powers, Kint is probed by Kujan for more information. He tells a story of five criminals who meets in a line-up - Dean Keaton (Gabriel Byrne), a steely criminal gone straight, Michael McManus (Stephen Baldwin), an entry man with a short fuse, Todd Hockney (Kevin Pollak), a hijacker, Fred Fenster (Benicio Del Toro), McManus's partner, and Kint himself. Having being picked up one time too many, the group hatch a plot to pay the crooked cops back, and eventually start taking jobs from the shady Redfoot (Peter Greene).\n\nWhile the build-up to the explosion seen at the beginning of the film is relatively formulaic in its execution, Singer and screenwriter Christopher McQuarrie (who won an Oscar for his efforts) inject enough humour into the script to bring these characters alive, and bring them over to your side. The clever thing is that it soon becomes apparent that everything were seeing either isn't true or isn't at all relevant, and it's the increasingly looming presence of the mysterious and infamous criminal mastermind Keyser Soze, who may in fact hold all the cards. The twist is not particularly clever at all, and isn't that hard to guess, but the director's skill in capturing it is what makes it so memorable.\n\nThe now-iconic poster wouldn't be so iconic if the characters hadn't been so memorably played by it's cast. With the exception of Kint, the characters are little but stock characters, but there is genuine chemistry, especially in the line-up scene where they crack up after Baldwin's over-the-top delivery of a line. Byrne proves again that he is much more deserving than the mediocre roles he tends to land, and Spacey bagged a Supporting Actor Oscar for his puppy-dog con-man. It's far, far from deserving of its place as #23 on IMDb's top films of all time, but The Usual Suspects is riveting stuff, even after it's umpteenth viewing.\n\nwww.the-wrath-of-blog.blogspot.com"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Exeron",
        "review_rating": "9",
        "review_title": "Perfect!!",
        "review_detailed_main": "First when i heard about the movie i didn't expect much about it, a thriller that luckily was at the top 250 #20. But of course a movie doesn't just pop up to #20 for luck right? Although there are some movies that doesn't deserve to be on the top 250, like American gangster...\n\nAnyway more to the movie, the first 10 seconds of watching i was already excited, the music was perfect which kept me busy. And then when the movie was over i was like \"Wow...this is perfect\" And it is really. This is the ultimate thriller, i know understand why it's on #20. The characters were very well prepared so the actors had really easy to go into them. I thought the most well played actor was Benicio Del Toro, he played \"Fenster\" and he did it really good, so my hat goes off for him.\n\nAnyway the movie was as i said perfect, which it why i gave it a 10/10 which doesn't happen to often. The movie was so clever that in the end of the movie you'll go \"Oh..how come i didn't notice that?!\" I'm not going to reveal anything of the plot, that's up to you to see but i will give you this hint: \"Keep your eyes open\" The usual suspects 10/10 \"Brilliant,perfect,clever, this movie will never die\""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Clive-Silas",
        "review_rating": "",
        "review_title": "Flawed, but fascinating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Quinoa1984",
        "review_rating": "6",
        "review_title": "Good film, but over-rated from my perspective",
        "review_detailed_main": "Bryan Singer's The Usual Suspects is a clever (if not too clever) film that showcases some good actors in a better than average cops and robbers movie. Unfortunately, Singer brings some flaws (not immense, after all, how would Christopher McQuarie win a Oscar for his screenplay is the film's flaws weren't immense). That includes a ending twist that negates the whole film.\n\nStill, there are many good things in this film, including fine performances from Stephen Baldwin (surprisingly so), Benicio Del-Torro, Gabriel Byrne, Chazz Palmienteri, and Kevin Spacey (his first Oscar he earned for). Not bad Overall. B+"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "mike6479",
        "review_rating": "7",
        "review_title": "Overrated",
        "review_detailed_main": "C'mon, one of the top twenty movies of all time? give me a break. Not quite as overrated a Boondock Saints though, you nerds. I need ten lines of stuff to say, so I'm going to continue. Steven Baldwin is a douche in this and every other movie he's ever been in. Yeah, this is a good movie, but I don't see how it separates itself so distinctly from every other movie like it. Don't say there aren't movies like it because there are every year and there were every year before it for the previous 20 years. By the way, Kevin Pollack is a hack comedian who has relied on three impressions to make a career. It seems I'm of that generation that thinks every decent movie of the 1990's is an all time great, but I really think time will show that there are many, many better movies than this."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Qui-Gon-14",
        "review_rating": "1",
        "review_title": "?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "windyy_beggor",
        "review_rating": "10",
        "review_title": "One of the best films of all time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "motrous",
        "review_rating": "10",
        "review_title": "The Usual Suspects",
        "review_detailed_main": "Just watch it.\n\nThat was going to be my review but IMDb won't allow one that short. It's a great cast, great plot, great dialog, great mystery, great reveal, great everything. If there were a definitive list of movies you have to see, this would be near the top."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "dkashe",
        "review_rating": "10",
        "review_title": "Unbelievably good movie",
        "review_detailed_main": "It's a perfect movie. Plot, acting, visuals, story, irony, humor. It's a 10, no question about it. The actors are perfect. Do NOT miss this movie."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "tomozlee",
        "review_rating": "10",
        "review_title": "I thought I knew film until this one film....",
        "review_detailed_main": "I was recommended this film due to Kevin spacey's excellent performance in American beauty and once again he blew me away. The first 20 mins of this film I would say is getting to know the characters after that the film really takes you on a journey and it is ridiculously good. This is one of them films where the first time you watch it you'll be amazed and you'll be jealous of anyone who sitting down to watch it for the first time. It is in my opinion the best ending to any movie I have ever seen and would highly recommend The usual suspects for its perfect cast and brilliant script."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "jardinalli",
        "review_rating": "9",
        "review_title": "A Dynamic Script",
        "review_detailed_main": "From a directing perspective, The Usual Suspects is a flawless masterpiece with immaculate script writing and a rare show of top notch ensemble cast acting. Benecio Del Toro makes genius choices, Kevin Spacey was brilliant and I believe was handed the greatest of opportunities with such a will scripted role.\n\nThis movie really put Kevin Spacey on the map, but everyone in the ensemble cast is outstanding. Stephen Baldwin, Gabriel Byrne, Benicio, Spacey....the list of appearances goes on and on and only sets the bar higher far any movie with a comparable storyline and cast.\n\nChristopher McQuarrie's inspirationally written script, is one of the finest of the the cinema era. The Oscar was well deserved for this piece of work, unlike many politically nominated and won Oscars. This was acknowledged because the work lived up to the praise."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "PennyLane90",
        "review_rating": "10",
        "review_title": "I have no words for how good this movie is",
        "review_detailed_main": "No really, I have no words. I watched this for the first time a couple of weeks ago and I stayed glue until the last second...which by the way is crucial in this movie. Even writing this now I don't even know where to begin about how much I loved it. It was just such a good story with, as far as my standards go, the best plot twist I have seen so far in film. I don't think anyone could have played Verbal better than Kevin Spacey, he just dominates this film to the point that at the end I actually clapped for him...and I was watching this home alone at 2am. There was no performance left half-assed, everything just fell into place. Watch it...just please watch it."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "GodIsObamaObamaIsGod",
        "review_rating": "",
        "review_title": "a masterpiece in the modern day",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "mmkg_28",
        "review_rating": "6",
        "review_title": "Not as great...",
        "review_detailed_main": "I watched this movie because of all of the raving reviews I had heard of it (including some from this site). However, I was disappointed. The story is a bit of a roundabout--drawn out, not as interesting as made to seem. I had assumed this would be Snatch-like, or would contain more action/clever quips or at least a more captivating plot. This was not so...the film had its moments, but without giving anything away, it was all too fantastic (the villain).\n\nThe acting is pretty well done, Kevin Spacey was convincing (like always) and the other supporting cast members were also good. So, the production of the movie was good, the actual movie, not so good."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Fever",
        "review_rating": "10",
        "review_title": "One of my favorites",
        "review_detailed_main": "This has to be one of my favorite movies around. The acting is superb, it's well filmed, and there's actually a plot...and a very thick one at that. This film keeps you guessing until the end. And once you reach the end, you'll never believe who the \"bad guy\" was. I highly recommend this movie."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "KidHorn",
        "review_rating": "7",
        "review_title": "Good, but not great.",
        "review_detailed_main": "I thought it was a good move, but not a great movie. The surprise ending wasn't a surprise to me. I suspected it all along. I guess that's the main reason I didn't view this as one of the greatest movies ever made. I gave it 7 stars.\n\nI honestly don't see why many view this as a classic. I think it was worth watching, but I have no inclination to see it again. I guess if you were taken by surprise by the ending and you're a big fan of mobster or mobster like movies this would make this a great movie, but I don't fall into this category. Maybe many of you like Kevin Spacey more than I do. I think the Godfather I and II were much better."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ep.com",
        "review_rating": "1",
        "review_title": "Must... like... movie... (spoilers, but who cares, the movie sucks...)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "skuttwest",
        "review_rating": "8",
        "review_title": "Quite overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Tulsa90",
        "review_rating": "8",
        "review_title": "Good, But Definitely Very Overrated By IMDB Voters",
        "review_detailed_main": "There is no doubt that this is an entertaining movie with a very good and well-disguised plot twist at the end. Apparently, voting IMDB users are so enthralled by the last 2 minutes of this film and the presentation of the plot twist, that this movie ranks 17th all-time and ahead of many classic films from the last 75 years. The IMDB Top 250 is an interesting list to study. Lots of great movies are in that list, and more than a few overrated and perplexing selections too. And 'The Usual Suspects' certainly jumps out as one movie that gets more credit than it deserves, though it is a good movie."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "blanche-2",
        "review_rating": "10",
        "review_title": "The greatest trick the devil ever pulled...",
        "review_detailed_main": "1995's beautifully structured \"The Usual Suspects\" is really a very simple story. One of only two survivors of a ship explosion (Kevin Spacey) tells a story to the police detective (Chazz Palminteri) in charge of the case about how five career criminals - the \"usual suspects\" - met in a lineup and wound up working for the man whose very name strikes terror into the hearts of men - Keyser Soze.\n\nAs a result, two names were on everybody's lips for some months to come: Kevin Spacey and Keyser Soze.\n\nWith a crackerjack script by Christopher Quarrie, great direction by Bryan Singer and terrific performances, The Usual Suspects couldn't miss. And it doesn't. Thirteen years later, I remember it as vividly as the day I saw it. I just saw it again, and it's as good as ever.\n\nIts other stars are the handsome Gabriel Byrne as Keaton, a bad cop who at one point faked his death to avoid criminal charges; and Stephen Baldwin, Benicio del Toro, still a distance from stardom, Kevin Pollak, and Giancarlo Esposito as Kobayashi, Keyser Soze's persuasive assistant.\n\nAs a scared, not very bright gimpy man, Kevin Spacey is a knockout and well-deserving of his Oscar, his Golden Globe, his SAG Award, his New York Film Critics Award and all his other honors. The writer, Christopher McQuarrie, justly won the Oscar and several other awards. The film and director Singer probably deserved more awards than they received, but it doesn't matter. The Usual Suspects is a modern classic.\n\nThe greatest trick the devil ever played was convincing the world he didn't exist...and then he's gone."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "planktonrules",
        "review_rating": "8",
        "review_title": "Well made...it just isn't the sort of film I particularly enjoy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "lee_eisenberg",
        "review_rating": "10",
        "review_title": "The greatest trick the Devil ever played...",
        "review_detailed_main": "\"The Usual Suspects\" made Kevin Spacey a household name, and rightfully so. One of the cleverest movies ever made, the ending is more than a shocker. The plot of course involves customs agent Dave Kujan (Chazz Palminteri) interrogating hoodlum Roger \"Verbal\" Kint (Kevin Spacey) to try and find out what happened at a crime scene earlier. But this is no ordinary interrogation; what we find out here may be the end of normalcy as we know it. And I don't just mean what we find out about Keyser Soze (whether early on or at the end); this movie has more twists and turns than Lombard St. With perfect performances from Spacey and Palminteri - and from Gabriel Byrne, Stephen Baldwin, Kevin Pollak, Benicio Del Toro, Pete Postlethwaite and Dan Hedaya - this is one movie that you can't afford to miss.\n\nEvery time when I'm talking about this movie with someone, I start...well, doing what we find out about at the movie's end. You'll know it when you see it."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "yellowmarlin",
        "review_rating": "10",
        "review_title": "Unsurpassed",
        "review_detailed_main": "This movie is as close to perfection as any movie is ever likely to come. Even knowing the twist ending, it's still a master class in storytelling."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "bobzombie001",
        "review_rating": "",
        "review_title": "Good cast but predictable ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "cvogelaar",
        "review_rating": "7",
        "review_title": "B-movie with one of the greatest twists ever and one standout actor",
        "review_detailed_main": "One of the all-time overrated movies for sure. It's a B-movie with an amazing twist ending and one standout actor, Kevin Spacey. You should watch it if you haven't, but only because of the unforgettable ending. This should be a lesson to all writers of how important the ending to your story is. Even if the rest of the movie is mediocre, if the ending is great you could win an oscar."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "p-99503",
        "review_rating": "9",
        "review_title": "The god of crime films",
        "review_detailed_main": "Anything but usual, Singer's movie is pretty damn near untouchable. Next to this, most other crime films feel petty."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "thetyvonlesure",
        "review_rating": "7",
        "review_title": "A Convoluted Crime with a Great Escape",
        "review_detailed_main": "The Usual Suspects is a 1995 Crime-Thriller directed by Bryan Singer. The film stars Kevin Spacey, Benicio Del Toro, Stephen Baldwin, Gabriel Byrne, and Kevin Pollak as the film's group of hardened criminals. The film follows Kevin Spacey's character, Roger \"Verbal\" Knit as he narrates a series of crimes to the Police to find the truth of a high scale massacre.\n\nThe acting in the film is hit or miss. For the most part, the main cast does a great job in the portrayal of their characters. Kevin Spacey's portrayal of Verbal is well done. Verbal has a physical disability and is considered to be stupid. Spacey displays a convincing lack of mobility in the film. Simultaneously, Spacey's body language is believably timid and mild manner. Moreover, Benicio Del Toro's portrayal of Fred Fenster was fantastic. Del Toro engrains Fenster with a thick accent that lends a realistic and natural spirit to the character. Gabriel Byrne plays Dean Keaton, serving as the assumed leader of the criminals. Byrne's portrayal of Keaton grants the film levity and a cooler head. Byrne's facial expressions are really well done. Keaton is a character tormented by his past. Despite being haunted, Keaton serves as the straight man, driven by love as opposed to gain. Chazz Palminteri acts as Officer, Dave Kujan. Palminteri does a great job showcasing intensity and grit when needed. He drives the film by answering the questions when needed. Despite moments of great acting, the dialogue suffers from poor writing and delivery in some aspects.\n\nSome characters are one-dimensional. Certain actors deliver their lines with too much force and intensity. Verbal has the best dialogue in the film. \"The greatest trick that the devil ever pulled was making people believe he didn't exist,\" is an incredible line. The police officers in the film are also afforded some great lines, and engaging moments of discourse. At times, anger throughout the film feels unnecessary. In terms of being written, specific characters are very dumb, whereas others are brilliant. The aggression in the film is heavy handed at moments, diluting the story's progression. Up until the conclusion, the story is convoluted and predictable. The time jumps and flashbacks are placed poorly at moments. The story could've benefited from more \"present day\" moments, rather than flashbacks. On the other hand, the ending makes up for a lot of these issues by being so impactful. The convolution of the story is a testament to who is truly narrating it.\n\nThe cinematography is decent for its time. Mostly, there's no unique style to be had in the cinematography. The camera work is atypical for an action film in the 90s. The best shot moments in the film come from the conclusion. The action in this film is decent. The audio mixing is bright toward the end of the film. However, the soundtrack is very bland, making the film feel like a direct to TV movie, as opposed to a theatrical release.\n\nOverall, The Usual Suspects is confusing at first, but recoups with an iconic and memorable ending. The Usual Suspects is a good crime-thriller driven by great acting."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "chet19",
        "review_rating": "1",
        "review_title": "Most Overrated film of all time",
        "review_detailed_main": "The Usual Suspects is one of those movies that you expect to be good because all your fiends say it's good. People are afraid to say how lousy this is, because their friends will get on them. But I will say it. #1, Stephen Baldwin is in it...so how good can it be? #2 Kevin Spacey is a criminal. He lies to the police and makes up a story to cover his own butt. The cops have busted him, and instead of confessing, he makes up a lie about the Kaiser. This movie is considered original? A criminal lies to the police?? THAT is so original? It happens every single day, people!!! I can't believe so many people like this movie. It's about a crook who lies to the cops...like there's something original or shocking about that. Think about it. Do you really like this movie because of Stephen Baldwin and a man telling a lie, or do you like it because you know you're supposed to like it..."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "F20Maverick",
        "review_rating": "10",
        "review_title": "Best Movie of All Time - Must See",
        "review_detailed_main": "If you haven't seen this movie already, put it on right now and watch it!! You must see this movie at least twice. The first time I watched this movie, immediately after it ended I immediately watched it again. Awesome piece of art!!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "gunit-87710",
        "review_rating": "8",
        "review_title": "Great movie the first time you watch it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "MaxBorg89",
        "review_rating": "10",
        "review_title": "The best thriller of the '90s",
        "review_detailed_main": "The first and best reason to remember The Usual Suspects is one single line, spoken by low-level crook Verbal Kint (Kevin Spacey): \"The greatest trick the Devil ever pulled was convincing the world he didn't exist\". The cult phrase refers to Keyser Soze, a legendary criminal mastermind who, while unseen (or not, depending on the point of view), dominates the events of Bryan Singer's small yet massive masterpiece, the most accomplished entry in the thriller genre made during the '90s.\n\nChristopher McQuarrie's complex, intelligent and Oscar-winning script (lots of flashbacks in this one) kicks off with the final stage of a massacre, culminating in the execution of a certain Dean Keaton (Gabriel Byrne) and the explosion of the boat on which 27 people were brutally murdered. The sole survivor, the aforementioned Verbal, tells Detective Dave Kujan (Chazz Palminteri) how it all started: six weeks earlier, someone stole a truck, and five \"usual suspects\" were lined up and arrested. These included Verbal and Keaton, plus the arrogant Todd Hockney (Kevin Pollak), the dim-witted McManus (Stephen Baldwin) and the latter's lover, the hard-to-understand Fenster (Benicio Del Toro, who apparently really had problems when it came to making his lines intelligible).\n\nNow, as Keaton pointed out then and Verbal points out now, the usual strategy is putting one real criminal alongside four random buffoons who practically participate in line-ups for a living. Why were those five sharing a cell, then? The answer pops up after their release: the five suspects are contacted by a sinister attorney who goes by the name Kobayashi (Pete Postlethwaite) and told that they have to fulfil an assignment for Keyser Soze, otherwise they will all die. As the story proceeds, the incredulous police come to realize they're not dealing with the usual crime, or the usual perpetrators for that matter.\n\nThe film is clearly an independent production (all scenes were filmed in a limited number of locations, mostly indoors, and the director himself famously appeared in front of the camera in some of the close-ups), but it certainly thinks big, like most smaller films from the late '80s and early '90s. The title is of course an explicit homage to Casablanca, one of Singer's favorite movies, and the intricate plotting is blockbuster-worthy (if only most blockbusters were written this well). What it lacks in size it makes up for in mood and tension, both of which are provided largely through John Ottman's editing and music.\n\nThe other key attraction, sort of inevitably with such a cast, is the acting: Del Toro's performance promised a very bright future (and Traffic and 21 Grams have done nothing to prove him wrong), Byrne, Baldwin and Pollak delivered the last truly memorable silver-screen work of their careers (not that Baldwin had that much to speak of in the first place), and in the crippled, verbose Kint Spacey found the perfect role to impose himself as one of the fundamental screen presences of our time. And that's without mentioning the elusive figure of Keyser Soze: whether he's physically portrayed by someone or not, he is rightfully remembered as one of the most enduring cinema villains ever created. Not bad for a guy who hardly has any screen-time at all (or does he?).\n\nAlongside The Silence of the Lambs and Se7en, The Usual Suspects qualifies as the most intelligent and enjoyable thriller of the '90s. The extra points it scores are all due to the particular nature of its \"central\" villain: even more than Hannibal Lecter, Keyser Soze and his tricks won't leave your mind very easily."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "predragdilic",
        "review_rating": "9",
        "review_title": "A gem worth rewatching",
        "review_detailed_main": "I saw it first when I was a kid and was fascinated by it. After watching it the second time, it is still as good."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "james_norman1981",
        "review_rating": "10",
        "review_title": "Genius thriller with career best performances from most concerned",
        "review_detailed_main": "A lot can be said about the Usual Suspects that makes you wonder just what kind of film it is: epic twists, killer dialogue, excellent performances, hardcore action and much more. All of these beg the modern question... who did the director steal his best ideas from? Well that's just it. Although Suspects does owe a debt of gratitude to many films, Casablanca being one example, it was made a long time before the recent crop of films created by directors nicking their best ideas of other people.\n\nThis is no Tarantino-esquire film because it was made before he hit the full heights of his popularity. It has no Shyamalan style twist because old M. Night probably got the idea from Suspects. In short, this was the film that provided the catalyst for an awful lot of what we now regard as standard in our noirish, modern films.\n\nFor anyone who has yet to see this movie any talk of the plot would spoil the surprise, not just the one at the end but the genuine thrill of seeing every actor involved create an ensemble piece of such exquisite pace, tension and thrill. Whether it's Benicio Del Toro's bizarre Fenster, Kevin Pollack's bitter-sweet Hockney or even Stephen Baldwin's characteristic McManus, this film has a bunch of actors doing perhaps their best work to date, even beyond the five in the line up.\n\nThere are a few minor quibbles. Continuity provides a problem in places as does the explanations for some characters' motives. The film jumps around different time-lines fairly unpredictably and you can be forgiven for wondering whether the whole thing is just a big shaggy dog story. On the other hand, as twisty turny thrillers go this one can't be beat.\n\nIf you have yet to do so buy, not see or rent but buy, this film, watch it all the way through with no one (as they'll be hopping up and down on their seat desperately trying to explain the clever bits and pieces that Singer and co have strewn throughout) and enjoy one of the best examples of modern film making. You must be warned though, when I saw it for the first time I had to start it again right from the beginning just to get to grips with the ending!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Matthew-Crowley",
        "review_rating": "10",
        "review_title": "A tremendously woven plot",
        "review_detailed_main": "As film is a medium for telling stories, this film has the finest story translated to the medium of film. The film appears to be a nicely put together heist movie. Everything about it is strong and well produced. However, the twist ending is what makes what came before so impressive.\n\nThe cast is great and the dialogue is delivered with a sharpness that rarely seen in todays films. This is a film solely about the interaction of a small group of characters and wastes no time on superfluous information.\n\nWatch it at least three times. I assure you there will be parts you missed in your first viewing. Enjoy being metaphorically slapped around your twice by a phenomenal finale."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "shaheenabdu",
        "review_rating": "6",
        "review_title": "over rated movie........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "marmar-69780",
        "review_rating": "10",
        "review_title": "The Usual Suspects",
        "review_detailed_main": "The usual suspects is in one word a great film and that isnt only that,it is also one of best crime thrillers i ever saw and one of most iconic 90s films,lets start with cast,everyone in this movie was great,Bryne,del Toro,Spacey.Baldwin were great and every character was so unique and interesting like it felt like they need to have a spin off based on them,storytelling was also brilliantly made and it keeped my focus during entire runtime,direction was very powerful also and Singer for me give his best job here,he was also good in x men films,but this one was something else,now lets talk about that famous plot twist,im not gonna lie when i say that twist is one of best that i ever saw,it actually send chills down to my spine when all was reaveled ,usual suspects is for sure one of best crime thrillers out there and it deserves its place in a history"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "jb-448",
        "review_rating": "7",
        "review_title": "Oh My God",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "subgold",
        "review_rating": "1",
        "review_title": "Don't take two hours out of your life and waste on this total screw-up",
        "review_detailed_main": "Before I watched the movie, I've read many comments comparing \"The Usual Suspects\" with \"L.A. Confidential\", which concluded that this one is even better. So I held an eminent anticipation on it. But two hours later, I just could not understand why this nonsense got so much higher votes and evaluation than \"L.A. Confidential\".\n\nI'm saying this, not because of the labels people usually will put on this movie: confusing, twisted and so on. Actually, I don't think the plot is hard to comprehend. To be honest, I figured out who Kaiser is just at the very beginning. It was so obvious.\n\nThe reason is, many fabulous elements in \"L.A. Confidential\", or should I say, a successful movie, are missing. First of all, the most important thing: the vivid sculpture of the characters. From \"L.A. Confidential\", we remember the three young cops, the evil captain, the gorgeous hooker, the sly and sneaky little old news reporter\u0085 So many impressive roles there. But what is in \"The Usual Suspects\"? I feel sorry to say, nothing. Maybe Kevin Spacey's performance can be a little compensation, but not enough at all.\n\nSecond of all, the conflict. In \"L.A. Confidential\", conflicts are everywhere, between justice and crime, between righteousness and personal career, between love and cheat, between different parts or even in the deep soul of one part. While in \"The Usual Suspects\", without these conflicts, the movie is not dramatic and attractive but cadaverous and boring.\n\nThe third one, ambiance. In \"L.A. Confidential\", I can sense the emotion the director planed to deliver to us. Sometimes intensive, sometimes thrilling, sometimes dangerous, sometimes love-filling, sometimes nervous, sometimes horrifying\u0085.Well, when I watched this one, I almost fell asleep in the middle.\n\nI don't think we need a fourth reason to prove this crap. I hate these plays which consider themselves intelligent and tricky enough to make up some mendacious tales to bluff the audience, and turn out to be so stupid and fake. There is always a wire-puller in such movies, who seems to be omnipotent and can do whatever he wants, conniving some brilliant schemes. But finally these schemes are always deliberately mystifying and illogical. I prefer real and organized films like \"L.A. Confidential\". You know, we audience are also smart."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Loose-Cannon",
        "review_rating": "10",
        "review_title": "Seeing is believing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "yesjozee",
        "review_rating": "10",
        "review_title": "One of the top 10 best of the 90's",
        "review_detailed_main": "Say what you will about this low-budget Oscar winning hit-but if you were lucky enough to catch it initially on the big-screen then you know what I mean. It opens up with the tail end of a massacre on boat just before being lit up to flames. We then end up in interrogation room with Verbal Kint (played by Kevin Spacey) telling the cops how he ended up on the boat. At this point the movie seems to pick up the events (mostly) in the order they happened until those crucial moments on the horrific ship. As Verbal goes into detail how him and four other ex-cons were wrongfully detained for questioning 6 weeks earlier and ended up working together 'taking jobs.' There's Keeton (Gabriel Byrne) who is looking for way out and go straight, Finster (Benicio Del Toro who really started his career here literally) whose horrible accent brings a lot of laughs but basically pals around his convict hot headed buddy McMannis(Stephen Baldwin). Then there's Hockney(Kevin Pollock)whose comedic input serves the tone well especially since he really plays the angry smart ass of the gang. I really don't want to type too much else cause either A most of you know the story even if you haven't seen it or B you've seen it. What I really wanted to say about this movie is that people who don't like it are people who never really got it or people who have not seen the whole thing from the beginning. Yes I said I love this movie and I'll always defend it. However, the movie holds up the best way in an initial viewing or maybe 4 or 5 times after that."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "yaboy-31726",
        "review_rating": "10",
        "review_title": "All time thriller classic",
        "review_detailed_main": "I've just finished this absolute mystery filled and dramatic thriller, every twist and turn was absolutely insane, I thought I was catching on to the plot and story and at the end it had be flabbergasted. Looking back now it all makes sense and the casting was perfect and all the plot holes were filled to perfection. This has to be one of the greatest movies I have seen in my entire life and the puzzle pieces just fell into line and it was this just explosion of realization that made this 2 and a half hour spectacle worth it. Besides the ending this movie was filled with action and entertainment, if anyone is considering watching this, do so immediately."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "tomlittlewood-69590",
        "review_rating": "10",
        "review_title": "A gripping plot with the most jaw dropping twist",
        "review_detailed_main": "From start to finish I was gripped and it was that movie that would lead me on to watching hundreds upon thousands of movies. Love the camera quality, cinematography, script, plot, music, everything was perfect. It was well casted with actors such as: (the Oscar winning) Benicio del toro, (another Oscar winning) Kevin spacey, a career defining role for stephen Baldwin and Gabriel Byrne, breaking bad's Giancarlo Esposito, bullets over broadway and legend's Chazz palminteri. And every character played their part perfectly. All the small, subtle details added by singer is also what adds to the masterpiece. Overall brilliant movie and well worth a watch."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "sundargtcs",
        "review_rating": "10",
        "review_title": "A movie with unexpected ending",
        "review_detailed_main": "This is one of the such rare movies which keeps you engaged throughout and let you think about what could be the end; but finally will leave you with the impressive + unexpected ending. I have seen this movie more than couple of times just to marvel at the screenplay's utter magic. From the beginning of the movie to the end you just can't say what is going to happen next. Even if you do, it is gonna be another beginning for another twist and turn.\n\nI will give 10/10 for the climax part alone.Such a wonderful climax which makes you to think over it again and again. Talented actors with breathtaking acting. Nice movie to watch out, if you are the fan of magical films."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "rchalloner",
        "review_rating": "10",
        "review_title": "An illusory masterpiece, possibly the greatest thriller of all time.",
        "review_detailed_main": "When I went to see The Usual Suspects I thought I was just going to see another entertaining, but forgetable thriller. How wrong I was! A superb cast, taut, clever plot and brilliant direction and acting made for one of the great movie experiences of my life. A true masterpiece of misdirection. I still shake my head in amazement at how cleverly the movie grips viewers, carrying them through a riveting tale to the ultimate, stunning twist and revelation. I literally did not see that end coming before the last couple of minutes and the way it is all revealed is stunning, like a slap to the face. This is great film making and anyone who has not seen it should do so."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "skullhead739",
        "review_rating": "6",
        "review_title": "Okay start, great ending",
        "review_detailed_main": "This was a weird one for me. Not gonna lie it was pretty slow, weird and boring the first half of the movie. The characters and ending is what really drives this movie home.\n\nActing: Great cast and acting. The whole \"gang\" of guys are hilarious and full of charisma. The jokes and lines they have are a real smile jerker. Kevin spacey did especially wonderful. Overall this was a really strong point of the film.\n\nStory: The story was really weird, slow and boring the first half at least for me anyway. The plot direction and scenes made it hard to follow and dive into. But once you dive into it and get past the first half it becomes really interesting. The characters are great and funny which does help tremendously. The ending is a twist, very iconic and very good.\n\nSummary: I know this is a cult classic and most will probably disagree with my review but this movie isnt perfect. As I've stated this is somewhat boring but does pick up. I would reccomend this if you really want to watch a cult classic and a piece of cinematic history."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "cyphiomegasigma",
        "review_rating": "10",
        "review_title": "The usual suspects..",
        "review_detailed_main": "\"The Usual Suspects\" is a cinematic masterpiece that skillfully weaves a complex narrative, leaving audiences in awe of its brilliance. This neo-noir crime thriller, directed by Bryan Singer, is a rollercoaster of suspense, intrigue, and unexpected twists that keeps viewers on the edge of their seats from start to finish. The ensemble cast, led by Kevin Spacey's unforgettable performance, is nothing short of extraordinary. Spacey's portrayal of the enigmatic Verbal Kint adds layers of depth to the film, and his storytelling becomes the captivating thread that ties the entire narrative together. The chemistry among the cast members is palpable, contributing to the film's overall authenticity. The storytelling is a work of art, with a non-linear structure that keeps the audience guessing until the final moments. The screenplay, penned by Christopher McQuarrie, is a brilliant puzzle where every piece falls into place with precision. The film masterfully plays with perception and reality, keeping viewers engaged and questioning the unfolding events. Cinematographically, \"The Usual Suspects\" is visually striking, with a dark and atmospheric tone that complements the gritty nature of the storyline. The film's use of shadow and light adds to the overall sense of mystery and tension, creating a visually immersive experience. The musical score enhances the film's suspense, perfectly complementing the twists and turns in the plot. The sound design is meticulously crafted, further immersing the audience in the high-stakes world of crime and deception. One of the film's greatest strengths is its ability to deliver a jaw-dropping twist that reshapes the entire narrative. \"The Usual Suspects\" is a cinematic achievement that rewards careful attention and invites repeated viewings to appreciate the intricacies of its storytelling. In conclusion, \"The Usual Suspects\" is a timeless classic that sets the bar high for crime thrillers. With its stellar cast, intricate plot, and expertly crafted storytelling, it remains a benchmark in the genre. This is a film that not only entertains but also challenges the viewer's perception, leaving an indelible mark in the annals of cinematic history."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Ryan_PA_DVD-Head",
        "review_rating": "6",
        "review_title": "A good movie but...",
        "review_detailed_main": "The only reason I give this movie a 6 (and not higher) is because I expected it to be a much better film. I heard and read good things. I was disappointed. The only thing that saved this movie was Kevin Spacey. I don't know who casted Benicio Del Toro but I really don't like that guy in a 'lively' movie. Without Spacey this movie falls short of even touching my emotions or eliciting any response. And the twist? I hate to say it but I'd have to join the small elite bunch who figured it out early on and didn't have much to watch afterwords. I've seen much better twists. This movie is a good first watch, after that it seems like every other action/thriller with a twist ending but not as thrilling or action packed or dramatic or envoking or ..."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "nkozyra",
        "review_rating": "1",
        "review_title": "Shocking and surprising - if you're an idiot",
        "review_detailed_main": "Wow ... I heard so many extraordinary things about The Usual Suspects, that, like so many others, I was lured to the theater by very enthusiastic word-of-mouth. The catch (plot twist, surprise ending) is so painfully obvious through the movie that you simply have endure ridiculous dialogue, mediocre cinematography and drillingly painful stereotypes to find out what you already knew. The only saving grace of this incredibly overrated film is the fine cast of actors, specifically Stephen Baldwin, Byrne and Del Toro. Spacey is so-so and Kevin Pollack is himself, but they are still far more enjoyable than anything else the film offers.\n\nOverrated and excessive. Certain to insult your intelligence. Grade: 65%"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "HotHamlet",
        "review_rating": "10",
        "review_title": "An unforgettable masterpiece of a film.",
        "review_detailed_main": "The Usual Suspects stands as an unparalleled masterpiece in the realm of crime thrillers. The movie will simply amaze you with its brilliantly woven narrative and an amazing cast that delivers exemplary performances.\n\nAt the heart of the movie lies its unforgettable cast of characters. The entire cast all add depth and diversity to the group of criminals. Each character is distinctive and brings a unique dynamic to the narrative, making the interactions between them as captivating as the plot itself. Every actor played their part perfectly and I wouldn't change anyone in any role I do believe. The movie owes much of its success to the incredible cast, whose talents mesh seamlessly to create a gripping and unforgettable cinematic experience. Although I say all this I do not believe it's the best acting from anyone individually. But that's because it's a true testament to the fact that case members can all come together to make the acting far better than it would be individually. By this I mean to say if you take a single actor and separate them the acting may not seem amazing. But the perfect cast was assembled that all together make the movie's characters brilliant. They all complement each other to magnificent effect.\n\nAnother brilliance of the movie is in its storytelling, which takes the audience on a thrilling ride through a labyrinth of deceit. The plot is constructed brilliantly with twists and turns that seamlessly fit together perfectly and don't seem pulled out of thin air adding nothing. All of this culminating in an astonishing revelation that leaves viewers in awe. The movie's ability to keep you speculating and engaged in discussions long after the credits roll is a testament to its intelligent and compelling narrative. Many a film have twists and turns that simply fall flat. So having twists/a twist doesn't necessarily mean a good movie. This is one such case of how it can work very well within a narrative. Utterly brilliant story. I feel the story will leave you both stunned and satisfied. Every piece of the puzzle falls perfectly into place, making it a cinematic experience unlike any other. Not a single moment in this movie bored me and made me want to skip ahead. This movie had me hooked from the first scene to the last. The movie encourages speculation and even if you managed to predict some aspects of the twists, the sheer brilliance of the storytelling and character development ensures that it remains an enthralling journey from start to finish.\n\nI am one such viewer that predicted the plot twist down to its most minuscule details. I predicted the final scene of the film as soon as it's possible to do so. Although this sounds like it's a negative, I had such fun throughout the movie and paused it several times to speak to myself for about 20 minutes on what I believe to be happening. The ending is one that I will always remember until I pass. It is truly one of the great movie endings.\n\nThe soundtrack of the movie must have been brilliant. However I would like to admit I cannot remember it even after only just finishing thee cinematic masterpiece. I was so infatuated with every other part of the story that I didn't even pay attention to the soundtrack. I must assume it's good however as if it wasn't I feel I would be noticeable. Apologies on this front but if I said anything other than this I would be making up stuff to say.\n\nThe runtime was a perfect length and the movie didn't ever feel like it was making itself longer simple to pad for length. Very well done to the director and their team for this.\n\nOverall the movie is a masterpiece that has stood the test of time. Its extraordinary cast, captivating characters, and masterfully crafted narrative make it a true masterpiece in the world of cinema. There is no room for criticism here as every aspect of the film is incredible. If you haven't experienced this cinematic triumph yet, it is a must-watch for any lover of thrillers and storytelling at its finest.\n\n10/10."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "princessoplay",
        "review_rating": "9",
        "review_title": "A 90 Points",
        "review_detailed_main": "\"The Usual Suspects\" is a cinematic masterpiece that keeps viewers on the edge of their seats. The film's intricate plot, led by Kevin Spacey's enigmatic performance as Verbal Kint, unfolds like a mind-bending puzzle. Bryan Singer's direction and Christopher McQuarrie's script create an atmosphere of suspense, cleverly toying with perceptions and expectations. The ensemble cast, including Gabriel Byrne and Chazz Palminteri, delivers stellar performances, adding layers to the film's complex narrative. The iconic twist ending reshapes the entire story, leaving audiences in awe of its brilliance. \"The Usual Suspects\" is a gripping crime thriller that continues to captivate viewers with its storytelling finesse and unexpected twists."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "dajupaco",
        "review_rating": "10",
        "review_title": "Perfectly Simple / Simply perfect",
        "review_detailed_main": "One month ago, I was at work finishing some boring reports. After finishing them, I surfed the web in order to find really good movies I haven't watched yet; more precisely on IMDb, when I checked the IMDb Top 250 list out . I knew most of the movies, at least I've watched the plot, nevertheless this didn't happen with Usual Suspects, I have never watched a trailer or read some synopsis\u0085Nothing. Therefore I rented the movie which from my point of view started kind of slowly. Afterwards, I honestly felt confused about the combination of scenes in different timeline; you need to pay close attention to the unexpected and subtle movements on the storyline. Suspense, tension and psychological terror might be the exact words to describe this masterpiece, tangled story with several important characters whom cannot be ignored, with the masterly performance of Kevin Spacey who totally deserved the Oscar for best actor. You must stay hooked up to the screen because this film has in my opinion the best movie ending of all time. Only thing that sucks about this movie is that you can only watch it for the first time once."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "judemcrobbie",
        "review_rating": "10",
        "review_title": "Proper Belter",
        "review_detailed_main": "Truly one of the funniest non-comedy movies I've seen. Jokes aren't forced either, they come from the characters' personalities rather than injected for cheap laughs. The script is amazing, one of my favourites ever. So quotable. it weaves together so well and there's so much call back, moving in an almost cyclical structure. The dialogue feels authentic and witty, especially how people like that usually would talk. Kevin Spacey has got all the talent in the world, genuinely one of the greatest actors of his generation, possibly of all time. This movie shows that as not once does he break character for not even a shred. He shows every emotion through the course of the movie and portrays that slight angst that something isn't quite right, which ultimately there is. The other actors are top notch as well. Namely Chazz Palminteri (Dave Kajun) as he portrays the thoughts and methodical actions of his work. I would say Benicio Del Toro smashes it, which he does, but it is a pain to try and understand what he is saying, and ultimately reading subtitles can suck you out if a movie (At least for me anyway). The uncertainty throughout makes us question everything in the movie. This perfectly sets up the final act, in which there is one of the best plot twists for any movie. The theme of trust is prevalent through the movie, no one truly trusts anyone, much less us for any characters emphasised by the untrustworthy narrator through the movie."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "IrateTyrant",
        "review_rating": "9",
        "review_title": "One of the best surprise endings ever",
        "review_detailed_main": "This movie is spectacularly performed by the actors, and the writing is very fine-tuned. It features surprises, action, and suspense that stays under-played rather than over-developed. I wouldn't let anyone ruin the ending for you, so be careful who you ask about this movie. It isn't the best thing in the universe, but if you don't know how it ends, it's fun. When I was younger this was my favorite movie of all time. It has aged pretty well, and the acting is outstanding from everyone involved in the project. The surprises are throughout the movie, making it fun to watch. Del Toro's performance especially, the scene where he pisses on the fire, and the ending make this a must-see."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "naylmp",
        "review_rating": "10",
        "review_title": "Easily my favourite film",
        "review_detailed_main": "The Usual Suspects has been, since the first time I saw it my favourite film. No film I have ever seen or probably will ever see even comes close to its sheer brilliance. Featuring an all-star cast including Gabriel Byrne, Kevin Spacey and Stephen Baldwin, the Usual Suspects will have you captivated right from the start The thing I particularly enjoy about it is that you can watch it over and over again and keep noticing new, key features each and every time. My father put it absolutely brilliantly when he said 'When I got to the end, I rewound it back to the beginning and started again. With no other film have I ever done that.' The first time you see this film, you are slightly confused perhaps even frustrated but it just gets better and better every time I stick it into my DVD player."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "kechhh",
        "review_rating": "",
        "review_title": "Suspect its Pretty Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "AvidClimber",
        "review_rating": "7",
        "review_title": "The Usual Suspects — Criminals versus criminals, and everyone chasing their own tail",
        "review_detailed_main": "The Usual Suspects your typical let's twist the tale around to keep you from guessing who's doing what. You get criminals who catch criminals in a bind to get them to do a coup for them. Nothing new.\n\nThe story is interesting and keeps you attentive. The action is nice, but tame by today's standard. The plot is not too complicated, if confusing at first.\n\nHowever, the lines the characters feed us are a little too slick, and some of the acting is a bit over done, especially on the part of Chazz Palminteri and Stephen Baldwin. Benicio Del Toro is unfortunately not at his best, while Kevin Spacey presents the top performance of the lot, and the rest of the cast gives only an acceptable one, but not much better.\n\nIf you like criminal intrigue, you probably will like it."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "billcr12",
        "review_rating": "9",
        "review_title": "Spacey's film",
        "review_detailed_main": "Kevin Spacey is Roger Mint, a con artist who is interrogated by the police following a crime resulting in a fire and several deaths. Told by Spacey with a series of flashbacks, the audience must pay close attention to the complicated storyline.\n\nSpacey is at the top of his game as Roger and he is joined by Stephen Baldwin, Gabriel Byrne, Benicio del Toronto, and Chazz Palminteri as assorted criminals, all with colorful histories of their own.\n\nThe Usual Suspects is impossible to describe in a review without giving too much away. The only advice I can give to fully enjoy this wonderful and sophisticated crime drama is to turn off the phone, put the lights out and sit back and concentrate and the payoff is well worth it."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Pedro_H",
        "review_rating": "7",
        "review_title": "Entertaining enough thriller, but treats common-sense with reckless disregard.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "gatbontonarthur",
        "review_rating": "5",
        "review_title": "Movie relies too much on the Twist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "SamuelClinton",
        "review_rating": "8",
        "review_title": "Solid 8+",
        "review_detailed_main": "Basic concept of 5 cons on various heist missions until one goes terribly wrong and then the authorities try to establish what went wrong hearing this from the account of one of the crippled crooks (Kevin Spacey). Gabreil Bryne was a excellent in his role as the lead crook and Benico Del Toro was also a stand out performance but we all know that Kevin Spacey was the man who took joy in playing the audience like a piano. A film can start of slow but the ending is the most important thing in the whole thing and I am glad to say that this ending was nothing short of a slap in the face."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "10",
        "review_title": "and just like that...hes gone",
        "review_detailed_main": "No matter how many times I watch The Usual Suspects, and believe me it's been many, I still get the same diabolical thrill, the same rapturous excitement and the same rush of storytelling and dramatic payoff as I did the very first time I saw it. Every performance from the vast and diverse cast is a devilish creation packed with red herrings, juicy dialogue and bushels of menace, every scene piles on the mysticism of the criminal underworld beat by beat, until the characters begin to pick it apart and the whole thing unravels like a great serpent coiling forth bit by bit, scale by scale, swerving toward the shocking, disarming third act that has since become as legendary as it's elusive and terrifying antagonist. In the crime/mystery corner of cinema, there's no arguing that this delicious piece of hard boiled intrigue reigns supreme, and it's easy to see why. In a seemingly random police lineup, five career criminals are harassed by an unseen hand, pushed into carrying out dangerous heists and violent manoeuvres by a shadowy campfire tale among the world of organized crime, a Boogeyman called Keyser Soze, if he even exists at all. Slick and sleazy ex cop Dean Keaton (Gabriel Byrne) heads up this dysfunctional crew of vagabonds which includes hothead McManus (Stephen Baldwin in a role originally intended for Michael Biehn, which kills me to this day), weirdo Fenster (Benicio Del Toro, using an indecipherable mishmash of an accent that would be the first of many), spitfire Hockney (Kevin Pollak) and Verbal Kint (Kevin Spacey) the runt of the litter. The lot of them are intimidated into performing risky enterprises by lawyer Kobayashi (Pete Postlethwaite) until the climate of their actions reaches a boiling point and answers emerge from the darkness. This is all told in retrospect by Spacey, to a rabid customs agent (Chazz Palminteri) who has designs on ensnaring Soze. Spacey scored Oscar gold for his heavy work here, spinning a tale whose layers interweave and pull the wool over our eyes time and time again before offering any glimpses of truth. Byrne is a fiercely guarded storm as Keaton, a man with secrets so deep even he doesn't know who he is anymore, letting the anger set and smoulder in those glacial eyes of his. The supporting cast adds to the class and confusion terrifically, with fine work pouring in from Dan Hedeya, Suzy Amis, Giancarlo Esposito and a wicked cameo from Peter Greene, who provides a moment of inspired improv. The score of the film rarely relies on dips and swells until all is said and done, keeping a tight lid on the orchestra and feeding us nervous little riffs of anxious portent that keeps tension on a tightrope and anticipation on call. A mystery this tantalizing is irresistible the first time around, but the trick is to make your story re-watchable, and I've seen this thing over a dozen times. Every viewing provides some new angle to the story I didn't see before, or I notice a subtle interaction in the very naturalistic and funny dialogue which escaped me in the past. My favourite thing to do is watch films with someone who hasn't seen them before, observe their reactions and opinions on every little story beat and cinematic flourish, it's almost more fun for me than the actual film itself. The Usual Suspects is a showcase piece for that activity, because you get to see this very complex revelation unfold through new eyes as you watch them experience the revelations. Whether your first viewing or your fiftieth, it never loses its power, and the spell it casts just doesn't dim. Masterpiece"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "zkonedog",
        "review_rating": "9",
        "review_title": "Looking For Something Different? Check This Film Out!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "eonbluedan-1",
        "review_rating": "10",
        "review_title": "Noir at its best",
        "review_detailed_main": "Forget M. Night Shyamalan with his plot holes and fall-apart final acts, this film has, unarguably, the most well-executed finale of this sort, at least of the 90s! Great writing, shuffling time frame to keep you on your feet, details and full scenes that see completely different the second time you see it, and brilliantly played from top to bottom, this is Film Noir at its best! The fact Bryan Singer was a young first-time director makes the whole thing all the more incredible to watch; you simply can't believe this is the product of a crew healmed by somebody so supposedly inexperienced. In his own words, perhaps if he tried to make this now, he wouldn't be able to......so I say, thanks goodness it came to him when it did! To say anything else would be to spoil the experience....just see it!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "hemant_balz",
        "review_rating": "10",
        "review_title": "Stupendous Ending.",
        "review_detailed_main": "The usual suspects,well for me it was a real surprise.What started as a puzzling movie ended as one of the best endings for a movie i have seen.The movie starts with a puzzling police lineup & then the movie itself flash backs a number of times.The way Kevin Spacey has played his role of Verbal Kint,will leave you speechless in the end.The way he demonstrates everything about what happened always has a bit of flair attached to it.I think its just his panache.Gabriel Byrne is a great actor.What more can i say about him.Chazz Palminteri is very lucky to get the role of Dave Kujan.I heard that it was Al Pacino who had turned down this role.Al still regrets this.Dave Kujan role is a very intrigue kind of a role.A role that believes in himself and draws his own conclusions.A man they say nobody can fool.Kevin Spacey rightfully won the Oscar for best supporting actor because he is a master at story telling.The usual suspects is a rare movie to breathe.The main flair is just its ending.Just adds fire to the movie.And Who is Keyser Soze?A devil of a man from whom everyone is scared of.And as Dave would say to Verbal,don't you lie to me?I know how to spot a murderer?But just see this movie to feel the twists and the lies.And the twist about Kobayashi in the end.That just made my day..."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "bzelkowicz",
        "review_rating": "",
        "review_title": "entertaining, but with a lame twist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "AaronCapenBanner",
        "review_rating": "7",
        "review_title": "Twist-Laden Story.",
        "review_detailed_main": "Bryan Singer directed this twist-laden story about Verbal Kint, a suspect(Kevin Spacy, excellent) found at a massive boat explosion being interrogated by a detective(Chazz Palminteri) about his involvement. He claims to be innocent, and the real mastermind named Keyser Soze was behind it, a man he is deathly afraid of. He then tells the story of how this began, when he was in the police lockup with other con men(played by Gabriel Byrne, Kevin Pollock, Stephen Baldwin, and Benicio Del Toro) who become involved in a revenge scheme that goes wrong...\n\nQuite original and unpredictable film is well acted and written, leading to a supremely well crafted finale...only negative is that, when all is said and done, you're not quite sure what to believe, and there is hardly anyone to care about. Still, an engrossing film noir experience."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "minister_of_silly_walks",
        "review_rating": "10",
        "review_title": "The greatest trick the devil ever pulled...",
        "review_detailed_main": "Where to begin with such an iconic movie and not spoil it? One of the rare movies that you will enjoy more watching it a second time around. Five felons are brought in for a police line-up all of them connected because they reluctantly worked for the mysterious Keyser Soze, a legend among the criminal underground. What follows is an intricate plot concerning the involvement of our main characters with this mysterious figure which will certainty leave a deep impression on every moviegoer who sees this film. It is an incredibly detailed and intriguing story with some amazing scenes in it and great performances. Definitely a must see!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ajsb55",
        "review_rating": "7",
        "review_title": "The Usual Suspects",
        "review_detailed_main": "The entire movie was great but the ending scene was what really made me think it was a particularly good movie compared to other movies. I think Kevin Spacey is a great actor and that the Oscar was rightfully his. Good thing he got it. And the script was great because it has all these complicated twists and turns and really makes it be a great mystery movie. The other actors in this movie were good also but they weren't really good. This movie is a classic and everybody who has seen this will remember Keyser Soze. It has a fairly good soundtrack throughout the film. I loved the ending scene. It was completely unexpected and great. It deserves to be number 21 on the IMDb top 250."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "delbomber",
        "review_rating": "1",
        "review_title": "Great ending for an otherwise average movie",
        "review_detailed_main": "This film has one of the classic endings in motion picture history, but that's the only thing extraordinary about it. The ending can not make up for the rest movie, which at times is confusing and slow-moving."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "squirrelboy422",
        "review_rating": "10",
        "review_title": "Classic",
        "review_detailed_main": "This movie became my second favorite movie and Kevin Spacey became my second favorite actor immediately after i watched it. The acting is incredible, especially by Kevin Spacey, hence the Oscar for Best Supporting Actor. The twist at the end is impossible to figure out. You can try guess who it is, but that takes the fun out of it, and if you do figure out who it actually is, there is no way you will be able to use any facts or knowledge from the film to draw your conclusion. It would have to be based on a guess. You'll think you figured it out, and then you'll realize you haven't. This is number 2 behind the Godfather and Kevin Spacey is number 2 to Al Pacino."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "hkinsightryankim",
        "review_rating": "9",
        "review_title": "Mind-Blowing",
        "review_detailed_main": "Despite knowing the ending, watching this movie for the first time is really a mind-bender. The use of foreshadowing and the phenomenal performance by Kevin Spacey really made it a great watch. Even while paying close attention, the attention to detail and character development gives this a 9 out of 10 rating."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "biosoftcoder",
        "review_rating": "10",
        "review_title": "First-time viewer?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "watki1690",
        "review_rating": "10",
        "review_title": "You thought who???",
        "review_detailed_main": "Utterly brilliant, all the actors are on top form. Top 3 films EVER"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "teresaslone0787",
        "review_rating": "8",
        "review_title": "Good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "SB-2",
        "review_rating": "7",
        "review_title": "pretty good",
        "review_detailed_main": "I'll need to see it again a few more times to really understand this movie but it was pretty good. I liked the performances by Byrne, Spacey, Del Toro, and many others."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "dimokogan",
        "review_rating": "10",
        "review_title": "One of Spacey's best performances",
        "review_detailed_main": "Movies like this will make you yearn for the golden age of cinema that was the '90s, where seemingly Hollywood was just releasing instant classic after instant classic.\n\nThis was sadly one of those movies that I overlooked when I was younger. In my haze of binging Netflix DVD rentals as a teen, I remember watching the first 20 minutes of this and turning it off, not knowing that I was missing out on probably one of the most intelligently-written films ever produced.\n\nGranted, it's nonlinear structure might be somewhat confusing, but the movie isn't as complicated as some people say it is. The movie essentially unwraps in a series of interesting scenes related to a heist. As Spacey's character Verbal narrates all these recollections in his life to Agent Kujan (Chazz Palminteri), we learn more and more about the mysterious figure behind the madness, Keyser Söze. The only question we all have is: who is Keyser Söze?\n\nThe funny thing is, I already knew who Söze was when I sat down with the intention to watch this film to its full conclusion, but that didn't detract me from appreciating the ending whatsoever. Nor did it stop me from appreciating the sharp screenwriting, excellent direction, and mesmerizing performance by Spacey, who rivals his role in Seven, which I previously thought was the top acting in his career.\n\nThis is one of those classics you want to rewatch as soon as it's finished, just because you're so blown away by the time it's all finished that you want to re-examine the pieces and figure out how the filmmakers were able to pull one over you so cleverly. Highly recommended."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "prettybutterflies",
        "review_rating": "",
        "review_title": "Please Help Me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "linkemi",
        "review_rating": "6",
        "review_title": "18 best movie...gemme a break!",
        "review_detailed_main": "This movie was entertaining but how in the world can it be the 18th best movie ever?(according to this website). Even after 20+ years, one can remember the scenes from a great movie viewed once.Will i remember this movie in 20 years...hardly. I'm also tired of these Who-done-it movies relying mostly on narration to tell the story...Its like there saying..\"gee our story doesn't make sense so lets just have kevin spacey tell the story\". Movie makers like the narration approach because they can just make up whatever,whenever. Don't get me wrong, the film was entertaining but i freaked when i saw it rated 18th outta 250. Its hard to believe that this movie rated higher them Memento."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "simonbeyer",
        "review_rating": "1",
        "review_title": "A piece of crap!",
        "review_detailed_main": "This movie is nothing but a complete waste of time. There is absolutely no logic in the story, the characters are boring and everything is mixed together and that makes the movie very confusing and extremely boring.\n\nFive stupid men are the main characters, and all they do is talk about stupid things in a boring way. Occasionally the director puts in a little stupid action which makes no particular sense.\n\nOverall: A very clumsy attempt to make a crime movie. And I'm sorry that it isn't possible to vote less than 1 for this movie failure. It's a disgrace to the whole movie industry.\n\nIf you want to see a brilliant crime movie you should try \"Seven\" or \"The Silence Of The Lambs\". True classics!"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "garman-67458",
        "review_rating": "10",
        "review_title": "An 8.5?!?",
        "review_detailed_main": "This movie only has an 8.5 and by God that's robbery because it's the best crime movie of all time. The ending of this movie has become legend and for good reason. It's the greatest 5-man ensemble of any movie, and the non-linear storytelling is superb. You will never forget this film"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "iwtga",
        "review_rating": "9",
        "review_title": "Suspense filled plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "HenryMfaume",
        "review_rating": "9",
        "review_title": "You can not judge a book by it cover.",
        "review_detailed_main": "This movies reminds me of the saying that one can not judge a book by it cover, or by the one looks like. sometimes the most innocent looking person is more dangerous that those with scare face."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "g_dog_homie",
        "review_rating": "10",
        "review_title": "Mindbending",
        "review_detailed_main": "This movie deserves to nominated for a lot more than just two Oscars,\n\nIt was a masterpiece put together by Bryan Singer and by far his best movie yet. Kevin Spacey as Verbal Kint was just brilliantly played, Stephen Baldwin is fantastic, and Del Toro as Fenster was just hilarious. The writing was just phenomenal by Christopher McQuarrie and the ending had me blown away, this movie has been honored as my favorite movie and one of the greatest thrillers of all time.\n\nWhen I had first seen this movie it had high expectations, it went above those expectations. It set a new bar for action/thrillers of any kind, a movie like this would'be/should'be won way more than just TWO Oscars. The Usual Suspects gets a 10/10 because it has and will always be a great movie."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "0w0",
        "review_rating": "8",
        "review_title": "Didn't leave me breathless, but it's good",
        "review_detailed_main": "One of those movies that almost gets better the 2nd time that you watch it... It's a movie that some people will find boring, but not me personally... I found the whole 'following the bread crumbs' theme interesting and on your 2nd viewing you actually notice a lot of the stuff you weren't even aware of the 1st time. Can't talk too much about the movie since lots of stuff would be a spoiler, but honestly it's just a good 'crime investigation' movie. Worth a watch"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "lopymaxyman",
        "review_rating": "10",
        "review_title": "This is what movies are all about.",
        "review_detailed_main": "There's no way you can have more fun at a movie than The Usual Suspects. Sure, some films might come to mind that you have as much fun at, but this is as fun as it gets.\n\nFrom the first frame to the last, the audience is engrossed in a smart, edgy, and exciting crime thriller that oozes with style and brilliance. The performances are perfect, from Spacey to Bryne to Del Toro to Pollock and even Steven Baldwin, the characters were both engaging, fun, and mysterious.\n\nSimply put, films don't get much more original than this. It is entertaining without losing any artistic or visceral edge, a direct result of McQuarrie's genius screenplay.\n\nExtremely enjoyable, fun, but also smart, artistic and well thought out, The Usual Suspects is the most fun you will have without the 100 million dollar budget.\n\nThis is what movies are all about."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "polashbaidya",
        "review_rating": "7",
        "review_title": "Overrated",
        "review_detailed_main": "Overrated because it's not represent anything like thrilling. If i consider it's 90's movie than ok but this time it's plot not new(modified version). Even in 90's there are lot of thriller movies to watch and it's better than that."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "krisrox",
        "review_rating": "8",
        "review_title": "Great concept, overly contrived result",
        "review_detailed_main": "The statistics don't lie - people seem to love this film. I guess they like to be tricked. As for me, I was intrigued the first time around, but the second time (a healthy six years later) I was thoroughly disappointed. Now that this whodunit-thing was out of the way, I discovered the amazing flatness of the characters, existing solely to make the payoff work. The idiotic twists the screenwriter invented to make it look even more complex. Wow. Duh. It reminded me of my advanced math classes: why go through all this stuff when I don't understand how it applies to real life?\n\nDon't get me wrong, I still gave it a 7 - because the concept is good, some of the acting was good, and as an experience it works the first time around. But don't try to analyze it - the triviality of it all will drive you nuts."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "iartekr",
        "review_rating": "6",
        "review_title": "If you don't like slow paced lacking action movies this is not for you",
        "review_detailed_main": "Watched 40 min of this movie and it was just plain boring. I have no idea why people rate this so high, over rated in my opinion. Maybe it's just my taste.\n\nBut if you don't like slow paced movies with lack of action this is not for you"
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "Asphyxiod",
        "review_rating": "2",
        "review_title": "Overrated & Senseless !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "mrkkdude",
        "review_rating": "10",
        "review_title": "All star cast delivers",
        "review_detailed_main": "Via a great writer and director, this film always reign supreme through its stellar performances, constant suspense and drama. Despite KS's recent controversies, you can't fault him on this performance."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "hamzaarifshuja",
        "review_rating": "10",
        "review_title": "The Usual Suspects",
        "review_detailed_main": "No wonder Kevin Spacey is so good in crime movies; he's a real-life criminal! He's perfect for the part! No long review for this as I just sort of sat down, turned my brain off, and watched. Loved this one though! The acting is amazing, and the storyline is good. A bit predictable at times, but the action is great, and this is a fun movie to watch; it's just fun, I mean, that's all I can really say! Nothing absolutely exceptional about it besides the fact that I thought I knew the ending but turns out I was completely wrong. NEVER MIND TURNS OUT I WAS RIGHT OH MY GOSH THAT JUS RAISED THE RATING BY.5 STARS!! (Writing during the movie) I enjoyed it! Will definitely be rewatching! Also, Benecio Del Toro The greatest trick the devil ever pulled was convincing the world he didn't exist.\" Five criminals are pulled in for a bogus police line-up, only for them to be set up to do a job by the feared & infamous keyser soze; they're hatching their own plan. But what is the real truth in Singer's noir masterpiece. Unmissable."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "PopcornGoblin",
        "review_rating": "9",
        "review_title": "Flick, Pack of matches burns",
        "review_detailed_main": "There are quite a few good scenes in this movie I found myself recollecting on upon re watching. I would classify this as a mystery/ action thriller, but in category of entertaining heist movies about a crew additionally close to the the likes of HEAT, the town, and The Score or Ray Liotta's Phoenix.\n\nAnd the fact that the bad guy, an ominous Kaiser Sose whom not much is known about and the viewer is informed by what other people say about him, which builds up a strong character in our minds. Even until you get a handle on what is going on which makes the effect even greater. And to a certain degree, you can't tell if (actor removed) is telling the truth or not in many scenes. The fact that he is present in literally almost every major scene makes us believe it was all engineered to his design to deceive and get away with it."
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "ilyaskeser",
        "review_rating": "8",
        "review_title": "good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "tom_owens_182",
        "review_rating": "9",
        "review_title": "Brilliant, engaging and entertaining.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0114814",
        "movie_name": "The Usual Suspects",
        "movie_rating": "8.5",
        "review_username": "EmperorNortonII",
        "review_rating": "8",
        "review_title": "The Legend of Keyser Soze",
        "review_detailed_main": "\"The Usual Suspects\" is a thrilling crime drama, filled with suspense. Kevin Spacey plays Verbal Kint, the narrator of a twisted tale that begins with a police lineup in New York, and ends with a dockside massacre in California. Behind it all is the mysterious and dangerous Keyser Soze. Bryan Singer's criminal saga is haunting and clever, and well cast. Kevin Spacey turns in a great performance as Verbal, setting an oddball tone. The rest of the crew is headed by Gabriel Byrne's Dean Keaton, with thugs Kevin Pollack, Benicio Del Toro and Stephen Baldwin along for the ride. This crew of five shows great clashing chemistry. In the end, you'll be shocked. \"The Usual Suspects\" has become a new crime cult classic."
    }
]