[
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Acolyte-2",
        "review_rating": "5",
        "review_title": "Cheese on Toast",
        "review_detailed_main": "Oh, for crying out loud. This was a fun little movie with lots of good action in it that never takes itself too seriously. For what it was intended to be, it can't possibly rate this low. Was it honestly worse than \"Highlander 2\", with its big budget and big-name stars? Or \"Glen or Glenda\", a shining example of deep cinematic ineptitude? I don't think so!"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "die_buffy_die",
        "review_rating": "5",
        "review_title": "Gangs of Los Angeles fight with police for the city while the Shadow Lord fights for the other half of a long lost amulet.",
        "review_detailed_main": "Double Dragon is better then Super Mario Brothers. Then again, so is everything else. The movie was released in 1994, looks like it was made in 1989, and the fashion is circa 1980. Why is it people from the future dress like they're from the past? And why is it Alyssa Milano looks hefty? It was terrible, unsophisticated and bumpy.\n\nThat said, it gave me exactly what I wanted. Slapstick Sung-fu action and a few familiar faces. I enjoyed. You don't rent a movie like Double Dragon because you want an engaging plot. You rent it to relive your childhood hi-jinx.\n\nWatch it and I guarantee you that you'll be downloading an emulator and playing it within a week."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Movie-Misfit",
        "review_rating": "4",
        "review_title": "I Keep Watching, But Don't Know Why!",
        "review_detailed_main": "One of my favourite childhood games gets the typical nineties Hollywood makeover and only just entertains for all the wrong reasons!\n\nSet in the future, well, if our year of 2007 really turned out like this, in the city of New Angeles. With vehicles powered by burning rubbish, police curfews, buildings held up by jacks, and lots of colourful clothes and bad jeans, we enter the god awful world of James Yukich's Double Dragon.\n\nIn a nutshell - Embarrassing acting from most cast members, all but Dacascos, Wolf and Nickson, that only adds to the unintentional humour, terrible make-up, costumes and direction. Its only saving grace is its two gorgeous leading men who give us some decent fight scenes and a number of funny enough one liners!\n\nIn my opinion - Hollywood, oh Hollywood... For many years you have astounded us with your inability to chose directors that know what they are doing, that suit the project in action, or generally just can't stop ruining great things! Taking a documentary film maker and handing him one of the ultimate and most popular games of that time, should have been the first sign to the studio fat cats that this was going to be as much of a success as the previous years, Super Mario Bros.\n\nHaunted by that typical mid nineties costume department that helped make a lot of then films look naff, there is pretty much nothing in this 90 minutes of madness that stays true to the game. Every extra looks ridiculous and is annoying as hell, with most of it playing out like some bastard child from a Power Rangers episode!\n\nIs there anything good in Double Dragon I hear you ask? Well, yes if I'm honest. Both its leading men are absolutely gorgeous and perfect leading men material for such a film. They probably act the best out of everyone, and Scott manages to hold his own in the fight scenes alongside the always incredible Mark Dacascos. It is only a shame though that Hollywood executives thought this would be the best film to introduce Mark as a leading man, instead of his classic Crying Freeman which went unreleased in the US for many years!\n\nDouble Dragon has its moments. It just makes me so angry to see such a great thing wasted, and another case of what could have been if it was in the right hands. In one scene, the spinach feeding scene, the actor in terrible make-up states, 'I'm not acting...'\n\nNever a truer word said."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Skeletors_Hood",
        "review_rating": "",
        "review_title": "It's cheesy, but remember, cheese is good too.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "gladrius",
        "review_rating": "2",
        "review_title": "Dumb fun, but that's it",
        "review_detailed_main": "I wasn't expecting the next Citizen Kane of this movie, but I was expecting a little more than I got. Double Dragon, the game, is about two of the baddest martial artists the gaming world has ever seen, but the Lee brothers in the movie are a pair of goofballs who don't kick any significant butt until like the last fifteen minutes of the movie. They actually spend most of the movie running away from the bad guys. There are one or two recognizable video game bad guys like Abobo and the lady with the whip, but other than them this movie has almost nothing to do with the game. As far as adaptations of Double Dragon I'd say this rates a little below the cartoon show in quality. You can have some dumb fun by watching this movie, but dumb's the operative word..."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "fmarkland32",
        "review_rating": "2",
        "review_title": "Double the stupidity...",
        "review_detailed_main": "Mark Dacascos and Scott Wolf star as Jimmy and Billy Lee, two brothers who join forces to keep a magic medallion out of the hands of a gang leader (Robert Patrick in an embarrassing performance) he already has the half of it and he'll do anything to get the other half. People often times wonder why Robert Patrick and Mark Dacascos never got that far in their careers. Well for those that are curious, here is your reason. Double Dragon is easily one of the worst video game adaptions and from what I remember about the video game, this isn't one that is all that hard to adapt. Indeed had this been done as an Indianna Jones style thriller with numerous martial arts fights, we might have had something. What the movie ends up being is a cheeseball adaption that fails to engage anyone over the age of 11. Although i'm not sure even if small children will enjoy something so stupid. It's a bad movie. Just plain bad.\n\n* out of 4-(Bad)"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "bujinbudoka",
        "review_rating": "1",
        "review_title": "Double Dragon, sounds more like a bad Chinese restaurant.....",
        "review_detailed_main": "Here's the thing, I'm an avid video gamer, and I'd be hard-pressed to find a Double Dragon game I didn't play. As a fan of the games I was very much looking forward to the movie.\n\nSadly I was very disappointed from scene one. It had nothing to do with the games, and even the horrible animated series was better than this crap.\n\nSure, they have the main characters from the game, Jimmy and Billy Lee, but they only had one character played by a real martial artist played poorly by Mark Dascascos of the ill-fated Crow TV series.\n\nBasically the movie takes place in an apocalyptic wasteland which was Los Angeles and does pretty much everything it can to bring down any kind of honor the game itself maintained.\n\nI vote it as possibly THE WORST VIDEO GAME MOVIE EVER....aside from Mortal Kombat: Annhilation. If you see this movie, run.\n\n1 out of 10."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "mentalcritic",
        "review_rating": "1",
        "review_title": "It's not as bad as they say... it's even worse!",
        "review_detailed_main": "My first acquaintance with the Double Dragon feature film was through a collection of video captures hosted on the X-Entertainment web site. Even they could not prepare me for the purely abysmal experience that the film proper represents. Like so many video game films after it, Double Dragon takes a perfectly good idea for a video game and turns it into an abysmal feature film. The film itself has a few things in common with the video game: the title and a few character names. The game featured one or two players moving a character from the left of the screen to the right, punching and kicking seven bells out of anyone who dared to get in their way. Unfortunately, Greenleaf Productions and director James Yukich thought that by aiming the film at children too young to remember any of the video games, they might make some money. Fortunately, the adults who were old enough to have played the classic video games ignored the film as it deserved. We certainly would not want the powers that be in Hollywood getting the idea that we actually like this kind of crap, after all.\n\nThe first problem lies in the screen writing. What made the video games so compelling was that they made as little effort as possible to differentiate its setting from the reality of the player. The story, such as it was, was secondary to people beating each other senseless. In the feature film, the writers attempt to give the story of Double Dragon a background, a motivation, or a reality. They manage to get all three, that much is true, but they all come out the same way: incredibly silly. Making matters worse is some incredibly stupid costume design. I do not know who designed Alyssa Milano's attire for this flick, but I am just betting they spent much of the time when they first saw what they had made laughing at poor Alyssa. Whomever designed the makeup effects for the Abobo character should have been arrested for crimes against the viewer. I do not know exactly what they were trying to achieve with all the lumpage on his body, but whatever it is, they failed. Perhaps his best scene is when Milano is force-feeding him spinach in one of the weirdest interrogations on film.\n\nAlso looking to fire their agent is Robert Patrick, who was at the time struggling to capitalise on his burst of fame after Terminator 2. Perhaps his agent told him that films based upon video games were going to be the new big thing. What the agent forgot to mention was that while they were a new big thing, they were a new big thing in unintentional comedy. Preceded by one year with Super Mario Bros., Double Dragon set a new low in cinematic history that it took another five years to worsen in the form of Wing Commander. I have no doubt in my mind at all that when Patrick looks back at this film, he thinks to himself \"this is the moment I took what was still a salvageable career, and flushed it down the can\". His performance is utterly terrible here, so I am inclined to blame the level of pathetic that Double Dragon reaches upon the director. After all, he has shown already that he is more than capable of turning in a good performance with halfway decent direction. Not that a good performance from either would have saved this cinematic abortion.\n\nAnother problem for a film based upon a beat-em-up video game is that the fight scenes are terribly executed. The camera rarely sits still long enough to make out what is going on, the choreography is utterly terrible, and the actors chosen for the parts clearly have no idea what they are doing. Was it really that difficult to get some people who really know their martial arts for the task? Hell, let's farm the rights out to Golden Harvest, they at least know how to choreograph a halfway decent fight scene. Especially poor are the scenes with Abobo, where none of the superhuman strength the film goes to great pains to tell us he has is actually utilised. Much like Michael Beck in Xanadu, he is really there as window dressing. Part of the problem here is that the canonical character Abobo is meant to appear superhuman in size, and the film just goes too far in trying to maintain that illusion. It would be better to have left the character out of the story altogether than present us with the tumour-encrusted visage we get here.\n\nEven as an unintentional comedy, Double Dragon is a failure. Sure, there are moments when the viewer is either going to laugh or cry, the moment when Marian force-feeds Abobo spinach being a prime candidate. However, these moments are too infrequent, and the film takes itself far too seriously otherwise, for this to be anything other than a mean-spirited laugh at the principal actors. Half of the dialogue sounds like it was ADRed by prepubescent children, and none of the actors save Robert Patrick look like they could punch their way out of a bag of potato chips. I can still remember when the advertising corps. made a big deal about this being a film based on a video game, back in the days before films based on video games had a reputation for being universally terrible. And I still wonder what the hell Alyssa Milano's costume designer was smoking. In at least half of the shots she is in, she looks like she is contemplating force-feeding spinach to her agent until he vomits up a lung.\n\nFor these reasons, I gave Double Dragon a one out of ten. Between watching this film again and being given a spinach enema, I would choose the spinach. You must be wicked hardcore if you can sit through this."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "BrickNash",
        "review_rating": "1",
        "review_title": "Zero quality in any area",
        "review_detailed_main": "I'm going to start by saying that there has only ever been one great video game to move adaptation and that was the terrific Mortal Kombat and that should give you an idea of what direction I'm going in with this review.\n\nI'm not your average movie goer, I am first and for-most a retro gamer and in the 80's and 90's I lived and breathed computer and video games with Double Dragon being one of my all time favourite games. It's now 2014 and for 20 years I have avoided seeing this film. I deliberately dodged it when it came out because I just knew in my heart of hearts that not only would it have nothing to do with the game but it would be watered down kids action with bad acting all round.\n\nWell guess what, I was right!\n\nDouble Dragon: the Movie is atrocious!!! Seriously, it really is that bad. Now I'm a big fan of low budget post apocalyptic action films from the 90's but even then Double Dragon takes the biscuit for just sheer lack of quality on all counts.\n\nThe film features I think THE worst acting I think I have ever seen. the delivery of the cringe worthy lines is so bad it makes King Of The Kickboxers look like an Oscar winner, but then those kind of films are backed up with a quaint charm and great fight scenes, Double Dragon has absolutely none of that whatsoever and is a magnificent turd from start to finish.\n\nI'm convinced that video game adaptations were simply cash makers given to first time or music video directors to dip their toe in the film world because the name would generate at least a bit of revenue and it really didn't matter whether the actual film was good or not.\n\nAs for the game well, it had a pretty thin story I'll admit, but there was no reason why they couldn't have taken that thin story and built on it instead of making up this mystical nonsense and almost completely changing everything which just p*****d off fans of the game who should have been the films main target instead of the simpering under 10 year old's that it was aimed at.\n\nI will be fair, there are one or two positive points in the film but they are extremely trivial. One is the matte paintings used for wide shots of the earthquake ravaged city, they are quite nice and add a bit of atmosphere. Two is Mark Dacascos, he is a fine martial artist and a decent actor but even he struggles in this film. Third and finally is Robert Patrick who genuinely looks like he's having some fun. When he accepted this role Mr Patrick was either desperate for work or he is the absolute King and master of not giving a f**k and I suspect it is the latter because he seems to take a lot of glee in hamming it up and ham it up he does, but with a bit of a wink.\n\nAnother small point I'd like to make in the interest of fairness is that if you were young and saw this film when it came out then I can totally understand the nostalgia value attached to it and how that can make any film seem so much more enjoyable but being such a huge fan of the game I was never going to have that even if I saw it in 1994 so this review is completely objective.\n\nThat's about it! I don't think I've ever given any film a 1 before but Double Dragon truly deserves it. A great, steaming pile of utter s**t that bears practically zero resemblance to the great game on which it is based and is an absolutely terrible example of film making in itself."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "bannonanthony",
        "review_rating": "6",
        "review_title": "Were you expecting this film to take itself seriously?!",
        "review_detailed_main": "I really don't see what everyone's problem with this picture is! I believe that if any film bases itself on a computer game, then it stands to reason that is not going to take itself seriously for a split second! I played some of the DOUBLE DRAGON games for Nintendo when I was younger and they were pretty jokey themselves. This little picture has great fights, great action and most importantly of all, a great sense of humour. Robert Patrick camps it up wonderfully as bad guy Koga Shuko. A young Mark Dacascos (DRIVE, THE CROW: STAIRWAY TO HEAVEN, CRYING FREEMAN) kicks less butt than usual but is still enjoyable. Alyssa Milano is great as the sardonic revolutionary Marion, and both Dacascos and Scott Wolf as the Lee brothers (Dacascos is 'Home Lee' and Wolf is 'Ug Lee', geddit?) both have a fine line in sarcastic remarks. The car chase near the start with the 'Dragon Wagon' being pursued by Abobo's van is brilliant, especially with the use of computer graphics. Again, a classic example of good, mindless fun!"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "deadsouldragon",
        "review_rating": "4",
        "review_title": "Pure cheese",
        "review_detailed_main": "You don't need your brain for this one folks, just sit back and be mildly entertained by the bad fight choreography, worse dialogue and what probably were decent special effects at the time."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Thomasjod",
        "review_rating": "8",
        "review_title": "A great movie for 5-10 yr old karate fans, very TMNT like",
        "review_detailed_main": "You have to take this movie for what it is, a mid 90's video game era and Ninja obsessed culture movie. Many people rate this movie bad because they are up tight adults. In reality, this movie is great for kids who like martial arts, etc.. It's a good movie for kids who want to watch Martial Arts style movies but without all the bad language and sex. Somehow that gets bad ratings from the morons of today.\n\nThe futuristic imaginary city, \"good gangs\", and villain aspects are so good. Cheeky one liners and cars with flames. My sons loved it. It's very much a power ranger and TMNT feel. It's so 90's and this movie had great casting."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "thrownaway2007",
        "review_rating": "7",
        "review_title": "Its a PG movie from 1994!",
        "review_detailed_main": "To all of you moronic people who refuse to leave decent movies alone- Double Dragon was a PG movie. It wasn't meant for the adult viewer in particular. I watched this movie when I was a kid, after it came out on video and I thought it was spectacular. I still think it's a decent movie. If any one of you losers can name a singular movie from 1994 that was directed towards children that was still packed with action that was better than this then you're a freaking bum. I can probably guarantee that most of you butt heads, that's right I called you butt heads, hated any martial arts style movie that ever came out. Bruce Lee's movies were of a worse quality than this movie and I love Bruce Lee's movies. The point is you can't be a narrow-minded nitwit if you're going to watch movies. I can name a handful of movies or more that everyone and their mother absolutely loved, but I and the majority of the people around me thought were boring and pointless, but I never tore down the movie to other people I just told them that I personally didn't enjoy it. But I guess that's lost on Americans, the rest of the world enjoys something and you guys come along and muck it up."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Airheaded",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "cybrfett",
        "review_rating": "",
        "review_title": "FUN EYE CANDY!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "MsFarEast",
        "review_rating": "1",
        "review_title": "An insult to fans.",
        "review_detailed_main": "This film clearly insults fans of the classic NES side-scrolling beat em' up. I can imagine the seared minds of those who loved their classic game when exiting out of the theater. And how right I am. Not only is the film a disgrace to the games, it also shows that Hollywood is only interested in $ signs rather than the material. For starters, the production values (WHATEVER THAT IS) are laughably bad, the acting is akin to that of a lobotomized inmate in an asylum, and to top it off, the horrendously awful fight choreography and special effects. Who, and I mean WHO can't forget the disgusting portrayal of Abobo, the coolest and meanest brute in the games. That name struck fear and terror in the hearts of those who played the games.\n\nThe greatest joke played on the fans is the plot. It is clearly a direct contradiction to the games where the focus was on the brothers Billy and Jimmy Lee out to rescue Marian from the clutches of the Shadow Warriros. Here they fight against a nameless gang led by a totally cheesy and lame villain who's very weak for the brothers. It was supposed to be set in a post-apocalyptic version of New York!!! Why must Hollywood insist on having the film take unnecessary liberties when making video game movies? I can't recommend this travesty to anyone. It is bad I tell you, BAD!!! Stay far away from this piece of trash."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Dumb dialog, poor acting and the director was apparently a possum!",
        "review_detailed_main": "If you are looking for a genre filled with great films, I suggest you never consider movies based on videogames. This is because many of these films are among the worst movies you can find...with MANY on IMDB's infamous Bottom 100 List. \"Double Dragon\" is no exception to the rule...it, too, is a bad movie based on a videogame.\n\nThe story is a confusing bit on nonsense set in the dystopain world of New Angeles in 2007. This world is filled with evil gangs and it has a strong \"Mad Max\" look to it. In other words, it's a lot like Los Angeles in real life. The heroes are two dopey guys and a lady who, ineplicably, CAN actually act (Julia Nickson)...so I have no idea why she's in the film. The trio spend much of the movie fighting some baddie and being chased by his minions...all over some medallions which I couldn't have cared less about nor could many in the audience based on the reviews.\n\nThe film has many problems going for it...bad acting, terrible dialog and, I kid you not, the director was apparently a possum! The film is terrible and silly...and not even worth watching to see some tiny cameos by Vanna White, George Hamilton, Andy Dick or Alyssa Milano. Is it among the worst movies based on videogames....possibly not. But only because there are so many crap films based on videogames!!"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "bardellsean",
        "review_rating": "1",
        "review_title": "Horrible Trash",
        "review_detailed_main": "Is worse than Super Mario Bros... Just a mockery of source material and some of the Worse acting I ever witnessed. AND BILLY GOD is thee worst!!! HORRIBLE TRASH LOL"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "batmang-93919",
        "review_rating": "1",
        "review_title": "Paul Dini?",
        "review_detailed_main": "Wtf Paul Dini? What on earth possessed you to write this. I guess for every amazing batman story you wrote to come to fruition you had to make a serious mistake."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Baphomet-4",
        "review_rating": "1",
        "review_title": "Absolute piffle.",
        "review_detailed_main": "Rarely do I comment on poor films, but I feel that as a movie lover, it is not unreasonable to feel outraged when you wait for three years for a movie based on a gaming classic and your patience is met with \"Double Dragon\", a pathetically acted, woefully directed, sopoforic waste of time and money. Avoid."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "ShadowGal",
        "review_rating": "6",
        "review_title": "It's not as bad as all that!",
        "review_detailed_main": "I feel bad to see that this movie got such an incredibly low rating. Granted, it was no masterpiece. Then again, I don't think it was supposed to be.\n\nI first saw this movie when I was fairly young, and I absolutely adored it. I had a crush on the brothers (the \"Double Dragons\" of the title), and I borderline-idolized the glow-in-the-dark punk kids. They were just so cool to me!\n\nAbout a year ago or so--maybe two years ago--I watched this movie at about 2:00 in the morning during the summer, when there was nothing else to watch except infomercials or music videos. I was either 17 or 18. The movie wasn't as good as I'd remembered, but, to my very pleasant surprise, it wasn't nearly as bad as other people remembered it to be.\n\nThis is a good late-night movie, or nice if you're in the mood for something cheesy and nostalgic. I give it a 6 out of 10. A little above average--but I think that's just nostalgia. For most people viewing it, it's probably worth a 5."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Reaper",
        "review_rating": "1",
        "review_title": "A movie with everything",
        "review_detailed_main": "Who said a movie can't have it all? Double Dragon has a wretched script (including such dialogue as \"Ha ha ha -- HA!\"), dreadful acting, and wretched special effects. This isn't even worth watching on cable!"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "ferren-87754",
        "review_rating": "10",
        "review_title": "Arcade Classic",
        "review_detailed_main": "How dare you are Maggots insulting this very instant classic EVER!!!\n\nHOW DARE you said nonsense rambling bumbling a MOVIES. This is NOT MOVIES!!! This is BIG FRAGMENT created only for supporting the 1 on 1 vs Arcade."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Field78",
        "review_rating": "7",
        "review_title": "\"Your incompetence sticks needles into the flesh of my honor\"",
        "review_detailed_main": "Having played the original Nintendo game myself, it is actually a small miracle that I managed to miss this movie for so long, and I guess it is no more than justice that I finally watched it in the year of its 25th anniversary.\n\nMovie adaptations of games generally have a bad name for a number of reasons, like not being able to replicate the gaming experience, poor production values, or taking itself way too seriously. Although Double Dragon makes a valiant attempt to replicate the game's theme of urban decay and street gang martial arts (I was never aware that it had much of a story), it is definitely poorly made, with laugable acting and direction, ridiculous story and dialogue, and hokey fight scenes. But what saves it from my Wall of Shame is the fact that it doesn't take itself seriously for one moment.\n\nI don't know what the cast thinks of it today, but it looks like most actors had a pretty good idea that they weren't doing Shakespeare, and tried to have as much fun on screen as possible. Some performances, like Scott Wolfe and Alyssa Milano's, are funny in a particularly cringe-inducing way, but Robert Patrick (who had already shown his sense of humor in a Wayne's World cameo) steals the show by chewing the scenery at every opportunity he gets. The dialogue is cheesy and unintentionally funny throughout (\"You're weak, like your father!\" \"You're ugly, like your mother!\"), but Patrick delivers a line so immortally preposterous that I had to make it the titel of my review (who said there was no Shakespeare?).\n\nThe art department clearly did most of the work, by putting Escape From New York, Mad Max and Big Trouble in Little China into a blender for the film's convincing post-apocalyptic punk look. That obviously left very little budget for fight choreography, so they settled for some kicks and punches in the air mixed with a lot of goofy slapstick and bad-pun jokes. What few dollars were left were spent on make-up for henchman Abobo's transformation into what looks like a hilariously bad paper-maché imitation of Sloth from the Goonies.\n\nMany call this one of the worst game adaptations of all time, but you have to recognize cult potential when you find it. This would actually be a 4-star movie if it wasn't so enjoyably B- or even C-grade. Really, I had a big smile on my face the entire time, and couldn't help laughing at the extremely cheesy running gag where the protagonists are startled by something, stay silent for a beat, and then yell \"WHAAAAAH!!\" in unison before running away.\n\nThis film doesn't make the mistake that Streetfighter (both versions) or Doom made, which is thinking that anything in it actually matters or should be taken seriously, not even for a second. It is such unpretentiously bad pulp that it's fun, and I'd say that after 25 years, it is ready for a re-appraisal of its camp value."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Svenstadt",
        "review_rating": "2",
        "review_title": "Better than Cyborg, but still pretty bad.",
        "review_detailed_main": "This is like a bad joke version of a mediocre video game. They decided to screenwrite the video game as a punk scifi combo even though that's nowhere in the video games. Robert Patrick's role was very bad in this. The story is weak, and the pacing of the film is uneven. There are so many unnecessary characters that are totally disposable. Nowhere in the video game is there the talisman cliche' common to movies. This should have been just a straight beat em up like the game. A generic martial arts film. But it tries to do too much at once. Some of the settings get pretty ludicrous with the punk imagery, such as the green water in the one gang's hideout, which takes things too far."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Trevor-12",
        "review_rating": "",
        "review_title": "What a waste of a videogame franchise!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "5",
        "review_title": "Accept it for what it is and you'll find yourself having fun",
        "review_detailed_main": "Since the Super Mario Bros. movie in 1993 video games have been met with fiercely negative reviews from critics who savage almost every single one of them based purely on their origins. I understand now that we live in an age where video games are movies in their own right, if not even more poetic and innovative than most movies themselves, but in 1994 they were not considered to have any literary or theatrical merit, and even to this day (with a second attempt at a Hit-man movie only just being released as I type this review) they still cannot seem crack the code on how to make a coherent and worthy adaptation.\n\nDouble Dragon is not the exception, it's the rule. The classic arcade game featured two dudes, Billy and Jimmy Lee, who walk to the right in an apocalyptic cityscape and beat-up thugs who have kidnapped their (apparently shared) girlfriend Marian. She obviously enjoys double (CENSORED). This could not and was not going to make a good movie.\n\nWith a writing team consisting of Paul Dini and Peter Gould any additions or expansions on this thin premise was welcome and the resulting movie is a live-action cartoon with way too many ideas for its budget or its director's abilities.\n\nDouble Dragon is an ex-treme-ly 90s flick. Martial arts movies for the kids became a big thing (or at least attempted to) in the early 90s after the success of Teenage Mutant Ninja Turtles. Drivel like Surf Ninjas and 3 Ninjas never managed to capture the edge that made the 1990 TMNT so good. Double Dragon almost gets there, but chooses goofy humor instead of darkness and pathos.\n\nThe year is 2007. Instead of suffering a dismal summer of an awful Die Hard sequel and a Simpsons movie with no laughs in it the people of New Angeles long for clean air and safety in the streets. The old city has been destroyed by an earthquake (another popular 90s trope) and gang roam at night while smog smothers during the day.\n\nScott Wolf and Mark Dacascos play \"twin\" brothers Jimmy and Billy. They look nothing like each other. Tom Cruise could play Scott Wolf's twin easily, but the budget couldn't stretch to Cruise. They are also supposed to be 17-years-old despite being 25 and 29 at the time of filming. They are orphans looked after by Satori (Julia Nickson) who holds one half of a sacred amulet (yes, it's one of THOSE kind of plots) which can grant super powers to anyone with both halves.\n\nA clean air industrialist (Robert Patrick) wants the amulet so he can take control of New Angeles, despite running a pretty tight monopoly already. And so the streets are raging as a final fight with a vendetta is unleashed upon the thugs of New Angeles. An overweight and blond Alyssa Milano plays a more dynamic version of Marian, wearing short shorts that barely cover her vagina. Robert Patrick manages to avoid embarrassment by being surprisingly game about the whole thing too.\n\nBy all rights the movie is terrible, but there's an infectious vibe to the eccentric production design and cinematography, and some of the matte paintings and establishing shots are quite impressive. James Yukich (his name creates an appropriate onomatopoeia) has no real vision of his own and lets the chaos take whatever shape it naturally wants to be. You either go along with the low-brow cheese that it is or you'll hate it. Personally I was never once bored by it nor did I really dislike it. The crudity of its assembly (half of the dialogue is ADR) and the tacky synth score helped turn it into a surreal, almost auteur experience. But why on Earth Yukich figured that \"Altogether Now\" by Scouse band The Farm made for a fitting end credits song is beyond me. It doesn't match the film at all!\n\nSince the day of its release and the resulting internet notoriety over the years I have always been curious about the big screen bomb of Double Dragon, but honestly it's not that bad."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "ad2020",
        "review_rating": "5",
        "review_title": "It has something decent..........",
        "review_detailed_main": "But it's still a 4/10 piece of tripe that could've been great had it been well choreographed, well written and not aimed at kids (most of the people that were fans of this series would be young adults anyhow!) It's got a PG-13, but there's no real violence, nudity or cussing!!! The only thing I thought was cool was the settings, they'll stand out in my mind, as well as Alyssa Milano and Robert Patrick. Even Mark Dacascos is OK, but he would've been a help w/ the novice fighting choreography. Not to mention the bad guy who KILLS they're mother (close enough) got arrested to be let out on bail anyhow rather than being mutilated is beyond gooey and nice to me. Get me a real martial arts movie w/ broken necks and intestines being ripped out!!"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "slshusker",
        "review_rating": "2",
        "review_title": "The more I see, the louder my laughter over the lameness",
        "review_detailed_main": "OMG this movie stinks. I only ended up watching it because the SLEUTH channel said Miami Vice was playing now. Instead, this epic is on. After 10 minutes, I thought this was some straight to video movie. Then I realized this was a really bad 90's movie. The cast completely under performs. It has to be the director's fault. The producer threw money in the toilet. No way they made their money back on this bomb. This movie should never have been made. I wonder what the budget was.\n\nRobert Patrick...bad guy/former evil Terminator - hair is worth watching the movie\n\nMark Dacascos...plays a good guy, like in all his B-movies\n\nScott Wolf ...total wimp, couldn't beat up Jello, plays martial arts dude with a hot temper. He is Ryan Secrest's twin.\n\nAlyssa Milano...cute young vixen, I don't care if she can act.\n\nIf this movie is based on the video game, I didn't notice, because of the lame plot, silly acting and again, Wolf acting tough.\n\nThrow in the occasional hottie, bad girl and this is a fun watch, if you ignore that acting. Go in with the belief that the movie is better than watching bass fishing and you'll at least have something to tell your friends about later. \"Dudes, I saw this terrible movie.\"\n\nThere has to be a way to turn this movie into a drinking game, like taking a drink every time a lame line is said. You'll kill a case of beer in 20 minutes."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "st_alphonse",
        "review_rating": "1",
        "review_title": "Hoover Ain't Got Nothing on this one",
        "review_detailed_main": "Hoover (the original inventor of the vacuum cleaner) better watch their hiney. This flick can literally suck the paint off your car.\n\nCliches stitched together by yet more cliches seems to be the order of the day. If the awful acting isn't enough to get you, the cinematography is even worse. Then there's continuity, well actually there isnt', but apparently nobody noticed and everybody goes home and lives happily ever after.\n\nI'm sure that nepotism isn't dead, but lives on in the studios where this marvelous waste of perfectly good celluloid was made.\n\nGreat movie to watch while stoned."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "bajan13k",
        "review_rating": "1",
        "review_title": "Very Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "RoboRabbit89",
        "review_rating": "7",
        "review_title": "Silly, fun and watchable.",
        "review_detailed_main": "I don't know much about the the video game, hell I've never even played it but this movie was fun to watch.\n\nI recently got this on order through the library and I love it, now I would say this film is a little corny and it doesn't take it's self too seriously and you shouldn't either just have fun with it. I remember seeing this when I was very little a lest 5 years old, when it came to TV in the 90's I'm fuzzy on it but I do remember liking it even then. Then in 2007 I seen it again when we use to have high cable, I seen it in a small category of movies along side Judgement Night (also a good one) I remember saying \"Double Dragon?\" \"Oh, yeah! I remember that movie!\" \"It's been a long time since I've seen that!\" So you can imagine I got a little excited to see it. When I viewed it I thought this fun a little corny but fun.\n\nFast forward to 2018, and I still like this movie (now onto the film). In the future, the year is 2007 and Los Angeles is a dystopia with a toxic water supply and the city is burnt out (Oh my god It already happened LOL). Mark Decoscos and Scott Wolff play the Lee brothers who are fairly good martial arts fighters but at the same-time goof balls as they are linked to a mysterious talisman which is in two haves (why is it always two haves?) one is power over the mind, the other is power over the body and spirit (as I understand it). Robert Patrick is the main baddie as I understand it he is a shadow spirit person who wants the talisman for world domination. The Lee brothers have to team up to stop him and save the word. And how can I forget the sexy Alyssa Malano, she has a fun part in this as well, she has a cyber punk look to her, sorting a blonde pixie cut which is cool and she looks great in boody shorts they fit nicely on perfectly formed ass.\n\nAs I said before a little corny but really fun and if your OK with that I think you'll enjoy it. I give it a 7/10. Definitely recommended and have fun."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "krishnadyehouse-66313",
        "review_rating": "10",
        "review_title": "Great cast",
        "review_detailed_main": "Love this movie. I think its very underrated. Look how innocent and silly it is. Good vs evil. No sex scenes or cursing. So many cute adorable cast members. All of which I still watch to this day. Especially in a time where humanity needs to be wiped out and will wipe itself out in due time. People are horrible just like in this movie. Always wanting the power and control. Very selfish everyone is. These movies help me escape to a better place in time."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "BandSAboutMovies",
        "review_rating": "7",
        "review_title": "My score improved!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "ericstevenson",
        "review_rating": "2",
        "review_title": "Well, that was awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Balto-2",
        "review_rating": "",
        "review_title": "Goofy, pointless, lame and full of bad acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "phubbs",
        "review_rating": "2",
        "review_title": "Double Dragon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "k_i_n_g_t_o_n_y",
        "review_rating": "2",
        "review_title": "I hate this, and I think that Street Fighter is \"Alright for what it is\"",
        "review_detailed_main": "The main reason that I'm writing this is because at the moment there's a comment up saying \"Fun for all ages\", and I'm worried about IMDb being sued for false advertising if it is left there. This movie is only fun if you've been smoking some particularly strange and illegal substances. I really wanted to like it, I did, and when my friend said he had a copy of this fairly rare DVD, I jumped at the chance to borrow it. I lent him DOA for a couple of days (which, far from being a good movie, IS good fun and does exactly what it says on the box - combines martial arts with attractive, scantily clad ladies). There's barely any decent martial arts in this, and that was the only thing that I was hoping for. There are gaping plot holes, awful direction and camera work, I refuse to mention quite how bad the writing is, they make one of the lead characters so incredibly annoying that I would've strangled him myself if that were possible (sorry Scott, but if I ever meet you in real life I may have to do this anyway) and it wasn't even anything like the computer game - don't get me wrong, I'm not such a fan-boy that straying from the plot of a game in it's adaptation bothers me, but the basic 2D plot of the game is infinitely better than the plot of the film.\n\nI'm probably running out of space, so I will finalise by saying that the only reason this got 2 stars from me is because Robert Patrick refuses to give up trying to act with a crap script - this man has my respect, as after five minutes even he knows how bad it is.\n\nPlease don't feel the need to see this. Seriously."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "amanfigo",
        "review_rating": "4",
        "review_title": "Movie without many resources",
        "review_detailed_main": "It seemed easier to make a movie of the video game Double Dragon that of other video games like Street Fighter or the own one Super Mario Bros, but at the end he/she didn't have good results because the movie didn't have enough economic resources and it missed the script a little more than imagination. The history of the locket Double Dragon is what moves the script of this movie. Thanks to this we see that the Lee brothers makes the same thing that in the video games, to fight against street bands. The siblings Lee is interpreted poorly by two previously unknown Mark Dacascos and Scott Wolf that certainly don't make an effort anything in interpreting them, the fight that has the siblings Lee against all the street bands would be also worthy of admiring if it was not for the horrible sound band that accompanies the whole movie. Neither tell us that Robert \" T1000 \" Patrick guessed right in interpreting Shuko. Robert tries to make a good interpretation but frankly this character was not for the, neither it is well to see to Abobo like to a secondary wicked fool that is like he is after his transformation. For my the only interesting character in the movie is that of Alyssa Milano.\n\nEven after everything, the script of Double Dragon doesn't come out much of the argument of the own video game (not how in Street Fighter) but the problem that had this film was that the script was not enough good and that neither a lot of money was invested in making this movie."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Aaron1375",
        "review_rating": "1",
        "review_title": "I think they used leftover sets from the Mario Brothers movie...",
        "review_detailed_main": "It must of been a rule in the 90's that if you made a movie based on a game, you had to make it nothing like the game! I mean, at all! If it vaguely resembles the subject matter you were fired or something! Mario Brothers featured bleak landscapes and a cast that was tipsy the entire shoot because of the awfulness of their film. Sadly, that film followed the subject matter better than this one did! I know you have to add some stuff to give the film more depth, as it cannot just be Billy and Jimmy roaming the streets beating people, but why make the film about Billy and Jimmy constantly screaming in terror like teenage girls and running!?! I mean, a car chase, a boat chase, these are things that do not fit Double Dragon.\n\nThe story, basically a convoluted plot that centers around a medallion that is referred to as the double dragon. The bad guy from the second Terminator is the bad guy here and he cannot fight and neither can Milano. I am guessing all the positive reviews of the film come from her fans, because they cannot be from fans of the game! Billy and Jimmy get wrapped up in this and they are mediocre at best fighters who run at the first sign of a strong opponent. We get the leftover vehicles from Mario Brothers and the sets as it is set in a gritty future where Vanna White and George Hamilton rule the airwaves along with Andy Dick!\n\nThe film has fighting, but the fighting sucks. They made that big dude from the game a total mutant who does not fight, like at all, just stomps his way up to people. You got a gal with a whip that gets beaten by a move that would not hurt an elderly person and you have the guy from Terminator showcasing some seriously lacking moves! Double Dragon!\n\nSo, this film sucks, if you like it, you may have a serious issue or a fan of Milano's butt. This thing made that Fist of the North Star film with Downtown Julie Brown seem totally awesome by comparison! Heck, even Street Fighter which also was not much like the game was better as we did not have the heroes constantly screaming like pansies. That is what this film should have been called, Double Pansies!"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "ImpsyTheAlmighty",
        "review_rating": "1",
        "review_title": "Possibly the worst movie ever",
        "review_detailed_main": "Okay, I'll admit I didn't watch the whole thing. But there was no way I was going to sit through it all. The acting was horrible, the plot was horrific, and nothing really made much sense at all. There was no characterization, no attempt to make the movie better in any way, shape or form. And the worst thing was how SERIOUSLY all the actors seemed to take it! But really, who could take seriously \"martial arts masters\" who just kind of push people away, or just run from them?\n\nI usually love badly-made movies, and some are bad in a funny way - like \"Plan 9 from Outer Space\" or the \"Evil Dead\" movies. But not this. It's truly, truly awful. Spare yourself and do not watch it."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "bowmanblue",
        "review_rating": "6",
        "review_title": "Not (quite) as bad as it's made out to be",
        "review_detailed_main": "The first thing you need to know is that 'Double Dragon' is based on a computer game. And, as any seasoned cinema-goer will know, any film based on a computer game is often not worth the celluloid it's made with. And, as with Streetfighter, Super Mario Bros and House of the Dead, Double Dragon is pretty bad. But not that bad\u0085 although certain conditions apply to that statement.\n\nI grew up in the eighties and played the original Double Dragon video game religiously, therefore I'm always going to look upon the film version through slightly rose-coloured spectacles. Secondly, I seem to have a mild appreciation for really 'so-bad-they're-good' films and this is so bad it's good.\n\nIt's about brothers, Billy and Jimmy Lee, growing up after some sort of great earthquake in a rebuilt Los Angeles. The police struck a deal with the gangs that no 'gang warfare' or crime will take place during the day, putting a curfew in place at night where law-abiding citizens can hide away from the hooligans who rule the streets during the dark. They find half of a magic medallion which isn't really that magic. Although it would be if the other half was found. And the other half is in the possession of the leader of the gangs – the T1000 himself with a really bad haircut – Robert Patrick.\n\nI think one of the main reasons Double Dragon is widely regarded as such a flop is because it really didn't have the budget to be anything special. It kind of comes across as a 'made-for-TV' movie and the script is pretty awful. Even Robert Patrick (normally reliable in everything he does), struggles to bring anything to his role as 'generic bad-guy.' Plus the film is rated '12' yet I think that's a little strict. I'd say the primary audience for this film is eight-year-old boys who are watching this on a Saturday morning. A film based on fighting should at least have some violence in it, however all the fight scenes are almost comical with the heroes using everything from frying pans to random object to despatch their foes. Oh, that brings me onto the foes. The gangs Billy and Jimmy fight seem to be dressed in completely different uniforms to each other. It's like watching the two boys beat up the Village People. Seriously, you have one gang member in a bowler hat and suit, one dressed as a workman, one as a postman and so on.\n\nUnless you're like me and loved the computer game, or can appreciate camp rubbish films like this, you'll have to be a young boy to get anything out of this. I've now re-watched Double Dragon and, although it killed an hour and a half of my time, the fact that the two heroes spent much of their screen time screaming (supposedly) 'comically' into the camera even started to get on my nerves. But it was fun – silly fun. Pretty bad, but I've seen worse (House of the Dead – I'm looking at you!)."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Fluke_Skywalker",
        "review_rating": "3",
        "review_title": "Not for the lactose intolerant",
        "review_detailed_main": "For 30 years now, Hollywood has been trying to adapt video games into feature length films, with very little success. Even the \"best\" ones, like 1995's \"Mortal Kombat\" and 2001's \"Lara Croft: Tomb Raider\", owe at least some of their reputation to being graded on a curve.\n\nReleased in 1994, \"Double Dragon\" is considered the second live action film based on a video game (after 1993's \"Super Mario Bros.\"). So in that sense, it's a pioneer of sorts. There was really no template for the genre... and it shows.\n\nLike so many adaptations to come, it bears little resemblance to the source material. If you've ever played a \"Double Dragon\" video game, you'd be forgiven if you watched this movie and thought \"What's this?\". \"Double Dragon\"\" it ain't. Very 90's it is. I mean VERY 90's.\n\nMark Dacascos and Scott Wolf play brothers (I don't know either), and although their acting is atrocious in the extreme, they do at least give an enthusiastic effort and that's... something. Dacoscos is an actual martial artist, and it shows. Wolf isn't a martial artist, and it shows. The attempts to hide the latter's total lack of fighting prowess are humorous.\n\nRobert Patrick flushes any shot he had a legitimate movie career down the toilet for a paycheck and gives the typical slumming it, scene chewing baddie performance. All in service of a story and script that are absolute hot garbage.\n\nSo that's the bad. The good? Well, there is some. The post-apocalyptic environment of \"New Angeles\" is probably the best character in the movie and the agenda-free tone that seeks only to entertain, even if it doesn't always accomplish this, is refreshing after a decade of message driven genre films.\n\nThere are two types of people I would recommend this movie to. Video game archeologists and 90's kids/aficionados. The rest? Game over."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Jdrappi",
        "review_rating": "9",
        "review_title": "Don't listen to the haters.",
        "review_detailed_main": "I grew up with this movie and still love it today. Don't over analyze it. Enjoy it for what it is. CHEESY 90S kids action movie. It's fun every time.\n\nI also don't know why a review needs 150 characters to post. So I will fill this part with nonsense. I love cheeseburgers."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "genronomiko",
        "review_rating": "6",
        "review_title": "Fun for all ages.",
        "review_detailed_main": "I give this movie at least a little credit, oh I know it was no masterpiece, but I think of the era this movie was made in and I think of the audience. This wasn't meant to be a gut busting, violent, beat 'em up shoot 'em up movie\u0085and to be honest I find movies that are all about the blood and gore with no real foundation to be very morbid. This is a movie that doesn't contain nudity nor does it contain violence, though there is some martial arts, that's a given\u0085this is Double Dragon! I thought the martial arts was well choreographed and not too violent. My nieces can sit down, enjoy this movie, and get a little chuckle from it just as well as my nephews and it doesn't send them into panic attacks like maybe...an overly violent movie would. It's a good baby sitting movie actually, there are the cute quirks and jokes. This movie does have foundation it does have rhythm it follows it's own original flow. It's not a chaotic movie, it's easy to follow and tells the story from beginning to end without being sporadic. It's one of those dance and jiggle movies, it's colorful, it's quirky, and it's so early 90's. If you are expecting Graphics like \"War of the Worlds\" you'll be disappointed. It is a simple and uniquely crafted story of two brothers trying to make it. Double Dragon is dynamic enough to be entertaining for folks of all ages and toned down enough so that you can sit and watch it with your kids. Over all, charming."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "ultimatenexus",
        "review_rating": "3",
        "review_title": "What a Waste",
        "review_detailed_main": "What a horrible waste of perfectly well-crafted set designs. What an even worse waste of Robert Patrick, who was menacing and even cool two years prior to this film's release with Terminator 2.\n\nCoherency and smarts are not what I look for with these types of movies. I look for something fun, something that's both enjoyable and interesting enough to hold my attention. Aside from the creative locations and punk/sci-fi atmosphere, there isn't much good I can say about this movie. The characters suck. Some of them are even obnoxious, made even more annoying by their crappy acting skills. The fights are lame, as is the story and its execution. It's too simplistic and too lazy for it to work. This movie is a monster truck that tries to do high energy on a quarter-tank of gas. The result is disastrous.\n\nIt's not the worst debut film for a new director I've ever seen, but it's close."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "MrInitialMan",
        "review_rating": "",
        "review_title": "An enjoyable turkey.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "FlashCallahan",
        "review_rating": "3",
        "review_title": "Huey, Lewis, any news?......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "MrPaull0324",
        "review_rating": "5",
        "review_title": "Cheesy, but surprisingly fun video game movie",
        "review_detailed_main": "Admit, I never played the original \"Double Dragon\" arcade game from 1987, or any of its sequels, but I know the story and that it was so influential, it was a pioneer to side-scrolling beat-em up arcade games. Apparently, someone thought this would make for a good movie. But since there wasn't enough story in the source material, the crew probably got together one night, got wasted, and came up with this.\n\nThe setting was pretty good and captured the spirit of the games. The aesthetics of cyberpunk, souped-up vehicles, seedy streets, graffiti, and city ruins felt like a combination of the barren, post-apocalyptic world of Mad Max and mixed with the crime ridden, dystopic Detroit in Robocop. The backdrops showing the ruins of New Angeles were actually decent for the most part.\n\nWhether intentional or not, the film was cheesier than a mac n' cheese pizza and can't be taken seriously. There were fast paced close-ups, zoom-in screams, corny jokes, and clumsy dialogue everywhere, but that made it oddly hilarious and charming as far as I'm concerned. Plus, the stunts and fight scenes were pretty enjoyable. I especially liked the car and boat chases.\n\nThe special effects, on the other hand, were bad. Shukos shadow effects looked crummy, especially compared to the vastly superior T-1000's liquid metal effect three years prior. Abobo's cheap looking mutant costume makes him look like a giant walking tumor. Some of the matte paintings for New Angeles scape looked unfinished or crooked like they were hastily made and set up.\n\nI found the cast of characters to be a mixed bag. Robert Patrick unquestionably gave the best performance with his hammy, over the top villainy and evil laughter, although I'm guessing he lost credibility in Hollywood because of this role. Satori didn't get enough screen time or backstory to be mourned by the audience. The Lee brothers themselves sometimes seemed more like goofy comic relief than tough martial artists. At least Jimmy was the more responsible brother and played by a legit martial artist, but Billy was an impulsive hot head who constantly screwed up and caused trouble for himself, his brother, and for Marion. Plus, in all honesty, he only defeated Koga Shuko in the finale thanks to Abobo's intervention.\n\nWhile this was still a \"so bad, it's good\" type of film, like \"Super Mario Bros.\" the year prior, you'd be better off watching Mortal Kombat from 1995 if you want a more serious and decent film adaptation for a fighting game."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "mohammedsulemanbalwar",
        "review_rating": "3",
        "review_title": "Dragon Power",
        "review_detailed_main": "Glad to saw this movie I'm so happy to know about them how they got the power of dragons\n\nDouble Dragon is 1 of my favourite game of all-time\n\nWhen I was child I played this game on the video game where I insert 1Rs coin in the game and challenge the others\n\nI learn many hits and combo hits\n\nNowadays I'm playing it on my mobile\n\nAlthough its a 90's game but still it is better than any game I had played\n\nThe Movie is not so good compare to movie but still good"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "I_Ailurophile",
        "review_rating": "5",
        "review_title": "If only it didn't try so hard to be silly and oversimplified.",
        "review_detailed_main": "Oh boy. There's a lot to take in here.\n\nMake no mistake, some parts of the craftsmanship are all too over the top, gauchely imitative, or downright questionable - John Carpenter's 'Escape from New York' is an obvious point of inspiration, as are 'Mad Max' and 'The warriors,' and who conjured the design for Robert Patrick's hair and makeup? CGI and animation feels outdated even for 1994, recalling contemporary videogames for the PC or Sega home consoles; specific special effects inspire definite skepticism; the look and feel of the picture often recalls other title from the same approximate timeframe that are in turn both imaginative and garish: 'Super Mario Bros.,' 'Theodore Rex,' 'Dick Tracy.'\n\nYet even at its worst the work behind the scenes was merely informed by decisions of the producers, and director James Yukich, and the crew involved turned in fine work regardless. Truly, the production design and art direction are pretty terrific; practical effects are well done. The costume design and hair and makeup work, though dubious at points, are nonetheless solid. The many stunts and actions sequences are superbly executed; hats off to co-star and stunt coordinator Jeff Imada for a swell job. Though not necessarily true across the board, no small amount of the original music is actually really solid and fun - and hey, what a cast! Even if only in bit parts, there are some recognizable names and faces here; not just Patrick and Imada, but Vanna White, George Hamilton, Alyssa Milano, and Michael Berryman, and it's always an especial pleasure to see Al Leong.\n\nOn the other hand, the more confounding elements of the fundamental building blocks are small fries compared to the storytelling. Both in the root story and in the subsequent screenplay, there are all too many decisions that were made that raise a quizzical eyebrow, or possibly one's hackles. Please understand, there are some genuinely fantastic ideas here in all regards - the setting and scenario, the narrative, the characters, and no few scenes. Yet in an attempt to widen the audience, and especially to appeal to a younger audience, the writers injected extra silly or even juvenile humor that borders on cartoonish. The plot is rather simplified so it could be easily parsed by the youngest of viewers, yet the writers go a step too far and reduce concepts to their most basic form. Some characters are weakly two-dimensional, but mostly not; antagonist Shuko is just blandly power-hungry. The tale introduces ideas and themes of extreme corporate malfeasance and environmental meltdown, but doesn't do anything with them; in real life the heavily militarized Los Angeles police are the real villains, but in oversimplified \"New Angeles,\" they're heroes. (A gag near the end in which the police are described as \"underfunded\" and handed enormous new funding is downright disgusting.) The narrative effectively belongs in a Saturday morning cartoon.\n\nSure, you might say it's just a ridiculous action romp, and particular criticism doesn't mean a whole lot. Yet of everything that get thrown into the movie at one time or another, what we didn't get was any honesty or authenticity. It's well made, yes, but in striving so hard to attract younger viewers, it became less enjoyable for anyone else. In boiling its ideas down, it ensured it wouldn't age well, including not just the \"copaganda\" but also passing instances of fatphobia and ableism. And between the emphasis on Youthful Fun and the action-oriented slant, there's not much for the cast to do except overact in the living cartoons that are their roles - Patrick not least. I hope they at least had a good time making it. I can see how 'Double dragon' could have been entertaining for a broader general audience. But to do that, the writers would have needed to aim higher, and not take the cheap and easy paths. As an easy example of how the film could have been improved, living anime monster Abobo gets far more time on-screen than he needs or deserves, while Shuko henchmen Huey and Lewis, played by Imada and Leong, are mostly just fleeting set pieces. Yet in the seconds before the end credits start to roll, Huey and Lewis get one last scene, and are given the best lines and the most genuine humor in the entire feature!\n\nIn my opinion this is saved from sinking lower by virtue of the hard work that went into it from behind the scenes, and those elements that are done well, including much of the visual design and the fights and stunts. It's sad and a little frustrating that the writing is so tawdry that it becomes a detraction rather than an advantage, but here we are. I'm glad for those who get more out of 'Double dragon' than I did, but when all is said and done there's no question that this belongs on the mountain of videogame adaptations that just didn't pan out. Oh well."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "BandSAboutMovies",
        "review_rating": "7",
        "review_title": "Great source material. Bad movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "amazon-comshopper",
        "review_rating": "1",
        "review_title": "Absolute dumpster fire!!!!!!!!!!!!!!!",
        "review_detailed_main": "This movie should have never been made its as bad as Super Mario Bros."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "The_Copper_Dragon",
        "review_rating": "8",
        "review_title": "Became a classic over time but I'd never count it as a Great Film.",
        "review_detailed_main": "DANIEL MANIA COMMENT #8\n\nWell fight fans I really must say that DOUBLE DRAGON was a favorite of mine. It may not have had the potential to be a great film but it is an enjoyable one. Truly, the movie becomes what the viewer makes of it. I for one consider it a must have for any fan of 80s martial arts. Even though the movie was produced in 1994, it still retains a sort of 80s feel. But all in all it is a great film to have in your Martial Arts DVD collection if you are lucky enough to find a copy. That is one of the reasons this critic considers the movie a treasure. This movie gets an 8/10 film wise but for entertainment and classic cinema it gets a 10/10.\n\n-A true must have movie for a true martial arts movie fan!!!\n\nBe sure to check for my comments on Street Fighter and Who am I?!!!!"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "lukem-52760",
        "review_rating": "7",
        "review_title": "So Much Awesome Stuff In This Fun, Silly Cheese Fest I Can't Help But Enjoy It!!!",
        "review_detailed_main": "I cannot help it I'm a fan of those 90's video game movies, i liked them all. I'm a fan of Street Fighter, Super Mario Bros, Mortal Kombat & Double Dragon. Maybe it's the 90's Nostalgia as i grew up during that wonderful era. I was born in the 80's & raised in the 90's.\n\nDouble Dragon captured the 90's beautifully with all its colourful fashion & look. I had times like the brothers did, minus the magical fantasy of course, but i wondered dangerous territories where gangs dwelled & i navigated bad areas that even police wouldn't go!!! So overall felt like i knew the world created in the movie, i even wondered like they did with my older brother, very similar.\n\nMaybe my love for 90's video game films comes from the fact i used to play those games, i really wished they made a STREETS OF RAGE movie back in the 90's as that was my favourite video game.\n\nI also love going back to a time that felt so much more fun, harmless & simply nicer. I miss the 90's, i loved the fashion, music & movies of that time & Double Dragon has it all.\n\nFirst off I'm fully aware Double Dragon is not a great film but it is a real fun one. The story is good & the fantasy futuristic & almost apocalyptic setting is very well done, one of the best I've seen actually. Los Angeles has been destroyed by earthquakes, tidal waves, pollution & crime. Vicious Street gangs have taken over the destroyed city of angels & have made a pact with the police & government, the gangs own the city at night & the regular folk have the day time. The gangs & excellent product design & sets of the ruined land reminded me of cult classic films like Escape from New York, Escape from LA, Cyborg & The Warriors. This action fantasy adventure is set in the then future of 2007, & America is a mess. Double Dragon is a relic of its time & so much fun if you want to revisit those better, more understandable times. Really a lot of thought went into creating a fully realised post apocalyptic world & its great. Although very goofy & cheesy at times i still find this fun, fantasy adventure a real good time that i like to revisit regularly. Double Dragon is a pure product of it's time, a time capsule movie of the early 90's. There's a sense of fun throughout the film & a spirit of adventure & innocence for teenagers of the 90's. I was a teenager during the 90's this type of wacky fantasy adventure flick was right up my street. I also loved Super Mario Bros the movie & Street Fighter & Mortal Kombat, i love the fantasy worlds created in those Game based movies, it's a fantasy world i like to escape into for a while when the real world sucks bad.\n\nThe production designers definitely created a very interesting & visually awesome world, up there with the futuristic settings/worlds of say, Demolition Man & Judge Dredd.\n\nThe video game brothers are two champion martial arts fighters, here played by the excellent martial arts master & action star Mark Dacascos (perfect casting) as Jimmy Lee & then there's Scott Wolf as Billy Lee (terrible, horrendous pointless casting!!!) Why they cast that dodgy looking Tom Cult Cruise lookalike is beyond me? He's Nothing like the character at all & is a very, very cheesy actor. But with that being said Scott Wolf isn't to blame really, its the childish script they all had to work with & his miscasting was the directors fault.\n\nThe bros are on the run from gangs & the evil villain of the film, Koga Shuko (a great, fun performance from the great Robert Patrick) as he wants the others half of a golden dragon medallion with mystical, ancient powers. The typical fantasy stuff that power mad movie bad guys always want but Robert Patrick makes his character a lot of fun. The dialogue & performances play it too safe though & often are very childish & too friendly. Definitely should've had a few dark action moments, but hey its a bit of fun entertainment.\n\nThere's plenty of little interesting details throughout the movie, like some people wear gas masks because of the pollution & buildings & bridges are held up with giant jacks. As said, the world building & design is excellent in this cheesy adventure fantasy.\n\nBut i enjoy the films charm, it's action & energy that keeps it going from one silly scene to the next. Yes the humour is often cringy with some dialogue that is embarrassing & the performances off everyone is often light & fun. Could've used a few darker urban scenes but i did notice that this film was probably the inspiration for The Purge films. There's countdown to a curfew & then the gangs come out & take control of the streets at night & then by dawn they go away & the police are left to clean up after their violent night of fun. Definitely a Purge feel.\n\nThe sets & costumes are often colourful as 90's video game films were & i got a nice feel of TMNT, i felt like The Shredder could pop up at any minute & take over the city.\n\nI liked Double Dragon & like the Nostalgia that comes with it as its so Early 90's in everyway possible."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Stryker-2",
        "review_rating": "4",
        "review_title": "Not good, but not as bad as the ratings make it seem",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "modius",
        "review_rating": "",
        "review_title": "Almost as bad as Van Damme's Streetfighter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "jessegehrig",
        "review_rating": "1",
        "review_title": "All your lectures have become converted into static hum",
        "review_detailed_main": "The most fascinating aspect of the human brain is memory. For instance having seen this movie, my brain did not remember what I saw. I would have to watch this piece of sh*t movie again in order to access those memories. Do you think I would go through the effort to remember? No, I would not. If you have seen The Doubled Dragoons then you know why I am never going to try to see this movie again. On a personal note, I like to thank my brain for forgetting. I don't need to remember this movie or what happens, its my gift to myself. Now, let's spend the remaining characters required for a submission talking about something pleasant like pizza. I like pepperoni, it's classic, if I could only eat one kind of pizza for the rest of my life, it's pepperoni."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "talllwoood13",
        "review_rating": "6",
        "review_title": "double disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "jimmiebre",
        "review_rating": "10",
        "review_title": "Funny for kids but not for adults",
        "review_detailed_main": "Double Dragons is a show about two brothers who inherit a medallion that has magical powers but has been split in half so a man of evil can't find both pieces. He gets a hold to one and will do anything to get his hands on the other. The brothers go through all kinds of shanagins to keep the evil man from getting his hands on their half and to get their hands on his half. Once they get it they have to find out how it works. This is harmless kid funny movie with a lot of action and even has a moral story in it that they have to work together to make it all work."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "JakeRfilmfreak",
        "review_rating": "7",
        "review_title": "Evil has just met its match.",
        "review_detailed_main": "Double Dragon is a 1994 martial arts comedy based on the video game series of the same name. It follows brothers Billy and Jimmy Lee in a post apocalyptic Los Angeles as they attempt to stop Koga Shuko from obtaining the double dragon medallion.\n\nThis movie might not have been a box office success or been well received critically, but I've always had a soft spot in my heart for this film ever since I was a kid. It's full of bad jokes, over the top characters, and doesn't have the best acting, but it's one of those movies I still like for nostalgic reasons. The fight scenes aren't the best, but they're decent, and the story isn't anything exciting, but has enough to keep things flowing.\n\nIt's just and overall fun and silly film that brings back great memories from growing up. If you're a fan of the games and haven't seen it before, I'd recommend checking it out at least once."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Slutmagic2021",
        "review_rating": "",
        "review_title": "I like it...sue me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "reddiemurf81",
        "review_rating": "6",
        "review_title": "Now who's the boss?",
        "review_detailed_main": "New Angeles is a war zone every night. Brothers Billy and Jimmy along with their adoptive guardian are just trying to get by,, when suddenly they find themselves hunted by the bad guy, who shows up with half of a medallion. The other half hangs around the neck of Billy,,, (you see where this is going)\n\nThis is obviously based off of the DOUBLE DRAGON video game,, and it does not take itself too seriously either. It's cheesy, corny, and a lot of fun."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "voshybaby",
        "review_rating": "10",
        "review_title": "No Summary.",
        "review_detailed_main": "Movie critics hold up Double Dragon (DD) as a beacon of what-not-to-do when it comes to motion pictures, but I'm going to explain exactly why they're wrong, and DD is a bastion of film-making legend.\n\nOverall: Along with a couple B-list celebrity cameos and a helluva lot of tongue- in-cheek comedy, DD delivers many a humorous scenario with lovable, over the top characters. A product of its time, an overtly obvious wit and subtle charm accompany a glorious 90's soundtrack.\n\nThe Future: While the predictions of the 1994 movie fall far short of how the future actually played out, this time capsule offers an excellent view of what would happen if LA Street Gangs got a hold of virtual-reality technology integrated into their leviathan-esque vehicles.\n\nOther: Also the portrayal of the right-wing stance on gang culture is phenomenal. Use of puns by gang members added to the realism, and therefore the viewer's immersion.\n\nDouble Dragon: The double dragon medallion is a symbol of the duality of the soul, the struggle each man and woman must cope with from the day they are born: the duality of being an invincible, unstoppable ghost; or not.\n\nCombat: The fighting style is unique and original, and many scenes require the fighters to improvise with any object they find around. For example, one scene shows a protagonist fighting an enemy with a broom, showing the person has immense versatility as a warrior. One protagonist, Annoying Italian Guy #1, is so moving with his power and speed that I would go so far as to call his fighting style \"Poetry of the Fist\". Random Asian Henchman #2's incredible ability to take multiple kicks to the face was a nice touch as well.\n\nCross-dimensional similarities: The realism between the fictional Power Corp bears striking similarities to Al Qaeda, in that they are both called terrorists at one point or another, and they are both phallic entities of almost incredulous enormity. A good amount of dialogue is puns that reference other movies and indulge in intertextuality.\n\nDialogue: The only way to describe the dialogue and punchlines in this movie, would be: brave. Seriously, these writers must need wheelbarrows to carry their 200-pound man-berries in.\n\nSFX: This movie was incredibly eye-catching from the get-go, but what kept my attention was the time that was clearly spent on the special effects. So compelling was the detail and smoothness it flowed with that I was almost moved to tears.\n\nFinal thoughts: This movie is a masterpiece - an emotional, action- packed, thought-provoking thrill ride that no self-respecting human being should miss. People will be watching, enjoying, and writing essays about this film for years to come.\n\nA+ and 10/10, would see again and recommend to friends."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Therod",
        "review_rating": "",
        "review_title": "I actually liked this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "elo-equipamentos",
        "review_rating": "6",
        "review_title": "Love or hate?? Wrong....There's many fine moments!!!",
        "review_detailed_main": "According mostly of the reviewers here simply states it as Love or Hate, neither so bad neither so good, the producers committed several mistakes indeed, they driven forces for all generation, instead to make something more seriously, thus developed the picture to please everybody, however the movie is done and has many fine moments, firstly on L.A. after earthquake has a great visual effects, all those buildings anchored by giants hydraulics jacks is fresh, mainly the Capitol records tower, the early sequence on Abobo chase truck, using advanced high technology, also the gang that confound with the graffiti on walls, even the brothers Lee with Dacascos on a great fights choreography, the sexual appealing of the heroin Marian Delario is undeniable, simply to give a 1 out 10 it's means that all it is really bad, it certainly wasn't, many haters provide with this thinking that becomes the picture criminally underrated!!!\n\nResume:\n\nFirst watch: 2019 / How many: 1 / Source: DVD / Rating: 6"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "davidmalaimo",
        "review_rating": "9",
        "review_title": "where does all the hate come from?",
        "review_detailed_main": "This movie is awesome! it's nonstop fun from start to finish. the fight scenes and action were good, the graphics were good. scott wolf and mark damascus played off of each other very well. they were sorta like shawn and gus meets sam and dean. a very silly movie with a lot of heart. my complaint would be that it was a little bit more silly than it needed to be. it honestly could have taken itself a little bit more seriously and would have been just as enjoyable. i don't know what people want out of a video game movie like Doubke Dragon. obviously mortal kombat is probably the greatest one ever made. i'm also a big fan of the super mario bros flick: another one that does not deserve the flack it gets. alyssa milano was wonderful. good movie. shame the naysayers."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "tydus_good_90",
        "review_rating": "8",
        "review_title": "I totally disagree",
        "review_detailed_main": "As my title says i totally disagree.Have you noticed that the Double Dragon Animated Series is nothing like the arcade games?I guess with the movie they were trying a different concept.So what if its not like the arcade games it's still a good movie.Just because its not like the arcade games means it sucks.Many people will enjoy this movie as i have.I don,t understand why people hate this movie because it's nothing like the arcade games.Be more exposed for god's sake learn to go with the flow.\n\nWhats wrong with the medallions,i think its cool joining them together to transform.It might be a little dorky but what the heck the animated series uses magical swords...which can talk...but at least in the movie they added some realism like no talking magical swords...so for those who thinks this movie stinks i give you a thumbs down on you.For those who haven't watched this movie go on ahead download it buy it or whatever just sit back relax and enjoy it."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "justinamans",
        "review_rating": "10",
        "review_title": "Don't let the negative reviews fool you",
        "review_detailed_main": "This movie IS a little corny. But it's a classic 90s action flick. It knows how to make fun of itself (Billy standing in front of the double dragon arcade machine? Come on), it's packed with pretty great effects for the time, all practical mind you, and it's just downright fun. If you're looking for a modern action flick, this may not be for you. If you're looking for something more along the line of Batman Forever, or STEEL, this is your jam. It's like a live action comic book or video game, which for films of this genre I have always thought worked. So get yourself a pizza, maybe even a big gulp, and kick back with a 90's classic."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "BlueSkies765",
        "review_rating": "10",
        "review_title": "Hey I loved it...",
        "review_detailed_main": "This movie is a childhood favorite of mine. I especially loved Billy played by Scott Wolf. His clumsy way of using objects around him in fights. Now looking back I still love it. I love the chaos of the movie. It's all over the place and seeings the ratings I think people didn't really like that. However for me it was the feature not the bug.\n\nThis movie simply aims to entertain. Create a world that is outrageous what better place than a movie. It doesn't get appreciated enough. Los Angeles is a dystopic 'New Angeles' with all kinds of oddities and eccentricities. It doesn't really follow a lot of the templates of successful movies but dares to experiment with corny jokes, outrageous clothes and odd but captivating settings.\n\nI'm not a believer that one era had better movies than other eras. I believe good movies get made every year, I do feel that nowadays this sort of so bad it's good on a big budget are missing. Just throwing everything on the wall and see what sticks. A lot of times it does fail but the few times it works you'll have very unique movies. From a studio standpoint I understand they are not comfortable taking these risks when the Internet came. I read that this movie tanked at the box office. So even then it was apparently not the best gamble as a lot of people simply don't like these type of movies.\n\nBesides a lot of cheesiness Double Dragon also has a big heart. The brothers and Satori felt like real family. Jimmy in red as the tall and skilled fighter. The more serious brother and Billy in blue as the more silly brother with improvisational fighting. The brothers are always looking out for each other. Very distinct and memorable personalities. As are the bad guys. In my opinion this is my favorite role of Robert Patrick after T2. Again as a menacing villain. But also his sidekicks were memorable as were all the supporting characters. I think the reason for this is because the movie dared to experiment. So the characters said more things - no matter how bad - that somehow stood out from the usual interactions you see in movies. Funny, lively and adventurous Double Dragon is a great movie."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "kirbylee70-599-526179",
        "review_rating": "8",
        "review_title": "A BLAST FROM THE PAST",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "SaintNinja",
        "review_rating": "10",
        "review_title": "I give 10, because real fans of the Video game will not judge me!",
        "review_detailed_main": "It was a major disappointment just like Street Fighter. Super Mario Brothers'93 was exception - I really loved antiutopia fairy tales with grotesque humor. I didn't care about Super Mario game, so I was satisfied with the movie. But Street Fighter and Double Dragon, man. It was arcade room cult. It could have been like Ninja Turtles 1-2-3 movies: great fight scenes, some soft horror mistery, comedy and easy sci-fi. It could have been like Ninja Surfers'93. But it was not that funny (Rob Schneider and Leslie Nielsen stole the show). Double Dragon had all the right ingridients: story, mystery, good cast, interesting futuristic sets, colourful exotic costumes. But, but, but... where are the fights? I mean, Crazy Brawls with chains and baseball bats. Bruce Lee - Chuck Norris - Jackie Chan way. They had Van Damme for the Sreet Fighter, but he didn't fight 5 minutes. They had Mark Dacascos for DD and guess what. Yes, the movie looks cool and beautiful like a bubble gum sticker from the 90s. But on the metaphysical level the paradigm of Beat'Em'Up games is missing. I would give 5, but I changed my decision after seeing the budget numbers. The budget was 7 millions. We can argue that Bloodsport'88 had less than 1 million and, nevertheless, it was real fighting masterpiece. But we must agree that 7 millions is not enough for major Video game Movie. Street Fighter'94 had 35 millions! Ninja Turtles'90 had 13 millions. I guess, they did not so bad after all, considering it was the cheapest video game adaptation. But then again Surf Ninjas'93 had 6 millions and did better in my opinion. Let it be 10 anyway: 5 is for Billy and 5 is for Jimmy."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "MovieMan312",
        "review_rating": "10",
        "review_title": "Nostalgia Galore, Endlessly Quotable",
        "review_detailed_main": "What on earth is wrong with people? This movie is meant to be ridiculous. It certainly doesn't deserve a 3.9. It's at least a 6. It's over the top and silly as hell but it's entertaining, funny, and 90's nostalgia. It brings back so many memories and has a special place in me corazon. If you're looking for something Oscar worthy or Transformers/Marvel-esq then you're simply barking up the wrong tree. This is a film based on a simply arcade game made in the 90's starring Mark Ducascus who isn't known for being a Daniel Day Lewis type actor. Its a very fun B movie that deserves a little more love."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Quantom-X",
        "review_rating": "9",
        "review_title": "Guilty pleasure for a 90's kid",
        "review_detailed_main": "I'll be honest, I can't hate or even dislike this movie. I grew up watching it, much like a lot of other \"bad movies\" from that time period but as a kid loved them. This film is one of my guilty pleasures and for a while was my favorite film as a kid. I never actually played any of the Double Dragon games, but as a movie I think it's not bad."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Leigh L.",
        "review_rating": "",
        "review_title": "Oi! Film based on arcade game! NOOOO!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "juliancrane22",
        "review_rating": "10",
        "review_title": "Buckle Up",
        "review_detailed_main": "\"This high octane action spectacular crackles with the energy and classic humor of the heroes\" This quote perfectly summarizes the film. From the camp costumes to the literally unbelievable plot this film is fun for the whole family. The brothers (of different races) produce some of the best performances ever seen, seamlessly blending amazing stunts with humor and even moving emotional scenes. With a cast comprising of Robert Patrick who takes a step up from Terminator 2 to a higher profile and more challenging role - testing his acting abilities to the max and Alyssa Milano, the film is simply spendidly well acted. The mind-blowing special effects are a sight to behold indeed. I was left flabbergasted by them.\n\nBuy it"
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "magilvilla",
        "review_rating": "",
        "review_title": "Adults May Enjoy, Kids DEFINETLY Will.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "dragon#1",
        "review_rating": "10",
        "review_title": "One of my all time favorites",
        "review_detailed_main": "Double Dragon is one of my all time favorite movies. The fight sequences are awesome. Mark Dacascos and Scott Wolf are great as the Lee brothers, but Robert Patrick is the one that stands out. His acting was superb. The one thing that I don't like is the carelessness from the crew. Besides that, this movie was excellent."
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "La-Luz",
        "review_rating": "9",
        "review_title": "Dink tune",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0106761",
        "movie_name": "Double Dragon",
        "movie_rating": "3.9",
        "review_username": "Isau",
        "review_rating": "",
        "review_title": "A well earned 1",
        "review_detailed_main": ""
    }
]