[
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "eminent-archit",
        "review_rating": "8",
        "review_title": "Movie Review - Holiday: A soldier is never off duty",
        "review_detailed_main": "Akshay Kumar is back after his last dud \"Boss\" and back with the two genres he does best, Action and Comedy.\n\n\"Holiday: A soldier is never off duty\" is an interesting take on the unexplored subject of Sleeper Cells. The plot is interesting and is executed well by the director. It is a refreshing dispatch from the usual films made on The Indian Army. The film is triggered when Captain Virat Bakshi played by Akshay Kumar, intelligently stops 12 serial blasts with his team. Thus ensues a cat and mouse game between the sleeper cell head played by Freddy Daruwala and Captain Virat Bakshi.\n\nThe music is not up to the mark and the romance between Akshay and Sonakshi gives a few light moments. The chemistry between Sumeet Raghavan and Akshay Kumar is better than that between Akshay and Sonakshi. Sumeet Raghavan gives a good performance among the cast. Freddy Daruwala as the antagonist fails to leave an impression but the film is carried beautifully by Akshay Kumar who gives a superlative performance. He throws himself into the action sequences and performs them excellently, he has spot on comic timing and also gives a restrained performance when he is needed to. The actor is in top form here. Sonakshi Sinha doesn't have much scope.\n\nOverall, \"Holiday: A soldier is never off duty\" is worth a watch for its novel concept and makes one stand and salute the Indian Army. Go Watch IT!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "nisakki9",
        "review_rating": "7",
        "review_title": "Akshay Kumar steals the show",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "doctanwani94",
        "review_rating": "8",
        "review_title": "Akshay Kumar action as usual with good story",
        "review_detailed_main": "Another hit by Akshay Kumar. the film is all about some real action and good story. Akshay has played different role in this similar to special 26 rather than his roles like boss. the movie is around a soldier who on holiday but gets on a mission to save Mumbai. A Defence intelligence agent who takes on the gang of sleeper cells without telling about his mission to his family friends as well his love ( who is Sonakshi Sinha).Akshay plays role of soldier who has courage to do anything to save his country. flawless acting with tremendous acting as usual A movie to watch with family. A complete blockbuster and in nutshell PAISAA WASOOL MOVIE"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Super Entertainer!",
        "review_detailed_main": "A remake of the 2012 Tamil film Thuppakki, 'Holiday' is A Super Entertainer, that ranks amongst the better films of 2014, yet. Its well-written & sharply executed!\n\n'Holiday' Synopsis: A military officer attempts to hunt down a terrorist gang & deactivate the sleeper cells under its command.\n\n'Holiday', despite a running-time of over a 169-minutes, never really loses pace or momentum. Sure, the romantic-track could've been shortened & even the songs could've been avoided, but other-wise, the action-sequences as well as the thrilling moments are hugely arresting.\n\n'Holiday' is sharply executed by A.R. Murugadoss, who directed the engrossing 'Ghajini, a few years back. Murugadoss's Screenplay, after a slow-start, gathers tremendous momentum & manages to hold your attention till the very end. The second-hour, especially, is top-notch! Cinematography is good. Editing is fairly done. Action-Sequences are outstanding. Music by Pritam is lovely, however, the songs act as a deterrent in the narrative.\n\nPerformance-Wise: Akshay Kumar is in top-form. He enacts the heroic solider with amazing energy. He owns the film! Sonakshi Sinha does an okay job. Freddy Daruwala is impressive as the menace. Sumeet Raghavan is first-rate. Zakir Hussain is adequate. Govinda, in a cameo, is terrific, as always.\n\nOn the whole, 'Holiday' works big time as an entertainer. Recommended!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "krishlulla",
        "review_rating": "10",
        "review_title": "A Spectacular Film! (I mean it)",
        "review_detailed_main": "Akshay Kumar is an amazing actor. His stunts are jaw breaking no doubt. But, the film hits the write notes. Sonakshi Sinha was wasted. Freddy Daruwala makes a god villain.\n\nThis is an edge of the seat thrilled that will keep you hooked right till the end!\n\nIt's just as hard to imagine \"Holiday\" without Akshay as it is to imagine last week's elegiac and thoughtful \"Citylights\" without Rajkummar Rao.\n\nThey both breathe life into their characters from different respiratory systems.\n\nWe often tend to think the grammar and language of mainstream cinema to be far easier to convey than the language of the so-called serious cinema.\n\nWrong! A full-on massy product, which doesn't resort to outlandish inanities or outright vulgarity, is the most difficult form of filmmaking. In \"Holiday\", Murugadoss has some absolutely unflinching support from his writers and technicians, all out to create that increasingly elusive cinematic entity .\n\nThe perfect entertainer.\n\nNot that \"Holiday\" is not without its flaws. What would life in the movies be without those?\n\nSonakshi Sinha's role and presence in the plot can at best be termed as comic relief. She is less diva, more Mehmood. It is interesting to see how the director weaves the romantic element into what is predominantly a rugged man-to-man confrontation between an armyman on leave and a super-intelligent terrorist, who is seen to work out not from a dingy warehouse, but a normal home teeming with the scents and images of domestic harmony."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "binducherungath",
        "review_rating": "7",
        "review_title": "Holiday, a tribute to Indian Military and their families and a subject like terrorism handled in a light-manner, is a pretty decent watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "manvirmalhi",
        "review_rating": "9",
        "review_title": "Must Watch Movie of 2014",
        "review_detailed_main": "Holiday – A Soldier story turns into a full-time action mission to save Mumbai from terror attacks. The one man army that he is, he takes it upon himself to man up and save the city from this mayhem. The whole plot of the movie is compelling and finely directed by one of the finest director Murgadoss who gave us Gajini. Akshay's stunts are jaw – dropping and he's in top form and impressively leads the show. Finally Holiday is fierce and it leaves you clutching to the edge of your seat plenty of times. The climax is a spectacle to watch.\n\nThe movie will keep you hooked to your seat till the end. Finally a role that Akshay Kumar should take up in all his forthcoming movie. Go watch, its a sure shot winner at the box office."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "ketgup83",
        "review_rating": "7",
        "review_title": "Holiday is a fine effort. Baring few scenes, it does have style and substance",
        "review_detailed_main": "Over the years Akshay Kumar's choice of selecting the films has completely deteriorated with classic insignificant examples being BLUE, Once Upon in Mumbai Dobara, Joker , Khiladi 786 to name few. Fortunately, Holiday will throw a pleasant surprise to you and a big relief for Akshay Kumar's fan.\n\nWhile on a vacation , an army officer witnesses a bomb explosion killing innocent children, he investigates the brutal killing which leads to uncovering of a plan by a terrorist and his sleeper cells to blow up the entire city of Mumbai.\n\nDirected by A.R. Murugadoss, whose previous work included Ghajni, Holiday is a remake of Tamil Hit \"Thupakki\" directed by Murugadoss himself. Holiday takes some time to build upon you as the opening scenes, romantic track, forced comedy will bore and irritate you. The film gains some steam as Akshay Kumar gets involved into the investigation and the cat-mouse begins. From here onward there is no turning back as the movie gives you nice twist-n-turns with well- choreographed action scenes. The scene where Akshay involves 11 members including him to track the terrorist hovering in different parts of the city, the scene where Akshay Kumar rescues the girls and climax scenes has been well executed. On the flip side, the unnecessary inclusion of the songs, amateurish acting by Sonakshi Sinhi will put you off. Screenplay is decent but could have better, editing could be more crispy. Art direction and cinematography is average. Background score gels well with the mood of the film. None of the songs were good. Dialogues are fine. It is Akshay Kumar all the way. A thumbs up to him for doing something different from his usual masala potboilers. It is high time Sonakshi Sinha to choose a meaningful role. She is just repeating herself in every film.\n\nOverall, Holiday is a fine effort. Baring few scenes, it does have style and substance. Good 3/5\n\nhttps://www.facebook.com/FilmyChowk"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "akkumaralok1988",
        "review_rating": "10",
        "review_title": "Great flick",
        "review_detailed_main": "Holiday delivers thrilling scenes with relish and energy. It is a slick Action thriller that keeps you engrossed, enthralled and captivated all through, thanks to its fascinating premise and a watertight, sharp Screenplay. Holiday' is one film that will be liked by both the masses and the classes equally. It's sheer brilliance. It's fierce and it leaves you clutching to the edge of your seat plenty of times. The absorbing pace of the movie, the intelligent thinking of the proceedings, and Akshay Kumar gratuitous action sequences wins the show. Holiday is mostly a delectable film. This is Akshay Kumar's most engaging entertainer in recent times."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "Braindead09",
        "review_rating": "7",
        "review_title": "Another good one from India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "milend-tangent",
        "review_rating": "9",
        "review_title": "#Holiday Another Supehit from Akshay Kumar",
        "review_detailed_main": "From a Akshay Kumar flick you expect action, comedy, romance, thrills and the movie as promised. As Capt. Virat Bakshi, he challenges the sleeper cell network hidden in the city, while romancing his lady love Saiba (Sonakshi Sinah) and placing everything including his family at stake. A movie dedicated to all our country's soldiers and their sacrifices, this movie unlike any other throws light on terrorism and the selfless act in any soldier.\n\nSongs have catchy tunes by Pritam and location of songs are very fresh.\n\nThe movie is a definite must watch and make sure you have a tub of popcorn for every tantalizing twist the movie offers!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "dibeyendu",
        "review_rating": "7",
        "review_title": "Fast paced film",
        "review_detailed_main": "The film manages to hold on to its fast pace, even as it swings back and forth from Akshay Kumar's romance with Sonakshi to his fight with a gang of terrorists. To the script's credit the romance bits are never boring, thanks in part to Govinda in a rather unexpected guest appearance. Where I would fault the script is in it's treatment of the villain, as played by Farhad (real name: Freddy Daruwala). Here's a villain who is better looking and more charismatic than the hero and he's built up as a very sharp and intelligent guy. But then, he gets all brawny in the end and the intelligence vanishes. Which goes with advice given to Sonakshi by her soon-to-be-married girlfriend in the film: \"Men who are good looking are not seldom intelligent. The intelligent men are seldom good looking. So if you find one who is both good looking and intelligent, grab him.\""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "kooleshwar",
        "review_rating": "4",
        "review_title": "Standard Bollywood Paycheck Affair.",
        "review_detailed_main": "The team behind Holiday supposedly had a \"vision\" before they started on the movie and it can be described in vivid detail as PAYCHECK......hmmmmm paycheck....\n\nSo how does Bollywood encash its cheque??!! Switch on any Hindi movie channel, watch dubbed south Indian movies for 1 week.\n\nNote down the names of a few of the movies you saw and feel will sell.\n\nContact director/writer of said film.\n\nEither he will agree to remake it in Hindi, or you can buy the rights and ask another desperate (and hopefully less talented) team to do it.\n\nFinding an actor for a remake used to be a problem, but thanks to blessings of the greats like Aamir, Salman that's no longer the case.\n\nActresses are even easier, either you take sonakshi, or put out an ad for a south Indian actress who wants to make it in Bollywood.\n\nEverything else is just a formality, a few songs, 1 or 2 from honey/ mika singh if you can afford it, some cool stunts, a few overacted scenes involving love, family ,loyalty to country/village/city/house/boss.\n\nBeing a remake by the original South Indian team technically the movie is upto standards but neither excels or fails in any department.\n\nComplaining about trivialities like script, cast, stereotypes isn't prudent when you know what your getting into.\n\nSo lets get to highlights.\n\nThe timing was perfect after the IPL before the Football world-cup with no major releases and a bankable cast.\n\nYour never completely suicidal at any time, at the lowest point you will wallow in self pity and shame for giving into boredom/helplessness and taking the effort to watch such a movie.\n\nIf your reading this review now, the drought has passed, the football world-cup is on, a few entertaining low budget movies are in the theatres, just wait till the movie is released on TV.\n\nDo the right thing and don't encourage such ordinary cinema unless you absolutely have to.\n\n-s script, dialogues, epic scenes bordering on ridiculous, poor songs.\n\n+/-s Sonakshi (love her hate her.....), Southern Formula (love it...hate it...), Secular terrorists (sic).\n\n+s standard technical values, Akshays Panache and Charisma."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "suryak_mail",
        "review_rating": "7",
        "review_title": "akshay done great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "b-kodinaria",
        "review_rating": "8",
        "review_title": "dedicated to Indian army",
        "review_detailed_main": "Akshay kumar had won heart of Indian as he played a positive role of Indian army... very nice movie.. if songs are nice then i might give 10 instead of 8\n\nin Hollywood we watched many movies of U.S. army and we like it... but watching this movie in Hollywood we feel proud\n\nalso some comedy to entertain a lot and hope akshay kumar will continue making this type of SUPER HIT movies...\n\nand what to say about sonakshi..she always rocks\n\ndon't miss this movie to watch in theater and now Indian army will go too high ,kyu ki abki baar MODI sarkar"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Yet another South Remake but not really bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "roshni-tangent",
        "review_rating": "8",
        "review_title": "Another hit from Akshay Kumar And Sonakshi Sinha",
        "review_detailed_main": "With his usual dose of action comedy, Akshay Kumar strikes the right chord with 'Holiday: A Soldier is never off duty.' A story of a military DIA agent who makes it his mission to save the city from a cancerous threat of sleeper cells, Captain Virat Bakshi (Akshay Kumar) is a fearless, tactical and has a plan behind every step he takes. Smitten by the bold and beautiful Saiba (Sonakshi Sinha), Capt. Virat knows how to woe his lady love while saving the city.\n\nAR Murugadoss created another gem of a movie after Ghajini\n\nWatch Holiday for some sleek action sequences, awesome dialogues and groovy tunes!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "saytosandeep",
        "review_rating": "7",
        "review_title": "MY REVIEW: Thrilling Holidays!!",
        "review_detailed_main": "Holiday: A Soldier is Never off Duty. Akshay Kumar after a long time gets a meaty role where he is doing bone crunching action more than jaw breaking comedy. Captain Virat played effortlessly by Akshay is home on his holidays but finds himself at the center of a serial blasts scheme by a terrorist group. He takes the matter into his own hands and runs a one man army from start till end.\n\nMovie works pretty well whenever it sticks to its central plot. Action scenes are very well cut and thrills embedded with firing dialogues makes it an interesting watch. What works in favor of the movie is the linear screenplay with not confusion around who is who. Sonakshi Sinha does well in her mandatory heroine role. Govinda in a listless cameo falls flat and seems totally out of the place in otherwise well knit story. Songs also do not help and interrupt in the thrilling fun. Songs and Govinda episode convert a two hours worth thrilling story into a two hours and fifty minutes entertainer. Sumeet Raghvan as Akshay's dumb friend is good and evokes few light moments during thrills. Despite its evident flaws Holiday is consistently watchable because of Akshay Kumar. Confrontation scene in climax between Akshay and his counterpart played by Freddy Daruwala does satisfying end to growing tension.\n\nI am going with strong 7 out of 10 for Holiday. After a long time you can enjoy Askhay doing what he does best."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "Tu suspense mein maar.... One of Akshay's best acts, and Brilliant ACTION/THRILL!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "rajatdahiyax",
        "review_rating": "7",
        "review_title": "Movie had moments of awesomeness,rest of the movie was just OK!!!",
        "review_detailed_main": "Holiday: A Soldier Is Never Off Duty is a 2014 Indian Action thriller film, war drama film written and directed by A.R. Murugadoss, and produced by Vipul Shah. It features Akshay Kumar and Sonakshi Sinha in the lead roles, along with Govinda, Freddy Daruwala and Sumeet Raghavan in supporting roles. It is a remake of the 2012 Tamil film Thuppakki which was also directed by A. R. Murugadoss.\n\nOn a break from active duty, Captain Virat Bakshi (Akshay Kumar) finds himself up against the mastermind (Daruwala) of a terrorist outfit, who is busily planting 'sleeper cells' through the country to be activated when the time is ripe. So, we have Virat careering around Mumbai, leading his men into hair-brained ambushes in which people are dispatched speedily. It's all very wild West and vigilante. he only job of the leading lady (Sonakshi Sinha), who wears boxing gloves-and-tight-shorts in one scene and a flowing dress in another, and pulled out only when the plot remembers that it needs a song- and-dance."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "sanjay_sadanand",
        "review_rating": "9",
        "review_title": "Akshay Kumar Gonna Rock the Box Office",
        "review_detailed_main": "Holiday is a complete Bollywood movie package. Dedicated to all the soldiers at the border, the movie packs in action, comedy, romance and thrills right to the end. Although there have been many movies that have focused on terrorism but Murugadoss showcases how one soldier can make a pivotal difference.\n\nMovie also give a positive message that \"where there is will, there is a way\"\n\nWith some awesome comedy timings, Akshay Kumar gives the movie the essential turn it requires at every mode. Holiday is definitely a captivating, and exciting watch to look out for!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "MovieIQTest",
        "review_rating": "",
        "review_title": "one of the worst films even",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "achyutaghosh",
        "review_rating": "7",
        "review_title": "illogical but who cares, it is a one time watch",
        "review_detailed_main": "Holiday- A soldier is never off dutyyyyyyyyy\u0085\u0085yawn\n\nTo be fair, I did not have very high expectations from a movie that has a name that induces yawns. Plus the lead pair's previous outings still give me the shivers- Joker, Rowdy Rathore, and after all director AR Murgadoss is the master of on screen verbosity. The last point comes to bite back an otherwise watchable effort.\n\nBased on the Tamil hit, Thuppaki, Akshay plays Virat Bakshi, a defense intelligence agent who is on leave visiting his parents, who in turn have only one achievement left in life- to get their son married. But as the title says, a soldier is never off duty. He quickly latches on to a master terrorist plan that involves 12 simultaneous bomb blasts across Mumbai. Typical of South Indian movies, there is a regressive love triangle involving him, Sonakshi Sinha and Govinda. She indulges in her brainless bimbette routine- loves slapping her father, indulges in all the sports we do not expect her to, and does not think much about dating bald men. Govinda, the natural comic, in the few scenes that he is in, brings the smile back.\n\nThe movie though is all about Akshay, the all in one package- combining the deductive abilities of Sherlock, the daring of Jason Bourne and the vigilante spirit of the Batman, jumping rooftops, kidnapping, torturing and killing terrorists at will. Being a defense intelligence agent gives you the right to do that? No.\n\nBut then it is an out an out mas-ala flick, with kind of comic book silliness, there is no question of logic. The good part is though that Holiday does not take itself too seriously. Dedicated to the men who protect our borders, there are enough action sequences to balance out the boring songs. Notwithstanding age, the fact that Akshay is still India's top action star shows in the stunt-work.\n\nIs Holiday Akshay Kumar's finest film in recent times? Not really- that title belongs to Special Chabbis. But is it the finest character he has played, as he has claimed? Maybe, since this is a dream role for a star- basically a superhero in army fatigues, kind of like the Dark Knight, but with the license to kill. This character shouts for sequels :)\n\nMade for the masses- 7/10"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "ShishirAdmane",
        "review_rating": "5",
        "review_title": "timepass",
        "review_detailed_main": "Its a timepass movie. nothing great to write about. watched for Akshay. Going with 5/10"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "iampavan",
        "review_rating": "7",
        "review_title": "Mission save Mumbai from terror attack",
        "review_detailed_main": "Hodiday is a story of a ARMY officer which save Mumbai from a terror attack, Viral Bakshi (Akshay kumar) amazing character which during holiday help to Mumbai police with friends. Terrorist choose 11 point in Mumbai to bomb blast and akshay and team took responsibility to finish this mission. Every team member took a single Point and control the attack and save Mumbai. This is the amazing movie for that person who loves country. Akshay kumar shown as a master mind if I say about overall the movie same ARMY force should be in each county only then we can live safe. I request to everyone watch this movie and hit on screens."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "jijuvarkey",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "iampavan-95274",
        "review_rating": "7",
        "review_title": "Anti terror",
        "review_detailed_main": "I really feel happy to see akshay kumar in a ARMY officer dress, it's totally suit on kumar. Holiday is a mission against terror attack in Mumbai, Virat Bakshi(Akshay kumar) is a ARMY officer, he helped to Mumbai police diffuse a terror attack with his colleagues. They find out 11 points for bomb blast in Mumbai akshay and team each person took a place to diffuse bomb. And they successfully diffuse bombs and killed tarriest. Virat is a master mind in this movie. And Akshay kumar work is amazing excellent job. Evey country should have army like this and we got a message by this movie, army is always on duty. I request to everyone watch it and hit it on the screens."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "akash-everblue-mishra",
        "review_rating": "10",
        "review_title": "Powerpack performance by Khiladi Kumar",
        "review_detailed_main": "Well I am a huge fan of Akshay. My review may seem to be biased towards him but no one can deny that this was a complete Khiladi show.\n\nI won't say it is his best performance but it is as per expectations.\n\nMovie has a nice plot with all the ingredients like comedy, thrill and awesome stunts and action (not South Indian action). Akshay is veteran player when it comes to action and did a brilliant job as an army officer. Good to see Govinda after a long time although he just made a special appearance but made an impact.\n\nSonakshi was good too. Freddie did a great job but couldn't match Akki's persona.\n\nEven though movie's runtime is 170min but you won't get bored at all. Story hooks you all the time. Overall its a complete entertainer not too be missed."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "babairimo",
        "review_rating": "10",
        "review_title": "Holiday Makes BOOM BOOM in B.O.",
        "review_detailed_main": "A smashing all time Blockbuster Movie! Another movie that brought Akshay Kumar's acting to be praised even by the Critics. Taran Adarsh Rated the Movie 4/5!! Though IMDb Rating is varying since the last day it was 8.4/10. Still the movie is doing well in box office! 1st day collection was little low from the expectation of 20Cr. It was only 12.78 Cr. But the movie picked up very well in Saturday and early estimate says it has collected more than last day in between a range of 12-15 Cr. Sunday expectations are very high & the movie would collect its Best Earning today only! Occupancy Rate in North West is Houseful & Almost full. In the East Zone its average. Some where houseful by pre-booking and somewhere 70% full. Night Shows will decide how much the movie will gross in its weekend! Hopefully results comes out in good numbers! Akshay Kumar's Acting is Outstanding in this film. The tracks are very nice. Komal Mehta thinks Holiday will be a huge success because of the +ve word of mouth! In total its Super Duper BlockBuster MOVIE #Holiday #TeamAkshay"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "dsingh-vns",
        "review_rating": "10",
        "review_title": "deserve to be watched at least one time in theaters",
        "review_detailed_main": "This one is one of the best of AKSHAY's movies. This is not a typical Akshay Kumar movie. This has no overacting no out of mind action sequences. Story will keep you stick to your seat till the end. Brilliant acting by AK. And also it is motivational one. Songs could have reduced in numbers. But Still pace of story is fast. One would not regret watching it. It is nice one to watch it with family too. Don not miss it. Go and enjoy it. Sonakshi had little to do again. Difference between the Thinking of Police and army has been tried to be conveyed. Direction is very good and is another good one from Murgadoss. Cinematography is also very fine."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "nadkarnisumeet",
        "review_rating": "4",
        "review_title": "Akshay shines in a south remake!!",
        "review_detailed_main": "Holiday review:\n\nDirector Murugadoss reintroduced south action remakes in Hindi with Ghajini (2008). Since then, we have had an onslaught of star driven south actioners made with only 100 cr business in mind. Holiday is one such type. Considerable time is spent on the mandatory love angle diluting the thrills and realism of the plot. While Akshay Kumar deserves credit for defying age and looking fit as an army man, he needs to reinvent himself fast. Such repetitive masala fare may sell. Question is : for how long?\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "amietebiswa",
        "review_rating": "10",
        "review_title": "Power packed Action Thriller",
        "review_detailed_main": "\"This is the real action\". These are the words which will come to your mind when you watch this flick.\n\nThis is the first time ever in Bollywood that a movie has such genuine action sequences.\n\nDirection of A.R. Murugadoss is brilliant.The cinematography is excellent.The story of the movie is fantastic.Action scenes are amazing and well executed. Thanks to Gregg Powell for his hard work.\n\nAkshay Kumar is brilliant as an Actor. One can't imagine this movie without Akshay Kumar and he steals the show. Akshay Kumar is as fit as ever. He looks like a true army man. Here Akshay Kumar proves his versatility again as an actor. He is the man of words and true MEGA STAR. Man of masses. Akshay rocks in every action sequences and here his hard work is seen. Akshay is the True Action Star.\n\nThe songs are cool while the song \" aaj dil shayarana\" is very good and the song \"Ashq na ho\" being the best with awesome lyrics which is dedicated to the Indian Army & is heart touching.\n\nThis movie is a real dedication to the Indian ARMY. This flick shows how the army men fight against terrorism on the border and inside the country and how hard work they do by leaving their families far away, doing their duties in extreme danger zones. A SALUTE TO THE Indian ARMY.\n\nOn a whole, \"Holiday - A Soldier is never off duty\" is a SOLID ENTERTAINER and A MUST WATCH MOVIE.This is one of the best movie in Bollywood.\n\nSeriously, this movie should be TAX FREE.\n\nFinal Verdict - Don't miss this one !"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "ahwaan_padhee",
        "review_rating": "8",
        "review_title": "Holiday : Movie Review",
        "review_detailed_main": "Remake of the 2012 Tamil super-hit-Thupakki,Holiday has the essential trappings of a commercial potboiler. An interesting premise, lots of action, drama and patriotism -all in abundance. Director A R Murugadoss(Ghajini fame) who also directed the original, shifts his sensibilities to Bollywood and teams up with the ace team of Vipul Shah/Akshay Kumar(who also co-produced the movie)to deliver the rock- solid punch, so much in reverence of the Indian Army.\n\nHoliday inhabits the space that we are flagrantly aware of - the terrorist outfits and the massive havoc they caused in the latest times. It dabbles with 'Sleeper cells' who are the terrorists guised as common men and so much identifiable with the crowd, and insinuates the presence of danger at every step. Now, here is the plot.Capt.Virat Bakshi(Akshay Kumar) who is on a holiday break to meet his family in Mumbai, unearths a sinister plan of a terror outfit after witnessing a bomb-blast in a bus in the heart of the city. Virat, who is also a covert intelligence operative, creates a 12-men army ( as a nod to the film's tag-line, A Soldier is never off duty)with his fellow squadron mates who track down different terrorists set out to implant bombs at different parts of the city and shoot them point-blank. This act of valor agitates the head of the terror group in terrifying proportions and he comes out of his closet to seek vengeance, thus heralding a cat-and-mouse game.\n\nBrimming with testosterone-charged stunt sequences and impressive prod- designs, the screenplay is compelling and keeps you engaged in the mind games of the hero-villain. Murugadoss bases his story on terrorism , yet steers clearly out of unnecessary blood, gore and violence. While an intelligent audience may react with acute strictures at some of the loopholes in the plot, you need to have a suspension of disbelief and approach with a entertainment viewpoint. The narrative suffers occasional lapses with gratuitous song sequences which dilute the underlying tension including a manipulatively staged farewell ode to our army men.This may irk the discerning viewer, but leaves most of us moist-eyed.\n\nAkshay Kumar is in superb form and he literally carries the enterprise on his shoulders. He looks dashing, fits into the uniform and character with consummate ease and takes the action-n-stunts to the next level.Sonakshi has a wonderful comic timing and she complements Akshay in every frame, but sadly her character doesn't cross tracks with the main plot. Sumit Raghavan is endearing as Akshay's friend and his natural performance leaves you in complete awe. Newcomer Farhad(Freddy Daruwala) comes off as a rather wooden antagonist, failing to evoke menacing fear. Cast in a cameo as Akshay's senior, Govinda makes a comeback and his goofy act does provide avenue for occasional laughs.\n\nCombining the sheer energy of Akshay Kumar and sharp intellect of Murugadoss, Holiday guarantees wholesome entertainment and offers full paisa-vasool moments. Not to be missed by action aficionados and Akshay Kumar fans. Take your family along and have a great time !"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "iamrani",
        "review_rating": "10",
        "review_title": "Holiday is an excellent movie in every possible way. Must watch for those who love and appreciate sensible Cinema.",
        "review_detailed_main": "Holiday is one of the best movies I have watched in recent times. Movie is perfect in every department, story , direction, acting, action and emotion.\n\nAkshay Kumar is in excellent form and his portrayal of Captain Virat Bakshi is flawless. This is by far Akshay Kumar's best movie since Special 26.\n\nSonakshi is also a delight to watch. She brings in some light moments in the movie.\n\nThe new antagonist Freddy Daruwala acts like a pro; it doesn't seem like this was his first movie. Also Sumit Raghwan is wonderful as Akshay Kumar's friend. Surprising, he has more screen time than Sonakshi and Freddy and he does full justice to his screen presence.\n\nMust watch for everyone who appreciates sensible cinema and loves his country!!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "kumar-neelesh1996",
        "review_rating": "10",
        "review_title": "HOLIDAY:- A SOLDIER IS NEVER OFF DUTY is a must watch!",
        "review_detailed_main": "HOLIDAY, A.R Murugadoss's second venture in Bollywood is the remake of Tamil film THUPAKKI. Actually, the production of HOLIDAY was started much before THUPAKKI but due to some reasons the film got delayed.\n\nHOLIDAY is the story of Virat Bakshi(Akshay Kumar) whose mission is to deactivate(watch the movie then say what deactivate means here) the sleeper cells! This movie has been promoted as a Romantic Comedy Thriller because that's what Indian audience likes otherwise this could have been an another MADRAS CAFE, which was somewhat similar like this meant only for the classes. Well wait guys, HOLIDAY is a movie which everyone can watch. From masses to classes. Guess what, Audience in the multiplex cheered up for the every positive twist during the film. RAJA SEN, rediff's renown critic has given this movie 1.5 stars. Don't listen to him guys, he is simply a useless critic who gets paid for giving 5 stars to DEDH ISHQIYA and 3 stars to TASHAN. Anyways, who listens to a critic( I never did. )\n\nPERFORMANCES:- There is a scene in one of the many best scenes in the movie in which Virat captures a sleeper cell. That scene is tremendous! Applause from everywhere was heard! HOLIDAY is Akshay Kumar's one of the best film till date. He is flawless. Every time he smiles, you smile! Sonakshi Sinha was a mere showpiece but still she was necessary for the light moments. Same for Govinda. Sumeet Raghavan has also done a good job playing the character of police officer Mukund. A special mention to the debutant Farhad, he is seriously CRIMINAL. What a talent!\n\nMUSIC:- It's Okay. The best song is Ashq Na ho. Its emotionally heart touching music and lyrics left everyone teary-eyed.\n\nSCREENPLAY AND DIRECTION:- A.R Murugadoss, his second bollywood film after Ghajini, has done a tremendous job. He is top notch. Screenplay is so smooth that it will keep you hooked onto your seat till the end!\n\nHOLIDAY:- A SOLDIER IS NEVER OFF-DUTY is one of the best Indian films which deserves an applause for the message. The film is completely flawless. If the story is flawed, guys just remember the closing scene, everything will be fine! HIGHLY RECOMMENDED!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "AnotherMovieFreak",
        "review_rating": "3",
        "review_title": "Trashy Overacted Movie",
        "review_detailed_main": "MOvie Review: HOLIDAY: 1.75/5 Over acting, over acting and overacting.......Never expected such Rubbish Film From A. Murgadoss after Gajini....Akshay kumar again overacted as usual....If u r a masala movie lover then u can watch it.....ACTion sequences are good.....only action Sequences....mind it...Akshay's dialouges and dances ....are so overly done.....Sonakshi a showpiece.....Govinda a...n unnecessary addition....No storyline, bad editing, worst screenplay and dialouges...Music choreography and cinematography score below 1.5.....The guy playing negative role was definitely good..he acted well.....other than that....nothing was awesummm.....\n\nA movie u can easily avoid......And the worst part...climax was so abrupt and irritating.......that I was about to die.....the other thing i liked was the idea of Killing without giving it a second thought....juss boom and its done....\n\nGo at your own risk,...."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "reachme_rahul88",
        "review_rating": "10",
        "review_title": "Refreshing Akshay",
        "review_detailed_main": "First thing first this movie belongs to Akshay Kumar and A.R.Murgdoss. Akshay is in top form in this movie, which reminds why he had wasted his screen time in some of his previous movies. Action and pace of the movie are its soul & heart.This is a complete entertainer to its core.\n\nAkshay has tremendous potential as an actor & performer wonder why some of the big directors don't work with him,I mean one can see his body of work of late he has mostly worked with new-comers and all those movies had exploited his brand and harmed his star value. 'HOLIDAY' is a GEM one can expect from a bollywood action drama.\n\nLastly movie dedicates a beautiful song \"Ashq Na ho\" to Indian Army & soldiers which subtly pays tribute to one's who stake their life for the nation.\n\n'Holiday' is a must watch, highly recommended & it has a repeat value for its well choreographed action sequence. GO WATCH IT !!!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "aamirkhokhar",
        "review_rating": "10",
        "review_title": "Holiday is 1 of the Best \"THRILLER\" film made in Bollywood, A MUST WATCH FILM",
        "review_detailed_main": "So many films come with ordinary stories. which we have seen so many times. Example Salman Khan's Films, South Style Masala films, but here comes the film with a Fully New Story about Sleeper Cells which teaches u that how 26/11 and Mumbai attacks were happen, and I'm sure no one Knows that what sleeper cells are, So watch this Film Fast, go to theater near u, because films like that not come easily, Performances : Performances are Excellent by everyone, be it The Villain (Freddy Daruwala)This is His Debut Film and He has Just Rocked in His Very 1st Film, Be it Lead Heroine (Sonakshi Sinha) Be it Supporting Cast (Sumeet Raghavan)(Dipendra Sharma) all are OutStanding, and Then the Best of All by Miles obviously the Lead Hero (Akshay Kumar)who plays a Patriotic Person Captain Virat Bakshi and Secret Agent DIA, plays the Role Amazingly,Brilliantly,Outstanding,and so easily, that u will can't imagine the role Without Him, Honestly he Deserves National Award for it. Music : Shaayrana is Very Good and Last Ashq Na Ho will make u cry in the End, others are JUST OK, Background Music : Superb, On The Whole : It is Gripping, Nail Biting, and FAST-PACED, that will keep u Hooked till the End, So What r U Waiting For, Go to Theatre near u, Bcz it is not the film to watch on TV. it has Twists and Turns that will keep u on the Edge of Your Seat. DON'T MISS IT. GO NOW"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "rahuljonathan-nair",
        "review_rating": "9",
        "review_title": "A slick thriller that will keep you engaged and enthralled!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "raheelirkal007",
        "review_rating": "10",
        "review_title": "A Spectacular Film!",
        "review_detailed_main": "Excellent movie do watch it , i loved it don't think much just the play buttons , best acting best story best action to good :)\n\nSongs have catchy tunes by Pritam and location of songs are very fresh.\n\nThe movie is a definite must watch and make sure you have a tub of popcorn for every tantalizing twist the movie offers!.\n\nMovie has a nice plot with all the ingredients like comedy, thrill and awesome stunts and action (not South Indian action). Akshay is veteran player when it comes to action and did a brilliant job as an army officer. Good to see Govinda after a long time although he just made a special appearance but made an impact.\n\nSonakshi was good too. Freddie did a great job but couldn't match Akki's persona.\n\nEven though movie's runtime is 170min but you won't get bored at all. Story hooks you all the time. Overall its a complete entertainer not too be missed."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "shiraj-dakshy",
        "review_rating": "4",
        "review_title": "Holiday: Nothing to Cheer about this Holiday\u0085.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "mundeparth",
        "review_rating": "9",
        "review_title": "One of the Finest Remake Made ..",
        "review_detailed_main": "Holiday Movie Is a Remake Of Tamil Movie Thuppaki. But the movie is still Good and Very Good for Hindi Audience . Thalapathy Vijay Had his Style In His movie But the best Part In holiday was That Akshay Kumar didn't Try to act Like Thalapathy ,he had his own style.\n\nThe Movie Has A good thriller element . Acting Performance are Good Except Sonakshi Who had Nothing to do With main Story of the movie.\n\nThuppaki Is Dubbed Very badly in Hindi so Hindi Audience have this choice to watch And Enjoy .\n\nThe movie Is Just Awesome ."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "sks290895",
        "review_rating": "9",
        "review_title": "One time.. must watch for every Indian.",
        "review_detailed_main": "'Holiday'is much more than just a movie. The director's goal to remind us of the sacrifices that our soldiers do everyday, staying far away from their families. Whether its scorching 48° C in the Thar desert or brain-freezing -20° C in the Siachin valley. Carrying weapons weighing 7- 10 Kgs and eatables weighing 20 Kgs all the time. Without fearing that any second could be their last. The movie, at places, reminds us these things effectively. The Plot is really good. Except some goofs (the biggest one being the entire role of Sonakshi) the movie is really great. Background music is amazing. Loved two songs - Shayarana & Ashq na ho. Overall a sure shot paisa vasool."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "ppssakthi",
        "review_rating": "10",
        "review_title": "Thanks to Director A.R.Murugadoss..Don't miss it..",
        "review_detailed_main": "Holiday-\"A soldier is never off duty\" which is the remake of Tamil blockbuster Hit film of 2012 \"Thuppakki\" director by AR Murugadoss.Re-creates the same movie in Hindi for Bollywood as his second movie with Akshay Kumar after the blockbuster \"Ghajani\".\n\nstory: He challenges the sleeper cell network hidden in the city, while romancing his lady love Saiba (Sonakshi Sinah) and placing everything including his family at stake. A movie dedicated to all our country's soldiers and their sacrifices, this movie unlike any other throws light on terrorism and the selfless act in any soldier. Action, Romance, Suspense, Trilling, all are excellent in the Story.\n\nDon't miss it, you will be enjoying starting to ending the movie. Akshay Kumar flick you expect action, comedy, romance, thrills in the movie but Could not reach Vijay action in Tamil Version. Sonakshi Sinha doing good her roll and Music no impact in Hindi version."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "vsagarkvn",
        "review_rating": "9",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "nairtejas",
        "review_rating": "3",
        "review_title": "Mindless References Everywhere! ♦ 26%",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "smartboy-shubh",
        "review_rating": "10",
        "review_title": "A fine entertainer.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "sharmaa-15414",
        "review_rating": "10",
        "review_title": "Extraordinary Performance.",
        "review_detailed_main": "When it's an Akshay kumar movie you don't need worry about content. This movie is a remake but it's better than the original one."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "bhajgovindam",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "From my side hats off to Akshay Kumar and A.R Murugados for creating such overwhelming movie on patriotism. It not only contains serious tinge but it also filled with humour. Seeing Govinda after long time in comic role is good. The story line is great and I don't think it can be pictured in any other good way.M movie is a family movie as usual as Akshay's style a must watch movie I can bet u can't fell bored at instant of time. This movie will realise you that you are the sole representative and protector of your country if you won't come forward to save then no one cares fir it. I have now started finding better movies through www.flickstree.com. It not only suggests great movies to watch, it also tells where you can watch the movie online... Highly recommended"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "maiunuddinriad",
        "review_rating": "10",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "replytoswap-497-403762",
        "review_rating": "4",
        "review_title": "kya chutiyapa hai ??",
        "review_detailed_main": "The subject of the review appropriately defines the whole movie. The writer/director/producer it seems are underestimating the intellectuality of the common man.\n\nIts like a curry with all spices but none able to fully satiate you.\n\nSonakshi Sinha's appearance in the movie can best be described as a guest appearance and nothing more. every time she appears on the screen, its a clue to the audience that a song is to follow, of course its untimely and forcibly stuffed in between as if to complete one of the formalities for making an Indian Movie.\n\nNot to mention that the producers have played a cruel joke on the Mumbai Police as well and demonstrated them in poor light portraying them as inept and a bunch of fools when they might just be the opposite.\n\nThere are so many loopholes in the whole movie that once you step out of the movie on the Indian roads, the Indian roads will feel smoother than this movie.\n\nOnly if the songs and the cheeky humor could be cut out. the movie could be worth a shot.\n\nThe only saving grace in the movie is Akshay Kumar. If you are a die hard fan of Akshay do watch the movie else give it a miss."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "rahulsinghk-97894",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "arupghose",
        "review_rating": "8",
        "review_title": "Akshay back to his best, backed with a solid script",
        "review_detailed_main": "I've not been a die hard fan of Akshay Kumar but I've loved some of his serious roles like Special Chabbis, however he doesn't do enough films like that. Yes he is very good at comedy, so Holiday is a film right down his alley - funny, action and romance.\n\nHoliday is a very well scripted and put together film. It's of course not crack free, but Akshay's performance manages to pave over most of them. I love the way the film leads up to the final scenes, with a lot of well built up drama, but the let down at certain times was due to the comic aspect of the script which sometimes took over too many scenes.\n\nAkshay Kumar is effortless in his role, and I hope to see more roles like this in the future for him. His romance with Sonakshi is natural, his comic timing is perfect and his role as an Army Officer is played excellently. Unfortunately for him, Sonakshi Sinha is a major let down. Her performances all feel the same - Rowdy Rathore, Bullett Raja, R...Rajkumar and I doubt it will change any time soon. Her role adds no depth to the film, and whilst her chemistry with Akshay is fine, she needs to challenge herself far more. Newcome Freddy Daruwala is very good in a negative role and I hope to see him a little more in the future but he needs to work more on his expressions. Govinda is no more than okay.\n\nThe music of the film does help, but some of the songs are stuck into the film for no reason at times. The film is an Akshay film through and through so watch it for him. AR Murugadoss has put together a neat film, which will certainly make you feel a lot of respect for the world our Indian army do."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "ghazwan124",
        "review_rating": "10",
        "review_title": "very very good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "jamalahamadn",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "The storyline unfolds with a captivating blend of mystery and drama, introducing us to a world filled with complex characters and unforeseen twists. Without divulging spoilers, The film's visual allure is evident through its impeccable cinematography and striking visual effects. From breathtaking landscapes to intense action sequences, the visual elements enhance the storytelling, making it a feast for the eyes. The director's creative vision is well-translated onto the screen, adding a layer of visual richness to the overall cinematic experience.\n\nVery nice movie to watch with family. Nice...."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "Didn't know 'Keep the logic at home' was a rule to be followed while watching a thriller too talking about a serious issue of terrorism.",
        "review_detailed_main": "Offering another remake, both Akshay Kumar and his director A.R. Murugadoss return after a long gap with HOLIDAY, which is the official Hindi version of the south hit THUPPAKI (2012) directed by Murugadoss only.\n\nWith an engaging plot talking about a serious issue of terrorism, the film certainly had something unusual to offer but as always here too the interesting premises becomes pale as the film progresses further due to all additional routine elements incorporated vaguely and logic taken for a ride quite surprisingly. In fact, I was really shocked looking at the big liberties taken by the writer-director in a script revolving around responsible military men, bomb blasts, sleeper cells and terrorism, to say the least.\n\nOpening with a typical 25 minutes focusing only on the romance and a song, HOLIDAY makes it first major impression with a well shot bomb blast sequence and some good twists coming after 40 odd minutes. Though, many of the big steps taken by Akshay playing the military man do raise some valid logical questions in your mind as you are watching. Still the film does manage to make a decent impact on the viewer as it reaches the midpoint. However the impression gets lost somewhere in the long length post intermission and the film eventually turns into a below average fair only in the end, defying all logics.\n\nIn short, HOLIDAY could have been a much better film based on a very enlightening plot revealing the unheard secret of 'sleeper cells', if only it had kept its main focus on the core subject and looked into some logic too before portraying military men as just brutal killers not caring about any kind of law prevailing in the country. For instance, HOLIDAY would have been something highly engrossing, If the love angle was not there, interrupting the tension every half an hour with a song.\n\nIf the POLICE was also given some respect and the Sub Inspector was at least shown to be a smart policeman contributing in the investigations and not just a dumb person.\n\nIf all the other members of Akshay's team were also given some importance post the initial killing sequence and not simply ignored mercilessly in the film's second half.\n\nIf Akshay (the military man), was shown tackling the issue with some clever tricks and not just 'take out the gun and shoot attitude' without caring about any Law or the legal consequences. (Particularly the way, Akshay gives a gun to everyone in his team (brought from God knows where), always brings home the arrested culprit somehow and then goes on killing them all who could become a vital information source for the secret service and the police.)\n\nIf the director could have cast someone else as the main villain, because Farhad frankly doesn't bring in that terror as Vidyut Jammval did in the original. And this remains one of the weakest features of the movie arguably.\n\nIf the writer-director could have spared some deep thoughts on the investigations shown in this so called crime thriller! Like it was really silly for a sub-inspector and a military man picking up a marriage album from a murder scene with their bare hands (reaching first)\u0085\u0085\u0085.the album which has been touched by the murderer himself just a few minutes back. The main villain finding them all by just the reference of 'Suit-Coats' Or a police dog going straight into the hideout where the terrorists have taken the girls, looking like a typical Bollywood insertion.\n\nIf the editors could have shortened the film by at least 20-25 minutes, sparing us the pain of watching almost three hours of an average content.\n\nAnd if the subject of 'Sleeper Cells' was tackled more responsibly, spreading the awareness among the people, as there can always be another of those residing just around us posing as a reputed citizen.\n\nComing back to where I started, actually the problem lies in the main motive of earning some quick bucks at the box office only which forces the makers to go on adding many unrequired sub-plots, glamour, romance, action and songs into an otherwise decent project talking about something extremely serious.\n\nAdding to its positives, the film has got the looks of a biggie, with some fine actions sequences shot well, along with a racy background score providing a good support. But adding to the downers it has a pretty ordinary soundtrack composed by Pritam, who is known for churning out hits in his every film.\n\nAmong the performers, no doubt it's Akshay Kumar's film all the way and he does come up with a fine impressive act posing the military man (though his actions remain unconvincing throughout). Sonakshi Sinha as usual plays the glamour doll and has got nothing else to do in the film, once again. Sumeet Raghavan enacts his part well, despite having a disrespectful character of a sub-inspector. Farhad couldn't en-cash the big opportunity given and Zakir Hussain remains wasted in just a few scenes. But the one actor who does bring some smiles on your faces is the one and only Govinda, making a sweet cameo as Akshay's senior.\n\nIn all, you can watch HOLIDAY for its novel (but lost in translation) subject of sleeper cells portrayed well only in the first half. But don't search for any logic behind all the killings made by a military man just like that. As a matter of fact HOLIDAY strongly made me realize that the famous rule of 'Keep your thinking minds at homes' is now applicable on our Hindi Thrillers too and not only confined to just Comedies.\n\nPlus it once again gave me the thought that what kind of creative satisfaction a director gets by directing the same film again, frame to frame in a different language repeatedly?"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "pramodranpariya",
        "review_rating": "10",
        "review_title": "Deserve Holiday is Excellent 10 out of 10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "indianature",
        "review_rating": "10",
        "review_title": "Very Good Movie, Well Done Akshay! This Is A Must Watch",
        "review_detailed_main": "I watched this movie on a flight today. It was gripping and I was rivetted till the end.\n\nAfter the unwatchable Boss which Akshay Kumar ought to be ashamed of, I started watching Holiday thinking that I could instantly move to some other movie if this one was bad. I was pleasantly surprised that it turned out to be interesting right from the beginning.\n\nHoliday has its humorous moments but it is by no means a comedy, rather a very well made movie on a serious subject that leaves you heavy hearted at the end.\n\nThis film is a fitting tribute to what our soldiers and security forces have to go through, it may be dramatised but the message is conveyed effectively in a gripping manner.\n\nThe plot was good, the theme was good, everyone acted well. I recommend this movie as a must watch for all. Akshay Kumar has redeemed himself with Holiday."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "Harshithnagraj",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "What is liked the most in this movie is it's based on sleeper cell of terrorism. And it's executed well in this film and what I disliked is poor chemistry between sonakshi and Akshay and story line is good. Music is average but movie is excellent. So you can give a try."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "eklavya-cwk",
        "review_rating": "9",
        "review_title": "Holiday is normal, unique and entertaining enrichment",
        "review_detailed_main": "A special congrats to the director from writing and making such a movie. Unique, comic, entertaining, finely-worked, romantic, insightful, tribute, feel-good, nicely dialogued, nicely-written typical melodrama which is completely out of the box.\n\nAssuming it to be akshay kumar and sonakshi sinha in another dumb flop comedy moving pictures on screen is common but incorrect ,here. The dialogues are finely worked and written, the concept is completely new though story line is typical and melodramatic but considering it to be a comic movie I don't mind.\n\nSome points were extremely logical, insightful and thought provoking and were speciality of this movie to make it an enriching experience. No doubt its not a technically good movie but yes its a good movie. I am waiting for the poster to be uploaded!!"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "Mr-baadr",
        "review_rating": "1",
        "review_title": "Poor-skilled acting + Islamophobic",
        "review_detailed_main": "I had no other plans and I was too lazy to leave my seat, so I watched the film until the end.\n\nThe acting was poor-skilled/ childish mostly. The story was shallow and really boring. I did not think that the film was a good interpretation to the Indian culture.\n\nI was surprised that this film was the first Indian film I watch in the UK. I cannot see what is the reason that this one, apart from all the great Indian films, was the one that is available to watch.\n\nI also thought that the film was Islamophobic. Although they stated clearly that the terrorist actions are not linked to any religion, the terrorist actors were bearded, typical Muslim looks, and given Arabian names \"such as Ali\".\n\nI am not satisfied that I spent my money on this film. The only good thing about it was the dancing scene, I thought that was cool to watch."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "amitmardi-02904",
        "review_rating": "10",
        "review_title": "A good watch.",
        "review_detailed_main": "Perfect family entertainment. Watch it. Akshay Kumar as great."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "adhikari-shaswat",
        "review_rating": "10",
        "review_title": "Best Movie Ever Seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "silensss",
        "review_rating": "9",
        "review_title": "Job Well Done!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "dahiyapriyanshu",
        "review_rating": "10",
        "review_title": "Just phenomenal.",
        "review_detailed_main": "Awesome acting by Akshay kumar . This movie did a great job by showing the dedication of Indian army towards India. Great story. Director's work is praiseworthy."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "dineshprakash",
        "review_rating": "4",
        "review_title": "Just a time pass",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "akumbhar",
        "review_rating": "9",
        "review_title": "Super thrill",
        "review_detailed_main": "Back to Akshay this film Really appreciate a r mudguards . How to work sleeper cells ? Watch"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "sa_a",
        "review_rating": "8",
        "review_title": "Recommended",
        "review_detailed_main": "'Holiday' a soldier is never off duty- 2014 Director: A.R. Murugadoss Akshay plays Jack Bauer, Sherlock Holmes, Spiderman and Jason Bourne all rolled into one. He is probably one of the best action stars Bollywood has seen reminds us why he is on the highest point of load. Akshay has faced criticism many times for the selection of movies he does but this time am sure people loved him watching in Holiday as Military Agent. The film is all about some real action, suspense and off course a little Thank You to the Military of the respective country. The Director has come up with stirring story-line, action fully packed, sharp editing and masterly cinematography. Sonakshi Sinha looks pretty and sexy wherever required. Govinda gave many laughs. Same goes with Sumeet Raghavan. Freddy Daruwala was perfect as the baddie. Aackruti Nagpal looks hot. The others did their bit as required. A.R Murgadoss directed and he has exquisitely tackled with every scene. Music by Pritam and Background scores are prodigious. RECOMMENDED"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "manjushergill",
        "review_rating": "10",
        "review_title": "Ultimate movie",
        "review_detailed_main": "The holiday movie is the ultimate cinematic experience, a genre that transcends time and cultural boundaries, bringing joy and warmth to audiences worldwide. Whether it's a heartwarming classic or a contemporary gem, these films weave tales of love, family, and the spirit of the season, making them cherished traditions for many.\n\nAt the heart of every great holiday movie is a narrative that captures the essence of the festive period. Themes of love and connection are often interwoven with the magic of the season, creating a tapestry of emotions that resonate with viewers. Take, for instance, timeless classics like \"It's a Wonderful Life\" or \"A Christmas Carol,\" where the protagonists undergo transformative journeys, learning the true meaning of Christmas and the importance of human connections.\n\nIn the realm of holiday comedies, films like \"Elf\" or \"Home Alone\" bring laughter and merriment, offering a delightful escape from reality. These movies often feature quirky characters navigating the challenges of the season, infusing humor into the festivities. The joy derived from these films is infectious, as audiences find themselves caught up in the whimsical antics and comedic escapades of the characters.\n\nMoreover, the cinematography and set design of holiday movies play a pivotal role in creating a magical atmosphere. Snow-covered landscapes, twinkling lights, and festive decorations transport viewers to a winter wonderland, evoking a sense of nostalgia and wonder. Directors skillfully utilize visual elements to enhance the holiday spirit, making the movie-watching experience a visually enchanting one.\n\nThe soundtrack of a holiday movie is another crucial component that elevates the viewing experience. Iconic tunes like \"Jingle Bells,\" \"White Christmas,\" or \"All I Want for Christmas Is You\" become synonymous with the season, creating a melodic backdrop that enhances the emotional resonance of the narrative. A well-curated soundtrack has the power to evoke nostalgia and stir the festive spirit within the audience."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "rushu007",
        "review_rating": "10",
        "review_title": "best movie after 3idiots & namstey London",
        "review_detailed_main": "i watched this movie 2 times in theater.. its mind blowing movie..hates of to a.r.murgodous.. such a classic movie.. and what about akshay kumar???? once again he prove that he can do any type role very easily.. i love the action scene of the movie... sonakshi sinha also impressive.. what a debut by freddy.. music also very nice..govinda in cameo done nice job. aperfect movie for akshay kumar fans... but i think all the type of people will love this movie... but its akshay kumar all the way... i personally want holiday 2.. and i will give this movie 10 out of 10.. my best movie after like of 3idiots & namstey London.."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "arnavgoswami",
        "review_rating": "3",
        "review_title": "These sleeper cells will put you to sleep",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "sedhodesai",
        "review_rating": "10",
        "review_title": "Best",
        "review_detailed_main": "A best entertenmet movie it will worth your timeit is good comedy action trilar"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "dantesachin",
        "review_rating": "9",
        "review_title": "Bahot badhiyan movie hai!",
        "review_detailed_main": "1 point Sonakshi Sinha ki 3rd class acting ki waje se kaata hoon overall mast movie hai, Akshay Kumar's acting bhaisaab 🙌"
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "anupampathak",
        "review_rating": "10",
        "review_title": "Excellent Movie to Rejuvenate the Soldiers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "iamrrv",
        "review_rating": "8",
        "review_title": "One of best action Thriller",
        "review_detailed_main": "Terrific storyline and thrill. There is thrill in almost every second scene. This film has all masala love romance comedy action suspense."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "superk9199",
        "review_rating": "5",
        "review_title": "The Main Problem with Holiday",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "knarinder-67761",
        "review_rating": "5",
        "review_title": "Average movie",
        "review_detailed_main": "Movie Holiday a Soldier was a 2014 Indian action thriller film written and directed by A. R. Murugadoss, and produced by Vipul Shah. It features Akshay Kumar and Sonakshi Sinha in the lead roles, along with Farhad as the antagonist in his Bollywood debut and Govinda in a amazing way. It was a remake of Murugados own acclaimed Tamil film like Thuppakki. Moreover the songs featured in the film holiday were composed by Pritam. Additional songs featured in the audio were composed by Kaushik. The lyrics were written by Irshad was very different for the songs featured in the film. Sukumar Dutta wrote the lyrics for Kaushik Dutta and compositions which were featured in the audio .the song Ashq Na Ho was a very nice song of this movie.at the end i think it was a good experience. I rated this movie with 5 stars as average movie."
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "ali-azgar46",
        "review_rating": "",
        "review_title": "Holiday.... Holiday 2 (yet another call for duty)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2556308",
        "movie_name": "Holiday",
        "movie_rating": "7.2",
        "review_username": "kevinmkraft-371-970996",
        "review_rating": "",
        "review_title": "Could have been great, but...",
        "review_detailed_main": ""
    }
]