[
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "creative_sohini",
        "review_rating": "6",
        "review_title": "Stylish & Slick",
        "review_detailed_main": "Don 2, the sequel to Don starts from where the prequel ended.Though the story is surreal, impractical and seems like fantasy, the director gives it a slick treatment.It doesn't let go, even for a moment. The plot is stylishly crafted,with every twist and turn falling into place. Farhan Akhtar yet again proves that he is the most stylish film maker of recent times. The first half may seem cold in comparison with the 2nd, as the 2nd half takes the film onto a different level and keeps you on the edge of the seats.The script will mostly appeal to the urban crowd who are absolutely hooked onto international thrillers. The twists and turns in the 2nd hour may not be totally understandable to the average viewer.\n\nAction is the USP of Farhan Akhtar's film. The chases, the fights, the destructions, escapes were spectacular and have all been done at par with International Standards.The car chase between Priyanka and Shah Rukh was unbelievable.The cinematography was top notch, be it the indoor or the outdoor shots. The locations in Berlin, Zurich, Malaysia & Thailand, where it was shot completely came alive. The stylization & look for every actor was so well defined.\n\nShah Rukh Khan uses all his charisma & attitude and woos the audience with his charm. He is the the lifeline of the movie.And this is definitely amongst his best works till date. Priyanka Chopra, Boman Irani,Om Puri, Sahil Shroff, Kunal Kapoor, Alyy Khan & Nawab Shah were very very good in their respective parts. Lara Dutta looks glamorous but has nothing else to do.Shah Rukh Khan & Priyanka Chopra's chemistry for those 5 minutes was crackling.\n\nLike a spot on the moon, the cameo by Hrithik Roshan was unnecessary & forced. Hrithik looked awesome but playing Shah Rukh's masked avatar was totally bizarre. As their height, voice and body do not share any damn similarity.\n\nWhat makes Don 2 a winner is,the public cheers every time a task is accomplished by Don. This is indeed credible because Don, after all, is a negative character.\n\nSpecial mention is the last scene where Shah Rukh Khan rides a bike and passes on a bridge over the French Riveira, Oh My God-he has never looked so handsome before. All will definitely skip a heart beat. Don 2 ends with the promise of Don 3. Mr.Akhtar-we are waiting."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ghoshi-kol",
        "review_rating": "6",
        "review_title": "Mind Blowing action, Farhan's strong control on script and Powerpacked performance from SRK. Truly the \"KING IS BACK\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "surojitsamanta09",
        "review_rating": "8",
        "review_title": "Don 2 is the movie to watch.",
        "review_detailed_main": "Don 2 was an amazing movie. Great acting by Shahrukh Khan probably one of his best acting. A well directed movie my Farhan Akhtar. The dialogs were great. The storyline was sometimes predictable but at the end it totally changes. It was a slick movie. When I watched the movie I thought I was watching a Hollywood movie. Shahrukh Khan is the only actor who can play Don cause he has that style the charisma and everything that u need in an underworld king who wants to be the king of Europe. Boman Irani plays the role of Vardhan really well. I think they should make Don 3 with a different location and with even better storyline. From my side i would give 7/10."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Fella_shibby",
        "review_rating": "9",
        "review_title": "One of the best action movie from Bollywood. U cannot imagine anyone else portraying Don except SRK.",
        "review_detailed_main": "I first saw this in Gaiety, Bandra, when it first released in Dec 2011. Saw this with my dad and entire family, first day first show.\n\nThe theatre was jam packed n the crowds went berserk, clapping n whistling.\n\nI don't know why my earlier review got deleted.\n\nWriting this again aft revisiting few days back.\n\nThe movie is a direct sequel to Don (2006) and the story takes place 5 years after the events of the previous film.\n\nThe opening sequence is loaded with action n SRK gave a solid performance. He looked cool with his long hair.\n\nThe movie has ample amount of action, the locations r amazing, the direction n editing top notch.\n\nThe hand to hand combat n the fight with the villain Jabbar is amazeballs.\n\nJabbar is an intimidating villain.\n\nHeard they are planning part 3 without SRK.\n\nWill probably skip part 3."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ilpintl",
        "review_rating": "6",
        "review_title": "Bang! Crash!! Kaboom!!! - that's \"Don 2\"...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "manasgoswami60",
        "review_rating": "10",
        "review_title": "What a Movie",
        "review_detailed_main": "Great movie seen in Bollywood as action, thrill, story line, direction, suspense all along. overall Power-packed performance by Shahrukh Khan. Truly the \"KING IS BACK\". People said that no-one could make a better Don than the man himself, Amitabh Bachchan. However, I would like to disagree. Shahrukh is the only actor of todays time that could ever make it better than the original. His style, charisma and witty remarks make it all the more appealing. Farhan Akhtar's superb directing made this film epic! There are no gaps, no over-the-top parts. As a director Farhan's best film ever. Film's background score is stunning. But the songs are not pretty good. The film's visual effects is better than MI-4, Ra.One, Robot, Krissh. It's stunning and well shot. The special effects add a special flavor to the film which makes it even more delicious. Each and every character in this film is perfect. But in some portion it remembers me Death Race2, specially in Jail. Anyway best movie of the year."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "HollowScar",
        "review_rating": "6",
        "review_title": "Not a true following to the first Don.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "XxMaverickxX",
        "review_rating": "10",
        "review_title": "Farhan Akhtar has raised the bar for future sequels and action thrillers. Great performance by Shahrukh in the best Indian sequel so far!",
        "review_detailed_main": "In 2006, Sanjay Gadhvi made a sequel to the 2004 hit 'Dhoom' which was appreciated by most, but Rohit Shetty's sequel to 'Golmaal' faced mixed reviews. However, Rajkumar Hirani got it compeletely right with the Munna Bhai sequel, which was the perfect sequel to the first film. So it can be said that the record hasn't been all that great.. but it has certainly got better now!\n\nFarhan Akhtar's Don 2 is a sequel to his 2006 movie Don, a remake of the 70s Amitabh film. However, the story was sufficiently different and the twists in the tale left viewers gasping for more. Five years later, Farhan Akhtar has returned in an attempt to fulfill the enormous expectations on this sequel. I can say that my expectations were not only met but surpassed by a considerable distance!\n\nThe story is strong and pretty special considering what we have previously seen from the Hindi film industry, but you wouldn't expect anything less from Farhan Akhtar. After conquering the Asian underworld, Don sets his eyes on Europe. Thrills are what you expect and thrills are what you get!\n\nThe makers have clearly gone to town here as the level of authenticity and realism is extraordinary, especially considering that there are quite a few formulaic Hindi films released every year that fail to differ hugely from films that have come out of India before them. This is certainly one of those films that possess their own distinct identities.\n\nThe performances are great. Shahrukh excels as Don and everything about his character is just awe-inspiring. I think this role is comparable with some of his best performances. Meanwhile, Priyanka Chopra too excels and Om Puri shows why he is regarded as a good actor. Boman Irani is impeccable as Vardhaan and Nawwab Shah is a revelation - watch out for him! Kunal Kapoor handles his role with ease, and is another one too look out for. The character development is superb.\n\nThe dialogues are really good. They fit in and serve their purpose in a variety of situations.\n\nThe songs of this film are not really the commercial type, but they fit in well in the various situations throughout the film. With this in mind, Shankar-Ehsaan-Loy have done a solid job with the music. The background score is great.Those who expect romantic music will be disappointed.\n\nThe action sequences have been finely executed and do fit into the narrative very nicely. They really do add to the overall experience.\n\nOverall, this is a sequel that is far superior to the first film. As an action thriller with world-class action, top notch performances and a western feel, this presents further proof that Hollywood has some serious competition. It's a gem of a film from Farhan Akhtar, who I regard as one of the top 5 best directors in India today. With Shahrukh delivering a great performance, this film will not disappoint fans of his and action enthusiasts. One of the best films (not just from India) of 2011! A must watch!!\n\n9.5/10."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kat_777",
        "review_rating": "6",
        "review_title": "Not up to the expectations...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "brainstew89",
        "review_rating": "4",
        "review_title": "Starts off well, seems like the story would get somewhere. Alas, it doesn't!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "the_dark_knight171",
        "review_rating": "10",
        "review_title": "A stylish movie with none other than the King of Cinema, Shahrukh Khan.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Oceans Eleven + MI 2 yet better then DON 1",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "MeshTheMovieFreak",
        "review_rating": "4",
        "review_title": "Farhan Akhtar obsession of the west.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "amanirani52",
        "review_rating": "10",
        "review_title": "best action film by Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vivek-Don771",
        "review_rating": "6",
        "review_title": "Don 2 is a watchable fare.......and a treat 4 SRK fans",
        "review_detailed_main": "Saw Don 2 today morning at a Terrific theater atmosphere........even after reserving the tickets,we had a tough time entering the theater........\n\nNow coming to the movie,Don 2 is a fast paced thriller that lies entirely on SRK and Farhan,what makes it a watchable thriller is SRK's energetic performance,Looks and Charisma and Farhan's direction.\n\nMovie doesn't have much Story to offer.It starts off from where the first part ends......Don returns to Malaysia where he eventually surrenders to Interpol officers Roma and Malik.From there he goes to the jail to see his arch enemy Vardhan(villain in the 1st part)where he has set new plans for a robbery and then the film deals with the execution of the robbery and of course there are some twists and turns here and there....\n\nShahrukh as the villainous hero Don is the main highlight of the film.He portrays the role with ease.His looks and action scenes were top notch.His entry look was simply superb.I really liked the way he delivers the good one liners.The film entirely lies on his shoulders.Cant imagine any other person to do this role.(maybe AB.....he did it in 1978,But now there is no chance for him too)\n\nPriyanka Chopra did her job very well....looked good in the movie.....but a bit boring in the 2nd half....didn't have much role when compared to the 1st part.Final song sequence was not needed though Boman Irani as Vardhan did what he was told too....not too outstanding and not too bad...... Kunal kapoor,Lara dutta and the Others did what was demanded.....not much to do though.......Hritik Roshan's Cameo was not very needed but it doesn't cause any harm to the film also....Like I said earlier,Its an SRK film and its SRK all the way overshadowing all the other others with his performance\n\nFarhan Akthar who is known for trend setters like Dil chahta hai ,Lakshya returns to direction after 5 years with Don 2......He lives up to the expectations to a certain extent,His writing deserves a special mention.I loved the dialogues.But on the Whole,The movie could have been better.screenplay should have been more tight and romance of Don with Roma could have been removed from the film.......\n\nThe main drawback of the film is the lack of thrilling moments we expect from a thriller.Apart from a chase sequence in the first half,Ther are not many scenes to thrill.In the 2nd half,plot becomes predictable........and twists became very weak......we feel that we have seen it all somewhere....and that is where the movie fails.....\n\nMusic is also another drawback....yet i liked the track Zara dil ko tham lo from the movie....which i didn't like earlier.......Background score is awesome though.....\n\nWell I would rate Don 2 as a watchable fare which could have been better.....SRK fans might love it......and In the box office,Don 2 is sure to set he cash registers ringing........Farhan should focus more on the story and screenplay if he plans for a DON 3........"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mathew-james555",
        "review_rating": "8",
        "review_title": "good one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vs_acharya",
        "review_rating": "7",
        "review_title": "Pure cinematic entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mu_amir",
        "review_rating": "10",
        "review_title": "With Don 2 Shahrukh back again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sarkaramrit2",
        "review_rating": "6",
        "review_title": "Not As Good As We think of IT !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "shalaka_shank",
        "review_rating": "5",
        "review_title": "Don 2 is down 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "murtaza_mma",
        "review_rating": "8",
        "review_title": "A Potpourri of Vestiges Review: SRK rules the rooster in Don 2, much to the delight of Action and Heist enthusiasts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "adigairola",
        "review_rating": "7",
        "review_title": "amazing movie with amazing stunts",
        "review_detailed_main": "appreciate the work of don2 team that they made such a great movie,it was amazing although,not even a single moment was there where i felt it was boring ,when watched it first time .when u watch this movie ,u won't even look at your watch. yah! i agree that storyline is predictable and quite simple as we have seen many Hollywood movies but dude it's movie of bolly, positive points - srk's acting was tremendous ,stunts are amazing and direction is lovable,boman and others were superb too negative points - storyline, priyanka chopra's poor acting overall movie is no doubt 2011 best movie ,throughly enjoyed it ,i dn't know why people hates this kind of movies, if are that good please make movies like this thanks srk and farhan akhtar"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "arci_tops",
        "review_rating": "4",
        "review_title": "This so called don is king of Asian underworld.. but he doesn't have have a gang of his own..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sidharth-banerjee25",
        "review_rating": "10",
        "review_title": "Shah Rukh Does It Again :D :D",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "gauravb8",
        "review_rating": "6",
        "review_title": "lack of originality restraints it from being a great film.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "maithani-gaurav",
        "review_rating": "8",
        "review_title": "At last .....THE KING ARISES........n unconquerable !!! KUDOS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pkt_kumar511",
        "review_rating": "7",
        "review_title": "All hail the king!! He is back with much more to give this time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "azza_mis",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "I will keep my review short and clear. If you think Bollywood is still a low quality movie industry, think again. Don 2 can be compared to hit Hollywood movies like Ocean's 11, Ocean 12, Ocean 13, Mission Impossible 1,2, and 3..and by far, Don 2 beats all of these movies because it is unique in the little twists in the story. The movie can please both guys and girls...because the fact that it is an action movie with the sexiest ladies (Lara Dutta, and Priyanka Chopra) can be enough pleasing for guys, but combine that with the bad, handsome, charming, mean Don (Shah Rukh Khan) every girl will definitely love the movie. Although the movie is no-less of perfect quality than any new Hollywood movie, yet still maintains the Bollywood phenomenon of Music and Dance. The music of Don 2 is of great combination between hard rock, classical, and Pop with a twist of Hindi instruments. Take the time and watch \"Don 2\" and I assure you, it is a great watch."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "a_2",
        "review_rating": "",
        "review_title": "Beware: Not a Farhan Akhtar Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "Farhan Akhtar could have made it better !!!",
        "review_detailed_main": "Don 2 was a decent action flick which can be watched once only if you are a die-hard fan of Sharukh Khan. It is best enjoyed if you would not have much expectations. The sequel starts off where it was left in the first part. Don surrenders himself to the police only to plan a bank robbery and capture the European market after conquering the Asian underworld. After a debacle called RA.ONE , Sharukh Khan finally had made some effort to make sure his fans stays loyal to him. The sequel is much more stylish with well executed action sequences and amazing cinematography. Farhan Akhtar is much more better in handling urban centric flicks rather than directing the action movies. Like Don , Don 2 falls flat in terms of direction and screenplay. The movie is entertaining in the first half but fizzles out in the 2nd half. The bank robbery scenes could have executed efficiently. It was not explained clearly why Priyanka Chopra had a change of heart after Don started assisting her in the hostage rescue operation. Similarly, the bank robbery was shown as a piece of cake. Despite its shortcomings, the movie entertains from the beginning with stylish car chases , nice fight sequences especially in the climax and decent performances. The music is a big disappointment considering it was given the Shankar-Eshan-Loy. As I mentioned , the cinematography was eye-catching capturing the picturesque view of different parts of world. So , overall , I thought it was decent thriller with nothing new to offer. You will watch it and forget it. Above average – 2.5 /5"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kim999",
        "review_rating": "5",
        "review_title": "Below Expectations but had some good points, could and should have been a lot better!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Nevil_93-176-518532",
        "review_rating": "9",
        "review_title": "Brilliant SRK comeback. Watch even if you're not a fan of SRK.",
        "review_detailed_main": "This movie was beautifully produced for a Bollywood movie. I even suspect that it can be listed with the all time greats such as Mission Impossible. The action sequences are brilliant and not overdone (which is rare for Bollywood). The story is extremely amazing and there are a few twists and turns that I was not expecting at all. The movie is very suspenseful, yet it grabbed my attention. I was in the theater and I don't think that there was one person in there who was not screaming! From Don's entry all the way to the romantic dialogues, this is a much watch film for Bollywood lovers. To keep it short and to the point: SRK was brilliant (as he is most of the time, but the villainous role was brilliantly done), Priyanka was quite good (even though she wasn't in the movie that much), and Boman Irani and the person who played Jabbar were quite good as well. Acting: 9/10, Screenplay: 10/10, Dialogues: 9/10, and overall: 9/10."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ankuruk",
        "review_rating": "7",
        "review_title": "Decent one time watch",
        "review_detailed_main": "With all it's twists and turns, Don 2 marks a decent end to the year for Bollywood. The movie's strengths are action, plot twists and it's faced paced storyline which always keeps you at the edge of your seat.\n\nYes Don 2, does borrow from some Hollywood flicks like Mission Impossible, but it's neatly made and the plot fits in like a jigsaw puzzle at the end of the movie.\n\nThe only negatives were the touch of grey given to Don's character and the love story angle towards the end. A completely cold hearted Don, who's way beyond meaningless things such as love would have been more appreciated. The character could have been made much darker, which would have appealed more to the audience, but then again it's a Hindi flick, so such things are expected.\n\nThere are a few holes in the plot, but after all it's a Bollywood flick and no one expects it to be perfect.\n\nI would say Don 2 is a decent one time watch and do watch it at the theaters as the cinematography is brilliant."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "cooljalz",
        "review_rating": "4",
        "review_title": "Watching Don2 'mushkil hi nahi naamumkin hai'!!!!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "alamin89",
        "review_rating": "9",
        "review_title": "The Return of the King!!",
        "review_detailed_main": "Don 2 was one of the most anticipated movie of 2011.Don 2 is sequel to Don (2006) and bigger than the first one. After conquering Asian underworld Don steps on European underworld. The whole story is bit longer but interesting and well written. Talking about Direction has done a remarkable job for the movie. The whole movie is just stylish and you will feel as if you are watching a Hollywood movie. But the whole movie is of a little slow pace except the last 30 minute & also some scenes could have been made more interesting and comic. Dialogues are written by Farhan Akhtar & they are superbly written. There are some good punch lines and some dialogues will be remembered for long time. Action scenes are just awesome. I have seen one of the best action scenes of bollywood in this film. You will be also thrilled by the car chase. Cinematography has been excellent. Music is little weak, at least weaker than Don (2006) but they are well picturised. Lyrics are good & meaningful but couldn't lift up the songs much. Talking about acting, Boman Irani as Vardhan, Priyanka as Roma & SRK as Don, three main characters shines to their character. Specially Shahrukh's performance was outstanding. That evil laugh he gave in the film will be remembered for long time. Don's charm will make you forget all the problems with the film. Those who are not fan of Shahrukh will also like his performance. You will also like Don's flirting with Roma (Priyanka). Kunal Kapoor was a surprise character in the film. The other characters, Lara Dutta,Nawab Shah,Aly Khan did a decent job for the film. Over all Don 2 is one of the best action thriller films of bollywood. It hasn't got opening like Ready, Bodyguard or Ra. One but movie quality is better than three of them. Some people say that this movie is copied from MI4, Oceans Eleven, Prison Break...etc.But i can assure you that \"These are all crap\". Either they have not seen MI4,Prison Breake etc or they have not seen Don 2 or even both of them.The storyline of the movie is original & fresh. In the end what can i say, The King is Back."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sasikanth20",
        "review_rating": "6",
        "review_title": "Don 2 or MI 5??",
        "review_detailed_main": "Did I go to watch the Don return, or was it Mission Impossible 5?? There were car chases, buildings being bombed, hi-tech bank robbery sequence, 300 feet jump off a building, a mask involved.. did I miss anything?? In one word, it was a potpourri of say all the MI, Ocean's Eleven, and every other Hollywood action film of similar genre put together into a 2 hours 26 minutes film. But wait, it doesn't end there; unlike all other films, this one has the bad guy playing the lead role.\n\nDirected by one of my favorites, the film is very stylish, but is also long and disappointing. I expected something more sensible from Farhan. I never thought I would say this, but go watch the film only for Shahrukh. He's perfect for such kinda roles, and he sure delivers. He tried to carry the entire film on his shoulders, but its the script which fails him. If you aren't too fond of him, wait for the DVD to release.\n\nFor a more detailed review, please visit: sasikanth.blogspot.com/2011/12/movie-review-don-2.html"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mkgandhi_2004",
        "review_rating": "9",
        "review_title": "Better than MI4 Ghost protocol...best of SRK's action films..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "aditsecret",
        "review_rating": "6",
        "review_title": "All style and no substance make Don2 a dull movie!!",
        "review_detailed_main": "\"All style and no substance make Don2 a dull movie\",here's Don2 for you in a single sentence.The movie is a classic case of a promising start gone awry,and its all too evident as the thunderous applause at the introduction of SRK gives way to jeers and loud guffaws as the movie approaches its climax,which best described is a never ending lullaby,a snooze fest,if u will.Apart from slickly filmed car chases,breathtaking shots of Berlin, Thailand and some witty dialogs(SRK is on a roll throughout wid those)there's nothing about Don2 that sets the pulse racing.Even the ever-reliable soundtrack of SEL is a damp squib.Akhtar drags d flick into a self drawn predicament,as Don,the drug lord,the mafia king becomes the focal point of a caper story and its nothing that one hasn't seen before.You get the drift,with regards to the movie,as in the end the word \"slick\"gives way to the sentence \"Cut us some slack Mr.director\"...Srk is at his boisterous best as he walks away nonchalantly with his swagger and his head held high into fumes of mediocrity,that shroud Don2 throughout."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vikram_dasila14",
        "review_rating": "10",
        "review_title": "Don 2- A true sequel..!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "Decent Flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "rsabnis1",
        "review_rating": "7",
        "review_title": "Totally 'Don'-tastic Shah Rukh movie",
        "review_detailed_main": "If u are SRK fan and if u love to see him as a baddie, Don 2 fits superficially well for the purpose. The director captures your attention on the plot for almost the whole movie. Leaving no stone unturned the plot starts 5 years after the previous venture Don ended. Don (Shah Rukh Khan) has the whole of the Asian drug market under his own control and is all set to expand his regime in Europe. The fight scenes appear convincing and the audience totally plunge in an high expectation mode. Don ends up in a prison in Malaysia only to set his arch-rival Vardhaan free from the prison. Assisted by his lady love Aisha ( Lara Dutta ) and genius computer hacker (Kunal Kapoor), Don along with Vardhaan gear up for a big bank robbery. Roma (Priyanka Chopra ) carries along very well in the film as she plays a cop confronting Don in his master-plan Chase scene really makes u grip the edges of your seat hard, Don's fighting skills do remind u of 'Bond' type Hollywood movies. So for all action and suspense lovers, go for this thrilling experience."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Diptoman",
        "review_rating": "4",
        "review_title": "This was an... Epic facepalm",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mohammedkhan",
        "review_rating": "10",
        "review_title": "King is Back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "gautamkulkarni_84",
        "review_rating": "7",
        "review_title": "Definitely a one time watch....Could have been better",
        "review_detailed_main": "The prequel, Don-1 had the benefit of an already successful and potent plot which was indeed very well executed with the twist in the climax. Don-2 carries the story forward with some flaws and pace issues rendering this iconic character with a slightly different attitude than before. In the opening sequence, Don (Shahrukh Khan) is shown to be the solo king of the underworld in Asia with the mafia in Europe fearing the forthcoming competition from him. Roma (Priyanka Chopra) is an agent with interpol under Malik (Om Puri) who is about to retire. Don surrenders before Roma and Malik with the intention of going to prison. There he wants to befriend with his old rival Vardhan (Boman Irani who was arrested in the prequel and is now serving a sentence) and get him out. Vardhan has a key which would lead to an ambitious plan of looting the prints used for printing Euro bills. After escaping successfully from the prison in Malaysia, the story goes to Berlin. A bank called DZB has the possession of these prints which are preserved in the bank's basement with a high-tech security system. Don hires a techie Sameer (Kunal Kapoor) who would break and control the security system which seems a bit clichéd and ridiculous. And then a complicated bank robbery begins with twists and turns. SRK carries out the role of Don with style and charisma. The viewer is surprised to see the softer side of this bad guy. The way he flirts with Roma is fun to watch. Priyanka Chopra is stunning as always. She has does her part well. Lara Dutta and Kunal Kapoor do not impress much, blame it on their lack of screen presence. Om Puri has nothing different to do than before. In a nutshell Don-2 has some flaws yet makes a good one time watch Bollywood flick with a powerful star cast, breathtaking car chases/action and beautiful cinematography."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pcsarkar",
        "review_rating": "4",
        "review_title": "Meaningless Action Galore",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Pratik112",
        "review_rating": "10",
        "review_title": "One of the Best of 2011. \"Don Ko Pakadna Mushkil Nahin, Namumkin Hai\"",
        "review_detailed_main": "Having heard a lot about this sequel to \"DON\" 2006, before the movie was released and indeed long time before, that \"it was on\" and then \"it was off,\" I was looking forward to this one.\n\nIt has been five years since Don made his escape and is now out to conquer the Western World. Only he has to ensure that his enemies don't get (kill) him.\n\nStarring Shahrukh Khan, Priyanka Chopra, Lara Dutta, Boman Irani, Om Puri, Kunal Kapoor, Florian Lukas and Sahil Shroff. Music is by Shankar Ehsaan Loy. Lyrics By Javed Akhtar. Directed By Farhan Akhtar. The movie is Produced By Farhan Akhtar, Shahrukh Khan and Ritesh Sidhwani.\n\nShahrukh Khan's previous release, \"RA ONE,\" may not have done well as expected but this has. Shahrukh Khan has proved, once again, that he is able to do such action roles. He is convincing as the \"DON\" and this role has suited. His expressions and the way he delivers his dialogues, make one feel convinced. However, his hairstyle is to be watched out for.\n\nPriyanka Chopra makes a return as \"Roma.\" Only this time she has a more meatier part then she did in 2006 and this suits her more now then it did five years back. Here, her character, \"Roma\" has joined the Interpol and she is determined to catch Don.\n\nLara Dutta has replaced Isha Koppikar and plays the character, \"Ayesha,\" who is all the time with the Don. Boman Irani returns as \"Vaardhan,\" who was caught by the Police five years back and Om Puri, also returns as CBI Officer Vishal Malik.But one actor, who did a good job of his role, is Kunal Kapoor as a man who helps DON.\n\nFarhan Akhtar has returned to be behind the cameras and not in front of them. While, his father, Javed Akhtar, has written good lyrics for the music directors Shankar Ehsaan Loy to compose.\n\nThe action sequences, especially in 3D, are worth watching out.\n\nIf you like to watch action movies, then this is not to be missed."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kunalkhandwala",
        "review_rating": "6",
        "review_title": "Don degraded to being a bank robber....",
        "review_detailed_main": "The slick, stylized and convoluted 'Don' was a trend-setter of remakes that Farhan Akhtar impressed with in just his 3rd film as director. The expectations from its sequel were bound to be high and Farhan owed us a spectacular one, even though he spent much of the directorial hiatus as an actor. It was a fabulous build up to Don's return with its catchy, techno-infused music, slick previews and immense marketing efforts that were hard to ignore. But something went horribly wrong.... Farhan Akhtar lost his magic in the narrative, screenplay, dialogues and several sequences that had the potential but ended up as duds. Suddenly the narrative falls into an unscalable abyss during the heist and draws unsympathetic laughter at its pretentious gravity. Thereafter, the banal dialogues, familiar situations and mediocre action lead to something nobody expected from Don..... boredom.\n\nWith a firm grip over his Asian operations over the last 5 years, Don's attention now moves to Europe, where the cartel plans to stall his ambitious plans of expansion by plotting his death. Back in Malaysia, in a surprise move, Don surrenders himself to the Interpol, where Roma (Priyanka Chopra) and Malik (Om Puri) incarcerate him in the same prison that has Vardhan (Boman Irani), as a result of Don's prior courtesy. After an initial scuffle, Don offers Vardhan freedom from the prison, in exchange for his partnership in an undisclosed plan. After a not-so-fascinating jail-break, Don reveals his plans to steal Euro printing plates from Deutsche Central bank which has a complicated past involving dealings between Singhania and its Vice President, Diwan (Aly Khan at his dullest best), which Don uses to blackmail Diwan for the Bank vault's blueprints. Berlin is where Don's plans are executed with Jabbar (Nawab Shah) and Vardhan while he escapes from Roma's clutches in a thrilling car chase. Sameer (Kunal Kapoor) provides the technical expertise in the bank heist and the stage is set for the dullest, most redundant and prolonged heist sequences that simply brings the movie down to rubble. After stealing the plates in Mission Impossible style, Don manages to escape by himself, only to be betrayed and caught by the Police who offer immunity to him in exchange for his favor of leading them back into the vault to free the hostages from Vardhan and Jabbar. There is also an uncalled for love story brewing during those proceedings which just adds salt to the wounds of Akthar's fans. The movie does offer a twist in the end which is a far-cry from what was a shell shocker in the previous 'Don'.\n\nWhy would Farhan reduce Om Puri to such mundane dialogues and sequences which insult such a talent? Why is Roma one of the central characters in a film about Don? Lara Dutta's cameo is just what it is; a cameo. Aly Khan couldn't have been duller with his expression-less countenance. Nawab Shah was a complete let-down as a sidekick to Don's plot. Kunal Kapoor is happy to be in a big film such as this but his role is too short to leave any impression. The Hrithik Roshan cameo was simply ridiculous. One fails to comprehend Farhan's intention of doing something so cheesy.\n\nShahRukh Khan has done justice to being the badass that Don is. Negativity is a shade that he is comfortable being in and with Farhan's focus on Don's aura, SRK easily carries the film on his shoulders. He is the film's sincerest face that doesn't disappoint. However, we are not sure whether we would like to see him as Don again and that's not his fault.\n\nDon 2's flaws all point towards its director. The first half did set things in motion and provided a good build up to a big plan that Don would've executed with some interesting characters. However, that was not to be. What ruins it all is the entire one hour in the bank. It looks like a mock-up set with an unnecessary hostage situation and the confrontations between the actors was everything short of electric. Providing redundancy were the words and threats exchanged between Don, Jabbar and Malik. Don had the potential to be different. Someone so cool at being badass that he would become an icon. Farhan's disregard of his own notion and failure to bring more chase sequences, explosive action and tense confrontations have led to a plan 'B'. Pay off all the critics to write great things about an inferior product. If not with his direction this time, Farhan manages to Excel in marketing his film.\n\nOn the bright side, Jason West's cinematography is par excellence. Every shot in Malaysia, Berlin, Zurich and Budapest glorify the regions and provide stylized visuals in aerial shots, action scenes and chase sequences. Shankar Ehsaan Loy's music is similar to their previous 'Don' venture, being upbeat and techno with a hint of Don's malice in the evolved theme. Usha Uthup's 'Hai yeh Maaya' and 'Zara dil ko tham lo' are the excellent tracks from the album. Through Farhan's vision, there have been some outstanding moments in the film. Don's entry in Malaysia is among the most dashing, the fight scenes at the smuggler's den in Malaysia and that between Vardhan and Don in the prison are well executed while the car chase in Berlin is the film's highlight.\n\nDon 2 will perhaps be remembered as Farhan Akhtar's betrayal to his fans. It will also be remembered for ShahRukh Khan's sincere depiction of a favorite character. It had the potential to beat the hype but the failure in execution in many aspects has led to a huge disappointment. It would've been a great film had it been another director but with such a name and cast behind it, nothing short of excellence was going to be acceptable."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "saadgkhan",
        "review_rating": "8",
        "review_title": "finally Shahrukh found a bankable franchise in his hands which he was hoping from Ra.One, Can't wait for DON3 now",
        "review_detailed_main": "DON 2 – CATCH IT ( A- ) I've the first Shahrukh Khan's remake Don in parts. The movie was stylish and chic but I could never understand what Arjun Rampal was doing in it. The music and whole look of the movie was defiantly noticeable; I think that led to DON2. This is more off a heist movie than a Don movie. Kudos to director Farhan Akhtar for blending the perfect heist into Don's scenario. This defiantly leaves more room for the next Don movies as well for the viewers to enjoy. I think finally Shahrukh found a bankable franchise in his hands which he was hoping from Ra.One. Shahrukh Khan is amazing in this movie and leaves a strong impact. Priyanka Chopra is great and her last scene where Boman on gun point tells her to Shoot Don was Amazing. Lara Dutta looked stunning. Boman Irani was superb as always. Overall a great heist movie up to Hollywood standards. I'll wait for DON3 now."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "One of the Pathetic movies I have seen recently..Farhan has lost it completely :(",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "An Interesting Watch! SRK is Terrific!",
        "review_detailed_main": "A Sequel to 'Don: The Chase Begins Again', Farhan Akhtar's 'Don 2' is an interesting & crispy sequel, that succeeds by holding your attention at most times. Of course, the Screenplay could've been tighter, but overall, it packs in enough style & merit to sail itself smoothly.\n\nThe plot of the film continues from the end of the first film, starting in Malaysia and moving to Europe where Don, now the indisputable king of the Asian underworld, shifts his aim to Europe, to rob a bank.\n\n'Don 2' begins well, dips in the middle, but culminates interestingly. The Screenplay by Farhan Akhtar, Ameet Mehta & Amrish Shah, is crispy & engaging, at most times. The first-hour has it's moments, but it definitely isn't terrific, while the second-hour, on the other-hand, is fast & interesting. Farhan Akhtar's Direction is stylish. Cinematography is good. Editing is razor-sharp. Action Sequences/Stunts are top-class. Art Design is passable. Music by Shankar Ehsaan-Loy, is mediocre.\n\nPerformance-Wise: SRK returns as Don, and he's in terrific form in here as well. He plays the cool, suave & notorious anti-hero with great ease. This performance is amongst his best works. Priyanka Chopra looks stunning & does well. Kunal Kapoor is as usual. Lara Dutta's role lacks meat, while Boman Irani is impressive as ever. Om Puri gets limited scope. Aly Khan is fantastic. Nawab Shah & Sahil Shroff are fair. Hrithik Roshan, in a cameo, adds star-value.\n\nOn the whole, 'Don 2' is an interesting watch. Go For It!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "iamsayd",
        "review_rating": "10",
        "review_title": "Don 2 Review : 'Don 2 is a Masterpiece'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "jigz331",
        "review_rating": "6",
        "review_title": "DON 2 - you cant call it a sequel !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ashu-modi",
        "review_rating": "5",
        "review_title": "Weak script, loads of hamming, good action scenes: That's Don 2 for you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vivee003",
        "review_rating": "8",
        "review_title": "The King Is Back!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "siddhant-giri",
        "review_rating": "7",
        "review_title": "\"The best action-flick and sequel in bollywood .\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "SonalSudeep",
        "review_rating": "2",
        "review_title": "Another disaster comes your way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "dipdipdey",
        "review_rating": "10",
        "review_title": "Oh!!! What a film... Excellent!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "zabikhan09",
        "review_rating": "7",
        "review_title": "One Man Show.....SRK",
        "review_detailed_main": "The first half of movie, moves at a leisurely pace and takes a while to come to the point. It is after interval that the pace picks up. Farhan Akhtar yet again shows his brilliance as a director. Barring few loopholes which can be neglected.His shot takings deserve distinction marks.In Don 2, Akhtar manages to blend elements from various Hollywood films, mostly Ocean's Eleven and Die-hard, with a bit of Mission Impossible thrown in. A rehash of what they've done already. No points for originality. Jason West's cinematography is outstanding. The brilliance of his work is evident in outdoor as well as indoor shooting. The locations of Germany, Malaysiaand Switzerland look stunning.The music is the sole sore point of the film. The film deserved a much, much superior score to match up to the standards set by Farhan Akhtar. Shankar-Ehsaan-Loy's music is disappointing.Acting is normal nothing worth applauding, though tends to over-act at places but goes with the theme.\n\nOn the minus side, all that Don and his team do seems so easy that it appears rather unbelievable at times. Dialogues could've packed in more punch and power as they, at places, seem quite tame, especially those mouthed by Don.Light moments are few and far between and had there been more of them, the appeal of the film would've been bigger.Don 2 is also a Bollywood film and so romance has to be a part of the plot. Towards the end of the film while bullets are flying everywhere, there is an unexpected, almost forced and laughable romantic moment between Khan and Priyanka Chopra.Don 2 is packed with uninspired performances by a large supporting cast.\n\nThe film is a big change in the routine Hindi celluloid.It does mark the change from the stereotypes.In conclusion Don 2 is a fine film,a treat for SRK fans and watch-able !"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "wazankash",
        "review_rating": "10",
        "review_title": "Farhan Akhtar has outdone himself with Don2 !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "prasad-hattangadi-1",
        "review_rating": "7",
        "review_title": "Finally bollywood makes a Die hard",
        "review_detailed_main": "A rock solid script, excellent direction by Farhan makes this movie worth the wait. Its a closest Indian movies can get to Hollywood. And the entire credit should go to director and writer and finally making a Bollywood movie which can be in the league of Die Hard series. However, for some reason i feel that the movie could have been named anything. it feels as if DON was deliberately added at the last minute into a very good script which could have been made on any actor and character. SRK as usual hams in every scene and in some scenes he overdoes it so much that you wish you had some other actor in his place. I know many SRK fans won't like my comments but believe me when you watch the movie you will realize what i'm saying.All in all excellent movie and worth the watch."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "faisal_khatib",
        "review_rating": "8",
        "review_title": "I'd watch it again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "devilmind7",
        "review_rating": "7",
        "review_title": "Go For It!",
        "review_detailed_main": "If you have liked the first Don, you will love this one! Action scenes really engage you in the movie... you want to know what is going to happen afterward... Farhan should make don more evil and he must find something beyond money for Don. If there is anything you cannot avoid in this movie, it is Khan. Well designed Farhan. your directorial talent is great.\n\nPerformances: Shah Rukh Khan did a good job. Priyanka was fine but she should try it the simplest. Lara was great as per the requirement. Om Puri was tolerable.Boman Irani was trying too much to be bad guy.Kunal was good.\n\nDirection: Needless to say anything when the name Farhan Akhtar appears.The best.\n\nStory: Don is back to conquer the drug trade of Europe with a witty and well planned mission.\n\nFinal verdict : 4/5\n\nGo for it"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "3",
        "review_title": "very good start but goes really boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Don 2",
        "review_detailed_main": "One doesn't need prior knowledge from Part 1 because key moments will have its necessary but brief flashbacks, so you can go ahead and make plans to watch this without any need of background knowledge. Suffice to only know that Shah Rukh Khan continues in the role as Don the drug lord of Asia, who because of his ambition to take over Europe's cartels as well, has irked the Europeans to put money on his head. This makes Don think twice about wanting to continue being in this dangerous trade, and is willing to give up all his contacts to the Interpol police, represented by Om Puri and Priyanka Chopra as Detective Malik and Roma respectively, for immunity from incarceration and the hangman's noose.\n\nBut this is Don, so what's on the surface is purely and literally superficial, as his plans have parts two and three, meaning to get rid of those enemies who had done their pre-emptive strike from Europe, as well as to exit the drug trade and go into something more lucrative, say a bank heist to get the printing plates of the Eurodollar currency. And to do all this in one setting - what's life without its challenges, eh? This means to blackmail people at the right places such as Diwan (Aly Khan) the VP of the bank, to make friends out of enemies like Vardhaan (Boman Irani) from the past in the original film, and those hired recently to bump him off such as Jabbar (Nawwab Shah) and his goons, counter-offering such mercenaries three times as much so as to gather enough resources for the audacious plan he has concocted that sprawls throughout the film, wondering if he has plot convenience on his side to pull everything off in one night. Rounding up his troopers are tech geek (for any heist film) in Sameer (Kunal Kapoor), and femme fatale Ayesha (Lara Dutta) in a small role.\n\nThe muti-talented Farhan Akhtar had pulled out all the stops here in making an action crime caper worthy of standing out there in the international film circuit, boasting all the necessary ingredients that made Don 2 an exhilarating ride from start to end, whether be it fight sequences involving guns, knives, fists or makeshift weapons, or complex designed stunts from multi-leveled car chases to having SRK leap off a rooftop from 300ft. Working with some of the best in the business of stunt choreography had given this film a distinct slickness in every stunt execution, and one of the best sequences involved the extended infiltration of a building by Don, Roma and a team of German Spezialeinsatzkommandos (SEK, the equivalent of the American SWAT) and the gun/fist fights. Goodbye gross exaggeration, hello smooth execution.\n\nThis is probably the first time I've seen SRK play a negative role on the big screen, and he does his Bad Shah persona with aplomb, balancing that sneaky schemer in his Don character with the necessary physique for the role, putting us all to shame since he's pushing 50 years of age and still looking good for the part of the action super-star. Priyanka Chopra also proved that she's no flower vase in this film, with enough stunts here to put her in almost the same league as what Scarlett Johansson had done with her Black Widow role, showing off her toned frame and one tough cookie persona in having to perform her own fight routines, which was a good break from her extended involvement here that has Interpol always on the back pedal, addressing villains with their hands tied.\n\nOpportunities to add some pizazz such as bond-ish song and dance routines especially that featured in its closing credits seemed to hard to pass up, but these routines were thankfully kept to a bare minimum and usually out of the main narrative, which was a thankful deliberate decision so as not to detract from the relative seriousness of the narrative. Its crux is primarily a heist movie that involves the planning and scheming to have things fall in place for a plan to be carried out, but since there's little honor amongst thieves, it provided for a larger margin of error, and entertainment for the audience when loyalties get tested and double crossing becomes just part of the entire game of unexpected twists and turns. There were some obvious plot loopholes, but with the punchy narrative, you're hardly going to realize them until the end credits roll, especially to those that had a high level of convenience weaved into them.\n\nShah Rukh Khan has 2 films that came out in 2011 with his Ra.One being the more talked about and hyped film, but comparing Don 2 with that earlier release, I felt this one had made more of an impact in terms of story and level of sophistication, even if Ra.One was touted as the most expensive Hindi or Indian film to date, which had to bring its story down to the lowest common denominator for everyone in the family to enjoy. Look out too for Hrithik Roshan's special appearance that reunites him with Priyanka Chopra briefly (ready for Agneepath and Krrish 2?), as I guess Farhan Akhtar may have talked to his co-star in Zindagi Na Milegi Dobara to help out in this one!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Jijujohnson",
        "review_rating": "7",
        "review_title": "It's a full Action Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mitesh-sahu",
        "review_rating": "4",
        "review_title": "Solo by SRK!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sanddragon939",
        "review_rating": "10",
        "review_title": "Truly the Return of the King!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "IndrajitGhosh",
        "review_rating": "7",
        "review_title": "Good but nothing like the first Don",
        "review_detailed_main": "Don 2 is a very good film, however nothing in the sequel matches up to the excellence of the first Don.\n\nFirstly, in terms of storyline, Don 2 could never be as good as the first. The first Don has an excellent plot with a nice flowing script, it seems Don 2 lacks both particularly the latter. I think some scenes in Don 2 are poorly scripted, however on behalf of those who have not seen it, I will not give away anything.\n\nSecondly, in terms of action sequences the first Don has much better ones. Don 2 hardly has any action in it.\n\nThirdly, in terms of acting I think Don 2 is quite poor. Shahrukh Khan did not play Don in the same cunning way which he played him in the first movie. Also, Priyanka Chopra's portrayal of Roma seems to have dropped in the sequel.\n\nFourthly, the songs in Don 2 are nothing like the songs in the first movie. The songs in the first one are a lot more addictive, I think the only song I can listen to over and over again in the sequel is Dushman Mera.\n\nOverall however, I would not say Don 2 is a bad movie. I would just say it does not match up to the goodness of the first one (which is generally the case with sequels)."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "amit-dutta89",
        "review_rating": "10",
        "review_title": "Best action suspense & full of twists movie in bollywood till date",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "santhosh-10290",
        "review_rating": "7",
        "review_title": "Don 2 (2011)",
        "review_detailed_main": "The movie was excellent. SRK superb acting and stylish. Songs and BGM were awesome in the movie. The movie was so interesting and thrilling. But the 2nd half in the movie was slightly boring."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "suzzhuzz",
        "review_rating": "10",
        "review_title": "Good entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "liam-engel",
        "review_rating": "7",
        "review_title": "Don 2. Drawn out and predictable.",
        "review_detailed_main": "Don 2. The Regal Cinema, Colaba. Running time: much longer than I had anticipated. It was some time in the late afternoon and Ben, Stefan and I sat in the gallery section, in deep anticipation of what the posters had lead us to believe was the tale of an Indian stud with a fondness for attractive women and violence. We were correct in all but one respect; it was the tale of an Indian stud with a fondness for attractive women, violence, and cars. But first there were the trailers.\n\nNo movie has ever sold themselves as Players sold itself to me on that padded bleacher-style seating. A group of good looking men drove a rainbow squad of Mini Coopers, in formation, to fight crime. At least I think it was to fight crime- the language barrier could cause significant confusion at times. My heart was racing, just as I'm sure it would have raced if I had seen a commercial for any Bollywood film. I honestly think I would enjoy watching two and a half hours of Indian advertisements more than I enjoyed watching the two and a half hours that was Don 2.\n\nThe first hour was entertaining. There was absolutely no need to understand the dialogue. Don engaged in various criminal exploits while sending faux-subtle soft core insinuations to any young woman that appeared in the film. There were explosions and shiny guns. And that was all that was needed, until I found out that the intermission wasn't for another half an hour. And that the intermission wasn't the end.\n\nFrom here the plot continued to conform to already stated conventions- although I think there was some dancing in a casino.\n\nI didn't go to see Players.\n\nhttp://alibrarytowingrot.wordpress.com/2012/06/10/impressions/"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "dissipe",
        "review_rating": "2",
        "review_title": "Save Feris Bueller; SAVE YOUR RUPEES & do not see!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "souravsr1004",
        "review_rating": "10",
        "review_title": "Don 2 Roccckkksss in all Fronts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "harrypottervegetaria-423-432372",
        "review_rating": "",
        "review_title": "a masala entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "arupghose",
        "review_rating": "7",
        "review_title": "Slick, Stylish and Hollywood like",
        "review_detailed_main": "Don 2 is certainly far better than Don the original. Farhan Akhtar continues to show that he is a slick and stylish director and delivers what comes across like a Hollywood type film!\n\nShah Rukh isn't amazing, but just about fine. His action is brilliant, and far better than Ra.One even with the special affects, however over acts in many of the scenes. He looks way too old, especially at the start of the film, and really does not look like a Don!\n\nPriyanka is brilliant. I was sad to see that she had minimal action scenes, but her presence was far better than anyone else's in the film! 10 out of 10 for her!\n\nBoman Irani has become a true all-rounder in the industry. He can manage to pull off comedy and serious roles with immense ease now.\n\nKunal Kapoor has limited screen time, but pulls off his role well. The twist at the end was excellent, and has the audience very surprised!!\n\nAll in all, the film does well due to its stylish nature, however feel it could have been better. SRK is a slight let down, and just about manages to pull off the role to a substantial amount."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "richbeggars004",
        "review_rating": "2",
        "review_title": "Summary to failure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "iamharsh",
        "review_rating": "9",
        "review_title": "Don 2, the best and the most clever movie ever in Bollywood, King Khan proves his metal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pgp007",
        "review_rating": "7",
        "review_title": "Don ko pakadna mushkil hi nahin,NAMOMKIN HAI...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "swaran-chakraborty",
        "review_rating": "10",
        "review_title": "Best Bollywood Hifh Octane Thriller Ever!!",
        "review_detailed_main": "With DON 2, Bollywood has finally come out of age. Everything was brilliant about the film starting from scripting to the choreography. The casting was excellent and the actors performed beautifully. Especially, Shahrukh Khan was brilliant in the portrayal of DON. Even the songs went well with the movie. The scenes were beautifully shot, especially the scenes shown in 'Hai Yeh Maya' song. The action scenes were brilliantly shot. The cinematography was excellent. The editing was very good. Just the correct pace required for this kind of film.\n\nThe entry of DON was brilliant. Probably the best part of the film. The action sequences in the start of the film was amazing. The jail scenes were shot wonderfully but was pretty fast. Even the entire heist was done in a very fast manner. The jail break and the heist could have been showed in a more organized manner. Some parts were difficult to understand but considering something new and 1st of its kind, it is brilliant.\n\nOverall, a brilliant classic thriller film."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "simian_ninja",
        "review_rating": "7",
        "review_title": "Not as good as the first one",
        "review_detailed_main": "An entertaining enough film that cannot make up it's mind what it wants to be.\n\nFirst off, the music - as a key ingredient in Bollywood cinema, there is nothing that is too memorable about the soundtrack of 'Don 2'. There is one particular sequence that is supposed to remind the audience of the 2006 remake but doesn't come close to that film's \"Main Hoon Don\".\n\nOne of the biggest peeves I have about this film is the writing, for a professional film that is trying to distance itself away from the usual Bollywood standard and emulate Hollywood - simply falls flat due to twists and turns that are not exciting in any way or form. I cannot say much without revealing spoilers but jaw dropping moments simply become \"Meh\" shrugging moments.\n\nThe direction & cinematography are worthwhile and show the skills of Faran Ahktar (who is probably one of my favorite Bollywood directors) and Jason West. What helps the film work is that the locations aren't simply there to say \"Oh look where we are\" but work strongly to become apart of the film itself.\n\nThe acting. Not a lot to go on this one. Shahrukh sleep walks his way through this one with a confidence that I have yet to see matched by any other actor. He is Don. And it is easy to fall for his charm - you want this Don to win - Vijay is nothing more than a mere distant memory. Priyanka Chopra looks amazing but she's not given enough meat to chew on. Wasted potential. Unfortunately Boman Irani and Om Puri seem like they were a part of the film for a paycheck. It's a shame because both of them are on my favorite actors list.\n\nAll in all, Don suffers from not knowing what it wants to be yet carries with it a confidence that knows that people are going to watch it (and of course they would). The film could have been a marathon but doesn't go the mile - I wanted to like it but it simply is not engaging as the first one. Also, the creators are sitting on a Goldmine of ideas - it's a shame that they took an easy way out."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "filmnut1",
        "review_rating": "8",
        "review_title": "A great Bollywood movie for those who don't like Bollywood movies",
        "review_detailed_main": "When Farhan Akhtar remade the DON (Chandra Barot, 1978) in 2006, he was clearly aiming to bring a more American style to Indian audiences. The film had all the hallmarks of Bollywood (most notably the musical sequences) but had a slick look and excellent action scenes (including a skydiving one).\n\nHis sequel, DON 2 (2011) moves even further away from the Bollywood formula. There's only one musical sequence (although there's another played during the closing credits) and the whole thing feels more like an entry in the MISSION: IMPOSSIBLE franchise than your typical Indian movie. Freed from the restraints of an established framework, Akhtar could take his characters in whatever direction he chose and he chose West.\n\nThough there was no existing template to follow, like many Indian filmmakers he's looked to Hollywood for inspiration. The only really unique aspect to DON 2 is that its hero is not a James Bond or a Largo Winch type. He's 100% villain, although it's easy to forget that sometimes. What you therefore have is a curious blending of action and gangster movie clichés. One minute you're watching a Tom Cruise-style mission (cue big stunts and even a CGI mask removing effect) and the next it's more like a standard heist/bank robbery flick.\n\nAfter scenes in Thailand, Malaysia and Switzerland, the action settles in Germany, providing a stark contrast to the exotic first film. Because the story takes place largely in Berlin, those German maestros of vehicular chaos Action Concept were charged with the action.\n\nWhile they are most well known for their own productions, such as English-language B-movies like FINAL CONTRACT: DEATH ON DELIVERY (Axel Sand, 2006), they have worked on other Bollywood films such as AAP KAA SURROOR (Prashant Chadha, 2007) and AZAAN (Prashant Chadha, 2011). Action director Matthias Barsch delivers action scenes that are as good as those in any Hollywood movie.\n\nDON is one of my favourite Bollywood movies, it's cool, has great action and music and plenty of twists. Its plot is fairly absurd and like many such movies it's got a lot of characters and a three-hour running time. DON 2 is much more focused and the running time is around 2hrs 20mins, which is fairly standard in Hollywood these days. It's a Bollywood movie for those that don't like Bollywood movies. It has no national character.\n\nMany of the great things about the first film are true of this also. Shan Rukh Khan is brilliant in the lead, it's a joy to see many of the supporting players joining him for the sequel and the aforementioned action is the film's major selling point. But elements that made the first film special are missing.\n\nWhile the plot is more focused, it's not as unpredictable and fun. The music is disappointing too. The score is intentionally similar to that in the first film but the songs are not nearly as good. In this regard it's very good that they digress only once.\n\nFor those who enjoy international thrillers and explosive action, this is a must see. It's interesting to see a big Indian action movie that can hold its own with Hollywood fare, but at the same time sad to see Bollywood losing its identity.\n\nFor years Bollywood has been on the cusp of international acceptance. Perhaps films like DON and DON 2 are exactly the kind India needs to make to reach a broader audience and will lead those that see them to check out more curious films such as MISSION ISTAANBUL (Apoorva Lakhia, 2008), HIJACK (Kunal Shivdasani, 2008), PRINCE (Kookie V. Gulati, 2010) and the excellent DHOOM 2 (Sanjay Gadhvi, 2006). Each of which imitates Hollywood-style in a distinctly Bollywood way."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "7",
        "review_title": "This is not Shahrukh Khan-ish movie",
        "review_detailed_main": "Shahrukh Khan did great job.\n\nThis is not the best and great movie, but this is different.\n\nThis is not Khan-ish movie but still watchabable."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "indranil2121",
        "review_rating": "3",
        "review_title": "Completely unlike from DON's character reference.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "venkats278",
        "review_rating": "10",
        "review_title": "best ever!!!!!",
        "review_detailed_main": "DON-2 ...really the best movie BOLLYWOOD have ever had...SRK has made a terrific comeback ....his coordination with farhan s really unimaginable...with a deep story base and awesome locations ,this movie has a pleasant appeal for viewers all around the globe..SRK's stunts are really really mind blowing and its amazing to see him giving his best of all time...Priyanka redefines her role in the movie and it is really cool to have such a female lead who maintains a good rapport with the co-stars..and boman irani has really done a beautiful job and finally he has the same plot for his role...finally DON-2 s one of the best ever movie by any director in BOLLYWOOD which includes terrific action, stunning twists, and for the audience \"the real satisfaction \" for witnessing such a mind blowing movie ---ONE OF ITS KIND-(in India)\n\nDON-2 ~ SIMPLY MARVELLOUS ~"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "liverenjith",
        "review_rating": "7",
        "review_title": "An enjoyable Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "nilesh-unplugged",
        "review_rating": "5",
        "review_title": "Bland",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "avinashawi1992",
        "review_rating": "10",
        "review_title": "fantastic movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "paramantaal",
        "review_rating": "",
        "review_title": "A bollywood production for international audience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "hikerhetav",
        "review_rating": "6",
        "review_title": "Mote style, glossy plot but less thrill",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "karthikmohanklubt",
        "review_rating": "9",
        "review_title": "Don 2.....1 word: Mind blowing and outstanding.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "catchamu2004",
        "review_rating": "8",
        "review_title": "Don is back with a bang...",
        "review_detailed_main": "Don 2 is a classic action/crime thriller that doesn't let go, even for a moment.It works for 3 reasons: \"SRK's performance, Farhan's direction and those fantastic dialogues.The film has a bland first hour, but the second half takes the film to another level.It is a perfect entertainment package for this Christmas. Shah Rukh Khan is the life of the film and charms his way into the audience's hearts. He shines in the role of Don and uses all the charisma at his command to make his character supremely endearing. His dialogue delivery, facial expressions and wicked laughter add up to an enjoyable package. His attitude and body language are oh so endearing. Priyanka Chopra gets limited scope and is suitably restrained as the Interpol detective. She looks sexy. Lara Dutta is alright but somehow, she does not add the desired dose of glamour in a fairly long special appearance, and even her scope, is restricted. Boman Irani shines in the role of Vardhan. He is menacing and manipulative, as is the demand of the character. Aly Khan plays his part with calculated coolness. Kunal Kapoor leaves a mark. Nawab Shah is alright as Jabbar. Om Puri has been wasted. Sahil Shroff looks handsome and does a fair job as Arjun. Hrithik Roshan springs a surprise in a special appearance and does a fine job although the track looks forced. Others lend fair support.\n\nDon 2 belongs to Shahrukh Khan."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "errol-pereira",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "iimraann",
        "review_rating": "10",
        "review_title": "Don ki movie ki story mein agar Farhan involved ho.. toh movie achchhi hi banegi",
        "review_detailed_main": "After Ra-one, I was looking up to this-one and I am not disappointed at all. The 'Over the head' attitude of Don really suits Shahrukh or shall I say, was splendidly managed by the makers. It is justified. Also, while watching the promos; there was this echoes of 'Don... Don...' which made me prejudiced about thinking the movie as a 'Brag'. But ... this is totally not the case in the movie. The lines where Don refers to himself in third person were also well arranged in contexts. The writers; Ameet, Amrish and Farhan did a swell job. The story is complex and well plotted. Its like you'd think of the previous events justifying the present happenings i.e. 'this stuff is happening/justified because of the earlier this-this event' (not including the flashbacks). Such a trait would compel you to watch the movie, probably again. Well, thats what I'm gonna do. The action scenes are the slickest (neither far- fetched nor lame) of all Indian movies. Don is really believable with his ballsy and wayward attitude. Twists in story are really great. Lastly, it left me prejudiced ki \"Don ki movie ki story mein agar Farhan involved ho.. toh movie achchhi hi banegi\".... Waiting for Don 3....."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ensemblestudio",
        "review_rating": "3",
        "review_title": "I need my three hours back.",
        "review_detailed_main": "I had been looking forward to watching this movie since few months. Only because Farhan Akthar was directing it. I did not have any hopes from Shahrukh Khan, Yet I went to see the film. I had to wait for a few days since all the tickets were sold out for the weekend and initial days that followed.\n\nDon 2 doesn't leave any positive impressions. It is a movie without any soul. This is a HIGH- BUDGET Movie and has been in making for almost 3 years. I don't expect junk from people especially not Farhan Akthar, but Don 2 had it all: Cheesy Dialogues, Bad Acting, Lame and Predictable Story, and a cheap Love Story .\n\nAll the actors act like it is a joke, and Don's funny dialoges aren't funny anymore. They're just in one word 'Cheesy'. I felt betrayed off when I came out of the theater.\n\nInterestingly there are folks who are making great movies on a shoe-string budget with new actors like Stanley ka Dubba which makes me wonder why such crap comes out of some of these ultra high-budget movies and the so-called superstars.\n\nIf you are a serious movie fan and don't like the junk created by Karan Johar, Yashraj Films and like originality in movies then this movie is absolutely not for you. Don't waste your time."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "amitanu",
        "review_rating": "10",
        "review_title": "The King Is Back..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "raj-tamang3",
        "review_rating": "8",
        "review_title": "Brilliant Job with Don 2",
        "review_detailed_main": "After the traumatic memories of RA-1, Mr Khan is back with Don 2 in style. The first 25-30 mins of the movie, only one word Wow. Don as Srk, is brave, witty, cool and gutty. This man (SRK) can be a very innocence rizvan Khan at one end and at the same time can be a deadlier and cool Don on other end.\n\nThe flow of the movie is so consistent and smooth. The actions and stunts are believable and absolutely par with Hollywood. The cinematography is outstanding. All praise should go to MR Akhtar. He deserves a big applause. Although there is no denying that there are some minor flaws, the pace of the movie gets slow at the end of the first half, the emotional relationship between Don and Roma does not ruin the movie at all. Who cares about the minor flaws, all in all Mazza agaya Bhai. This is the best bollywood action-thriller movie par with Hollywood so far. Srk and Farahn should come up with Don 3 with deadlier and meaner Don ever seen."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "abhimanyusaxenarip",
        "review_rating": "10",
        "review_title": "Bollywood goes slick!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "uday_321",
        "review_rating": "5",
        "review_title": "Don 2 - A typical Bollywood movies with expected twists",
        "review_detailed_main": "Don 2 had the high expectation from audience and SRK. Specially when SRK's Ra one did not meet the expectation. Movie has the typical Bollywood ingredients such as SRK, sexy Female cop (Priyanka) and foreign locations. However movie fails to thrill. All the scenes are picked up from Hollywood movies Specially the SRK jail and Escape scenes.\n\nMovie starts with typical fight where hero bashes 20 odd men and continues to revolve under SRK. Movie goes around Europe with expected twists. Climax is little better than ordinary.\n\nOverall SRK acting is good along with Boman Irani."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ashwin-92-52455",
        "review_rating": "9",
        "review_title": "Brilliant piece of art..!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ramesh-roey",
        "review_rating": "4",
        "review_title": "One liner and Shaharukh... that's it",
        "review_detailed_main": "When I saw trailer of Don2, it looks like teaser of new random travel show, because it had loads of stills from Berlin concluded by close up of Shaharukh Khan. But for other teasers they used au courant technique of animation with one liner, pretty cheap na? I was morbid when I heard songs. really? I don't want to compare with any other popular songs, but the vigor is missing. Music of this film is stale.\n\nDon 2starts with the scene where Don's enemies are plotting against him. The scene doesn't even contribute anything to this heist film. But then the scene entirely overshadowed by next sequence where Don comes with smirk on his face and act like a superhero. Shaharukh always believes that he is the king of the industry, when he gets to play the character which gives justice to his true persona, he personified it. In Ra.one, he was confused whether to play romantic hero or tough robot. But here, character is already defined. 3D effects are not notable. Ritesh Sidhwani made this film in 3D after watching Ra.One in 3D, of course he said so.\n\nScreenplay tries to disclose everything and anything, which wasn't necessary. Farhan hasn't to overcome this problem; why there is necessary to show that Sameer's (Kunal Kapoor) wife/galfriend is pregnant. Does that contribute anything with your any conflicts of the script? The answer is no, but that consumes pace of the film. There are too many shots and scenes which are well shot but when you zeroed down them, you will come to know that their contribution in the story is zero. Farhan did same thing with his potentially smart film 'Lakshya' let's not talk about it. Farhan tried to make Don's character like a superhero but he forgotten to make it believable.\n\nScript errors are too many. If you are aware of format of heist film then, the end and twists(?) is predictable.\n\nIt was Shaharukh who hold up the show. Priyanka Chopra doesn't have any idea why she is in the film. (May be it was intentional) Her character (Roma) is underwritten. Why there is a guy who wants to hit on her? That's not characterization, that's Script play writer was busy making other plans.\n\nOne liner that will tempt me to watch this movie again.The movie is not intelligent enough to watch it all till the end"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "taimur_aaryan",
        "review_rating": "10",
        "review_title": "Srk Rockss",
        "review_detailed_main": "Well according to me i am giving the movie 10 out of 10 .. because the way Farhan made this movie was just awesome and Srk acting as always best of the best .. really was feeling like i am watching a Hollywood action thriller movie and i can say its the best action thriller of the decade .\n\nthe other characters in the movie also played there part well\n\nnow some lines about the movie\n\nAfter Don the chase begins in which Shahrukh (Don) disappears cheating everyone and became the emperor of Asian underworld here in Don 2 Shahrukh once again comes back with a awesome entry to rule the drug market and underworld of the whole Europe and as expected he ables to rule it with a fantastic plan\n\nin short A must watch movie"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Khushnood07",
        "review_rating": "10",
        "review_title": "DON 2 is the Best action movie bollywood has ever produced.......",
        "review_detailed_main": "Don 2 is slick,stylish,fast paced and can easily beat many of its Hollywood contemporaries.Its fast pace and gripping story won't leave you for a second.The movie doesn't leave momentum for a second.Shahrukh is mind blowing in both the avatars.He is the soul of film.he has made Don most iconic character of Indian cinema.Hats off to him for bringing such action-heist genre to Indian cinema.Farhan's direction is gripping.Jason west's cinematography is just awesome.he has captured every location in a very stylish manner.Action is the other alluring selling point of Farhan Akhtar's film. The chases, the fights, the demolition, destruction, break-ins, escapes have all been done with a finesse that rivals the best of Hollywood. Watch the car chase between Priyanka and Shah Rukh and you'll get the point. It's not only high voltage that drips with passion which makes it seem almost like foreplay. The other notable sequences include the heist, the escape and Shah Rukh's larger-than-life leap from a high-rise while his assassin wrings his hands in dismay. Don 2 is a film that represents modern Indian action cinema well. It represents the push toward Indian cinema becoming global cinema, and it puts India's best foot forward."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "varghesejunior",
        "review_rating": "9",
        "review_title": "Better than Don 1!!!",
        "review_detailed_main": "Just returned from watching this awesome action flick on Big screen. It is worth the hype created prior to its release. The story is a sequel to don (1996). The invincible Don ,having conquered the mafia world in Asia, now sets his eyes on Europe, and gets himself deliberately arrested in Malaysia to free the convicted Vardhan, one of his arch Asian rivals and with his help escape to Germany and loot a very expensive currency making plate. On this mission also takes the help of Sam, a computer savvy to carry out his plan. Hot on their heels are the cops.\n\nSo begins another journey through 2 and a half hours, with loads of action, hot chases, daring stunts, and a truckload of entertainment- and all in 3D. Imagine that.\n\nOnly 2 songs with choreography.\n\nMusic is good, with a little bit of rock.\n\nFar better than the prequel, the action scenes and twists are the main reason why you should watch this movie.\n\nYou won't regret it!!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "thepsychocritic",
        "review_rating": "5",
        "review_title": "Not the cops, but age has caught up with Don.",
        "review_detailed_main": "Don 2 is a film that throws light on the megalomanical tendencies of Shah Rukh Khan - a film that loves the growing-old-faster-than-the- speed-of-light man more than it loves the audiences.\n\nNarrating in first person, Don (Shak Rukh Khan), voice filled with hauteur, talks about how noble a man he is by selling drugs at a lower price than his European counterparts, and how those ruthless, clinical men, whose only purpose in the film is to raise their hands like kids in a kindergarten when asked a question, want to assassinate him for jeopardizing their business. At that time, Don is in Thailand to receive his drug-shipment. However, that facile mission goes awry when the naive men try to kill him, ignorant of the fact that Don's awesomeness at slaughtering people like pigs. So, after filling about a dozen coffers of hell, he returns to Malaysia and surrenders himself to Roma (Priyanka Chopra) and Inspector Malik (Om Puri). Whether that falls under the purview of his dictum of 'Don ko pakadna mushkil hi nahi namumkin hai'- a little too Napoleonic - is debatable.\n\nThe reason he goes to prison voluntarily is the oldest one in the book - he wants a cohort for his future undertakings - and who would that be but his old arch-nemesis, Vardhaan (Boman Irani)? Don, femme fatale Ayesha (Lara Dutta) and the scowl-faced Vardhaan travel to Switzerland, hire an Indian bad-ass called Jabbar (get the ingenious Gabbar inclination?) played by what looks like a wooden plank, make plans and blackmail high-placed officials, with the sole purpose of extorting the Vice-President of Deutsche Central Bank - just the act of a man who can't differentiate between intrepid and asinine.\n\nThe image of a Don cultivated by classics like Godfather and Goodfellas is mercilessly disemboweled by Shah Rukh Khan. Don isn't who he ought to be; not suave, not debonair, instead he strikes a figure of a playground bully given access to a lot of power and wealth, which makes that prestigious title a mere aggrandizement. A Don is a man of respect, who bestows favors upon others and stands up to the status quo, not an avaricious crook who steals because he thinks that the millions of dollars in his bank-account aren't enough.\n\nHowever, at the same time, he is portrayed as a narcissistic God-like figure that commands pawns on a chessboard, which is a blatant character-contradiction. He can either be the sophisticated man driving fast cars and wearing masks or the absolute play-maker who has everything planned out without getting his hands dirty - either Ethan Hunt or Michael Corleone. Between masquerading as the two, the movie seems to get befuddled by what kind of man it wanted Don to be, and the mouthing of dialogues in a Bale's Batman-esque, hoarse voice makes that all the more palpable.\n\nDon 2 lacks the adrenaline-pumping action sequences that you would expect from the film. For some unfathomable reason, the movie restrains itself on the edge-of-the-seat, hair-raising stuff that are an exigency in a movie that terms itself as a member of the action genre. Instead of a classy tuxedo that gorgeously embraces the body, the action comes across as a pair of socks that fit loosely around the legs.\n\nThe film is a farrago of movies that have already graced theatres in their days. After shamelessly plagiarizing the poster Batman Begins' poster for Ra One, he borrows heavily from a plethora of movies in Don 2 too. The bank-heist (some originality, that) is an Ocean's 11 casino- heist rip-off, some of the action is plugged from Die Hard and the part in the jail is nothing you haven't seen in a hundred different places. Zurich has been shown in a manner similar to The Bourne Identity and even Vardhaan's demands from the cops towards the end is Dog Day Afternoon done again and done horribly wrong. It is here that the movie - makers forget the basics of cooking - while making a dish out of stale food, conceal the fact well.\n\nThe crescendo is what Bollywood is notorious for serving. Shah Rukh speaks the usual mawkish, romantic lines to Priyanka as they enter the battle-field, a bullet in the fleshy part of the waist miraculously doesn't kill a person, Shah Rukh goes berserk and tops off a few guys with WWE inspired pyrotechnics, and the film culminates with a shoddily done 'surpise!' But the Jack in the Box is marginally better than the rest of the movie itself, which isn't really saying much."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vipin-v87",
        "review_rating": "10",
        "review_title": "Excellent Xmas & New Year...Njoy with the DON",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ganguly-sarthak",
        "review_rating": "2",
        "review_title": "Definitely not the worst movie of Shahrukh",
        "review_detailed_main": "A pathetic , brain less, Hollywood copy movie . The Don does not have any team, always looks like on a fashion show, practicing 100 different face movements .\n\nI am not surprised, Shahrukh is not capable of doing anything better , but utterly disappointed with Farhan Akhtar , never expected him to work on such a weak plot .\n\nDon has been portrayed more or less as a superhuman who works alone and have amazing (supposedly) gadgets . The dialogues are weak , the connection with the earlier Don fragile and the overall plot ... lets just say Veer-Zara looks like \"godfather\" in front of it .\n\nIf only the criminals knew it is soo easy to get the blueprint and all details of a super safe bank vault and it is soo easy to rob , I pity the bank robbers ! ! All you need to worry about while robbing a bank is your own people , everything is else is a piece of cake .\n\nThe characters are built extremely weak , the plot even weaker . Who knew running away from a prison was soo easy . It's merely child's play .\n\nI don't know what i watched - a love story , movie about \"THE DON\", a bank robbery movie , or a movie about cheeky smiles , cheesy dialogues or a gangster's remorse .\n\nI seriously hope Amitabh Bacchan doesn't commit suicide after watching this . And to Shahrukh , eagerly waiting for your next crap !!!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "aviblaster",
        "review_rating": "10",
        "review_title": "just one word......superb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "jayendran-suresh",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "akshaydv",
        "review_rating": "8",
        "review_title": "Excellent movie !! Must Watch !! Best of all Bollywood action movies !! Definitely watch this movie !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ssunny-social",
        "review_rating": "5",
        "review_title": "Don 2 may just be the movie to cure Ra,1 nightmares!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kartik051079",
        "review_rating": "10",
        "review_title": "DON2 Movie Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "alkingson",
        "review_rating": "1",
        "review_title": "Back movie",
        "review_detailed_main": "No story line..starts with typical Hindi movie question \"We need software engineer\"..who can crack everything easily...no background how they got all this modern technology equipment's and no background about software guy why and how he is so good..everything very 007 type but 007 had so much backup Don does everything solo..Guys look so girly in jail..Almost everything copied from so many Hollywood movies..Please wake up audience we need better movies from our big stars or our industry will fail big time..Don 2 is a big disappointment, Mr. Shahrukh needs to make more with Indian background and try to show problems happening in India..I saw MI4 and then Don 2, In Don 2 I almost left after interval...Direction was bad as well..and what is Ompuri and Priyanka chopra doing in the movie anyone please answer me that?"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kingbadshah6",
        "review_rating": "10",
        "review_title": "awesome",
        "review_detailed_main": "Barely ten minutes into the film and you are sold to his Don who is back with his eviler designs and delectable wisecracks. He is a suitable cousin to Ethan Hunt and Danny Ocean, an anti-hero planning to rob a Berlin bank of its euro printing plates in a daring heist.\n\nTo do so he escapes with his old foe, Vardhan (Boman Irani) from a Malaysian prison giving yet another heartburn to ex-flame Roma (Priyanka Chopra) and veteran cop Malik (Om Puri).\n\nWhat ensues is high octane action, deadly car chases, treachery and of course unpretentious dark humor.\n\nI'm sure the human moments will be missed by some in this slick thriller but then they may have very well worked against the film which has some ruthless men saying very mean things to each other. Well, how can you expect a man like Don to go all mushy over a girl, who puts his enemies under a bone crushing machine and exhorts them to make a right choice by saying \"Main Nahi Chahta Tum Kisi Dabav Mein Koi Faisla Lo.\"\n\nShah Rukh Khan is spot on as Don. Perhaps with this film, he is out of the shadow of the original Don. Now, he can certainly look forward to the subsequent sequels of this franchise without getting compared to Mr. Bachchan.\n\nPriyanka Chopra looks convincing as Roma. She is still not over her failed affair with Vijay/Don, looks impervious to his charm before finally giving in. But remember... it's still complicated.\n\nLara Dutta glitters in her small cameo as Don's liaison. Kunal Kapoor as Sameer Ali, Don's technology consultant, is just okay for his screen space. Hrithik Roshan who makes fleeting appearance as a masquerading Don looks pleasant but sticks out like a sore thumb in otherwise believable Don adventures.\n\nThe script is taut. Music and background score are cracking. Songs don't impede the story telling. The cinematography captures the virgin locales of Berlin in full glory as King Khan goes all wild on German streets.\n\nFarhan Akhtar makes a welcome comeback behind the camera. Undoubtedly an accomplished actor, he should certainly direct more often. A special mention is in order for his writing team Ameet Mehta and Amrish Shah who make Don 2 not only a slick but a smart thriller as well.\n\nSo, while catching Don may be an impossible task for the Police force around the world you can and certainly should catch him at a theater near you."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "bhaskar-agnihotri-114-294004",
        "review_rating": "9",
        "review_title": "Best Sequel Ever Made in India!!!",
        "review_detailed_main": "First I would like to congratulate Farhan and his team of writers for writing a screenplay that was taut and editing that was specially fast which is important for an action thriller movie.We have to accept this fact that we don't have budgets to match the scale of a A grade action thriller of Hollywood.But I was pleasantly surprised to see this film taking on the best of its western counterparts head on in terms of style,technique,presentation,story,screenplay and action.Kudos to the Don 2 team for showing the world that India too can deliver world class Action Thrillers making them at a fraction of a budget.I am now looking forward to Dhoom 3,Krrish 2, Don 3 as Don 2 has redefined slick in Indian Cinema."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vashishatsahil",
        "review_rating": "10",
        "review_title": "The King is back with a bang",
        "review_detailed_main": "Well a perfect action movie finally in Bollywood which by no means is any less then a Hollywood action movie. The plot of the movie was very nicely set, I liked the pace with which the entire movie went on and specially the twists and turns which kept me interested and enthusiastic all the time. The direction and specially story was great, reminded a lot about Hollywood movies like MI,Italian Job, Thick as Thieves. ShahRukh Khan you were awesome with everything you did in the movie.\n\nAlso the other characters in the movie were given roles in which they suited very well.The Love/Hate relationship between Don and Roma was quite good, specially the car chase scene and the other action scenes in the movie were too good.\n\nIn the end just watch the movie, and yes its true that \"the King is back\"."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "Its better we start making films around entertaining SCRIPTS and not STARS.",
        "review_detailed_main": "Coming straight to the point, in true words the film has nothing to do with the cult name DON and its legacy. The writers deliberately link it to the previous remake of the original Don in the start and then later on move on to a completely different path of a planned crime. As a result, all that fun, masti and entertainment associated with the name DON goes simply missing.\n\nIn real terms, DON 2 is a heist film, in which the whole effort is made towards stealing some precious things from a safe vault. The brand of DON is forcibly included to add some extra zing to the project in commercial terms. Otherwise it could have been easily called anything close to Mission Impossible or other famous heist films, which seems to be the sole purpose of Farhan Akhtar to make an Indian film, similar to these world famous series like MI 1-4, Ocean Series, Bourne Series and more.\n\nNow coming to the film itself, it has only one merit to mention and that is its excellent production value which is hugely impressive and leaves a mark. Actions sequences like the opening one and the car-chase on the foreign roads are filmed brilliantly. Cinematography by Jason West is outstanding and altogether we get a technically polished product competing with the world cinema films made in the similar genre. But unfortunately content wise the film fails to make any kind of impact on the viewer in its more than 2 hours of duration. And the major blame goes to its first half which is too simple with nothing exciting or spellbinding happening on the screen against all expectations. Till intermission the film lacks hugely in the entertainment quotient and gives you nothing to cheer or enjoy.\n\nPost interval, its purely the execution of the planned heist which takes too much time to unfold leading to restlessness in the theater. As a typical Hindi film everything keeps happening so easily and nothing ever goes wrong. The codes are broken like a child's play, the guards are fooled like mannequins standing on their duty and the bombs keep exploding perfectly right on their timings. Now its not that something should have happened wrong essentially but the missing point here is that one doesn't feel any excitement and thrill while the team is working on their heist, which in fact has to be a key feature of any movie made in this particular genre. Further, the most painful period of DON 2 comes in its final half an hour, where various un-required sequences keep following one after another as a never ending race and the viewer starts asking, When they are going to end it?\n\nSo as it seems, DON-2 has been written and made only for one man and he is Shahrukh Khan. Truly speaking, I didn't find Farhan Akhtar, the director anywhere in the entire movie and its just a Shahrukh's product all the way which keeps focusing on him alone ignoring all the other important ingredients of a good movie. Shahrukh enters the film with an action sequence (which he does well) wearing a weird kind of getup which doesn't match his own physical appearance. And then he goes on to deliver a worked upon but also an over the top performance trying to impress with some repetitive one liners.\n\nPriyanka Chopra continues with her character of DON and tries her best to deliver something better than the first. But the writers do not give her anything more than the usual. Lara Dutta on the other hand looks gorgeous and happy too being used as a show-piece. Kunal Kapoor plays it cool as a hacker but his character is more confused than confident. Both Boman Irani and Om Puri are simply wasted, but Nawab Shah emerges as a fine performer among these veterans. Hrithik Roshan makes a special appearance fulfilling his duty of a family friend of the producers and he is just OK in absence of any great build up. Besides the soundtrack of the movie is a big disappointment from Shankar-Ehsaan-Loy and may be that is the reason, Farhan has used only one song in the film. However he could have easily dropped that too.\n\nIn nutshell, DON 2 is a movie definitely written after finalizing its cast. Its not a meaningless film with many silly sequences. But the script could have been much enjoyable if added with more fun, entertainment and thrill. It is a heist movie in disguise, which sadly doesn't fulfill the major requirements of the genre. For me it was more a Farhan movie than a Shahrukh film, so maybe I was expecting a lot from the director. Taking too much time on un-necessary things (like the sky jump without any purpose) is not a feature of a Farhan film. So I have my doubts of DON 2 being his film completely.\n\nFurther, I am really not in favour of making Re-makes and then even making a Sequel of a Re-make quite shamelessly. And here is what I feel about making a sequel of a re-make.\n\nIts fine that you are making a Re-make after taking due permissions, but how can you go on making a sequel of that re-make claiming it to be your own creative property. Now for DON 2, I hope Farhan must have taken the same permission again from the Producer & Director of the original DON to make a sequel of their Cult film (or he may have got it at the time of making the re-make only). If yes then Farhan is a true flag bearer of experimental new-age cinema. But if he didn't then I would like to call DON 2 – an illegal second floor made on a rented house by the tenant himself."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "swaranchakraborty",
        "review_rating": "10",
        "review_title": "Is this Bollywood????",
        "review_detailed_main": "There are times when we have wondered why Bollywood is lagging behind Hollywood so much?? We have got genuine actors, directors, technicians, etc. but we have still lagged behind our counterparts.\n\nThen comes a film like DON 2. we watch it and wonder how suddenly we have come so close to Hollywood. Real close!!! Films like DON 2 are responsible for breaking the quality barrier between us and them. We have watched films like Mission Impossible, Bourne, James Bond and wondered, when will India have its own Hunt, Bourne or Bond. Here, we have it - DON.\n\nThe entire credit goes to Farhan Akhtar. He is a genius. He is the best modern generation director. He understands the mentality of Indian Urban Educated Youths (I.U.E.U.). Since Dil Chahta Hai, he have made movies for this segment of the society and people have loved him for it. With this movie, he has proved that he can excel in any kind of genres including action-thriller.\n\nThe performances were superb, especially the performance of Shahrukh Khan. He acted effortlessly as if he was really a Don in the real world. The other actors were also good but the whole film was a SRK show. The entire screenplay was focused around Don.\n\nOn the whole, Don 2 is not a perfect film but considering Bollywood, it is a film which exceeds the expectation of all Bollywood Lovers.\n\n10/10"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "iswapy",
        "review_rating": "5",
        "review_title": "what do you want from a sequel ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pokerthatownz",
        "review_rating": "8",
        "review_title": "Amazing entertainer.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "king_dar",
        "review_rating": "10",
        "review_title": "Simply brilliant!!",
        "review_detailed_main": "People r saying that don 2 is like a Hollywood movie but i say it even surpassed Hollywood!! these kind of movies r released once in a decade. Shahrukh has slapped the whole media who criticized his career by Ra.One. But king has proved himself!! and direction is awesome and Srk's acting is out of this world!! this movie worth several time watch. Absolutely brilliant movie. it starts where it ends in first don and the story goes so clean throughout the movie. realistic action, superb attraction, superb acting, and breathless sequences. this movie will not let u even blink ur eyes. hats off to all the team of Don. And specially director and the producers of movie for giving us such a gr8 movie."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ali-caretech",
        "review_rating": "8",
        "review_title": "The Perfect Crime",
        "review_detailed_main": "The reason, I went to watch the first day first show of DON2 was not Shahrukh Khan, it was Farhan Akhtar and this movie reinforced my belief that Shahrukh Khan is declining force and Farhan Akhtar is the emerging super power of Bollywood. The direction of Farhan Akhtar coupled with the smart script outperforms all other expects. Farhan Akhtar has not disappointed in any of his film whether acting or directing. He is the force to reckon with in coming years. Well, talking about Shahrukh, he did not a bad job but still his acting was over the top. While watching Shahrukh in the movie you never get the feeling of watching a don. He was pushing too much. I personally feel Amir Khan could have played this role much better. Priyanka Chopra did justice to her role. She was looking beautiful and the role suited her well too. Last but not the least script was superb. I remained glued to the screen throughout and i must say the script was \"A PERFECT CRIME\""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ron-murmu03",
        "review_rating": "5",
        "review_title": "May be an effort towards better Indian Crime,Drama Movies.",
        "review_detailed_main": "OK lets chuck the fact that I don't exactly like Shahrukh Khan when it comes to something like action,I mean he is a good actor when it boils down to movies like Swadesh and Chak De India but he should really accept the fact that movies like Don should not be his cup of tea.Though there are many people who have loved this movie 10/10 but that is purely because of the fact that they love SRK and they don't exactly get movies so let me tell you in short what is actually in this movie without any spoilers (well there is nothing worth calling a spoiler in this movie).Indian South Asian Crime lord dreams it big and plans to get Europe now.Interpol is after him and strange enough all the lead positions in the globe are held by an Indian.Bad dialogues never end,horrible soundtracks popping in throughout the movie,amateur acting and yes predictable storyline.But the only good thing about the movie can be that maybe its a new start for Crime,Drama in Bollywood."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "varuna12",
        "review_rating": "10",
        "review_title": "Its true! Don 2 is much much much better film then MI4!!!!",
        "review_detailed_main": "And its better on many levels! But I am not here to compare these two movies!\n\nDon2 is a Farhan Akhtar film and I have blind faith in this chap! He and his team has consistently contributed to Indian cinema with films that are class apart from rest of the Bollywood products! There always are high production values, world-class-level sensibilities, wonderful performances, awesome-awesome cinematography (I am fan of Jason West now!!!), brilliant cutting and music that gradually grows on you to an extent where it just settles in your mind forever!\n\nDon2 is a very well made film. It is a perfect example of how a sequel should be. Shahrukh, Priyanka and Boman with the rest the rest of the awesome cast including the great Om Puri, have all made this film a delight to watch. There performances are subtle, realistic for cinematic sensibilities and most importantly believable!\n\nThere is no time wastage with any stupid comic relief scenes and none of the actions shots are repeated in slow motion to exaggerate action in film. Shot entirely outside India and with precision and awesome lighting and camera-work, this film is worth keeping in a library to be saved forever in case the world is about to be destroyed.\n\nFew have compared the film to MI series and Ocean's Eleven series but trust me, it out does them in a very significant manner. All the action, storyline and the gadgetry is believable and realistic. For example when Don is escaping, there is sense of 'doubt' and 'mild uncertainty' that shows that he is not someone supernatural or super-heroic. He is just smart, clever and wise!\n\nI can talk a lot about the film her but basically what I am trying to say is that this film is really good and it needs to be watched!\n\nDon 2 is massive jump in the Indian standards of filmmaking and hopefully other filmmakers will get inspired by this film to up there cases!\n\nLastly, watch it in 3D! Its mindblowinng! So far we 've only seen Tron n Transformer in 3d which are full of mindless mental action but here we can see normal world scenes in 3d and they look beautiful!\n\n* * * * * * * * * * (10 Stars!!!)"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "dileepkumarb",
        "review_rating": "5",
        "review_title": "Don 2: SRK staves of his lack of lustre from Ra One",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ravindra-lb",
        "review_rating": "10",
        "review_title": "Sharukh Khan raises the bar as Don",
        "review_detailed_main": "Firstly I have to appreciate Sharukh Khan for his stellar performance and Farhan for directorial skills. SRK's acting is amazing and he simply takes audiences off the seat. Thanks to his great stylish looks and swift dialogues. The scene where SRK takes off his Hrithik Mask is just so believable. His want to loot the Euro currency plates and not the money there shows what Don stands for!! The ragged looks from the Prison scene to the clean stylish looks in the title song is a treat for the audiences. Priyanka, Kunal and Boman star with their acting. I must say that this stands out to be my best movie of the year and would love to have my personal DVD of this to watch again and again. This movie has come a long way from where Don first part had left you. Don 2 lives up to the expectations of what one would like to see in a Don movie. Kudos to the entire team for making a swashbuckling action thriller movie.."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "dude-debashish",
        "review_rating": "8",
        "review_title": "Shah Rukh back into d mainstream but in his own \"Style\"",
        "review_detailed_main": "This one starts right where the first one ended. Don 2 is a roller coaster ride with all the thrills,chills n smartness required! Music (background score incl.) could have been much much better, though I really commend that only one lip sync song was there and that too going with the flow of the story,no one would really miss the running behind the bushes type of a song. Coming to the direction it was quite good but the pace lacked in the initial few mins. And then the performances by one n all were A-class, SRK leading the pack like a Badshah,he was just superb a definite 10/10 for him! Priyanka,Boman,Kunal all were top notch! Om Puri wasn't given the best of lines though,a veteran like him deserved a better treatment. And last but not the least the locales,cinematography and action sequences were just fabulous. All the money spent is well worth and the whole country should be proud by this growth in film-making ! Bottom line: All SRK fans and even not his fans come watch a Game Changer in the lines of Mainstream commercial Bollywood movie. A must watch!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "devi_aarch",
        "review_rating": "10",
        "review_title": "Awesome and Amazing... Not to miss this one.",
        "review_detailed_main": "I watched this movie yesterday. It is really amazing. Unlike any other bollywood movie that i have ever seen. Its fast and does not have the typical music and dance of Hindi films. Don't miss this one. You have to watch it. I will also vote for this movie to be best of this year with a best actor award for sure... SRK did it again... superb. This movie is directly comparable to an English standard movie. Action is great. SRK looks good in this movie, with the long hair at first and also the short hair afterwards somehow makes him the way he was when he first entered bollywood, like an enthusiastic freak. It is all in this one. The dialogues are great. Farhan did a great job with this movie. Priyanka did a good job too. I will watch it again soon. Love this one."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "devvrathk",
        "review_rating": "1",
        "review_title": "awful",
        "review_detailed_main": "cant believe this is Farah Aktar film, who made \"Dil Chahata Hai\" and the people who have given 10 star and good ratings, i seriously doubt if they watch movies regularly or may be they are just paid to write the good reviews.\n\nA sane person will not give 10 star to this movie.\n\n************** IMDb want me to waste 10 lines for this movie *****, sorry guys cant believe this is Farah Aktar film, who made \"Dil Chahata Hai\" and the people who have given 10 star and good ratings, i seriously doubt if they watch movies regularly or may be they are just paid to write the good reviews.\n\nA sane person will not give 10 star to this movie."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "donhaidari",
        "review_rating": "10",
        "review_title": "An Unprescedented masterpiece from Bollywood",
        "review_detailed_main": "The acting is superior, the dialog's are crisp, the cinematography is pure perfection, the direction is nimble and crafty, the style is Bollywood and srk is dynamite. If you have not seen this movie yet, well you must. Finally bollywood has managed to conjure an epic masterpiece and you want to miss it??? Do yourself a favor, and refrain from watching the same old remake mas-alas that has been overflowing in Hindi cinemas and expose yourself to ingenuity, originality and beauty!!!\n\nSrk is Redefining the meaning of bollywood. From the very first moment we see SRK enter the spectrum, we sense the aura he emits and the superiority he brings. He flawless acts the Don. Pryanka Chopra is probably the weakest link of the movie but she does her job with gusto. Boman Irani as usual delivers high caliber performance. I will not expose even a minute of detail regarding the plot so as not to ruin the experience. Just check it out now."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "donald-hitk",
        "review_rating": "1",
        "review_title": "Farhan Akhtar Disappoints",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sawanjot",
        "review_rating": "10",
        "review_title": "The Best Action movie from India.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "seetamayya",
        "review_rating": "10",
        "review_title": "STUNNING !!! EPIC !!! Best movie from Bollywood EVER !!!!",
        "review_detailed_main": "DON2 is a true master-piece and the first true international movie that Bollywood has ever made . I was left speechless viewing the grand-scale of the movie that matches or even surpasses many of Hollywood slick action-thrillers like MI-series , Bourne-series & Oceans-series .\n\nThe plot of the movie is better if kept a secret here because I would have to give a lot of spoilers right away then though it's a heist story . It has some unthinkable twists and turns and a thrilling climax to boast off .\n\nThe movie is slickest and most stylish action thrillers ever made that has witty one-liners by SRK and even the other actors . It moves at break-neck speed and is devoid of the usual songs / drama of usual Bollywood movies that i hate . Locales of BERLIN , ZURICH , THAILAND & MALAYSIA are simply breath-taking.\n\nPerformance wise , SRK-King Khan excels once again and carries off gorgeous drop-dead looks with loads of attitude and charisma . His walk and talk is brilliant. Priyanka Chopra and Boman Irani are superb .\n\nGo For It because it's the best of Bollywood and it easily beats the recently released MI4 in every frame . You are going to love it whether you like or hate Indian cinema .\n\nEPIC !! EPIC !! Next Level !!!!!!!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pakkudeepuxxx",
        "review_rating": "10",
        "review_title": "What an excellent return of King........ It's amazing!!!!!!!!!!!!!",
        "review_detailed_main": "First thing first, director Frahan Akhtar has taken crime thriller to a new level with Don 2. In one words, Don 2 stands parrallel to Hollywood's Mision Impossible and James Bond movies.\n\nThe action sequences of the film is not lacking behind Hollywood movies. You will love to watch fight, car chase, destruction and demolition scenes of the movie. dailogue delivery in the fim is also brilliant but the film lacks on emotional quotient.\n\nAfter playing negative roles in Darr and Bazigar, Shah Rukh has taken the villanious role to another height. He is arrogant, wicked and agile. Don is like a wild cat, who has no emotions.\n\nThe film starts from the climax of the previous film, where don surfaces in Thailand. He creates mayhem and destruction in Thailand but in a surprising move, he surrenders before his old enemy cop Roma (Priyanka Chopra). After surrender, Don is sent to a Malaysian prison. From where, the movie actually takes off to brilliant journey of conspiracy to steal the currency plates of Euro from a high security vault in Berlin. You must love to watch jail break sequence of Don along with old foe Vardhan (Boman Irani).\n\nYou must book your show for the movie on the Christmas eve. For its brilliant script and action sequences, the movie deserves 10 Star rating."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "prashant-mittal3",
        "review_rating": "3",
        "review_title": "awful movie.. a poor copy of Hollywood again..",
        "review_detailed_main": "i didn't see it in a multiplex but on my laptop, but frankly speaking i wasn't able to bear this movie. after watching it i wondered why i wasted my 2 hours on such an awful movie. In Don 1 Sahrukh did some good job and the story was almost same as Amhitabh's Don.\n\nbut here, there is no story line, looks like mixture of a bunch of Hollywood movies like Die Hard 1, MI1 etc.... in trying to add more suspense and twist the movie lost it's significance....Don knows everything... his partners and police force are complete fool...In the end he knows that Roma will not shoot him even after he killed her Brother..\n\njust some actions and some dialogue are good but you can't enjoy a movie without a significant story and characters...."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "nmondal",
        "review_rating": "8",
        "review_title": "The slickest action movie ever done in Bollywood. PERIOD.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mr_speedy001",
        "review_rating": "5",
        "review_title": "A one time watch",
        "review_detailed_main": "The movie is surely a one time watch BUT IN 2D. please don't waste money in 3D. i personally enjoyed the movie. its neither a roller coaster ride nor a slow mo movie.\n\nAt the end they show that don still likes ROMA (priyanka) which is just useless. well i agree its a Hindi movie so such stuff are expected.\n\nat the end at usual its a win win position for DON showing that he had a master plan of his own apart from what he said to others.\n\nJUST LIKE 1st Part\n\nWhat to say. after all he is DON\n\nso its one time watch."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "smohanta09",
        "review_rating": "8",
        "review_title": "Amazing!!!",
        "review_detailed_main": "Today, finally I watched the much awaited movie DON 2. Really need to appreciate the impeccable vision of Mr. Farhan Akhtar who makes everything so perfect about all his movies. Say it is the sets, the environment or just the look and feel of the movie, everything stands out.\n\nSame goes with DON 2 as well. The feel of the movie went exactly the way it was meant to be. Amazing action sequences, and not to mention the extraordinary styling of the superstar Mr. Shah Rukh Khan suits the mood completely. No doubt this movie would not be the way it is without him. Say him with the long haired rowdy look or the clean shaved; he just makes it amazing to watch on screen. Boman Irani did his part as usual good. Priyanka Chopra did her job well.\n\nSuperbly written dialogues, much better presented by Mr. Shah Rukh Khan.\n\nTalking about the story and the flow of the movie, the first half was just above average, seriously speaking all that made the first half work was SRK. Second half is what the movie is all about how the actual plan works out. Amazingly executed, keeps the grip of the story as well as the viewers' attention. Good to see only one song in the movie, too many songs could have killed the tension anyway, again the credit for it goes to Mr. Farhan Akhtar. Throughout the story you kind of guess that something is coming, there is a catch to it even then you get dumb struck when you see how the suspense gets revealed.\n\nAmazing work everyone, brilliantly done, and it won't be a mistake to say that the new era in the way the Indian movies are made has changed and a great contribution in it goes to Mr. Farhan Akhtar.\n\nMUST WATCH..... 8/10."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "afazbesu",
        "review_rating": "10",
        "review_title": "A worth watching movie from Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "afterbuddha",
        "review_rating": "10",
        "review_title": "Very Stylish - No one could have played Don better than SRK!!",
        "review_detailed_main": "I would officially rate this movie 8 out of 10. But the only reason i am giving it an extra 2 is because Farhan Akhtar finally made this movie!!\n\nShahrukh plays the role mind blowingly. He looks great and has acted well.\n\nThe direction is sharp and editing is crisp.\n\nPriyanka Chopra has a good small part where as Lara Dutta is there just for the sake of being there.\n\nOm Puri's acting was not appealing. i found it fake. I don't know why.\n\nBoth the villains are good.\n\nThank God, there are not much songs!\n\nFinally, a great movie to watch, coming from Indian directors other than typical crazy love story movies!\n\nSRK has proved that he is the ONLY DON.\n\nAlso, its much - much better than RA.ONE! :P"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "superman550",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "faizanfazal",
        "review_rating": "10",
        "review_title": "DON 2 = \"King of Crime with Amazing Perfection & Attitude\"",
        "review_detailed_main": "-I would not disclose the story at all, as it is the must watch movie in CINEMA- The Questions arises why should you watch this Bollywood ACTION/THRILLER/CRIME Movie ? There are many reasons. 1-As we all know this is the Sequel of DON (2006). 2-I bet, that this is the BEST REAL ACTION Movie of all time from Bollywood which also out classed some Hollywood Action Flicks. 3-Charming and Out Class Acting by Shahrukh Khan as DON. (Will Surely win tonnes of awards) BECAUSE THE KING IS BACK. 4-Storyline, not that complicated but beautifully crafted with twists and suspense. 5-Cinematography, just one word AWESOME. 6- Visuals and Sound Effects are just Unbelievable. 7-Superb Direction by Farhan Akhtar.\n\n-It was looking like that ETHAN HUNT (TOM CRUISE) is on Mission Impossible but in MORE DANGEROUS, DIFFERENT, CHARMING and in MEANER ATTITUDE-\n\nNow, Bollywood has its own ACTION/THRILLER Series."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "chirag-shah86",
        "review_rating": "3",
        "review_title": "typical bollywood action flick...No originality and all gloss",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "rahul-p-1985",
        "review_rating": "10",
        "review_title": "Don 2 - The most stylish and closest to Hollywood action thrillers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "theenterson",
        "review_rating": "9",
        "review_title": "Move is good",
        "review_detailed_main": "The movie is good but it's lacking in some parts. This is one of only bollywood movies were action is real and not those bs action were you push a guy and he flies km away. The only part that disappointed me was that srk was to skinny, he was underweight, he should've gain some weight so he really looked like \"DON\" not some guy that is skinny, His biceps were pathetic i gotta say Jhon would do a better job overall the movie was good. the story had good twists and the movie had only two song, it was a fun watch\n\nA must watch\n\nsrk was to skinny, he was underweight, he should've gain some weight so he really looked like \"DON\" not some guy that is skinny, His biceps were pathetic i gotta say Jhon would do a better job overall the movie was good. the story had good twists and the movie had only two song, it was a fun watch"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "duggal-ashutosh",
        "review_rating": "10",
        "review_title": "Shahrukh khan proves that he is king and he is back ....Seriously KING IS BACK",
        "review_detailed_main": "shahrukh khan is back.As we all know that his earlier movie Ra one doesn't match with the expectations.This time Don 2 will exceed your expectations.Everything is good in this movie.Farhan Akhtar's direction,story,screenplay and acting by star cast , everything is excellent.Farhan Akhtar story narration is perfect.There are lot of car chases and action sequences in the movie which are superb.we can say the action sequences are all logical and are not seen before in any bollywood movie.i would go with 9 stars to this movie but i give extra star just because of SRK !!!.Shahrukh khan is perfect in this film.He acts with so ease and gives charisma to his character.he portrays the role of Don beautifully . Those who are not fans of Shahrukh khan must watch this movie.They will definitely start liking him because his performance in this movie is endearing.So its the best bollywood movie of 2011 and all of you must watch it with your family.The movie has a repeat value too because of its BAAP DIALOGUES !!! and Shahrukh khan's performance.Go For IT !!!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pratyush",
        "review_rating": "3",
        "review_title": "Slow, lack of story in the middle. Avoid it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "marshallvernoncse",
        "review_rating": "10",
        "review_title": "Brilliant,Trilliant,Zilliant Acting and Direction",
        "review_detailed_main": "Best Shah Rukh Khan Movie, Best Bollywood Movie, Best Indian Movie. A movie with no crappy emotions , no songs, no matrix style cheap action. Most deserving Indian movie that deserves to be compared with Hollywood style direction and acting. Hats Off to SHAH RUKH KHAN - THE KING IS BACK WITH A BOOM. People who don't agree with me, sorry its not your mistake its your EGO ,you cannot accept that the KING delivered India's finest movie till date Don 2. My most favorite part was the dialogues, delivered perfectly by the KING. Most of the audience were complaining about the music of the film,my opinion is that its a movie not an album, the background score was perfect for the film."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sawhney_g",
        "review_rating": "3",
        "review_title": "Another crap movie in a line of blunders by SRK",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "alimurtaza780",
        "review_rating": "10",
        "review_title": "a very nice movie contains awesome dialogs but the 3d...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pavan-karguppikar420",
        "review_rating": "10",
        "review_title": "Don 2 is action packed entertainment and completely one man-SRK show.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mohd-saqib-shehzad",
        "review_rating": "10",
        "review_title": "King Khan at his BEST!!!!!!",
        "review_detailed_main": "Don 2 is indeed a very fast paced, full of style, well scripted and a must watch for all movie lovers. SRK has done it again. The movie has got a very neatly scripted story line that is very suave and stylish in nature. All the action scenes are amazingly shot and SRK is excellent right from beginning till end. All the actors have done justice to their roles and Farhan Akhtar has proved his story telling capabilities once again. The movie keeps you glued to the seat and don't let you think of any other thing. SRK has delivered a power-packed performance once again and rightly proved why is he called the KING of them all. I would like to congratulate the whole team of Don 2 for making such a nice movie which will be long remembered for its style, performance and Hollywood style action."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Panning out to a franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "planktonrules",
        "review_rating": "5",
        "review_title": "Non-stop action...and not much more",
        "review_detailed_main": "I enjoyed Shah Rukh Khan's remake of \"Don\". While I normally do NOT like action/gangster films, this one worked for me because although the identical stranger angle was ridiculous, if you put that aside and just enjoyed the film for what it was, it worked well. So, it's not surprising that I would then watch \"Don 2\"...a film which did NOT exactly captivate me. The biggest reason, simply, is that it was a film that was all action....and nothing else....and much of it made little sense.\n\nThe story begins with some drug dealers in Europe meeting to discuss Don. It seems this Asian drug lord is looking to Europe...and they don't want to lose their grip on the drug trade. So, they hire assassins to kill him...leading to the dumbest scene in the movie. The 20 or so assassins all have guns and several are only a few feet away from him...yet he manages to kill them all and escape!! Right then, I knew I was not watching a great film but one that requires the audience to turn off their collective brains in order to enjoy it.\n\nWhat follows is a complicated caper where Don orchestrates the theft of plates so he can print Euros. But he chooses a bunch of men who hate him and have every reason to betray him...leading to the betrayal that pretty much everyone watching expects.\n\nSo is it good? Yes and no. If all you want is action and a few twists, you'll love it. If you want more depth and believability, then try another film. As for me, I just had a hard time caring for such a smug and evil man...and the film was a time-passer for me and nothing more."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "prashant-s-jadon",
        "review_rating": "8",
        "review_title": "\"If you don't like DON, you won't like DON\"",
        "review_detailed_main": "Seriously amazing! Only word comes in the mind when we leave the theater. I haven't seen any Indian action movie better than this. Acting: SRK as SRK :)the way he carried DON..fabulous Job..In movie DON takes time to grow on you..but when it does, you will love the charm and wittiness. having said that, DON is not charming all the time..he can be really very furious at times. I think that part of his character is tricky and must say well managed by Shahrukh. Priyanka has done full justice to Roma's character. the turmoil in her heart when DON is around is clear and expressed elegantly. Besides looking vivacious she has performed well in action scenes also. Boman Irani is once again at his very ease and delivered couple of very good ones unfortunately hasn't got the opportunity much besides climax. Direction/Cinematography: Direction is good and sometimes great. By far the best in recent time for any action or thriller in Indian cinema. Only small portion which lacks some great camera work is chase sequence between Roma and DON, that has a bit bigger margin of improvement. Fight scenes are brilliantly choreographed and raising the bar for Indian films. Screenplay/ Dialogues: Writing is very slick and very neat\u0085has necessary twists and turns. Dialogues are awesome, exactly what a character like DON needs. Not only DON, Vardhan and Roma also have there little shares. 8 out of 10, but +1 for being a breakthrough in Indian film making style. Between writing this \u0085I am feeling like watching it again\u0085that's the beauty\u0085you will never feel you had enough of DON."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sriramthestranger",
        "review_rating": "4",
        "review_title": "No logic!",
        "review_detailed_main": "The plot starts straight away from the last lines of Don. The story goes wayward and raise eyebrows. Don conveniently surrenders to the police and still the police accepts his demands - Should I say Wow!! (or) WTF?!. Shah Rukh Khan pulls off everything so well that is the only saving grace for the viewer to forget about the poor script."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "abhierum",
        "review_rating": "10",
        "review_title": "Don 2 can be called a well made film in almost all aspects.",
        "review_detailed_main": "In an Iconic scene in The Godfather (1972) , Marlon Brando ( Vito Corleone ) delivered a sarcastic dialogue that is remembered as one of the greatest in Motion-Picture history , He said and i quote \" I'll make him an offer he cant refuse \". 40 years later comes another such character played by Shah Rukh Khan who asks an interpol officer and i quote \" Make me an offer I cant refuse \" .That my friends is DON . A Man who will make you feel threatened even when you have him at Point-Blank range .\n\nDon would do everything in a manner that is as stylish and sleek as possible and would not want to do it without anyone knowing as other criminals would but he would rather flaunt his intellect . He would say dialogues in his praise and keep an associate or foe until he needs them .His intension of a chase would not be to escape but to tease the cops and make them follow until he convinces some superficial contentment of his . To play a role with such characteristics requires an actor who can convince them and as the director of the film Farhan Akthar says , No one but Shah Rukh Khan can play DON .\n\nThe first film had don take over the Asian underworld , this film deals with how don enters the European underworld with an intension to carry out a robbery in which he wants to attain the printing plates of 100 and 50 euros . A master plan is evolved followed by a dramatic ending . Don 2 is the best Indian film in the action-thriller genre and manages to be one of the best sequels made so far in bollywood . It can be called a well made film in almost all aspects .\n\nFrom direction to cinematography to costumes to production design , everything is of a certain standard that defines the sleek theme of the film and its main protagonist . Farhan Akthar is amazing behind the camera and has kept up to the tag of being a sensible film-maker who is wonderful at his craft .\n\nThe action and stunt sequences are done with a certain classy impeccable finish , the fight sequences are done with a real-time camera without any effects at all . It has car-chases A rope-fall from a 300ft building , hand-hand combat , gun-fights and many other constituents of an action film . But the romantic angle towards the end is what will make it standout from other global films of this genre . Trust me every portion of the film including the romantic track will seem realistic and appropriate .\n\nAll the performances are well done , Everyone does their part in the supporting act , be it Boman Irani ,Kunal Kapoor , Priyanka Chopra , Om Puri or the rest of the supporting cast . But then it is very difficult to stand out when Shah Rukh Khan occupies the same frame as you . He dazzles in this role that he effortlessly plays .\n\nThe caption of the film is a little deceiving , It reads \"THE KING IS BACK\" , but then he was always here and with this film , he has only reiterated his rule . DON is a role tailor-made for Shah Rukh Khan. He mesmerizes in every scene , every dialogue , every expression . He defines power in a cool and sleek manner . He makes negativity seem attractive . His performance is above par and reminds you of his timeless classics Darr and Baazigar. His dialogue delivery is magneficient and has that smartly evil tone to it . For all those who criticise him on various levels even after such performances , here's a note tweeted by a shahrukh fan in Austria : Is he the best actor ? maybe not , the biggest star ? maybe not , The best human being ? mybe not ,The best marketing strategist ? maybe not . Then what is he exactly ? He is just Shah Rukh Khan ... The King of a billion hearts .\n\nThe film is well paced and will entertain you throughout , especially in the last half-an-hour . The twists and turns are well placed , with the obvious turning to be oblivious to the eye . Shahrukh is looking his best and gives one of his greatest acting performances till date . Its a movie experience one cannot miss this year !\n\n5/5 says the die-hard crazy Shah Rukh Khan fan in me , 4.5/5 says the analytic critic in me . This could by far be the worst review i have written , for my vocabulary is deficient when it comes to being able to efficiently review this film .\n\nReview by , E.A.Abhishek ."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "careyrajan",
        "review_rating": "10",
        "review_title": "Simple PLOT-good execution",
        "review_detailed_main": "farhan akhtar took a simple plot , but executed it in a stylish way.\n\nDON 2 isn't a perfect movie but it is a good one, it needed a complex plot and a similar execution to get a 10/10. Well...\n\nthere are cons and pros in the movie\n\ncons- sluggish execution of screenplay.\n\nlara dutta characterization.\n\nOrdinary Music\n\nStraight forward plot.\n\nNow the pros---\n\n1. Direction 2. SRK as DON characterization 3. Action Sequence 4. Ending.\n\nDON 2 is a good movie, it has a decent 1st half and a great 2nd half..but as a farhan akhtar fan you crave for more....just wanted to give a 10/10 . Couldn't...\n\nNevertheless a good comeback from SRK after Ra.one mishap...DON 3 must be better...and Priyanka chopra needs a sterner characterization.\n\nAction concept has done an incredible job...hats off to them, Shahrukh has always been accepted in negative roles."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vipukar",
        "review_rating": "10",
        "review_title": "A must watch action flick with SRK giving yet another awesome performance !",
        "review_detailed_main": "A complete entertainer with exemplary performance from SRK. His entry is worth watching a 100 times. Action sequences leave you spellbound. Kudos to Farhan Akhtar for his excellent direction and superb dialogs. First time in Bollywood that a sequel overpowers the prequel. Even in such intense action mood, Srk manages to bring humor in some scenes with Priyanka. Arjun Rampal could have been used in place of kunal kapoor but he does justice to his role. The Currency plate robbery is meticulously planned and is very well shot. The twists and turns in the movie are sure to surprise many. Hrithik Roshan also chips in with a 5 minute role. Go and watch this for a couple of hrs of a thrilling ride.\n\nThis season you want to be anything but... The enemy of Don. And finally Don's Ducati number plate in the end says ...there's more to come !!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "jatinv-58625",
        "review_rating": "1",
        "review_title": "Srk is king of overacting, most chutiya actor",
        "review_detailed_main": "Srk in don2 is hype of overacting, he doesn't fit in action role\n\nCompletely waste of time\n\nToooo much overacting from srk\n\nI don't why his fans think don2 is best bollywood action film 😂😂 , he should stop acting 👎"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "staindoutside",
        "review_rating": "8",
        "review_title": "Finally a BOND in Bollywood",
        "review_detailed_main": "I have been on a travel and came across to watch this new outing by Farhan Akhtar, Just to be clear in the start in order not to have this Review as biased. I have always liked Farhan's work as it shows his talent and horizons on how to approach a certain story. This movie has it's good and bad, lately i have seen Shahrukh Khan's movie and my last best of him was Chak De India, His other movies may have done business or may have broken or not the records at box office. In terms of approaching a new character and taking it to a next level, this is what he has done in Don 2. I have thoroughly enjoyed his performance. It had a lot of arrogance and swagger to it. I would really like to see his this performance in the Best Actor / Villain Category at various award functions to come and my instincts tell me he might win a dozen. The movie has nothing to do with Don from 2006, it has a complete new look and style to take the story further and in a better way. This time round the direction and pace of movie is FAST and it really is FAST. Farhan has always been reputed of being slow in story telling but this one had it's fair share of a Thriller. It kept me glued and i wasn't bored. Indian cinema has been really low on stories or scripts or how ever the cinematic people may call it, and same is this movie, but for an Indian movie it's one of it's kind and it will surely win accolades for that. Cinematography, Action, Stunts are all world class and at par with many Hollywood movies. That is so i have read the movie is much more appreciated by the critics and audiences outside India. Rest of the cast has done their fair share to what they have been told to do, even though, i don't agree with the choice of few characters ( the actors playing them). There is always room for more and improvement in franchises like this one and it has surely raised the bar way way ahead for it's next part to come. This is the BOND of Bollywood. I'd really like to give it another watch once the Blu-Ray is out and would highly recommend this. 8/10"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "fahim-murshed",
        "review_rating": "1",
        "review_title": "A copy-paste of Prison Break!!!",
        "review_detailed_main": "Yes! The movie looks really good but if you guys ever see the popular Hollywood TV Show Prison Break (2005-2009), you will see a lots of ideas have been taken from that!\n\nLike Prison Break, Don gets into a Prison to take out Vardhaan where in Prison Break Michael Scofield got into Fox River to get his brother out of there.\n\nA lots of similarity between Prison Break's \"scylla\" and the thing Don wanted to steal. A lots of similarities on the security of that.\n\nAlso, you will see the similarity on running in the car on Don 2 and Prison Break.\n\nIn overall, Don 2 may look like a very very unique idea to those who have never seen the TV show Prison Break (2005-2009). But its nothing special to those who have already seen Prison Break! I'd rather recommend to watch Prison Break instead of it. In other words Don 2 is a summary of Prison Break with some modifications in Hindi Language! That's what I got to say about it!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "jadhavsandipm",
        "review_rating": "8",
        "review_title": "Stylish...Superb Actions...One of the best dierected Movie...",
        "review_detailed_main": "This is my first review... Farhan's direction is always a treat to movie lovers. And what he did in DON 2 Chase Continues... like you are expecting 5 marks & you got 15 marks... From first scenes to last scenes you don't want to blink you eyes always something is happening which keeps you at your seats. It's roller coaster ride of a man how he gets what he wants & even his enemies get defeated in style. SRk is one man army here & center of attraction who plays his all cards (Boman irani, Lara datta, Priyanka) very well. Dialogues are very well written... It's a multi time watchable movie... One important thing is I am not SRK's fan but still this movie makes me his fan (for this movie)\n\nFarhan:: Waiting for Don 3..."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ghannaklalka",
        "review_rating": "10",
        "review_title": "Aspects of Don 2",
        "review_detailed_main": "Don 2 is excellent movie and many times watchable movie. His style,action, suspension and story telling so attractive. I want keep it as one of the best movie of all time list.\n\nPerformance:In this movie Shah Rukh Khan performance is excellent and mind blowing and Aly Khan, Nawab Shah performance is superb and Prianka Chopra, Boman Irani performance is very good\n\nDirector:Farhan Aktar worked is marvelous. He is the masterclass director. We want more work from him.He has many power to be one of the best director in the world\n\nMusic:Music is good as demanded of story\n\nVisual Effect is very good\n\nStory: Story is fine and last hour is so fantastic\n\nScreenplay has making this movie so nice\n\nI think this movie have power to conquer the world cinema and better than many Hollywood movie like MI4."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "akhs-mittra",
        "review_rating": "10",
        "review_title": "Best of Bollywood Action and 2011",
        "review_detailed_main": "its the best sequel ever made in bollywood.....special thanxs to Farhan Akhtar for making remarkable movie.....talking about the direction of d muvi.....its superb! the locations are great thanxs to Jason West...story of the movie is simple but quite effective with a nice twist and turn around.....now about the characters....its all SRK SRK SRK......he did splendid job in the movie and taken the charisma of DON into higher level....priyanka as always sweet, boman was nice, lara did short but good job....kunal is used as an ACE of playing card in the movie by don, and the HUNK JABBAR played a good role of villain.....the action sequence of the movie is Brilliant I should say......not like the typical Hindi movies......Its very good movie for Bollywood standards...sometimes feels like watching a Hollywood movie....background music of the movie is also slick and stylish.....and my god the dialogues...they were fantastic......on whole I like to give it a 8/10......but because of the KING DON SRK and for his excellent acting I must give DON 2 a 10/10! no doubt!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kartikgmehta",
        "review_rating": "1",
        "review_title": "Over acting",
        "review_detailed_main": "This movie is just about over acting and nothing more."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Sabby_2009",
        "review_rating": "10",
        "review_title": "best movie of 2011 : King Does it in Style !! \\m/",
        "review_detailed_main": "i waTched this movie THis afternoon and i was very much excited about the project . and after watching this spectacular cinema i was very happyy with the way film has shaped up !! for me it is the movie of 2011. Shahrukh khan -the backbone , sole of the movie . he again proves that ,he can do any role in style . Farhan aKHTAR - wHat a talent he has , amazing actor ,brilliant director and a glorious producer !! Priyanka also don a great job !! each and every character had played their part well. AND I FOUND ENDING VERY MUCH EXCELLENT !!\n\ni am going for 10/10 for farhan akhtar's don 2 :)\n\nand it is the best movie of 2011 ;) :D\n\n!!!MERRYYY Christmas ONE AND ALL!!!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "reshma_adhi",
        "review_rating": "1",
        "review_title": "A Comedy Movie",
        "review_detailed_main": "What a deceiving movie it turned out to be in the end.With a great hope of some fin scintillating 3 hours, we(group of friends) turned out in a theater.But those 3 hours were anything but torture. At the beginning of the movie, it seemed though that we might be in a real treat from the So-called king of Bollywood, but as the story progressed, the story became so predictable, comical and completely illogical.The acting of SRK is so bad.There was no need for retard-looking Priyanka Chopra.The scene involving SRK masked as Hrithik and disguising himself is complete dumb work of art and just a cheap marketing ploy.I mean Just because SRK wear a mask of Hrithik ,how could he become 6ft tall and wider in the body? Yes,this movie is full of such rubbish illogical plot and sub-plot.NOT WORTH WATCHING."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "fatekrusher",
        "review_rating": "10",
        "review_title": "srk rox ..!",
        "review_detailed_main": "People said that no-one could make a better Don than the man himself, Amitabh Bachchan. However, I would like to disagree. Shahrukh is the only actor of todays time that could ever make it better than the original. His style, charisma and witty remarks make it all the more appealing. Farhan Akhtar's superb directing made this film epic! There are no gaps, no over- the-top parts and surprisingly, no dancing.. Don and Roma's love/hate relationship is also great to watch and you can sense the sizzling chemistry between Shahrukh and Priyanka! I'm desperately waiting for a Don 3: The King Takes Over ;) 10/10 for sure. It would be an insult to compare these movies to other standard Bollywood movies, as Don 2 is - in my opinion - better than most, if not every, Hollywood action/thriller I've seen. Farhan, we're waiting :)"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "asha-albert",
        "review_rating": "8",
        "review_title": "A slick stylish action thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "tsid550-216-780855",
        "review_rating": "8",
        "review_title": "Good Entertainer, The King is Back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "palainausa",
        "review_rating": "2",
        "review_title": "Indian Movie, or MI?",
        "review_detailed_main": "This film embodies almost everything I don't watch an Indian movie for. If I watch an Indian movie I want to see either Indian song & dance entertainment, Indian scenery, an Indian political drama, or and Indian crime drama. Keyword: Indian. As in... takes place in India, I see India, I learn something about India, I get to enjoy Indian pop culture. I do not wish to see Berlin, London , Bangkok, Paris, Zurich, etc. I do not wish to see blonde babes dancing. I do not wish to see dancers in western, urban clothing. I do not want rap. Not all those faults are in this particular film, but those that are are dominant. Shahrukh Kahn pretending he is Tom Cruise? Gimme a break. I'd rather see him in a sari. Two stars for the explosions."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "benny-bt91",
        "review_rating": "10",
        "review_title": "Simply, the King is Back",
        "review_detailed_main": "After Ra.One , there was a feeling;srk lost his magic touch. But Don 2 once again proves that he is the best in the industry.Its shahrukh's awesome acting which has again mesmerized me in this movie. Superb movie with an incredible climax, it's a must watch thriller on stake for this festive season. The movie's first half is an absolute build up for strong storyline which unfolds in the second half. Farhan Akthar has once again proved his talent after Zindagi Na Milegi Dobara. The technology used in this movie is really of high standards. The best way to enjoy this movie is to watch it in 3d.Avoid downloading this flick from internet, go n watch it in theatres. Complete paisa vasool...!King Khan rocks."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "aayan-mughal",
        "review_rating": "5",
        "review_title": "An average effort from Farhan and team",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "veenayavan",
        "review_rating": "8",
        "review_title": "NIce comeback after Ra.one!!",
        "review_detailed_main": "This is my 1st review, So i will make it short and simple. The movie is fast paced and loaded with lots of action. The intro of SRK is very good and DON 2 has twist in the end as it was in DON. Overall the movie had a gripping story. Great performance by SRK and Priyanka looked very pretty. Boman Irani has also done a good job and kunal's role is also OK. Hrithik made a surprising cameo and a good one. Direction of the movie good and good camera work. Went to the movie with negative feeling but came out with positive one(But the music of the movie is a let down).\n\nA entertaining film for all and a must watch for SRK fans. 8/10 and a Big Thumbs up."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "shiv-mbbs",
        "review_rating": "9",
        "review_title": "Ra-1 was a bad dream",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kulkarni_ss11",
        "review_rating": "8",
        "review_title": "One of the best action thrillers of bollywood!!",
        "review_detailed_main": "Don 2 is the best action thriller of bollywood in recent times. The story, screenplay, action, photography all exceed the other Hindi movies and also a few big Hollywood action movies.\n\nAfter Don, I had huge expectations from Farhan Akhtar and Shahrukh Khan, and after watching Don 2 i am glad to say that they matched my expectations.\n\nThe story is well written and what makes the movie more thrilling is the screenplay which doesn't go flat. Also the hand-to-hand combat is never before seen in Hindi movies-which are more or less following South Indian movies regarding action as seen over past couple of years. The film is also well shot which adds to the thrill... Shahrukh Khan's performance is one of his best, other cast also play the part well.\n\nOverall, Don 2 goes beyond Bollywood till date in most aspects and is a movie which can match international standards..."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "HumTum8182",
        "review_rating": "1",
        "review_title": "Flop.One is followed by Flop 2.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "abhishekban2",
        "review_rating": "10",
        "review_title": "Srk and Farhan show what is meant by Donism and Machoism",
        "review_detailed_main": "First of all let me tell you that i am a big fan of king khan and seldom miss the opportunity of catching his movies at the first day first show slot.His last release Ra one was extremely disappointing even to the eyes of an ardent admirer like me.So needless to say lot was riding on Don 2 even more than before considering the fact king khan went on to win great accolades with the remake of yesteryear's classic Don where Mr Bachhan gave a stellar performance.\n\nAs usual i went in advance to book my tickets but unfortunately i couldn't manage to procure a ticket for the first show so i had to be contended with the ticket of the second show.i went along with 2 of my buddies who are not a great fan of king khan but loyal followers of the don brand.The movie kicked off with some drug mafia secretly planning to execute don.That was followed by a thunderous applause and the crowd shouting without giving a damn about their vocal cords when don in his lethal avatar with his sunglass,flaunting his long locks and smoking as if \"He is the king of the world\"appeared on the big screen. The clamor got me engaged and i got immersed in the movie and i guarantee you that the spell has not faded off yet.\n\nI completely fell in love with the slyness and shrewdness of Don how he surrenders to the police and ultimately how he managed to convince Boman to escape with him and become an accomplice in his plan of robbing >>>>>>>no no don't get me wrong not Euros but the metal plate impressions of the currency.Hrithik plays a cameo and ultimately to everyone's bewilderment turns out to be don himself.The car chase sequence was a visual treat and a trillion times better than all the VFX effects of Ra one combined together.Everyone fitted into their roles almost perfectly but don along with Boman and of course to a certain extent the jungle Billi were just Omg.The element of deceit in the movie was sculpted with utmost meticulousness and nonchalance.you cannot read don's mind and neither his eyes as to what is he planning next.The adroitness and conniving nature of don is so magnificently handled by king khan that u cannot but help admiring him even if you are his most severest critique.ultimately don says that either all his enemies have been killed or locked behind bars and laughs sadistically although i assure many would love to see themselves smile in the same way as don because every person harbors some traits of don inside their heart and we cannot but help let it come out.watch out for the climax as it is sure to leave u speechless and u cannot help but be in awe of the aura of don.\n\nFinally Farhan has also decided to script Don 3 and he has given a hint in the movie.i would recommend this movie anytime,anywhere.on a concluding note i often thought how can a person be named don.now come on must be he has a real name.Farhan said a couple of days ago that according to fiction he adorns the name of Marc Donald to which king khan wittingly replied that then jungle billi may have been acknowledged with the name of \"Donald Duck\""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ankit-sie",
        "review_rating": "1",
        "review_title": "I don't want my money back, I want 3 hours of my life back.",
        "review_detailed_main": "SRK is old and he needs to stop doing action movies. Terrible and pitiful attempt in copying Mission Impossible movies. They started off by copying old don and totally flopped with the sequel. SRK needs to go easy on action movies, he just can't pull it off now. Worst acting I have ever seen by him. This right here is the reason why Hindi movies suck. Stop copying Hollywood! I can't emphasize this enough how important this is. BE ORIGINAL! I'm surprises this is rated 7.0/10 What is wrong with people?\n\nAll in all; awful attempt by Farhan and SRK. I will never watch any SRK movies unless the story is original and it's not a action movie."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "gazalisiddiqui",
        "review_rating": "10",
        "review_title": "what can i say.........THE KING ARISES..:)",
        "review_detailed_main": "Simple plot but the twists and turns in the movie were amazing.average story,excellent performances,and brilliant direction from Farhan.......the German stars like Florian Lukas,Rik sch mid,martin Georas,Wolfgang,sent Dorothea,frank Christian all were awesome.Shah Rukh Khan is the life of the film and charms his way into the audience's hearts. He shines in the role of Don and uses all the charisma at his command to make his character supremely endearing. His duologue delivery, facial expressions and wicked laughter add up to an enjoyable package. His attitude and body language are oh so endearing. Priyanka Chopra gets limited scope and is suitably restrained as the Interpol detective. She looks sexy.The cinematography by Jason West is striking. However Shankar-Ehsaan-Loy's musical score doesn't leave a mark this time and the background score has to repeatedly resort to the theme-piece from the original for some impact. Farhan Akhtar's punch-lines are initially amusing but with a Don-ism in every second line, it sounds hackneyed and hollow after a point.after all the movie is excellent definitely worth watch for SRK's brilliant performance and excellent direction from Farhan. Don 2 ends with the promise of Don 3 (that's what the number-plate of Don's bike reads) and the trademark duologue(It's not just difficult to catch don, it's impossible). But we would surely want to 'catch' up with a more worthy sequel to this. It's not impossible Farhan. Is it? I M WAITING Mr.FARHAN......"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pawanahujaprince",
        "review_rating": "9",
        "review_title": "Action movie SRK Rock",
        "review_detailed_main": "The movie is very intresting and like to see SRK action and acting. I alway like SRK movie. The movie is like rocking. Don2 is one of the best movie of SRK. He will always attract his fan's and Now coming to the movie,Don 2 is a fast paced thriller that lies entirely on SRK and Farhan,what makes it a watchable thriller is SRK's energetic performance,Looks and Charisma and Farhan's direction. Movie doesn't have much Story to offer. It starts off from where the first part ends. Now coming to the movie,Don 2 is a fast paced thriller that lies entirely on SRK and Farhan,what makes it a watchable thriller is SRK's energetic performance,Looks and Charisma and Farhan's direction. Movie doesn't have much Story to offer. It st."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "cool_jojo_007",
        "review_rating": "9",
        "review_title": "No, it's not a Hollywood crime heist movie.",
        "review_detailed_main": "Hard to believe, but yes. This is actually an Indian movie. Little faults here and there but amazing production values, plot, and cinematography. Some didn't like SRK acting like that but I think he pulled off the cocky, arrogant prick quite well.\n\nEnough twists and turns without looking jaded. My go-to recommendation to anybody for an Indian heist movie along with Special 26. And just like Special 26, could have done without the silly songs."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mubasharsparrow",
        "review_rating": "10",
        "review_title": "Blockbuster Larger than life",
        "review_detailed_main": "I was 11 when this movie came out, heck I'm not even from India but the movie had such a enormous hype and suspense to it what's gonna happen, who's gonna die who's gonna betray?? When the movie came out it wasn't like you were watching a movie it was like an experience, An experience of a lifetime, All the actors nailed their roles, no overacting, or exaggerated performances, minimal and simple, with all the mass and suspense, Shahrukh never disappoints, with his amazing expressions, ALWAYS ON POINT! He just had a shade of grey which I personally think no one can match to date. We all want DON 3... this movie is a must see action thriller, it's gonna leave you with a surprise in the end, maybe someone dies or maybe they don't."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "kasimahmed-49471",
        "review_rating": "10",
        "review_title": "Amazing. King khan doing what he does best .action",
        "review_detailed_main": "Don 2 is much better than Don 1 and srk is the best as he always is .I loved watching it .I can't wait Don 3 the Chase ends. Priyanka was good too .bomani Irani is absolutely delightful to watch and farhan Akhtar really took his directing skills to a whole new level."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "saqibiqbal550",
        "review_rating": "10",
        "review_title": "One of the best movies ever made in Bollywood.",
        "review_detailed_main": "Don is ofe the best thriller movies ever made in bollywood, watching it feels like we are watching an Hollywood thriller. SRK in & as Don nailed it. no one can play Don better than SRK.\n\neverything about this movie is awesome, only 2 or 3 songs which doesn't interfere in movie story line. it's been 10 years now. but Don 2 is still the best thriller movie in bollywood."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "iamchetan-07218",
        "review_rating": "10",
        "review_title": "Most stylish and engaging action thriller",
        "review_detailed_main": "Amazing story, dialogues and action... And moreover acting of srk as don.. is like awesome... this is the only movie of bollywood which feels completely as Hollywood level."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "nasimaktar-19906",
        "review_rating": "10",
        "review_title": "One of the best every",
        "review_detailed_main": "Sha Rukh Khan ki attitude like a killer man Main blowing Director Faran Aktar Great And SRK always King"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "safaanamin",
        "review_rating": "10",
        "review_title": "The only time Bollywood matched the standard of Hollywood",
        "review_detailed_main": "Hats off to the entire team of don 2 for making such a masterpiece, this movie is just way ahead of its time but didn't gain much appreciation.\n\nIf you liked Money Hiest then Don Series will surely not disappoint you. The only bad thing about Indian audience is that they go crazy for series like Money Hiest but didn't appreciate deserving movies of their own country like Don 2.\n\nThanks to Srk 👑 who just nailed the role and did justice to it. Eagerly waiting for Don 3 💣."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "Thrishoolin",
        "review_rating": "8",
        "review_title": "Not as good as Don, but still quite good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ashishgoyal-89194",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "Don 2 is perhaps the best Christmas film in the last 5 years. It's slick,stylish and high on acting and visual effects. When it's SRK and Farhan together, miracles are bound to happen and it well happens for Don 2 is the best Christmas gift that Bollywood could offer and it is definitely an emblem of the acting skills of SRK whose kingship is proved. ACTING: SRK is the man who reigns supreme in this film and leaves a strong impression on the audiences mind with his stellar performance. His smile, dialogue delivery and every expression deserves a bow. Priyanka looked beautiful and does well in the second half. Her chemistry with SRK is electrifying. She deserves an applause for well balancing herself as a woman in love and hatred with the same man. Boman Irani is excellent as ever and in negative role he is always a treat to watch. Kunak Kapoor is impressive and Lara Dutta looks gorgeous. Hrithik gives a stunning performance in his cameo. His ball dance withPriyanka was a visual delight."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "nabilrahmanomgsrk",
        "review_rating": "10",
        "review_title": "One of the best crime drama",
        "review_detailed_main": "From the acting of srk and others to the direction of farhan akhtar it is almost a perfect film.Will love to see something from farhan and srk other than just the don series and yes also waiting for don 3"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "akshitsh",
        "review_rating": "10",
        "review_title": "Fantastic movie...👌👌",
        "review_detailed_main": "Amazing movie...they made it like hollywood style...amazingly done action sequences..nd the classic don climax just amazing"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "RoshanJG",
        "review_rating": "10",
        "review_title": "The best Bollywood Action movie",
        "review_detailed_main": "MY REVIEW OF DON 2\n\nPlot Synopsis\n\nAfter a gap of 5 years, Don decides to expand his business into Europe..But in order to do so he teams up with his old nemesis Vardhaan...\n\nActing\n\nSRK was just amazing as Don..he takes the whole character of Don into another level with this movie...He can shoulder the movie entirely by himself at any point..but fortunately the supporting cast is great too... Priyanka's role is more engaging in the second half after a lackluster first half..Boman Irani too extends upon his character,Vardhaan, to excellent performances...Kunal also does a fine job..Lara Dutta is just eye candy (very very hot candy too)\n\nActing-4/5\n\nStory\n\nUnlike Don (2006),the sequel is more of a heist thriller..Its fast, completely action oriented and has twists every now and then.The story at times is a bit stretched but the on screen performances manage to push past such holes.. So far Don2 is the best of the this genre in Bollywood..\n\nStory-4/5\n\nAction\n\nDon2 takes action to another level..The action sequences are well placed and the car chases are nicely handled..The fights are brief and don't prolong too much..\n\nAction-5/5\n\nMusic\n\nShankhar Ehsaan Loy nearly messes up in this department..The music even though nice and catchy resembles too much to Don(2006).. Farhan however used just one music sequence in Don2 (Zaraa Dil Kho),and Hai Ye Maya is used brilliantly for a montage of how the team prepares to rob a bank.. Dushman Mera is used during the credits...All the songs are just superbly shot..\n\nMusic Picturisation-4.5/5\n\nDirection\n\nFarhan proves once again hes one of the best with Don2..With Don2 ,he completely rejuvenates the titular character Don...In every scene of this movie he adds style..He also handles the heist part of the movie very well too..Don2 is easily the best heist movie Bollywood has ever come up with.. Editing is sharp and much care has been given to not drag certain scenes..\n\nDirection-4/5\n\nMovie-Don2 Don2 will be remembered as the most stylish movie ever in Bollywood..It not only carries the style but has enough substance within it too..The character of Don has been given a fresh storyline to work through..From the start to the finish ,its SRK's portrayal of Don that captures the complete attention of the viewers..Some parts of the story do stretch a bit but its just a minor flaw.. A complete family entertainer,the Best of 2011......\n\nDon 2---9.5/10"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "umair_ali",
        "review_rating": "10",
        "review_title": "Iss Movie do na Dekhna mushkil hi nahein Na Mumkin Hai !!!!",
        "review_detailed_main": "DON 2 has managed to exceed the hype it built.Surely the best Indian action movie around, King Khan is well what can we say about him he is simply KING KHAN..he is the best...sharukh khan is the best Anti-Hero i have ever seen in an movie ......He perfectly executed the ONE LINERS........Farhan Akhthar has provenn himself again.........it was very much like a Hollywood movie.......SRK and PC chemistry was awesum.......PC did an awesome job at loving and acting the same man........boman irani was also excellent and also the rest of the cast and LARA DUTTA was simple just SEXY.........My Rating 10 out 10.........A definite watch.....Now i m gonna go and watch the movie again and again........"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "ananyabasu24",
        "review_rating": "10",
        "review_title": "DON 2 - Style, Intrigue, Suspense and Attitude",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "koustav_net",
        "review_rating": "8",
        "review_title": "Slick Stylish and better than its prequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pmsg10",
        "review_rating": "10",
        "review_title": "Now thats what we call action!",
        "review_detailed_main": "OK guys, first and foremost, this is a real review! I saw the movie in Southampton, UK and my my, what a movie it was! I had excellent expectations from this one, as unlike Ra. One, it had a fabulous director in Farhan Akhtar! The trailers too looked excellent.. I won't tell much of the story, but as it can be made out from the trailers..Don get Vardhaan out of jail, to fill his purpose of getting to a vault in Berlin (they key of which is with Vardhaan)..Its a simple story but the way its told is excellent..What works highly in the favour of Don 2 is that it doesn't try to be too much of a bollywood-movie (that's exactly what spoiled Ra.one for me)...no dame...no emotions..just one song (barring hai yeh maya in the BG and one in the end credits)..so what remained was just pure action..the car chase sequence especially worked wonders for me..\n\nStarCast: SRK SRK SRK! This is the reason we call him the king! He's absolutely splendid..his expressions, his style, his charisma, perfect! Priyana Chopra too looks excellent in her role! Kunal Kapoor is decent..So is Boman Irani..Lara Dutta and OmP Puri get short roles with not much scope..Nawwab Shah is fine too..Hrithik Roshan in his guest role looks as classy as a human can look..\n\nDirection/Script : Amazing..farhan akhtar looks at his best..its slick, solid and smart..its only for a few moments towards the end when you feel why SRK is unnecessarily showing romantic signs towards Priyanka..but when you come to know why, you just can't resist being astonished.. Not to forget the action (which i thought) was the best i have ever seen in a Hindi movie..\n\nMusic : Zaraa Dil is good (a treat in 3D) while Hai Yeh Maya appears smartly in the BG..speaking of which, the BG music throughout the movie is splendid..Dushman Mera fills into the end credits..\n\nAll in all, a splendid watch if you are/or not an action lover..SRK simply at his best..should definitely pick up business and end up among the highest grossers of Bollywood..a sure-shot Christmas treat for all..just one thing to say, the King is Back!"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "rhitwick",
        "review_rating": "8",
        "review_title": "Good action movie",
        "review_detailed_main": "Watched the movie on 24th Night. Being a SRK fan, watching a second day last show is disappointing for myself. But...better late than never.\n\nNow, the main task.... review\n\nStory/Concept/Theme: Don is back and this time wants to make an entry to Europe drug market. But he has his rivals who want him dead. He then makes another plan to finish his contenders and make himself billions. Loot DCB plates! Rest of the movie is on how he executes this plan.\n\nCharacter development: There is one character who is seen in the whole movie i.e. SRK. And his character is already developed. I was surprised to see his Don character to be so mean and witty this time. In Don1 he was not this witty. Then there was Roma and other few persons who just floats on surface. In short...if you are discussing character development, Don2 is not a fitting example.\n\nDirection: Well, like many out there I'm a fan of Farhan Akhtar too. Many of you are there who have a blind faith that if Amir Khan makes a movie it must be some revolutionary movie, I've kinda same faith on Farhan Akhtar. Only revolution I found here is action choreography and camera work. Oh, and I must admit I appreciate the quirky dialogs. Nothing exceptional here...\n\nOne thing I've observed...I don't know if anyone would agree with me...is that Don is no more a overpowering, overshadowing supervillain anymore. He's kind of a super thief now. A bit like Jack Sparrow. Intelligent, sarcastic, mean and sleek.\n\nScreenpaly: Screenpaly is good. It gets slow the moment Priyanka is on screen. I think Farhan was not sure how to use Roma's character. She was absent in 80% of the movie and just slowed down the pace whenever on screen. (oh that was not screenplay related...hmmm) I liked the dialogs. Though the theft idea was childish, at least the crew took it seriously.\n\nActing: SRK is handled properly. A bit more mean would have been better. Rest of the characters played along well.\n\nCinematography: Camera-work is really appreciative. A bit of Malaysia and Germany is captured well. Then comes camera movements in time of action, which was also good. not shaky, no un-necessary close-ups or focus on muscle or slow-moing the finisher punch. Good job.\n\nAction and 3D: Action choreography is really good and I'm impressed. Recently I'm seeing the realistic fighting in Hindi movies. It feels you are fighting with a worthy opponent. Proper chops and punches, blood if necessary...a few cool finisher moves. If you are still not sure if you should watch this, go for action only, you won't be disappointed. 3D is bad...like baaaad\n\nSongs and background score: All but one are used as background score. So no more annoying song-dance sequence in the movie to bore you. Not very remarkable job from Shankar-Ehsan-Loy trio. A few forgettable hummable tunes thats all.\n\nEditing: Should have edited few parts with Roma. Keep only scenes which impacts movie and should have edited last emo scene with Roma in bank vault. And obviously Arjun's scenes.\n\nFew additional words: The moment the movie released it started a buzz. Lame movie, copy of this and that, nothing new and obviously SRK sucks. Well, I would like to say something on these. The movie is not lame. There are more bank robbery movies with more lolable concepts. At least this was better. Not much challenges in terms of bank vault breaking but good approach and scene structure. Copy of MI and Oceans...come on guys, I understand if you have seen only one movie on the bank robbery theme and only MI for jump scenes. Someone jumped from a high rise...that is not a MI copy. That is someone jumped from a high rise. And all robbery (not only bank safes but all kind of safes) movies had their own set of hurdles before you reach the main vault/safe/box/etc without proper authentication. What is the hype and hoopla if the challenges matches with one or few movies. Stop being a movie-know-it-all and stop boasting I-see-Hollywood-movies-I've-seen-it-all-and-I'm-not-impressed. Nothing new...none promised you anything new. Its a movie. Enjoy it the way you have enjoyed Singham, Dabaang, Bodyguard etc craps. And from the day Don2 was announced to be in production...I guess none in the world expected an intelligent brainfcuk movie. So...shut-up. SRK sucks...if you are a SRK hater. He always sucks for you. If you are a neutral guy...you might tend to appreciate his acting this time. Overacting?...Not this time at least. And if you are a fan, he's beyond the petty matters like perfection, overacting etc\n\nVerdict: One time watch for sure. The movie takes time to build up the plot and slow a pace but after intermission its a joyride for action lovers."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sachumindia",
        "review_rating": "8",
        "review_title": "srk is really back.........",
        "review_detailed_main": "Don 2 is really a highly entertaining movie.it is one of the best action movie in bollywood . Hats off to srk and farhan akthar. It's slick,stylish and high on acting and visual effects. Having conquered the Asian underworld, Don (Shah Rukh Khan) now has his sights set on European domination. In his way are the bosses of the existing European underworld and all law enforcement agencies. The action shifts from Kuala Lumpur to Berlin as Don must avoid assassination or arrest, whichever comes first, in order for his plan to succeed\n\n+ves: srk - he really proves he is the king of bollywood. direction - great especially action sequence. cinematography - match with Hollywood. action - mind blowing. climax - super twist. srk intro. bommam. -ves: pc - not much involved. lara. songs.\n\nDON 2 PROVES THAT NOW BOLLYWOOD CAN MATCH Hollywood."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "buntyali1989",
        "review_rating": "10",
        "review_title": "Fantastic Movie Quality cinema shows how India and Bollywood is progressing",
        "review_detailed_main": "This was a fantastic movie better than the 'cheesy' trash which Bollywood churns out every year. This movie shows how Bollywood is progressing slowly although it may be a slow transition, but with less songs, more stylized action. This is a must watch movie for all movie buffs. I for one thoroughly enjoyed this movie and all my mates enjoyed this movie. The film is based on a Bank Heist and Don in this one goes to the next level, while the first DON was generic to the original, this one allowed Farhan Akthar to innovate. From Shahrukh Khans 4 different hair styles, to the fighting action scenes which were realistic and not over the top lie Dabanngg. If you want to watch a movie which is not over the top and the actor actually acts in it, Watch Don 2. This is not a family movie and do not watch with your children as it glamorizes the negative shades of the character."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vishalkbhandare",
        "review_rating": "9",
        "review_title": "Don 2 - the return of the KING Khan !!",
        "review_detailed_main": "We all were waiting for the king's come back & he does it well. Don2 is a successful sequel to don.SRK rules the screen with a power-packed action star performance without loosing his romantic essence. You better fasten your seat belts when SRK drives his machines. Not to forget the stylish impactive dialogs from this flick. This don is now not only an underworld king but is \"ehtan hunt\" from MI & a style icon like \"007 agent\". Priyanka do the justice as roma (don's jungli billi). Boman is good but not as impressive compared with his other world famous characters till date. Kunal kapoor does a decent job as a hacker Direction is the key to success by farhaan..non stop adventure with loads & loads of breathtaking action. Music suits well to the style of flick.. And can don series miss a twist at the end?no way..it does come with a surprise.. All & all the much awaited don came back & ruling us 4.5 */5"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "nishpandey",
        "review_rating": "10",
        "review_title": "The King is Back....",
        "review_detailed_main": "Watched DON 2..I can tell u guys dis is the best ever Christmas gift from Bollywood till date. 3 most important things I want 2 mention here abt dis movie-A brilliant script, an intelligent direction and above all the perfect crime carried out by DON. Guys its all abt SRK...he is unbeatable in dis character called DON. Farhan developed the character (Don) in a very grand style; he has taken the story of Don 2 to a different level all together. The 1st half is all abt Planning of a perfect crime nd the 2nd is about the accomplishment of dat very task in the Don style. Last but not the list is dis muvi only tells abt SRK..truly The King Is Back with more style, more attitude and more Don in him. If u like Bond and M.I. series, den guys u will surelly gonna super lyk dis Bollywood tadka where The 007 (Bond) meets Ethan Hunt (MI)!!! Don ko pakadna mushkil hi nahin...yes U Got It . 9*/10.."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "vinithshere",
        "review_rating": "8",
        "review_title": "Don 2: The King Is Back... With a Thundering Bang..!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "singhal-52253",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "Great movie seen in Bollywood as action, thrill, story line, direction, suspense all along. Overall Power-packed performance by Shahrukh Khan. Truly the \"KING IS BACK\". People said that no-one could make a better Don than the man himself, Amitabh Bachchan. However, I would like to disagree. Shahrukh is the only actor of todays time that could ever make it better than the original. His style, charisma and witty remarks make it all the more appealing. Farhan Akhtar's superb directing made this film epic! There are no gaps, no over-the-top parts. As a director Farhan's best film ever. Film's background score is stunning. But the songs are not pretty good. The film's visual effects is better than MI-4, Ra. One, Robot, Krissh. It's stunning and well shot. The special effects add a special flavor to the film which makes it even more delicious. Each and every character in this film is perfect. But in some portion it remembers me Death Race2, specially in Jail. Anyway best movie of the year."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sourav-63975",
        "review_rating": "10",
        "review_title": "Stylish Direction",
        "review_detailed_main": "Shah Rukh Khan delivers a charismatic and intense performance as Don. His portrayal of the suave and cunning criminal mastermind adds depth to the character. Farhan Akhtar's direction brings a stylish and slick visual appeal to the film. The action sequences, in particular, are well-choreographed and contribute to the film's overall impact. The film utilizes international locations, including Berlin and Kuala Lumpur, which adds a global and cinematic quality to the storytelling. The production design and cinematography enhance the film's visual aesthetics. The plot is filled with twists and turns, keeping the audience engaged. The suspense and intrigue associated with a heist film contribute to the overall thrill."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "hamidrezadon",
        "review_rating": "10",
        "review_title": "Good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "pats-78165",
        "review_rating": "10",
        "review_title": "Don 2",
        "review_detailed_main": "Don 2, the sequel to Don starts from where the prequel ended. Though the story is surreal, impractical and seems like fantasy, the director gives it a slick treatment. It doesn't let go, even for a moment. The plot is stylishly crafted,with every twist and turn falling into place. Farhan Akhtar yet again proves that he is the most stylish film maker of recent times. The first half may seem cold in comparison with the 2nd, as the 2nd half takes the film onto a different level and keeps you on the edge of the seats. The script will mostly appeal to the urban crowd who are absolutely hooked #superb."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mukesh-77729",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "MananShah-1252",
        "review_rating": "9",
        "review_title": "Best Thriller Action",
        "review_detailed_main": "From Bollywood best thriller action movie i ever seen..the performance is top of the notch by Shah Rukh khan.."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sreeragrmails",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "While it might not be the best opinion to classify young writers and directors to a specific style or segment, there is something compelling and unique about the story telling of great directors that makes their fans count days for the release. Story writers in this category not only leave lasting impressions, but always carry a trademark of their method and style which brings that smile in the end, even when they explore diverse subjects or hop genres. Farhan Akhtar is the man who gave us that range with DCH and Lakshya,yet maintained the sincerity and joy of telling a story. Don 2 ladies and gentlemen, is just the opposite.\n\nIs it fair to expect Farhan not to experiment or go blazing commercial Hindi masala with this subject? Absolutely not and complements to him for taking it further, but could he have done this with more love for the character Don, and packed it with the honesty of Lakshya or the freshness of DCH, a resounding yes! Who better than him to do it. Without drawing any comparisons to the original or comparing it to others, the movie miserably lacks a soul. The least a writer and director can do is be fascinated and inspired by the character and the story of Don. This one taints the cinematic image of Don. Clichéd dialog's and disconnected sequences prove more attention was given to make it look hip and sexy, and not make it real. We have all seen the MI series, the 007's, and others like them and they are all incomplete without the cars, gadgets, and the geeky thrills, but pick any good one from the lot and you will see they were all used to complement the story. Very unlike Don 2.\n\nThe movie is drenched in classic SRK drama,and you are better off watching a Karan Johar movie than this, at least you will not be surprised by anything. For instance, the movie kicks of by a bunch of big shots conspiring to kill don, and you are a genius if you were able to figure why by the end, or even why it started the way it did, but then I'm talking logic here. How about the poor dialog's and not so funny humor portrayed by SRK? Jabbar the villain is shown more as a personal assistant and, reflects a character that was either not developed or incompletely written. Priyanka Chopra puts in a decent performance to a minimal role and Om Puri could have easily taken a pass on this. Boman Irani does justice to his character but again, his character's evolution as well as introduction does not hit the mark."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "davieddas",
        "review_rating": "8",
        "review_title": "The king of Indian movie",
        "review_detailed_main": "\"Don 2\" is a Bollywood action thriller directed by Farhan Akhtar and starring Shah Rukh Khan. The film follows the story of Don, a cunning criminal, and his elaborate plan to steal valuable currency plates from a high-security bank in Berlin. Shah Rukh Khan delivers a captivating performance as Don, portraying the character's intelligence and charm effectively.\n\nThe Hollywood king movie... The movie received generally positive reviews for its slick direction, stylish action sequences, and Shah Rukh Khan's charismatic portrayal of the anti-hero. The film's cinematography, editing, and gripping storyline were also praised. Additionally, the supporting cast, including Priyanka Chopra and Boman Irani, contributed well to the overall narrative.\n\nOverall, \"Don 2\" is an engaging action thriller that showcases Shah Rukh Khan's versatility as an actor and provides audiences with a thrilling and entertaining cinematic experience. I recommend this movie I love it."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "huzefanampurwala",
        "review_rating": "10",
        "review_title": "Don 2",
        "review_detailed_main": "Don 2 is a 2011 Indian Hindi-language action thriller film written, co-produced and directed by Farhan Akhtar. It is the second installment in the Don reboot series. Jointly produced by Excel Entertainment and Red Chillies Entertainment, the film stars Shah Rukh Khan as the titular anti-hero, with Priyanka Chopra, Boman Irani, Lara Dutta, Om Puri, Nawab Shah, Alyy Khan, Rajesh Khattar, Sahil Shroff and Kunal Kapoor playing supporting roles. A sequel to Don (2006), the film's story takes place 5 years after the previous film when Don (Shah Rukh Khan), a ruthless international drug lord, plans to take over the European drug cartel. Meanwhile, Roma (Priyanka Chopra) has joined the Interpol to hunt him down."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "gawarof",
        "review_rating": "9",
        "review_title": "Extra points for trying , and succeeding!",
        "review_detailed_main": "I saw this movie 2 times when it released. And to this day , I'm happy how it turned out\n\nWe have not seen a better heist film in Bollywood after don 2. It's production , it's story beats everything both , Dhoom 3 and Players which were even based on Hollywood film and Don 2 wasnt. Which is another plus!\n\nIt could've been much much better. But this film has a certain charm. It feels like a holly flick. Only negatives are charachter buildups and pace.\n\nCharachters aren't really connected emotionally. They're just there to serve the purpose.\n\nPace is really weird. It opens with an action sequence , to an slow enquiry sequence , to a good prison sequence to a song. This shift in pace dosent add upto the suspense it could've have delivered"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "swamiparth",
        "review_rating": "9",
        "review_title": "Don 2 Movie Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "basavarajup-30307",
        "review_rating": "10",
        "review_title": "Awesome movie, worth watching",
        "review_detailed_main": "It has been five years since Don made his escape and is now out to conquer the Western World. Only he has to ensure that his enemies don't get (kill) him.\n\nStarring Shahrukh Khan, Priyanka Chopra, Lara Dutta, Boman Irani, Om Puri, Kunal Kapoor, Florian Lukas and Sahil Shroff. Music is by Shankar Ehsaan Loy. Lyrics By Javed Akhtar. Directed By Farhan Akhtar. The movie is Produced By Farhan Akhtar, Shahrukh Khan and Ritesh Sidhwani.\n\nShahrukh Khan's previous release, \"RA ONE,\" may not have done well as expected but this has. Shahrukh Khan has proved, once again, that he is able to do such action roles. He is convincing as the \"DON\" and this role has suited. His expressions and the way he delivers his dialogues, make one feel convinced. However, his hairstyle is to be watched out for.\n\nPriyanka Chopra makes a return as \"Roma.\" Only this time she has a more meatier part then she did in 2006 and this suits her more now then it did five years back. Here, her character, \"Roma\" has joined the Interpol and she is determined to catch Don.\n\nLara Dutta has replaced Isha Koppikar and plays the character, \"Ayesha,\" who is all the time with the Don. Boman Irani returns as \"Vaardhan,\" who was caught by the Police five years back and Om Puri, also returns as CBI Officer Vishal Malik. But one actor, who did a good job of his role, is Kunal Kapoor as a man who helps DON.\n\nFarhan Akhtar has returned to be behind the cameras and not in front of them. While, his father, Javed Akhtar, has written good lyrics for the music directors Shankar Ehsaan Loy to compose.\n\nThe action sequences, especially in 3D, are worth watching out."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "dapinder-jutla",
        "review_rating": "9",
        "review_title": "Best Action movie",
        "review_detailed_main": "One of the best performances of shahrukh khan..Really enjoyed the movie💯"
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "arumallasundeepreddy",
        "review_rating": "10",
        "review_title": "Complete Entertainer",
        "review_detailed_main": "\"Don 2\" is a stylish and exhilarating Bollywood action thriller that elevates the suspense and intrigue of its predecessor. Shah Rukh Khan reprises his role as the enigmatic Don, delivering a charismatic performance that keeps viewers on the edge of their seats. Farhan Akhtar's direction, combined with stunning cinematography and well-choreographed action sequences, adds a sleek and international flair to the film. The engaging plot, filled with twists and turns, keeps the audience guessing until the end. With a mix of high-octane action, clever heist elements, and Khan's magnetic screen presence, \"Don 2\" stands out as a thrilling and visually impressive cinematic experience."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "mahore-mohit",
        "review_rating": "8",
        "review_title": "An Excellent Thriller",
        "review_detailed_main": "Don 2 is a slick and stylish movie. It has an intelligent and gripping storyline which keeps you glued to the screen in anticipation. The movie begins where its prequel left off. Don, after becoming the king of the Asian underworld, is on a quest to conquer the European underworld. But he has to face the existing bosses of the European underworld and many other obstacles to get what he wants. The twists and turns in the movie are intriguing and the climax blows your mind away. Direction by Farhan Akhtar is really great. The action sequences look very realistic especially when compared to what is generally seen in bollywood. The action is on par with Hollywood. The locations in Thailand and Berlin are shot beautifully. Performance by all the actors is good. Shahrukh Khan is amazing as Don. In my opinion, Shahrukh is the only actor today who has the charisma to portray the character of Don so convincingly. Priyanka Chopra does well as Roma showing love and hate relationship with Don. Other actors like Om Puri, Boman Irani, Kunal Kapoor were also good in their respective roles. Dialogues are the USP of the movie and Shahrukh's dialogue delivery is stellar. It's like Don has got a dialogue for every situation which makes him look really cool. The songs fit well with the situation in the movie. Keeping in mind that it is an action thriller movie, Shankar-Ehsaan-Loy have done a good job. There are no unnecessary romantic or dance numbers to disrupt the flow of the movie. The background score is really good during action sequences. Every movie has its share of flaws, so has this one. There are a few plot holes in the movie. Many action sequences look copied/inspired from Hollywood flicks. To sum up, I would like to say that Don 2 is one of the best action thriller movies to come out of bollywood. It is a treat for Shahrukh fans."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "tataambani",
        "review_rating": "10",
        "review_title": "MASTERPIECE",
        "review_detailed_main": "MASTERPIECE!!!\n\nThis is the most epic film to watch in 2020 especially in quarantine. Its an absolute masterpiece and so well scripted. Its the only best crime/action film in bollywood to watch. The story is so well written and every scene of the film have made sense and real logic! Every shot and scene has directed so good. This film is definitely originally made and somehow is better than the first part.\n\nThe dialogues were great. The storyline was sometimes predictable but at the end it totally changes. When I watched the movie I thought I was watching a Hollywood Movie. Shahrukh Khan is the only actor who can play Don cause he has that style, the charisma and everything you need in an underworld king who wants to be the king of Europe. Boman Irani plays the role of Vardhan really well."
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "shivsutsoni",
        "review_rating": "10",
        "review_title": "Action and comedy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1285241",
        "movie_name": "Don 2",
        "movie_rating": "7.1",
        "review_username": "sajidhussainsh",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "Perfect story, awesome screenplay, classic performance by cast and of couse that evil smile and cruel mind of don make the movie perfect crime thriller.. Waiting for part3"
    }
]