[
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "bellino-angelo2014",
        "review_rating": "5",
        "review_title": "Yes it's bad but also quite funny and enjoyable",
        "review_detailed_main": "I agree with many that this movie has many shortcomings, but I don't consider it ''the worst movie of all time''. Yes, it is poorly made, it was cheaply made, but I think that there are many movies that are MUCH worse than this one (MANOS THE HANDS OF FATE and THE BEAST OF YUCCA FLATS are much more amateurish and poorly made than this) and there are much worse directors than Ed Wood (Harold P. Warren and Coleman Francis for example). And I consider PLAN 9 one of the greatest bad movies.\n\nThe many flaws of this movie are: the acting, full of corny dialogue and overacting (especially by Tor Johnson and Vampira); the sets and the special effects may be poor and cheap (I laughed a lot when I saw the pie plates used as UFOs); and lots and lots of stock footage. But I find this movie entertaining for the dialogue and also for Bela Lugosi's final performance (here billed ''Almost starring Bela Lugosi'' since he died before the movie was released). And Ed Wood directs nicely, and except at half-way the movie is very fast-paced.\n\nAll in all, a nice and funny time passer and among the cults of bad movies! Not to be missed."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Coventry",
        "review_rating": "5",
        "review_title": "It's a plan all right; - a plan for perfect entertainment!!",
        "review_detailed_main": "What are all these people moaning about? I've rarely had more fun while watching a movie as I had with Ed Wood's Plan 9 from Outer Space. Besides, most criticism goes out to the lousy scenery and the goofy decors. Well excuse Mr. Wood for not disposing over a huge budget or funds! He did what he could and sure, the jet cockpit looks amateurish and the Pentagon-offices have the image of being build by a kindergarten-crew but so what? I have a lot more respect and sympathy for this film than for those over-budgeted, uninspired blockbusters! Like in ALL of his films, Ed Wood proves that he's full of good intentions, creativity and a strong will to proceed and purchase his dreams. The only thing you can reproach him here, is the silly and pointless screenplay. Aliens are desperately seeking contact with humanity and in their ninth attempt to achieve this, they even resurrect the dead. Why?!? To make humans aware of their existence and to figure as prophets with a message. This is where the silliness comes in. But it all remains pure fun, all the time! What also makes this film legendary is the fact that it contains the last on-screen appearance by Bela Lugosi. Lugosi died during filming and another guy in a Dracula outfit who constantly hides his face behind a cape (!) replaces him. Am I the only one who thinks this subtle cast-change is absolutely charming and nicely tried? Vampiria and Tor Johnson are credited as main performances but all the have to do is stumble around and look ghoulishnot a difficult thing to do if you have the posture of Tor Johnson. Overall, Plan 9 from Outer Space remains the absolute top-recommendation to watch with a group of people when there's beer and snacks."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ccthemovieman-1",
        "review_rating": "5",
        "review_title": "Yes, It's Terrible, But Not As Bad As I Had Hoped!",
        "review_detailed_main": "Well, at least I finally this \"famous\" movie. It took me a long time but so many people have said \"it was so bad that it was good\" I finally gave it a shot. Previously, I settled for enjoying the Tim Burton \"Ed Wood\" film, which is very good and tells the story of the making of this movie.\n\nWell, I agree \"Plan 9\" is bad and, yes, perhaps, \"the worst movie of all time\" as many label it, but I'm sure there are worse ones out there. Really! I've seen worse (usually the \"B\" sci-fi movies of the '50s, too!)\n\nI loved the first third of this film. I laughed many times at the hokey flying saucers, the walking \"dead\" and the corny dialog. I thought, \"Wow, this was a bad (meaning good) as advertised,\" but then I found the film starting to lag at the 35-40-minute mark and recovered a little bit in the end, but not enough to make me want to watch this again. It got too talking and too preachy. Holy cow, this movie is nothing but preaching for everyone to take \"flying saucers\" seriously. Then we got more preaching at the end about the usual how- violent-mankind-is\" blah, blah, blah. The writers here obviously took themselves too seriously. They should have just kept it as sci-fi/horror flick without all the heavy-handed preaching.\n\nHighlights included Tor Johnson's face, the many lines of ridiculous dialog, Vampira's zombie walk with her outstretched hand, and Criswell's incredible speeches and the beginning and end of the movie! All of the above made me laugh almost every time!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "DeeJayPip",
        "review_rating": "",
        "review_title": "Deaf Person's Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "jew_59",
        "review_rating": "2",
        "review_title": "Aspiring film makers take note",
        "review_detailed_main": "For anyone that wants to make movies, Plan 9 is a must see. Not for it's lush style, great dialogue, fabulous production design, nor for the compelling performances given by the players. It doesn't have any of that. What it does have though, is poor production design, continuity gaps you can drive a space shuttle through, and writing that's so bad, it's amazing anyone had the nerve to show it. That is what makes it a must see.\n\nEd Wood, Jr. was not talented, but he was determined. He did something that many extremely talented people have not done. He got it released. He wrote it, produced it and directed it. When his star, Bela Lugosi, died during filming, he still finished it. Not just this one either, he put out several films, and not one of them is any good.\n\nSo for all of you aspiring Scorseses or Spielbergs, when the world gets you down, and you just don't know how you can get it done, when you feel like you've lost it, pop in \"Plan 9\". I bet you'll feel better."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ryan_kuhn",
        "review_rating": "1",
        "review_title": "The Worst Movie of All Time? Maybe, maybe not...",
        "review_detailed_main": "Often considered the worst movie of all time, Plan 9 From Outer Space does boast tombstones that are made of cardboard and tip over during the movie, it does feature one shot of Bella Legosi that is reused over and over and over, it does show a cop scratching an itch on his head with his gun, and stars a Swedish wrestler as a California cop, but it is not the worst movie of all time because the story is not that awful. The first 8 plans by aliens from some planet that doesn't really matter fail, so they employ their ninth plan for taking over Earth. At least I think they are taking over Earth, they say they are taking over Earth to save the Earthlings. All I know about the aliens is that they are dedicated to their cause, you would have thought they would have given up taking over Earth after 6 tries. You will have a good chuckle during the movie with the cheesy special effects and the silly acting and cheap props, but the entertainment value does make it better than some movies out there. Maybe 2 or 3 movies, at least. For more on the background to this movie and why it turned out the way it did, check out the 1994 film Ed Wood, and you will appreciate this film, at least a little more."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "jamesjustice-92",
        "review_rating": "4",
        "review_title": "Definitely NOT the worst movie of all times",
        "review_detailed_main": "When I first watched this motion picture seven years ago I quite enjoyed it. I knew that it was named \"the worst movie\" and I wanted to find out for myself how true it is. Since then a lot has changed, I've developed my own taste and became very picky about what I watch. And after rewatching it I can tell for sure that I would not be returning to this movie again. \"Plan 9 from outer space\" is a low-budget movie and the lack of finances feels in every way and in every scene: ragged editing, minimal set pieces, puppet flying saucers on the strings, non-professinal actors who just stand there and say the lines; there's also a narrator whose presence is absolutely unnecessary and who doesn't bring positively anything to the plot which is terrible anyway. I tried to see more in the story than laid on the surface but I couldn't - yes, there was a warning about bomb usage and how people could destroy the Earth by the flick of the switch but Mr Wood only tried to present it as something meaningful and failed miserably. Any movie, low budget or no budget, is supposed to be all about new ideas and getting people to think about something. During watching I thought only about when does this movie going to finally end. But not everything was that bad. Bela Lugosi in his final role was amazing, especially at the beginning and the fact that he died during filming is clearly visible because of a stand-in actor whose face was always half covered with the cape - another thing that could have been handled better. The score is the only thing I have nothing bad to say about: excellent music that creates the scary atmosphere and helps you get through to the end of the movie. So, is it that bad? Yes. But there are way worse pictures out there."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Lechuguilla",
        "review_rating": "1",
        "review_title": "What A Hoot!",
        "review_detailed_main": "When I need an amusing diversion, nothing helps quite like watching one of those dreadful 50's sci-fi flicks: \"Teenagers From Outer Space\", \"The Brain From Planet Arous\", or my personal favorite: \"The Giant Claw\". Ed Wood's infamous \"Plan 9 ...\" is a good choice too. Criswell, in his sing-song voice, cracks me up every time I hear him intone: \"Future events such as these will affect you in the future.\"\n\nI can forgive \"Plan 9...\" for some of its, let us say ... \"imperfections\": anthropomorphic aliens who speak English; women aliens who wear lipstick; the hammy, sophomoric acting; the dime store special effects ... But there's really no excuse for a mickey mouse script. You get the feeling that the film was put together by a quarrelsome committee of third graders, and aimed at an audience of chimpanzees.\n\nCriswell drones on: \" ... the secret testimony of the miserable souls who survived ...\". And later, a VO intones: \"The ever beautiful flower she had planted with her own hands became nothing more than the lost roses of her cheeks.\" Evidently, Wood saw no need to hire a script editor.\n\nAnd yet, specifically because of its technical crudeness, \"Plan 9 ...\" is fun to watch. We may not want to admit it, but the film gives us viewers a chance to feel superior to Ed Wood; we get to conjecture that even we could make a film that has more credibility than ... that."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ReelCheese",
        "review_rating": "3",
        "review_title": "Totally Inept In Every Way!",
        "review_detailed_main": "Say what you will about it, PLAN 9 FROM OUTER SPACE is not the worst movie ever made. It is, however, the most incompetent, with unbelievable ineptitude seeping from its every orifice. And that's what makes it fun.\n\nThe \"plot\" concerns aliens and their you-can-see-the-strings-attached flying saucers seeking (gasp!) domination of Earth. To help them in their evil quest, they borrow a page from NIGHT OF THE LIVING DEAD by raising the dead from their graves to serve as a zombified army. Now it's up to hapless earthlings - led by moronic police, clichéd army officials and feeble-minded airplane pilots - to stop them.\n\nThe storyline serves as little more than a front for the pure anti-genius of director Ed Wood to shine through. The most famous quirk is the employment of Bela Legosi as a star. Legosi, bless his heart, died three years before the film's release. No matter, said Wood, who sought to base his low-budget creation around a few scant minutes of unused silent footage of the horror icon. Wood is to be commended for his ambitious, if not inappropriate, attempt. What really makes the illusion crumble is Legosi's hilariously obvious stand-in, who, not blessed with much resemblance to the deceased actor, compensates by inexplicably covering most of his face with a cape.\n\nThe Legosi gimmick may get all of the attention, but the truth is PLAN 9 would have been just as horrendous without it. Take the dialog, which must be heard to be believed. When a laser ray suddenly morphs Legosi's zombie into a skeleton, a bystander is heard to note, \"He wasn't like that a minute ago!\" Very observant. Then there's the head alien henchman, smirkingly reminiscent of a '50s TV announcer, who tries hard but is about as convincing as Pauly Shore as Al Capone. \"You're all stupid... stupid, stupid!\" he tells the earthlings during an unimpressive temper tantrum. (Thankfully one of the good guys then proves how intelligent we really are... by punching the alien's lights out!).\n\nOther absurdities abound. There are times when it appears Wood had to stop the camera so he could think of what to do or have the characters say next. A woman being chased by the zombies \"trips\" over nothing not once, but twice. Presumably sturdy tombstones fall over. After being brought back to life, burly Inspector Clay can't climb out of his grave. Policemen belittle a woman for not wanting to be alone with murderous creatures roaming the grounds. The same footage of Legosi walking out of the graveyard is used over and over again. No other film has given the viewer such little credit. Wood simply shrugged his shoulders at the glaring errors and must have thought, \"Well, heck, who pays attention to these things?\"\n\nWhat really allows PLAN 9 to succeed (to some degree) despite itself is the fact that it's so damn innocent. It doesn't seem Wood was trying to be campy; he really thought he had a winner. To his eternal credit, he did create something truly memorable, just not in the way he intended."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "JimSpy",
        "review_rating": "1",
        "review_title": "A Riveting Study in Sheer Badness",
        "review_detailed_main": "When I first watched this movie, I thought it was a joke. I thought it HAD to be someone trying to spoof high school movie projects. Then I realized two things: one, it wasn't a joke, Ed Wood took himself seriously (I didn't realize HOW seriously until I saw the excellent Tim Burton film). Two, it would be an INSULT to high school movie projects.\n\nAny serious film buff MUST see this movie. It is not just bad, it is WONDERFULLY bad. It is a paean to badness. It raises badness to a fine art. It literally WALLOWS in badness. If they gave Oscars for badness, Ed Wood would receive the Lifetime Achievement Award.\n\nTen Thumbs Down. Highly Recommended."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "arthur_tafero",
        "review_rating": "1",
        "review_title": "The Worst Film of All TIme - Plan 9 From Outer Space",
        "review_detailed_main": "This film is so bad, that it is good. My son Joe and I have seldom laughed so often during a film; even the best comedies from Hollywood. There are so many unintentionally hilarious scenes, that one hardly knows where to begin. Let's start with Lugosi. Somehow, he does not look like your typical Long Island houseowner; his European cape is strangely not in sync with the rest of the community. The gravedigger scene is very funny as well. How cheap are the people in this community with their loved one's graves? A cheap wooden cross instead of a headstone? That is pretty cheap; but not as cheap as the sets in this film. Ed Wood, bless his soul, does a masterful job of ruining every scene with horrendous props. I love the curtains separating the pilots of an airliner from the passengers that we never see. Great security. Remind me not to travel on that airline. But this is not the only place with curtains. The pilot's home (even though he lives outside with his wife) has curtains outside the home. I have never seen this decor before. Even the spaceship has curtains. The people who made curtains as props for this film made a fortune.\n\nI think that The Price is Right must have the director's favorite TV show. (What's behind curtain number two?). The cast had two major problems; very few of them knew how to drive a car. Two of them put the cars in reverse before driving. Two others leave the lights after leaving the car. Another problem area for both the police and the aliens are their weapons. They don't seem to work. The aliens are forced to flee when their microwave oven catches fire. This is perfectly understandable. There is also a very fat man who wanders around looking for food and a scantily-dressed woman who doesnt change her clothes for four days and can be smelled from over 100 yards away. This film is not half-baked; it not even in the oven. But it very funny to watch."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "rtim12",
        "review_rating": "10",
        "review_title": "A classic of the bad sci-fi genre",
        "review_detailed_main": "This is one of the best of the worst films of all time. When viewed with the right mindset it never fails to entertain. Poor production values, terrible acting, worse directing, and dialog that has to be heard to be believed, combine to create a cinematic gem.\n\nWhen speaking of bad movies, it is important to understand what is meant by \"bad\". There is good bad, and there is bad bad. Bad bad is a movie that combines all the elements listed above--bad acting, bad directing, etc.--to produce something that bores. Good bad combines the same elements in such a way that a highly entertaining movie is made, although not in the way the movie makers hope.\n\n\"Plan 9\" is not just good bad, it is brilliant bad. It is unintentionally hilarious, and that's as funny as it gets. This is a movie that has absolutely no redeeming qualities. Everything about it is bad. When George Romero made \"Night of the Living Dead\" he did it on the cheap, but still produced a film that was intense, scary, and had a point. \"Plan 9\" is nothing but bad, albeit in a wonderful way.\n\nAs an example of bad production values, there is a scene where a police car is speeding away from headquarters. As the action begins it is broad daylight. The next scene is the car racing across the city. Now, however, it is night! Next is the car arriving at its destination, a cemetery, and again it is daylight. That is either one huge city, or somebody on the Plan 9 crew was asleep at the switch.\n\n\"Plan 9\" is so full of great badness that to detail all the goofs, flubs, and cheesiness would require remaking the entire movie. The cemetery is a weed-infested lot; an airline cockpit set is a shower curtain, some plywood and a couple chairs; a cop scratches his head with the business end of a gun barrel; the outside of the space ship has a ladder that goes nowhere; the plan itself, that is, plan number 9, makes no sense at all. And on and on and on...\n\nIf you love movies, and want to consider yourself conversant in all genres of film, seeing at least one bad sci-fi movie is a must. \"Plan 9\" is the Hamlet of that genre. See it with a couple people who get it, and have a great time."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "roland-sinn",
        "review_rating": "6",
        "review_title": "Bumbling Aliens first 8 plans fail, will plan 9 succeed? \u0085 I think not",
        "review_detailed_main": "Ed Wood must have been a fascinating man. He had a burning drive and ambition to succeed in the film industry, yet his creative and directorial talents were infantile.\n\nPlan 9 is his most famous film and has become a cult favourite. The film is an example of extreme amateurism which creates an assortment of unintentionally funny scenes. It's truly amazing this film managed to be funded and released to the public (then again, The Swarm was too \u0085).\n\nWithin Plan 9's ridiculous and convoluted story are a number of silly subplots due to the fact that Ed had such a variety of interesting an un-related footage which he really, really wanted to use in the one film. One needs to pay close attention to understand everything that's going on in this mess (although, when you do understand everything that's going on, you may wish you'd have remained ignorant!)\n\nPlan 9 has heaps of priceless quirks: hub-cap flying saucers, idiotic dialogue, the last gasp of the great Bella Lugosi, and the luscious Vampira (who apparently would have breached an existing contract if she uttered a word in Plan 9).\n\nOne of the most interesting aspects of Plan 9 is the great variation in performance techniques by the actors. Some speak their lines like they know the script is idiotic while some speak their lines like they don't understand them (which is possible because some of the dialogue uttered by the bumbling aliens doesn't make any sense). But my favourite character is the airline captain played by Gregory Walcott.\n\nGreg's a real trooper and attempts to take his role very, very seriously despite the constant lunacy around him. How did he remain so professional? Did he imagine his role in Plan 9 would lead to greater things?\n\nAlthough Ed Wood has been voted by the US film industry as the worst director in history, he lives on as a kind of cult anti-hero. As a director then, he has achieved a level of lasting success.\n\n6/10 \u0096 For fun value."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "gavin6942",
        "review_rating": "5",
        "review_title": "Weird and Fun",
        "review_detailed_main": "Aliens resurrect dead humans as zombies and vampires to stop humanity from creating the Solaranite (a sort of sun-driven bomb).\n\nThis is one of those \"worst films of all time\", though it is one of the least deserving of that title. Bad? Sure. It uses some crummy effects and archive footage to achieve its goals... the plot is silly.\n\nBut it is also really fun, and in some small way very much a precursor to great films like \"Night of the Living Dead\". And it was a nice showcase for Tor Johnson and Vampira. Heck, Tor is largely known only for this movie. I would also say Bela Lugosi, but he had really nothing to do with this."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Snow Leopard",
        "review_rating": "",
        "review_title": "Thoroughly Inept But Quite Watchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "preppy-3",
        "review_rating": "1",
        "review_title": "Terrible but amusing",
        "review_detailed_main": "OK--this film is terrible (I give it a 1) BUT I'd be lying if I didn't say I enjoyed it--for laughs! Lousy acting, TERRIBLE sets (LOVE the cockpit of the plane and the obvious plastic tombstones) and the hilarious \"special\" effects (the flying saucers were painted pie tins--and it shows). The script is beyond belief! Seriously, did ANYONE think this was written by someone in the right frame of mind? The dialogue was just dreadful. Also the actors were directed all wrong--if they in fact WERE directed. Notice how the police inspector uses his gun to scratch his face, push up his hat, wave in a general direction...and everybody acts as this is perfectly normal.\n\nAnd Ed Wood...he was no director and had zero talent. I love how shots go from night to day to night again for no apparent reason. And poor Bela Lugosi! He was reduced to doing THIS? He has no dialogue and (before filming was completed) he died. So they got a guy ONE FOOT TALLER than Lugosi to play him by holding a cloak over his face! The other actors are (to put mildly) terrible.\n\nThis is not the worst film ever made (\"Salo\" gets that dubious honor) but it's definitely down there. It should be seen with an audience--it's actually funnier that way.\n\nAmong the amusing lines: \"You're all stupid stupid STUPID! Don't you see? Don't you see?\" \"We are all interested in the future for that's where you and I will spend the rest of our lives.\" \"He's dead...murdered and someone's reasponsible!\""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Gislef",
        "review_rating": "3",
        "review_title": "Bad? Horrible? I don't think so...",
        "review_detailed_main": "Compared to the garbage that fills the theaters and direct-to-video tapes of today, Plan 9 is actually pretty good by today's (much lowered) standards. Sure, it's done on a cheap budget, the script is horrible, the dialogue achingly bad, and the actors untalented. But heck, that just means Plan 9 would go direct to video today, and Cinemax would be hyping it as their Friday Premiere two months later. At least Woods seems to be _doing_ something, and trying to convey some kind of message. Go down to the video store and pick out a few direct-to-videos, and see if most modern-day auteurs can claim as much."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "temmons-908-283115",
        "review_rating": "5",
        "review_title": "so its bad.... what did you expect?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "kevinolzak",
        "review_rating": "5",
        "review_title": "Bela Lugosi and Ed Wood, the final curtain",
        "review_detailed_main": "The infamous \"Plan 9 from Outer Space\" was initially conceived as \"Grave Robbers from Outer Space\" until writer-editor-producer-director Ed Wood found financing for his masterpiece from Baptist minister J. Edward Reynolds (it took a meat packing executive to help him complete \"Bride of the Monster\"). Wearing his Dracula cape for what was intended for \"The Vampire's Tomb,\" the late Bela Lugosi is shown emerging from the woods in three different shots, then skulking about someone's back door, while we first see him mourning at the funeral of his late wife before leaving his home one last time (this was actually the residence of Tor Johnson). If this was all the footage in the can that Wood had filmed for other projects, 3 silent minutes of a shattered Lugosi performance, then he must be congratulated for making certain the public would see it, billed above John Breckinridge and Lyle Talbot as 'Special Guest Stars.' Local television celebrities Vampira (as Vampire Girl) and would be prognosticator Criswell make their presence felt early on, the latter narrating off screen when necessary, while the former horror hostess appears very much in costume playing Lugosi's deceased wife, the first corpse to rise from the dead through alien means, Plan 9 to be exact (no light is shed on how the previous 8 fared). This may have been the first occasion when extraterrestrials brought back the living dead, two years before John Carradine's \"Invisible Invaders,\" and over a decade before radiation was suggested in George Romero's Pittsburgh classic \"Night of the Living Dead.\" Wood's story holds together as well as \"Bride of the Monster,\" Gregory Walcott a headstrong pilot, former Western star Tom Keene assigned by Lyle Talbot's General to investigate flying saucers over Los Angeles, Duke Moore's Lieutenant in charge with the demise of Tor Johnson's Inspector Clay. The cemetery next to Walcott's home is a hive of activity, Dudley Manlove as Eros and Joanna Lee as Tanna the concerned invaders fearing the worst from mankind's acquisition of greater power in the wake of the hydrogen bomb. Far too entertaining to be erroneously labeled 'worst movie ever made,' plenty of quotable lines since exhausted from overuse, and Wood's all too real sincerity in the face of nuclear annihilation, younger viewers such as Joe Dante may have scoffed at its dirt cheap production values but no other director could have achieved so much with so little."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "reyalvarez",
        "review_rating": "1",
        "review_title": "If Kurosawa is an AWESOME Genius, Ed Wood is an Awful Genius.",
        "review_detailed_main": "Ed Wood is a genius! During their peak Akira Kurosawa, Ingmar Bergman and Federico Fellini kept on creating cinematic images that can only be called stroke of genius. In this movie Ed Wood Jr. indeed showed his genius. However, his genius was totally opposite of Kurosawa, Fellini and Bergman. If the aforementioned three directors were really, really AWESOME, Ed Wood was really, really AWFUL. He showed a genius in making one of the most awful movie in cinematic history. Nobody else can make such a bad movie. If a mediocre, average person like I made a movie, I will just make a mediocre movie. I can never make a movie which is so bad. One needs a genius of Ed Wood's calibre to make such a bad movie. This is like taking an exam made up of one hundred multiple choice questions. An intelligent or genius student will get 90+ to 100% correct. Even though one has never studied the topic covered in the exam, one will, by statistical chance, get some of the questions correct. One needs a real effort and genius to get everything wrong. Ed Wood is such a genius. He got everything WRONG, WRONG, WRONG in this movie. One needs a tremendous talent to get everything so wrong.\n\nHis casting is incredibly bad. How can one choose Tor Johnson to be a movie actor? His dialog is so bad. Compared to Johnson, another muscle man turned actor, Arnold Schwarznegger, with his sometimes incomprehensible Teutonic English, sounds almost like a poetry reading by Sir Lawrence Olivier. And what is Vampira doing? Do you call that acting? Somebody said there are no bad actors. There are only bad directors. If that is true, Ed Wood is ba-a-a-a-d!! And who wrote this script? Even grade school kids can write better scripts.\n\nDoes Ed Wood know what special effect is? I read that those flying saucers are paper plate spray-painted silver. They do look like paper plates spray-painted silver. Ed Woods' special effect makes some of the tackiest Godzilla movie look like masterpieces.\n\nEd Wood seems to have no sense of continuity. That tall actor--really Ed Wood's chiropractor--who is supposed to be a stand-in for the deceased Bela Lugosi doesn't even look like Bela Lugosi even with his face hidden. The chiropractor is much too tall to stand in for Bela Lugosi.\n\nEven with all these amateurish film making, Ed Wood had the gall to release this movie. What a gutsy guy!!\n\nAfter Ed Wood screws up everything, the result is something deliciously tacky and fascinating. Many film schools analyze and teach works by Kurosawa and Bergman. Film schools should teach Ed Wood's works. They are prime examples of what never to do!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "garyb04",
        "review_rating": "4",
        "review_title": "Bad movie?? You're soaking in it!!",
        "review_detailed_main": "Yes,this movie is considered the worst movie of all time,but believe it or not,it is a lot better and far more entertaining than say,Red Zone Cuba or Beast of Yucca Flats made by Coleman Francis.Coleman Francis is a lot worse a director/filmmaker than Ed Wood ever was!! Anyway,the fun part of this movie for me is trying to count all of the mistakes.I don't know what it is about this movie that is so fun(a guilty pleasure,if there ever was one)to watch.Is it the double standing in for Bela Lugosi?? Is it the fake cemetery?? The dialog?? It's all of it actually.If you're looking for something fun to watch,then pop this in,you won't be sorry!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Hitchcoc",
        "review_rating": "5",
        "review_title": "Poor Bela Lugosi",
        "review_detailed_main": "I'm giving this rating to this mess because over time it has found the hearts of so many people. How can one really hate the absolute diligence and undying spirit of Ed Wood. This movie has everything. Silly aliens. People rising from the grave. Vampires. Ridiculous flying saucers. And, without a doubt, some of the worst acting that has ever been committed to celluloid. And, still, we laugh and look forward to each scene because we know what's next. We know that Bela passed away and a guy who has no physical resemblance to him had to take over. There is no real plot. I believe that the worst list is for movies that have no heart--something like \"Godzilla vs. Freddy Mercury.\" I believe that there are and were directors who simply wrote for the third feature at drive-in movies where the kids didn't even watch. If you've not seen this film. Have the fun of viewing it for the first time."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "spirit-of-1969",
        "review_rating": "10",
        "review_title": "The worst, and therefore one of the best, movies of all time",
        "review_detailed_main": "Poor poor Plan 9: So bad people just watch it to laugh about how bad it is, yet this fundamental flaw pushes it above bad movies, and so it's stuck in between the bottom 100, and well, no where near the top 250...\n\nAnyway, back to the movie. It is as bad as you've no doubt heard. The scene changes from night to day to night, the spaceship is a hubcap (you can see the string it hangs from catch on fire at one point), I could do a better job acting, etc. ad nauseum. But it takes a hell of a lot to be almost universally considered the worst movie of all time, and here is Plan 9's true strength. There are many horrible of movies, but most of them are so bad because they are too bad to be truly bad, and therefore sink into mediocrity. Plan 9, however, has no redeeming quality's, and so it stands out. Few will recognise a movie such as \"The Medallion,\" but every movie-goer knows Plan 9.\n\nAs I said before, it takes a hell of a lot to be the worst. Because of this, Plan 9 is some of the most fun you'll EVER have watching a movie. Almost every scene is so bad I broke out laughing. Few other movies achieve that kind of humor, whether intentional or not. For that I give it a very intentional 10/10."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "PaulyC",
        "review_rating": "6",
        "review_title": "poorly done but not boring!",
        "review_detailed_main": "Although this movie got famous for having the reputation of \"the worst film ever made\" I really do disagree. Sure there are many continuity mistakes including shots shifting between day and night in the same scene and the unrealistic dialog and silly looking sets but it all adds to the fun. The story revolves around UFO sightings happening in a Los Angeles town. The police and eventually the army step in to blast them out of the sky but can't hurt them. The martians who run the UFO'S look and sound like regular people but with silly uniforms. Their mission is to release \"Plan 9\" on the humans which is a plan involving bringing the dead to life to get everyones attention. The martians want to bring peace to earth by communicating with the humans but all the humans want to do is destroy the UFO'S making it hard for a peace talk. How this weird plan is supposed to work to bring peace is silly in itself. There are so many mistakes and silly scenes in the movie I would take up too much space writing it all. When Gregory Walcott, one of the lead actors, read the script, he told director Ed Wood it was the worst script he ever read but he needed the work. Bela Lugosi appears in some footage shot just before his death with no project in mind. Ed incorporated it in this movie so he can include him in the film. Lugosi was doubled by Tom Mason, Woods Wife's chiropractor, who was inches taller and played the part with a cape covering most of his face. The movie stars Wood regulars Paul Marco and Conrad Brooks. This movie reinforces my belief that the only bad film is a boring film!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "BA_Harrison",
        "review_rating": "5",
        "review_title": "Essential viewing for fans of z-grade schlock.",
        "review_detailed_main": "A race of human-like aliens (including obligatory hot female, Tanna, played by Joanna Lee) try to make contact with Earth, but are repeatedly rebuffed, leaving them no choice but to put 'Plan 9' into operation: reanimate the dead and take control of the planet by force!\n\nDirected by Ed Wood, who had no idea just how terrible a film-maker he was, this '50s cult classic gets it wrong in all the right ways, with not a shred of irony and no sign of tongue-in-cheek. Horror star Bela Lugosi died halfway through filming, probably of acute embarrassment, but Wood didn't let that inconvenience stop him - he just used a stand-in who covered his face with a cape for the rest of the film.\n\nThe cheapness of the production is evident in almost every scene, from the hilarious airplane cockpit comprising of a curtain, two chairs and some plywood controls, to the wobbly 'hubcap' flying saucers suspended on pieces of string, to the alien's spaceship which features velvet curtains and ladders inside and out. Stock footage of military airplanes is used to pad out the run-time.\n\nIt's hard to say who is the worst performer: Tor Johnson and Vampira are terrible as reanimated bodies under the control of the aliens, but at least they're supposed to be lifeless; the rest of the cast has no such excuse. For your consideration: Gregory Walcott as 'fists first, talk later' pilot Jeff Trent, weird soothsayer Criswell as the narrator, and Duke Moore as the cop who scratches his head with the barrel of his gun and delivers this priceless piece of dialogue - 'One thing's sure... Inspector Clay's dead. Murdered. And somebody's responsible.'\n\nPlan 9 From Outer Space is often cited as the worst film of all time, and, from a technical standpoint, it's definitely a strong contender for the title, suffering from a terrible script, poor acting, ham-fisted direction and terrible special effects. In terms of entertainment value, however, it is far from it: the sheer shoddiness of the whole thing makes it great midnight movie viewing for fans of z-grade sci-fi."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Infofreak",
        "review_rating": "",
        "review_title": "The worst movie ever made? Not even close. One of the most fun? You bet!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Sam Sloan",
        "review_rating": "5",
        "review_title": "There Really Was An Ed Wood!",
        "review_detailed_main": "As I sat watching TCM at the beginning of a movie, I did something I rarely do, I read the credits rolling across the screen. There, for this movie Plan 9 From Outer Space, came up the name Edward Wood Jr as the producer, director and writer. I had seen the movie Ed Wood a few years back and remembered it as the story about some guy with a tiny budget and little talent for making movies who was a genius at scrounging up money to make them, finding washed up movie actors and somehow getting theaters to show them. I didn't know this guy was real. He was real! In the movie Ed Wood finds Bella Ligosi as his one star he needs to lend credibility to his productions he makes. Bella Ligosi shuffles about in despair, realizing his career is over. And when you see Plan 9 From Outer Space, you can see why. Plan 9 From Outer Space is one of those movies Ed Wood made! It would have been much more meaningful for me to have seen Plan 9 From Outer Space before seeing the movie Ed Wood. But now that I've seen Plan 9 From Outer Space it all makes more sense to me now. Both movies belong together as a set. Plan 9 From Outer Space captures the true cheesiness, the desperation and results of shoe string budgets, the lack of movie making skills and how those things all contributed to the basis of the plot upon which the movie Ed Wood was based. I think you will actually enjoy the movie Plan 9 From Outer Space. It is so bad, it's good! And I know it will make you enjoy the movie Ed Wood even more."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Lady_Targaryen",
        "review_rating": "3",
        "review_title": "I know it's bad quality movie, but it's funny",
        "review_detailed_main": "I know that Ed Wood movies are not about the quality, but we all need to admit that is funny to watch a movie so badly produced! I mean, of course I will not give 10 in a movie like this one, but I laughed a lot with some situations, like the gravestone falling, and the guy that is in Bela Lugosi's place, with his arms covering his face all the time to not show this obvious fact.\n\nI agree with a guy who said that this movie is not the worst of all. I found Glen or Glenda MUCH worst!Come on,'Plan 9 from Outer Space 'at least makes you laugh! What I found worse in this movie was not the effects - as the biggest part of the people complains about - but the lines. Many lines are dumb and even a little bit of annoying. (Like the beginning,the shot where shows Ghoul Man (Bela Lugosi) sad about his wife's death. Oh My God, that part was soooo boring!)"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "briancham1994",
        "review_rating": "5",
        "review_title": "Stupid but fun",
        "review_detailed_main": "This film has a reputation for being terrible and while it definitely has hilariously bad moments, it has a well intended story that is engaging once you get past the UFOs on strings. I don't think it entirely lives up to its reputation then. The special effects and production values are shoddy for sure, but there is definitely an interesting core to the story."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "philipalancarter",
        "review_rating": "5",
        "review_title": "Definitely NOT the worst film I have seen",
        "review_detailed_main": "Fun film. Far from perfect and the fact that this film was made on a very low budget is obvious. But whilst some of the acting is poor, some is quite good, if not funny - and we all need a good laugh now and then. It's camp and silly and dreadful and hilarious all at the same time. Worth watching to enjoy laughing at the \"Amazing\" Criswell, the effeminate \"Leader\" and Eros's epic speech, not to mention Tor Johnson's and Vampira's \"Academy Award winning\" performances. Watchable and almost enjoyable!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "elijahpatriot",
        "review_rating": "5",
        "review_title": "Isn't as bad as most say.",
        "review_detailed_main": "This movie is definitely not high dollar at all, nor the production quality. But Ed Wood wanted to make something and thats what makes me appreciate this movie. The movie has a special mood to it. But some parts of the movie drag for on and on. But it can be pretty fun to watch at some parts like when the flying saucers are going around ever where. Ed Wood didn't need CGI he just needed a mind that expands past the average human. Its a decent plot but definitely not one of the best productions out there. This movie is for old school horror fans who don't care about a couple flaws."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "listenbucko-08641",
        "review_rating": "1",
        "review_title": "Worst Movie Ever? Supreme Fun Anyway",
        "review_detailed_main": "Some regard this as the worst movie of all time. Who knows? Maybe it is. But I love it, and watch it frequently. It never ceases to entertain me. Every aspect of it is inept, including some of the worst cinematography and \"special effects\" I've ever seen. I highly recommend seeing this movie to anyone. It's a laugh riot the whole way through."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "filipemanuelneto",
        "review_rating": "1",
        "review_title": "Miserably memorable.",
        "review_detailed_main": "This is one of those movies that, without a doubt, is bad. More than just being bad, it is an object of study for any apprentice filmmaker, because almost everything that could go wrong actually went wrong.\n\nThe problems begin with Ed Wood's utterly incompetent direction. My cat is the best movie director. Inattentive, careless and incapable, Wood simply lets everyone else do their jobs at their own risk. Wood doesn't seem to be concerned with any question of continuity (days and nights seem to happen at random, props appear and disappear several times), he allows us to calmly see the filming material (cameras, microphones, light equipment, etc.) until the cardboard headstones in his cemetery fall, so obviously fake it's incredible they were used in a movie. And I'd rather not mention the flying saucers, which are obviously children's toys hanging from transparent threads, probably maneuvered by fishing rods!\n\nThe script is, of course, another problem, giving us one of the most fanciful and clearly false stories that science fiction has ever seen: unpleasantly mixing vampires, undead and aliens, we feel that we just need to find Tarzan, Donald Duck, two or three cowboys and a family from Minnesota on vacation, having a barbecue in the cemetery. The imagination is the limit! And the dialogue? The film is an unstoppable source of jokes and memorable phrases, the result of the childish and idiotic way in which everything was written.\n\nThe cast brings together a series of names well known to most of the public, not because they are good actors, but because they have played important and notable roles at certain moments. This is the case of Maila Nurmi, the eternal Vampira, who doesn't say a single word and does little more than stare at us and the other characters. Even without opening his mouth to utter a sound, this is undoubtedly one of the most iconic films of this actress, in one of the most remarkable \"personas\" of her career. The friendly Tor Johnson is also here, with his unmistakable look that made him a striking figure in the cheap horror movies of this era. Bela Lugosi had his last film appearance in this film. Invariably wrapped in his aristocratic vampire cape, which immortalized him and in which he would later be buried, he died during filming, having been very skillfully replaced by another man, who hides his face with the cape so that it is not so evident that they are two different people."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "lschwartz106",
        "review_rating": "10",
        "review_title": "A film to be taught",
        "review_detailed_main": "First of all, how could a film that has brought so much enjoyment to so many people be called \"the worst film ever made\"? I have seen major Hollywood products with major Hollywood stars and some of these films are impossible to sit through even once. \"Dick Tracy\" comes to mind, as does \"Caligula.\" The very first time I saw \"Plan 9\" in a NYC revival house, just hearing Tor Johnson's struggle with English pronunciation and watching him wriggle out of the ground was worth the price of admission! It was probably the hardest I'd laughed in a movie theatre in many years. I don't know what kind of movie the actor who plays Eros thinks he's in, but he seems to be having a lot of fun. We all know that the comedy of the film was unintentional, then why do we laugh? We laugh because Mr. Wood does everything conceivable to mask his non-budget to give the illusion of a grand sci-fi-horror epic. And he does it with such unabashed gracelessness with so little concern for time continuity or any other kind of logic, that we laugh at just how absurd the medium of film can become, if used in incompetent hands. Ed Wood gives new meaning to the word \"schlock.\" The cinematic legacy he has left to enjoy should be called \"pop-schlock.\" If the point of the film is to ultimately entertain, this is one of the best films of all time, not the worst."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "vamorrison",
        "review_rating": "7",
        "review_title": "He made the movie he intended to make!",
        "review_detailed_main": "Like several of you, I saw the 1994 movie about Ed Wood, and then decided to go back and take another look at Plan 9.\n\nI have a theory. Stick with me on this. I think Ed Wood made exactly the movie he wanted to make.\n\nIt's true this movie is so bad, a group of seventh graders could write, direct, and act in a better one. Even a seventh grader would not have the police leave the station, zoom along a country road, and arrive at a crime scene in night-day-night sequences in THREE different cars. And even a seventh grader would realize that if an actor kicks over a cardboard tombstone in a fake cemetery, you shoot the scene again.\n\nWood must have known exactly what he was doing, and as he also edited the film into its final form, he could not have missed all the incredibly obvious continuity fluffs.\n\nI originally rated it five out of ten, but raised my score to a seven because as a deliberately bad movie, it's very good.\n\nTry watching it again with the thought that maybe it's a send up and Wood made the movie he was trying to make. Nobody could make a movie this bad unless he did it on purpose."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "gcanfield-29727",
        "review_rating": "5",
        "review_title": "Worst movie ever made? Maybe not",
        "review_detailed_main": "It's hard to rate this movie. Obviously branded the \"worst movie ever made,\" you actually expect it to be bad. How can you fault a movie for delivering what you expect?! In 60 plus years, there had to be a few movies that give this one a run for its money. One film that comes to mind is Ganja and Hess (1973). Plan 9 is the product of a man that had no talent, but it at least had some unintended humor. Bela Lagosi died before the film was completed, so Ed Wood held a mask over his face, and completed the film in Lagosi's place. That, in itself, is hilarious. Contrary to the opinions of film critics, every movie doesn't need to be \"smart.\" I give credit to any movie that entertains me, even if it's only because I'm laughing for the wrong reasons."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "jan-277",
        "review_rating": "",
        "review_title": "Seeing the whole story around it,you must love it !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "vespertine",
        "review_rating": "4",
        "review_title": "a veritable cult classic!",
        "review_detailed_main": "Plan 9 is a must-see for fans of cheesy old sci-fi films. The plot lacks believability, scenes switch from day to night without warning, and yes, one can even see the string upon which a UFO is hung! The only value to this film is that of comedy; even so, it's a wonderful laugh and a movie I whole-heartedly recommend.\n\nThe movie, of course is the most [in]famous work by the great cult director Edward D. Wood Jr. \"Grave robbers from outer space\" have failed in their first eight plans to take over Earth, and move to plan nine: resurrecting the dead of the planet for doing the dirty work. People begin noticing strange happenings in a California cemetery, and the police are sent to investigate. Strange flying objects are seen overhead. In the meantime, the aliens have managed to revive the corpses of three people for their plan. A suspicious local pilot, the military and the police must uncover the horrific plan of the aliens and stop them before it's too late."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "cmav401",
        "review_rating": "3",
        "review_title": "A beautiful example of movies that are so bad they are good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "xyzkozak",
        "review_rating": "4",
        "review_title": "Guaranteed Good For A Few Laughs",
        "review_detailed_main": "Yikes! Believe it, or not, as a young tyke of 8 years, this totally inept, unintentionally hilarious, z-grade Sci-Fi flick scared the hell out of me. Yep. That's right. It was terrifying enough to give me nightmares and have me demand that my mother check under my bed for the monsters.\n\nPLAN 9 FROM OUTER SPACE (P9FOS, for short) is one of those unique movies that's so bad that it's actually good (well, sort of). I don't think that it deserves to be labelled as \"The Worst Movie of All Time\".\n\nThere are definitely much-much worse movies than P9FOS out there. I mean, at least with this one you're almost guaranteed to enjoy some honest-to-goodness bell-laughs throughout its 80 minute running time. Yes. You sure are - Unless, of course, you're a total grouch, that is.\n\nLike its spooky graveyard setting of cardboard headstones that wobble in the breeze, P9FOS's plot of an alien invasion (taking place in the San Fernando Valley), is wafer-thin, to be sure.\n\nDirected by schlockster, Ed Wood Jr., P9FOS opens with Criswell's priceless, dead-serious \"My friends\" monologue in which he refers to future events in the past tense and guarantees us all that what we're about to witness here is (My friends) based on \"sworn testimony\". (Ha! That's a killer!)\n\nSo - Is PLAN 9 FROM OUTER SPACE (the cheapie of all cheapies) the worst movie of all time? No. I think not."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "turtlesrus",
        "review_rating": "4",
        "review_title": "So incredibly stupid it must have been planned that way",
        "review_detailed_main": "This movie has become a cult film because it is so incredibly disorganized and full of incongruities, one gets the feeling that there must be meaning in it. But exactly what is it? Is the meaning simply that it is nonsense in and of itself. Is it really a spoof on stupid vampire and alien movies or is it - itself - just another stupid vampire/alien movie? IS it a great movie by virtue of its being so bad, but so seriously filmed, that it just keeps people coming back to find out whether it has meaning? Or is it that the viewers who keep watching it, are proving that they themselves are stupid for watching and continuing to watch a movie that never had and never will - have any meaning. A great film for overworked minds at the end of the day."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "The best worst-film of all time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "bkoganbing",
        "review_rating": "1",
        "review_title": "No Satirist Could Have Done Better",
        "review_detailed_main": "The only thing I can say positive about Ed Wood's Plan 9 From Outer Space is that he apparently had a vivid imagination. And to think this was conceived without the reported aid of any hallucinogen.\n\nHe had to have an imagination just to have made a feature film after the death of his star. What you saw in Tim Burton's Ed Wood is quite true. Wood filmed some scenes with Bela Lugosi, recently discharged from a sanitarium only days before Bela died. Did that stop Wood? Not a bit, though I wonder what the original film might have been if Bela had lived and done the whole thing.\n\nInstead Bela had a stand in with a cape over his face and the dead Mr. Lugosi along with Vampira and Tor Johnson became the walking dead of Plan 9 From Outer Space. Now what were these zombies walking around for. Merely to get our attention, the governments of the people of Earth particularly the American government.\n\nWhy the aliens who are controlling the zombies want our attention. Because we're a people who likes to blow things up and we're about to discover something that will blow it all up and I do mean the universe.\n\nOf course Plan 9 From Outer Space is so laughable that no science fiction satirist could have done any better. Yet in all the horrible special effects and laughable dialog, poor Ed Wood combat soldier from the Pacific theater in World War II was actually trying to say something about disarmament. The man just didn't have the talent to pull it off.\n\nBut he did create purportedly the worst film ever made. I guess that's an achievement of a lifetime."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "klyne005",
        "review_rating": "2",
        "review_title": "What plan?",
        "review_detailed_main": "I felt rather uneasy watching this. Not because of the horrible acting, which I can tolerate, or the shoestring budget sets. It has more to do with the fact that the film has a strange sort of untapped(and misdirected) energy. It is the sort of energy that has been used at other times with much greater power.\n\nI'm of the group that believes even the stupidest idea can, with the right approach and presentation, be made into something at least watchable. Alas, the script is embarrassing and doesn't even take a feigned attempt to make connections internally or externally, and as you well know the direction is slipshod. There is nothing here but that misplaced energy.\n\nWhat a thin line there is between genius and mediocrity!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "wbcamera",
        "review_rating": "10",
        "review_title": "Mad Genius or just Mad?",
        "review_detailed_main": "Plan 9 was made during the hysteria of Macarthyism. For this reason, there was a myriad of \"invisible invaders\" movies that permeated the landscape at the time Wood created this movie. While the script is flawed, the storyline one-dimensional, the special effects non-existent, stock footage galore, and the acting as cardboard as they come, this movie blends these aspects together in spectacular fashion. Had this movie had Tim Burton or the Zucker brothers names attached, and been released 20 or more years later, this movie might be considered one of the greatest spoofs ever made. There is so much to get caught up in, and so many different things to hit the rewind button for, that it may take upwards of 2 hours to get through this short film. This film is bad, but it could be argued that this film was created to be bad! From cut shots that move from midnight to midday and back again, to mattresses readily apparent as fall-aways, to the ever-popularly sighted man in the cape covering his face from the camera, this film has more Easter Eggs in it to search for than Oliver Stone has conspiracies.\n\nWe sometimes forget that films are created to be enjoyable. We don't always need to have to ponder the meaning of existence after every feature. This is a film from within the era is seeks to mock. Every cliché is used. It's not quite a horror film, and yet holds some of the well-worn clichés of the genre. Same for the Sci-Fi genre. This is a film that rises above it's own limitations to entrench itself upon the cinematic landscape it seeks to make fun of. Remember, this is Ed Wood's idea of the greatest film he could create.\n\nThis film has to be listed among mandatory viewing for anyone aspiring to work with the industry, as it is a mockery of both the big budget as well as the independent spirit.\n\nThis is one film you will not soon forget, and for all the right reasons. Is it right to be so wrong? Or is it wrong to be so right? Is this film a great parody? A masterpiece of a spoof? Or was it genuinely trying to be as good as it possibly could? This is all up to debate. The fact remains, your time viewing this film will seldom be thought of as a supreme waste.\n\nA masterpiece? Maybe. The worst film of all time? Absolutely not."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "desh79",
        "review_rating": "7",
        "review_title": "The ultimate anti-masterpiece",
        "review_detailed_main": "I don't believe that the \"Worst film ever\"-label really applies to Plan 9 because this film is SO bad, so phenomenally inept that it's a total hoot from start to finish - in fact, it's probably one of the most entertaining movies you're likely to see (even if not for the reasons intended). From the utterly bizarre \"Criswell Predicts\"-opening (which makes absolutely no sense and doesn't seem to have any relation to the rest of the film whatsoever), to Bela Lugosi's infamous \"last scenes\", and some wonderfully weird dialogue (\"Inspector Clay is dead ...murdered... and somebody's responsible!\"), this is an absolute must-see for any film lover, even if as a mere guideline in how NOT to make a movie. Perhaps best viewed with Tim Burton's biographical masterpiece of director Ed Wood as a companion piece either beforehand or afterwards."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "hall895",
        "review_rating": "1",
        "review_title": "Stupid! Stupid!",
        "review_detailed_main": "Few movies completely live up to their billing. Plan 9 from Outer Space does. Unfortunately its billing is as the worst movie ever. Everything you have ever heard about this movie is true. It's all here. The flying saucers on strings, the continuity errors, the guy trying to hide the fact he's not Bela Lugosi by covering his face with a cape, the guy who actually is Bela Lugosi wandering through a field in a shot which is used again and again because they have no other shots of Lugosi because by the time they filmed this movie he was quite dead. There are the awful visual effects, the mismatched stock footage, the gravestones which topple over at the slightest touch, the crypt made of cardboard, the \"cigar-shaped\" saucers which aren't actually cigar-shaped at all and a narrator who can't decide whether these events happened in the past or will happen in the future. There's a story which makes no sense, dialogue which is the worst ever put to film, acting which is uniformly terrible and a Los Angeles police detective who oddly has a distinct Swedish accent. Hey look, it's daytime! Now it's nighttime! And daytime again! All in the span of fifteen seconds. To say this is an amateurish production is an insult to amateur filmmakers everywhere. Even an amateur might be able to produce something which is at least slightly coherent. Ed Wood could not. He aimed for the stars and came up a few billion miles short. At least one of his performers was in on the joke which was this movie. John Breckinridge, playing the alien ruler, looks into the camera with an \"Oh come on now, seriously?\" look. Everyone else involved does in fact seem to be taking it seriously. What a terrible mistake that is. You can't take this movie seriously. It may be one of the great unintentional comedies ever. It's worth watching once to have a good laugh at all the ineptitude on display. As one of the actors so memorably puts it, with one of the most comically bad line deliveries in film history, \"Stupid! Stupid!\" Stupid indeed. Stupid in every way."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "tostinati",
        "review_rating": "",
        "review_title": "There's a little Ed Wood inside all of us.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ma-cortes",
        "review_rating": "3",
        "review_title": "Ridiculous and embarrasing Science-Fiction yarn with atrocious settings and lousy acting",
        "review_detailed_main": "A shiny flying saucer emits a blinding ray of light over Southern California's clear blue skies ; a bit later on , it lands on a lonely cemetery where a mournful old man (Bela Lugosi) has just buried his spouse . As the very sight of extraterrestrial activity brings horror to the once-peaceful area, the technologically-advanced spacecraft's commander Eros (Manlove) and his lieutenant Tanna (Joanna Lee) begin deploying their strategic plan to take over Earth, code-named \"Plan 9\" in which the Aliens resurrecting the dead . Step by step , through sophisticated methods unknown to humans , the pitiless aliens proceed with the creation of a devastating Zombie Apocalypse . As the aliens resurrect the dead of the Earth, the lives of the living are in danger. Along the way , Patrolman (Paul Marco) , Patrolman Larry Anthony (Carl Anthony) , Inspector Clay (Tor Johnson) , military as General Roberts (Lyle Talbot) , Colonel Edwards (Tom Keene) go after them . Horrors From Outer Space Paralyze The Living And Resurrect The Dead! Flying Saucers Over Hollywood! .The worst movie of all time is finally available on video for more laughs than you got from Monty Python!.\"Can your heart stand the shocking facts about Graverobbers From Outer Space?\" As the screen's greatest shock star Bela Lugosi is back to haunt the Earth in a terrifying revelation of things to come!\n\nIt is a ponderous science fiction cheapie with shooting technique extremely execrable . Even worse , Bela Lugosi is top-billed even though he died three months before the movie was made , in fact undaunted Edward Wood used silent home movie footage of the once great horror film star . At the same time , this disconcerting flick attempts to deliver an antiwar message as well as chilly and thrills . The 50s typical plot and a simple as well as plain script with evil aliens attacking Earth and set a terrible \"Plan 9\" into action to relive the walking dead . This 1957 movie's really known thanks to Ed Wood (1994) ,a biopic of the life and work of the legendary 'worst director of all time' ; being based on Rudolph Grey's book ¨Nightmare of ecstasy : the life and art of Ed Wood¨, this is a splendid tribute by Tim Burton to bring to the screen the tale of a filmmaker many consider to be the worst of all time and focusing his relationship with the inconsolable Bela Lugosi and his rare troupe of actors . Shoestring production , in fact , while Tim Burton's Ed Wood was big-budgeted whose film cost more to produce than all of Edward D. Wood Jr.'s films put together . Tim Burton said that he was drawn to the story because of the similarities between Edward D. Wood Jr.'s relationship with Bela Lugosi , now ageing and unemployed horror star , and his own friendship with Vincent Price who played him . Almost every role has an appropriate resemblance to his or her Z-player counterpart Plan 9 from Outer Space and the performances are adequate such as Sarah Jessica Parker as Dolores Fuller , Jeffrey Jones as Criswell , Bill Murray as Bunny Breckinridge , Max Casella as Paul Marco , Brent Hinkley as Conrad Brooks , Lisa Marie as the statuesque Vampira , George 'The Animal' Steele as Tor Johnson and Juliet Landau as Loretta King .\n\nThe picture was absurdly and ridiculously directed by Ed Wood with abundant failures , shortfalls and flaws , in fact the sets are made of cardboard and often bumped into by the stars and the dialogue incredibly moronic and without sense . Ed Wood was a low-budgeted auteur and hack director of such lousy actors and notoriously bad movies as ¨Glen or Glenda¨, ¨Bride of monster¨ and ¨Plan 9 from outer space¨ . However , 'Edward D. Wood Jr.' now occupies a lofty position as a cult icon . He was a legendary director of awful pictures , a real Hollywood maverick , a cross-dressing , angora-sweater wearing filmmaker , his best-known period of his life in the 1950s , when lack of financing and repeated failures led to make a lot of bad but nostalgic films."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Mr. Pulse",
        "review_rating": "4",
        "review_title": "Cheesier Than Swiss",
        "review_detailed_main": "How does one grade \"Plan 9 From Outer Space?\" If we say that director/writer/producer/editor Ed Wood Jr. was trying to film a serious, scary movie, well then \"Plan 9\" is a terrible, terrible movie. Dreadful. Incompetent. Poorly acted and directed.\n\nYet, I invite anyone to try to watch this movie without smiling. It falls into the category of movies that are so-bad-they're-good. And while I wouldn't go so far as to call \"Plan 9\" a good movie, it is a funny one. How can you not laugh when Tor Johnson stumbles as he is getting out of his grave? Or when Criswell warns us all that the future will affect us all...in the future. Or (my personal favorite) the incredible lack of attention paid to continuity between day and night scenes. Cars drive up to a site during the day, the car stops and everyone gets out, and it's night!\n\nI gave \"Plan 9\" a 4/10, on the basis of its original goals and its lack of succeeding in them. This is not a horror film; the only thing that scared me in this movie was the Vampira's garishly skinny waist. But as an unintentional comedy, the film is almost a 10. The only movie I know that is funnier without intending to be so is \"Batman and Robin.\" Perhaps that was Joel Schumacher's homage to Ed Wood."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "classicsoncall",
        "review_rating": "4",
        "review_title": "\"My friends, we cannot keep this a secret any longer...\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Son_of_Mansfield",
        "review_rating": "2",
        "review_title": "The Day The Earth Laughed Loud.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Stibbert",
        "review_rating": "2",
        "review_title": "Well, it's funny in it's own kind of way",
        "review_detailed_main": "I admire this movie. Think about it... It's the only movie I know that's famous for being bad and it's been that way for nearly 50 years.\n\nAliens are not planning on taking over mankind this time. They just want our attention. The previous 8 plans have failed so it's time for Plan 9: Wakeing up the dead.\n\nThe acting is lousy and almost all the shots have continuity mistakes. The effects are horrible and the sets are hilarious. However, that's what's cool about it. If you're feeling down this movie will make you feel better. It's funny because you don't laugh with the movie, you laugh at it. I think of this movie as a must-see for all enthusiasts and if you have and open mind and not to high expectations you'll be in for a good time watching this movie."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "poolandrews",
        "review_rating": "4",
        "review_title": "'One thing's sure. Inspector Clay's dead. Murdered. And someone's responsible.' Nowhere near the worst film ever made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "storewars",
        "review_rating": "5",
        "review_title": "The Worst, Yet One Of The Funniest Films Ever Made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "fjhuerta-2",
        "review_rating": "9",
        "review_title": "Deliciously inept - fantastic for those lonely nights",
        "review_detailed_main": "What can I say! This is not a \"1\" or a \"10\" movie... and neither it deserves any grade in between. It's simply a guilty pleasure for me... watching the absurd sights... listening to the amazingly inept dialogue, worthy of George Lucas' \"Episode II\" (maybe it's a bit better ;), watching Bela Lugosi freeze for a couple of frames, then being replaced by someone else...\n\nNo, it's not the worst film ever made. No, it's not the best one, either. It is the testament of someone who wanted to leave his mark, made an honest effort to deliver the goods (Ed Wood, of course), and instead delivered a strange mix that works because it makes us perfectly identified with him. As in \"if I made a movie, I'd surely make one as bad / good / unintentionally funny as this one\".\n\nYep. Ed Wood is one of us. Long live \"Plan 9\" and his misunderstood director."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Rainey-Dawn",
        "review_rating": "6",
        "review_title": "Worth A Watch",
        "review_detailed_main": "There are people who say \"Plan 9 From Outer Space is the worst movie ever made.\". I agree this is not a quality film but I disagree that this is the worst film ever made. I have seen worse. Much worse. I would put the film in the category of a fairly decent film to watch for fans of B-rated sci-fi and horror for it's novelty and somewhat entertaining value.\n\nYou will not see much of Bela Lugosi here...in fact, hardly anything at all from him. He passed away during the filming. You can see quite a bit of Tor Johnson and Vampira in this one.\n\nThe story is not all that good. In fact is terrible. Yet it is fun to watch so I do recommend this movie for sheer the novelty of it and because it is Bela Lugosi's last film before his untimely death on August 16, 1956.\n\n6/10"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "siderite",
        "review_rating": "4",
        "review_title": "Really corny, but funny",
        "review_detailed_main": "I gave this movie a 4. I rate 1 only unwatchables, I rate 2 the movies that are incredible bad and offensive, I rate 3 the movies that are very bad, yet try not to be. I don't think that this movie ever intended to be a block-buster. I think Ed Wood had fun making this one, just as he had making other movies. Maybe I was influenced by the Johnny Depp movie about Ed Wood, but let's face it, I wouldn't have watched the movie otherwise.\n\nAll in all it is a watchable movie, with terrible sets, terrible dialogs and terrible acting, but amounting to hilarity, not boredom or nausea."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Dethcharm",
        "review_rating": "",
        "review_title": "HUBCAPS SEEN OVER HOLLYWOOD!...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Doylenf",
        "review_rating": "5",
        "review_title": "The best of the worst...so bad you have to see it to believe it...",
        "review_detailed_main": "PLAN 9 FROM OUTER SPACE is strictly amateur night at the movies. Taken as that, you can sit back and enjoy the inept acting, direction and staging of every scene--a film obviously filmed on a shoestring budget and directed by the infamously untalented Ed Wood, Jr. If you saw ED WOOD with Johnny Depp, you'll have a special fondness for this atrociously put together film. You'll probably enjoy every minute of it! Worst performers of all are VAMPIRA and THOR, although they have competition in that department from most of the cast. Only LYLE TALBOT as General Roberts and GREOGRY WALCOTT (the male lead, as Jeff) give what can be called professional performances. The rest of the cast sounds like they're reading their lines for the first and last time.\n\nThe outlandish plot has aliens devising their ninth plan to control the earth by raising the dead and controlling them to destroy the evil earth people by some sort of advanced computerized system. BELA LUGOSI's footage consists of a few glimpses of him walking around in a graveyard while most of the other shots have an actor wearing a black cape subbing for Lugosi who died during production.\n\nThere's a certain creepy atmosphere to all of the graveyard scenes enveloped by mist and dark lighting and amusement in watching VAMPIRA and THOR go through their paces with hands and arms outstretched, but the film is actually not as much fun as I anticipated. Too many of the scenes are played in a manner that takes itself too seriously and none of it is the least bit convincing. The acting, for the most part, is as cardboard as the sets.\n\nSumming up: Worth a look at least once, but hardly the camp classic that it has become. But by all means, watch Johnny Depp in ED WOOD.\n\nTrivia note: Some scenes will remind you of the \"Flash Gordon\" serial of the 1930s--especially the dialog."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "puttputtk",
        "review_rating": "5",
        "review_title": "whats the big deal?",
        "review_detailed_main": "Plan 9 from Outer Space (1959)\n\n5 word summary\n\nAliens turn zombies against humans\n\nI don't understand how this movie got so popular. It's not good and its not that bad. I watched this expecting a terrible film that I would sit and laugh at, but really I just sat back and watched it. I didn't enjoy it but I didn't think it was as miserable as everyone has said. I found old horror films like Attack of the Giant Leeches or The Creeping Terror much worse and much more deserving of criticism. The directing and acting is no worse in Plan 9 than most of the other low budget horror/ sci-fi films of the time that I've seen, I'm just confused as to why this one got the spotlight\n\nDirecting, acting, writing etc, all are tolerable but it's just not bad enough or good enough to really enjoy that much. It's a little boring, but really, as I mentioned, it is tolerable.\n\nI wouldn't recommend this film to anyone unless you are a big Ed Wood fan or you just want to see what all the fuss is about.\n\n5/10"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "srooks1",
        "review_rating": "3",
        "review_title": "So Bad, It's Funny",
        "review_detailed_main": "Plan 9 from Outer Space has long been thought of as the worst film ever made. Wooden dialog, stiff acting and bad lighting make it a bad film, but the cast and crew soldiered on. Even the death of star Bela Lugosi did not kill the film. Despite all the ineptness surrounding this film, it exemplifies the \"best\" of bad filmmaking, and it is a triumph of the human spirit, no matter how badly human beings mess up."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "jamesrupert2014",
        "review_rating": "3",
        "review_title": "The Ben Hur of bad movies",
        "review_detailed_main": "Ed Wood Jr.'s legendary monument to inept film-making, \"Plan 9 from Outer Space\" is likely the best known of the classic cult 'bad movies'. The story makes little sense, the cast bizarre, the acting amateurish, the script incoherent, and production values negligible, but like all cult movies, no matter how bad, there is something engaging about the film that makes it watchable (and rewatchable) despite its flaws (which are plentiful). The story behind the production is as entertaining as the film itself and much has been written about movie and on its singular auteur, who was portrayed by Johnny Depp in Tim Burton's excellent bio-pic \"Ed Wood\" (1994). Rating a film like this is always a challenge as there is a huge discrepancy between what it is (crap) and what it offers (fun), so I will condemn it yet recommend it."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "JamesMovieGuy_117",
        "review_rating": "4",
        "review_title": "Is it the worst movie ever made? Actually no...",
        "review_detailed_main": "What can I say about Ed Wood that hasn't already been said? If you've ever seen the Tim Burton directed Ed Wood film starring Johnny Depp than you know he was determined to make whatever he wanted at any cost.\n\nPlan 9 is what he's most known for due to its schlocky production qualities and its hilariously bad moments. However, is it the worst movie ever made? Actually no, heck it isn't even the worst Ed Wood movie.\n\nIf you haven't seen Plan 9 you are in for a treat! It features a great introductory narration by Criswell explaining the grave robbing from outer space which features stock footage of Dracula himself, Bella Lugosi until he suddenly gets run over by a car off screen.\n\nThe imagery in this film inhabits that low budget sci-fi look from the 1950's. We have flying saucers on strings, a fake looking grave yard set and alien technology that isn't the slightest bit convincing.\n\nThe naivety of the filmmaker is what makes this movie entertaining and the viewing experience doesn't feel torturous as say, Manos The Hands of Fate."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "SallySynergy",
        "review_rating": "5",
        "review_title": "A movie with complex ideas...",
        "review_detailed_main": "As much you try to come to a final opinion about this movie is really difficult to decide whether it is actually a bad movie or a good one. There are terrible mistakes that make it a hilarious movie and there is something surreal in an extremely artistic way,which I think it was absolutely accidental. Maybe it's a reflection of the hallucinating passion that Edward D. Wood felt for the world of cinema and a mind not cinematographic structured. Anyway Plan 9 from Outer Space is hugely successful, even if all Hollywood industry considers Edward D. Wood has one of the worst directors.\n\nWith no sponsors and no money is amazing how he manages to find a way to make the movie and how he replace Bela Lugosi with another actor who is not an actor( just phenomenal). In fact I think it's great that Tim Burton has made the movie about Ed Wood, he managed to give an idea of the whole production process of the movie and Wood's chaotic mind that continues to fascinate me. The poorly constructed scenarios end up damaged in the scenes,such as the graves in the cemetery that are run over by the police and eventually fall, just hilarious! Even if you have a bad idea of the movie you should see it!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "jgreen8824",
        "review_rating": "4",
        "review_title": "Awful, but at least watchable",
        "review_detailed_main": "I'll be the first to admit that Plan 9 From Outer Space is an awful film. But at least it's watchable, which is a lot more than I can say for other films that cost much more, and used actors / actresses that are much more recognizable.\n\nThere are glaring and recognizable mistakes throughout the film, there's very little in the way of an actual story, and it's quite apparent that this film was made on the cheap - the sets are a pretty good indication of that.\n\nBut for all its problems, the movie does actually have a good pace, and seems to move along fairly quickly. It doesn't feel plodding, or fluffed up like other films, especially from the B-movie genre seem to be."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "nickreaper",
        "review_rating": "8",
        "review_title": "Worst movie of all time? Not by a long shot.",
        "review_detailed_main": "There are plenty of really bad low budget movie directors out there. Ed Wood was far from the worst. Now, I'm not one of those people that give this movie a 10/10 because it's funny. That's just another way of saying it's bad, but entertaining.\n\nI've seen plenty of really terrible almost zero budget horror films like the Violent S**t series. And yes, it's called Violent S**t. Granted, I don't think those movies got commercial releases, and if they did it was straight to video. But there do exist movies much worse than this one. Especially other Ed Wood movies that are worse. It has an entertainment value like no other.\n\nThere are movies made today like \"Devil\" and \"2012\" that have a big budget but no heart put into them. It might be just me, but when I watch this I can tell there was heart put into it. Little effort, and a very small budget, but still has heart. Does that alone make it good, not really. But with the aid of other things,it helps.\n\nThe story, though not well done, is creative. And even if you watch the movie with a serious mindset it isn't boring. If you look at the average Arnold Schwarzenegger movie it really isn't that great a film. The acting is mediocre, the story is usually unoriginal, and there are several other things wrong with it. But many people love them because they're still entertaining as all hell. And that's the case with this movie in a way\n\nThere are people that can't even sit through this whole movie because they think it's so bad. And I really think that's sad. If I can sit through a movie shot on Super 8 then you can sit through this. A lot movies that came out at the time of this movie were B movies with a high camp value and no effort that people didn't say two things about. Maybe they were more forgettable. And isn't that what really makes a movie bad; being forgettable? Being so boring that no one ever payed any attention to it. If this were the worst movie of all time people wouldn't still be talking about it. And there are plenty of Ed Wood films that people never talk about that are much worse than this one.\n\nThere really is a thin line between famous and infamous. People just don't realize it.\n\nAll I can say is, it's not really bad. If I were surfing channels and saw it was one I'd watch it. It's entertaining. It's a fun movie. And whether intentional or not it's funny at times. Need I really say more? Just my take on it..."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "AlsExGal",
        "review_rating": "7",
        "review_title": "\"Mr. Wood do you know anything about the art of film making?\"...",
        "review_detailed_main": "... says one of the Baptists financing Ed Wood's Plan Nine. This is from the definitive commentary track on Plan Nine, Tim Burton's masterpiece, \"Ed Wood\". Wood was voted the worst director in motion picture history in 1980, which caused a resurgence in interest in his career, the Burton picture about his life in 1994, and even a DVD box set of his films with commentary.\n\nMy 7/10 score is on a \"so bad it is good\" scale. It doesn't rate higher because there are long sections of the film that are just plain boring. Unlike other great bad films such as \"Night Killer\" or \"The Fanatic\", \"Plan Nine\" does not keep the action going. Plan Nine is about a group of space aliens who decide that the earth must be destroyed because of our dangerous use of technology, a timely topic for the 1950s. Also, it is rather interesting that the aliens decide to use the reanimation of the recently deceased to help in their attack. This could have possibilities that might even have raised eyebrows among those enforcing the production code but, alas, the film in total is just too incoherent when it is not being boring to raise eyelids much less eyebrows.\n\nThe dialogue is stream of consciousness and often throwaway, you apparently have people who are killed just by being slapped by the reanimated dead, and Wood was obviously making a film he did not have the budget for since the props look like something out of a high school play.\n\nIf you are going to try and labor your way through this one, watch Burton's 1994 \"Ed Wood\" before you do, because it explains so much about who is in this film and how it got made. Somewhat recommended for students of film history and those who want to watch the turkeys that were made to appreciate the masterpieces."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "dannyrovira-38154",
        "review_rating": "1",
        "review_title": "THE WORST FILM EVER MADE WHICH IS A LAUGH RIOT",
        "review_detailed_main": "Ed Wood's atrocious, campy, super low-budget sci-fi-horror film is considered by many critics and cinephiles to be the worst film ever made and rightly so, but is also an absolute laugh riot. The stupid incomprehensible storyline is about aliens from outer space that reanimate the dead from Earth in order to save humankind. So awful is this cheesy film that you have to see it to believe it, the film's star the once great horror actor Bela Lugosi who after years of being a heroin addict was now a skinny shell of his former self, is only in the film for several minutes because he died shorty after production begin. Wood used Lugosi's dentist who looks nothing like him and is about a foot taller to replace him, the dentist spent the rest of film walking around with his cape over his face, but two other players are memorable playing ghouls, they are Maila Nurmi as Vampira, and the massive Tor Johnson as the zombie of Inspector Clay. The direction by Wood is non-existing, the film was narrated by the phony mystic Criwell. The shoe-string budget shows throughout the film with the actors routinely bumping into cardboard sets, and the special effects are so cheap that tin saucer spaceships literally are hanging on fish wire which is being pulled around the sets, and the inept dialogue produces countless unintentional laughs. A cinematic mega-bomb that so entertaining because it is so damn bad!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Marcey13",
        "review_rating": "",
        "review_title": "This movie maybe be awful, but it's the best!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Tweetienator",
        "review_rating": "4",
        "review_title": "The Art of Chaos",
        "review_detailed_main": "Plan 9 from Outer Space is for sure not a movie to be taken seriously but the worst movie of all time? Never, too many real bad stuff is produced these last few years, an invention called digi cam is responsible for this. There are movies around that are pure terror for your heart, mind, soul and nerves - they are so bad that you even don't find the tiniest chunk of cheese, even the use of a electron microscope is useless. One of course could argue that those \"movies\" do not fulfill the parameters to be called movies at all. Anyway, Plan 9 from Outer Space is what I call a guilt pleasure - it is entertaining, of course in a very trashy way. Essential study of every aspiring movie maker and script writer."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "squeezebox",
        "review_rating": "5",
        "review_title": "Far from the worst movie ever made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Bernie4444",
        "review_rating": "4",
        "review_title": "Put a little crimson in your soul",
        "review_detailed_main": "There are several packages of Plan 9. I have a few myself including an earlier release containing a 40-minute documentary \"The Ed Wood Story\" featuring interviews with Johnny Depp, Martin Landay, Dolores Fuller, Vampira, Bela Lugosi Jr., and Johnny Legend.\n\nPlan 9 is an operating system that is designed to replace UNIX. Oh yeah, it is also a movie.\n\n\"Future Events Such as These Will Affect You in The Future!\"\n\nDue to their inability to make friendly contact with the earth's government the aliens on the first 8 plans must resort to Plan nine. This consists of reanimating the dead to become their army of conquest. Will the plan work?\n\nDue to the low budget and the unfortunate early demise of Bela, Ed Woods has to resort to Plan 9. You will notice that a lot of the scenes are done with curtains. Does his plan work?\n\nThis would be a one-star movie but because this is a must-see to be culturally literate, I gave it a tad more."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "myavalon",
        "review_rating": "3",
        "review_title": "A labor of love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Coffee_in_the_Clink",
        "review_rating": "5",
        "review_title": "If only everyone in the film industry had the same passion as Ed Wood",
        "review_detailed_main": "No one can deny the passion that Ed Wood displays in his movies. He was shockingly inept at making films, from script-writing to directing. But what I have always admired about the man was his determination and resolve, and the sense of comradery you can feel from his motley crew of actors. He never gave up, and the passion he had for film was something that many in the industry don't have. \"Plan 9 from Outer Space\" is widely considered the worst film ever made. I do not agree with this one bit. People who say this have not seen many films. They definitely have not seen \"The Beast of Yucca Flats\" (Another Tor Johnson film, funny enough. But nothing against the big man!) or the diabolical \"Robot Monster\". Not to mention the likes of \"Fifty Shades of Grey\". I've seen many 'turkeys' and the main factor present in all them cases was sheer dullness. \"Plan 9 from Outer Space\" is anything but dull, and the history around its production is enough to amuse you. It is also the final on-screen appearance of the legendary Bela Lugosi.\n\nThe goofs and quirks are endless. Bela Lugosi died before filming was complete, so Wood got another actor to stand in for him, who looks absolutely nothing like Lugosi. Plastic headstones fall over in the background. The dialogue is absolutely inane but so funny - my favourite: \"Inspector Clay is dead, murdered. And some one is responsible.\" Criswell's dramatic narration is truly something to behold. Every scene warrants study to detect something that's a blatant error or just another idiosyncrasy. Technically, it is a terrible film. But there is something about it, apart from the so-bad-it's-laughable element, that makes it very entertaining and so memorable. Wood managed to pull off a fine shot in one scene where Vampira walks through the cemetery with her arms stretched out. It evokes the finest horror imagery. The cemetery has a certain horror charm about it that makes me think of Halloween. The aliens would have been better had they not been human-looking. Grey alien-masks would have been sweet! I think it is easy to bash this film for its flaws but unlike the average bad movie you can see the effort that was put in here and it has enough charm and wackiness to make it a guilty pleasure."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "neferu",
        "review_rating": "2",
        "review_title": "Once in a millennium there comes a film that you MUST watch!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "xenolambrose@yahoo.com",
        "review_rating": "2",
        "review_title": "So Bad It's Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "tomod34",
        "review_rating": "10",
        "review_title": "Movie is so bad it's good",
        "review_detailed_main": "Hate to say this, one of the best comedy movies I have seen in a long time, horrible acting which made the movie funny to me, very little sci-fi, no horror at all from Criswell and his little curly Q hair, Bela Lugosi walking around like Dracula, Vampira and her skinny humongous finger nails , saw her when her hair was blonde, a really hot woman, Tor Johnson mumbling his lines, hard to understand, on the plane, a shower curtain, split in two, seperating the crew from the passengers. THIS IS MY KIND OF MOVIE"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Munchthesponggobbler",
        "review_rating": "7",
        "review_title": "I don't know if it should get a Razzie for Worst Picture or an Oscar for Best Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "lastliberal",
        "review_rating": "4",
        "review_title": "The all-time worst film",
        "review_detailed_main": "It is amazing what you see when you can't sleep and turn the TV on at 2 am. No. it wasn't Plan 69 From Outer Space, a later Ed Wood movie that feature more than ghouls and vampires, but the original. Using some of thew same actors that he used in earlier films like Tor Johnson, this time a police inspector that made a good zombie, and Bela Lugosi, who was dubbed in and had to be replaced because he died during the filming, and a new addition - Vampira, a late night feature used to promote B films in the fifties.\n\nThis is a camp classic that must be seen to be believed. The usual Ed Wood cheesy effects are present, as well as the worst acting that anyone could imagine - and I have seen some great examples to compare to."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "A true classic, campy movie that has charm beyond its mediocrity.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "StrictlyConfidential",
        "review_rating": "4",
        "review_title": "1950s' SyFy Schlock",
        "review_detailed_main": "Even though \"Plan 9\" (from 1956) is pretty schlocky and totally inept movie-making on all counts (thanks to the certified incompetence of director, Ed Wood) - I still think that it's worth a view just for experiencing all of the unintentional humor that its story contains.\n\nYes. \"Plan 9\" (for all of its bumbling amateurishness) can be quite a trying ordeal to watch during certain points in its \"dumber-than-dumb\" story-line.\n\nBut, if you are really willing to cut it some serious slack, then, you're sure to find yourself much less disappointed by this idiotic SyFy film than you had initially expected to be."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "davidcarniglia",
        "review_rating": "5",
        "review_title": "Plan 10: Ghoul Man's Resurrection?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "richardchatten",
        "review_rating": "4",
        "review_title": "\"Something's happened down the cemetery\"",
        "review_detailed_main": "'Plan 9 from Outer Space' is another of those guilty pleasures that lingers flavoury in the memory and really calls for an exclamation mark rather than a conventional rating.\n\nAlthough the late Bill Warren declared that \"'Plan 9' deserves its fame and should be suffered through at least once by anyone interested in movie history\", and it receives respectful treatment in Tim Burton's 'Ed Wood' - who depicted it receiving a gala premiere - it was hidden in plain sight on late night television for more than twenty years (the earliest entry it received in a reference book probably being Steven H. Scheuer's 'TV Key Movie Reviews & Ratings' in 1961, which gave it one star and sarcastically damned it with faint praise as being \"Important for students of Vampira's mid-50's films\") before its embrace by connoisseurs of the awful; and wasn't even included in 'The Fifty Worst Movies of All Time' (published the year the director died).\n\nSeriously flawed by its almost total lack of humour (although the scene - SPOILER COMING: - where Bela Lugosi gets hit by a car is pretty funny), its very easy to mock a film made on a mere shoestring, but like most truly bad films its certainly not dull, Wood certainly shows a flair for purple prose and many of its technical shortcomings such as continuity mismatches can be found in far more commercial films without looking too hard.\n\nDescribed by Anne Billson as \"a thinking, feeling generous-hearted person with more genuine vision in his little finger than in all of today's working-stiff directors laid end to end\", and a bigger name dead than he ever was alive, Wood would have probably revelled in his posthumous fame."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ChuckStraub",
        "review_rating": "5",
        "review_title": "A right of passage for monster, sci-fi movie fans.",
        "review_detailed_main": "Plan 9 From Outer Space has been called the worst movie ever made. It certainly has its faults but there are far worse movies out there. It is by no means the worst movie ever made. What it has become, is a horror movie with so many faults that it unintentionally has become a sort of comedy. It's often said that this movie is so bad, it's good. This statement has a lot of truth in it. Many people have watched Plan 9 because they wanted to see the faults and wanted to see how badly made this movie really was. This film has become popular because it was poorly made. It's almost become a right of passage for monster, sci-fi movie fans to watch Plan 9 From Outer Space at least once. One good reason to watch this movie is that in many cases it's used as a benchmark to compare other B movies to. One of the problems in rating this movie is that it has become so famous by being bad, it has developed a kind of cult following. It usually demands strong opinions. People usually love it or hate it. I would say that this movie is a must see for sci-fi, horror, movie viewers simply because it is so often referred to and is so well known. You have to watch Plan 9 From Outer Space and see what all the interest is about and view the movie that gave director / writer Ed Wood a place in cinema history."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "d-h-martin",
        "review_rating": "1",
        "review_title": "One star is high praise for this type of movie!",
        "review_detailed_main": "The low score this movie has received should not be a deterrent to a potential viewer. Instead, it should be an indication of what kind of film Plan 9 is. Within its genre, it's the best and most deliciously awful picture ever made, perfect for a boring Friday night at home with a pizza and a few of your stupidest friends. It's a no-holds-barred mixture of science fiction, gothic horror, and unintended camp.\n\nBela Lugosi makes a nonsensical appearance in the picture. (Sadly, he died before the film was completed. Nevertheless, his scenes were included in the final cut.)\n\nDon't worry about the plot. Just enjoy."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "joelgodinho",
        "review_rating": "1",
        "review_title": "The ultimate so-bad-it's-good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "antiwolf",
        "review_rating": "3",
        "review_title": "Worst Film ever made? Hardly!",
        "review_detailed_main": "I've seen hundreds of films that make Ed Wood look like a cinematic genius. Plan 9 is wonderfully bad, but there are so many worse films. It's not even Ed Wood's worst film - that might be \"Glen or Glenda.\"\n\nThe worst thing about this film is the special effects - the spaceships flop about wildly on strings, and the cardboard tombstones wobble and flop over. The film does a poor job of simulating night scenes in daytime.\n\nThe premise is a bit screwy - aliens want out attention, and apparently, Plans 1 through 8 didn't work, so they raise the dead to get our attention. Maybe Plan 42 involves landing in Times Square and actually saying \"hi.\" The film does go off on a long speech near the end when the alien explains what he wants - you get the point LONG before he finishes.\n\nBut it is fun, I can forgive the special effects - how can you not forgive something that gives you such a good laugh? If you want the real worst, check out the bottom 100 films list - it will make you appreciate just how good a director Ed Wood was... scary, isn't it?"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ProfDave",
        "review_rating": "10",
        "review_title": "Watch it with Friends!",
        "review_detailed_main": "I watch about 10 to 30 films a month, from mainstream to independent features, and what qualifies as a great film, to me, is its ability to capture my attention every time I watch it. Granted, this movie wasn't well written, and granted, this film was poorly acted, and granted, if this were any other film with any other cast, it would probably really suck, but remove any element from the film as it stands, and it falls short of perfection. Be it by accident or be it on purpose, this piece of cinematography is pure genius. This is a film worth seeing with friends; trust me, you'll be the life of the party if you dig this film from the vaults."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "TheLittleSongbird",
        "review_rating": "7",
        "review_title": "It may be bad, but somehow I actually consider this a guilty pleasure",
        "review_detailed_main": "I do agree this movie has a lot of problems, but it is somehow entertaining and somewhat of a guilty pleasure. It is often cited as the worst movie ever made, and while it is nothing especially to rave about, I have honestly seen much worse movies and I can also think of worse directors than Ed Wood Jnr(ie. Friedberg and Seltzer), and I actually consider Plan 9 one of my favourite \"bad\" films.\n\nYes, the acting is amateur and full to the brim with overacting. Yes, the sets are wobbly. Yes, the special effects are crude, especially the use of hub-caps for flying saucers. And yes, the stock footage can be messy. However, I do find it entertaining, because the film does have some truly funny dialogue(decide for yourself if and when you see it whether it is intentional or not) and some interesting shots of Bela Lugosi(and the fake body double). Also Ed Wood Jnr does direct with heart, and the film moves briskly and doesn't feel too long or too short.\n\nSo overall, a guilty pleasure and not a bad way to spend 75 or so minutes. 7/10 Bethany Cox"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "emm",
        "review_rating": "4",
        "review_title": "Don't believe in PLAN 9 being the worst movie ever made.",
        "review_detailed_main": "I hate to waste my time commenting on this, but I've seen a couple of other drive-in B-movies that far surpasses PLAN 9's exquisite dreadfulness. Please consider looking up GURU THE MAD MONK. It is absolutely catastrophic in all its disgusting glamour! CARNIVAL OF BLOOD is the runner-up. Before the thousands of all of you cult movie freaks try to wonder where in the hell I got access to them, consider me lucky. The fact is that you don't know what you're running into!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "General_Changs_eyepatch",
        "review_rating": "",
        "review_title": "The best bad movie ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Norm-30",
        "review_rating": "5",
        "review_title": "NOT \"The worst movie ever made\"!",
        "review_detailed_main": "As a Bela Lugosi film collector, I HAD to have this film!\n\nOddly enough, it's quite \"enjoyable\", in an odd sort of way.\n\nVampira makes a creepy-looking corpse, as does Tor Johnson.\n\nThe worst things about this film are the so-called \"double\" for Lugosi and the cardboard tombstones....but, even so, it's an entertaining film.\n\nbtw....If you think that THIS film is the worst film of all time, you haven't seen Ed Wood's \"Glen or Glenda?\"...THAT is the WORST!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "hrkepler",
        "review_rating": "3",
        "review_title": "Anti-Epic Sci-Fi Gem",
        "review_detailed_main": "'Plan 9' is the epitome of 'so bad it is good' movies. Really something that only (anti)genius mind of Edward D. Wood Jr. could conceive. You have to give credit to the film for its creativeness and message. Unfortunately, Ed Wood lacked the skill (talent) and money (for obvious reasons) to fully realize his ambitious ideas as plausible and coherent movies. The story line is messy, Bela Lugosi is briefly in it only because Wood had some unused footage of him, all the other actors are concentrated keeping on straight faces while saying their lines so the acting is wooden. Cheap sets (curtains in spaceship) and awful special effects. Still, the film is too damned entertaining to be considered 'worst film of all times' (Ed Wood's own 'Night of the Ghouls' is much more dreadful). The general plot - aliens are resurrecting the dead from the grave to conquer the World - is outrageously intriguing.\n\n'Plan 9 from Outer Space' cemented Ed Wood into the history of cinema and into people's concusses as the worst director of all times. This is the label his legacy has to wear forever. There are many directors of his level of ineptitude, but few of them are so entertaining and interesting.\n\nNo matter what anyone says, Edward D. Wood Jr. is one of the most creative (using hubcaps as flying saucers over stock footage - that is creativeness) and influential filmmakers of all times. True Z-movie hero, an (anti)auteur, rebel and unconscious avantgardist."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "aerorr",
        "review_rating": "1",
        "review_title": "Awfully good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Bogmeister",
        "review_rating": "1",
        "review_title": "Ahh, yes, Plan 9 - Resurrection of the Dead",
        "review_detailed_main": "Just what is \"Plan 9...\" really about, anyway? If you watch carefully, you may finally figure out, very near the end of the picture, that Wood's plot hinges on this solar bomb threat that the aliens are worried mankind will develop. It's really a mystery up until this late point in the story; flying saucers are sighted all over, the military keeps it hush-hush, no one knows what these aliens want, the saucers fly too low and tend to force people to fall over, and, for some very odd reason, resurrecting three of the characters in the story into walking zombies is a major goal of the aliens. As I watched this all the way through, for perhaps the first time, I wondered how all these plot points would come together - what is the missing piece of the puzzle Ed Wood will put in place by the end? Of course, it didn't all fall into place by the end but I sort of breathed a sigh of relief when the alien (Manlove in a deliriously bad performance) finally revealed his concerns about Solaranite ('What? There's no such thing!'). And it happens during perhaps the most well-known & best scene in the movie: the alien is insulting and excitable in this story, unable to hide his contempt for Earthlings ('Stupid! Stupid!'), receiving a backhand blow from the stalwart hero (Walcott), who is obviously very patriotic about such things.\n\nSo, with all this mystery & tension described above, how can I give this movie just one star? I am sorry, my friend, but this is what it is - a case study of how not to put a film together. I should know - in my twenties, I was in a similar situation to Wood. I had some super-8 footage shot during my late teens which I didn't know what to do with. I finally grouped together some friends and shot some more footage to align, as best I could, with the older stuff. All because I did my best doesn't mean the result was good. No, it was quite bad. As bad as Wood's 'masterpiece' of ineptness? Probably worse, but I had a smaller crew than him. One of the weaknesses of \"Plan 9...\" (and there are too many to mention here) is that it's a patchwork. Most of us know, for example, that Lugosi's footage was shot earlier and had nothing to do with the story of \"Plan 9...\" Was Wood clever in how he, er, spliced it in? We may applaud his resourcefulness, but that does not a good movie make. Wood's use of stock footage - not too shabby. But, stock footage is rarely a criteria for good films, except perhaps for documentaries. Interesting how I'm going on about this movie for such a lengthy comment, isn't it? The spell of Ed Wood is there, no doubt. No doubt.\n\nIt boils down to the fact (yes, these ARE the shocking facts) that every single scene has something wrong with it. I'm not exaggerating - every scene! In fact, in some scenes, every single shot has something wrong with it. If it's not the background, it's something in the senseless dialogue. The most professional scene is probably with Talbot, his one scene as a general, but its very static - a 2-person dialogue-driven scene in a room. Champions of this picture claim that it's rarely boring, perhaps the most important element to judge a film by; my friend, this is not the case - quite a few scenes, like the one just mentioned, drag on and on. So I could not, in good conscience, give this more than a single star. Why has this become so popular - a cult favorite? To some extent, judging films is a subjective process; check out the votes for this on IMDb: the majority gave it one star; but the 2nd highest number of people gave it 10 stars! (Do we detect stuffing a ballot box?). Many viewers, especially aspiring filmmakers and film students, find this movie very instructional. Others find the exercise of finding the aforementioned wrong things in every scene to be quite amusing. I have to admit, I was sick when I watched this last night (or was it some dream?) and it still made me chuckle in a few spots. Best acting: Breckinridge as the effeminate alien leader; worst: the guy who plays Danny the co-pilot. Tor, we hardly knew ye."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "It may not be the worst ever film, but it's certainly one of the most inept",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "clouseau-65125",
        "review_rating": "1",
        "review_title": "Give back my 90 minutes",
        "review_detailed_main": "They should make terrorist watch this movie for torture"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Thermo",
        "review_rating": "1",
        "review_title": "Oh this movie SUCKS!...",
        "review_detailed_main": "but it's so bad it's great entertainment. Try finding all the little inconsistences, like the string holding up the paper plates used as flying saucers, etc. Great to see drunk. But as a movie - BAD!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "theowinthrop",
        "review_rating": "10",
        "review_title": "Imagine What Plans 1 to 8 were like!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "dshannon1042",
        "review_rating": "6",
        "review_title": "Beloved cult classic",
        "review_detailed_main": "\"Plan 9 from Outer Space\" is often celebrated as one of the quintessential cult classics in the world of cinema. Directed by the infamous Ed Wood and released in 1959, this film has earned a special place in the hearts of fans for its undeniable charm and unique blend of science fiction and horror.\n\nOne of the endearing qualities of \"Plan 9 from Outer Space\" is its earnestness. Ed Wood's passion for storytelling shines through, despite the film's famously low budget and technical limitations. The dedication of the cast and crew, who believed in the project, is palpable in every frame, creating a sense of authenticity that's hard to replicate.\n\nThe film's plot, which involves extraterrestrial beings attempting to resurrect the dead on Earth, is delightfully bizarre. It's a premise that's so outlandish that it becomes a source of unintentional humor, and this has endeared the movie to audiences who appreciate its quirky charm. The dialogue and the storytelling are so unique that they have become legendary in their own right.\n\n\"Plan 9 from Outer Space\" is also known for its iconic moments and unforgettable scenes. From flying saucers on visible strings to cardboard tombstones, the film's technical shortcomings have turned into comedic gold. It's a testament to the power of imagination and resourcefulness in the face of budget constraints.\n\nThe performances in the film, while often criticized for their melodramatic style, have a certain charm. Bela Lugosi's appearance, despite his passing during production, adds a layer of nostalgia and reverence to the film. The over-the-top acting and memorable one-liners have become part of the film's enduring legacy.\n\nIn conclusion, \"Plan 9 from Outer Space\" is a cinematic oddity that has transcended its flaws to become a beloved cult classic. It's a movie that's best enjoyed with a sense of humor and an appreciation for its unintentional comedy. If you're looking for a film that celebrates the audacity of independent filmmaking and the joy of embracing the so-bad-it's-good aesthetic, \"Plan 9 from Outer Space\" is a must-see. It's a delightful slice of cinematic history that continues to entertain and inspire audiences with its unique brand of charm."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "colossus-4",
        "review_rating": "",
        "review_title": "Enough already!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "JoshSpurling",
        "review_rating": "1",
        "review_title": "Future events such as these will affect you in the future.",
        "review_detailed_main": "A race of aliens are tired of the \"stupid, stupid\" Earthlings claiming that aliens don't exist, so they concoct a brilliantly evil plan. First, they fly around in their flying saucers that are \"shaped like huge cigars\" (??) and fiendishly shine lights in people's faces. Second, they raise three random people from the dead, taking care not to let anyone know they are responsible for this (It could blow their cover.) The dead people, acting on the orders of the aliens, wander aimlessly around a graveyard. One of them even goes into a nearby house and horrifies a woman by walking slowly and staring at her. Finally, the aliens cleverly reveal their entire plan to a trio of snoopers who manage to find their ship (It was hidden behind a tree.) They explain to the Earthlings that they fear Earth will one day discover how to make a Solaranite bomb that will explode the sun. Then they explain to the Earthlings exactly how the Solaranite bomb works. This is why they have to destroy us before we destroy them which will ultimately prove to us that they exist... or something. But there's one thing that these highly advanced aliens didn't count on: three of the Earthlings might resist somewhat.\n\n\"Plan 9 From Outer Space\" is Ed Wood's masterpiece and is considered by most to be the worst film ever made. Even Criswell couldn't have predicted the cult popularity it has gained. Bela Lugosi died shortly after filming began so the majority of his scenes are played by a look-alike who looks nothing like him. The dialogue is awkward and nonsensical, the set looks like it was borrowed from an elementary school play, and the acting makes Keanu Reeves look like Sir Lawrence Olivier. Listing all the continuity errors would take longer than the film's running time. The only thing that could have made the film worse would have been to include Dolores Fuller.\n\nAll in all, \"Plan 9 From Outer Space\" is one of the most entertaining movies I've ever seen, a triumph of will over talent."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Boba_Fett1138",
        "review_rating": "3",
        "review_title": "Not the worst but still an horrible Z-movie.",
        "review_detailed_main": "Edward D. Wood Jr. or better known as just Ed Wood really was the worst screenwriter of all time. Just like all of his movie, this one doesn't make sense and is filled with plot holes and visual mistakes, which makes this movie a laughable but fun one...\n\nSo Ed Wood was the worst writer and perhaps director of movie history but does that mean that his movie are also the worst of all time? I think not, even though his movies are far from masterpieces he still knows to put some passion and love for cinema into it. Unfortunately it's a kind of strange love and passion that perhaps only Ed Wood himself understood. Looking at his movies you realize that the movies were made by a person who was living in his own world with his own ideals and standards, in his mind he thought what he did was great but the general public did not agree with that and all of his movies became an huge failure. Does that make him a bad filmmaker? More a misunderstood one, misunderstood by the whole world. I think this is also one of the reasons for Wood's cult status which he has gotten after his unfortunate early death, people began to see and understand the passion he made his movies with, when they rediscovered his movies and watched them in a new light. But I shall not try to romanticize it, facts are that Wood's movies are unique but still awful ones and it are these two things combined that makes his movies laughable but yet fun to watch. In a strange way I admire Ed Wood's life and career...\n\n\"Plan 9 From Outer Space\" is no different from Wood's other movies, except for one thing; this one his most known one. But why is it his best known one? Probably because it is his biggest movie and being officially known by the world as worst director of all time, this movie automatically became regarded as the worst of all time. I don't think worst is the best way to describe this movie, strange would be perhaps better.\n\nThe story is weird and doesn't make a lot of sense. It mixes science fiction with strange zombie kind of horror. An horrible combination that simply doesn't work.\n\nMain problem I had with this movie was that I didn't understood who the main character was. The movie follows way too many characters without ever making clear who the 'hero' was. I think that originally Bela Lugosi was set to portray the biggest role in the movie but after his death the story had to be rewritten, with as a result an even bigger mess. Lugosi still is in this movie, Wood uses some self made archive footage of his good friend while he is running around in his Dracula cape. The result is a strange mix of archive Lugosi footage and sequences with a body double that looks nothing like Lugosi at all. The movie also uses other archive footage of the American army firing their cannons, it really doesn't blend in with the movie and looks laughable.\n\nThe acting as always is horrible. I really laughed at Tor Johnson with his horrible accent who had been given way too many lines. Other strange roles are portrayed by Vampira, Criswell, John \"Bunny\" Breckinridge (who couldn't seem to keep his eyes of Dudley Manlove's costume) and other Ed Wood regulars Paul Marco, Duke Moore, Lyle Talbot and Conrad Brooks.\n\nStill I think that the movie has some nice moments. At times it knows to build up some good tension and I think that the underlying message itself also isn't that bad or unimportant. It's just that it's brought in the wrong way just like in Wood's other movie \"Glen or Glenda\" was the case.\n\n3/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "The_Void",
        "review_rating": "2",
        "review_title": "There comes a time in every man's life when he cannot even believe his own eyes...",
        "review_detailed_main": "...and that time for this man came whilst watching Plan 9 From Outer Space. Obviously, I went into this film knowing that I was letting myself in for something truly terrible - but even so, nothing could prepare me for just how BAD this is. To be honest, I'm still in shock - how ever did this film manage to get a release? How did Ed Wood ever dare to make a movie with that script? How the actors dare to even be a part of it? All of these questions and more remain unanswered, and all the foggy elements surrounding the movie are matched by the huge amount of unanswered questions about the movie's plot. One of the many things that Ed Wood doesn't seem to have any grasp of is plot coherency. Some of the plot holes on display are so large that you could shove Tor Johnson into them, and still have room for at least three more terrible actors. The film follows the popular fifties idea of aliens landing on earth. These are actually the most stupid aliens ever to be seen in a motion picture, and the plan that they've cobbled together proves that. They want to destroy Earth, yet they want the 'earthlings' to believe that aliens exist, and the only way that they do that is by resurrecting the dead. Basically, Ed Wood wanted to make a movie about aliens and zombies.\n\nMany people give this train wreck plaudits for being 'fun'; but personally, I've only ever been more bored watching a movie once, and that was while viewing The Blair Witch Project. Some of 'unintentional humour' is actually quite funny, and I couldn't help giggling after the film had ended; but I don't watch films to laugh at how crap the director is, and the fact that there's no characters, plot coherency, decent acting or anything else just renders this film a very torrid time indeed. This film is famous for being the last one that Bela Lugosi ever made; even though he's only in it for a few seconds, while some guy in a cape fills in for him after his death; which is probably the most ridiculous death sequence ever to grace the silver screen. The rest of the cast are equally terrible, with Vampira and Tor Johnson standing out the most, but only because they look so stupid. The film kicks off with a narration sequence, and this really sets the right mood for the rest of the movie. The voice-over is so unbelievably cheesy that it's hard not to cringe every time it features. I realise that this movie isn't meant to be taken seriously, but as far as I'm concerned; Ed Wood has wasted seventy-five minutes of my time with this stupid film, and it really does deserve all the criticism it gets."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "christophermerritt-36367",
        "review_rating": "2",
        "review_title": "Well you know",
        "review_detailed_main": "I've seen worse but still one of the longest hour and fifteen minutes of my life.\n\nThat set design was pretty good though....... And the acting was aight."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "lee_eisenberg",
        "review_rating": "1",
        "review_title": "A moronic masterpiece",
        "review_detailed_main": "In \"Ed Wood\", the title character (Johnny Depp) says of \"Plan 9 from Outer Space\": \"This is the one I'll be remembered for.\" If only he had known! This is his most famous movie all right, but only because it's got everything wrong with it possible, to the extent that it's hilarious. The space ships look strangely like paper plates, the set looks like a set (mainly because the actors often bump into it) and the acting creates a paradigm of non-acting (\"Was it a hot blast of air or a cold blast?\" \"I don't know. It was just a blast of air.\").\n\nBecause of this idiocy, \"Plan 9 from Outer Space\" is a piece of cinematic history that you can't afford to miss. It is quite literally so bad that it's good. It's not even a B-movie, but essentially a C-movie. To be precise, the \"Citizen Kane\" of C-movies.\n\nSo just what were the previous eight plans?"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Bababooe",
        "review_rating": "1",
        "review_title": "Amateur film. Entertaining as unintentional comedy. Not the worst. Check out Star Wars 7, Farce Awakens and Starship Invasions for worst movies of all time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "beejer",
        "review_rating": "2",
        "review_title": "Ed Wood's \"Masterpiece\"",
        "review_detailed_main": "Everything that you have heard about this film is probably true. It is well deserving of it's Golden Turkey Award as one of the worst films of all time. It's awful to be true and yet, there's something about it that makes you want to watch it again and again. (And yes, I am of my right mind).\n\nIt has all the elements well documented elsewhere - the flying hubcaps, cheap special effects, lack of continuity, abysmal acting - the list goes on and on.\n\nIt's a shame to see old time favorites like Bela Lugosi, Tom Keene and Lyle Talbot reduced to this level. And Tor Johnson? As a zombie, he makes a great actor. Witness his scenes at the beginning before he is zombie-ized. And what can you say about Vampira that hasn't been said already. And yes, the rest of Wood's stock company (Dudley Manlove et al) perform \"admirably\" as well.\n\nHowever as bad as it is, I still enjoy watching it to try and spot new guffaws each time. It remains, in my humble estimation, Ed Wood's \"masterpiece\"."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "chris_gaskin123",
        "review_rating": "9",
        "review_title": "Ed Wood at his very \"best\"",
        "review_detailed_main": "Though Plan 9 From Outer Space is said to be the worse movie ever, its very enjoyable and fun to watch.\n\nAliens invade the Earth and bring the dead back to life as zombies so they can rule the World. Zombies include an old man and his wife along with a copper. They call this operation \"Plan 9\".\n\nThis movie is noted for its ultra cheap props which include cardboard headstones and what look like paper plates for the flying saucers.\n\nThe cast includes Bela Lugosi in his final movie and he died before filing was complete and a double replaced him. Also starring Tor Johnson (The Beast of Yucca Flats, The Black Sleep, Bride of the Monster), Lyle Talbot (Jail Bait) and Vampira (real name Maila Syrjäniemi). Directed of course by Ed Wood.\n\nPlan 9 From Outer Space is compulsory viewing for all movie fans. Freat fun.\n\nRating: 4 stars out of 5."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "BandSAboutMovies",
        "review_rating": "7",
        "review_title": "Not the worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Polaris_DiB",
        "review_rating": "3",
        "review_title": "Charming camp fully deserving its fame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "uds3",
        "review_rating": "",
        "review_title": "The Gospel according to Ed Wood!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "pmtelefon",
        "review_rating": "2",
        "review_title": "It's a long 79 minutes",
        "review_detailed_main": "I've watched the first twenty minutes of \"Plan 9 from Outer Space\" many times. I've made it through to the end only a couple of times. It's a brutal watch. I know people enjoy it as camp. Good for them. For me, it's a very low budget, often inept, movie. It has too many things going against it. It never had a chance. I do get a kick of of Maila Nurmi's cleavage and her ridiculously tiny waist. But otherwise, \"Plan 9 from Outer Space\" has nothing going for it. I'd rather watch a movie that's actually trying to be funny."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "YLee",
        "review_rating": "2",
        "review_title": "Breathtakingly inept - SEE IT!",
        "review_detailed_main": "A masterpiece of cinematic awfulness. A must for all fans of the genre. Don't miss the swift change from day to night in the churchyard! Wonder over the late-dead Bela Lugosi stand-in. See it and weep! A wow of ineptitude!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "cosmogirl_185",
        "review_rating": "3",
        "review_title": "awful, but entertaining",
        "review_detailed_main": "There is no question this movie may be one of the \"worst movies ever made\" but its not terrible. a majority of the directing, special effects and the the script is, yes, very weak, but entertaining none of the less. i believe that the director also got the golden turkey award for worst directing, although i know if they had a decent budget this movie might have been a decent one. i particularly found the strings on the UFO'S very interesting, as well as that chasing part at the grave yard with the old mans corpse funny. LMAO. Instead of going out to the movies one day, invite some friends over, make some popcorn, this is a great movie to have a laugh over, even if its not considered a comedy...much funnier than some of our modern comedies anyway."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "jluis1984",
        "review_rating": "5",
        "review_title": "An Incredible Paradox: It is Good and Bad at the same time",
        "review_detailed_main": "If there is a movie that clearly proves the \"So bad it's good\" philosophy is this one. \"Plan 9 from Outer Space\" quickly gained a huge cult-following after being named \"the worst movie ever made\" and gave its failed director, Edward Wood Jr., the fame and recognition he never could achieve while alive. However, and despite its enormous amount of mistakes, \"Plan 9\" has a bizarre charm that makes it different than other movies: it has heart. It is the legacy of a man whose love for films was bigger than his artistic skills, and that could do anything to complete a movie.\n\n\"Plan 9 from Outer Space\" is, according to its narrator, the Amazing Criswell, the retelling of the fateful day when a group of aliens tried to destroy the planet Earth, by re-animating the dead to destroy the living. An old man (Bela Lugosi) and his wife (Vampira) are the first ghouls re-animated by the aliens in their ninth attempt to destroy the earth.\n\nThe plot, as weird as it sounds nowadays, was really a variation on the usual sci-fi plot of the days of McCarthyism and the fear of invaders. However, Wood's script is filled with weird dialogs that one can only take as the unedited script. It is obvious that Wood was desperate to make the movie so he shot everything not caring if what he had written sounded good on screen. Despite the poor writing of his films, Wood always tried to put a social commentary on his films, and \"Plan 9\" shows his lack of confidence in the Government and maybe in humanity in general.\n\nAbout the obvious \"mistakes\", some say it was due to low-budget, others state that it was due to his overconfidence; the fact remains that Wood almost never shot a scene twice no matter the results. This terrible mistake become one of Wood's main characteristics through his career, and in Plan 9 is painfully notorious. Every shot seems to be in the movie no matter if the cardboard tombs fell or if an actor makes a mistake; the show must go on and the picture must be finished.\n\nThe bizarre edition (going from day to night and vice-versa) and the use & abuse of stock footage is another of Wood's characteristics that make this film so special. The performances of Tor Johnson and Vampira, Pual Marco and Dudley Manlove, and the unforgettable Bela Lugosi truly complete the show.\n\nProbably Ed Wood's life and the story about the creation of \"Plan 9\" are a better tale than \"Plan 9\" itself; Tim Burton's fictionalized biopic \"Ed Wood\" is a good proof of that. However, \"Plan 9\" is a must-see for every fan of cinema, and specially for everyone interested in film-making, as it is the job of a man who had his soul definitely in cinema, but his talent definitely in other place.\n\nOne could say after reading this huge amount of flaws that \"Plan 9\" is an unwatchable piece of trash, and while maybe they are right; Wood's masterpiece has an enormous charm that makes everything look good. It is a weird feeling the one that \"Plan 9\" conveys, a feeling of tenderness and naiveté that infects the viewer with Wood's spirit and makes the unwatchable being enjoyable, and turns the trash into a classic. That is \"Plan 9\"'s incredible paradox: it is probably the only movie where one can proudly say \"It is so bad that is good\". It is a 5/10 that tastes like a 10/10."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "tugboat2030",
        "review_rating": "2",
        "review_title": "Yes, it is the Worst Movie Ever Made (Spoiler, but who cares?)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "dweilermg-1",
        "review_rating": "3",
        "review_title": "Great Plan 9 Line",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "damjen666",
        "review_rating": "3",
        "review_title": "Nowadays they don't make movies like they used to...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "PendragonX",
        "review_rating": "10",
        "review_title": "Edward D. Wood, Jr. was a genius.",
        "review_detailed_main": "IMHO, Plan 9 is a fantastic film. Sure, it's completely ridiculous, and everything is cheap and nasty with no thought for quality of set design, special effects or really anything that happens in front of the camera- but that's what makes it so special. It's the ultimate corny, silly 50's sci-fi/laughable horror movie.\n\nI watched this film after seeing Tim Burton's biographical film Ed Wood, who wrote, directed and produced Plan 9 from Outer Space. Having \"seen\" the hilarious making of Plan 9 while watching Ed Wood meant watching the real Plan 9 was immensely enjoyable, as you could pick up on all the arcane humour from Tim Burton's great film.\n\nBe sure to watch the documentary \"Flying Saucers over Hollywood: The Plan 9 Companion\" which is on the Plan 9 DVD. While it probably rates as the worst documentary of all time (bad sound, bad lighting, bad jokes, and more...) it has interviews with the real Vampira and other cast and crew from Plan 9. A must for Plan 9/Ed Wood fans."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "RufusT",
        "review_rating": "7",
        "review_title": "Every \"bad\" movie should be this entertaining!",
        "review_detailed_main": "Forget all that \"The Worst Movie of All Time\" and \"Golden Turkey Award\" nonsense, PLAN 9 is far from being that! Most of Wood's other output would qualify for those titles more than this little gem does.\n\nOne of the most berserk, weirdest, funniest and gosh-darned entertaining movies you could find, this little beauty holds up to countless viewings with new treasures to be unearthed each time. Whether it's new heights of ineptitude on Wood's part to new lows of inadequacy from much of the cast, this movie just gets better and better. Listen to the soundtrack without the visuals, and it's downright psychedelic.\n\nApparently, whoever wrote those awful \"50 Worst Films\" pieces of garbage never saw the likes of MANOS THE HANDS OF FATE, MONSTER A-GO-GO, or THE BEAST OF YUCCA FLATS, films so bad, even the likes of MST3K couldn't make them tolerable to sit through.\n\nNot the Worst Movie of All Time, but one of the best times you'll ever have watching bad filmmaking. A delight!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ericolsen1953",
        "review_rating": "2",
        "review_title": "Sorry, but McCathy had nothing ta do with it",
        "review_detailed_main": "So awful it was a real pleasure watching parts of this flick. Other parts are just too draggy, such as Bela and his Vampire-ess awakening in the cemetery. Regardless of what some politically-correct reviews report, this movie was not made \"during the hysteria of McCarthyism\" largely because Senator McCarthy had been dead for a good seven years. However, some of the \"invasion\" themes were probably well- founded during the popularity of outer-space genre flicks in the late 1950's, since the humorless and closed society of the Soviet Union had launched the first artificial satellite, just one year after invading Hungary to crush the liberal regime elected there in 1956."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Baroque",
        "review_rating": "",
        "review_title": "Genius without talent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Hey_Sweden",
        "review_rating": "5",
        "review_title": "Future events such as this will affect you in the future.",
        "review_detailed_main": "Aliens come to Earth, supposedly with good intentions at first. But, incensed at humanity's inclination towards violence and hostility, come up with methods to conquer them. They think that they've hit gold with their ninth plan: resurrection of the dead. Among the recently dead who become their puppets are an old man (Bela Lugosi, in his final film appearance), his wife (Maila \"Vampira\" Nurmi), and a police inspector (Tor Johnson). And among the intrepid humans who intend to foil them are airline pilot Jeff Trent (Gregory Walcott), police lieutenant Harper (Duke Moore), and military colonel Edwards (Tom Keene).\n\nEdward D. Wood Jr.'s infamous schlock picture has the distinction of often being voted \"worst movie of all time\". While it's far from being a \"good\" movie or a particularly slick one, this is a little unfair. There are lots of crummy pictures out there that could also easily vie for that title. At least \"Plan 9 from Outer Space\" is not boring. Viewers do readily admit that it's endlessly amusing, especially when one considers its priceless dialogue, dopey performances, and ultra cheap sets. (One's gotta love those wobbling crosses and tombstones.) Use of stock footage mingles with writer / editor / producer / director Woods' own footage to fill an agreeable 79 minute run time. For this viewer, some of the biggest laughs arise from the use of a replacement for Lugosi (the veteran actor had sadly passed on after only about two days worth of shooting). The role was recast with Woods' wifes' chiropractor, an obviously taller and younger man who is obliged to hold a cape over his lower face.\n\nIn a cast also including Mona McKinnon, Paul Marco, Conrad Brooks, Joanna Lee, and Lyle Talbot, a special shout out has to go to the hilarious \"Dudley Manlove\", who's actually quite the scene stealer as pompous alien bad guy Eros. He looks like he's enjoying himself reeling off Woods' lines. Ridiculous \"psychic\" Criswell opens and closes the picture with his proclamations.\n\nThis may not be \"high art\", but it does have a definite charm going for it.\n\nFive out of 10."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "turtletortise",
        "review_rating": "1",
        "review_title": "Worst bore ever!",
        "review_detailed_main": "There are no words to describe how stupid and boring this is. I can't believe anyone has ever finished watching this film. You can't stay awake through this! Would be good if you are just turning on something to put you to sleep. It's not in the \"so bad it's funny\" category, it's just BAD."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "pk_pulak_kmr",
        "review_rating": "2",
        "review_title": "Shoddiest film ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "KnightsofNi11",
        "review_rating": "3",
        "review_title": "Oh boy...",
        "review_detailed_main": "Plan 9 From Outer Space is universally claimed to be the worst film ever made. It is made by the infamous Ed Wood who is claimed to be the worst director ever. It's tough to know where to begin with this film. I guess I should start off by saying there is nothing INTENTIONALLY good about this film. It is awful. It is horrible in every sense of the word. But is just how terrible it is that makes it watchable. It is hysterical just how ridiculously bad this film is. Mr. Wood thought he was a filmmaker and never gave up, and for that you have to give him a lot of credit. Especially when he can make a film as absurdly bad as this and get away with it.\n\nPlan 9 From Outer Space is about an alien race that, after eight failures to stop the human race from making (stick with me here) something called a Solarite which is a sort of sun-driven bomb (just stay with me). Their plan... to resurrect the dead (did I lose you? Yeah. Figures.) The humans try what they can to destroy the strange alien spacecraft (which are small plastic models hanging from strings) but they are unsuccessful. What the aliens intentions are with these zombies isn't exactly explained, but does it really matter at this point? We do know that they are controlled with the alien's plastic electrode guns which sometimes don't work as well as they should (it's a 50-50 shot). Are you confused yet? Well trust me, watching the film will probably make it worse.\n\nThe most fun thing about Plan 9 is just being able to see what happens when you put the power of cinema in the hands of the most incompetent such as Ed Wood. You won't believe your eyes while watching this hilariously atrocious excuse for a movie. It is truly amazing to see what happens when a man like Ed Wood makes a movie whilst having absolutely no idea what he is doing. The saddest thing about the film is that while watching it you can clearly see the Ed Wood's intentions of what he wanted Plan 9 From Outer Space to be like. And that is an epic sci-fi horror masterpiece, complete with mind bending special effects, a gripping and terrifying plot, and even a glaring political statement on the state of the world. Unfortunately, he went about every aspect of the movie 100% wrong. The result was indeed the worst movie ever made."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "paulo20",
        "review_rating": "5",
        "review_title": "The movie that makes fun of itself (slight spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "TheHande",
        "review_rating": "4",
        "review_title": "A little campy but boring",
        "review_detailed_main": "I don't think I need to tell people why 'Plan 9 From Outer Space' is considered one of the worst movies of all time. The movie is definitely so bad that it'll make your eyes roll but the half-baked editing of Bela Lugosi's pre-mortem performance should at least bust a few giggles out of the viewer.\n\nWhat the movie lacks the most is credibility and that simultaneously is the reason why the film doesn't work as a science fiction film nor does it really work as an unintentional comedy. Though there are some things about this movie that make you laugh, the final half is utterly dull with a story-line that could have had potential being wasted with low-grade special effects and hammy acting. From this point the film sort of resembles Uwe Boll's infamous 'Alone in the Dark'.\n\nThe rushed production shows in every singles scene. Actors struggle to remember their lines and to deliver them, especially Tor Johnson, but the continuity errors and cheap sets only work to enhance the experience. The film is actually rather hilarious to watch for the first 30 minutes or so, but after that the joke becomes old and we're left with a movie that just isn't competent on any level.\n\nAn E for Effort and for comedy value but generally speaking Plan 9 has very few redeeming values."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Nyx_Selene",
        "review_rating": "5",
        "review_title": "One of the funniest comedies I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "refrankfurt",
        "review_rating": "10",
        "review_title": "Misunderstood masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "eronavbj",
        "review_rating": "7",
        "review_title": "Just try not to watch",
        "review_detailed_main": "It's difficult to grade this picture. If you grade by quality, it's a one. If you're grading by entertainment value, it's a 10! It's certainly less\n\npainful to watch than some movies that masquerade as art, such\n\nas The Swimmer. Or those that masquerade as action, such as\n\nPulp Fiction. This is entertaining as a production, not as a plot. If\n\nyou can watch an \"artsy\" picture more than once to see what you\n\nmissed the previous time(s), why not watch Plan 9 over and over\n\nagain to see what mistakes you missed the first time around? It's\n\nmore fun."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "ajbillster",
        "review_rating": "2",
        "review_title": "Pathetic film but I would still recommend it",
        "review_detailed_main": "You've got to watch it to know what I mean. No attempt has been make the film intentionally funny. But the overall effect is just that - you simply can't help laughing at the scenes and characters in the movie. Like at the \"ghost\" that's forever hiding part of his face with a black cloak because he's a ghost and ought to look scary. Well, he looks as scary as Charlie Chaplin at Times Square on a hot, sunny afternoon. They got just about everything wrong starting from make-up to music to dialogs. There's continuity gaps. The one thing they did do right was in picking the fat policeman that dies and eventually becomes a ghost. He was so ugly that he looked convincing as a ghost in spite of a horrible make-up job. feel welcome to watch it. It's a study in bad cinema"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "julianbristow111",
        "review_rating": "",
        "review_title": "absolutely horrible but so funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "malahowski",
        "review_rating": "1",
        "review_title": "So bad it's just bad",
        "review_detailed_main": "Where to begin? This \"movie\" has supplanted, in my humble opinion, \"Reefer Madness\" as the worst movie of all time. Acting score - zero. The \"actors\" are as stiff as the cardboard the gravestones are made of on the \"set\". In any of a number of scenes they are clearly reading their scripts. Directing score - zero. If I could give a negative score I would. Cinematography score - zero. I have taken home movies on 8 mm film that were of better quality than this. Special effects score - zero. You can see the strings holding up the \"flying saucers\" (clearly automobile hubcaps). Overall score - one I gave it one star because as a movie it is so ludicrous that I actually chuckled a couple of times. My overall impression is that this movie is the first I have ever seen that urged me to look at my wristwatch less than five minutes into the movie. As in \"when the hell is this bomb over?"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "mikerose-1",
        "review_rating": "1",
        "review_title": "It's only saving grace is how bad it is",
        "review_detailed_main": "Folks,\n\nWhen a space ship interior is represented by an army surplus radio on an old wooden table in front of a black curtain (doubtless the same curtain that, with a wooden barstool, represents the interior of an airplane cockpit), it doesn't get any worse (if it's intended for a paying audience, anyway)."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Bunuel1976",
        "review_rating": "1",
        "review_title": "PLAN 9 FROM OUTER SPACE (Edward D. Wood Jr., 1959) BOMB",
        "review_detailed_main": "There's little I could say about this legendary film that hasn't been said before. Still, while it's undeniably a hoot (particularly the script, composed of equal parts deadpan narration and jaw-dropping non-sequiturs), I don't find it all that enjoyable really; it's simply too bad for its own sake!\n\nCertainly the most regrettable - and saddest - aspect of the film is that it turned out to be Bela Lugosi's swan song (though his brief scenes, re-used many times throughout, were actually shot for another production and incorporated into the narrative here when that project folded!). Still, the decision to cast Tor Johnson (whose awkward delivery of Wood's dialogue in itself is good for some chuckles!) as a Police Inspector was an inspired one, for all the wrong reasons! There's also the camp solemnity of Criswell and the ghoulish appearance of Vampira (more or less as themselves)...and don't get me started on the other members of the cast, the non-existent special effects or the film's use of stock footage for its would-be action sequences!!\n\nTruth be told, I do want to watch Wood's remaining films - GLEN OR GLENDA? (1953), THE SINISTER URGE (1961), NECROMANIA (1971) and even a few of the ones he wrote - but, like I said, their reputation as bad cinema doesn't readily translate into entertainment...and I'm not sure I want to part with my hard-earned cash merely for the pleasure of laughing at Wood's ineptitude! Maybe, having recently been on a two-month film-making course in Hollywood - where, due to circumstances beyond my control, my personal showreel didn't prove exactly stellar! - I tend now to find such 'trash' somewhat uncomfortable to sit through..."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "gridoon",
        "review_rating": "3",
        "review_title": "Corny, yes. Awful, no.",
        "review_detailed_main": "This is a bad movie, no doubt about that. What really sinks it is the extremely corny dialogue - I could have swallowed the cheap effects, the director's mistakes, even the \"aliens\" that look, talk and behave EXACTLY like humans, if the dialogue didn't try - and fail - so much for \"self-importance\". But is it the worst movie ever made? Hardly. There is an excellent comment somewhere in this page, which suggests that saying bad things about this movie is like \"kicking a helpless puppy\". That's how I feel: it may be corny and inept, but it's also harmless. It doesn't leave you feeling offended (like, for example, \"Sudden Impact\", the fourth Dirty Harry film), it isn't vile (like \"Scream 2\"), and the short running time makes it a lot less boring that it could have been. As for the unintentional laughs this movie is supposed to provide: well, there are a few (\"future events like these will affect you in the future\"), but if you're looking for a GENUINE camp-fest, this isn't quite the right movie - go watch \"The Exorcist\"."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "domino1003",
        "review_rating": "1",
        "review_title": "Dead...And Somebody's Responsible!!!!",
        "review_detailed_main": "Somewhere, Ed Wood, wearing an Angora Robe, is smiling. \"Plan 9 From Outer Space,\" for bad or good, got the recognition that he always wanted. Sure there are enough plot holes to resemble swiss cheese (What were the other 8 plans and why didn't THEY work?),the acting (if you could REALLY call it acting)is just SOOOOOOOOO BAAAAAAAAADDDDDDDDDD!!!! Also, the script's (WHAT SCRIPT?!?)classic lines (You see? You see? You're stupid minds! Stupid! Stupid!!!)are enough to make you fall on the floor and have serious laugh attacks. Plus, a lot of the behind the scene decisions really made no sense (Bela Lugosi's double was a lot taller and had darker hair than the late actor, and the Lugosi clips were just played over and over again! Plus, what was up with the light? It's supposed to be daylight, but it turns out to be night time!). But, it still is a wonderful film to watch on a Saturday night with your best buds."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Atavisten",
        "review_rating": "5",
        "review_title": "Vampira, Tor and Bela",
        "review_detailed_main": "How can you go wrong with the awesome threesome of Vampira, Tor Johnson and Bela Lugosi? We never actually see Bela without his cape covering his mouth. A friend told me this was because Bela canceled so they had someone else play Bela, but stuck with the credit to promote the movie I guess.\n\nAnyhow this is a slow moving film with improvised plot, very camp mono/dialog and stiff acting. The special effects are at least as charming as the alien wearing a halberd as a logo on his spacesuit. Its definitely so bad that you have a good time watching it, but the legend of Ed Wood Jnr is bigger than this movie, its not that bad."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "The_nibs",
        "review_rating": "1",
        "review_title": "Not as funny or interesting as film buffs want you to think",
        "review_detailed_main": "This movie gets tossed around a lot in conversations amongst horror/sci fi film geeks. I've been told for years that it's a must see, but it really isn't. Maybe this was super kitsch and funny back when it was made, maybe even a few decades afterwards, but by today's standards it's just hopelessly boring. I didn't even chuckle once, it just drones on. Yes the effects look like crap, so do a lot of films, yes the script is terrible but not in an entertaining way like in The Room or Miami Connection. It just plain sucks. Especially to see Bela Lugosi degraded in such a way before he dies. It's sad. Vampira looked hot at least."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "y-dorben",
        "review_rating": "10",
        "review_title": "Genius! Well... Unintentional...",
        "review_detailed_main": "I gave this film ten out of ten. I know some people will call me foolish for it, but this is a comic masterpiece! As a serious film this gets zero, but this is a so bad its f*****g AMAZING picture! So many goofs, so much to laugh at! The determination Ed Wood has was remarkable! This film deserves to be treasured forever in the national archives, as it is an incredible piece of cinema. Everything about it is stock b-movie material, but the fact that Ed Wood was SUCH a bad filmmaker means he let so much slip in to the film that shouldn't have happened. Without the hundreds of hilarious goofs, i think this film would just be seen as a rubbish sci-fi flick from a gone era, but due to the hilarity of some parts, such as the cop scratching his head with a \"loaded\" pistol, the \"stupid, STUPID!\" piece of dialogue, and the completely unintelligible speech of the police chief, this film is incredibly funny. Anyone who gave this film a poor rating should see that it's more than a crap film. It's comedy gold."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "zetes",
        "review_rating": "6",
        "review_title": "Too amusing to hate",
        "review_detailed_main": "Infamously bad, but often hilariously so. A bunch of half-witted aliens want Earthlings to recognize their existence, but the governments of the planet keep repelling them. Their latest, and ninth plan, for creating extra-terrestrial awareness among humans is to raise their dead, 'cause nothing says \"ALIENS!\" like the re-animated corpses of Swedish wrestlers, vampiric television hosts and Hungarian horror stars (of course Lugosi was almost literally brought back from the dead to be in this movie). The first time around, I only found the film sporadically funny. Mostly it was boring. Can't say my opinion of it raised too much, though I think I did laugh more this time around. I especially giggled at the whole concept of the Solaranite bomb, which would somehow cause the Earth's sun to explode, along with every single celestial body that sunlight touches. It's especially funny to me because they talk about the sun's light as having matter, and there used to be this really dull kid in my dorm in college who would argue that light had mass. He would literally argue with genius physics majors about this when he would get drunk on Saturday nights."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Crap_Connoisseur",
        "review_rating": "",
        "review_title": "Pure Bliss",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "bensonmum2",
        "review_rating": "5",
        "review_title": "\"I'm muzzled by army brass!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "SmileysWorld",
        "review_rating": "1",
        "review_title": "Laughably bad,but......",
        "review_detailed_main": "I have always admired people with a passion for something.Ed Wood certainly had a passion for directing movies,bad as he might have been at it.I have heard some say that Ed Wood's movies were only bad because of low budgeting.I disagree.Ed Wood,with no disrespect intended,was just a bad director,with or without a low budget.This particular film,however,best displays Wood's passion.Bela Lugosi, having passed away before production was completed,was replaced by a stand in.Most directors would have had no choice but to call it quits with the whole production,but Wood pressed on,wanting to finish his film.Every way you look at it,Plan 9 From Outer Space is a terrible movie,but the way I look at it,even the best of movie directors only have half or three quarters the passion for movie making that Ed Wood had."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "nuhc",
        "review_rating": "1",
        "review_title": "As bad as they say",
        "review_detailed_main": "I watched this movie as part of a \"bad movie night\" expecting the worst, and I pretty much got it. Now I wasn't expecting much since I'd heard that this was one of the worst movies ever made, and secondly, it was a cheesy sci-fi flick from the 1950's.\n\nThe best thing I can say about this movie is \"amateurish.\" The acting is pretty stiff and the sets are laughable. For instance, some of the grave stones & crosses in the cemetery are apparently very fake since some of the actors almost knock them over in some scenes, the high-tech equipment of the spaceship consists of some old electronic equipment sitting on a wooden table along with a Jacob's ladder (the two wires sticking up with sparks rising upwards between them), and one of the props is actually a blinking warning light from a traffic barricade. Then there's the constant switching between day & night in the same scenes.\n\nThen there's the plot. The aliens have apparently tried to contact government officials to tell them to not develop a new bomb which would set sunlight on fire and destroy the galaxy. But the government ignored the aliens, so the best plan (Plan 9) they can come up with is to raise a few recently deceased earthlings from the dead to show their power. But in reality all it seems to do is spread confusion.\n\nOverall, if you're a big fan of cheesy 50's sci-fi flicks or you like to make fun of bad movies, you might enjoy this film. That's the only way anyone could really watch this the whole way through."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "SerpicoJones",
        "review_rating": "1",
        "review_title": "This movie is made because of you stupid minds. Stupid! Stupid!",
        "review_detailed_main": "I finally had a chance to see Ed Wood's classic masterpiece Plan 9 and what a movie it was. This film is textbook example how to not write a script and execute movie. This film is so so so so bad that it even can't be good. Many critics have been noting Plan 9 as the worst movie ever made and they even might be right. But I loved every bit of this piece.\n\nActing was as horrible as you can expect. Maybe only Gregory Walcott tried to do something similar with acting. And Bela Lugosi... All scenes with him seemed so random and accidental like he was lost on the set and was looking his way out but Wood used the chance and captured him on the film. Unintentional comedy that was.\n\nAlso this film features the greatest worst dialog ever. - Inspector Clay is dead, murdered, and somebody is responsible. - The saucers are up there. The graveyard is out there. But I'll be locked safely in there. - Visits? That would indicate visitors. - A flying saucer? You mean the kind from up there? / Yeah, either that or it's counterpart. Movie filled quotable lines. And the funniest part of the dialog was that it didn't make any sense whatsoever.\n\nOverall I got more laughs from Plan 9 than from one of the greatest comedy classics \"Some Like It Hot\" (that was exaggeration). Anyway this Ed Wood's magnum opus is must see for every film fan."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "LeRoyMarko",
        "review_rating": "1",
        "review_title": "There you have it, the worst of the worst. See it!",
        "review_detailed_main": "Bad acting. Bad script. Bad music. Bad editing. Bad movie. But oh so funny! You've got to see this one for yourself. A trio of hubcaps flying over Hollywood. \"A woman telephones the police\", says the narrator with his corny voice. The army is dispatched, in vain, to saucer field activity. Someone dies, no better time than in the middle of the night to do the ceremony in the cemetery, where the tombstones are clearly made of cardboard. It's supposed to be scary as hell but the actors show almost no expression. And what about the plane's cockpit! Hilarious! The woman is told by her husband five or six times to lock the door, but of course she doesn't. A zombie walks in. What does she do? Escape via the graveyard! Feminists beware: this movie clearly doesn't put the woman on the same step as man. Even the aliens may be \"eons\" years more advanced than Earth people, but the girl is still the pretty face doing what the boss says. Funny also how we go from night to day to night in a matter of seconds. Or the burning flying saucer! Funny also how the aliens look exactly like humans. So much fun! Don't miss this one!\n\nSeen at home, in Toronto, on February 19th, 2006.\n\n43/100 (BOMB)"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "mikprosser",
        "review_rating": "1",
        "review_title": "World's funniest movie",
        "review_detailed_main": "This movie is hilarious, I couldn't stop laughing. Ed Wood has made a truly campy sci-fi movie regarded as one of the worst films ever made. There's actors knocking over cardboard sets, lines that don't make any sense, and ufo's held up by clearly visible strings.\n\nWatch if you want a good laugh. 1/10 as a sci-fi, 10/10 as a comedy."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "missingno86",
        "review_rating": "1",
        "review_title": "The Best Worst Movie Ever.",
        "review_detailed_main": "When I voted, I came close to giving it a 10. Not because the film is great or anything, in fact it is so poorly done it does require to be called the \"Worst Movie Ever Made.\"\n\nBut the overall tackyness, pardon me for inventing my own word (pulling a 'George Dubya' as we call it), is what makes you want to watch it. Weather it be the papermache back ground. The army stock footage used in what seems like half the film. The cheezy/morbid plot. Or just the fact it is a 'B-Movie,' you just have to watch it.\n\nSo, in conclusion, on the IMDb, i rated it as a '1' but for being the \"The Best Worst Movie Ever Made,\" it gets a 10!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "jacobtgill",
        "review_rating": "9",
        "review_title": "Undeniably One of the Best Movies Ever",
        "review_detailed_main": "We're not talking about the first plan. We're not even talking about plans 2-8. No sir, I am referring to Plan 9 from Outer Space. This gem is written, produced, and directed by Ed Wood, Jr. There's numerous stories of actors doing stupid things-- for example, an actor playing a cop would repeatedly point his gun at himself-- just to see if Mr. Wood would notice (Spoiler, he didn't).\n\n\n\nNow, there are really only 2 types of moments in this film: moments that are so bad it's funny, and moments that are just plain bad. I'm talking about an awful narrator who, whenever he mentions a character or setting, there must an awkward edit to show what he's talking about-- in case the audience was confused. The writing is so choppy, for better and definitely for worse, the directing is just... just bad. I don't think there's any other way to say it. And the actors would just get their lines over with because they had better things to do with their lives.\n\n\n\nSo what is this ninth plan? Well, aliens with much laughably better technology come to Earth in their flying saucers on strings. And in order to make sure Earth creatures don't destroy the shared universe, they must be destroyed. Thus, the best way for the aliens to accomplish this goal is to obviously raise the dead using their electron guns. This diabolical plan ends up raising a total of 3 creatures throughout the movie: a big detective, Dracula, and Vampira. Trust me when I tell you how haunting and scary and gory and... Oh I can't do it. The biggest laughs are watching the 3 walk over to the main characters as the characters just stare and watch in \"horror\".\n\n\n\nThis movie isn't always good, but it certainly is always bad. Look it up. There's horror and drama and sci-fi babble with quick edits. Not sure how much more you can ask for. There's even a Johnny Depp film called Ed Wood based on this guy (haven't watched it though). Okay, that's all from me. And remember my friend, future events such as these will affect you in the future.\n\nYou can find this review and dozens of others at gillipediamoviereviews.blogspot.com"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "TopperHarley29",
        "review_rating": "6",
        "review_title": "Nowhere near the worst movie of all time",
        "review_detailed_main": "I think this is unfairly considered the worst movie of all time. It's not even close to being the worst movie. I've seen much worse movies than this like Semi-Pro, Bio-Dome, The Last Airbender, Bride Wars, Underdog, Ricky 1, Yu-Gi-Oh: The Movie, Son of the Mask, Dude, Where's my Car, Stuart Little 3, Yours, Mine and Ours, The Sisterhood of the Traveling Pants and much more. I'll admit it's poorly made, but it's too entertaining to be the worst film of all time. The UFO scene was so hilariously bad. So was the acting and the fact that the real Bela Lugosi isn't in much of the movie. If you like unintentionally funny movies then you will love this."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "mark.waltz",
        "review_rating": "2",
        "review_title": "Planet of the Drapes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "shepardjessica",
        "review_rating": "",
        "review_title": "Classic Ed Wood heart-felt dementia!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "JasonLeeSmith",
        "review_rating": "1",
        "review_title": "Not So Bad Its Good",
        "review_detailed_main": "\"Plan 9 From Outer Space\" has been subjected to a good of reverse criticism, that is to say, people who say that its so incredibly lousy, that its actually fun to watch.\n\nThis is just not true. Granted, the production values are abysmal. It is sort of fun to watch the paper plate UFOs, and count how many times the same footage of Lugosi is used. Even so, the plot is so incredibly tedious, that its a chore to watch this movie.\n\nThere is almost no action in it, and every important plot point is explained in endless exposition. Its dull, moves at a snails pace, there are only about four sets used, the plot makes no kind of sense, and the acting isn't amusingly bad, its just bad.\n\nEd Wood was not a visionary, he was an incompetent man who had no kind of talent. His lack of attention to detail, is just insulting to the audience. He exploited everyone he came across in order to get his movies made, and films like this were the end result. It really wasn't worth the effort.\n\nIf you want to laugh at something camp, try watching some of the other horror films of the same era, \"The Creature from the Black Lagoon,\" for example, or possibly a serial.\n\nI think its time that we put away Ed Wood's work. He doesn't even deserve a place as an amusingly bad director. He just truly had no talent."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "filmfann",
        "review_rating": "1",
        "review_title": "Worst Film Ever",
        "review_detailed_main": "At this time, 659 people have given this film 10 stars, which is why it isn't at the pole position for worst movie ever, which is a shame, since it deserves it. No movie before or since has hit the depths of this one. It's reputation is fully deserved."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Spleen",
        "review_rating": "1",
        "review_title": "Yes, well",
        "review_detailed_main": "To let you in on a secret, \"Citizen Kane\" is not the best film ever made. But no-one knows what IS the best film ever made. \"Citizen Kane\" topped a few polls at a crucial moment in history to gain the title, and it retains the title largely because no other film leaps out as the rightful title-holder, either.\n\nThere's much more competition for last place than there is for first. So let's not argue whether \"Plan Nine\" is the worst film, or whether the true bottom of the barrel is a millimetre or two further down. \"Plan Nine\" topped the charts in a key poll taken two decades ago, and for want of an obviously worse candidate, might as well retain its title.\n\nDon't think for a minute that the atrocious production standards alone are doing the work. The plot is witless and uninvolving, there are no characters, dialogue is laughable and the scientific explanations offered aren't even classy gibberish. This is all beyond dispute. Don't think, either, that it's so bad that it's good. NOTHING is so bad that it's good. That description is as conceptually incoherent as it sounds.\n\nThe remaining question: is it entertaining? Well, like anything at all, it can be, under the right circumstances. My siblings and I once derived great pleasure from watching and laughing at \"The Neverending Story II\", a bad movie that will never become a cult favourite of any kind. Depending on your mood you may get a kick out of this or you may not. The fact that it has a reputation helps - you can keep repeating to yourself, \"I am now watching the world's worst movie,\" a thought that has its attractions. It's also a good movie to watch when you feel that you would enjoy finding fault with something that genuinely deserves to have fault found with it. Otherwise it's no more conducive to entertainment than anything else is."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "markokare-09934",
        "review_rating": "1",
        "review_title": "One star",
        "review_detailed_main": "I hereby officially announce that I give this movie 1/10. That doesn't though mean at all I don't love it. I do!\n\nEd Wood's masterpiece of horribleness deserves nothing less or more than 1/10. I mean, that is my way of appreciating the chaotic cinema here.\n\nNothing works in this movie. And that's why I love Plan 9 From Outerspace so dearly. I thank you, Mr. Wood, for everything. Rest in peace.\n\nAnd may force be with you.\n\nAlways."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "tylerkang",
        "review_rating": "5",
        "review_title": "So bad it's good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "dhreid",
        "review_rating": "2",
        "review_title": "This is not the Worst of All Time, Operation Ganymed is.",
        "review_detailed_main": "This is an Ed Wood film. That tells you that it is not good. Not even close, but it is not the worst of all time, Operation Ganymed is. Operation Ganymed is sci-fi space trash. Do not waste your time. However, Plan 9 From Outer Space is a flick that you 'can' watch. A few scary moments, at least for a three year old. A lot to laugh at, especially when compared to other sci-fi films of that day. By no means as good as the Giant Claw or the Deadly Mantis, bad in their own right. The acting is abominable, the sets worse than an elementary school play, the plot ridiculous and the special effects, if they can be called 'special', are -- well you get the picture. Maila Nurmi, Vampira, was so disgusted with the dialog Wood wrote for her that she said she would refuse to be in the film if she had to utter a single word of her 'written' lines. Good for her. You have flying hubcaps, I mean saucers, walking dead, time incongruity, human aliens and magically transforming police cars. Wood should be congratulated for being able to have this thing shown in theaters. I must say that any real old-time sci-fi buff must have Plan 9 From Outer Space in their collection. The collection would not be complete without it."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "giancarlopicanco",
        "review_rating": "3",
        "review_title": "Boring Movie With Weird, Wooden Dialogue and Characters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "claudio_carvalho",
        "review_rating": "10",
        "review_title": "The Funniest Cult-Trash Movie Ever",
        "review_detailed_main": "In California, an old man (Bela Lugosi) grieves the loss of his wife (Vampira) and on the next day he also dies. However, the space soldier Eros (Dudley Manlove) and his mate Tanna (Joanna Lee) use an electric device to resurrect them both and the strong Inspector Clay (Tor Johnson) that was murdered by the couple. Their intention is not to conquest Earth but to stop mankind from developing the powerful bomb \"Solobonite\" that would threaten the universe. When the population of Hollywood and Washington DC see flying saucers on the sky, a military colonel, a police lieutenant, a commercial pilot, his wife and a policeman try to stop the aliens.\n\nI belong to a generation that worships the Japanese \"National Kid\", my hero when I was six years old. Therefore, I was raised watching trash movies (LOL). \"Plan 9 from Outer Space\" is the masterpiece of Edward D. Wood Jr., a.k.a. Ed Wood, a man without talent that loved cinema.\n\n\"Plan 9 from Outer Space\" is totally lame: the screenplay is messy, with characters that do not have any development; the lines are awfully silly and stupid; there is an absolute lack of continuity, and sometimes the shot begins in the night, the next scene is in the sunlight and then it is night again. The scenarios are very poor and it is funny to see crosses shaking in the cemetery and other errors. But the performances are the funniest part of this film, with unbelievable ham actors and actresses. In one of the last scenes, it is hilarious to see the Colonel Tom Edwards (Tom Keen) with hands on the pocket; the police Lieutenant Harper (Duke Moore) with a gun on his hand; Paula and Jeff Trent embracing each other and the policeman with a stupid face watching the flying saucer burning in the sky.\n\nEd Wood did not have producers or sponsors so his budget was extremely low. Therefore he could not afford to lose any shot and he used footages from the studios, like for example the sequence when the three flying sources are bombed by the army. Another example is the footages of Bela Lugosi, who was drug-addicted, forgotten and poor in 1956, and died three days after the beginning of the filming of \"Plan 9 from Outer Space\". Ed Wood used a substitute actor that partially covers his face with a cloak since he was not alike Bela Lugosi. I do not recall how many times and the dates when I had seen this film, but yesterday I saw it again on DVD. My vote is ten.\n\nTitle (Brazil): \"Plano 9 do Espaço Sideral\" (\"Plan 9 from Outer Space\")\n\nNote: On 01 March 2024, I saw this film again."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "dave_hillman",
        "review_rating": "7",
        "review_title": "See this drunk or don't bother",
        "review_detailed_main": "Plan 9 is not the worst movie I've eve seen. Bobby Deerfield is.\n\nWhat Plan is:\n\nCamp. Cheap. Incoherent. Kind of fun if you are relaxed.\n\nI cannot describe the plot since there isn't one.\n\nBut you do have grainy fotage of an elderly Bela Lugosi, a LOT of gay subtext, hilariously bad \"special effects\" and a musical score played by high school students.\n\nThis is a traainwreck project that is hard to not watch once you put it on.\n\nTo its credit: it is short and it exudes 50s weirdness.\n\nDon't expect scares of any kind. I recommend watching this with a crowded room of drunk friends. I booked it on a lark when I ran a film series in college. It waa such a hit I had to hold it over. Fortunately, it wasn't an expensive rental then. But its reputation has grown so much that might be the case today.\n\nAnd there is the unforgettable Dudley Manlove. And Vampira!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "vampi1960",
        "review_rating": "5",
        "review_title": "So bad its good!",
        "review_detailed_main": "plan 9 from outer space is'nt the worst movie ever made,its a fun party movie.even though the movie is inept with its flying saucers with strings and cardboard headstones,its funny this was Bela Lugosi's last movie.some of his scenes were done with a double(who looked nothing like Bela Lugosi)the great tor Johnson as a ghoul along with horror hostess;vampira,looking very sexy in black.ed wood Jr was'nt the worst directer either his movies were inept but fun to watch,i especially enjoyed glen or Glenda,jail bait,and even bride of the monster.its a classic so bad its good movie.despite what some are saying about it.I'm giving plan 9 from outer space 5 out of 10."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "StanleyStrangelove",
        "review_rating": "",
        "review_title": "A cult classic - so bad it's hysterically funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Jsimpson5",
        "review_rating": "4",
        "review_title": "Best of best (in truth I mean worst)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "dae5",
        "review_rating": "1",
        "review_title": "What's wrong with you people?",
        "review_detailed_main": "How does the zenith of Woodian garbage end up anywhere outside the bottom 20? This film is regarded on six continents as The Worst Film Ever, and for good reason, which I won't even bother to repeat here.\n\nJudging from the demographic breakdown, Plan 9 is unable to break the bottom 20 because an unfortunate number of people rated it a 10 based (I hope) on its legendary badness. But truly, giving Plan 9 anything above a 2 is really just an insult in disguise: this is remembered for being genuinely, utterly, and undeniably awful. Don't take that away from it."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "petervenkman57",
        "review_rating": "5",
        "review_title": "Clearly NOT the worst movie ever made",
        "review_detailed_main": "The worst movie may well be Alien 4. That film had a huge budget and everything going for it and it is still terrible. It actually has Wynona Ryder saying \"Well Ripley, you've saved the universe\" Even Old Ed would have blushed over that one. Plan 9 is at least entertaining. The worst films are just boring... How about \"Fellowship of the Frog\"? That was bad and boring. This film actually has a lot going for it, planned or not. Plan 9 has a very weird tone that is hard to describe but at the same time oddly compelling. OK so you might say that it was just an accident but if you look at Bride of the Monster it has the same dark creepy tone that feels much like a demented dream. Worth a look... and yes it is a train wreck but don't we just like looking at things like that. God Bless you Ed where ever you are... you at least tried."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "fork-lift",
        "review_rating": "1",
        "review_title": "Dis flick ROCKS!!!",
        "review_detailed_main": "Here's a toughie...pick a fave scene...the detective scratching his head with his revolver, the pie-pan flying saucers, the faux Legosi, after the real one kicked, and, lest we forget, the immortal TOR JOHNSON!!! This movie kicked a**, top to bottom, back to front, and on the sides...DIG IT DADDY!!!"
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Walter Gamble",
        "review_rating": "1",
        "review_title": "A shame",
        "review_detailed_main": "You know, he could have had something here. The story: a highly advanced alien race discovers technology which could destroy the universe by detonating sunlight. Their immediate fear is that the war-like Earthlings might discover this technology for themselves, and be idiotic enough to use it (they have a history of that kind of behaviour). The leader of these aliens, a pompous beuraucrat, wants to just wipe this dangerous race out, but grudgingly allows some earnestly pacifistic underlings to try scaring them first - making them aware of the threat of alien destruction, then delivering an ultimatum (this idea was later appropriated by James Cameron for \"The Abyss\"). An extraordinarily clever sci-fi premise which has huge potential for anti-war satire; unfortunately, there's the ludicrous grave-robbing idea, awful special effects, illogical action scenes, lousy acting, hilariously bad dialogue, cardboard sets, and Wood doesn't even seem to be siding with the right characters...somebody should remake it. It has the potential to be great."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "Sandcooler",
        "review_rating": "2",
        "review_title": "Attack of the good china",
        "review_detailed_main": "Ah, the legendary \"Plan 9\", what's left to say about it. I have a certain respect for Ed Wood. Despite failing over and over again, he just kept going and giving the best he could. I'll just won't be able to live with myself if I give this only one star, though it's not better than that. I like how he tried out the SF-genre, that way he could reach new levels of ineptness. \"Glen and Glenda\" was charming but rather talky, this one is loaded with action! The action of paper plates and fishing wires, the action of a guy hiding behind a coat, but action nonetheless. It's even more remarkable and more heart-warming than the unmanned octopus from \"Bride Of The Monster\". The Tor Johnson performance is worse though, why oh why did they make him talk? And one woman has a really annoying accent, it needs to be said. I still need to check out that other very promising movie \"Night Of The Ghouls\", but this one is a true Ed Wood, one for the ages."
    },
    {
        "movie_id": "tt0052077",
        "movie_name": "Plan 9 from Outer Space",
        "movie_rating": "3.9",
        "review_username": "TheEoghShowOld",
        "review_rating": "4",
        "review_title": "Exactly what you'd expect",
        "review_detailed_main": "Watched in preparation for Ed Wood (1994). This movie is basically everything one would expect it to be based on its reputation; the plot was complete nonsense, everything on the production end, from the set design to the practical effects to the makeup, was terrible, much of the dialogue showed off Ed Wood's practically non-existent understanding of how anything in space works, and the acting somehow managed to be even worse than the already pretty low \"old movie\" standard. So I think many more recent filmmakers should be pretty embarrassed that this was more watchable and enjoyable than stuff they made many years later with much higher budgets. I don't think this movie is good in any way, but it's far from the worst thing I've ever seen."
    }
]