[
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Draysan-Jennings",
        "review_rating": "6",
        "review_title": "Predictable but watchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Dal_",
        "review_rating": "5",
        "review_title": "Watchable, but predictable",
        "review_detailed_main": "Well filmed and produced, but was just so obvious from the first act, if you're like my partner and enjoy jump scares that others can see coming a mile off you might like it.\n\nIt's under 90 minutes so not bad to put on if you want something that doesn't need concentrating on before bed, or maybe after a few drinks."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "EversonMovies",
        "review_rating": "6",
        "review_title": "Not as bad as the reviews say",
        "review_detailed_main": "Just watched this on a Saturday night and for what it is, it's ok. It is not an Oscar winning film but it is a good watch with popcorn and a few jump scares. Seems to be harshly reviewed and although the acting isn't perfect, there are a lot worse films out there. Just give it a go."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "pirzadaj",
        "review_rating": "5",
        "review_title": "Premise was good, but the script was very bad",
        "review_detailed_main": "If I give a score below 5, it means the movie is a bad B movie. I gave this a 5 because it wasn't a B movie. It was a movie that had a good premise/idea, but didn't execute it very well. I lay most of the blame on script. The main guy in it is a good actor but one can only do so much with a script like that. First, they made his wife a dumb dumb. She was suspicious in the beginning when the guy was being the perfect husband and then when there were shady things, she suspicion went away until it was just too obvious something was going on. She found clues WAY to easily and found the secret room WAY too easily. She read the house blue prints as if she were a master architect. She broke into a car and found a an exact key she needed to open a mailbox later and broke into a house and found an envelope she needed. It was just done in a lazy way. This is what happens when streamers need content badly and they'll take anything. If you skip it, you won't miss anything."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Can see them/it coming",
        "review_detailed_main": "Yes if you have seen a thriller (or two or more), you probably will get where this movie is heading. So there won't be too many surprises story wise, but I like the actors (doing a great job). And even when I knew what this was going to be about, it was well told. Especially with another almost twist before the third act.\n\nSo yeah this is quite flawed and predictable for many, but it is well made and edited. It lives off the actors and their charisma mostly - which is at least something I'd argue."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "johannes2000-1",
        "review_rating": "4",
        "review_title": "Potentially good premise, but total lack of realism and logic.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rita90",
        "review_rating": "6",
        "review_title": "Not a masterpiece and nothing new but entertaining",
        "review_detailed_main": "I've seen some bad reviews that were gonna stop from watching this movie. But because i didn't wanna spend another 20 minutes looking for another one, i decided to watch it. And god, people are harsh on this one. It's definitely nothing new, predictable and we've watched a lot of movies like this. And yes, Pinta isn't the greatest actress. But it isn't that bad, I've seen much, much worse movies. I feel like reviewers are not fair and they lack argument. It did it's job by entertainning me and that's all i ask from this type of movies."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "chrisrz",
        "review_rating": "4",
        "review_title": "Baseball bat",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Just-A-Girl-14",
        "review_rating": "7",
        "review_title": "What's with the bad reviews??",
        "review_detailed_main": "Why are people always looking for something fresh and original? Ok, so it's not an Oscar winner but it's a decent thriller. So what if it's predictable? So what if it's been done before? Not every movie can be the next big thing. With the amount of crapy movies out there (and I mean real crap) it's just not that bad! Definitely doesn't deserve such low ratings! I enjoyed it. It was fine. Decent acting, good pace and an interesting (even if predictable) storyline. Yes, it's been done before but so what? If you're looking for the next big thing, don't watch it but if you want to kill an hour and a half and watch a decent thriller, give it a try."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Mehki_Girl",
        "review_rating": "5",
        "review_title": "Annoying",
        "review_detailed_main": "This is one of those movies where people make stupid mistakes/decisions and you find yourself screaming at the TV - stab him until his dead, pick up the knife, don't drop the gun, close/lock the door, wait until he's not home, take the damned bat, hurry up!\n\nYou get the picture.\n\nWe've all been there.\n\nOh, and the house was ugly AF."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "gargsharsh",
        "review_rating": "8",
        "review_title": "Dont believe the negative reviews, Its predictable but a overall a good ride.",
        "review_detailed_main": "I dont know why the fuss about it being predictable its a thriller not a mystery.. and thrill is always in the ride not the destination and this movies gives your a very good fast paced ride with its quick story telling.. All the cast performed their best Logan was as usual doing his best like his past performance in \"The Invitation\".."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "TdSmth5",
        "review_rating": "7",
        "review_title": "It worked for me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mkay93",
        "review_rating": "4",
        "review_title": "It was trash!!!!!",
        "review_detailed_main": "Movie lacked so much, it had potential but it seemed to disappoint. I don't get why it's the same content over and over again.. no different than other movies in same category. Not much explainations throughout movie, it was bogus!!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "blanche-2",
        "review_rating": "3",
        "review_title": "It was an intrusion, all right",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "nathanmanson",
        "review_rating": "7",
        "review_title": "Completely caught me off guard",
        "review_detailed_main": "As my header says it did completely catch me off guard. I was expecting just a standard home invasion thriller that you see a lot of, but it wasn't that at all. When the the home invasion happened so soon into the film it confused me how the film was going to go. I'm seeing a lot of bad reviews and people saying it was too predictable but that is complete lies. Unless they can see into the future there's no way they predicted how the film would go. In my opinion it's a really good thriller where you're on the edge of your seat and with quite a lot of jump scares, if that's your thing you will love it. Don't believe the bad reviews and give it a chance."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "aarpcats",
        "review_rating": "5",
        "review_title": "How many times have I seen this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rago-52219",
        "review_rating": "7",
        "review_title": "Don't go by all reviews ever.",
        "review_detailed_main": "Like music, every note that exists has been played million times over just moved or mixed around.\n\nMovies fall into that also.. can always connect a link or similarity to something else.. doesn't mean it;s bad.. have seen worse with big budgets.. critics here want to be the 1st brainiac to spoil or micro manage every thing in a movie. Almost like it's the're job to chase u away from the movie with the're brilliant synopsis of been there/done that.. the worst review I can give a movie is I would not watch it again down the road.. once is enough but i will watch something i never saw regardless of the brilliant R. Eberts here."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "MugShotBlues",
        "review_rating": "1",
        "review_title": "Bottom shelf trash",
        "review_detailed_main": "There's so many things that are wrong with it that the smartest advice is to redirect your movie time towards anything other than this!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jonasmarkussen",
        "review_rating": "7",
        "review_title": "Mark my words: Logan Marshall-Green is going to be A-list!",
        "review_detailed_main": "Yes Netflix finally a well done entertaining thriller from you! After I couldn't sit through Sweet Girl from earlier this year I was happy to see that they kind of redeemed themselves with this production.\n\nI saw it without knowing nothing about it or reading any reviews. Therefore I thought it was a straight up home invasion thriller which I like, but I quickly discovered it was more of a standard thriller. And it's good fun.\n\nThere are not a lot of reviews at the current moment, but I've seen two just calling this movie trash, one without presenting any arguments to why he or she found it to be that bad, and the other because it was 'predictable'.. Does that necessarily make a movie bad? Because I don't think so. Yes, it maybe is a little predictable but not AS predictable as some make it out to be. And I really don't think this movie set out to be groundbreaking in the thriller genre. I'd rather see a well produced and well acted thriller, that's not trying to break new grounds in the genre but is just a good and suspenseful ride, that a pretentious thriller that wants to be something that it is not with a complete confusing story line and bad actors. Intrusion maybe does not add anything new to the genre, but that seems to be the case of a lot of movies, and still it is just a fine thriller, and I didn't expect anything else.\n\nThis is not a masterpiece, but it is perfect as Sunday night entertainment. Freida Pinto is great as Meera, our protagonist but Logan Marshall-Green steals the show as Henry. It's kind of a cliché but by doing a little he's doing a lot. I really liked him in this one! He is far from a-list material yet, but having delivered so many solid performances in movies like The Invitation and Upgrade and now this one I believe he will get a lot more roles in way bigger productions made for the big screen in a few years!\n\nThe rest of the cast unfortunately isn't that great, and especially Detective Morse, portrayed by Robert John Burke is bland and really doesn't add anything to the story. But again the movie really centers mainly around the married couple so I was okay with that. Then there was a really forced scene that was there only to drive the plot forward, where Meera is watching the news at home while hosting a party that I found quite unbelievable. It's a little thing I know, but who turns on the news when they are having a big house party, when there's no particular reason for it? It was to obvious that the writers needed that. At last I didn't find the ending to be as exciting as I hoped for. It's not a big disappointment and there wasn't a lot of ways it could've ended, but it could've been done a little better.\n\nSo not a masterpiece but very entertaining and it ranks high amongst the recent Netflix Originals, although that's not saying a lot. If you are in it for a well done thriller to spend an hour and a half, I think you will find it fitting for just that. Either way, I think giving this movie a 1-star rating is just ridiculous..\n\nI use to comment on the bad tendencies among a lot of reviewers here where they give 1 star to ok movies. It's very misleading and I think IMDb should have a bigger filter for taking out reviews that are not presenting any arguments besides \"it's trash\". When people go to the site for guidance towards good movies and the first they see is for a movie like this are three reviews giving this a 1-star rating without arguments they might miss out and thats a shame.\n\nIntrusion is probably around 6.5 if you ask me. I recommend watching it without seeing the trailer. Enjoy.\n\nPlease rate fairly."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "derekrsim",
        "review_rating": "1",
        "review_title": "Ridiculously stupid plot, horrible amateur acting, unbearably dry.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jacquieavis",
        "review_rating": "8",
        "review_title": "Atmospheric and entertaining",
        "review_detailed_main": "These low ratings, seriously, ignore. For something to be rated 1 to 3 stars, it would be barely watchable, and this was so muzzy better than that. This was a VERY good film. Maybe not the most original, maybe at times a little predictable, but really atmospheric and gripping."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "drpainters",
        "review_rating": "6",
        "review_title": "Very predictable",
        "review_detailed_main": "Very predictable but still kind of entertaining. If you've got nothing to watch and want a few scares without much blood, give it a try. Not something you'd watch more then once."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "scorpiogemini",
        "review_rating": "2",
        "review_title": "Freida Pinto can't act in this",
        "review_detailed_main": "I'm not sure if its the actresses fault (I have only seen her in Slumdog millionare) or if its the director who could not work out the best of Pinto but the result is, Pinto can't act at all, the other female character acted waay better then Pinto. Oh yes also, the story is trash. Its like a B-movie but with nice aesthetics. I watched it only for Logan but even he could not save this movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "roobypie",
        "review_rating": "3",
        "review_title": "Predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bjcramer-92954",
        "review_rating": "7",
        "review_title": "I liked it...",
        "review_detailed_main": "Albeit somewhat predictable, I enjoyed watching this film. Could have been a bit edgier and sinister to deepen the plot line... but overall a decent watch!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "patriots3428",
        "review_rating": "1",
        "review_title": "Tedious",
        "review_detailed_main": "Shocked how trash like this gets made. There must be so much money sitting in Hollywood studios that a script this bad actually gets a green light. Not a single relatable character, just dripping with tired stereotypes and worn out plot lines. Did Covid melt all the creativity away from writers? Even when there was a presumedly suspenseful scene, it was so predictable that I was tempted to fast forward past the obvious. No wonder so many people believe they can make it as a successful actor or writer. When they see something this bad, they must be thinking \"surely I can act / write / direct better than THAT!\""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "lynansaysingle",
        "review_rating": "7",
        "review_title": "Disturbance Predicted",
        "review_detailed_main": "It is a predictable concept in a movie but it is watchable. I have seen bad acting in movies and because of that I stop watching but this is not bad. You get the creepy vibe from the husband straight away which makes it unsurprising. There is still a bit of twist in there though. Overall, I didn't mind it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Luigi Di Pilla",
        "review_rating": "5",
        "review_title": "Average psycho thriller",
        "review_detailed_main": "Actually Intrusion is ranked third on Netflix. So me and my wife tried to watch it. The critics here are so negative but you have to make your own opinion. Then we saw the thriller and we thought it must not be so bad as written in the reviews.\n\nFinally we spent surprisingly an entertaining evening. It's a solid psycho thriller.\n\nThe main actors did a good job. The atmosphere and the landscapes were creepy done. The story was not boring and this is why we give an average of 5.5 out 10."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Allvgretto",
        "review_rating": "6",
        "review_title": "It was alright",
        "review_detailed_main": "\"Intrusion\" has some parts that were genuinely scary for me, which I appreciated. However, the overall story is just okay, bordering on meh. The female main character isn't the smartest, which is an unfortunate common trope in horror movies.\n\nIt's not the worst thing I've seen, but it's not the best either. It's definitely watchable, so if you have some free time and nothing else to do, give it a shot. While it may not be groundbreaking, it has enough moments of tension to keep you entertained."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "lucaschriskowalski",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Again I wonder why Netflix produces content like this. This was absolute trash. Lacking anything new, creative or fresh. Netflix seems to have become the new Lifetime movie channel. There is content that they produce that is brilliant, epic and exciting. This was garbage and a waste of the talent including Logan Marshall-Green who was brilliant in Upgrade."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "esotericelle",
        "review_rating": "10",
        "review_title": "FANTASTIC!",
        "review_detailed_main": "I absolutely loved this movie! Granted, I was a bit \"elevated\" when I watched it, but the glee was still there. I've read some of the comments going on and on about \"predictable...no acting skills...boring\" wah wah, so what! There's only so many plots in the world, and they're all supposed to blow our minds each and every time? I mean come on people. Sheesh I'm Karening super hard right now, but really. Sometimes we should appreciate movies for exactly what they are at that moment we're watching them.\n\nThis was good. Let's give it at least that."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rum2550",
        "review_rating": "7",
        "review_title": "Not as bad as some reviews suggest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "veanchawhite",
        "review_rating": "4",
        "review_title": "Do people audition for these roles!?",
        "review_detailed_main": "I keep seeing these poor excuse for movies being released with the worst actors. I always imagined I'd suck as an actress, but I'm starting to think I have a chance lol. Anyone an agent?\n\nOh and this movie was cringy. Unrealistic choices homegirl was making. Yeah, let's \"get away\" unnoticed but then yell out HENRY with zero emotion attached. I was so excited for this...but...nope."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "chinandchin",
        "review_rating": "3",
        "review_title": "It's bad",
        "review_detailed_main": "I am watching it right now, it's qiute stupid, hate every character, the story is stupid and predictable, my friend is still watching thats the only reason why I havent turned this off yet. It's 60 mins now, see how much longer my friend can stand for this crap."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tkatsoufris",
        "review_rating": "6",
        "review_title": "Run of the mill Thriller!!!",
        "review_detailed_main": "A run of the mill movie of the genre In every aspect. All parameters that make a movie(script, acting, plot, pace) is just adequate!!! Not unwatchable by any means though. I've seen jokes other terribly worse movies In my life."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "greg-29535",
        "review_rating": "1",
        "review_title": "Wow! What a turd!",
        "review_detailed_main": "Stupid plot, unbelievable characters, and of course loads of incredibly stupid decisions. I could take the time to break them down but it's just not worth it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "yusufpiskin",
        "review_rating": "7",
        "review_title": "Chris & Adam",
        "review_detailed_main": "My favorite director, my favorite screenwriter, and Logan Marshall-Green.\n\nI don't understand why people rated it low. However, it's a Chris Sparling and Adam Salky job.\n\nLogan Marshall-Green is again very good.\n\nChris knows tight spaces and solitude very well. His pen is no stranger to these matters."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "MovieCriticOnline",
        "review_rating": "1",
        "review_title": "Another unoriginal movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "dylanemrose",
        "review_rating": "6",
        "review_title": "It was ok, worth a watch if yoy have nothing else.",
        "review_detailed_main": "The other reviews are quite harsh and it was a little bit predictable, but, overall watchable if you are bored and can't find something to watch."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "certifiedflooringau",
        "review_rating": "1",
        "review_title": "Another bad movie",
        "review_detailed_main": "I admit I have been giving some negative reviews recently but it's not intentional. I'm not gaining anything out of them. The only reason is they are really bad movies.\n\nFor example this one's plot is full of holes and unreasonable actions and reactions which is truly disturbing making you think they take viewers as fools. I understand making a movie isn't an easy task but I wish they would be more serious and logical if they're making a thriller drama based on reality."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "eronzierjoly",
        "review_rating": "8",
        "review_title": "Oh please this is definitely worth a watch",
        "review_detailed_main": "Sure there are some 'what is she doing'- moments in there but it is NOT at all that predictable. I'm sure people who complain about this being predictable say so because they got half way through and then started to put things together, as it should be. It's not like you start watching this and instantly know exactly how it all is going to unfold. And even if that was the case, it is still worth watching.\n\nThis only confirms my theory that people reviewing movies love to hate Netflix, and have to appear smart and seasoned so that anything that isn't groundbreaking receives 1-3 stars. This was a perfectly decent thriller in spite of some annoyances. It's not like every single production has to offer something new or groundbreaking. It is enough that a movie keeps you interested and this one accomplished that."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "adhdreview",
        "review_rating": "1",
        "review_title": "ADHD Review: Definitely Skip This.",
        "review_detailed_main": "Longer Review: You will become increasingly agitated at every choice the female lead chooses to make. A movie that could have ended in 20 minutes if the writer had provided the character with any survival instincts or common sense.\n\nCall the cops? No. Pick up that weapon, kitchen knife, or anything at all to defend oneself? No.\n\nSave yourself the frustration and skip this."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Horror_Flick_Fanatic",
        "review_rating": "2",
        "review_title": "Poorly written thriller.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "More2sky",
        "review_rating": "7",
        "review_title": "Decent but predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "amyemcdonald-91626",
        "review_rating": "1",
        "review_title": "I can't...",
        "review_detailed_main": "I can't do silly, weak women. Home invasion and you're mad at your husband for owning a gun?! Grow up girl! Over caring husband is boarder-line creepy. If you're that scared and helpless, why the hell would you move out to the tumbleweeds all alone? Eye-roll!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "potipiroon",
        "review_rating": "7",
        "review_title": "Not bad at all.",
        "review_detailed_main": "This is the type of movie which you don't have to think too much about. Just grab a popcorn and enjoy it. Whoever said this movie is predictable must be a genius. What I like the most about this movie, besides its unpredictability, is the scenery and the house. Recommended!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "dred_gery",
        "review_rating": "1",
        "review_title": "Could have been decent.....but not",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jpfox-86566",
        "review_rating": "6",
        "review_title": "Kept me engaged",
        "review_detailed_main": "It kept me engaged until the end. Not a bad movie at all."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sartmav",
        "review_rating": "2",
        "review_title": "Hilariously bad",
        "review_detailed_main": "Like 80% of what Netflix churns out, this is hilariously poor. I rarely ever rate anything but the urge to do so after wasting precious weekend minutes on this was too strong. The acting, the pacing, the plot - abysmal. Probably the worst 'horror' movie I've watched in years. The saving grace is the beautiful landscape the movie is set in."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "btreakle",
        "review_rating": "8",
        "review_title": "Thriller indeed",
        "review_detailed_main": "Personally, I loved this film. Sure easy to predict but none the less enjoyable.\n\nHighly recommend this film to anyone who likes thriller movies."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "alliwils",
        "review_rating": "7",
        "review_title": "Not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jfh-72320",
        "review_rating": "4",
        "review_title": "Dumb couple doing dumb things.",
        "review_detailed_main": "Here's a tip: pick up your cell phone and call the police.\n\nWhy does everyone make movies about stupid people, making stupid decisions, and then call it \"suspense\" or a thriller.\n\nLook, I know many Americans are stupid in real life, but do we have to make movies about them.\n\nHow about a real suspense movie sometime, with smart people in an intelligent thriller."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kaustubh141",
        "review_rating": "3",
        "review_title": "Old story old plot stale script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jerseyd1",
        "review_rating": "",
        "review_title": "Lame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "aquafeb",
        "review_rating": "7",
        "review_title": "Movie was decent",
        "review_detailed_main": "I enjoyed it, and didn't expect the ending.\n\nActually felt a bit scared from the movie sounds :)"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tgcme",
        "review_rating": "4",
        "review_title": "Color by numbers with broken crayons",
        "review_detailed_main": "Yeah, anyone with any sense of how movies work knows exactly what this movie is from jump. It telegraphs itself with no subtlety at all. I'm not sure it's even trying to do that.\n\nAnd then once we get to the big finale, it's just appalling how the only way they can propel the plot forward is for the women to be as abjectly stupid as possible.\n\nIf you watch it just to have something on to watch, it's fine. It's just another movie. It's serviceable, I suppose. It's not completely unwatchable. But it's not smart and it's not anything you haven't seen done way better.\n\nI liked the main character more than most people on here seem to. I think she's the only reason to actually watch it and finish it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "frank-liesenborgs",
        "review_rating": "7",
        "review_title": "What the hell is Netflix doing?",
        "review_detailed_main": "\"Intrusion\" tries to tell the story about the handsome couple Meera (Freida Pinto-Slumdog Millionaire) and Henry (Logan Marshall-Green - Prometheus). They have moved to a small town into an extravagant modern house that he himself designed. This movie shows similarities with \"The Night House\". Meera's sifting is the most enjoyable element of the film, as we play detective along with her, ransacking through drawers and asking questions she perhaps doesn't want answered. Where Meera ends up is no great surprise but it's a twist that takes the film to a nasty place.\n\nWhat struck me immediately is the lack of chemistry between the \"handsome couple\". The acting is not that bad, it just does not feel right. A bit forced acting and their characters are not aligned with the story and the plot. There is a gorgeous house, stunning scenery but also a very predictable ending. At the end, you don´t care about the plot. You just want to get to the end of the movie before falling asleep. Even when Henry talks about his perversity, it is difficult to stay awake before watching another movie.\n\nIt is easy to criticize a movie, I know. I know the actors are good, but this, whatever this is, did not work!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "legra66",
        "review_rating": "3",
        "review_title": "Plot was painfully unrealistic!",
        "review_detailed_main": "From the character to things done, one wonders the naivety of the writer as there is no sense of street smart in the wife. Does things no one especially, being non-white, would do in a small town or when the person you suspect is present. For a counsellor, does not have much of common sense. Terrible film overall."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bluejacquet",
        "review_rating": "6",
        "review_title": "Nice twists but nothing great",
        "review_detailed_main": "One of those movies in which you cheer for the bad guy. Of course, bad guy loses in the end. Character was a solid sicko. Could have been so good. She's unlikeable. He's clever, slick, and sick."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "CoreyPeltanna",
        "review_rating": "1",
        "review_title": "SUCH A BAD MOVIE IN EVERY WAY",
        "review_detailed_main": "I figured why not. Then five minutes in started to question myself. Realized the writer was one who has written failed movie after failed movie. Exception-Greenland....but then again released during Covid anything was a hit. Not to sound childish.... This movie Sucks!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "antie-68385",
        "review_rating": "10",
        "review_title": "I really enjoyed it",
        "review_detailed_main": "Perfect movie for this time of the year. I watched it twice."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "abelvanreenen",
        "review_rating": "6",
        "review_title": "Ultimately boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "JobsBronson",
        "review_rating": "2",
        "review_title": "Lackluster Performances and Predictable Plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "zaralopez",
        "review_rating": "3",
        "review_title": "Snoozefest",
        "review_detailed_main": "This movie could barley keep my attention, I ended up turning it off and going to sleep. The lead actress is overly annoying as is the screaming for \"henry\" and her acting was so bad that I wouldn't care to see any of her other work."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "A stunning house",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rileyyjayy",
        "review_rating": "6",
        "review_title": "Too predictable but still entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tendobear",
        "review_rating": "1",
        "review_title": "So Stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "azagostonkristof",
        "review_rating": "7",
        "review_title": "intense thriller after a slow start",
        "review_detailed_main": "The film starts slowly, but when it starts it becomes very intense. Perfect shows from a woman's point of view what it's like to live with a psychopath for 12 years. You guess nothing, and then when you come across the truth, you too become a victim."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "NuancedGal",
        "review_rating": "1",
        "review_title": "Awful, Obvious, Insulting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Barry-5109",
        "review_rating": "6",
        "review_title": "It was fair - reminded me of a lifetime movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "flipu-17783",
        "review_rating": "3",
        "review_title": "Predictable and Stupid",
        "review_detailed_main": "You're a moron if you didn't see the twist coming. Also, for a shrink, Meera is pretty stupid. She had access to a weapon and didn't use it. It's so frustrating that you wished the villain would kill them because that would be a big win for natural selection.\n\nThe house is fantastic, and Logan Marshall Green is great as always. I just wished the screenwriter would've been a little more creative. If you're keeping the budget tight with limited characters, then each character on the screen needs to be strong, see 10 Cloverfield Lane as an example."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "grabboid-44815",
        "review_rating": "8",
        "review_title": "Good Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "elainagray",
        "review_rating": "6",
        "review_title": "Predictable but still ok",
        "review_detailed_main": "Guessed what was going on in about 10 minutes but still had some good jumps and kept the tension up ok. It's worth a watch but it's not going to win any awards."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jaimemedina-36288",
        "review_rating": "1",
        "review_title": "Absolutely idiotic",
        "review_detailed_main": "There's really not much more to say other than you'd have to be an absolute idiot to write this crap and an even bigger fool to produce it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "searchanddestroy-1",
        "review_rating": "1",
        "review_title": "Be sure the garbage collector doesn't leave it in the can...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "StarrKitty",
        "review_rating": "6",
        "review_title": "Not bad at all",
        "review_detailed_main": "I don't think this movie was bad at all. I've seen much, much worse. Yeah, it was predictable. I still think it was enjoyable for what it was. It's not going to win any Oscars or anything, but it is watchable and some people may not even guess what's going to happen next. I happen to watch a lot of thrillers, so it's a little harder to fool me. Personally, I think some people just don't like seeing how depraved some males are or can be. I also watch a lot of true crime and I assure you that if we just used true crime alone, we would never run out of stories to tell. What does that tell you? Give it a chance."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Saoustou88",
        "review_rating": "2",
        "review_title": "Utter Nonsense",
        "review_detailed_main": "I went into this film optimistic, excited even. Well Lo & Behold was I in for one joyless bad-acting ride. I'll make it quick unlike the directors who put us through 1hr33 minutes of a waste of time diabolic script, and on top of it slow paced. Frida Pinto should give up acting like yesterday. Logan however played his part very well, plus he's eye candy and quite frankly the only reason I sat through this disaster. The movie didn't know whether it's coming or going. Absolute trash."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "julietcarroll-67092",
        "review_rating": "",
        "review_title": "The Women in the movie are portrayed as Helpless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "gab-67599",
        "review_rating": "7",
        "review_title": "I Liked It",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "hermiticalsoul",
        "review_rating": "1",
        "review_title": "Oh no!",
        "review_detailed_main": "I lost count how many times Pinto does stuff in the movie that no normal human being would do. She is an overrated actor who just lucked out with Slumdog Millionaire. She cannot act!\n\nI came here to read the reviews just to see if anyone has mentioned the filming location, especially the beautiful house. The house and the background is definitely not Corrales. It has to be closer to the Sandia Foothills. Anyone?"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "najorfam",
        "review_rating": "7",
        "review_title": "A good movie",
        "review_detailed_main": "Yup it's predictable sort of, it's a decent movie overall."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "gianmarcoronconi",
        "review_rating": "5",
        "review_title": "Banal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "edlc1970",
        "review_rating": "10",
        "review_title": "Forget all the haters",
        "review_detailed_main": "This movie was actually very decent and watchable. A good Netflix production. Its far far from the one star rating many self proclaimed critics give it. Far from. Its maybe not a top notch, But just to counter all the haters, i give it top grade."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "RachelMary2",
        "review_rating": "7",
        "review_title": "Not bad Netflix!",
        "review_detailed_main": "I have developed low expectations when it comes to Netflix films. This isn't brilliant but by no means is it trash. There are some silly plot developments that could have been handled much better, but if you forgive those it holds the tension well. There are some good frighty moments and it's well paced. It is kinda predictable but wanted to watch anyway, which says something."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Sobertoaster-764-479561",
        "review_rating": "3",
        "review_title": "A thriller you've seen dozens of times...done very mediocre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "diamond-49587",
        "review_rating": "2",
        "review_title": "Disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "akeen-15868",
        "review_rating": "",
        "review_title": "Seen it all before",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "boothjacquie",
        "review_rating": "6",
        "review_title": "Enjoyed Watching ... ignore the haters",
        "review_detailed_main": "Don't listen to the haters - This is an okay movie, worth watching. I don't understand the negative comments about the acting - seemed fine to me. The script was a little disjointed, but still enjoyed watching it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "clarkjessica-16395",
        "review_rating": "2",
        "review_title": "Another Trash Movie from Netflix",
        "review_detailed_main": "Why would Netflix accept this kind of rubbish? Bad plot, Bad actor, bad film quality, terrible script and throw ups outfits. The Lead Actor 5/10. But the lead actress was terrible.\n\nHow did she get the role? I just irritated."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kausarsuhail",
        "review_rating": "7",
        "review_title": "Nice thriller",
        "review_detailed_main": "I was reluctant to watch this movie due to it's bad reviews but surprisingly turned out to be really good."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Coffee_in_the_Clink",
        "review_rating": "3",
        "review_title": "Another disaster from Netflix",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tenderheart-98356",
        "review_rating": "7",
        "review_title": "PTSD",
        "review_detailed_main": "An interesting perspective for the countless women who are ever being stalked or tormented. Lead character goes through hell so the viewer doesn't. A must view for anyone who loves suspense. Raw survival at it's finest!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Shez1878",
        "review_rating": "2",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Genuinely stunned to see people saying the acting was good in this movie. The acting was dreadful and the story complete and utter nonsense. Much better, realistic movies on Netflix."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kristen-34877",
        "review_rating": "9",
        "review_title": "Pinned me to my seat!",
        "review_detailed_main": "A very good psychological thriller! Quite unpredictable too!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "taibaebrahimh",
        "review_rating": "6",
        "review_title": "Very Good! Please don't mind the bad reviews.",
        "review_detailed_main": "I watched it with my mom, in total silence.\n\nIt is entertaining & good."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "twinkle_pink",
        "review_rating": "3",
        "review_title": "Not a very well thought out resolution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mutum-378-411645",
        "review_rating": "4",
        "review_title": "Entertaining but blah",
        "review_detailed_main": "If you've ever seen a 90 minute thriller before then you'll be able to predict most of this movie. It entertains but it's cliché throughout. Nothing new. Easy to watch though."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Hellooo1234321",
        "review_rating": "",
        "review_title": "6.5/10 not bad, but quite predictable.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "a-mora-d",
        "review_rating": "6",
        "review_title": "Predictible",
        "review_detailed_main": "Besides being predictible, the movie catches you about halfway but Pinto's acting Is so bad it makes it hard to avoid getting bothering by it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "johnaskew",
        "review_rating": "3",
        "review_title": "Predictable",
        "review_detailed_main": "Boring, predictable, badly directed, seen it all before, nothing new..."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "fore-91705",
        "review_rating": "7",
        "review_title": "better than these bad reviews",
        "review_detailed_main": "Predictable, yes. But very entertaining. Alomost line an european style psycho thriller. Loved the acting of the guy. Worth a scary watch!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Moviedog26",
        "review_rating": "1",
        "review_title": "Netflix trash",
        "review_detailed_main": "Is beyond my imagination how Netflix can make money and have a bunch of idiots paying membership for the trash they dish out. Hope they go bankrupt soon."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sewalker-12265",
        "review_rating": "6",
        "review_title": "Decent flick",
        "review_detailed_main": "Not sure why such poor ratings.. This was a decent flick. The plot was predictable, the guy was creepy from the beginning so it was a little unbelievable they would be married 12 years and now this just pops up... But overall movie kept you entertained throughout."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "aliibum",
        "review_rating": "4",
        "review_title": "How is this movie a 12?",
        "review_detailed_main": "This is a good film with a good plot overall I also liked the actors even though I assumed who the good guys and bad guys were pretty early on just based on the actors seeming to stick to certain roles.\n\nHowever I really disagree with the age rating of 12. I think its a bit much?"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "elliotjeory",
        "review_rating": "8",
        "review_title": "Henry: Potrait of an architect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "confirmeddeath",
        "review_rating": "7",
        "review_title": "A love story",
        "review_detailed_main": "This movie is so much than what it is supposed to be.\n\nA loving husband doing everything he can to make his wife happy.\n\nHe even goes the lengths of \"I decide when\" to keep his urges at bay for his wife. Even at the end of it, the one thing that bothers him the most is \"But, who'll take care of you\".\n\nThat's true love!\n\nThe wife didn't love her husband as much as the husband loved her, and that's disappointing.\n\nI liked the husband character, even if he was a little odd..."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kremicoco",
        "review_rating": "5",
        "review_title": "Lifetime Movie at Best!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "williamkelly-12810",
        "review_rating": "1",
        "review_title": "Why even make this movie ?",
        "review_detailed_main": "Most of Netflix movies are pure garbage and this one is the same it's extremely derivative and has been done at least a few dozen times before and it wasn't interesting or new and it did not."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kaintrust",
        "review_rating": "",
        "review_title": "being predictable is not the worst thing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "adamgm",
        "review_rating": "6",
        "review_title": "Not to bad",
        "review_detailed_main": "Actually quite a good movie, it's pretty well acted and has a nice twist in it. Even if you can see it coming it's still a good twist. Definitely Worth watching if you have Netflix."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "patherwill",
        "review_rating": "3",
        "review_title": "Too many holes and loose ends",
        "review_detailed_main": "From the off nothing in this movie was as it seemed and it wasn't long before I was picking it to pieces. OK, the idea to keep up the excitement in a film is very often brought about when the protaganists DON'T DO what people would usually do in any given situation but in this I don't know why there was so much emphasis put on the fact there was a gun kept for security. Why not given their location, I'd keep half a dozen! Why keep entering the office and searching when the window gives away the light? Why do people nosing around and searching ALWAYS leave tell-tale doors open when they CAN be opened from inside? Why confront rather than try to placate the movies nutjob? Logan Marshall-Green was pretty reasonable not so Freida Pinto but they can ONLY DO a certain amount with what they are given."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Lee4490",
        "review_rating": "7",
        "review_title": "Actually a decent thriller",
        "review_detailed_main": "Can't understand the negative reviews, the films not a masterpiece by any stretch of the imagination but it's definitely not trash or a 1 star movie.\n\nGive it a chance it's a solid suspenseful thriller.\n\nGreat acting by both leads."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "divadyn",
        "review_rating": "1",
        "review_title": "Could it be worse??",
        "review_detailed_main": "Lots of comments on how utterly lame this movie is. I heartily agree, but what I found to be the stupidist thing was the \"heroine\" decides to go snooping around during a party where she will surely be missed, turns on the light in the office so it's clear she's in there, and then it takes a looong time for demon hubby to catch up to her.\n\nReally, miss this film. Shame on you, Netflix."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Pipacs40",
        "review_rating": "7",
        "review_title": "A great thriller.",
        "review_detailed_main": "I do not understand the many complainers. They should only watch abstract films, where they can shine their intelligence. This is an hour and a half long, relaxing, highly entertaining thriller with two great actors. For me, 7/10."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jonl-19162",
        "review_rating": "1",
        "review_title": "PREDICTABLE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bradley-53701",
        "review_rating": "8",
        "review_title": "Home invasion with a twist.",
        "review_detailed_main": "Good movie. I enjoyed it and not understanding the bad reviews. Good acting, great cinematography. Great watch! Good directing. It was a home invasion with a twist. I liked that."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "salimsaoun",
        "review_rating": "6",
        "review_title": "Good one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "RobTheWatcher",
        "review_rating": "5",
        "review_title": "Bad but could've been way worse",
        "review_detailed_main": "As far as Netflix films go.. this could've been worse honestly. It was very obvious how it was going to end from the second it started but regardless it was a decent watch."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "KittyG26",
        "review_rating": "4",
        "review_title": "Predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Top_Dawg_Critic",
        "review_rating": "6",
        "review_title": "A decent one-time watch.",
        "review_detailed_main": "It's a B film with mostly unknown filmmakers and actors. The directing and cinematography were spot-on, as was the score, especially for a B film, where it's usually unfitting, overbearing and constant. The setting and landscapes are breathtaking and the director did a great job portraying those features. Even the casting and performances were very convincing, I'd even say impressive. The normally comfortable 92 min runtime did however feel much longer with the slow pacing and lack of any real engaging narrative. Thus the issue here was mainly a story that sets up nicely, but has a few plot holes and unconvincing logic-defying scenes, and fails to really deliver much on the thrills with any sort of bang, except maybe towards the climax of the film, which is pretty much predictable. Nevertheless, a decent and one of the better B films I've seen in a while, and fairly enjoyable for a one-time watch if you have nothing better to see."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "alfredojramonm",
        "review_rating": "1",
        "review_title": "Totally Predictable",
        "review_detailed_main": "I dare you to find a more predictable movie than Intrusion, you can easilly figure it out during the first 20 minutes."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "anuity",
        "review_rating": "7",
        "review_title": "Once again... IGNORE THE NEGATIVE REVIEWS",
        "review_detailed_main": "Come on people.... This is a solid psychological thriller. Minimal content and has some good suspense. Yes, it may be a bit predictable but a worthy effort! Be reasonable!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "pjkblue-35926",
        "review_rating": "1",
        "review_title": "GAG ME!",
        "review_detailed_main": "This was so bad that the best acting was the crazed, barking dog."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ltm360",
        "review_rating": "6",
        "review_title": "terrible script and directing but enjoyable",
        "review_detailed_main": "One of those films that's so bad that you can really enjoy it on a rainy Sunday!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "nogodnomasters",
        "review_rating": "4",
        "review_title": "What are you?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "AnnaPagrati",
        "review_rating": "10",
        "review_title": "So good!",
        "review_detailed_main": "I loved this movie! It had just the right amount of plot twists and fun story line! The actors were great, and I loved all the symbolism in it! It's a 10/10!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ts-0000",
        "review_rating": "",
        "review_title": "Was ok..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "leesimon-26357",
        "review_rating": "7",
        "review_title": "Not as completely predictable as people say",
        "review_detailed_main": "The reviews that say they predicted this in the first 5 minutes are liars, as the characters haven't all even been introduced at that point. Now 30 minutes in, sure. You pretty much know what's up. However, the motives are a new twist rarely seen before. \"I decide when\" is very, very chilling.\n\nThe acting isn't terrible, and the sets are definitely amazing. Neflix sure does love its rotating shots, which was a little lame, and they definitely went full cheese-ball for the ending. But not less than 5 stars for sure. It's tense, and a little thrilling throughout.\n\nI probably won't see it again though. It's pretty 'bleh' once you know for sure what's going on."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jkhcs",
        "review_rating": "3",
        "review_title": "A \"psychological thriller\" that is neither psychological nor thrilling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Bruindude2",
        "review_rating": "3",
        "review_title": "Bad script, acting, directing = MISS IT",
        "review_detailed_main": "Cheap feel thriller with bad acting and transparent script makes you wish you didn't dedicate a night to watch. You know how it plays out with all the bad foreshadowing by a cast that should only star in straight to rental type movies.\n\nNetflix should stick to other genres as this movie SUCKED!!!!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sanjubhat",
        "review_rating": "7",
        "review_title": "A ok ok one time watch.. predictable!!",
        "review_detailed_main": "#sanjuzzreviews Intrusion is a psychological thriller ... A husband and wife staying in a remote house. The house get burgled one day . But are the burglars really the bad guys or is there something sinister afoot.\n\nA decent onetime watch but predictable. The house looks like it has been placed there by VFX . No CcTvs in the remote house .. generator placed where any Tom, Dick and Harry can access it. Seriously !! Some of the loose ends in the plot.\n\nWatch it on a lazy Sunday afternoon of u hv nothing else to do.\n\n2.5/5 ... Adios🙂"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sindyraudales-19305",
        "review_rating": "5",
        "review_title": "Lackluster, Predictable, mediocre at best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "karenbutnotakaren",
        "review_rating": "6",
        "review_title": "Better than expected",
        "review_detailed_main": "An entertaining, easy 90 minute watch with a bit of tension and jeopardy, and not nearly as predictable as I thought it would be from the blurb and the reviews.\n\nThe writers could have made the last 20 minutes work much harder, though. Following the 'big reveal' they could have done more interesting or unexpected things with the situation, and it felt like those final scenes should have been much more exciting in terms of both action and interaction between the characters. Instead it was kind of flat and underwhelming - and after all the slow build up seemed to be over in a flash.\n\nAll the actors did a good job and I'm surprised Freida Pinto is getting dragged for her performance, which I thought was nicely understated and fitted the character well. Overall it was a decent effort and I particularly liked the colour grade and production design, which contributed a lot to the chilly, slightly off-kilter feel."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sbaror",
        "review_rating": "2",
        "review_title": "How much was the script writer paid?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tudobien",
        "review_rating": "4",
        "review_title": "The title is more creative than the actual plot",
        "review_detailed_main": "The idea of a home invasion leading to intrusive thoughts about if the event had something to do with the protagonist's husband sounds clever, but what follows is entirely predictable and has no more depth or twists to keep things interesting. The suspenseful moments were in fact, well done and will make you jump, or sit on the edge of your seat. Sadly though, a lot of the suspense is caused by the characters making nonsensical/borderline stupid decisions when they find themselves in dangerous situations. From the very beginning, you'll have a suspicion about what is going on, and sadly, everything is exactly as it appears and as such there's little to no surprise or intrigue throughout. Overall, this film was not the worst thing I've ever seen, but I would recommend many other movies over this one if given the choice."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mansoorrana82",
        "review_rating": "8",
        "review_title": "I don't know what y'all are talking about.",
        "review_detailed_main": "It's a good movie. Nice suspense thriller. Sure if you are watching a movie to disect it, you will find flaws. Anywho for me it was a nice watch 🙂. ,........."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rameesahhussain",
        "review_rating": "6",
        "review_title": "It was going so well...",
        "review_detailed_main": "They have a beautiful house however , the storyline was alright until the end had to ruin it . Like what was even that ? It just made me ask my self so many questions about what happened next . It was kind of disappointing . Don't get me wrong the story line was great but the ending was just not it ."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "lisainstyle",
        "review_rating": "4",
        "review_title": "No chemistry here",
        "review_detailed_main": "There is no chemistry between the two main characters and there are very few other characters so that makes a difference here.\n\nI knew what was going to happen within 5 minutes. Don't waste your time."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "facundonibrum",
        "review_rating": "1",
        "review_title": "Avoid at all cost...",
        "review_detailed_main": "Since the first minute of the movie, you know what's going to happen. I only log-in just to say that you should avoid this s**** film. One of the worst movies I've ever seen in my entire life. Poor acting and inexistent plot-twists, nothing more to say. 1/10."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "avbcole",
        "review_rating": "7",
        "review_title": "Good watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "boudreauxtroy",
        "review_rating": "2",
        "review_title": "Kinda Ridiculous",
        "review_detailed_main": "This was just not good. At all. Every scene was as predictable as they come. Direction was amateurish, the characters were unidimensional to the point of cliché, the dialogue was unnatural and the plot \"twists\" were telegraphed from miles away. I didn't find one single original idea in this film. Come to think about it, there wasn't even a well-executed old idea. At times, I laughed out loud (this is NOT a comedy). Mostly, I groaned. They really phoned this one in.\n\nIf anyone has wondered whether or not it's true that the new Hollywood is becoming a \"streaming content farm\", this would be a perfect example that it is."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "alicebilotta",
        "review_rating": "7",
        "review_title": "Not bad at all!",
        "review_detailed_main": "Despite what most reviews say, I found this movie quite enjoyable. If you're looking for a thriller that will keep you glued to the screen for a hour and a half, it will do for you. It's not a masterpiece of course, and the plot twist is vaguely predictable, but still this movie seems perfect for a lazy night :)"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "danniyalfiaz",
        "review_rating": "1",
        "review_title": "Trash acting by the female lead",
        "review_detailed_main": "It was one of the worst movies I have seen so far. The lead actress being a therapist acts so dumb, that one feels more sympathy for the villan, movie could have been made better if the actor acted accordingly and worst of all we never get to know why and what was the plot in the end . 1 star movie hands down."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "deloudelouvain",
        "review_rating": "7",
        "review_title": "Better than I expected.",
        "review_detailed_main": "Considering the low ratings this movie got I wasn't expecting much from Intrusion but it turned out to be quite entertaining. Even though it was pretty obvious from the start what was going on I still enjoyed the movie. The acting from the small cast was not bad at all, quite good I thought. As for the cinematography it was good as well. Nice camerawork in some scenes, a soundtrack that was well chosen, certainly in the more suspenseful scenes. In short I wouldn't pay too much attention to the low rating and give this movie a shot, certainly if you're a fan of mystery and suspense although the mystery was minor in this case."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "danamcintyre",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cali30405",
        "review_rating": "10",
        "review_title": "LOVED IT",
        "review_detailed_main": "Great thriller, slick and intense, a strong film from start to finish."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "irishwolfie58",
        "review_rating": "6",
        "review_title": "Worth a watch!",
        "review_detailed_main": "The plot keeps you guessing most of the movie,(you know, but not quite) & the 2 main characters are riveting. As actors, I couldn't take my eyes off the screen."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "shenika-82860",
        "review_rating": "1",
        "review_title": "Hard to Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "LincolnSixEko",
        "review_rating": "1",
        "review_title": "Yet another Netflix dumpster fire.",
        "review_detailed_main": "The story is complete Lifetime movie drivel and the lead actress shows zero emotions. Just avoid this at all costs, it's terrible."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Lizlynn_1111",
        "review_rating": "6",
        "review_title": "Entertaining thriller!",
        "review_detailed_main": "The plot is a typical TV thriller, nothing really new. The mystery also isn't very mysterious. The way the movie plays out and the acting is what made it better. The actress playing \"Meera\" was believable and likable. Logan Marshall- Green as the husband \"Henry\" is great, I've seen him in several different things and he's always does a great job. Overall, the movie kept me interested and entertained."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "maryraymond123",
        "review_rating": "3",
        "review_title": "stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "luanasibien",
        "review_rating": "6",
        "review_title": "Watchable",
        "review_detailed_main": "People are being very harsh, the movie ain't that bad. Is illogical and predictable, but still can kill some time without making you feel you wasted it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "chad-61313",
        "review_rating": "1",
        "review_title": "No no no",
        "review_detailed_main": "I'd rather watch a bunch of turtles race around Daytona. Unbelievable, extremely predictable, and the lead female actress is a very pretty woman, but I think she'd be better off doing commercials. Lead male actor did a good job, just wish the writers would've given him a better character profile. Hard to believe he's a full-bred killer and she suddenly turns into Sherlock Holmes."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "davidccooke-78715",
        "review_rating": "7",
        "review_title": "Predictable yes, but still pretty good!",
        "review_detailed_main": "I would actually give this movie about 6.5, but I'm rounding up to help balance the ridiculous people who give it a 1. I'm not sure why some people are so extreme when rating movies. A movie does not have to come up with a totally brand new idea to be entertaining. Yes, This movie is fairly predictable and uses plot ideas that have already been used. But it is suspenseful and fairly well acted. Like most movies, it is not a 10, but it is definitely not a 1 either.\n\nLet's face it, there are only so many general story ideas that one can use for a movie. There are bound to be similarities as more and more movies are made. But if it is an entertaining version of the story, it's still worth watching. And this one is."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tariqzafar-12020",
        "review_rating": "5",
        "review_title": "Nothing new here",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "chattopadhyaysabyasachi6",
        "review_rating": "8",
        "review_title": "It was a decent thriller",
        "review_detailed_main": "I think we knew what was going to happen at the end of the movie . I agree, the ending is cliché. The thing I liked was presentation . Credit goes to the director and logan-marshall-green. I watched many films of Logan, this one probably one of the role where he could show his acting capability more . I did not like Freida\"s acting that much but Logan's acting skill and director Adam Salky's beautiful direction made this thriller watchable. The back ground music was not bad too!\n\n8/10 from me ."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bernardaquina",
        "review_rating": "6",
        "review_title": "Nicely staged and acted but predictable",
        "review_detailed_main": "You know the deal, perfect house in the middle of know where, NM, perfect young couple, both working professionals living a seemingly idyllic life until one night all hell breaks loose. This Netflix movie is utterly predictable but still attention grabbing from beginning to end largely because the main actors are so engaging. You stay with it to see how it all comes crashing down because you know it will. Still, throughout this well acted and clean production, it's not hard to predict how it all turns out. The ending scene is still somewhat surprising. A passable warm-up for a double or triple header movie night."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cin_janssens",
        "review_rating": "3",
        "review_title": "Very predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "maggierugadza",
        "review_rating": "3",
        "review_title": "Weak female character",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "gunsz",
        "review_rating": "7",
        "review_title": "A good watch",
        "review_detailed_main": "Architectural aspects.\n\nBit different than usual movies."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "markblau-143-519517",
        "review_rating": "3",
        "review_title": "Been done before and before and before and before...",
        "review_detailed_main": "No way does a woman, a happily married wife, suddenly think her husband is up to something because he killed three intruders after being shot at by the intruders first. I really like LMG a lot but and both actors dis pretty well given the script that were given.\n\nI had to skip to the end to see from halfway in to see if I was right about the ending.\n\nExactly how I pegged it. Not worth watching unless you want to fall asleep."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Ingalilla",
        "review_rating": "6",
        "review_title": "Looks good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rafaking92",
        "review_rating": "2",
        "review_title": "It's so bad",
        "review_detailed_main": "The movie lacks so many things, it was incredibly difficult t watch, I was watching hoping it will get better but it got worse and worse..... lack of story, predictable from the beginning to the end.... I definitely DO NOT RECOMMEND."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "j0hn22",
        "review_rating": "7",
        "review_title": "Just a nice movie",
        "review_detailed_main": "The plot of the movie was basic, but I really like home invasion movies. So, I watched the movie! Eventually, the plot of the movie has nothing to do with the storyline of the movie. The storyline was kinda well-written and gladly, there weren't many plot holes. The filming location of the movie was good. Actually, the house was the best part of the movie, it was AMAZING. The characters weren't very interesting, but they were very well-developed. Overall, it was a kinda intense movie, especially the home invasion scene. It wasn't a scary movie and the kills were kinda boring. The plot twist wasn't very unexpected, because many things were \"revealed\" during the movie. The ending scene was kinda intense and I liked it. In my opinion, it was just an average film, but it's watchable."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kmwehri",
        "review_rating": "2",
        "review_title": "Predictably frustrating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "danrocks01",
        "review_rating": "8",
        "review_title": "I liked it",
        "review_detailed_main": "I don't understand the 1* reviews , the story was really good. It's quite predictable but lots of jumpy moments and builds tension well."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bellkendra-09994",
        "review_rating": "7",
        "review_title": "Nevermind the Haters...",
        "review_detailed_main": "This was better than expected. Make your own mind up."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "hjxykwds",
        "review_rating": "1",
        "review_title": "SAVE YOUR TIME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "patricia2009",
        "review_rating": "2",
        "review_title": "Most Predictable Movie to Ever Exist",
        "review_detailed_main": "I just read a review below saying they did not expect the twist at the end. Like are you serious? This has probably been the most predictable movie I've ever seen. My boyfriend and I guessed the entire story literally in the first 20 minutes. There was NO twist. Any person would have guessed what was happening. Also what was up with Pinto's acting in this movie? It was horrible. The entire time I was mad at how dumb her character was."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bethjazotte-60931",
        "review_rating": "6",
        "review_title": "If you're not expecting something amazing",
        "review_detailed_main": "Novo filme de suspense no Netflix. É bem feito, vale a pena pra passar a tarde. Eu achei previsível, mas ainda assim recomendo (está meio dificil encontrar filmes novos pra assistir). Na Netflix. New thriller movie on Netflix. It's well executed, enough to spend some time in your afternoon. I thought it was predictable, but I still recommend it (it's kind of hard to find new movies to watch). On Netflix. #movieslover #netflix."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mgitts1977",
        "review_rating": "2",
        "review_title": "Utter and complete tripe",
        "review_detailed_main": "When I saw the starring actors I was so hopeful, but what I watched dashed the high hopes I had for this film.\n\nThe writing was bad, the storyline was predictable and done so many times before; and I won't even touch the acting because the stars have been capable of so much better in the past. They could've done so much more with this, but disappointing doesn't even come close. Please do not waste an hour and 33 mins of your life on this movie... Please."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mroseberryis",
        "review_rating": "6",
        "review_title": "Interesting",
        "review_detailed_main": "I enjoyed it ....I think it's worth the time to watch ."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "MoviesforRelaxation",
        "review_rating": "3",
        "review_title": "Predictable.",
        "review_detailed_main": "So the cinematography was great. Nice camera work. The characters were fully developed. The one thing that I could not get over was the actions of the female main character (Meera). She made so many bad choices in the film that made me scratch my head in awe. Also, her character was very one dimensional and very spaced out. At times I thought wow I could have played this role. They could have given her more depth. Additionally the two main characters were just oddly cast. They didn't mesh well together.\n\nBefore the film was halfway through it was predictable. I predicted the plot 100% so that was kind of disappointing. Had Meera not made the decisions that she made the plot could have been more thrilling, more exciting.\n\nOverall it was a decent film but had potential to be much, much better. The plot could have included more layers/depth to it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "flowerstardust1979",
        "review_rating": "6",
        "review_title": "Better Than These Reviews Led Me To Believe!",
        "review_detailed_main": "It wasn't anything amazing but it was a better time passer than I imagined after seeing so many negative reviews. Yes I kind of guessed the twist 10 minutes before the reveal but it was an enjoyable mystery thriller. Better than a few recent Netflix thrillers though not going to be memorable. Interesting time passer."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "burakagus-51897",
        "review_rating": "2",
        "review_title": "Waste of my time",
        "review_detailed_main": "If I had to cut down half a point each time something unlogical happens just for the sake of scenario, this movie would get -100 points from me."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "JamesRutland",
        "review_rating": "9",
        "review_title": "Amazing thriller and interpretation as well.",
        "review_detailed_main": "I've appreciate the show above all in the dialogues and interpretation. Logan Marshall-Green deserves 3 Oscar for its astonishing interpretation of the character. Every movement of his face is a way to reveal the nature of it. Excellent of interpretation of Freida Pinto too. Very spontaneous and natural."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ShakeMidz",
        "review_rating": "6",
        "review_title": "Shake's Take: 5.5/10",
        "review_detailed_main": "I decided to round up to be nice but I'd give this a 5.5. The storyline was solid, predictable but also interesting. The acting was pretty bad which is why this score is lower than it could be. Overall this was just a pretty mediocre movie.\n\nWould I watch it again? No."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "gurumaggie",
        "review_rating": "2",
        "review_title": "Time I won't get back again....",
        "review_detailed_main": "It's not good enough to be bad or bad enough to be terrible, if beige was a film this would be it, two good actors wasted in a hallmark vanilla mess."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "trimblair",
        "review_rating": "1",
        "review_title": "Swing and a miss",
        "review_detailed_main": "From a director who has only done gay films comes an anti-gun, white guilt film with a lead who makes awful decisions at every turn. No \"ah-ha\" moment. No redeeming twist. Just boredom and silly broken agenda. Do anything else but watch this."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mugsyagain",
        "review_rating": "7",
        "review_title": "Film was better than the acting",
        "review_detailed_main": "I watched this after watching Don't Look Up and I know they are totally different films but this was far better!!!!!\n\nPredictable in parts but then most thrillers nowadays are!\n\nWortha watch though!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "annependleton",
        "review_rating": "1",
        "review_title": "Diabolically awful.",
        "review_detailed_main": "Absolute rubbish. How do films like this even get the go-ahead. Avoid at all costs."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jordondave-28085",
        "review_rating": "6",
        "review_title": "It has it's moments",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Guanche48",
        "review_rating": "4",
        "review_title": "ay ay ay ay",
        "review_detailed_main": "At 40 minutes I stopped watching the movie, but ... curiosity won and I saw it all.\n\nA very bad movie starring a couple without any chemistry, it seems that they do not even know each other after 12 years of marriage, and how boring they are!!, there is no dance, music, normal dialoges... ... very bad acting and the movie is very predictable in all the senses. That yes, I saw it all because it started to get exciting and I do not regret it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sharanjohn",
        "review_rating": "6",
        "review_title": "Good Physo thriller Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sheleena-79986",
        "review_rating": "2",
        "review_title": "Bad Casting...so Meh.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "krystal-29906",
        "review_rating": "8",
        "review_title": "Entertaining at least",
        "review_detailed_main": "Intrusion. The story of a woman who has no common sense or sense of self preservation.\n\nLook, the acting is bad, save for maybe Freida Pinto; the plot is predictable, you can guess pretty much 20 minutes in what the big twist is; and the main character makes nothing but one stupid decision after another. Yet it was still very entertaining,which is the whole point of movies. It kept me involved and at times I was literally yelling at my computer screen (as in what are you thinking?!). Not a film I'll watch again but nevertheless not a complete waste of time either."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "frances_farmer0",
        "review_rating": "7",
        "review_title": "I enjoyed it..",
        "review_detailed_main": "I don't understand some of the hate towards this one. The only real negative part about it, is that it's very predictable. Other than that, it's a good movie, and certainly doesn't deserve a rating lower than a 5. I mean.. giving this a ONE? Have you ever even seen an ACTUAL bad movie? The acting was great (Logan Marshall-Green is always awesome), and it held my interest."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "akilaek",
        "review_rating": "2",
        "review_title": "Plot is too obvious",
        "review_detailed_main": "Just dont watch it! The plot is way too obvious! Anybody can guess what is goin to happen in the midway. No big twists or turns."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mohitaggarwalacn",
        "review_rating": "4",
        "review_title": "Indians are not this daring lol",
        "review_detailed_main": "The actress goes about snooping around. So unlike us Indians....we literally run away at the sounf of danger...and she takes it head on....bad story lol."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "calicut110",
        "review_rating": "6",
        "review_title": "These reviews are very unfair",
        "review_detailed_main": "This movie reminds me a lot of Gothika with Halle berry. The low 5.2 rating doesn't do this movie justice. The lead actress is incredible and the plot is engaging. It's true there is nothing original but if we judge the movie on its own merit it should be at least a 6.0."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "millordrak",
        "review_rating": "3",
        "review_title": "Like a bad lifetime movie",
        "review_detailed_main": "This movie's plot is full of holes. The married couple's relationship seems fake & the acting is terrible, especially the husband. The only good thing about this movie is there's no annoying music unlike most movies these days. If you like bad lifetime movies you'll like this."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "xxmisssvxx",
        "review_rating": "6",
        "review_title": "I give it credit despite its flaws...",
        "review_detailed_main": "This film....okay, there are elements that could have been better executed, but it's not bad overall. It's a psychological thriller that starts off slow and picks up only to a certain point as the film goes on. In better terms, the film tries to deliver but falls short while still being decent.\n\nWhen watching any psychological thrillers, understand this genre is either good, bad, or a combination of the two depending on the plot/storyline/execution. For this film, I give it a C+ because it does have some flaws that could've been improved during production for a stronger delivery, but is still decent enough to watch.\n\nIf you stumble upon this and find yourself curious, just watch it. It can hold your attention if you go into without expectations.\n\nEnjoy."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kwenchow",
        "review_rating": "1",
        "review_title": "Another worst film! Full of boring conversation, and annoying overuse scene! Not recommended!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "saulyte12",
        "review_rating": "6",
        "review_title": "Simple but still not poor",
        "review_detailed_main": "A simple but not bad thriller. Suspenseful atmosphere, mesmerising visuals, modern interiors and Alex Heffes' haunting music will satisfy the tastes of the most discerning art house aesthetes. I've added a composer to my play list.\n\nThe film's plot and action equilibristics reminded me of legendary thrillers of 90s. I liked the screenwriter's irony of the Gestaltists. They are capable of rescuing unoriented, helpless girls. But they are powerless to see the strong dark rooms of the abusers and are easily manipulated.\n\nThere is a lot of irony in other details too. It turns out that the head of the family is now the one who controls the home alarm panel. In the past, it was the TV remoter as more important stick of power :))) .\n\nI have downgraded the rating. It's already clear from the beginning who is guilty and what will happen. The film evoked a lot of strong emotions, and undermined classic fears. Thanks to a team of talented filmmakers."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "OneAnjel",
        "review_rating": "5",
        "review_title": "Decent storyline, lacks hutzpah",
        "review_detailed_main": "The premise of this film is actually good, although not novel. The filmography was decent, the sound and music were good. But the character of Meera lacked emotion and I was surprised to see Freida Pinto is actually not that new to the film industry. She began as a model in India and, honestly, looks more like she thinks she's still modeling here. There seems to be almost no lead-up to the level of distrust the audience is shown after a few vague clues. I felt there should have been something more clever about how we are to associate with what Meera is going through. It felt almost sterile. Yet after her sudden and intense suspicion, Henry is able to allay her concerns with an obviously deceptive story and they go about making plans for the big housewarming. This could have been a much better film but it was not a bad watch as is. To everyone saying what a great house it is -- I'm sorry, but that has to be one of the most bleak structures I've ever seen. Looks like the headquarter building for a prison, at least from the outside. The director had wanted to set this film in the woods using a cabin in an eastern state but couldn't do so because of the Covid plandemic. I think this house actually worked better. Also, this film was made using social distancing and the gambit, so that might explain some of the odd situational shots and lack of human interaction. In that sense, they pulled it off pretty well."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "corruptcopstalkingme",
        "review_rating": "10",
        "review_title": "Victims of Psychiatry will rejoice in this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rojrung",
        "review_rating": "6",
        "review_title": "Not a single twist, So straight like uncooked spaghettis in plastic bag",
        "review_detailed_main": "So simple plot, it could be fit on half of an a4 paper. After 30mins you can predict how will it end, and it ended just like that. The sound of pipe is too obviously annoying, Meera leave almost every single clue she found to Henry, she leaves every single door open, every single light on, GPS phone with her all the time, tape still on camera and leave on the desk, on car unlock. Take his USB with her like she forgot that she should keep it secrets like email out or sent to phone and keep USB at the same desk etc. You name it, she will leave it for you. When she so dump, we don't want to sheers her when bed situations happen. Anyway still not a bad movie, but next time cast someone more sexy and it's going to be a lot betters."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "zjwen",
        "review_rating": "1",
        "review_title": "My cat can write better",
        "review_detailed_main": "I started to write a review, but then realised it would be a bit less of a waste of time than this movie.\n\nGo ahead and watch it. It will never be better than the first 5 minutes. What you do with this information is upto you."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sku-43549",
        "review_rating": "1",
        "review_title": "Utter Drivel",
        "review_detailed_main": "It's nonsensical twaddle. The things that happen are ridiculous. No-one in real life would behave as the female lead in this film does. And who told her she could act?"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rfsn",
        "review_rating": "6",
        "review_title": "Mixed bag of excitment and frustration",
        "review_detailed_main": "This is one of those psycho-husband thrillers where the guy could have been kept completely clueless right up to the point of the police showing up. If only the wife/heroine had managed to be less risc-taking. Not taking things for granted, better at covering her tracks, and carefully thinking things through before doing things. And by doing that: completely bypassing her husband's increased suspicions.\n\nBut then again; it wouldn't had been this reasonably exciting thriller - although somewhat predictable. I give it a six out ten.\n\nSomewhat predictable) exciting thriller. I give it a five out of ten."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Shock-UK",
        "review_rating": "5",
        "review_title": "It's all rather predictable",
        "review_detailed_main": "It's ok, Nothing special.\n\nThe plot starts unrevealing after about 15 mins in.\n\nCould have been better."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jeromesgabilo",
        "review_rating": "7",
        "review_title": "A THRILLING AND OFTEN CONFUSING RIDE",
        "review_detailed_main": "Although I msut say that it was suspenseful, watching along there may be more questions asked than answered. I think Logan Marshall-Green was believable, but some scenes do not really fit well into the overall picture (but some are on-point, too)."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jkt2006",
        "review_rating": "4",
        "review_title": "Netflix trash!!",
        "review_detailed_main": "Why is it that Netflix comes up with.some awesome stuff to be followed by trash like this. It's clear that some Netflix originals are nothing but movies that nobody wanted to pick up for distribution or even for streaming which Netflix does at cheap prices. Frida Pinto does an excellent job as the main lead, cinematographer does his best but nothing can save the bad story, script and the predictive outcome. It was a total waste of time waiting for something to happen. Just stick to Quality Netflix. You do not have to dole out new content everyday, give us quality! Look around at Amazon's selection of content, Disney, HBO and learn. Thanks in advance!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bluepink",
        "review_rating": "6",
        "review_title": "Engaging",
        "review_detailed_main": "I almost didn't watch this because of the negative reviews, but I really enjoyed this. The beginning's a bit slow, but it picks up quickly. And it's not the standard home invasion movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "karinahatem",
        "review_rating": "3",
        "review_title": "Another failed attempt by Netflix",
        "review_detailed_main": "Poor performance, very predictable and same old boring story."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "walshj-01468",
        "review_rating": "8",
        "review_title": "Enjoyable thriller",
        "review_detailed_main": "We enjoyed watching this, quick pace, good twist and keeps you interested through out, solid 8/10 and well worth a watch."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "herrick416",
        "review_rating": "6",
        "review_title": "About as subtle as a sledgehammer....",
        "review_detailed_main": "A film of only 90 minutes, 85 of which I spent adjusting the volume or jumping out of my skin (or back into it). It did keep my attention short of the last few moments when I realized that a reviewer's reference to a last minute twist was more what I'd consider an attempt at irony. I don't recommend watching this when someone's trying to sleep nearby for reasons stated above. Neither a new slant on an old theme nor an old slant on a new one, but as predictable and kind of corny as it is, I kept watching which means it engaged me. There were glimpses at real talent, dynamic cinematography and architecture amidst an ocean of technical overuses noted specifically and with such good wit by an earlier reviewer that I needn't elaborate. Not yet on a par with what LMM puts out as 'new' yet heading in a direction that Netflix has already shown it's capable of far more."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ejayne-33254",
        "review_rating": "1",
        "review_title": "BORING!",
        "review_detailed_main": "All I can say is don't bother. Figured out the plot the plot pretty quickly."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "solomonjp",
        "review_rating": "1",
        "review_title": "Just rubbish",
        "review_detailed_main": "I barely to watch 20 mins of this movie. The script 0/10, Acting, 0/10, editing 0/10, Direction 0/10.\n\nThis is not s story to be told in 2021...\n\nA wasted investment...."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jadenjessup",
        "review_rating": "7",
        "review_title": "Recommend",
        "review_detailed_main": "Great movie. Could have more character depth but for a 90 minute movies it was great and did not feel rushed. The movie is very suspenseful and will keep you at the edge of your seat yelling at the tv for most of the movie with great acting. Worth the watch in my opinion."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ahmedlaithy22",
        "review_rating": "3",
        "review_title": "ridiculous",
        "review_detailed_main": "It's ridiculous, what Netflix does is ridiculous, it tells us an entire movie about a man who committed a crime without explaining his motives for doing it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "egolessmusic",
        "review_rating": "3",
        "review_title": "Yep, completely predictable...",
        "review_detailed_main": "The director failed miserably to make this movie even remotely mysterious. After the burglar scene, particularly the end of it, which is basically the beginning of the movie it was clear what's going on. The characters are so shallow it was easy to predict who the bad guy was. I was hoping all that was on purpose to mislead the viewers, but nope... Pathetic twist...\n\nPathetic twist..."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "prbessette",
        "review_rating": "1",
        "review_title": "Oh yes do! Do believe the awful reviews!",
        "review_detailed_main": "It's such a train wreck, if you start and can see the end within ten minutes you'll only keep watching for the same reasons you would watch a train wreck! For whatever weird reason you sometimes can't stop yourself or maybe you're a glass half full type and have some faint hope it'll pull itself together, it doesn't. And don't confuse great cinematography with a great house. It's an interesting home, nowhere near where they say it is unless Massachusetts is near a desert. There's no eye candy, there's no reason to believe that this marriage has survived 12 years without her guessing something strange is up with hubby, there's no reason to believe they're a couple at all actually. No questions, well I think there's a total of 3, are answered, mainly because they really aren't questions, certainly not provocative ones, not even enough for the local one good casting choice, the head detective, to pursue investigating .You know that kind of breathless faint shock you have when a bad movie suddenly ends and you get that you actually did watch what you just watched? That's the prize here. You're reward for either ignoring or not believing user reviews. Or thinking that the two ridiculously good ones are actually written by wiser souls who really get the depth we all missed and you buy it, knowing you are one of those kinds of above average movie watchers. I am, and trust me, they couldn't be more wrong. There's far too many good viewing opportunities to be wasting your time on this kind of absolute drivel."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kjxbvyc",
        "review_rating": "9",
        "review_title": "Great Thriller!",
        "review_detailed_main": "Don't let negative reviews turn you away from this movie. Not all is \"predictable.\" A Good movie for a not-so-popular actor & actress. You do not know exactly what is coming up & even if you guess.....you STILL do not have a clue about the depth of the twist and turns to come. Put on your PJs.....pop the movie double-butter popcorn & eat some raisinets. Watch it!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "dajsha",
        "review_rating": "3",
        "review_title": "Over hyped.",
        "review_detailed_main": "This movie is VERY predictable. The woman annoyed me. The \"acting\" or whatever they want to call it, is very bad. To much information/ background is left out of this movie, should have kept this one in the notes, I would have been better off with never seeing it. The way others make it seem, it is really not that good IMO."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "alexandrakriley",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "Without giving anything away, the acting was terrible, the script was poor...the idea could have been a hit, very poor indeed!!!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "oluuukaa",
        "review_rating": "3",
        "review_title": "Makes no sense at all",
        "review_detailed_main": "Disappointed, as always, by Netflix production. How in the world they choose this stupid weak story?"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "pacocharte",
        "review_rating": "3",
        "review_title": "In this day and age completely predictable",
        "review_detailed_main": "Let me just say that I already figured this out within about 25 minutes of it starting. That's not me bragging; that's Netflix glomming onto a variation of an age-old script that used to be jarring and original.\n\nJust a way to pass 1.5 hours of time, and I'm sure some viewers under the age of 13 will love it. But there are better films out there that explore this theme far more effectively and interestingly.\n\nJust not worth your time at all unless you're 12 (and I say this in good faith) and want to watch something different."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "j_petrohilos",
        "review_rating": "4",
        "review_title": "Not horrible... just predictable",
        "review_detailed_main": "Watchable... just so predictable... after the first minute of the film you'll be able guess what happens in the rest of it..."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jacekpoplawski",
        "review_rating": "1",
        "review_title": "terrible",
        "review_detailed_main": "I wonder why exactly Netflix assumed I would like this movie.\n\n1) toxic masculinity bad 2) white straight male bad 3) plot not needed 4) surprises not needed\n\nReviews are mixed but scores are high, bad movies are standard now, welcome in 2021."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "imdbdavinci",
        "review_rating": "1",
        "review_title": "Better watch block buster for the 27th time",
        "review_detailed_main": "After the first 10 minutes watching I was already asking myself if I should continue watching.\n\nAfter 15 minutes I paused the viewing, and looked at the reviews.\n\nThat just confirmed my thinking of a waste of time watching this movie.\n\nI better watch Airplane, or The Naked Gun for the 27th time.\n\nI cannot just predict what scene is coming, I know it exactly, but it still fun to watch.\n\nIntrusion falls under the category worthless and don't bother."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "snigdha-dk50",
        "review_rating": "1",
        "review_title": "What is this movie?",
        "review_detailed_main": "Done a hundred times. Done better each of those times! It's predictable from the beginning. There's absolutely no plot. The police are just a couple of extra actors they had who have no role to play in the actual movie. Freida Pinto can't act. Just the absolute worst thing I've watched in a while."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "contact-125-651146",
        "review_rating": "4",
        "review_title": "Extremely Predictable",
        "review_detailed_main": "With 20 minutes in the movie, I could figure out almost everything.\n\nTerrible performance if almost everybody.\n\nThe best of the movie, is the house.\n\nWaste of my time."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "paotun",
        "review_rating": "1",
        "review_title": "maybe with other actors...",
        "review_detailed_main": "It could have been not so bad, even with a very predictable plot already seen so many times, if they had chosen other actors.\n\nShe is undeniable pretty, but I'm sorry she simply can't act.\n\nHe maybe sometimes can give a good performance but in this role is a disaster.\n\nAnother Netflix content absolutely forgettable."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "davidjamesh32494",
        "review_rating": "8",
        "review_title": "Predictable but overall decent.",
        "review_detailed_main": "Won't say much to the movie itself but Logan Marshall-Green was incredible. Very engaging premise for a character that was otherwise squandered. Logan's acting skill shined even through the iffy dialogue."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kevinmclernon-83636",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": "So much potential but so full of holes! Terrible acting all round as well."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kellydenton",
        "review_rating": "3",
        "review_title": "Bad choice",
        "review_detailed_main": "I am so sad Freida Pinto chose to do this film. I am even more sad that I chose to watch it. It's only redeeming quality was the scenery. I recognize where parts of it was filmed.\n\nThriller? Hardly."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "wandernn1-81-683274",
        "review_rating": "2",
        "review_title": "Who Is Going To Take Care Of You???",
        "review_detailed_main": "Another cruddy husband is evildoer in disguise movie. When I watching I suddenly realized how much my hands smelled like dog. I guess I had gotten more involved in playing with my dog than watching this boring thing. It's just sad, with so many channels and platforms these days they just keep churning out time-wasting shiz like this.\n\n2/10."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "xvyerfuf",
        "review_rating": "3",
        "review_title": "Shnapps-Game",
        "review_detailed_main": "Schnapps game: whenever she says henry, drink a schnapps!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rmbragdon",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "Movie is a rehash and that would have been acceptable if the acting wasn't so unbelievably terrible. I actually laughed at a scene with Pinto in the car and she says, Henry...Henry! She is horrible!\n\nAs has been pointed out I could watch this on Lifetime and watch it for free. Please do better Netflix. You are dolling out tons of money on productions that are not worthy of the reputation you are aiming at."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jl1982",
        "review_rating": "8",
        "review_title": "Not sure why all the horrible reviews. It was entertaining!",
        "review_detailed_main": "I actually enjoyed this film and I'm glad I watched it without reading these reviews first. Makes me wonder what other gems I missed out on based on reviews. I thought the movie was entertaining and not as predictable as the negative reviews here make it seem. It's a good flick to enjoy with a date!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tallmuch-92-352073",
        "review_rating": "5",
        "review_title": "Borefest",
        "review_detailed_main": "Absolutely boring. Which is unacceptable for a thriller. No suspense where it should be. Well, decent production value is the only advantage of this movie. All other sides of it (directing, acting, cinematography. Etc.) are mediocre at best. I wouldn't said it is a bad movie but... Have I already said it? It's boring."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "the_wildhog",
        "review_rating": "3",
        "review_title": "Bland and forgetable",
        "review_detailed_main": "The acting was bad, really bad. Not that the actors can't act at all but there's more connection between 2 random strangers in a train station than the married couple. The subplots feel like they are an afterthought and the suporting actors are as active as a house plant. Good for yawns on a sleeples night."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jeroduptown",
        "review_rating": "5",
        "review_title": "Creepy Hubs",
        "review_detailed_main": "It's not a fresh idea, and the hubby obviously has some \"American Psycho\" tendencies from the get-go. But they build the discovery tension in a decent way. Those secret rooms always get found..."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jewils1",
        "review_rating": "1",
        "review_title": "Anti Smart Movie",
        "review_detailed_main": "I wouldn't put this movie on a bird cage floor it's that bad. Too many scenes where the wife makes stupid moves. Hard too believe they are supposed to be educated professionals. Good architecture on the house's design. Still doesn't help the movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "nikki-27902",
        "review_rating": "2",
        "review_title": "Princess and the frog!!",
        "review_detailed_main": "She would have never been with this jerk to begin with. He comes across as unattractive as he looks. No personality, no depth of character and predictable as the sky is blue. Yuk, yuk and more yuk!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "abarain",
        "review_rating": "8",
        "review_title": "Physco pathic thriller",
        "review_detailed_main": "It is quite similar to movie intruder but here the culprit lives within the house, good twisted thriller, young couples move to a new isolated home far from city inocent wife has no idea about her hands sinister motives that have jeopardized her life."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "camillanilssons",
        "review_rating": "1",
        "review_title": "Save your time. Sooo predictable!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bowlcoach-11358",
        "review_rating": "2",
        "review_title": "Terrible and Slow",
        "review_detailed_main": "The suspense is minimal until the very end and yet it is predictable. Would not suggest this movie to anyone. Low budget and very slow developing. A real waste of time for anyone wanting to watch a good thriller."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "NixieMovies",
        "review_rating": "2",
        "review_title": "Netflix, I want my money back",
        "review_detailed_main": "It is not a thriller... everything is flat (acting, script and direction), neither a mystery, from minute 10 you will predict the whole story, not a single twist.\n\nIt is another garbage production from Netflix, they just want to complete the quota of movies without any concern in quality."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "eac-89",
        "review_rating": "3",
        "review_title": "Very predictable right from the beginning",
        "review_detailed_main": "I just kept watching it till the end hoping the ending would prove me wrong so i was disappointed to be right actually.\n\nActing and atmosphere were fine but the storyline is overused. The twist is so predictable, you ask yourself that it cannot be that obvious but turns out it is.\n\nYou can still give the movie a chance if you are too bored and have nothing else to do though."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "AnnPanders",
        "review_rating": "1",
        "review_title": "Avoid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "j-bush-642-903619",
        "review_rating": "8",
        "review_title": "Not bad, watchable with competent acting",
        "review_detailed_main": "One of the things I judge the actors on is if I like, dislike or am irritated by the character they play. The female lead was irritating by the combination of her fear and snooping Nd the husbands just too perfect helpfulness. All the plots to all these storyline have been done the trick is how the story is told and the meat on the bones of the plot. This was OK. Some of the reviews are by overly critical snobs."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "collegeforall",
        "review_rating": "4",
        "review_title": "I can't believe I watched it all!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tkdlifemagazine",
        "review_rating": "5",
        "review_title": "Some Good Elements But....",
        "review_detailed_main": "Freida Pinto is awesome. She is the best part of this movie. It is a decent enough thriller about a couple with a difficult past that becomes the victim of several break ins in their luxury home. As the story unfolds it gets more complicated. The problem is that it is way too predictable. The acting and Direction are good. The cinematography is good. It is watchable, just not surprising enough, late enough to justify the time in. I would watch her in other things for sure. It is impressive that this came out during the lockdown and was probably one of the more interesting things to see on streaming."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "greg-hesp",
        "review_rating": "3",
        "review_title": "Predictable within the first 10 minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jd-97226",
        "review_rating": "5",
        "review_title": "OK for a lazy evening. Definitely no twists.",
        "review_detailed_main": "It's OK for whenever you don't read subtitles on an international film or don't feel like watching a film based in a true story. However, don't look for twists here; whatever you think it's going to happen, it will. My wife got the broken pipes and I got the location way before it was supposed to be a twist."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ron-02777",
        "review_rating": "3",
        "review_title": "Lost interest",
        "review_detailed_main": "So, supposed to be a home invasion, halfway through, got off the track."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rhomulas",
        "review_rating": "8",
        "review_title": "Netflix quality",
        "review_detailed_main": "Every now and then Netflix gets one right, this is one of those. A suspenseful thriller with a good story and creepy feel too it. Nothing knew but it was acted and directed.\n\nDo not listen to the negative reviews, those people are the ones expecting every single release to be 10/10 blockbusters, they are the reason you're forced to watch the same movies over and over because they stop you from watching anything new. Anyone reviewing under 6 stars is pure rubbish."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ddlvwrkhi",
        "review_rating": "1",
        "review_title": "Typical Netflix crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sannon-aragao",
        "review_rating": "1",
        "review_title": "Zero criativity",
        "review_detailed_main": "It would kill you guys do 1 thing that is not a cliché? In the first minutes you can have the whole thing figured out and there is no surprise at all."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "domialenic",
        "review_rating": "3",
        "review_title": "Mediocre",
        "review_detailed_main": "Not bad. The story might seem a bit far fetched, but if one takes the trouble to watch some of the real crime stories then the movie versions become lame in comparison. There are some really crazy people out there doing some really sick stuff. The movie however has quite a few holes in it. Especially the ending, or should I say, lack of ending was disappointing. There was no need for leaving things open ended and open for one's own interpretation. But overall not bad. Entertaining enough to give it a try. Once will be enough though. A pity that they missed the chance to make more out of this. It certainly would have been possible without any major alterations in the script."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "saferdriver",
        "review_rating": "3",
        "review_title": "There is a gap in the story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mettejoervad",
        "review_rating": "4",
        "review_title": "Worst movie ever - ridiculous plot",
        "review_detailed_main": "Not worth watching - not worth spending time on. Bad story, bad plot, bad acting especially by the husband. The story never really starts, it never really get started. A real \"Z\" movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "catrine-48845",
        "review_rating": "8",
        "review_title": "Decent movie",
        "review_detailed_main": "Not a bad movie at all and the acting was good. Although, kind of predictable but ,still enjoyable. It's definitely worth a watch. I've never seen this actress before but she was very good..Give it a try since there's not much else to watch. Without expecting much , you will enjoy it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "detdanceman",
        "review_rating": "2",
        "review_title": "A don't se movie.",
        "review_detailed_main": "Bad and predictable story with no unexpected twists.\n\nPoor acting.\n\nSave an hour and a half of your life... Don't watch this crap!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "CCH89",
        "review_rating": "3",
        "review_title": "Generic",
        "review_detailed_main": "Generic plot that has been done way too many times. Freida Pinto is pretty, though."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sickarolig",
        "review_rating": "4",
        "review_title": "You can guess the end with the trailer",
        "review_detailed_main": "Predictible, the couple didnt had chemistry. Nothing new about the story, and there are some incoherences. Average movie mixed with forced acting.\n\nIn the other hand, there are some camera movements that seem very impressive and the music made me feel the tension in some scenes."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "adrianoromoli",
        "review_rating": "4",
        "review_title": "Already watched",
        "review_detailed_main": "You know what's happening from the beginning. Nothing to discover nothing original. I think I have seen other many movies like this. It's like I have already watched this before."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "adm1111",
        "review_rating": "1",
        "review_title": "Stupid Story",
        "review_detailed_main": "The beginning seems good but the rest is rubbish.\n\nStupid wife, stupid story, same cliche. This movie is very irritating. I thought that the movie industry had passed these kinds of plots and stories.\n\nIt seems they have good budget but they put it in a bad movie.\n\nDon't bother, you will thank me."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sukimiyaki",
        "review_rating": "8",
        "review_title": "mild, not horror.",
        "review_detailed_main": "For a netflix psychothriller it wasn't bad. Everyone knows that Netflix has to create these movies very quickly and with a small budget, so not bad. Top lead actress."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "skea-76723",
        "review_rating": "3",
        "review_title": "Pointless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ops-52535",
        "review_rating": "5",
        "review_title": "its nearly there...",
        "review_detailed_main": "But when it comes to making a great and spectacular overwhelming finale to it, they really fail dramaticaly. Its a small cast , man and woman, fleeing the big city to calmer and more isolated living, when things get strange after a breakin to their new house.\n\nThe acting aint bad, neither the use of filmatographique techniques and really good use of sound effects to scare you up, and the ominous music that follows the plot does its work\n\nthe one to blaime is in my opinion the screenplay and storywriters, they give a caracter build up and makes a plot that is seriously loose and hidden in the drizzle, and the end sequence that should have had 20 more minutes of action, is made in a more or less lifetime sunday night tv drama fashion.\n\nBut the grumpy old man knows that his spouce wouldve moved her nails by this kinda flicks so itll be a hit for some, and a small recommend comes in the end. Its just not fully developed."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "dee-31076",
        "review_rating": "1",
        "review_title": "This is just another in-your-face agenda",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "skniazi7",
        "review_rating": "4",
        "review_title": "Avoid",
        "review_detailed_main": "Avoid at all costs!\n\nPoor script with no direction. Total waste of 90 minutes."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "rmbragdon",
        "review_rating": "1",
        "review_title": "Rubbish!",
        "review_detailed_main": "Acting is horrible! I actually laughed when Pinto delivered a line in the car saying Henry...Henry.\n\nI thought I was watching a high school production. Accepted storyline which was rehash, but the acting was unbelievable terrible on so many levels. As has been pointed out by others I could watch this on Lifetime for free. Do better Netflix!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "crdeiter",
        "review_rating": "10",
        "review_title": "Really good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cmac1012",
        "review_rating": "1",
        "review_title": "DONT NOT WASTE YOUR TIME",
        "review_detailed_main": "I know pinto is a pretty good actor, but he acting/ maybe script was terrible for her role in this movie. Logan's character was way too predictable from the jump. The acting/directing in the movie was horrendous which is unfortunate thought it had potential, boy was I wrong. Pintos character has zero common sense and is so frustrating that you find yourself yelling at the television. Save your time and stress and watch anything instead."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sajidkhan-30022",
        "review_rating": "5",
        "review_title": "Run of the Mill",
        "review_detailed_main": "This is a very old and familiar plot with no new concepts or story twists. Pinto did a good job but overall the story lacked any character development and flow. Recommend to watch if nothing else is available."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "garrett-828-74087",
        "review_rating": "4",
        "review_title": "Umm...no",
        "review_detailed_main": "The scenery, the house and Freida Pinto all look great. Otherwise, just boring non sense."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mikejade",
        "review_rating": "3",
        "review_title": "Trying to give it a chance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "bshaef",
        "review_rating": "1",
        "review_title": "One of the Dumbest Netflix",
        "review_detailed_main": "Efforts yet. Terrible story, bad acting, no continuity and boring from beginning to end. I hope Netflix paid all participants minimum wage. Thats what its worth. Shame on you Netflix."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "pamheritsch",
        "review_rating": "9",
        "review_title": "Well done",
        "review_detailed_main": "Great movie!! Kept you guessing from the start and doesn't quit. Characters were chosen very appropriately. Music was a great addition and used local talent. And the Detroit city lights were quite beautiful."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "soledad_hamed",
        "review_rating": "1",
        "review_title": "Its a disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cederberganton",
        "review_rating": "1",
        "review_title": "Just dont watch",
        "review_detailed_main": "Waste of 93 minutes. Dont do it.\n\nActing 2/10 Story 1/10 Predictable-ness 10/10."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "blu-08927",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Please don't waste your time 🙃 Highly recommended not to watch it ."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ccrisss",
        "review_rating": "2",
        "review_title": "meh",
        "review_detailed_main": "Nothing to see here.\n\nJust predictable from the very start.\n\nLike really predictable."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "msunando",
        "review_rating": "5",
        "review_title": "When danger is closer than what you think",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "igor-74753",
        "review_rating": "8",
        "review_title": "A nicely filmed movie, with good story, acting and music",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "amberazizkhan",
        "review_rating": "1",
        "review_title": "Worse than bad.",
        "review_detailed_main": "It's not even worth seeing it for the house. Bad screen play, unconnected and useless dialogues, terrible acting like cardboard boxes mouthing words. I mean I'm so irritated that I reacted by writing this review!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "karen-shaffer",
        "review_rating": "4",
        "review_title": "A camcorder in 2021?",
        "review_detailed_main": "More of a one hour detective show plot rather than a full length movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ramyindya",
        "review_rating": "2",
        "review_title": "2 stars only for the nice house they showed",
        "review_detailed_main": "Another trash from Netflix , Netflix should stop making movies , they are just bringing down overall movie standards.\n\nThe movie brings nothing new , pretty repetitive storyline , no twists, no frills . There is absolutely no content more than 5 mins in this movie . The storyline is just so predictable, with really bad acting from Frieda pinto . She cant act at all , not sure why they keep casting her ."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "gmbugshank",
        "review_rating": "2",
        "review_title": "What a waste of Logan Marshall-Greene's talent",
        "review_detailed_main": "I'll be honest, I hit play without knowing anything about this movie, because he's that good an actor . But good God this movie is trash. Logan basically walks around as a cardboard cut-out, the writing is so contrived and so BORING, and utterly predictable.\n\nAnd another thing, I am sick to death of this tired trope in films with the lady of the house breaking into seething tears of rage when her beta husband DARED to not ask her holy permission to buy/own a gun, LEGALLY, for the purposes of in-home self defense-- even when that's all it is used for, justifiably, and saves their lives! Why is this crap.in so many movies? When I go to the JOHN I usually have either my 5.56 dissipator, my M72AB1, or my 870 with me! While I was watching this garbage I had my 226 on the ottoman in front of me and said dissipator off to the side.\n\nI gave two stars only for that juicy thick redhead waittress that was onscreen for two seconds in the background at 24:20. Thank you Lord Jesus for inventing the pause button!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "dleroari",
        "review_rating": "3",
        "review_title": "It should be illegal to make such movie",
        "review_detailed_main": "Bad acting, everything is predictable and trash in general. However the storyline is good, but actor must be replaced. How can such movie be created. Can't understand aren't there any thresholds of how bad a movie can be."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "frehley-21102",
        "review_rating": "3",
        "review_title": "Just as bad as other reviewers say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jfbbcsjrqg",
        "review_rating": "2",
        "review_title": "The usual Netflix \"not invented here, so we'll reinvent the same ugly wheel you've seen, and charge you for watching it\" thing.",
        "review_detailed_main": "You've seen this movie already, even if you haven't added it to your queue yet. They take a plot you already know, with characters that have been done before, and better, then pretend like they actually have some new content this month, even though it's all retreads and bad covers, basically. No wonder Netflix sub rates are dropping. 10,000 screenwriters out there with original new content ideas, and Netflix just funds essentially b-grade remakes."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "horgitom",
        "review_rating": "4",
        "review_title": "predictable",
        "review_detailed_main": "Here comes netflix with another mediocre movie, not a surprise, this movie is incredibly predictable and except for Logan the other actors are just not it. So many similarities with other movies, feels like I was watching a movie I had already seen before, if that makes sense. Watch it and you will understand what iam talking about. There is plenty plot holes and the choices of the actors literally do not make sense at times.\n\nHowever, it had the potential to be a respectable movie for its genre but failed in every way possible.\n\nLogan played his role well, but couldn't save the movie, since it was nothing we hadn't already seen.\n\nRecommended? If you have nothing better to watch, sure, just don't expect much from it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "nikosstoitsis-140-776988",
        "review_rating": "2",
        "review_title": "Such a wasted opportunity",
        "review_detailed_main": "Where to start now...bad acting? A script written by a 10year old? Camera angles? Who will give me back my lost time? A star for freida and one star for the house."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jasminelarae",
        "review_rating": "3",
        "review_title": "Not every movie can be a mind bender",
        "review_detailed_main": "But Jesus christ. Make it just a tad less predictable. Can there ever be a smart person in one of these movies making smart choices?!? But then i guess we wouldn't have a movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "madhurpednekar",
        "review_rating": "1",
        "review_title": "Trash 🗑",
        "review_detailed_main": "What Frieda touches turns to trash !! She still doesn't even have the hang of acting even in mediocre movie like this , please do not return to India .. & such a seasoned & prolific actor like Logan should keep in mind whom he acts with ."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Sam2021",
        "review_rating": "1",
        "review_title": "Hollywood not bollywood",
        "review_detailed_main": "Guy actor was good but The women actor ruined the movie wish they picked someone else - this is hollywood not bollywood."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cinemagick",
        "review_rating": "5",
        "review_title": "A pretty good suspense/mystery",
        "review_detailed_main": "A pretty good suspense/mystery with some character development weaknesses and lack of compelling dialog."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "stefanyrjunges",
        "review_rating": "1",
        "review_title": "Boring and predictable",
        "review_detailed_main": "When will they stop making movies with the same plot? This is getting old, it's always the same old thing. I thought to myself, 'no way they launched a movie with the same ending as all the others' but oh boy I was wrong. Very disappointing."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tahska",
        "review_rating": "1",
        "review_title": "Frida pinto is just plain damn talentless lucky person",
        "review_detailed_main": "She got famous because of Slumdog millionaire in which she hardly had any screen time and dialogues."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "hrao",
        "review_rating": "2",
        "review_title": "Owning a Gun is worse than getting murdered?",
        "review_detailed_main": "So defending yourself in your house against violent intruders is wrong?\n\nHaving a gun to protect your family is wrong?"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mm-07973",
        "review_rating": "1",
        "review_title": "Yet ANOTHER dud from Netflix",
        "review_detailed_main": "As of late, Netflix continues to put out mediocre movies that are a waste of peoples intelligence and time. I switched this one off 20 minutes in.\n\nVery disappointing. Maybe their quality movie budget was slashed due to Netflix's multi-million dollar deal with Nutmeg."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sherripadgitt",
        "review_rating": "1",
        "review_title": "Very...Very...Very Bad Acting!!",
        "review_detailed_main": "The story was a good concept but ruined by the awful acting in this movie. It was more than just the acting that was bad....the story was very unbelievable from beginning to end, and it was very hard to believe the roles in which these actors played. I would love to see this crew try again with the movie but with more back-story involved and actual feeling when acting throughout all of it. The lead male character was very flat in the beginning of the film, but in the end he over-acted his part. I had so many questions watching this, but I did see it through.\n\nThe story is about a couple that is living in a huge house that the husband built for him and his wife. They are very well off from the looks of things, and they have a robbery....then another intrusion while they were in the house. I can't reveal more for giving away spoilers."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "michelle_kummer",
        "review_rating": "5",
        "review_title": "Had potential",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "he_he-22948",
        "review_rating": "3",
        "review_title": "As said here in the comments many times before: more netflix trash",
        "review_detailed_main": "Here we go again. You know you shouldn't but then you give it a try anyway and the disappointment is not far.. Horrible plot, a lot of stuff makes no sense, a lot of unanswered questions and of course not to forget bad bad white sick husband.. it's like always the same, retold over and over again. Nothing makes sense but hey, who cares it's the 21th century. Non brainers are all we get.\n\nRewatch a good movie you know, instead of this unlogical crap."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "diaz_byaku",
        "review_rating": "2",
        "review_title": "I always wonder what went into script writer head",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sinkiller-42327",
        "review_rating": "3",
        "review_title": "Lacking, cheezy",
        "review_detailed_main": "Film hits all the marks for a 2021 film Interracial couple check Minority female doctor check Psychopath white guy check.\n\nThe movie is just cheesy, Plenty of plot holes, the lead actress is nice to look at ...I forgot what her name is."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mubasherkasuri",
        "review_rating": "1",
        "review_title": "garbage",
        "review_detailed_main": "Don't even know what the Henry wanted to. Have nothing to surprise the viewers."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ashok-27156",
        "review_rating": "1",
        "review_title": "Pathetic movie, waste of precious time",
        "review_detailed_main": "The plot is so grinded already and pathetic acting. I hate myself for watching two-thirds of the movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "subodh-sb47",
        "review_rating": "1",
        "review_title": "Don't watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "enriqueayalajr",
        "review_rating": "1",
        "review_title": "Really ... it's 2021... people know better than to \"stay right here I'll be right back\"",
        "review_detailed_main": "You would think that after all these years of movie making... people going towards the \"dangerous noise\" that actors and directors alike would know better than to write a script using the lines \"stay right here I'll be right back I promise\" or have nobody question the ridiculously dumb decisions people make like dropping car keys at the most needed time or driving a car that doesn't require a push start.... Ridiculous."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "hceydapala",
        "review_rating": "1",
        "review_title": "Predictable story and horrible acting",
        "review_detailed_main": "Movie was all cringy from the begging till the end. Actors' performances were really bad. I think there is nothing good about this movie at all. I am sad I watched the whole thing."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "divstrolley",
        "review_rating": "2",
        "review_title": "Weak storyline, poor acting",
        "review_detailed_main": "If you have 1hr 20mins to spare on a Friday evening, then please don't waste it on this movie. The storyline is half baked and the actors are below average. It's the same old theme, but lacks the basic essence of the story."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "liljmia",
        "review_rating": "2",
        "review_title": "Had me rooting for the killer..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jsrdavis-47179",
        "review_rating": "2",
        "review_title": "Not even a good enough for Lifetime",
        "review_detailed_main": "No suspense, no build, nonsensical plot points bleh Lots of rubbish, but any more and there will be spoilers. Waste of talented people."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "stairways",
        "review_rating": "3",
        "review_title": "Cliche, psychopath, cliche",
        "review_detailed_main": "Take all the cliches from all the worst psychopath movies (of which there's no shortage) and hire two only average actors to pretend not to be embarrassed by the script, and you've got Intrusion."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "astrikt",
        "review_rating": "1",
        "review_title": "Do not watch",
        "review_detailed_main": "A total waste of time. Worse than the worst Lifetime movie. Very predictable plot with the usual violent ending. Very disappointing film. Definitively give it a miss. No doubt you can do something more fun for an hour and a half."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "lasseman59",
        "review_rating": "3",
        "review_title": "Sorry",
        "review_detailed_main": "The film gets its few stars for good photography and for Robert John Burke The rest sucks."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "JAS0NTURNER",
        "review_rating": "4",
        "review_title": "Totally predictable",
        "review_detailed_main": "There must be two types of reviewers in this world...those who took 1 or 2 film classes in college...and those who didn't.\n\nNow those who gave this film a low rating most likely took a film class. Because they recognize alllllllll that is wrong with this film.\n\nOn the other hand, the group who watched this and was legitimately shocked by the ending must have skipped those classes.\n\nI have to admit that sometimes I wish I could go back and watch films without the knowledge I gained in film school...but I can't... It is for that reason I give this totally predictable film a solid 4 out of 10."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cruise01",
        "review_rating": "5",
        "review_title": "Predictable thriller that feels flat in every direction.",
        "review_detailed_main": "2.5 out of 5 stars.\n\nPlot is predictable. Acting is forgettable. The film lacks thrills and script is giving tedious characters that makes this thriller a bit forgettable."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "moulaisonconnie",
        "review_rating": "2",
        "review_title": "Women are not that stupid",
        "review_detailed_main": "The Director and writer for this movie \"Intrusion\" made the main character & actress Freida Pinto look like a idiot. Women are not stupid. This was painful to watch to the end but I gave it a chance."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "lindahl-klas",
        "review_rating": "4",
        "review_title": "Disappointing",
        "review_detailed_main": "Freida Pinto is awful. Marshall-Green barely ok. Script: horrible.\n\nGot a decent build-up which only makes the fall even worse. Because the unveiling of this horror drama is as predictable as it is despicably bad.\n\nI don't even know why I'm giving this a 4 instead of a 2. Maybe for the cool house and landscape... Under any standard this."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "The_Geek_Spot",
        "review_rating": "5",
        "review_title": "Fairly okay",
        "review_detailed_main": "It's becoming actually a trend how suspense movies can now be more twisted and riveting. We are no longer engulfed in the used-to-be stories and it's good how writers are more capable of making all these movies definitely interesting.\n\nThis movie for example may seem a bit calculable but it was a good storyline still. Acting was okay and although the action didn't go as far as anyone can expect, it was somehow a good movie for me. It could have worked up a bit with a little added suspense here and there, but overall it wasn't so bad."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "agakra",
        "review_rating": "5",
        "review_title": "Just okay one-time watch",
        "review_detailed_main": "In my opinion this movie was just okay. Watchable. Definitely had potential for more, could have been deeper, less obvious etc. But sometimes, when you're tired and just want to chill with a good old cliche is just fine. Quite predictable but there is some pleasure in this predictability in this particular genre. Plus beautiful shots of the middle of nowhere surrounding, pretty actors and some suspense moments. I wish there was more to the ending, explanation and some deeper meaning in the \"why\". It made no sense in my view and seemed that the director rushed towards an end without any idea how to connect all dots."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "donttouchmeprimate",
        "review_rating": "2",
        "review_title": "The bad guy is the bad guy..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "gyfkjpf",
        "review_rating": "4",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "annakillick",
        "review_rating": "5",
        "review_title": "*Spoilers* Guessed entire plot from the beginning...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Coburgkiwi",
        "review_rating": "5",
        "review_title": "Good for movie night w friends and popcorn",
        "review_detailed_main": "Well produced movie that is not too taxing on the brain and has a very swish house. Run of mill movie - surprised it got so many low ratings. Yeah it is not original but how many movies really are nowadays? Most people will see the plot reveal from a mile away. Would recommend for a movie night w friends, beer and popcorn as there is a lot of moments to 'critique'. The actor from 'The Invitation' turns in a good performance. For something more thrilling you might want to watch that movie instead."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cthetrancedone",
        "review_rating": "3",
        "review_title": "Pointless And Predictable",
        "review_detailed_main": "I live home invasion movies but this was absolutely terrible.\n\nIt starts off well and has a good direction and atmosphere.\n\nThe acting is atrocious.\n\nThe ending is as predictable and pointless as it can possibly get. It's just emptiness."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "shaisaadon",
        "review_rating": "4",
        "review_title": "So many plot issues",
        "review_detailed_main": "Acting was decent but plot was de attached from reality."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "kroma-19-21119",
        "review_rating": "3",
        "review_title": "Total waste of time! Better bang your head against a wall for 90 min!",
        "review_detailed_main": "Why should anyone in this world make such a movie? It's completely predictable, uninspired and pointless.\n\nUnfortunately there is a part of me that always likes to give smaller productions a chance. But especially in the last few years (thanks Netflix) a lot of rubbish has come out that would have been better left ashamed in the drawer of mass production. And this film is a prime example of that!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "dajanna-25620",
        "review_rating": "1",
        "review_title": "Terrible!",
        "review_detailed_main": "It was terribile to watch, boring and suddenly it became like an indian movie with the slow motion scenes... Every scene was totally expected.. the dialogues were very poor! It was like watching an indian thriller movie of 2014.. with the typical boring scenes.. A TOTAL Waste of time!!!!!!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "divinechannel",
        "review_rating": "3",
        "review_title": "Stale",
        "review_detailed_main": "Acting was not so good. I see lots of comments about Logan but he didnt bring his A game here. And the lead female was just ugh.\n\nThis movie was boring, predictable, done many times before much better. I guess in this new century we're in, I desire something fresh and out of the box. This was safe and put me to sleep twice. I had to force myself to finish this movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "CruelSummer1987",
        "review_rating": "5",
        "review_title": "There is no surprise we know from the first 10 min",
        "review_detailed_main": "This gives itself away after just 10 min which is a real bummer. Don't treat us like we are dumb and need you to tell us everything. A little mystery and surprise would have made this decent. In fact you kind of wonder why the lead character hasn't figured it out sooner? Like we did? In the first..... You guessed it, 10 minutes."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "BarryKSU",
        "review_rating": "4",
        "review_title": "Anticlimactic...",
        "review_detailed_main": "So much potential for this to be a really good thriller. A tremendous amount of build up and very little delivery at the end. It just kind of... ended."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "sgimera-34917",
        "review_rating": "5",
        "review_title": "Despite this review - worth watching for yourself!",
        "review_detailed_main": "The dumbest victim the year award goes to ...? You will see what nonsense in the writing helps the victim come off as the slowest thinking, always wrong, bumbling idiot, of all suspense films. If this doesn't bother you, it'll be a great suspense movie of epic proportions for all time...for you, but for me it's just a middle of the road timewaster."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "priyankashahdadpuri",
        "review_rating": "2",
        "review_title": "Worst Casting Ever",
        "review_detailed_main": "I'm not sure why anyone picked Frida Pinto as the lead actor? She is absolutely drop dead gorgeous but I would rather see her as a model or brand ambassador for makeup products than in a movie. No, I want to see an actor there. The role had so much potential to be gripping but ended up being played by a wooden plank. Also the movie's plot is so overdone, do not waste your time."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mmthos",
        "review_rating": "5",
        "review_title": "PARDON THE INTRUSION",
        "review_detailed_main": "This starts out as an original twist on a home invasion theme and effectively keeps up the \"Did he--Didn't he?\" till the Big Reveal when it instantly turns into a comic romp to an appropriately wacky ending\n\nfun enough to waste time on."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jcphoto_02",
        "review_rating": "2",
        "review_title": "Two stars and that is being generous.",
        "review_detailed_main": "Wow! About half way through I started fast-forwarding the film. It really is that bad. Acting is stiff, some scenes didn't add anything to the plot, poor writing...actually writing was downright boring! Seriously, do not waste your time with this one. Move on...quickly."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "zylfijemehmeti",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "One off the worst movies I seen in a long time!\n\nThey can't been acting 😂"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "KaiOlaf",
        "review_rating": "5",
        "review_title": "Forget the movie, I want the house 😂",
        "review_detailed_main": "I don't know why I did not really get into the movie. The story is not bad, the scene image even is awesome, but somehow the staging is so cold that I never cared about anything that happened. A little more sould would have helped."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "zerobrains",
        "review_rating": "5",
        "review_title": "It's okay...",
        "review_detailed_main": "If you like classic Lifetime movies you'll like this one. It just has a bit of a bigger budget and the acting is slightly better...slightly."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "fikro_j",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Do not waste your time. No no no. Just NO. Predictable, bad, no just NO!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "tqmybbwr",
        "review_rating": "3",
        "review_title": "Was here for Logan",
        "review_detailed_main": "Go watch Upgrade or the Invitation with Logan. Fantastic movies of his! This was a miss because it's predictable. Needed better writers. Make the twist actual surprising and misdirect us viewers."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "vaifan777",
        "review_rating": "5",
        "review_title": "Ok thriller",
        "review_detailed_main": "Moves along at a nice pace. Their house is amazing! I found this movie not good or bad. Questionable moves on the wife's part. If you're looking for something quick this is worthy."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jladimayuga",
        "review_rating": "2",
        "review_title": "Dont waste your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "philvickiw",
        "review_rating": "2",
        "review_title": "Predictable, poor acting, plotless",
        "review_detailed_main": "I gave this movie two stars for the beautiful scenery and the potential that quickly became so cliquish and nearly hard to watch. Directing was amateurish and I haven't seen slow motion and/or distorted angles to drive a point across since the 80s. The actors were simply reading their lines and so unbelievable it was cringeworthy. The stereotype of a serial killer is blatantly followed to a t."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "BOOKSMART1",
        "review_rating": "5",
        "review_title": "intruders",
        "review_detailed_main": "Intrusion is yet another home invasion thrillers. It does not move fast enough to make you forget its massive lapses in logic in favor of chills and thrills. It is also devoid of suspense despite few jump scares. Worst of all, its heroine does mind-numbingly stupid things while the husband is at home."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mikejos28",
        "review_rating": "1",
        "review_title": "Terrible, Netflix Disappoints",
        "review_detailed_main": "Predictable garbage. Watch paint dry instead of this movie, it's more entertaining."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "room-41203",
        "review_rating": "1",
        "review_title": "The worse movie I seen in a long time.",
        "review_detailed_main": "The worse movie I seen all year. The acting is bad. The story line makes no sense. Waste of time."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ticuflorin",
        "review_rating": "2",
        "review_title": "garbage",
        "review_detailed_main": "Very bad,waste of time.\n\nI do not understand how is possible to accept to play in such a bad movies."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "cool-96630",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "It's a very predictable movie. Don't waste your time. Very budget."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "halimaahmed-51904",
        "review_rating": "2",
        "review_title": "Watchable but some very badly written parts",
        "review_detailed_main": "Now if you were suspicious, why on earth would you start poking around with the guy in the house along with a house full of guests!!! Seriously?! How easily she breaks free too!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "perksofbeingannie",
        "review_rating": "1",
        "review_title": "DO NOT WATCH IT",
        "review_detailed_main": "Under no circumstance should you watch this HORRIBLE \"movie\""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "smithsir-71602",
        "review_rating": "1",
        "review_title": "One of the worst movies of our time",
        "review_detailed_main": "One of the worst movies ever !!!! Horrible actors and even worse music ! Disaster !!"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Kittendragon",
        "review_rating": "2",
        "review_title": "Typical, predictable, done to death.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "m-ramanan",
        "review_rating": "5",
        "review_title": "easily skippable one....",
        "review_detailed_main": "RATED 5/10 Language: English Source: Netflix\n\nTemplated and run of the mill story with nothing new in the presentation... you can predict everything from the beginning to the end and another annoying thing is wooden act by the cast... easily skippable one...."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ryanpersaud-59415",
        "review_rating": "5",
        "review_title": "Like a Dressed Up Big Mac",
        "review_detailed_main": "The Good: This movie is actually quite pretty. I thought the set design was great, the cinematography was fun and dynamic.\n\nLogan Marshall Green plays a bit of a clichéd character, but I have to say, this might be his best performance yet.\n\nIt's just a good looking movie that sort of elevates what is otherwise predictable plot. I also think the movie is pretty fun and entertaining, it's the sort of light watch that's perfect for a family party, you know? (Which may say more about how we're desensitized violence, but whatever) And um...hey, it's always great to see Freida Pinto, right?\n\nThe Bad: Unfortunately, this movie's big twist is about as obvious as it gets. I don't know anyone who would be shocked by how things turn out, even if it comes from left field. This trope has been beaten to death at this point. I would have actually appreciated more quiet moments with double meanings to rope us in a little more.\n\nThe Ugly: Is it just me, or is the glut of movies set in desolate locations with small casts increasing lately? (I wouldn't doubt it given the pandemic) We've just seen this movie before. It's nothing special, but it's not that bad either. Even my Mom who recommended it spoke volumes when she left the room to watch something else, despite \"liking the movie.\" I think that sort of sums it up. You'll probably like it, but you'll need to watch it again."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "melichouah",
        "review_rating": "2",
        "review_title": "What did I just watch",
        "review_detailed_main": "I was looking for thrillers to watch in 2021, landed on this one and thought I'd give it a try.\n\nWth was that? Actress ok, actor ok, but what about the story? We don't get any explanation and are left clueless. I give it a 2 and Im generous because I think about the actors that had to play in this so called movie.\n\nSo disappointed, please don't waste your time."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "themanicrenegade",
        "review_rating": "4",
        "review_title": "Are you kidding me?",
        "review_detailed_main": "How can you worry about a spoiler alert when you know the ending 5 minutes into the movie?\n\nIf you wait for the clever twist you'll be very disappointed.\n\nExactly what you think is going to happen shortly after the opening credits is exactly what happens.\n\nThere is no one to care about in this bad retread.\n\nThe wife spends the movie with mouth agape sometimes being Nancy Drew with the intelligence of Inspector Clouseau Ugh."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "djs-specs",
        "review_rating": "5",
        "review_title": "Predictable, formulaic, but short enough to sit through",
        "review_detailed_main": "Intrusion brings precisely nothing new to the table. Its a story that's been done to death and in far superior movies. But at a snappy 1:22, including end credits, its not mind-numbingly boring. Its just a shame that Logan Marshall-Green and Freida Pinto - both fine actors - aren't given more to work with... but then, maybe that's a good thing since this film is so forgettable it shouldn't put a significant dint in their careers. Hopefully they got a healthy paycheque out of it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Psyllium",
        "review_rating": "3",
        "review_title": "Bad acting, bad idea, low budget",
        "review_detailed_main": "The acting was pretty bad and 90% of the action is in a house. Not what I was expecting. Definetly not worth the time wasted. You will not understand anything in the first 40-50 mins of the movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "creetopia",
        "review_rating": "2",
        "review_title": "Predictable",
        "review_detailed_main": "I was easily able to figure out the ending. It's very similar to other videos. It was good, but I wouldn't watch it again or recommend it. The acting was decent but I have seen better."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "nikitamampofu",
        "review_rating": "4",
        "review_title": "Uhm okay...",
        "review_detailed_main": "That's what I said after finishing this movie, uhm okay.\n\nI feel like they main actors did a great job with a very dull script and directing. The movie some grit, some gravy."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "knwilkerson",
        "review_rating": "5",
        "review_title": "Unbelievable",
        "review_detailed_main": "Currently watching this movie and completely upset at how predictable Meera's character has been. A lot of depth was missing from this movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "korinmjones",
        "review_rating": "1",
        "review_title": "Issa no for me",
        "review_detailed_main": "This movie was absolutely horrible. The actors in it were like... horrible. Meera literally didn't call the police and was just staring her crazy violent husband .. waiting for him to hit her. Like I was wowed how horrible this movie was. Lmao. Wouldn't recommend."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "jaxon-07584",
        "review_rating": "3",
        "review_title": "Predictable",
        "review_detailed_main": "I guessed the ending maybe 30 minutes into the movie\n\nWell shot and acted.\n\nBoring, slow, and you must been born under a rock to not guess the ending."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "amanjourney-78822",
        "review_rating": "3",
        "review_title": "Call it, Insulting...",
        "review_detailed_main": "Rather than Intrusion, I vote it be called Insulting. The writer, obviously doesn't know what normal dialog or reactions look like. Stupid, off-the-wall comments, horrible scripts, and too many things that just didn't make sense. Too bad. Story line was actually somewhat original and acting was OK. The home where it was filmed was great though..."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "nicolepinkerton",
        "review_rating": "4",
        "review_title": "Not good or bad",
        "review_detailed_main": "Honestly, I think it was kind of boring. The acting was so so and I won't watch it again because it didn't have enough of anything to hold my attention. It does remind me of a Lifetime tragedy of the day kind of movie. Netflix makes some pretty good movies so I won't give up even if the last few were duds. After reading the reviews it seems like a lot of people only write bad reviews and nothing else. Try watching a different kind of movie and give a positive review once in a while."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "ccjkv",
        "review_rating": "3",
        "review_title": "Far too predictable, not sure why there are people defending the film",
        "review_detailed_main": "This film is just far too predictable and the acting isn't great. It was ironically funny due to how predictable and unrealistic it was but overall it was just unoriginal and I don't recommend."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "swarupcsc",
        "review_rating": "4",
        "review_title": "Visual only good nothing else",
        "review_detailed_main": "The movie is kind of bad predictible story very bad acting no suspense or thrill, only positive is good visual otherwise waste of time."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "presencevw",
        "review_rating": "5",
        "review_title": "Lost opportunity, Meera",
        "review_detailed_main": "When she have the chance, Meera should have scratched his face to smithereens so that others would know what was going on. But she did redeem herself. In all such movies the plot hinges on the characters not contacting the police when they should. If they did, there would of course be no movie."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "keithnigli",
        "review_rating": "1",
        "review_title": "Please don't watch",
        "review_detailed_main": "I registered myself again to write for this movie. This movie wasted my 1 + hours of my life and disturbed my mind so much like why did watch this movie? So Unreasonable actions and reactions which is truly disturbing making you think they take viewers as fools. I think the director really thought they are showing these movies to fools or to some kindergarten kids to fool them. I know making a movie isn't an easy task but I wish they would be more serious and logical if they're making a thriller drama based on reality.\n\nOnly good thing about the movie is don't do what the actors did... Wait for the opportunity and then react. For that one point or else I would have given 0 if it was allowed."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "feliciastrand-71308",
        "review_rating": "5",
        "review_title": "Too predictable",
        "review_detailed_main": "Like the title said: too predictable. I figured everything out immediately. It wasn't a bad movie, just had everything figured out which took away the element of surprise."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Laura_Ratings",
        "review_rating": "5",
        "review_title": "More of the same",
        "review_detailed_main": "I feel like we have seen this movies many times before but each time it's just different people and a different setting. The plot was very predictable and in my opinion there was nothing new. However, the movie is somewhat enjoyable. It could have been way worse."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "abillings-66467",
        "review_rating": "1",
        "review_title": "Definitely watch if you like yelling at the TV",
        "review_detailed_main": "Get a weapon!! You're being attacked, get a weapon!! So frustrating, annoying and dumb. The script is lame and the acting is weak. The house is obnoxious. There are far better thrillers. Skip."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "Snakeskinzjr",
        "review_rating": "3",
        "review_title": "not great",
        "review_detailed_main": "Like a forgettable Lifetime Original. Slow , too much boring dialog, weak plot. Nothing new, the movie was very predictable. Even the fairly well known cast could not save it . Would not recommend."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "va_wulf",
        "review_rating": "3",
        "review_title": "How many dumb decisions can a person make?",
        "review_detailed_main": "After sitting through this garbage plenty apparently. This is a god awful \"thriller\" that was like a lifetime movie only worse."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "mrcecchini",
        "review_rating": "2",
        "review_title": "Unrealistic from the beginning to the end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "square-61460",
        "review_rating": "1",
        "review_title": "Predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "severstjepan",
        "review_rating": "2",
        "review_title": "Insult for my intelligence",
        "review_detailed_main": "The makers should me ashamed of them self for spending money on something so bad as this. LOGAN MARSHALL-GREENs acting was below acceptable. Text and camera was ok. But the story omg, very very sad."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "pavithrang",
        "review_rating": "5",
        "review_title": "Finished it",
        "review_detailed_main": "There is so much crap on Netflix I never get thru the first 15 mins of that it is worth mentioning I did finish this movie in one sitting. I was curious to know what happens...and it delivered. It is a low budget thriller. As everyone has noted Freida pinto can't act to save her life. Literally. Only an absolute fool or corrupt dude would give her a lead role after this. That she has made a career in acting is mind boggling."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "selenaignjatovic",
        "review_rating": "5",
        "review_title": "For the most part boring",
        "review_detailed_main": "I mean, it's a good movie to kill some spare time, but nothing much different from countless of other movies. 20 minutes into the movie, I knew exactly what was going on. It's a classic story and it's very stretched. Seriously, this entire story could've been explained in 40 minutes tops. This way, you have about 8 minutes in total of action, and an hour and 24 minutes of boringness, where you just wait to happen everything you already know it's gonna happen.\n\nOverall, like I said - it's a good movie to kill time and the actors are likable. They did the best they could with what they were given."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "maralynmanson",
        "review_rating": "5",
        "review_title": "An R rating made as a PG",
        "review_detailed_main": "Predictable of course, but all thrillers are to a point. It just needed more. Less about the square house in the middle of a dessert and more thrills. And why did he look cool whilst she dressed like someone's Aunty?"
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "louissouthpaw",
        "review_rating": "5",
        "review_title": "An intrusion into your living room",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "thales-63045",
        "review_rating": "5",
        "review_title": "Old genre",
        "review_detailed_main": "It's not bad on a wet Sunday afternoon but this subject has been done time and time again. Nothing new here. Nice house. Nice scenery. I liked the music. That's it."
    },
    {
        "movie_id": "tt5563324",
        "movie_name": "Intrusion",
        "movie_rating": "5.3",
        "review_username": "GoalDigs",
        "review_rating": "",
        "review_title": "Sesame Street therapist?",
        "review_detailed_main": ""
    }
]