[
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Fella_shibby",
        "review_rating": "3",
        "review_title": "An annihilation of the series. The tag line itself states, \"destroy all expectations\". We have James Remar doing lots of wire fu.",
        "review_detailed_main": "I had seen bits n pieces of it in the early 2k on a cable tv channel.\n\nSaw the entire movie recently on a fast forward mode.\n\nThis is the second installment in the Mortal Kombat film series based on the video game and the story picks up immediately after the last film ended.\n\nWhile the first part was at least entertaining, this one is sheer lousy.\n\nWe have James Remar's body double doing all the wire fu stunts and unlike Christopher Lambert, James Remar got bored with his long hair n white monk gown. He does a crop cut n wears a designer waist coat n military boots.\n\nI found Sandra Hess as Sonya Blade more attractive than the previous part's gal.\n\nTalisa Soto who played Kitana is only 4 years younger to Musetta Vander who played Kitana's mother. I found Musetta more attractive than Talisa.\n\nBrian Thompson as the main villain is no match to Cary-Hiroyuki Tagawa."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "falkbay",
        "review_rating": "3",
        "review_title": "Highly watchable crap.",
        "review_detailed_main": "Yeah its flawed. Its idiotic. It doesn't follow the video game well enough. The acting is the worst you'll ever see anywhere. The fight scenes are pathetic and the choreography is even worse than its predecessor. The special effects are terrible and worse than you can possibly imagine. The storyline is nonexistent. There are a lot of scenes and parts which make no sense whatsoever. But at no point is it ever boring. So it is highly watchable despite being a piece of crap. If you be a fan of the MK franchise or are expecting a good movie, watch it to see how bad a movie can get, just for education. It does however take a special kind of talent to ruin a franchise and movie which already has a good plot in place (refer to the MK video games). This movie's entire cast and crew have that talent and so does a retard called Paul Anderson."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "janks007",
        "review_rating": "3",
        "review_title": "An unexpected Sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "chr1sberg",
        "review_rating": "1",
        "review_title": "Quite Possibly the Worst Movie in the Realm of Known Existence",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Valjean-4",
        "review_rating": "1",
        "review_title": "This is probably the worst sequel ever",
        "review_detailed_main": "The problem with Mortal Kombat: Annihilation isn't that it's stupid, with no significant plot, dialogue or characters. That is undebatably true of Annihilation, but that was also true with the first Mortal Kombat movie, and that was a great movie. The problem is the HUGE let down in the martial arts and special effects scenes. MK had some terrific fight scenes, such as the brilliant Cage/Scorpion fight in the forest, the great Liu Kang/SubZero fight, and the cool finale with Shang Tsung. Annihilation didn't have any fight scenes up to the quality of those three, many of the fight scenes made no sense, and the finale was horrible. In addition, some things in Annihilation I would really like an explanation for:"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "bestofcell",
        "review_rating": "1",
        "review_title": "Nothing to add. Watch it to laugh at it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "manalone923",
        "review_rating": "2",
        "review_title": "Oh, I'll tell you how bad this movie is, allright",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "noxturne",
        "review_rating": "1",
        "review_title": "God no",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Rob_Taylor",
        "review_rating": "2",
        "review_title": "Mortal Kumquat",
        "review_detailed_main": "By all that's Holy! A film that made me cringe the whole way through! Dear Lord how the studio bosses must have laughed as they counted the money that they made off this turkey. Now, I thought the first MK was an OK film, great soundtrack, OK acting and plenty of fighting. A good no-brainer actioner. But this....this....defies belief.\n\nHow on Earth can you get such a bunch of wooden actors together and still manage to hide all the strings? It comes to something when you look at a film and can honestly say the best actor in it is Brian Thompson! The actors playing the bad guys overacted so awfully it was painful to watch, expecially the centaur guy. He exuded ham to a level I've not seen before.\n\nThe special effects were truly special, but only in a \"special needs\" kind of way. Looks like they were lifted straight from the video game itself. Laugh as you watch something resembling a dragon perform martial arts very badly. Laugh as Brian Thompson turns into a......thing. Laugh at the terrible lack of detail in it all. Laugh, laugh, laugh, laugh and laugh again, right up until they slap the straightjacket on you and cart you off to the loony bin. Because only someone truly demented would want to sit through this terrible, terrible film.\n\nEh? What's that Doc? Yes, I know I sat through it. But it was all in the name of science, you see. I was doing research. By the way, you couldn't loosen this jacket a bit, could you?\n\nAnyway, as I say, the best actor was Brian Thompson. Only he saved it from getting a 1, but even then, the rest prevented it from getting any more than a 2.\n\nAvoid it if you value your sanity!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "evilasahobby",
        "review_rating": "2",
        "review_title": "Raiden gets a haircut!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "amaionuma",
        "review_rating": "",
        "review_title": "What a letdown",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "atomicmajor",
        "review_rating": "8",
        "review_title": "Awesome!",
        "review_detailed_main": "I love the original Mortal Kombat movies. They always bring me some strange pleasant kind of mood, and you just sit and enjoy them.\n\nYes, the budget is low, special effects are cheap and actors aren't well-known. So what? If you understand, that the movie is a video game adaptation, you'll see, that most of the game characters appear and they have game-like moves and tricks. You feel that it's made with the same spirit! And this is very unlike most adaptations, which look like different stories.\n\nSeeing so many bad reviews and ratings makes me think that these people just didn't feel a bit childish cheer and enjoyment playing the game and watching the movie.\n\nI was (and still) hoping to see sequels or remakes inspired by these great movies."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Tonino",
        "review_rating": "7",
        "review_title": "Only for fans of the video game, but if you are...yahoo!",
        "review_detailed_main": "Only for fans of the video game, but if you are...yahoo!\n\nIt's a plain and simple movie. Just straight from the video game. The characters are ported really well and the fights are simply awesome. The techno music used fits perfectly to the pace of the movie and you feel like you are playing the game. If you liked the game you'll enjoy the movie for sure, otherwise probably it's just another cheap movie because you really need the background from the game to enjoy it."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Unbreakable27",
        "review_rating": "1",
        "review_title": "You got to be kidding me!",
        "review_detailed_main": "I have been a big fan of MK since the beginning, although I must admit I lost interest in the game series after part III.\n\nBuying MK Deception this past Christmas renewed my interest in the series.\n\nThis movie was crap and I can't believe I bought this mess.\n\nGood thing I found it for 9.99 at the used bin, so I wasn't out of much.\n\nI was expecting to see a REAL sequel to the first movie, which I found fairly entertaining.\n\nI thought the first film was very good and does the game upon which it is based some justice.\n\nNot the case with MKA.\n\nThe first problem is that they tried to fuse too much of MK2 with MK3.\n\nThen, if you're going to replace a character with another actor (Christopher Lambert), then at least make sure the new actor does a batter job than the first. The first Raiden was a hard-ass, and you knew not to mess with him. The second Raiden was a wuss and every time we saw him he was going through a wall.\n\nWeak portrayals of major MK characters was another flaw.\n\nThe actress who portrayed Sonya Blade was nowhere near as good as Bridgette Wilson (the first Sonya).\n\nSame could be said with Cage (Linden Ashby).\n\nWhat was the point of even having Ermac and Rain in the movie if they weren't going to be referred to? A very weak portrayal of Sindel, Kitana's mother and the actress who played her isn't fit to act in soap operas.\n\nLine example: Kitana: \"My mother is dead.\" Sindel: \"As will be her daughter!\" Gimmie a break! Stick with the first."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "jimjam20-2",
        "review_rating": "",
        "review_title": "\"It Sucks!\" dosen't do it justice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "lastgoldrush",
        "review_rating": "1",
        "review_title": "this made my brain bleed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "midniteprincess",
        "review_rating": "1",
        "review_title": "what a disappointment ...[SPOILER INCLUDED]",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "So not \"Toasty!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "D000007",
        "review_rating": "1",
        "review_title": "Saw this movie when I was 12 thought it was bad then",
        "review_detailed_main": "When you see a movie like this you wonder who gave the o.k to make it. This movie came out when I was in Middle School me and 3 of my buddies went to see it. After the movie was over we thought that it was terrible it was sad because 12 year olds back then seemed to love mortal kombat we played all the games and loved the first movie after this one we quit playing the games and moved on in life. It only takes one bad movie to lose a large following. This movie should have never been made or at least have better writers better acting(Lu and Katina were good) the rest were half rate actors. Costumes were terrible also a movie with such a large budget could have had better things, Its better than TimeCop but thats not saying much"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "benjamin_lappin",
        "review_rating": "1",
        "review_title": "The Only Summary of This Film!!! *few to mild spoilers*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "wilco1999",
        "review_rating": "1",
        "review_title": "Video game had a great plot, what happened with the movie?",
        "review_detailed_main": "The plotline for MK3 (the video game) had a great and simple storyline fit for a movie and for some reason the producers went off on a tangent and warped that storyline into an incoherent, unbelievable snore-fest of a script, added some bad actors, and basically killed what looked liked a promising franchise. Bridgette Wilson and Christopher Lambert did well to stay clear of this script.\n\nWill there be some redemption for the franchise with a third film to gain back what it had achieved with the first in the series, or does anybody care anymore? We'll wait and see."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "bad sequel",
        "review_detailed_main": "Robin Shou and Talisa Soto return but everybody else is gone. This follows directly from the original movie. Outworld emperor Shao Kahn opens a portal to Earthrealm. He is joined by Kitana's resurrected mother, Queen Sindel. Johnny Cage is immediately killed off and the emperor promises to conquer Earth in six days.\n\nThe fun of the original is gone. It's an obvious step down when the movie opens with so many of the original actors missing. Even the special effects take a giant step down. This is a movie made by people with no foresight for franchise building. This is about making a few quick bucks and getting out. They use scraps and leftovers from the first movie. It's bad from start to finish although it does have a fight between Scorpion and Sub-Zero. It's still not good."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "SaintNinja",
        "review_rating": "10",
        "review_title": "The most Hated martial arts Cult Classic",
        "review_detailed_main": "Despite all the hate and sub zero marks, I like this one better than Mortal Kombat 1995. Why? Well, I know that first movie was technically better: better sets, better production, better music etc. Better fight scenes? Not really. But it was little bit too slow and ambient in my opinion. Mortal Kombat 2 is a real roller coaster. Fast and, yes it's unpredictable in some ways. Everybody say - CGI is bad. Yes, it is. But practical effects are good. Some sets are very beautiful. The rythm of fight scenes is on top with original Kang vs Reptile battle. Brian Thompson as Shao Kahn is kind of funny, but there is something about humorous Shao Kahn)) New Sonya looks like a legit fighter to me. New Raiden is miscast. James Remar is fantastic as always, but it's not Raiden. I don't mind. I was video games fan in the 90s, and I know what pain is. No movie based on video games was \"right\" then. Street fighter, Mario Brothers, MK - all good movies, but not right in terms of video game lore. Anyway, Mortal Kombat Annihilation was interesting and bold project that wasn't quite right. Give it a try if you like old martial arts films with a B sci-fi vibes."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Darkside-Reviewer",
        "review_rating": "6",
        "review_title": "Isn't as bad as everyone says it is",
        "review_detailed_main": "The first Mortal Kombat movie was a pretty decent movie that was fun to watch had some great fight scenes and did a great job turning a simple tournament fighting game into a movie adaptation for the big screen.\n\nMortal Kombat Annihlation was released two years after the 1995 original and had a different writer and director also given a low budget and only given a short time to shoot edit and produce the movie what we get is actually an okay movie nothing special unique or award winning but still a fun and action packed movie that has a great soundtrack actual martial arts stunts and fight choreography and a big cast of characters both good guys and bad the actors from the original also return for the sequel although one is killed in the opening scenes so minus one Johnny Cage.\n\nA lot of the complaints about this movie were mainly about how over the top and cheesy the acting and dialogue is in the movie along with some bad costumes and special effects the movie got a bad reaction from audiences and critics and is often quoted as one of the worst video game movies ever made but in all honesty despite it's flaws this is a fun movie to watch and doesn't take itself to seriously you will laugh at how bad some parts are but if you grew up in the 80s and early 90s when Mortal Kombat was just a two dimension fighting game with cool looking characters you appreciate the fun and often over the top aspects of the movie having your favourite characters jumping into fights in bright coloured outfits and tights fighting to the not so bloody end while awesome music plays.\n\nI recommend watching this movie if you enjoy fun action movies that don't take themselves too seriously and are just an hour and half of crazy fights overacting and cheesyness."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "rpretc2",
        "review_rating": "3",
        "review_title": "More Characters Does Not Equal Better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Smoothfox",
        "review_rating": "",
        "review_title": "Mortal Kombat: Abomination (SPOILERS)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "BENARES-2",
        "review_rating": "1",
        "review_title": "That's two hours of my life I'll never get back...",
        "review_detailed_main": "Bad, bad, BAD! If I hadn't seen \"Steel\" it would rank as the worst movie I'd ever seen. The story is terrible, erratic, and mindless to say the least. The special effects are bad beyond redemption, the acting is stilted and amateurish (even for a video-game adaption movie!), and the action sequences are boring and uninteresting (and that's supposed to be the _meat_ of this \"story\"). Save yourself some money and don't see it, even if it's playing free on television -- you'll at least keep down your electrical bill."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Kage-2",
        "review_rating": "1",
        "review_title": "See it for the mud fight. And Jade. Her too.",
        "review_detailed_main": "Okay, reading the comments I'm thinking I'll see this movie again, but my current opinion of it is that...well...\n\nOkay, I really liked the first Mortal Kombat. Watching it again I kinda changed my mind, but really, it's a fun movie to watch (why the hell was Reptile so easy to beat though!?). So I was pretty stoked about seeing MK Annihilation, because, hey, it had all the nifty characters.\n\n...if ever there were a movie for lining the bottoms of bird cages, this is it. Robin Shou, who was pretty inept in the first movie, was an outright AWFUL actor in this one. Motaro was an idiot, they skipped over Kintaro if I remember correctly. Why they did that, I don't know, I thought Kintaro was hardcore in MK2 (and utterly overpowered in MK Trilogy). Oh well. He wasn't that important anyhow.\n\nTwo redeeming points in this movie, for men only: Sonya and Mileena (?) fighting in the mud, and Jade.\n\nFemale MK fans (all two of you) will not enjoy this movie. At all.\n\nSkip this movie, it's not even worth rental money."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "bekirertai",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Thanos_Alfie",
        "review_rating": "3",
        "review_title": "Disappointment...",
        "review_detailed_main": "\"Mortal Kombat: Annihilation\" is an Action - Fantasy movie and the sequel of \"Mortal Kombat\", in which we watch some martial arts warriors trying to save the Earth by an invasion but they have only six days to do it.\n\nI have to admit that since I had already watched the previous movie I had high expectations by this one and unfortunately I was disappointed by it. I did not like that Christopher Lambert was changed by James Remar on the role of Lord Raiden and the visual effects which were simply horrible. The direction which was made by John R. Leonetti, it was below average and I believe that he did not reach his potential. To sum up, I have to say that \"Mortal Kombat: Annihilation\" is not a good movie and even if you are a fan of \"Mortal Kombat\" I am sure that you will be disappointed by it."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "benjaminjacobcoulson",
        "review_rating": "2",
        "review_title": "wow this is bad",
        "review_detailed_main": "The only reason i did not give this abysmal movie a 1 is because i thought the score was very good, and there was a couple of decent set pieces. besides that this is a failure in every way. terrible script, terrible acting, bad directing, the worst special effects ive ever seen, and of course degrading great source material."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mrcowdenbeathfc",
        "review_rating": "1",
        "review_title": "Have I really watched this",
        "review_detailed_main": "Nothing to say apart shameful on the makers . The most embarrassing film I've very seen"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "bombersflyup",
        "review_rating": "1",
        "review_title": "Brutality!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "elpaz79903",
        "review_rating": "8",
        "review_title": "Not as good as MK1, but not the worst film ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "timothygartin",
        "review_rating": "6",
        "review_title": "Great Action and Music",
        "review_detailed_main": "This is an exciting movie to watch. The action never stops from the beginning to the end. The music is amazing as well. It highlights the characters and action sequences perfectly.\n\nSure, there are some problems with the story and direction. It's totally fun to watch, though.\n\nI recommend this one."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "chandean-69762",
        "review_rating": "1",
        "review_title": "Mortal Kombat: Annihilation 1997 Review",
        "review_detailed_main": "\"It's over! You fools! You've been tricked!\" Every aspect of this film is just downright atrocious.\n\nJust like many others have said, this seriously feels and looks like a porn parody of the first film.\n\nThe recasting for Raiden and Sonya Blade is pretty jarring, and the dialogue, VFX, editing and story are all laughably terrible all took a nosedive when compared to the first.\n\nIt doesn't even feel close to finished movie on top of all that.\n\nMaybe the only thing I think I could give this film credit for is introducing new characters like Sheeva, Shao Kahn, and Jax that are all fan favorites from the video game. This even had Baraka, my second favorite Mortal Kombat character right behind Reptile.\n\nMortal Kombat: Annihilation has to be all around one of the worst films i've ever seen.\n\nThe \"dragon fight\" at the end is probably the absolutely worst scene in history."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Cipher44",
        "review_rating": "",
        "review_title": "Garbage - makes you almost ashamed to be a fan of the games",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "tvl-67108",
        "review_rating": "1",
        "review_title": "The cringe level is deadly!!!!!!!",
        "review_detailed_main": "In the first 7 minuites I cringed so much that it made this movie hard to continue."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "feroiuflorin",
        "review_rating": "1",
        "review_title": "Bad acting...really bad",
        "review_detailed_main": "Nothing to add :))...just bad. Bad, bad, bad, bad............"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "timbarclay",
        "review_rating": "1",
        "review_title": "It's just a shame the voting system doesn't go lower than 1",
        "review_detailed_main": "Probably the worst film i have ever seen. On the other hand, it was quite funny because of it. I thought it was amazing that they could make all those bricks look so much like polystyrene. It's a shame because i really enjoyed the first Mortal Kombat film. Line that sums up the film, plot-wise at least. - Sub-Zero? But i killed you in first tournament - No, that was my brother, Sub-Zero. I am Sub-Zero! (Something like that anyway)"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "curiousgeorgiapeach",
        "review_rating": "1",
        "review_title": "A world class story, mega 90s babes, and an all star cast",
        "review_detailed_main": "It is what it is... and that's the tea sis\n\nA real classic. A gem for the kids. A family friendly popcorn comedy for a cozy night in.\n\nKids these days don't appreciate the cultural revolution that was Mortal Combat for the SNES. No respect for the thumb blisters from grinding for hours at 2am with your friends while having a sleep over.\n\nKids these days play on their PSBoxes with their soft comfortable joy sticks and have no idea what rolling a down, forward, X combo for hours feels like. Kids are soft. SNES mortal combat made men out of just mere boys. Don't ever forget how we got here. Aight I'm out. Peace.\n\nPS - this movie is legit terrible garbage trash\n\nWatch for the lolz/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "aleksandarsarkic",
        "review_rating": "1",
        "review_title": "Annihilation of my brain cells",
        "review_detailed_main": "My brain is still damaged from watching this, so i am not sure where to start with review. I was a big fan of Mortal Kombat video game when i was a kid, especially MK3 and its charachters like Noob Saibot, Smoke, Ermac. I have watched Mortal Kombat movie few times, it was never a good flick but it was a solid homage to original video game. Years have passed and somehow i have never watched this one, i had a feeling that it is really bad and i was right, but still after 20 and more years i wanted to see it myself. Recently i had a marathon of watching bad movies only, i really enjoy some campy and cheese movie for brainless fun, mostly from the 80s, and Annihaliton found its place on that list. And i am sad that i gave it opportunity, this was utterly bad experience from start to finish. The direction is awful, fights are short and stupid, acting is beyond any level and CGI is the worst i have ever seen in any movie. Some mentioned that the only good part is Shao Khan played by Brian Thompson, but his acting is ridicilous like everything in this movie. There are too many charachters in this sequel and i think the main goal of this movie was to intorduce all the characters from the game to better sell it in the market. This movie is utter disaster and i dont recommend even to the fans of Mortal Kombat franchise. Stay further away from this one, only if you want to annihilate your own brain cells watched it but be careful, mortal kombat for your brain awaits you."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "cochese-3",
        "review_rating": "1",
        "review_title": "Disgrace to action movies",
        "review_detailed_main": "This had to be one of the WORST movies I have ever seen in my whole life. I had to watch this with my brother since there was nothing on tv. This movie was filled with bad acting, and loads of pathetically choreographed fighting. My guess is that the script had only 7 pages to it because every 2 minutes there was a pointless fight scene."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "breakingbenjamin94",
        "review_rating": "1",
        "review_title": "Mortal Kombat: Humiliation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "shaolinmasterkev",
        "review_rating": "10",
        "review_title": "Raidens acting was top notch, I saw this in theatres as a child!",
        "review_detailed_main": "This is entertaining and the girls have nice tight fitting costumes!\n\nThe actor who played Raiden carried the film in terms of acting, good job.\n\nEverything else was of questionable skill level but was greatly entertaining.\n\nSome special effects have aged badly (poorly done green screen) but adds to the entertainment value even more!\n\nMotaro the centaur-man was in it and so was Baraka! (and Shiva too, ewwww)\n\nThe animal transformation CGI at the end was awful, looked like a Playstation 2 game.\n\nWorth then entertainment!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Island_Of_Ireland",
        "review_rating": "7",
        "review_title": "Good fun",
        "review_detailed_main": "OK let's not take this too seriously here. It's mortal kombat, the story sticks to the game (Street Fighter take note) and the fight scenes are pretty much brilliant for the time, and I'm a Bruce lee/tony jaa fan. Yes the special effects are HORRENDOUS and the acting is pretty bad sometimes...SOMETIMES.Although no excuse can be made for the script. We get to see basically all of the important MK characters (except,sadly, the return of shang and goro) all fulfilling their roles which they had in the game, which of coarse leads to them being rushed in and eventually under used. I like the general colour and fun atmosphere of it though,Emacs red,scorpions yellow,and of coarse liu kang being decimated by smoke for some reason in a very good fight scene.\n\nBut forget all of this,enjoy the movie for what its supposed to be, a colourful action packed pop corn flick So go out,grab an 8 pack and a friend,spark up and ENJOY!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "jimbo-53-186511",
        "review_rating": "1",
        "review_title": "More ridiculous than the first film and worse in almost every way imaginable",
        "review_detailed_main": "Having won the battle of the realms in the first film, Liu Kang (Robin Shou) and others enjoy a short period of peace on Earth. Then one day leader of the outer realm Shao Kahn (Brian Thompson) opens up a portal between the two realms and announces that he intends to merge the two realms in six days. With time ticking away, can Liu Kang and his crew stop Shao Kahn in time?\n\nI didn't care much for the first film, but curiosity got the better of me so I decided that I'd give the sequel a shot (really just to see if it's as bad as its rating suggests, and sadly it is).\n\nThe first film had a storyline that was quite poorly developed, but it wasn't totally ridiculous. Here we basically have a 'world domination' storyline in place because the outer realm lost the battle with the Earth Realm. If you take away all the pretence then it boils down to the outer realm being sore losers. Playing this sequel as a straight forward revenge film would have been a better move.\n\nI'm probably giving this film too much credit by discussing the story because it seemed like the writers didn't care much for the story themselves. It seemed that any time there was an attempt at character interaction or plot development that we would have a ridiculous fight sequence coupled with the over-bearing soundtrack that we saw in the first film. The first film was directed MTV Style, but this film looks as though it was directed by someone on acid - the fight sequences were much more over the top, the editing was choppy and the choreography was laughable. It's almost like the director went for the bigger is better approach, but it just doesn't quite work here.\n\nThe dialogue between the characters was laughable and painful. One of the worst examples of this is when Kahn is looking for a new general. This scene gives us some of the most cringe inducing exchanges of dialogue that I've ever heard. We're also handed some laughable plot twists, villains that are more cartoonish than anything else and don't even start me on the final fight scene between Liu Kang and Kahn sigh....\n\nThe only thing that made this film very slightly tolerable was Jax. He provided the film with the occasional moment of comic relief, but this aspect alone is not enough to save this utter shambles. The only other minor positive that I took from watching this sequel is that it made me appreciate the first film more. Yes the first film was quite a bad film with a multitude of problems, but it was nowhere near as embarrassing or laughable as this sequel."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "theonearmedman",
        "review_rating": "",
        "review_title": "My eyes!!! They Hurt!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Toonces-0",
        "review_rating": "1",
        "review_title": "What were they smoking?",
        "review_detailed_main": "If I had the choice between dying from a terminal case of kidney stones or seeing this movie again, I would die a happy man knowing that I had only seen this awful movie once.\n\nPut simply, \"Mortal Kombat:Annihilation\" makes the \"American Ninja\" movies look like Bruce Lee masterpieces. The action was laughably stupid; the dialogue was utterly atrocious; and the plot somehow managed to lack a beginning, a middle, and an end. Did this movie even have an editor?\n\nWell I guess you can't expect (and probably shouldn't) expect much from a movie based on a video game. I guess the only thing more ridiculous than making a movie based on a video game is making a movie based on a breakfast cereal.\n\nHmmm... I guess I won't be surprised to see \"Lucky Charms: Annihilation\" opening in cinemas soon...\n\nThe makers of MK:A should be thankful to movies like \"Night of the Lepus\", \"Dusk till Dawn\", or the \"Ernest Goes Somewhere or Does Something\" movies; for without them this movie would easily be the worst piece of cinematic sputum of all time."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "10086cn",
        "review_rating": "1",
        "review_title": "truth",
        "review_detailed_main": "Just so you all know, this IS as bad as everyone (except for those giving this 10 stars) says it is. Please don't bother watching this, and please don't listen to the people defending this movie. It'll be all worth it in the end."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "rowlf",
        "review_rating": "1",
        "review_title": "THE WORST MOVIE EVER",
        "review_detailed_main": "This is the worst movie ever made. There is nothing redeemable about this movie. There is no plot, character development, cohesion between scenes (or within scenes), and terrible acting and directing. The action scenes were terrible as well. Usually I'd say that one shouldn't use a word more than once in a piece, but terrible is the best word to describe this piece of garbage. I only saw it as a trade-off with a friend whereupon I saw this if he saw Boogie Nights."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "svubdmsrm",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "This is a direct continuation from the first movie. You only need to see the first few scenes to get all warning signs. They replaced many actors immediately (or the others left in terror;-). Raiden is the most apparent example. Its like you replaced Dirk Nowitzki with Bernie Sanders without any remarks (Visually not Basketball related. I must admit that this idea would be interesting in real life). Then there is the story and acting. While the former movie got the right balance of seriousness and taking itself not too serious, this movie fails. There are a lot of scenes / stuff that should be engaging. But it is pointless, an under-performance or unintentionally hilarious. I don't blame the actors. Even the best actors /actress cant get much out of an awful script or a bad role. What troubles me the most are the sparks of good ideas in this movie. With adaptations and improvements you could make a better or even good movie out of the setting and some ideas. Then there are the fights. While I admit that the final confrontation is engaging the total performance is disappointing. It is sadly not even \"So bad that it is good\". That would at least improve the rating. Overall I would not rewatch and forget that this movie exist. The best I got out of it was the idea to let Dirk Nowitzki play Basketball against Bernie Sanders (and his team?). This has more potential than this movie;-)."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "disdressed12",
        "review_rating": "1",
        "review_title": "a complete mess,with no point.a useless sequel",
        "review_detailed_main": "wow.what a piece of crap.this movie blows.the first Mortal Kombat is no classic,but compared to this movie it is like Shakespeare.this movie has very little merit.there is so much wrong with it,it is hard to know where to begin.first off,the fight scenes are ridiculously over the top and way too protracted.the acting is abysmal,with very few of the original actors returning.in particular,the guy playing Rayden is miscast,to say the least.also,the actors playing the villains are not believable,so there is no sense of jeopardy or urgency to the film.the whole mess plays more like a comedy than a serious movie.the good guys have no depth,so you really don't care what happens to them.I also have to mention the stilted dialogue and the wooden delivery of almost every line.the music was also distracting and grating,especially during the fight scenes.i could not watch this movie all the way trough, because it is so awful.this is a completely incoherent mess.a definitely inferior remake,which should never have been made.at least the original has some heart to it. the sequel has some okay special effects,but not enough to recommend it. 1* which being liberal."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "cardsrock",
        "review_rating": "2",
        "review_title": "Now THIS is a fatality!",
        "review_detailed_main": "I was prepared for this to be a cinematic travesty and it still blew me away. My god this movie is bad. The first one is no masterpiece, but it was at least a movie. This is a string of incoherent scenes with incomprehensible dialogue. The only reason it doesn't get a 1 is because of the often hilarious unintentional comedy."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "leoiscooler",
        "review_rating": "3",
        "review_title": "fails at pretty much everything",
        "review_detailed_main": "Wow. where to start with this...\n\nThis movie is pretty much a complete bomb in every aspect. With an exception of Lui Kang and Kitana, EVERY character is replaced. and not for the better.. Personally, I think Sonya Blade is hotter in this one than the first but she's a worse actor so that pretty much cancels out.\n\nThe story is garbage! It doesn't even follow the game! It's clearly noticeable that the ONLY goal as far as the story, was for it to include as many characters and their 'in-game moves' as they could regardless of their back stories. For example, Jax is a character that lost his arms in the game and replaces them with robotic ones. In the movie, he has his arms but they are 'muscle enhancers'... doesn't even make much sense to me.\n\nI honestly can't tell if the script is god-awful or the acting. Was it a great script that was poorly performed or great performances that had to be executed the way they were due to how it was written? I take that back. I can tell. It's both a terrible script with god awful performances.\n\nSets, costumes, and stunts were all pretty bad as well. The costumes make you feel like you're in a college Halloween party while the sets look like they were cheaply made at my mom's house.\n\nThe stunts/fight scenes are all executed in a way that made them seem like they were trying to be the deleted fight scene of a power rangers episode.\n\nThe soundtrack from the first movie went platinum! In 10 days!! This time? It sounded like a 10 year old kid's Zumba class...\n\nOverall, this movie ONLY to be watched as a joke. It is the epitome of the thought that a video game should STAY a video game! I gave it 3 stars because I'm a huge fan of the game so seeing some of my favorite characters was cool (even if I had to be some form of intoxicated to enjoy it) and also, this movie helped guide me to know what NOT to have made my scorpion Halloween costume look like."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "cyntax2000",
        "review_rating": "10",
        "review_title": "My Second favorite movie of all time",
        "review_detailed_main": "Once again. you guys need to learn how to have fun with cool cheesy movies. Ans once again to all you video game junkies, my sympathies (i guess) this movie rocked and ruled beyond any words could possibly say. first the casting. sooooooo much better than the original. Sandra Hess did a much more warm and believable Sonia Blade. and common James Remar, deadpan and srait performance make him the ultimate Rayden. The only fault is the untimely death of Johnny Cage, masterfully played by Chris Conrad this go around. Brian Thompson is also very impressive as Shao Khan. I loved the Biblical references in this one as well. Also the nonstop balls to the walls in your face action sequences. This movie just never let up. All I can say is Awesome beyond awesome, baby. I highly recommend this one, especially to Doctor who fans."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "WoBiE1",
        "review_rating": "7",
        "review_title": "It was fun.....",
        "review_detailed_main": "The sequel to the first Mortal Kombat game can not be compared to the original in any way. It totally takes away any character development the first one had and made it one long fight movie with LOUD techno music. Don't get me wrong; I had fun watching this movie because of the soundtrack that was present. I still listen to the soundtrack with me feet tappin (well, sort of). It had enormous potential, but like so many other sequels in any genre, it did not have an original script to go along with it. Anyway, it is enjoyable on some level but don't expect a lot. Trust me."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "dgmsimoes",
        "review_rating": "2",
        "review_title": "See at your own risk",
        "review_detailed_main": "Horrible acting, bad story, weak martial arts, terrible visual FX, awful directing and cutting and mediocre Sound FX\n\nGood there are such bad movies so that we can use the whole stars rating scale."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "lechihoanglonghiie",
        "review_rating": "",
        "review_title": "The kind of garbage sequel!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "aleksanderk-95350",
        "review_rating": "3",
        "review_title": "WTF happened with this film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "qrrfen",
        "review_rating": "1",
        "review_title": "Even worse",
        "review_detailed_main": "While I do give this movie some credit for trying to remain loyal to the games, it kind of get lost in trying to do too much and not doing anything significant to explain a thing to the audience. Even a die-hard MK fan as myself had to go WTF when watch this movie. Overall: An extremely poor example of a movie that just seems to be there to milk the franchise for all its worth. Not to mention the extremely BAD \"acting.\" Almost makes the Street Fighter movie look like Shakespeare."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "knt2000",
        "review_rating": "1",
        "review_title": "Not as good as the first MK Movie.",
        "review_detailed_main": "The entire movie was just plain dull and boring. A lof the fighting scenes sucked which only lasted at least 1 or 2 minutes and there were too many special effects. The director shouldn't have added the characters from the MK3 and UMK3 video games. I think that they should stick with the MK2 characters from the video game along with the story, battle stages and fatalities. If they're gonna make an MK3 movie, it better be as damn good as the second."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "ericmastra",
        "review_rating": "1",
        "review_title": "Best time I ever had at the cinema... Let me explain.",
        "review_detailed_main": "Worst movie ever, but shortly in, my buddy and I decided to do a live version of \"mystery science theater 3000\", making out loud jokes about every scene and line. The audience loved us so much, they stayed til the end. We got many compliments upon exiting, stating we were the only reason they stayed the duration of the movie. It was a blast of a time, but a miserable movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "cyphmills",
        "review_rating": "1",
        "review_title": "Mortal Kombat: Viewer Annihilation",
        "review_detailed_main": "Well, let me tell you...it's a real let down. Mortal Kombat: Annihilation. I watched the original Mortal Kombat when I was about 10 years old, and it was bloody brilliant to me back then, it's still \"ok\" not absolute garbage, unlike its sequel.\n\nMortal Kombat: Annihilation has no substance, form, direction or anything remotely resembling a competent cast of actors. The director must have been a coffee machine or something, I really can't see why they decided to make a sequel. The first movie beats it easily.I quickly hit IMDb to check the scores of both the original and MK: Annihilation...\n\nA dismal score of 5.0/10 for MK, and an even lower 3.0/10 for MK:Annihilation. So I was like...\"Damn, this is a glorified power rangers...\" I could see from the start it was, when Raiden fires lighting at the beginning, it looks as though someone has put a giant bitmap overlaid onto the movie and moved it around a bit. RAIDEN btw, is now a less-hardcore version of the original kick ass Christopher Lambert Raiden, if you're gonna remove Lambert, then you need someone fairly bad ass, so what do they do? They give us a Doogie Howser lookalike who is in need of orthodontic work. Every time we see him he's through a brick wall or falling off something high. He's like a piece of ham, but with less acting ability. All his words of 'wisdom' are like \"We have to work as a team, courage...courage...look within yourself at your...courage.\" Jax is just a token black guy, Sonya is admittedly hot, but not as hot and/or as kick ass as the original Sonya. Johnny Cage gets instantly killed by some 'thug' in a skull (the final 'boss') at the very beginning. Kitana and Liu Kang are just like the 'sexually' tense element of the film. They have the funniest (not meant to be funny) part of the movie, where the \"hardcore\" Sheeva, with 4 arms, having spent the entire movie looking fearsome and generally like a big, brutal beast...runs in and says \"The date is over.\" In 5 seconds she gets killed by a falling cage, now that is comedy folks. 10 seconds of pure \"Why was she even in the movie?\" goodness.\n\nThere isn't a semblance of a decent camera angle, all the scenes are \"misty\" and \"firey/smokey\" and really don't add well to the overall ambiance of the movie, they make it seem more like an 8th Grade production of some bad Shakespeare play no one cares about.\n\nOK, the first movie wasn't THAT good, but it was a 'heapload' better than the sequel, which IMHO should never have been made, I mean...they can't even use \"We needed to make money\" as an excuse, because I'm sure even the caterers who worked on this film have never been able to find work since.\n\nAh well, this is one of the worst movies I have ever seen, it's like the biggest disappointment to me, as for years I was like \"I have to see MK annihilation\" because the first one in my mind was embedded there as something \"good\". Thanks a lot John R. Leonetti I know now that you can't direct. At least not anything past Power Rangers or something? Anyhow, thats just how I felt about this movie. T_T"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "bhernandez2216",
        "review_rating": "1",
        "review_title": "What a ripoff",
        "review_detailed_main": "The sequel was the worst of the worst movie of the year, and it killed the franchise. What happened to you Mortal Kombat? It had worst CGI, acting, and mush more."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "3",
        "review_title": "One of the more infamous sequels of the past twenty years, \"Mortal Kombat: Annihilation\" is a fundamental mess, though it is certainly good for plenty of unintentional laughs.",
        "review_detailed_main": "One thing all 90's kids can agree on is that 1995 brought us one of the most kick-butt movies of the decade with the release of the movie adaptation of \"Mortal Kombat\"- based of course on the popular arcade games of the same name.\n\nIt was a huge hit, coming out at the perfect time to thrill audiences in a market that hadn't yet suffered martial arts and CGI overload. It boasted a fun storyline with mayhem and magic, had that amazing techno-song, was populated with likable actors and was filled to burst with tons of awesome moments. Who doesn't remember the hilarious intro to Johnny Cage, or the amazing puppetry on Goro, or the sweet Liu Kang VS Sub-Zero match?\n\nWith the game series ever-growing and expanding the mythology and the first film being such a pleasant surprise, we just knew that the inevitable sequel was gonna be bigger and better! There's no way it couldn't!\n\n...right?\n\nThen reality slapped us in the face with 1997's \"Mortal Kombat: Annihilation.\" A film that has gone on to join the ranks of \"Batman & Robin\" and \"Speed 2\" as one of the most infamous sequels of not only the 90's, but arguably of all time. A failure that squanders all potential and destroys virtually all left-over good-will from the first movie and instead replaces it with laughable writing, strangely over-the-top performances, bizarrely dated effects even at the time and mind- blowingly bad visual direction.\n\nPicking up immediately after the original ends, the evil emperor Shao Kahn opens a portal from Outworld and begins a process that will merge it with the Earth in six-days time, giving him total power. Now, our Earth-heroes Liu Kang, Sonya Blade, Jax and Raiden must find a way to stop this devious scheme or else the Earth will be lost forever.\n\nThat may sound like a solid enough foundation to build a movie off of, but trust me... it doesn't work. The film is beyond fractured and frankly every single scene just lumps on more plot-holes, unanswered questions and contrived pseudo-explanations in order to justify the proceedings... mainly so it can tenuously connect the constant onslaught of bad fight scenes that make up a majority of the screen time.\n\nDirector John R. Leonetti seems in over his head with this film- his directorial debut, taking over for original director Paul WS Anderson. Leonetti and his army of screenwriters are never able to find any real sort-of balance with tone, pace or style. Scenes come and go are strange intervals, humor and drama never quite gel together, and sub-plots and characters are constantly jarringly introduced and dropped without consequence or reason. The visuals are also a marked step- down from the original, with many shots being poorly thought- out and unable to be cut together competently.\n\nThere's also the issue of padding and choreography in many of the fights that lends to it all feeling very dull and forced. While the first film's action does have a slight air of feeling \"fake\" in retrospect, it can be forgiven as it was one of the first truly hit martial-arts-based films in the US. But this one just ramps up that problem, with so many unneeded flips and tricks that are thrown in to be \"cool\" and \"the bomb\", that it just feels tacky and false. By the time you see the thirtieth random backflip, you'll feel like doing some flipping yourself... flipping the channel to something else.\n\nThe performances are among some of the hammiest I've seen in a major blockbuster. The only person who really emerges unscathed is the criminally underrated Robin Shou returning to his role of Liu Kang. He's great. Everyone else? A caricature. Lynn \"Red\" Williams as Jax is a giant goofball who throws around unfunny one-liners like its nobody's business. Reiner Schöne chews the scenery as Kahn's evil father. Brian Thompson constantly SHOUTS his lines at RANDOM in an attempt to sound THREATENING as our lead villain. But of course Musetta Vander steals the show with her legendarily bad take on Princess Kitana's mother Sindel, spouting some of the worst dialog ever written with the glee of a 12-year-old on a sugar-high. It's outlandish watching her twirl and cackle and wave her arms about in her scenes... What did she think she was even doing? Was she trying to channel Ace Ventura for her role?\n\nAdd to that...\n\n-Lowered production values (Gag-worthy green-screens and clearly rubber \"metal\" on the costumes and sets galore!)\n\n-Shoddy costume design that looks like the actors are dressed in the Wal-Mart Halloween costumes based on the movie rather than in real movie costumes\n\n-Wildly dated effects that looked bad even in 1997 (We're talking \"Tron\" quality CGI at times... except this was made 15 years later)\n\n...and more and you have a recipe for disaster.\n\nThat being said, I do have to make a somewhat startling admission...\n\n...I kinda like this movie. Oh, it's bad. It's really bad. But it's so bad, that it springs right back up as one of those unintentional \"so bad, it's kinda good\" camp classics. There's no way to hear lines of dialog like those you hear in this film (\"You're alive!\" \"...too bad YOU WILL DIE!\") without howling with laughter. There's no way to see the incompetent fight sequences where people are flipping through the air like helium-filled balloons without chuckling and shaking your head. There's no way to see the awful, 80's quality digital creatures flying about without a big-old smirk coming across your face.\n\nSo, if you like so-bad-they're-good flicks... This is one for the ages!\n\nI give \"Mortal Kombat: Annihilation\" a 3 out of 10. It's an awful sequel that effectively killed a franchise. But with some friends and maybe some booze, you'll still have a grand time tearing it apart and laughing at its sheer ineptitude."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "dainton9",
        "review_rating": "10",
        "review_title": "A very COOL MK adaptation! Interesting, fun and specular!",
        "review_detailed_main": "Many people complain that this movie is \"bad\" \"worst ever\" and such things, but it's maybe because they haven't play the game, or for them the budget is too low. But all this is damn, the real thing that the movie is perfect in adaptation. Almost all players have appeared in the movie, their movements and even their special abilities: Smoke- launches rockets with the same movement as in game, Jax returns, but now with his METAL ARMS(!), Cyrax- launches acid web, Sub-zero- freezes. Yeah I know that the budget's not too big, 40$ millions, but that's not the point, the point that the director tried to transcribe the game universe on the screen. And did it successful, there a lot of encounters, special effects, cool-techno-music and all this makes it very interesting Mortal Kombat: Annihilation movie. I like the game and I admire low-budget movies with their cheap effects. But if you don't, simply DON'T WATCH IT. First play the MK games series and THEN compare with the movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "zsbiw",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "This movie has characters from the first 3 Mortal Kombat video games. There is a lot of action in the movie. It picks up right where Mortal Kombat (1995) left off.\n\nIf you are a Mortal Kombat video game fan, Annihilation and the 1995 MK movie are perfect for you.\n\nI would avoid the 2021 Mortal Kombat movie. That one isn't like the video games."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "heavenorhell",
        "review_rating": "2",
        "review_title": "So bad it's good. Almost.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "quixoticroger",
        "review_rating": "",
        "review_title": "Absolutely Bloody Awful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "CasperGemini",
        "review_rating": "5",
        "review_title": "VHS Movie Feedback",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "FeastMode",
        "review_rating": "1",
        "review_title": "lmao",
        "review_detailed_main": "I watched the first one a few years back. I thought it was horrendous and gave it 1 star. This is soooooooooooooo much worse. I don't even understand. There's too much to go through. You have to experience it for yourself.\n\nI thought it would be \"so bad it's good\" enough to possibly warrant revisiting. It started off that way with soooo many hilarious moments packed in the first ten minutes. It slowed down a lot for most of the middle. But the end is amazing (1 viewing, 10/29/2021)"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "RNMorton",
        "review_rating": "5",
        "review_title": "I'm sorry, did you say something?",
        "review_detailed_main": "Did you say how absolutely bad this movie was? That it looked like a glorified Power Rangers episode? I didn't hear you, I was distracted by Sandra Hess flying through the air in her white muscle shirt. That in and of itself makes this at least an average movie. 5/10"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "goevikes",
        "review_rating": "3",
        "review_title": "Can't beat the first, but still fun.",
        "review_detailed_main": "Although this film can't really compare with the origional Mortal Kombat, it's still a fun film.\n\nThe one problem I have with this one is that too many of the scenes could only be understood by a fan of the games. I am one but I got a little tired of answering such questions as these (with answers to help the fan impared):\n\n\"What are these robots here for?\" Cyrax, Smoke and Sektor are robots out to get subzero for betraying his clan. To fit them in this film they were reprogrammed to go after our heroes.\n\n\"Who was that chick in the pink who looked like Kitana and attacked Sonya?\" That was Mileena, Kitana's Evil Twin.\n\n\"What about that thing with the blades and the severe need for an orthodontist?\" Baraka. A freaky weirdo from the games who is never really explained\n\n\"And the Shao-Kahn's four cronies?\" The red guy is Ermac, a somewhat enigmatic fighter for Mortal Kombat 3\n\nThe purple one is Rain. A weather controlling ninja who is killed before doing anything cool in this film.\n\nThe 4-armed freak is Sheeva. Sindel's shokan guardian thought up by taking a hindu god, giving it a sex change and mis-spelling its name\n\nThe centaur is Motaro, a sub-boss from the games who's species hate's Sheeva's species.\n\n\"Who is Nightwolf?\" An indian who really kicks butt in the games\n\n\"What is this animality crapola?\" A type of fatality from the game in which you turn into an animal and kick butt\n\nMy one real problem with this film is that fact that Christopher Lambert and Bridgette Wilson seem to have been replaced. Why?\n\nRating: A-"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Mobutu",
        "review_rating": "1",
        "review_title": "...I don't think there's actually a word to describe it",
        "review_detailed_main": "I don't think there's actually a single word to describe \"MK: Annihilation\", so I'll write a few dozen.\n\nA big Mortal Kombat fan, I was really excited going into this film, especially after the first movie, which was decent by any standard (and bloody marvellous by mine). From the very beginning, you can tell you're in for something special. \"Annihilation\" is right there next to the classic \"Star Crash\". Boon and Tobias had the opportunity to really make a real mark, and they did: a big brown one on the underwear of film.\n\nWith its CGI, plot and dialogue for which polite adjectives don't exist, MK2 is a movie to be missed. Admittedly, I had high expectations, but this film is an insult, a travesty and a BIG disappointment all in one neat Hollywood package."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mark.waltz",
        "review_rating": "3",
        "review_title": "This movie wasn't directed. It was choreographed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "culwin",
        "review_rating": "5",
        "review_title": "Really not that bad",
        "review_detailed_main": "Don't get me wrong, it's not that good either. It's a step down from the first movie, for sure. But it's got a bunch of stuff from the game(s), and lots of fighting. What more do you want? Oh, a plot? Well yeah, that sucks. The effects suck too. But whereas other video game movies would remove a lot of the game references and fighting and ATTEMPT to have a plot (but probably still fail), this one gives up all those pretenses and just focuses on the (mortal) kombat. One thing that could have improved the movie is more special moves and finishing moves from the game, but otherwise, it's a very \"meh\" sort of movie. Far from the worst I've seen, though."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "spu78",
        "review_rating": "8",
        "review_title": "Enjoyable for action fans",
        "review_detailed_main": "A pretty good sequel, not as good as the first one, but still a really fun action movie. Lots of fight scenes, with more characters from the games than the first one had.\n\nThe story isn't great, but there is actually more story here than the first one had. Of course, story isn't really important in a movie like this, and the important part, the fight scenes, are great. The acting isn't great, but it is funny at times.\n\nA good rental for anyone who is a fan of the 90's video game/comic book hero movies (Street Fighter, Mortal Kombat, etc.). Also, the music is still great."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "poolandrews",
        "review_rating": "7",
        "review_title": "\"I'll take my Mother.\" Very bad but at the same time perversely lots of fun.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "DJ_Shilo",
        "review_rating": "1",
        "review_title": "Worst of 1997 - Insulting with Zero Effort",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "MariaDeJesusNieves",
        "review_rating": "",
        "review_title": "Don't believe the negative reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "3",
        "review_title": "Terrible",
        "review_detailed_main": "This movie is one of the worst and ridiculous movies ever. It was very difficult to watch, I got bored while watching it. The actors' performances are terrible, the script is terrible, the effects are terrible. It's a terrible movie all round."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mcquillenlewis",
        "review_rating": "1",
        "review_title": "W... What?",
        "review_detailed_main": "What just happened? Was this thing supposed to be a sequel to the legendary Mortal Kombat or Power Rangers?\n\nThis looks so bad..."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "worldsworstwryter",
        "review_rating": "3",
        "review_title": "Downgrade from the first in every possible sense.",
        "review_detailed_main": "This made me appreciate the original even more. To be honest it's a giant slap in the face to the first movie in pretty much every way.\n\nThe cgi is bad on the level of foodfight, and unfortunately almost the entire cast has been replaced. That means no more spectacular Raiden performance from Christopher Lambert, which was very disappointing.\n\nThe story was all over the place and all I could think while watching was 'What did I just see?' 'Why did that happen?' 'Wait, did someone just turn 2D and get folded up like paper Mario?' Seriously, the plot was bafflingly random and nonsensical.\n\nI will say though, it is a very funny movie with a lot of memorable moments and quotable lines, although maybe for all the wrong reasons. But still, I can't say I didn't have some fun while watching, but it would definitely have been more fun if they kept the original cast. Especially Raiden. 2.9/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Honesticedragon69",
        "review_rating": "3",
        "review_title": "Doesn't Even Belong In Outworld.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "JAW",
        "review_rating": "4",
        "review_title": "Cheesy Fun",
        "review_detailed_main": "Ok so this movie is brainless. SO what? It's still a cool movie. Especially when compared to other video-game-to-movie-translations. Just lower your standards a little (well, actually a lot) and you'll have fun with this movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "adammcadam",
        "review_rating": "4",
        "review_title": "not amazing but real martial artists",
        "review_detailed_main": "The people claiming that this movie is the worst film ever made are simply people who are not fans of martial arts or martial arts films, and who wouldn't be able to distinguish between a Hollywood film with actors who know no martial arts with fight scenes comprised of closeups, and a martial arts film comprised of real martial artists showcasing real talent. The film is not amazing, the acting isn't amazing, the plot isn't amazing, the directing isn't amazing etc. However to anyone who enjoys martial arts there are real talented people in this film and a few nice martial arts moves to see. Sandra Hess European karate champion as Sonya Blade, Robin Shou Wu Shu gold medal winner in various competitions in China, JJ Perry 5th degree taekwando and 2nd degree hapkido blackbelt etc.. There are not as many good martial arts moments as a good deal of other martial arts films, the film could have gotten a lot more out of all of this talent that's for sure, however there are still talented martial artists in this film and there are one or two nice moves to sit and watch for any true martial arts fan."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "BandSAboutMovies",
        "review_rating": "2",
        "review_title": "This one finished the franchise...almost!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "OrangeClown",
        "review_rating": "10",
        "review_title": "So Bad Its Pure Genius.",
        "review_detailed_main": "Plan 9 seems to be everyones favorite Bad But Good film, but mine is right here. This movie is so blatantly stupid, Ex. the ending, that its terrific! I've never laughed harder than that one part where Kitana explains how Liu Kang must defeat Sub Zero using water!!! And Jax coming out of the blue, from this hospital (it looked like) for no reason.\n\nGotta love it. 10/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "DavyDissonance",
        "review_rating": "7",
        "review_title": "I Hate Myself",
        "review_detailed_main": "I will readily admit that I have lost all credibility as a human being and a film lover because, yes, I liked Mortal Kombat Annihilation. My reason for liking this movie is that it reminds me of poorly made wacky left field Hong Kong action movies made in between 80s and mid 90s. It also reminds me of a couple of crappy movies I like; one being Black Mask 2: City Of Masks and the other Manborg. Anyways, yes, this movie has crappy CGI, horrible acting, a brain-dead story, piss poor dialogue and some of the characters look retarded. Guess what? I love this movie for the all these reasons. Plus some of the settings are pretty nifty looking and the martial arts action was actually pretty good. Yes, tell me I like to deep throat floppy donkey ding dong. I don't care. Mortal Kombat Annihilation is great."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "pf-matt",
        "review_rating": "3",
        "review_title": "The Kombat was pretty cool but the acting was the worst i have ever seen.",
        "review_detailed_main": "This movie was actually alright but that is only because all of the kombat and cool graphics were pretty cool but the acting was so awful. i honestly dont think i have seen any movie have the acting be so awful. Plus, there shouldn't of been some changes in the actors and actresses in some of the Roles.(Rayden and Sonya). I give Mortal Kombat: Annihilation 2.8 out of 10 stars."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "DomNickson843",
        "review_rating": "",
        "review_title": "Absolute Garbage!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "It's based on a videogame...isn't that enough to say?!",
        "review_detailed_main": "Traditionally, movies made from videogames are crap...at best. While you might have a very hard time thinking of any good ones, horrible films like \"Super Mario Brothers\" and \"Mortal Kombat: Annihilation\" quickly come to mind. Why? Well, because videogames don't need to be deep, have much plot or even make sense if the game play is good. Here, however, as a passive observer, all the lack of substance in the game plots are obvious as you sit and watch the silliness. Think about it....this is based on a game whose only plot is people punch and kill each other!\n\nI ahve not seen the first \"Mortal Kombat\" and the only reason I saw this one is that it's on IMDB's infamous Bottom 100 list...the lowest rated 100 films which have received at least 10,000 votes. This means independent and almost forgotten films aren't on the list...just the bigger named, widely distributed crappy movies.\n\nFrom what I gathered, humans winning the first movie guaranteed that the Earth would be safe for like 100 or a bazillion years. However, here, the baddies from another world are back only two years later. So much for continuity. In the initial portion of the movie, they tried to explain this away to all the human characters, as they also realized the plot problem! That's clumsy. So, the rest of the film consist of some human warriors somehow overcoming Shao Kahn's evil gang of fighters.\n\nSo is this any good? Of course not...10,000+ voters aren't wrong in this case. But there are some good things about the film. For 1997, the special effects are very nice--which is important since the story is essentially ALL special effects and crazy costumes. Also, they captured the look of the game quite well. But, no the other hand, the film is simply one insane fight after another after another after another. Not much plot...and it all makes your brain very numb very quickly. In fact, after about 20 minutes of this, my brain was screaming for a break! Overall, a pretty dull film despite its almost constant action and nutty fight scenes. I simply didn't care about any of these characters and just wanted it all to stop! My verdict...just go play a videogame yourself...you're bound to have more fun."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "ryukang-41655",
        "review_rating": "1",
        "review_title": "Fatality.",
        "review_detailed_main": "Mortal Kombat: Annihilation could have easily made the franchise into a successful trilogy of movies, but as the tagline implies, this movie destroyed all expectations.\n\nEverything that worked in the first movie is absent here. The majority of returning characters are portrayed by new actors (with the exceptions of Robin Shou as Liu Kang, and Talisa Soto as Kitana). It also doesn't help that the acting this time around is terrible as everyone's performances range from stale (James Remar as Rayden) to over the top (Brian Thompson as Shao Kahn).\n\nThe script is riddled with plot holes, and comes off as nonsensical. The movie also follows a simple pattern; fighting, running, talking, and it goes on throughout the entire run time of the movie.\n\nThere is a lack of character development as the movie attempts to cram in as many characters from the more popular games in the Mortal Kombat franchise (mainly Mortal Kombat II and MK3), and the majority of them have limited screen-time as they either get killed off, or disappear after their 1 scene.\n\nOf course, we have to take a look at the action, but the fight scenes are pretty lackluster this time around. We had some impressive stuff choreography-wise in the first movie, but all of the fight scenes here feel rushed.\n\nThere's an overabundance of special effects in the movie, and yet, every single one of them look terrible, even for 1997. Supposedly, this movie had a bigger budget than the first movie, and yet, it looks nowhere near as impressive. Production and cinematography- wise, the whole movie looks and feels like a cheap straight-to-video sequel rushed out to capitalize on the success of the first movie.\n\nMortal Kombat: Annihilation suffers the same problems as the majority of the other movies based on video games, it didn't feel like they tried to make a proper movie based on the game, but instead a product that tries shoehorning references to said game in a way that feels gimmicky, but as far as the genre goes, this stands as the worst film of the genre for being a colossal disappointment following its entertaining and well made predecessor, and a prime example of shoddy filmmaking (so much that it almost rivals anything directed by Uwe Boll).\n\nDo yourself a favor, stick to the first movie and the video games, avoid this stinker."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "rharrison-36701",
        "review_rating": "1",
        "review_title": "One of the worst movies I have ever seen!!",
        "review_detailed_main": "I loved the first Mortal Kombat movie. Paul W.S. Anderson did a great job directing it. This one was dreadfully directed by John Leonetti. It was very lazily done. Props were cheap and it seemed all rushed. Cannot stand what they did. I was disappointed then and still disappointed now. At a time when movies like Titanic were coming out, the effects were bad and worse than movies like Terminator 2 which came out six year earlier. Avoid"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "HadiAriyan07",
        "review_rating": "1",
        "review_title": "Just kill me",
        "review_detailed_main": "The greatest sequel to the greatest video game movie ever made!!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Terryfan",
        "review_rating": "2",
        "review_title": "Flawless Disappointment",
        "review_detailed_main": "Mortal Kombat: Annihilation is consider by many as one of the worse video game movies ever created and with good reason.\n\nThe film from the get go shows that it had no desire to make a huge impact the only impact this film has that is even close to being consider memorable is that this film just shows how a sequel can pretty much ruin a whole series.\n\nIt features some of the worse visual and special effects that can easy to be set up as a video game. I mean video games had better visuals then this film has all together.\n\nAs a fan of the first Mortal Kombat movie I will say yes that film wasn't perfect but it had at least try to make itself a hit and it was.\n\nI consider the first Mortal Kombat to have been done right. Mortal Kombat: Annihilation does not.\n\nThe acting in the film is simply awful the cast seem that they were trying to make a bad video game and also the writing in the film is just plain bad. Also the story is really weak.\n\nPerhaps the best thing about the film is that if you don't watch it you'll be better off because this film really don't do anything to award the viewer\n\nI give Mortal Kombat: Annihilation an 2 out of 10"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Screen_Blitz",
        "review_rating": "1",
        "review_title": "Unappetizing sequel to the video-game-based original is not just bad, it's preposterously bad",
        "review_detailed_main": "The Mortal Kombat franchise has become a massive hit among gamers around the world, despite the overwhelming controversy surrounding its portrayal of graphic violence. This sparked a film adaptation which was crafted in the hands of Paul W. S. Anderson. Although the original was far from reaching a classic status and fell short of its cinematic potential in terms of writing and visuals, there was at least some level of competence to be endured. This sequel on the other hand, is an abhorrent disaster. Stripping away from the proper ingredients of a competent fantasy epic, this film operates at an significantly low level of proficiency, a level that makes its predecessor look like an Oscar flick. Sustaining a hodgepodge of a thinly written plot, painfully inept visuals, and paper-thin characters, this film is a cinematic inert slog that slips into the cracks of unintentional comedy. Picking up where the last film left off, Shao Kahn (played by Brian Thompson), an evil emperor from a realm known as Outworld has invaded Earth and set it wipe out the human race with his sadistic extermination squad made up of characters only the fans of the video game would be familiar with. With the rules of the Mortal Kombat broken and the fate of humanity at stake, Liu Kang (played by Robin Shou), Sonya (played by Sandra Hess, replacing Bridgette Wilson), Raiden (played by James Remar), Kitana (played by Talisa Soto), and half-human, half-robot Jax (played by Lynn Red Williams) become the last line of defense against Shao Kahn's tyranny.\n\nThe conductor behind this cinematic misfit is John R. Leonetti who replaces original director Paul W. S. Anderson who went to work on the science-fiction horror thriller 'Event Horizon'. If there is anything that Leonetti successfully accomplishes throughout this picture, it would be staying faithful to the source material. Everything else though, is a simply a disaster. While the story kicks off a passable premise, it is not long before the plot melts into a generic slog. The story advances at a brisk pace with multiple fight sequences punctuating at every turn. This would be account to some excitement if these sequences were actually fun, or even visually appealing. Unfortunately, the action is sloppily decorated with laughable CGI and poor blue/green screen effects that render them thrill-less. And like the original, they shed away from the M-rated graphic violence that the video game franchise is widely known for. The biggest eyesore comes in the final battle sequence in which Robin Shou's Liu Kang morphs into a giant dragon resembling an abysmal paper cutout of Godzilla. As for the acting department, very few of the cast turn in competent performances. With the character pitted with cheesy dialogue that is more likely to provoke unintentional chuckles than emotional impact, it is genuinely difficult to connect with these characters even when the fate of the universe at the stake, unless you have grown a fandom of them from playing the video games.\n\nMortal Kombat: Annihilation is the epitome of a cinematic sequel gone wrong, and is one that should strongly be avoided, unless you are looking for something in the \"so bad it's good\" category. The film is horribly crafted in terms of narrative and visual compulsion. In a good of advice, you would probably making better use of your time by sticking with the original."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "ericstevenson",
        "review_rating": "1",
        "review_title": "I'm taking a deep breath",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mrspasm",
        "review_rating": "10",
        "review_title": "Friendship....friendship....again?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "swat-3",
        "review_rating": "7",
        "review_title": "Great Music",
        "review_detailed_main": "Not a great movie, but boy were the music and sound effects great, they really made the action more enjoyable.\n\nThe film was not trying for any oscars, it was just a fun movie, which was enjoyable to watch."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "isamessi-34555",
        "review_rating": "1",
        "review_title": "NOT ENJOYABLE",
        "review_detailed_main": "Sorry Mortal Kombat lovers, this movie is terrible. People say it's so bad that it is enjoyable but it ( for me ) was so boring and burnt my eyes.\n\n\n\n1/10"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "cutloose-49912",
        "review_rating": "1",
        "review_title": "HUH!",
        "review_detailed_main": "What in Gods name happened to the $30,000,000? I think somebody stuck it in their pocket, then they went down to the nearest homeless shelter and said \"you blokes leap around a bit and I will film you\". After watching this I was in desperate need of professional help. No joke. This movie could change your life."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "esmad3-216-475224",
        "review_rating": "1",
        "review_title": "\"You guys need to learn to have fun\"",
        "review_detailed_main": "...Is the point of many a 10/10 review for this movie, mostly made long after it came out. Unless your idea of fun involves huffing paint thinner, this is not a good movie. Don't reward Larry Kasanoff's bad behavior. This movie could have been good but it objectively isn't, and it's his fault. The movie was rushed and half-assed, the script was written by an amateur, a first-time director, scenes central to the plot had to be cut, and on and on... Most of the actors and crew were well aware of these facts."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "bkoganbing",
        "review_rating": "4",
        "review_title": "The rules are broken",
        "review_detailed_main": "Leaving off where the first Mortal Kombat ended the earth was to have a generation of peace since our martial arts heroes won the last tournament. But the rules are broken and dimension portals are opening. A warlord from another dimension says in 6 days all kinds of unearthly creatures will be laying waste to good old mother earth and its populace.\n\nOnly Robin Shou is back from the original Mortal Kombat. Other players/martial artists are back in other roles, particularly James Remar plays the wizard that gathered them together for the first film.\n\nNot being an aficionado of either martial arts or video games I am missing a lot in reviewing this. But for me it's more of the same from the first Mortal Kombat film. If you like that stuff I'm sure you'll enjoy Mortal Kombat: Annihilation."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "masonsaul",
        "review_rating": "2",
        "review_title": "Terrible sequel",
        "review_detailed_main": "Mortal Kombat: Annihilation is a terrible sequel that is nowhere near as good as its predecessor and is a terrible adaptation of the video game. The acting is terrible from the majority of the cast and Johnny Cage is completely wasted. The visual effects look really bad. It completely misunderstands the source material with characters doing things completely out of character, which proves the filmmakers probably didn't play the games. The action scenes themselves are poorly filmed and dull. However, it does have a few very brief moments of being enjoyably, laughably bad."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Joe S.",
        "review_rating": "1",
        "review_title": "The Worst Movie I've Ever Seen!",
        "review_detailed_main": "Dear me, I was a regular viewer of Mystery Science Theater 3000. I've seen really bad movies before. But nothing, NOTHING as horrible as this! I wouldn't call the original a classic by any means, but it was semi-stylistically done and had at least some decent execution. Here, everything fails. Did New Line bank-roll this? It's looks like an S & M kung-fu movie made by a film group of a college campus! I mean, Community Theaters have better costuming than this! And then they get rid of the two best elements of the original: Johnny Cage and Christopher Lambert (if you can't even lure Christopher Lambert back for a sequal, stop making your movie IMMEDIATELY!). Just what were they thinking?! WERE they thinking?!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Stefan O",
        "review_rating": "1",
        "review_title": "Embarrassing turkey...",
        "review_detailed_main": "I consider this film simply unwatchable, at least if you passed the age of 14...\n\nEmbarrassingly stupid martial art-stuff in sci-fi environ... Couldn't stand more than half of it."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mighty_pickman",
        "review_rating": "2",
        "review_title": "Truly awful",
        "review_detailed_main": "Someone give me a peg, this movie truly smells awful. Most of the cast was changed from the first film & most of the cast can't, especially Irina Pantaeva as Jade, possibly the worst actor i have ever seen. Plot, continuity, good direction are all non-existent. Truly Awful. Avoid at all cost."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "teekieteekybirdie",
        "review_rating": "10",
        "review_title": "HOW DARE PEOPLE GIVE THIS SUCH A LOW RATING!",
        "review_detailed_main": "This movie is AMAZING one of my favorites, I don't understand all the bad reviews, don't believe it! This movie is awesome!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "tarbosh22000",
        "review_rating": "6",
        "review_title": "Let's face it, you don't go out of your way to watch Mortal Kombat: Annihilation because you're looking for a Eugene O'Neill-level of drama.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "brucehiddenjr-46431",
        "review_rating": "1",
        "review_title": "Instead of get over here it's get outta here",
        "review_detailed_main": "Just a sloppy mess with bad everything. There's not much else to say except don't bother"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "1",
        "review_title": "One of the worst films ever",
        "review_detailed_main": "New Line can either be really dynamic when making exciting B-movies or extremely stupid when making sequels to success. Take a look at Son of the Mask or Blade III for examples of poor sequels. Mortal Kombat Annihilation is iron-clad proof-positive that video games with NEVER, EVER, EVER make good movies. I don't understand why they keep trying.\n\nThe first Mortal Kombat movie was FAR from brilliance. But it still had great energy, a (rather dumb) sense of humor and a really cool score by George S. Clinton crammed full of techno and trance tunes. And the fight scenes, while not graphic or breathtaking, were pure eye-candy.\n\nThis sequel is cheaper, has a different cast of no-name actors, has poor, badly shot, cut and lit fight scenes, really shoddy sets and rubbish effects. The dialogue is gut-churningly horrible and the story will make you laugh out loud with it's stupidness. Seriously, Mortal Kombat Annihilation is a definite contender for Mystery Science Theatre 3000.\n\nAbsolute horses balls from beginning to end. Everyone involved in making this film should be blacklisted and never allowed to work in Hollywood again."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "buckeyes-05926",
        "review_rating": "1",
        "review_title": "UGGG this film is just bad.",
        "review_detailed_main": "The first mortal kombat was bad but somehow this sequel is so much worse. The only stimulating, satisfying aspect of this action fantasy is the theme music. After that everything is just plain terrible. It's cynical and it's depressing, and I would lock a child in a room before I'd show him Mortal Kombat: Annihilation. The movie is nothing more than a perpetual chain of elaborately choreographed fight sequences that mix live-action foregrounds with complexly layered digital effects and are linked together by the most flimsy and laughable of plot elements. The sequel to a bad movie is quite serious, charmless and bad in every sense of the word."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "horrorflicklover",
        "review_rating": "2",
        "review_title": "Terrible...but Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "gavin6942",
        "review_rating": "5",
        "review_title": "Just as Bad as Everyone Says",
        "review_detailed_main": "A group of martial arts warriors have only six days to save the Earth from an extra-dimensional invasion.\n\nThis film sits on IMDb proudly displaying its \"turkey\" status. (There should actually be a symbol on there to signify turkeys.) And with good reason. The plot is even thinner the second time around and there are scenes that rely much too heavily on CGI... with less-than-perfect animation.\n\nSo why did I give it a 5, higher than a typical turkey vote of 2 or 3? Because it still has a fun aspect to it, especially looking back now almost 20 years later. I can appreciate the music (KMFDM, Rammstein) and bask in the joy that a more or less plot less game was made into multiple movies. Still makes more sense than that Mario Brothers movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "lost-in-limbo",
        "review_rating": "1",
        "review_title": "Uninspired garbage that hurts your head.",
        "review_detailed_main": "We begin where the first left off with the earth being saved for another generation by those chosen humans to defend it in martial arts tournament. But the Mortal Kombat rules are broken when the malicious emperor of the outworld, Shao Khan, plans to bring together his realm with that of the earth within seven days. If that happens, mankind shall no longer exist. So it's up to a couple of martial arts warriors led by the Lord Rayden to stop that from happening.\n\nMy, my, my. Why did I waste such precious time on this? Even I'm confused. I guess that's one of lives many mysteries that cannot be explained. The first film, which was directed by Paul W.S. Anderson, was rubbish too, but at least it was enjoyable in that aspect and the time flew by quick enough that you didn't have many moments to nick-pick over the inconsistencies. 'Mortal Kombat' also captured some of the visual power of the game, which 'Annihilation' fell incredibly short of. This sequel picks right up where the first left off but instead it goes for a grand epic (but derivative) story then that off the first film's basic premise. So, soon before it begins, the film has already run out of steam and turns into one banal and convoluted mess. I couldn't stop thinking that I was watching a long-winded episode of 'Days of our Lives' with a fantasy twist involved. I say that because of the corny dialog and melodramatic speeches and conversations that had me flinching. Also throw in some moralistic jargon and a script that takes itself far TOO seriously. The whole we're a family now and feel good drivel drove me crazy. It threw in everything, but the kitchen sink. After all that you just want to break out the tissues! The underlining humour in the first is all but forgotten in the follow-up and makes for one colourless viewing. The performances treaded the same path as well. Flimsy characters that bore you to death because they're so uninteresting and limp. Some just disappeared without a trace to never be heard off again. Those who stood around would rather pose most of the time. The shapeless bad guys follow the standard traits and intentions that you can see the writers really stretched their minds to come up with. Gee even the gimmicky (Halloween) costumes they wore were inferior. Although Sandra Hess as Sonya Blade was nice to look at, but the acting from all involved left a lot to be desired. No wonder why the likes of Christopher Lambert and Bridgette Wilson kept clear of this massive stink bomb.\n\nI wouldn't put it pass it being one of Uwe Boll's (House of the dead, Alone in the dark) favourite flicks. Surely the filming techniques here were an inspiration for Boll. There are some uncanny similarities from the techno soundtrack kicking right in with the bland action scenes. Hectic editing mixed with some slow motion. While the phony set designs are plain pitiful. It was all artificially void. Boll would be right at home here, that's for sure. But then again I wonder just how much of a budget this flick had compared to Boll's flicks. This one tries to look all-snazzy and throws in a lot colour in the cartoon background and unconvincing effects. But it lacks the sharp grace and the bit of style and charm that made the original entertaining. This flick's fights seemed pointless and without merit, with one lethargically repetitive one after another. The direction is poorly executed and the pacing is somewhat too slow. Simply put, this sequel that drains the life out of you, was just uncalled for.\n\nWake me up from this bad dream. Well, it can actually put you asleep with its insipid output. Overall, it doesn't do any justice to the already awfully weak sub-genre of video game turned movie. Listen to the majority, avoid like hell!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "izzy4reel",
        "review_rating": "2",
        "review_title": "Awful Trash",
        "review_detailed_main": "I consider this to be the WORST film I have EVER seen. The movie is far too caught up in SFX. The acting is just TERRIBLE. This film is an embarrassment. Well, You say, This is a martial arts movie, The acting is not important. The fight scenes were short, stupid, and impossible. 1 out of 5 stars"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mg!",
        "review_rating": "3",
        "review_title": "Studios wanted our money, they got our money.",
        "review_detailed_main": "The studio cashed in on Mortal Kombat's success. They wanted to get as much out as quickly as they could. I loved the first one. The sound on DVD is excellent! When I saw MK2 at the theatre I missed the first 15 minutes. Then I rented it - paying $3 for the first 15 minutes and I walked away. How MK fans must of been shocked by the first 30 seconds alone. 1. The egoist Cage lingering silently in the background only to make a quick \"exit\" per se, and had his glasses broken (again!) 2. Sonya Blade losing half her hair and heaving much larger breasts (no complaint there). 3. And, oh my, Rayden (no explanation necessary)\n\nLiu Kang still has problems with his confidence? Did anyone notice how often Sonya was on her back in the movie? She also dries quick when fighting in the mud. Jax - needs therapy.\n\nLet me end with my (least) favorite line that sums up acting.\n\n\"Mom? You're alive!\" \"Ha ha ha! And now you will die!\""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mwcrunner",
        "review_rating": "8",
        "review_title": "Pretty good sequel to the first Mortal Kombat",
        "review_detailed_main": "This sequel to the first Mortal Kombat is pretty good, but I did not like it that Johnny Cage had to die at the beginning. He's one of the very important characters in the Mortal Kombat franchise. Now this sequel includes more characters from the franchise and it also includes the return of Sub-Zero and Scorpion. Of course they did appear only for a couple of minutes but still it was worth seeing them in this. In this movie Liu Kang has to fight Shao Khan Raiden's brother in order to save the world and all other realms. With the help of Sonya, Jax, Katana and Raiden they defeat Shao Khan and the world is saved. As for Raiden he becomes one of the Elder Gods. Now there are people on here who don't like this as much as the first one but I say its a pretty fair sequel and still worth watching."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "eric262003",
        "review_rating": "7",
        "review_title": "If You Loved The Iconic Video Game You'll Love This Movie Too",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "allexand",
        "review_rating": "1",
        "review_title": "I really wanted to like this, but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "FlashCallahan",
        "review_rating": "1",
        "review_title": "You will 'fail'......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "gordy21",
        "review_rating": "2",
        "review_title": "why bother?",
        "review_detailed_main": "This non-masterpiece follows in the footsteps of several other pathetic attempts at turning a successful videogame franchise into a successful movie franchise. This one pales in comparison to the original Mortal Kombat(which was actually pretty good....surprisingly enough). It seems as though the filmmakers were too busy adding as many special effects shot and characters as possible from the videogame, rather than worrying about any type of story or character development. The characters came off as overly stereotypical and two-dimensional. This movie might have been more enjoyable sans dialogue, as at least the action sequences were intense and well choreographed. I really wish that the producers of this stinker would have put a little bit more thought into the actual plot rather than just money into the special effects budget. I guess what I'm trying to say is that if you liked the first movie....... then steer clear of this one..... I mean.... why bother?"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "moviebob-2",
        "review_rating": "1",
        "review_title": "One of the worst ever",
        "review_detailed_main": "Before I tell you about this film first I'd like to say that I was quite a loyal Mortal Kombat Fan. I've bought all of the games and when the first movie came out I loved it. Because of this, and hearing that many of the cooler characters would be in this movie I was anxiously awating its coming out. Man was I surprized, this movie turned out to be the worst piece of crap I've ever seen. The plot, acting, and special effects were all so bad that they made me wonder why I had ever wanted to see the movie. As a final comment I'd like to say that rather than paying five bucks to see it (like I did) If you're going to watch have someone else pay you."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "dr-32251",
        "review_rating": "1",
        "review_title": "Wow what can I say",
        "review_detailed_main": "Booo this is junk ...u watch the first movie an jump to this trash wow."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "themaskedlion",
        "review_rating": "2",
        "review_title": "you're kidding me, right?",
        "review_detailed_main": "I remember seeing somewhere around the last half of this movie on TV, and I had to laugh at it. The quality reminded me of the Power Rangers episodes I watched when I was younger! It just seemed like they tried to throw as much stuff from the video game (ex. Sub-Zero's pointless appearance, the god-awful animalities). I heard they killed Johnny Cage in the beginning, too. What was up with that? Dumb, pointless move. Actually, dumb, pointless movie!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "chrisjgray2000",
        "review_rating": "1",
        "review_title": "I thought it couldn't get worse.",
        "review_detailed_main": "The followup to 1995's blockbuster \"Mortal Kombat\" is as bad, if not worse than the original. The story is just unbelievable and the script is just plain bad. The actors are in some cases different, but in all cases doing a pretty bad job. There aren't any fancy ideas to save the movie and the special effects and camera work may have thought to been updated and better but they haven't. Nightmare of a movie that keeps the fans of the videogame interested enough but for everyone else, it flops. Incredibly bad film that would be better if it didn't exist. *"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "asherrbh_15",
        "review_rating": "1",
        "review_title": "Earthrealm's worst video game movie",
        "review_detailed_main": "The first Mortal Kombat was dumb but fun, because director Paul W. S. Anderson respected the source material, Shao Kahn is just as disappointing as James Remar Raiden, and they didn't even tell a coherent story, it was just filled to the brim with cheaply choreographed fight scenes with 0 fluidity, and how does something with a budget of 30 Million dollars look like this? The production value looks like it cost less than Johnny's $500 sunglasses. You can clearly see the white outlines around people, and the special effects didn't even hold up in 1997, and they did a horrible job trying to incorporate each character, most of them showed up for 1 scene and disappeared. Why was that? And the acting sucked, Robin Shou was decent in the first one, but what happened here? Christopher Lambert made the right choice not returning for this one.\n\n0/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "irishboy141",
        "review_rating": "10",
        "review_title": "On par with The Room",
        "review_detailed_main": "This is one of the best \"So bad it's good\" movies of all time. The production value is so terrible, you'd think they made it for $1,000 in some Pennsylvania backlot. The acting is awful, the plot makes no sense, characters come and go at random, the CGI looks similar to stop motion/claymation, the costumes look like they were bought in the Power Rangers section of a very shabby Goodwill, and there is some of the most glorious line deliveries in cinematic history like;\n\n\"Too bad YOU.... WILL DIE!!!\"\n\n\"I've seen that tattoo before, on a robot and a woman.....\"\n\n\"The Earth was created in six days! So too shall it be destroyed. And on the Seventh day mankind shall rest, IN PEACE.\"\n\n\"Shao What?\"\n\n\"Like it huh? It's my animality.\"\n\nI cannot do it justice, watch this masterful film. Every single artistic decision was wrong, and it cost $30 million dollars...."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "dasa108",
        "review_rating": "7",
        "review_title": "Good sequel.",
        "review_detailed_main": "The end of the first movie invited us to a sequel and boy did we get it. While it's almost impossible to do something highly original in a story of fighters participating in a tournament to save our planet, the only thing left to do is to exaggerate the recipe of the first film and push it to the limit. I mean exaggerated acting, relying heavily on special effects, accepting that all the characters are motivated or pushed by an energy that partially or totally clouds their intelligence and a couple of moments that border on the incredible. The film is good? No, but it's an excellent B-class that lives up to the spirit of the game and gives every fan exactly what they want: a big dose of their beloved characters in their most extreme form."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Moviefan-2K4",
        "review_rating": "2",
        "review_title": "Possibly The Worst Sequel Ever Made...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Truman-10",
        "review_rating": "1",
        "review_title": "Appalling garbage",
        "review_detailed_main": "I have never seen a movie as badly made as this. Never. It was like a typical kids cartoon made into a live action feature. If you watch the 'actors' faces they know how bad the lines are as they utter them - none of them want to be there, and the bloke who plays Rayden is obviously embarassed. I was too. As an example of this film's stupidity, halfway through the epic battle between the forces of good and evil for the fate of planet Earth, Rayden gets his hair cut. Really. The other good guys ask him why, and he just says, ''It's a new look.'' And they accept that. Yeah, we're fighting for the lives of everyone on the planet, now's a great time to get that new haircut you've always wanted. After watching this with my 13-year old brother I said to him, ';And you actually paid money for that?''. Even he, the age group this garbage is aimed at, knew how pathetic it was. Please don't let there be another one."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "jesse-cody",
        "review_rating": "1",
        "review_title": "what on earth do you call this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "NinaMyers",
        "review_rating": "1",
        "review_title": "What an Awful Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "nickancuta",
        "review_rating": "1",
        "review_title": "Even Alan Smithee would have wanted his name taken off of this...",
        "review_detailed_main": "For the second, and hopefully last, installment of the Mortal Kombat series I waited for the home video release to watch it since it didn't have many of the original actors, and if poor sequels with crappy replacement actors (think Major League 2) have taught us anything it's that the sequel will not only be much worse than the original, it should be a massive bomb and an unheralded disaster. But, seeing as how I enjoyed the first Mortal Kombat as a young adolescent male, I figured I'd give it a try, it would only cost me 3$ and barely 1 & ½ hours if every instinct I had proved to be right. Well, after trying to watch this film (I guess you can call it a film since it is barely feature length. but even that was too much for me since I turned it off after 20 minutes) for the first time on home video, I can truly say that it was one of the worst films I've ever seen. The sample (thank God I had the sense to turn it off when I did) was enough for me to rate it as `almost' one of my least favourite films, garnering a 2/10. Some might say 2/10 was gracious, however I've seen some truly wretched films (Not another teen movie, Batman & Robin, Caligula etc.) and I felt I couldn't give it worse since I only managed to stomach 20 minutes. I took the hit, kissed my three bucks goodbye, rated it and forgot about it as quickly as I could.\n\nUnluckily, as fate would have it, I recently decided to make a compilation of some of my least favourite movies and rate them anew, and although Mortal Kombat: Annihilation did not make the cut it was somehow in the back of my mind. Like the memory of the aftermath of a night of binge drinking, I couldn't shake the ghastly feeling of sickness any time I though of the first viewing of the film. So when the film happened to show up on TV (who knows what the station directors were thinking when they OK'd that programming), I thought to myself `I should watch it to see if it truly does deserve to be on my list' and that `it couldn't have been that bad'. Plus I had to kill 2 hours before going out so I thought `why not?' For some reason I must have repressed more than I thought, or I just didn't get a good enough sample the first time, but in any case the full viewing of this utter waste of celluloid will haunt me for the rest of my days. I won't go into detail as to why the film is so putrid, I believe many here have already accurately recounted the many shortcomings, however I did want to mention that the film is now firmly enshrined in my top 10 worst list, having been revised down to a 1/10 (and now that's being gracious). If there's one recommendation I can make it's to not see the film, save yourself 91 minutes of pain (or if you're into S&M, pleasure), or if you absolutely have to see it (ie. you have a death wish) then bear in mind that you're in for a movie that should really have been directed by Alan Smithee, and then even he would have wanted to change his name before it was released."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "CrassActionHero",
        "review_rating": "1",
        "review_title": "Mortal Komedy",
        "review_detailed_main": "Mortal Kombat Annihilation(1997) Review: Wow. I remember seeing this in the theater. After the fun first installment, I was looking forward to this. Perhaps my expectations were too high. That's not the only problem.\n\nThis is a very bad movie. One notable mention is the fact that only two actors from the first movie reprised their roles. That's a very bad sign alone. Christopher Lambert is not back as Raiden sucks. Lambert was good as the Raiden and the schmuck that played Raiden here looked and acted like a total flake. He cannot fill the shoes of Lambert at all. This movie also has some silly to lame action sequences. Another problem is despite the many characters here, many of them are just cameos. We only see Nightwolf for a minute and that's that. The likeness of the Kombat characters here is the only redeeming quality MK:Annihlation has got.\n\nThis movie is also unintentionally hilarious. There is a lot of cheese to fly around and lots of campy acting to be the ultimate \"B\" movie, just without the fun.\n\nThe first installment is worlds better than this. It featured a fine cast, a good story, interesting characters and a fantastic villain. Shao Khan here comes of as a club bouncer in a costume.\n\nNow I know why many of the actors did not reprise their roles, after reading the script, would you blame them?\n\nThe Last Word: Total disaster. Mortal Kombat had the potential to be the next big movie franchise. With this, those dreams were destroyed. Pity. I would like to find the director and Finish Him! Jerk."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "fjustice",
        "review_rating": "",
        "review_title": "Huh? I don't get it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "diane060284",
        "review_rating": "1",
        "review_title": "They really screwed this movie up",
        "review_detailed_main": "How can they call this a movie? Only reason why I have it is to fall asleep to it at night. Worse story line and plot I have ever seen."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "leoxatzian",
        "review_rating": "2",
        "review_title": "Just finish me already!",
        "review_detailed_main": "The first movie can be an enjoyable guilty pleasure or even a so bad it's good movie, but this sequel finished off the \"Mortal Kombat\" cinematic franchise with a flawless victory of terribleness and a PG-13 fatality. The only redeemable quality about it is the re-used theme song from the first movie. Other than that, there is so much low budget acting, action, directing and effects that it is impossible to believe this movie was theatrically released."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "I_Was_Incepted",
        "review_rating": "9",
        "review_title": "This movie is better then it looks .",
        "review_detailed_main": "It's been a while since i saw the movie so I pulled it out of my DVD closet and watch it ones more . I agree that Johnny Cage his death is a little strange but look , they had a real good storyline ! The actors where great and so was the fighting scenes . I think this movie is better then the first one . I really do . There are more characters , Robin Shou's acting is way better then the first movie .\n\nWhat more can you expect of a movie !! it had it's ups and downs i agree , but it sticks to the video game right , the video game never killed Johnny Cage , because the video game never had a storyline !! ( the very first video game ) greetings from Belgium Jens Naeyaert."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mjacksongta",
        "review_rating": "6",
        "review_title": "only MK fans can get through this... ONCE...maybe",
        "review_detailed_main": "this movie was really bad for the most part even when it just came out but as a MK fan some things keep it alive. the music was awesome just like the first one and the thing I really loved was that they used a FULL arsenal of cast members from the game which was unlike the first one where they seemed to just throw in a hand full of characters and call it a day. however the problem with that is that they killed everyone off to quickly. there were characters that were dead after a punch or two. there was no threat from these characters and it was if they were no threat to humans at all even with all there powers. costumes were done really well although there seemed to be some similarities to the predator.\n\none thing that really bothered me about the first one was that they didn't make rayden Asian. they just figured dress a guy in a \"rayden\" hat and call it a day. now in this one its even worse. they just tried to make rayden look like Christopher Lambert. add in the short hair and u have something REALLY off.\n\nacting was horrible also. not totally the actors fault. the script and directing were bad.\n\nonly a true MK fan could get through this movie and for those who do its worth the watch.... ONCE"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "talllwoood13",
        "review_rating": "2",
        "review_title": "mortal kombat: excretion",
        "review_detailed_main": "This feels one of those really bad cosplays you see on the internet where people just barely look like the characters and embrace it at a convention. From the atrocious script, the questionable actors and horrible CGI this movie has. There is about as much complexity in the store as an adult movie.\n\nI have no idea why Raiden cuts his hair half way into the movie. He has the right voice to be the \"god of thunder\" but when he cuts his hair he has this almost Neil Patrick Harris look to him and I cannot take him seriously.\n\nYes this movie is about a video game with nothing but fighting but the script is atrocious, it's like a movie called \"Fighting ace\" where 80-85% of the movie is fighting. I feel if the script is good or there was a balance we'd keep seeing them instead of cramming everyones favorite characters that the they played as in the rigged arcade machines in the 90s (this has been proven).\n\nI love the fact Johnny Cage is hardly in this movie as he was horrible. The worst actor in this has to be Jax. They made him way too ghetto. I don't know how else to describe him.\n\nThe dialogue between everyone to Jade half way into the movie was it written by a 12 year old or was someone really into that woman who can barely act as if they got their girlfriend or someone in the movie just so they would sleep with them.\n\nThe actor who plays Shao Kahn (Brian Thompson) is another hilariously awful actor in this movie. Yet for some reason. Sindel played by Musetta Vander everyone considers the worst in this movie for her iconic \"too bad.... YOU ... will die\". To that I say there are far worst lines out there. The only role I liked Brian in was the 1980s cult classic Cobra with Sylvester Stallone.\n\nThe awful rave sounding techno rock music sounds awful, the CGI can get hilariously bad. Yes this movie is almost 30 years old but then again look at Terminator 2 and others from years prior.\n\nAlthough this movie had somewhat of a plot otherwise this would get a 1 star. I tried 3 times to finish it. I love so bad they are good movies but this was so terrible it should never have came out."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "GOWBTW",
        "review_rating": "",
        "review_title": "Weak pathetic changes, Action was flawless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "maureen_smith5",
        "review_rating": "2",
        "review_title": "My my what a sloppy mess, what were they thinking.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Mistopurr83-1",
        "review_rating": "1",
        "review_title": "Probably the worst movie ever made",
        "review_detailed_main": "Yep this horrible piece of garbage was not only the worst sequel and video game based movie; it was probably the worst movie ever made. I can give out hundreds of reasons why this was a terrible movie. But to save space I'm not gonna give all of them.\n\nAfter the success of the original Mortal Kombat film the sequel was highly anticipated among fans. When most saw it, the film was a total disaster and a box office flop. Viewers not familiar with the games knew it was terrible b/c the recasting was horrifying, the direction was bad, the dialogue was wooden, the acting was lame, the script was poorly written, the special effects were cartoonish and the fights looked more like carefully choreographed dance routines. I think the actors were in this for just one reason, the $$$$$. I think this movie flopped because the characters were played by unknowns. I didn't know who any of them were before I saw it. Well Except for Robin Shou and Talisa Soto because they were the only actors from the original that came back for this one. Not only did they come back Shou looked like he had forgotten how to act and Soto looked like she had forgotten how to fight.\n\nOverall the movie looked like an 85 minute Power Ranger ripoff! Most of the outfits looked like cheap costumes bought out of some Halloween shop. Most of the characters were just thrown in there for (3 minutes) no reason. It looked like their only goal was to fit in as many characters as possible without developing them. Even though they did that it felt like there weren't enough characters in the film. The fights were way too short; they were less than 2 minutes long. What was the point of going underground in those metal balls??? They looked like an American Gladiator ripoff! Sheeva and Motaro looked more like humans in costumes rather than vicious-threatening creatures. Shao Kahn looked more like a human bully without his mask. The annoying techno/dance music made it look more like a trashy music video.\n\nThe recasting on the same characters was a disaster. You got these new actors that were so not talented like the original actors. The new Rayden (James Remar) and the new Sonya (Sandra Hess) failed to bring out the appearance and portrayal Christopher Lambert and Bridgette Wilson brought into them. Sandra Hess made Sonya look more like a sluty model rather than a military woman. Lynn `Red' Williams sucked as Jax; he was a military general who talked like a street thug from the hood. Give me a break, black men in the military/army do not talk like gangsters from the hood. Rayden looked more like Sting when he gave himself that cheesy make-over.\n\nI can go on and on about why this horrible adventure film looked more like some poor excuse to make money. For now I think you all get the point of my review.\n\n0/5 I give a big fat 0 because I saw no effort put into this. I saw laziness and selfishness put into it."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "ashtree80",
        "review_rating": "1",
        "review_title": "I can't believe I watched the whole thing",
        "review_detailed_main": "This is the worst movie I've ever seen in my entire life. Thousands of people agree with me.\n\nI can barely put into words how awful it is. Visual effects, the 'acting', music...Yes, there is a script and a story. Incredibly, awful, pointless, angering writing.\n\nThis movie even fails at being a bad movie because it's boring! Sometimes, a really bad movie can be fun to watch, because you can make fun of it. This movie makes fun of the viewer, insults the intelligence of the viewer. WANTS to anger the viewer. \"Annihilate\" the viewer's enjoyment, if you will."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "DunnDeeDaGreat",
        "review_rating": "5",
        "review_title": "Horrible sequel",
        "review_detailed_main": "Mortal Kombat: Annihilation is a crappy sequel to a great film. By the looks of things this film was made just to make money. The fight sequences are lame, the acting paper thin and the storyline weak. The film barely introduces any new characters from the game. This one can be skipped."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Cinemaniac1984",
        "review_rating": "1",
        "review_title": "Game over.",
        "review_detailed_main": "Mortal Kombat was one of the few better video game to movie adaptations which was a success at the box office in 1995, in which it was inevitable that there would be a sequel. Mortal Kombat: Annihilation rolled around and whatever worked in Mortal Kombat failed to work here. Everything about it was bad. The plot, the acting, and the screenplay filled with lame lines. It goes without saying that Mortal Kombat: Annihilation suffered a fatality at the box office, consigning it to one of the worst movies of 1997.\n\nAdapting most of the plot of Mortal Kombat 3 which was a huge hit on video consoles worldwide, Mortal Kombat: Annihilation sees the return of Liu Kang (Robin Shou), Sonya Blade (Sandra Hess), Johnny Cage (Chris Conrad) and Raiden (James Remar). Interestingly Bridgette Wilson, Linden Ashby, and Christopher Lambert wisely chose not to return for the sequel. Aided by Kitana (Talisa Soto), the warriors must battle Shao Khan (Brian Thompson) to prevent the takeover of Earth.\n\nTaking over the director's chair from Paul W.S. Anderson who wisely moved on is John R. Leonetti who is responsible for this mess of a movie.\n\nMortal Kombat: Annihilation was just atrocious, and an example of one of the worst sequels. Stick with the first movie, in fact stick with the video games.\n\nGame over for Mortal Kombat: Annihilation.\n\n1/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "botev1921",
        "review_rating": "1",
        "review_title": "A good way to waste 30 million and create the biggest piece of crap!",
        "review_detailed_main": "We have seen some bad sequels and one that comes to mind is Highlander, but this one beats it by a mile. It is so bad that one can wonder how on Earth did it cost 30 million dollars? Starting with the screenplay, if there was one, this movie simply has no continuity whatsoever...no storyline, no development - just a bunch of characters walking around a badly prepared stage fighting. The staging is so terrible, you probably won't see it in a high school play. It leaves you with the impression that the \"long journey\" is actually happening in a two-bedroom house. The special effects are pathetic and you can actually see the faults in something as simple as shades. Some of the fight scenes are obviously taken in front of a green screen. The acting is beyond tragic. No shocks here as nobody would expect the cast to actually act something that has no purpose and is not really going anywhere. Some of the lines are like written by a 9 year old on two beers. Tens of new characters are presented without any history or connection to anybody or anything. If all that wasn't enough, the director seems like he took a day off as some scenes include awkward pieces of body parts being focused on while the character is saying something. If there was a nomination for the worse 10+ million dollar movie in history, this one will get it for sure!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "bullions27",
        "review_rating": "1",
        "review_title": "Mortal Power Rangers Kombat",
        "review_detailed_main": "The one word, see above, to describe this jurassic pile of fresh cow dung. Absurd. What the hell were they thinking when this was put into production? Probably nothing. There is nothing redeeming about this movie. They pretty much took the silly video game plot and worked it over with crayons to give you this. It doesn't even completely stick true to its game! What they figured to be dramatic plot twists are actually comedic. I won't spoil it for you but please by all means go rent this or see it on TV. The stuff are hilarious on all levels."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "lucascometti-1",
        "review_rating": "10",
        "review_title": "I really enjoyed this Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "smoke-9",
        "review_rating": "6",
        "review_title": "Action, Music, Fights..., but where is the BLOOD",
        "review_detailed_main": "I´m a really great fan of the game Mortal Kombat 1, 2, 3, 4, but the movie does not pay honor to the game. Because a very important detail is missing: BLOOD, where the hell is the blood, that's why the game has become so famous. It was disappointing that there haven´t been any bloody fatalities like in the game. For all that it´s an absolute \"must-seeing-movie\" for all Mortal Kombat fans. Cool fighters, cool fights, cool music, cool special effects but (sometimes) really bad dialogues. My opinion: if you´re a fan of Mortal Kombat see this movie, if not, you´re wasting your time.\n\nPS: In spite of some weaken, MKA has become a kind of cult-movie for my friends and myself."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "rob_m_pettigrew",
        "review_rating": "1",
        "review_title": "what the hell",
        "review_detailed_main": "Loved the original, Love the games.\n\nWHAT IN THE NAME OF GOD HAPPENED? Hell even the hot chicks fighting in mud came across as unappealing. how BAD do you have to be in order to do that. And isn't there suppose to be something about a plot. I mean there is more to a good action movie then fight scenes, which unlike the first were not any good. How about explaining who these people are and what they are about. for example, sub zero... you killed my brother but no hard feelings but i will fight for you anyway... whats the hell. The original gave a fell of magic and danger and well actually being a tournement. This this was.... Nothing. People were in it just to be in it. No plot. no logic."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mal karma",
        "review_rating": "",
        "review_title": "Mortal Kombat: Horribleation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "view_and_review",
        "review_rating": "2",
        "review_title": "This movie needed to be annihilated",
        "review_detailed_main": "Why oh why did I think I would like this movie? Why did I think that it would be better than the first? Whatever the reason; that is what I thought... that this would be better than the first one. I was disappointed in the first Mortal Kombat, but at least it was watchable!! This movie is not only unwatchable, it is unbearable. OK... question: Why did they change Rayden? I liked Christopher Lambert just fine as Rayden. Maybe Lambert had incredible foresight and knew just how lousy this film would be.\n\nI wasn't able to finish this movie it was so bad, and I so wanted it to be good. After the first Mortal Kombat's sub par effort I figured they made a second one to redeem themselves. Oh contrare. The story was pathetic, the acting was deplorable, the special effects were below 'B' grade, and the fight scenes...HA!! Laughable. This movie tanked big time, which really sucks because I was a big fan of the video game."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "bernard978",
        "review_rating": "1",
        "review_title": "Mortal Kombat: Annihilation",
        "review_detailed_main": "I have seen this film and i must say it is no match for the first one, if you see at the beginning how they hide the fact they're using different characters is almost laughable i found it funny and it's not supposed to be a funny film, and also what was that Liu Kang turned into i thought he was mortal?, just goes to show how poor writing and poor directing ruins a good film.\n\nThe two best actors of the first Mortal Kombat in my personal opinion were not in it (Linden Ashby as Johnny Cage and Christopher Lambert as Lord Rayden).\n\nI can't believe they killed Johnny Cage he was my favourite character from the original Mortal Kombat, i just loved his sense of humour and his kick ass moves.\n\nThey must have been desperate for money these producers because they just didn't have the story right neither i mean sub-zero's brother? what was that about and scorpion's brother?,why milk a classic film this is a perfect example of stretching the story too far as in films such as Matrix Revolutions and Blade Trinity.\n\nPlus the cheesy computer affects and poor acting from the characters gives this film a well deserved rating of 1, only i can't give it any lower it don't have a 0 on IMDb.\n\nIf you liked the first film don't get yourself too excited about seeing the sequel because you'll be as disappointed as i was, it ruined a classic!!\n\nStill it could've been worse"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mechg2994",
        "review_rating": "1",
        "review_title": "Mortal Kom-Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "francysherrerap",
        "review_rating": "2",
        "review_title": "Oh man!!",
        "review_detailed_main": "I love MK games. The first movie was OK but this one!!! They blew it. Save yourself some time and avoid watching it!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Annihilate This Film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "kelvinselimor",
        "review_rating": "5",
        "review_title": "It is Mortal Kombat?",
        "review_detailed_main": "Mortal Kombat: Annihilation. Is it Mortal Kombat? After the cool first part, it's sad to see this. And now in order. 1. Characters that are needed for the background such as Rain and Sheeva. They say several replicas for the entire film and die. 2. Animal nature. Why did Liu Kang need to look for Nightwolf? Complete 3 challenges? About which the plot forgets. Learn to discover the animal essence in yourself? What for? To growl and scratch Shao Kahn for one minute. 3. 6 days for which the Earth should be destroyed pass suspiciously quickly. There was a feeling that only one day had passed. The positives in this film are fighting scenes and music. Everything else is unfortunately very weak."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "Not an improvement on the first movie...",
        "review_detailed_main": "Granted that the first movie was cheesy and campy, and of course what else would it be as it is a movie based on a game with no other contents than fighting! So when \"Mortal Kombat: Annihilation\" followed two years after, expectations were not high.\n\n\"Mortal Kombat: Annihilation\" was every bit as cheesy and campy as its predecessor, and director John R. Leonetti had done nothing really to improve on the first movie. In fact, \"Mortal Kombat: Annihilation\" just continued on with the same pointless tirade of having characters from an arcade fighting game beat each other up in a soup of very weak storyline.\n\nThe CGI effects in this 1997 sequel was every bit as horrible as it was in the 1995 movie. It was gut wrenching to witness those demons and the dragon duel on the screen, because the CGI animation was just atrocious, and the textures looked like they were borrowed directly from the PC game version of Mortal Kombat.\n\nAs for the acting, well some people were doing good enough jobs here, despite the fact of having nothing to work with in terms of script and storyline. However, why they opted for Brian Thompson as the main villain was just simply beyond my comprehension.\n\nIf you enjoyed the 1995 \"Mortal Kombat\" movie then you will also like the 1997 sequel \"Mortal Kombat: Annihilation\". However, unless you are a fan, then there is very little to get from this movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Movie Nuttball",
        "review_rating": "8",
        "review_title": "Mortal Kombat Annihilation!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "mnemos9",
        "review_rating": "6",
        "review_title": "Not to be so easily dismissed",
        "review_detailed_main": "This isn't much like the 1st movie, but that doesn't have to be a bad thing. It has the spirit of the series and feels more like a traditional fighting game to me. It has great music, sets, fights and actors. It adds in more of the MK lore and characters--which I love. That being said, there are definitely parts where the writing gets sloppy, especially with new entries and prior characterization established in the 1st movie. Also, a lot of people will say that the effects have aged badly and that the tone of this one is very cheesy. It's a Mortal Kombat movie--it's supposed to be a good time, not a masterpice. It's a fun romp that ups the stakes while engaging the audeince. I like it a lot. You can feel the love in it."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "vwbkej",
        "review_rating": "1",
        "review_title": "not fun bad, just bad",
        "review_detailed_main": "A very bad movie at all levels even though in my opinion is a little- but only a little- better than the first which was pretty awful itself... From bad acting to ridiculous special effects the experience turns into un unbearable torment... This is definitely the movie you should be looking forward... to avoid!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "fortey",
        "review_rating": "",
        "review_title": "So, it's Brian Thompson, ancient kung fu god",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "nuklearkrisis",
        "review_rating": "1",
        "review_title": "Possibly...one of the worst movies ever made",
        "review_detailed_main": "THIS MOVIE SUCKS BALLZ....ITS SO F*#*@*#$ STUPID! Like everything is made out of that cheap ass poly foam cheap budget movie crap...Like a couple of bozos where \"Martial Arting\" and they jump on some bridge in some fake ass cave straight out of Disney land, probably right in the lame ass pirates of the Caribbean ride/set.. I mean, whats the deal with \"put a blue light and a orange light perfectly on one side of each actors face\" deal....? Remember the first Mortal COMBAT..(Yes I didn't use a K). I dunno, its like the lighting and directing of this movie came straight from some high school film class, and a bunch of smelly kids are like \"hey lets make that cool video game into a movie\", then everyone screams \"YEAH!\" and they all start high fiving each other...Anyway, Aliens VS Predator I thought was the worst movie in the world...then I saw Lazor Mission, but they don't really compare because Lazor Mission obviously had a budget of five bucks..Aliens VS predator OMG I don't even want to think about how many African kids could eat like Bill gates for 10 years regarding how much AVP costs for that crap.....Anyway if I had to estimate Im sure Mortal COMBAT had a budget of about..ohhh I dunno a couple hundred bucks. This movie is SO horrible...you want a review...OK.. people jump around a lot..and everything look ridiculous and fake and what else...the lighting is probably the worst ever devised in any movie..so thats probably not easy to pull off..good work. See this movie if you like to roll on the ground laughing almost to death!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "ts-lado",
        "review_rating": "1",
        "review_title": "Short review",
        "review_detailed_main": "Time is about 19:00: I am sitting in front of screen, preparing to watch the movie. I have in head that Mortal Kombat 1 was some fun... not something to make you think about meaning of life, but really dumb-but-still-fun action with good (yet very often too much fake) pieces of martial arts.\n\nTime is about 19:40: I can't believe I am still watching it. All that makes me not turn it off, is curiosity, what level of stupidity can achieve a single movie. I just wonder and really interesting, will it become worse or it will stop regressing at some point.\n\nTime is about 21:00: My mom is back home, she wakes me up and turns off TV... I am snoring and trying to remember what I was watching..."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Vampenguin",
        "review_rating": "4",
        "review_title": "Horrible",
        "review_detailed_main": "Well it's not really as bad as everyone says, but it's still a pretty awful movie.\n\nLet's start with the plot, shall we? Not a lot to say about it really, other than the whole thing is a giant plot hole! It makes no sense what-so-ever, as it makes the entire first movie completely pointless. Even if it did make sense, it still isn't much of a plot. They have 6 days to save the word from total destruction. OK, whatever, not as bad as you might think, right? Wrng. The majority of the film could take place in less than a day, so I really wonder what the hell they were doing for the other 5. Stupid plot.\n\nMoving on, I'll mention the actors. Oh God, the actors. Most of the returning characters from the first movie are replaced by new, even worse actors. I'm really glad that they killed off Johnny Cage within the first couple minutes, as that actor seemed to be the worst of the bunch. Sonja Blade's replacement was pretty awful as well, and saw fit to completely change the character.\n\nMaybe I shouldn't be so hard on the actors. I mean, look at the script. This movie could have had Al Pacino, Marlon Brando, Morgan Freeman and Jack Nicholson, but even they would have looked terrible having to say some of these pathetically cheesy lines.\n\nOne thing that I'll give this film is that it has some half decent fight scenes. Nothing spectacular, and the CGI is really bad, but at least they were mildly entertaining.\n\nIn all honesty this isn't a whole lot worse than the first film, but it is really, really bad. Id avoid it.\n\n4/10"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "MisterSisterFister",
        "review_rating": "5",
        "review_title": "At Least It Was Better Than the First Movie ...",
        "review_detailed_main": "... but that's not saying much. The first film had expectations high and after seeing how much of a colossal disappointment it was, what did you really expect out of the sequel, you morons?\n\nAt least Mortal Kombat: Annihilation is so bad its at least so stupid its amusing instead of so stupid its tediously boring, like the first one.\n\nDon't get me wrong. Both movies are both heaping piles of crap, but this one stinks just a little bit less."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "dee.reid",
        "review_rating": "3",
        "review_title": "Abysmal \"Kombat\"",
        "review_detailed_main": "\"Mortal Kombat: Annihilation\" is as ambitious as movie sequels go, but it's corrupt in a way that movies based on video games typically are, and then some.\n\nI feel I should backtrack a bit: I really liked this movie when it came out in 1997, being that I was a huge \"Mortal Kombat\" fan and I loved the first movie (despite Paul W.S. Anderson being the director). This sequel picks right up where its 1995 predecessor left off and sort of goes downhill from that point on.\n\n\"MK\" cameos abound in this sequel, almost none of which are given their fair share of screen time or character development. You know who I'm talking about; I'm talking about Cyrax, Smoke, Kabal and Stryker (who are mentioned but never seen), Mileena, Nightwolf, Rain, Ermac, Baraka, Sub-Zero (unmasked), Scorpion, Noob Saibot, and Reptile.\n\nAll these characters are seen (or talked about) in this movie but are barely given the time they were so kindly awarded in the video games. Most of these characters had made their debuts in \"Mortal Kombat 2\" or \"3\" but we barely see them or know who they are (this is especially troubling for those that may have never played the games).\n\nThe acting is way out there, the script tried to be something more than it was (apparently a lot more was filmed but dropped from the finished product - damn execs) and the fights are sub-par.\n\nThe reason for my disdain is the fact that I loved Anderson's first movie and I found it difficult to sit through this entry.\n\nI only hope \"3\" redeems the series.\n\n3/10"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "SeminolePhenom",
        "review_rating": "1",
        "review_title": "I would rather gouge my eyes out...",
        "review_detailed_main": "A group of martial artists take on Shao Kahn and have to stop him from merging earth and his realm together.\n\nI rarely ever write spoilers in my reviews, but this movie calls for an exception. Let me just tell this you this about the movie's ending to save you the trouble of even thinking you might want to see it. For no reason at all, Liu Kang spontaneously transforms into a giant dragon and fights Shao Kahn who also spontaneously transforms into a giant dragon. This scene was the most ridiculous display of cinema I have ever witnessed in my life. The rest of the movie was only terrible, but the ending topped of the movie so perfectly to the point of wanting to slam my head in the T.V. to stop watching. The bad acting and pointless martial arts wasn't enough. They had to bring a couple of massive dragons to fight as though they were from a much earlier Godzilla movie to finish off a terrible movie.\n\nI know that this does not seem much like a review, in fact it is much closer to just a ramble of my warnings but it is near impossible to give a review for a movie that I could very well consider one of the worst movies of all time. Do not see the pointless, incoherent, garbage.\n\nI do not recommend this movie to anyone other than John Leonetti, who made it so he can wallow in his own crap for a good couple hours. I want to treat him like a dog and rub his nose in his own mess."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "eps",
        "review_rating": "10",
        "review_title": "A juicy piece of action for the Martial Arts/Action fans.",
        "review_detailed_main": "While lacking in the department of solid dialougue and plotline, MK2:Annialation makes up for it in spectacular Martial Arts displays and decent special effects. For the avid MK game player the ending holds a solid adrenalin rush. Again based off of the MK mythology, it lacks much of the human dimension brought in the original by the Johnny Cage/Sonya Blade interaction and Liu Kang realizing he must fight for something better than his hatred/mission of vengeance and defend the realm of earth. In this movie Liu Kang is the hero in white, without the personal demons he had to face in the first. The fights are spectacular and quite enjoyable. The movie is great-especially if viewed directly following the original MK movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "callanvass",
        "review_rating": "6",
        "review_title": "One of my favorite guilty pleasures..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "cornsaladisgood",
        "review_rating": "1",
        "review_title": "wow... just wow.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "a big mishmash of lame fight scenes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "luluwannabe25",
        "review_rating": "1",
        "review_title": "This movie was so horrid, I went home and rewrote it myself after seeing it.",
        "review_detailed_main": "I'm one of those people who paid good money to see this movie, on opening day, no less, mostly because it was the Mortal Kombat sequel I thought I'd been waiting for. Sucks. Sucks. Sucks. The acting was awful- even coming from people who did well in the first movie- wtf??? You know, there's a reason only two actors came back for the sequel... And, I betcha they wish they hadn't! The dialogue was horrible. Oh yeah, cause the Motaro/Mr. Ed line was so clever... (Sadly, that was one of the best lines in the whole movie.) That's not a spoiler, is it...? I don't wanna be blacklisted. ^^; The fight scenes weren't that impressive, which really, really hurts this movie, because given the crappy script and sub par acting, that was all there was to fall back on. My mom, who, oddly enough, really enjoyed the first MK movie, fell asleep- yeah, she fell asleep, during MK: Annihilation. I think she had the right idea."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "GuyCC",
        "review_rating": "1",
        "review_title": "A sure sign that MK freaks will love anything Mortal Kombat.",
        "review_detailed_main": "I really liked the first movie. I thought it was an entertaining film with a decent cast, sharp action scenes and special effects, and the movie paid respectful attention to its source material.\n\nMK Annihilation is anything but a good film.\n\nIt comes off like a bad Power Rangers episode, with most of the original actors gone, goofy camera angles and zoom shots, no story and pathetic special effects. \"Animality\"? Please. I've seen better stuff out of old \"Gamera\" movies. This movie introduced almost every character from Mortal Kombat Trilogy only to kill them off five seconds after their debut. What's the point of that other than to say that \"this character\" was in the movie? All it accomplished was bogging down what little plot there is. The story itself (based off MK3 and MK4), was shaky, the techno music was nowhere near as good as the first film, and the whole movie seemed uneven and a waste of film. It lacked the feel of a movie, and earned the second 1997 award of a \"film that I almost walked out of in the first fifteen minutes.\"\n\nI've talked to more than a fair share of people who have said this movie is \"wonderful\". Of course, all of these people were die-hard MK fans who feel that anything with the famous dragon logo can do no wrong.\n\nWant a Mortal Kombat movie to watch? Watch the first film. At least that one is a fun movie to sit through and enjoy. Too bad MK:A didn't live up to the first one. The line \"Pretty cool, huh? That's my Animality\" made me absolutely groan in agony that I actually spent money to see this. Avoid this movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Venomly_Carnage",
        "review_rating": "5",
        "review_title": "This should of stayed in out-world",
        "review_detailed_main": "This movie is not Mortal Kombat 1 in anyway at all, i will start with the good bits.\n\nFair enough they tried adding most of the characters from the MK series which is understandable, and their were fight scenes every 4 minutes which kept me entertained for a bit.\n\nThe bad bits about this movie was everything that weren't in the good, like Sonya Blade, Johnny Cage and Raiden were played by different people, first off Sonya was a mean tough bas ass in the last movie, in this she is a bit girly, and for Johnny Cage the poor guy takes off his shades and gets his neck broken, and worst of all Raiden, in the last movie raiden was a tough guy who can kick ass and be feared and has a sense of humour, in this he is a wimp, and gets thrown through a wall every 10 minutes, and he gets a hair cut (VERY STRANGE AND STUPID) 5/10 Because their was a scorpion V Sub Zero's brother fight"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "toysoldier_johnnybanks",
        "review_rating": "5",
        "review_title": "Destroy all expectations indeed",
        "review_detailed_main": "I'm not gonna waste a lot of space saying this movie wasn't good, so lets get to it. Good idea, decent actors, BAD story. The only light at the end of this long hideous tunnel was Brian Thompson as Shao Kahn.\n\n5/10"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "insomniac_rod",
        "review_rating": "4",
        "review_title": "\"Damn! you BBQued his ass!\". More like \"Cheesy Kombat.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "flacocrezy",
        "review_rating": "5",
        "review_title": "Scorpion alive?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "thelastpoet05",
        "review_rating": "3",
        "review_title": "Way Too Much Going On",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Rautus",
        "review_rating": "8",
        "review_title": "An OK sequel to Mortal Kombat",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "estebanalaniz",
        "review_rating": "7",
        "review_title": "I loved this movie .",
        "review_detailed_main": "This movie was great i loved it. Brings back memories of my childhood ."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "philip-473",
        "review_rating": "3",
        "review_title": "Why?",
        "review_detailed_main": "Seriously, Hollywood has to stop green lighting these horrible, horrible movies.\n\nI mean come on, while I haven't seen the original (Which I have heard was pretty decent), this movie is just poor.\n\nThe Writing sucks, the effects are worse then anything Freidburg or Seltzer could come up with and the acting is something that you'd expect to be in Power Rangers.\n\nThe final fight between Shao Kahn and Liu Kang isn't even a fight. It's just a battle between two poorly choreographed actors who turn into a CGI Hydra and Dragon (Respectively) that look like they came from those atrocious Legend of Zelda CDI Games that could probably pass muster in Barney and Friends.\n\nSo if you like riffing movies MST3K Style, then watch it. Otherwise don't bother."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "kingfinn_2000",
        "review_rating": "5",
        "review_title": "Mortal Wombat",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Evey88",
        "review_rating": "3",
        "review_title": "I Tried",
        "review_detailed_main": "I tried lol. Mortal Kombat is one of my favorite movies, but I could tell that this sequel was going to be horrible in the first 10 minutes. The girl who replaced Sonya Blade was not great. The acting overall was not great. Kahn was a joke. The writing was awful. It was like watching the Power Rangers. Don't get me wrong, I love the Power Rangers - But Mortal Kombat is not meant to be kiddie. This was very kiddie. The only thing I liked was when the Mortal Kombat theme music would play lol."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "asiduodiego",
        "review_rating": "1",
        "review_title": "My eyes!",
        "review_detailed_main": "I watched this movie, long ago, when I was young, and expecting the sequel of \"Mortal Kombat\". Of course, MK1 was nothing special, but it had its moments, and it was fun enough to expect at least for another dumb action movie in the sequel... but then, we got this movie. I was fifteen years old at the time, and I didn't know anything about cinema, but my thought was: \"This is the worst movie of all time\". After twelve years, I'm not sure if it is really the worst movie ever, but it's pushing really hard to make it.\n\nThis movie is shameful. The replacements for the actors of the first movie are embarrassing, the acting is a mess, and the movie loses all the tongue-in-cheek tone of the first one, so, its plot devices which used to be stupid, but funny, are now just stupid.\n\nOf course, the \"target audience\" for this piece of junk was the average Mortal Kombat gamer, so all this movie does is just throwing all the characters possible, so we can all say: \"Look, it's Kitana!\", \"Look, it's Cyrax!\", \"Look, it's Baraka... I guess, it looks awful\", \"Look, it's Shao Khan... oh, man, he's so lame\".\n\nDo yourself a favor, and avoid this train wreck at all costs. The only value of this movie is serving as a torture device, or as a device for a drinking game based on pointing out the stupid things in the movie and drinking a shot, which in about fifteen minutes will end up in everyone being dead drunk.\n\n1/10"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Floated2",
        "review_rating": "2",
        "review_title": "Tries to incorporate too much",
        "review_detailed_main": "The follow up sequel to the 1995 Mortal Kombat film sees a lesser version in about every aspect. Considered the original film to not be great but having some entertainment value. Annihilation is easily worse for many reasons.\n\nFirst the special effects look cheaper, the graphics and overall costumes of the characters look cheap and resemble that of parodies. The acting is lowered and at times embarrassing. The dialogue feels amateurish.\n\nThe characters are worse. People may have found Johnny Cage to be annoying in the original but he was a better character than Jax in this film. The recast of Sonya was a slight upgrade. Kitana is essentially the same. Liu Kang is worse here, more annoying and \"in the way\" (the acting by Robin Shou seems uninspired). The recast of Raiden is also downgrade. None of the villains really stand out. Sub-zero and Scorpion have brief scenes.\n\nThis film tried craming in too many characters without given them much to do. The fight scenes are just as tame and even though there may be more overall in this sequel, they aren't memorable. A lot of the fight scenes just feel randomly placed. The finale battle drags on and feels bland. Predictable and without any gore or strong violence, it just doesn't work well.\n\nOverall the plot is sort of a rehash of the original but this here feels less inspired and more rushed."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "thomvic",
        "review_rating": "4",
        "review_title": "Jumbled too many things into it",
        "review_detailed_main": "While I didn't think the first film was fantastic, it was enjoyable and seemed to go at a more decent pace and a plot that at least was able to hold itself together through the whole way. The good thing was that it focused on three main central characters.\n\nIn MKA, it puts too many characters altogether, some making appearances then getting wiped out with no dramatic effect. Take Sheeva for example who is one of the most intriguing characters in the game - her demise was so laughable and stupid there was really no point putting her in the film. What a waste!\n\nI thought Sindel wasn't too bad, but with her bad dialogue, it was quite ridiculous in many ways. She didn't feel much like a fighter, especially with the fight with Kitana at the end - Kitana could have knocked her down in a second - horrible choreography.\n\nWhy did they make Jade a traitor? I thought she was one of the good characters in the game, not a traitor. And what's more - why didn't they make her character black? She is not Asian! I think they just wanted to bring some chemistry between her and Liu Kang but hey it didn't work!\n\nThe visual effects seemed more obvious and cheesy than in the first and a lot of the cast are replaced by new actors. James Remar does not make an interesting Raiden nor a worthy one that is worthy of being feared or respected as the Thunder God. I didn't mind the new actress who played Sonja but the original had more toughness and attitude in her performance. The way Sonja was portrayed made her a bit more softer than fierce - Bridgett Wilson just kicked ass all the way.\n\nActing wise, it's pretty flat and it doesn't help with some corny lines. Kitana and Sindel get some of the funniest lines 'My mother's dead....'as soon will be her daughter!' Overall, the film feels like it's going in too many directions, introducing new characters out of nowhere and not really drawing you into this world. Talisa Soto seems to have the same expression on her face most of the time and really fell flat in this one whereas in the original she seems like she was enjoying herself a bit more.\n\nOh and the ending was so cheesy - how they all walk off hand in hand arms around each other. I think they could have made it a bit more...dramatic. I mean the first one's ending was similar but it seemed to have more of a punch.\n\nIf you can overlook a lot of its faults, you'll have a fairly amusing time with this but in the end you'll be wondering how they managed to make this really uninspiring or suspenseful for a story that is meant to be about saving the world."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "cricketbat",
        "review_rating": "1",
        "review_title": "What is the fatality combo for a movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Griever_2112",
        "review_rating": "1",
        "review_title": "Why did they even bother",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Tristan-13",
        "review_rating": "8",
        "review_title": "Action packed, wild fun, enjoyed it...",
        "review_detailed_main": "Brian Thompson has got to be my favorite actor. Although I have enjoyed him in other works much more because if you ask me, he didn't get enough screen time, even as the major villain. SIGH... There is no justice...\n\nHowever, the rest of the movie was pretty good. Action packed, a lot of the martial arts was wild stuff, really odd and well, interesting moves, some really crazy stuff to watch. However, keeping in mind that the movie is following the plot of an ARCADE GAME, yeah, its kinda silly but very apropro for the plot.\n\nIts got a great soundtrack and is guaranteed to pump you up!!!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "idoitonwheels",
        "review_rating": "6",
        "review_title": "A film that is truly not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "KillerLord",
        "review_rating": "4",
        "review_title": "An Unnecessary Sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "CountJonnie",
        "review_rating": "5",
        "review_title": "When you order cheese, and get cheese",
        "review_detailed_main": "MK Annihilation is the sequel to the surprisingly decent Mortal Kombat. But instead of more, bigger and better, we got more.......cheese.\n\nThe acting is non existent. The story has holes so big, that makes you believe that half the script must have been stolen. The effects are made by someone dedicated to kill the genre. It's just one big mess.\n\nBut what you do get, is a exposure. Although some characters are abused to no end, you get some eye candy. Meaning that the fights are rewarding and the sound track is delicious.\n\nIt's simple. Yes, the movie is horrible. But this is the kind of you-know-what-you-get movie. If you watch it with wrong expectations, you only got yourself to blame. There's just enough to enjoy, IF you liked the games."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "DannyChryst",
        "review_rating": "1",
        "review_title": "Mortal Kombat: Constipation",
        "review_detailed_main": "One of the worst sequels to ever be greenlit. This movie is a painful reminder of how NOT to adapt a video game franchise. I was only 13 when I first saw this and I hated it back then too. Annihilation was so awful that even Christopher Lambert had to turn down the role of Raiden. It's not like the first Mortal Kombat was a truly good film, but they still understood what a Mortal Kombat movie should deliver, techno music and cool fight scenes. Annihilation felt like a complete parody of the first film, with bad acting, bad dialogue, bad writing, bad visual effects, bad green screens and stock footage, bad fight choreography, bad costumes, etc. It was just bad from start to finish, in a way that truly makes it so bad that it's good because of the amount of unintentional comedy gold."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "fj_cruz1",
        "review_rating": "1",
        "review_title": "Utter Nonsense (1 spoiler)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "meissotruey",
        "review_rating": "3",
        "review_title": "Just as bad as the first one, BUT",
        "review_detailed_main": "With the worst visual effects and green screen, i've ever seen. With budget tens of millions of dollars it looks worse than any talented single guy could make like 15 years ago? Or maybe like 25 years."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Aidy",
        "review_rating": "3",
        "review_title": "Not as good as MK I",
        "review_detailed_main": "This movie obviously had more money than the first but it was no where near as good. The plot-line was dodgy to say the least and it was as if they wanted to get as many of the characters (and their moves) in as possible. Unfortunately this meant that characters from the game were added purely for the sake of it. They weren't given any development or good fights.\n\nThe fighting in general was very poor. Raiden had the only average fight, the others were sub-standard. The fight at the end between...well, I don't want to spoil it; let's just say the 'the fight' at the end had awful FX and was impossible to follow.\n\nEven the soundtrack was not as good as the first movie even though KMFDM were involved in both.\n\nAll-in-all not a very good movie on its own...put up against the original MK it's a terrible movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "ashfordofficial",
        "review_rating": "1",
        "review_title": "Dumpster fire",
        "review_detailed_main": "What an embarassing dumpster fire. Apart from Liu Kang and Kitana the rest of the cast from the first film recasted and replaced with some extras that nobody cared. The whole film was off from the start and the narrative and dialogues reek with stupidity. They used nearly most of the Mortal Kombat character roster one way or another, yet they failed to execute them properly mostly because of the rushed pacing and uneven storytelling."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "russem31",
        "review_rating": "4",
        "review_title": "What happened?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "trokanmariel-17760",
        "review_rating": "10",
        "review_title": "\"I love The Woman In Blue\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "vivitheblackmage",
        "review_rating": "6",
        "review_title": "MKA, worthy sequel?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Blinking_Fish",
        "review_rating": "2",
        "review_title": "Bad, bad, bad, avoid this movie unless your dying to see it.",
        "review_detailed_main": "This movie had a few good fight scenes and that was it. The final fight was horrible because of the bad CG they used for most of it. The few fight scenes where very far between. Actually there probably wasn't a good fight. I'm probably just remembering bits and pieces from different fights. The acting was bad but that didn't bother me, the acting was bad in the first Mortal Kombat as well. I found a whole bunch of this movie was just clumped together around a start and end. This is just a movie that should be avoided unless you're in the mood for an ugly film.\n\nMy review 2 out of 10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "MrC_the_Amazing",
        "review_rating": "1",
        "review_title": "Hey, what can I say....it's a horrible, horrendous, bottom-of-the-barrel and entertaining flick",
        "review_detailed_main": "I of course have to give the movie a bad rating. I can go on and on about how terrible this movie is. It's just a mess. My Junior Class movie was better than this, and made a hell of a lot more sense. That being said, I love watching it.\n\nIf you're not a fan of really crappy movies, or Mortal Kombat for that matter, then you will likely turn this off in disgust after about three minutes (like I did with \"Honey\"). I, however, enjoy watching really bad movies, and am an MK fan. I also saw this movie when I was nine, and proceeded to think it was the greatest movie of all time. Nostalgia can be pretty fun sometimes.\n\nThe story is, well, non-existent. Shao Kahn has violated the rules of the tournament and has invaded Earth using the resurrection of the previously-deceased Queen Sindel, Kitana's mother. This, of course, is briefly mentioned once or twice in the movie and no explanation is given. I only knew it because it's the premise of MK3. Anyway, our heroes Liu Kang, Kitana, Raiden, Sonya and Jax proceed on a seven-day long quest to save Earth, which is miraculously completed in about 90 minutes. Fight scenes are alright...just gotta remember it's pyre-Matrix and Hollywood. They'd be better if the direction wasn't so bad. Sometimes they can go at a nice, fast pace and then slow down for no reason, just to draw out the impact. The result is cheesy.\n\nIf it's on Spike TV some night (and it is, a lot), don't be afraid to tune in for a few minutes. Even if you're completely new to the material, you may laugh yourself silly. I know I did."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "kevin_robbins",
        "review_rating": "5",
        "review_title": "They really struggled putting together a worthwhile movie about Mortal Kombat until recently.",
        "review_detailed_main": "Mortal Kombat Annihilation (1997) is a movie I recently watched on HBOMAX. The storyline for this movie picks up where the last one left off where 1-year later our heroes thought they saved the day but they find out their previous win lead to plans of an invasion of Earth and they have just a few days to stop it. This movie is directed by John Leonetti (Annabelle) and stars James Remar (Once Upon a Time in Hollywood), Brian Thompson (Cobra), Talisa Soto (Spy Hard) and Robin Shou (Death Race). The storyline for this, like the previous film, was kind of blah. The script and acting was also dreadful and why couldn't they find a good Raiden for either film? However, the fight scenes, while inconsistent, was much better than the first film. Some of the CGI fight sequences worked and some of them didn't, like the entire opening scene (which was dreadful). The use of characters in this was so much better than the first film, loved the addition of the robots. There wasn't really a worthwhile villain to get excited about, unfortunately. They really struggled putting together a worthwhile movie about Mortal Kombat until recently. This is only worth watching for diehard fans of the series or for nostalgia purposes. I'd score this a 5.5/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Jsimpson5",
        "review_rating": "3",
        "review_title": "Let down",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "JrLaw",
        "review_rating": "1",
        "review_title": "What the !*@% were they doing?!",
        "review_detailed_main": "Many didn't like the original, but I thought it was pretty good. I'm a fan of the game, and was excited when hearing of the movie coming out, and then a sequel, right on! Didn't get a chance to see in the theater - am I ever thankful. It was horrid. Everything was bad, the story problems are probably what bothered me most. Little was accurate to what any MK fan would know. Then there was the fact that most of the characters (excluding main) got all of 5 minutes (if that) of screen time. I am generally pretty open and like movies a lot - especially action - but this just stunk on sooo many levels"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Orlok",
        "review_rating": "3",
        "review_title": "Not a worthy sequel.",
        "review_detailed_main": "Watching this movie is like watching everything that was good drained from it predecessor.\n\nThe martial arts scenes are unimpressive, lacking the speed and energy of the original. If the actors had much martial arts skill, they certainly don't show it. The editing in these scenes is workmanlike at best. Admittedly Peck Prior didn't have much to work with but there are several points during the fight scenes where you can't even tell what's going on.\n\nWhile the sets of the original had a cool expressionist look, these had the look of a Power Rangers movie. Leonetti certainly does a lot with special effects but they just don't look very good (Motaro was pretty well done though).\n\nMeanwhile the music track had little merit. Most of the notable musical themes were taken from the first movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "lord_shonsu",
        "review_rating": "2",
        "review_title": "Not as good as the first movie",
        "review_detailed_main": "Like others have said if you lower your standards a lot this isn't too bad of a movie, all in all it pales compared to the first MK flik and hopefully they'll learn from there errors and make 3 (if they ever do make it) more like the first movie."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "marilynmanson_2006",
        "review_rating": "4",
        "review_title": "mk 2",
        "review_detailed_main": "If you are a BIG BIG fan of the mk games then you might just about like the movie. i personally think the movie is pretty stupid , but then again some bits are pretty cool the ending is absolutely CRAP , i rated the movie 4/10 but if you are a big fan of mk games you will probably like it , if not then don't wast your time watching mk2 when you could be watching THE MATRIX ........ MK1 is way better although in MK2 there are more of the game characters like jax,scorpion,sub-zero,reptile and others..the director went way to far at the end of mk2 i really think they should stop selling it wast of money, !!!! ......!!!!!.....!!!!!...!!!!!!....!!!!!!\n\nROCK ON....."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Mortal Kombat! (gong!)",
        "review_detailed_main": "Violence and gore! Fighting and kicking! Screaming and winning! Yeah, baby! Yeah, indeed! Sorry, but I just cannot get enough of \"Mortal Kombat,\" no matter if I'm playing the ten or so video game releases that were released, or if I'm watching the three or so movies based on this extremely and commercially successful video game series! And everybody can't get enough of that theme music - combining the orient with new age techno dance music! I can hear it in my head now: \"Mortal Kombat!\" (gong!) Yeah! Please watch this movie tonight! All the \"Mortal Kombat\" games and all the movies are a 10 in my book! Kick and punch!!!!!"
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Raven-149",
        "review_rating": "6",
        "review_title": "Pretty much the same as the first one",
        "review_detailed_main": "Ok so it looks cheesy, the acting low caliber and the effects while good still look funny. Does this mean the movie is bad? Well no but it isn't fantastic but it is decent fun if you like mindless action. Not bad but not great."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Dante Hicks",
        "review_rating": "2",
        "review_title": "Absolute nonsense",
        "review_detailed_main": "I cannot believe that I went to the cinema to watch this load of of old pants. The lessons of the first film, which was actually rather good, seem to have been forgotten with great fight scenes, pumping music and a sense of humour curious only by their absence. No wonder Bridgette Wilson and Christopher Lambert decided not to appear."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "allmoviesfan",
        "review_rating": "4",
        "review_title": "Mortal Kombat, annihilated.",
        "review_detailed_main": "Even the most ardent fan of the game would have trouble defending this rubbish.\n\nFour stars because I'm generous...\n\nThey should have left well alone and not made a sequel. Or, if there had to be a sequel - and I'm sceptical, because of how the original film ended - at least try and make it a decent one. Mortal Kombat: Annihilation is as far from decent as I am from being a billionaire, and that, my friends, is a long, long way.\n\nWhilst the original movie was no Oscar-winning masterpiece, it had reasonable acting (considering it's a movie based on a video game), the cool 1990's special effects that you really can't hate, and some inventive and spectacular fight scenes.\n\nPlus it had Linden Ashby as Johnny Cage. Annihilation has none of the above and is poorer for it. All the cast changes were negatives. For example, James Remar as Raiden, Sandra Hess as Sonia Blade and, the afore-mentioned swap from Linden Ashby to Chris Conrad as Cage.\n\nOf course, I know why they made a sequel - for money. But Annihilation was so bad (poorly received by critics and movie goers) it torpedoed the franchise."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "alindsayal",
        "review_rating": "1",
        "review_title": "An Awful Film",
        "review_detailed_main": "So the new Mortal Kombat film finally makes its way to The UK tomorrow which means I have just watched the last Mortal Kombat film made Annihilation and here is my review for it. The premise of the film sees the warriors of Earthrealm attempt to stop Shao Kahn's invasion.\n\nMain Character Robin Shou as Liu Kang and Talisa Soto as Kitana were the only actors who reprised their role from the previous film and after watching this train wreck it is easy to see why. Neither of them are very good in the film and it seems like they were the only ones who signed a 2 film contract so they were forced to be here. The characters are so bland and you won't care about them or anybody that appears on screen.\n\nSupporting Characters James Remar takes up the role of Raiden and he is so dull and poor. At least Christopher Lambert is so over the top its ridiculous but Raiden is given way more to do in this film and the character just isn't very interesting with Rear clearly not enjoying himself at all. Sandra Hess and Lynn Williams take up the roles of Sonya and Jax respectively and they offer very little and Jax actually became really annoying and I was wishing he had as much screen time as he did in the first film. At least the new guy they cast as Johnny Cage realised he only wanted a small role and doesn't barely appear here. Shao Khan is finally here as the villain and he is so cliché, the awesome character from the game is gone and replaced by this bloke who isn't actually that intimidating. There are more characters from the games here but they are used so poorly that I just wish they hadn't bothered.\n\nStory The story is all over the place. It's like the film wants to get through the majority of the stories in the game but it rushes all of the without explanation and it makes fans like me incredibly frustrated. The whole plot is absurd and there is one element of the film that breaks all kinds of lore and makes the film laughably stupid with a really stupid ending.\n\nScript The script of the first film had some charm, yes it was cheesy but it kind of worked. This one is just so bad, with a mix of terrible acting and terrible acting it is just terrible and left me shaking my head as to how somebody got paid to write this mess.\n\nStyle Now the most important part of Mortal Kombat - the fights. They are terrible, the overuse of slow mo is obvious because the cast just weren't particularly great at fight choreography or at least making them. Then you get the effects, they are so bad, maybe some of the worst I have ever seen. I know people will say it had a small budget, then they shouldn't have tried this rubbish.\n\nOverall Overall, Mortal Kombat: Annihilation is one of the worst films I have ever seen. There is no redeeming qualities to this film and no wonder it has taken nearly 25 years for a big budget reboot, avoid this film at all costs.\n\nRating - 1/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Teknofobe70",
        "review_rating": "3",
        "review_title": "Worse than the original ...",
        "review_detailed_main": "Okay, it's confession time. There's a part of me that really enjoys these movies. Like many of my generation, I grew up playing the games, and they were definitely among my favourites. I saw the first \"Mortal Kombat\" when I was about twelve or so, and at the time really I enjoyed it. And now, many years later, I've finally got round to watching the sequel.\n\nThe first \"Mortal Kombat\" at least tries to pass itself off as a film ... but there's none of that here. This movie is a feature length, non-interactive computer game. Only most computer games have better scripts. Okay, that's a little harsh ... some computer games have better scripts. I was prepared enjoy this movie, but that wasn't helped by the fact that Johnny Cage, the most interesting character from the original, is killed off in the first five minutes. The little kid in me screamed \"How dare they!\" when that happened.\n\nWe have a few new characters introduced ... there's a black guy with steel arms, some Chinese chick, another girl with four arms, and scorpion and sub zero's brothers pop in for quick visit too. The big baddie, Khan, is played by Brian Thompson who you'll probably recognised as the alien bounty hunter from the X-files, various roles on Buffy, a role on the TV series \"Werewolf\", or various other cult appearances. He along with the rest of the cast give the appropriate over-the-top performances. I mean, what else could they do? Ten to twelve year old boys might enjoy this movie, and I know I probably would have at that age. But it's far too silly for everyone else."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "The first victim of annihilation is quality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "txwchepjrn",
        "review_rating": "5",
        "review_title": "Too many changes from the first film to make this a classic",
        "review_detailed_main": "Too many actor/actress changes take away from the first film and it never really recovers. The story is pretty weak, but it serves its purpose. It was never meant to be a masterpiece, just released close enough to the first to make a bit of money. But elements in it were hella forced and didn't need to be there. Others were just like......meh. I still enjoy it for what it is, a memory from childhood."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "tiger900",
        "review_rating": "4",
        "review_title": "Could have been better with the right cast...",
        "review_detailed_main": "Like all sequels, this movie did not live up to what the first one was. Had Christopher Lambert and Bridgette Wilson been in this film, it would have been watchable. Personally the story didn't bother me that much, in fact it was on track with the storyline in the MK3 video game, (except for the relationship between Rayden and Shao Kahn). Overall it was a real let down.\n\nI gave this a 4/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "pineapple_boomerang",
        "review_rating": "8",
        "review_title": "If It Weren't This Bad, No One Would Watch It",
        "review_detailed_main": "Mortal Kombat was a fine film, and one of the few films based on a video game to get it right. Mortal Kombat: Annihilation fails miserably. Where MK1 took the time to introduce you to the characters and submerge you in the world, MKA picks up from the end of the first movie and just throws a whole bunch of stuff against the wall.\n\nRain, Sheeva, Noob Saibot, Mileena, Smoke, Cyrax, Sub-Zero, Scorpion and Baraka all make completely unnecessary cameos that cripple their ability to actually play out their storylines in any future sequels. Raynor Scheine is a weak Shinnok, another character who just seems forced into the story. Nightwolf is a character with promise, and indeed, he does- promises to teach Liu Kang three things. Instead, he chucks an axe at Liu's head and teaches him nothing.\n\nSandra Hess takes over Bridgette Wilson's role as Sonya, but fails to give the requisite attitude needed to win over the audience. We don't believe her connection to Cage, who is not only replaced by another actor, but killed off altogether within the first five minutes completely unceremoniously.\n\nJames Remar is laughably weak as Raiden, a role which veteran actor Christopher Lambert previously completely owned. His performance is bland and uninspired, and the jokes seem forced. Brian Thompson gives a cringingly bad interpretation of Shao Kahn, the \"super villain\" who's afraid of his own father and leaves the audience wondering if he was really suppoed to be all that bad. John Medlen's Ermac is silent and unimportant, and Deron McBee's Motaro is a completely two dimensional character.\n\nMeanwhile, original cast members Robin Shou and Talisa Soto act emotionlessly and without gusto, something definitely not lacking in their earlier performance.\n\nSome of the bright spots in the film come courtesy of newcomers Lynn Williams, Musetta Vander, and Irina Pantaeva, who do surprisingly good jobs as Jax, Sindel, and Jade, respectively, though Pantaeva's character is disposed of at completely the wrong time.\n\nThe movie is cheap, and cut corners, including Baraka's supposed death scene, which is just a repeat of Rain being knocked into the fire, and the cheap animalities that closed the movie, which are infamously the worst feature of an awful movie. Overall, one is left with the sense that the producers didn't care about the characters of the Mortal Kombat universe, which the first movie definitely left you satisfied.\n\nSo, overall, I give it an 8/10. Why?\n\nIt's so bad, it's good.\n\nIt's the kind of movie you sit down and laugh your ass off at. Not because it's a comedy, but because it's so bad, that it's genuinely entertaining.\n\nSo, if you can put aside the fact that the premise for a possibly good sequel was butchered by bad acting, bad effects, too many characters, needless deaths, and cheap production, it's a fantastic flick to watch with your friends if you're in the mood for what will soon be a cult classic."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "Karthik",
        "review_rating": "6",
        "review_title": "Not really that bad, but not as good as the first",
        "review_detailed_main": "This movie wasn't that bad actually. It's got a lot of colourful special effects, and good music. But when so many people worked on the story/screenplay (I think there are 5 people credited, including John Tobias, one of the creators of the game), I expected something better. Anyway, I give it 6/10."
    },
    {
        "movie_id": "tt0119707",
        "movie_name": "Mortal Kombat: Annihilation",
        "movie_rating": "3.6",
        "review_username": "SteveNo96",
        "review_rating": "5",
        "review_title": "A somewhat confusing use of time...",
        "review_detailed_main": "After the greatness that was the first movie, this one really confused me. It seemed a bit much like a game, rather than a movie. One villain after another would come on by and there would hardly be an explanation. They didn't even explain Mileena. Had a lot to live up to from the first movie but didn't deliver, with the exception of the Rayden character. He was decent."
    }
]