[
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "gridoon",
        "review_rating": "5",
        "review_title": "A fair time-killer.",
        "review_detailed_main": "\"Barb Wire\" was pretty transparently designed as a showcase for both Pamela Anderson's body (too \"artificial\" for my taste) and her newly-acquired martial arts skills (which, I must say, are quite remarkable). Other than that, it has nothing new to offer to the sci-fi/comic-book adventure genre, although it has a few (too few!) well-executed action sequences and a more professional look than thematically similar crap like \"The Demolitionist\". (**)"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "chrisbrown6453",
        "review_rating": "4",
        "review_title": "Feed her after midnight, get her wet, but, whatever you do, don't call her \"Babe\"!",
        "review_detailed_main": "Pamela Anderson Lee will certainly never be mistaken for a talking pig, especially in the outfits she gets to wear in Barb Wire. Pamela has cascading blonde hair down to there, acres of cleavage and plenty of clingy leather getups cut up to here. If you get distracted and call Ms. Wire the dreaded \"B\" word, you may find yourself dealing with her nasty-tempered Rottweiler, Camille, a sidekick with bite. This highly anticipated comic-book action/adventure, starring the pinup star of Baywatch, lasted only a short time in theaters before going bust, so to speak. I'm sure the backers couldn't care less, as their investment was made back in advance by tremendous worldwide sales. Barb Wire was sold on the star's face and form long before there was a story concept or anything resembling a script. Good thing, too. Yes, the futuristic plot does bear some parallels to Casablanca, but the family resemblance is strictly skin-deep. Barb is a nightclub owner who helps an old flame, now a freedom fighter, and his wife escape from a corrupt police official and some neo-Nazi types. Of all the gin joints in the world, Axel had to walk into Barb's. Barb has just been hosed down while performing a torrid dance onstage and is feeling, well, charitable. The movie gets off to a pretty good start, with tongue well in cheek, but grows wearisome when it forgets to laugh at itself. The explosions, shoot-outs and chases are eventually numbing. Must say, however, I did love the death-by-spike-heel scene which comes early on. Steve Railsback, as the head meanie, Colonel Pryzer, comes across as Tommy Lee Jones-lite. Ms. Anderson Lee, as Barb the Buxom, is game, however, firing oversized weapons and kicking fanny without mussing her makeup. Too bad they couldn't afford some better wigs for her stunt doubles."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "Let's face it, if you're looking for depth and a meaning, you've put the wrong movie in your machine",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "DJ Inferno",
        "review_rating": "",
        "review_title": "Babewatch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Terrible...but it isn't like the filmmakers were trying to make high art!",
        "review_detailed_main": "I have a weird obsession....to see every film on IMDB's infamous Bottom 100 List. \"Barb Wire\" is currently #44....and my 94th film on this list! However, after seeing it, I am not sure that it really deserves to be on the list. Sure, Pamela Anderson got the Razzie Award for her performance and it is a dopey film...but unlike most of the films on the list it was never intended to be a good movie. It simply was made as an excuse to dress (and undress) Anderson in very revealing clothes! It's not what anyone would consider a masterpiece, not was it ever intended as one....just a film to show as much of the lady as she was willing to show. And, in places (such as the opening credits) you see a lot.\n\n\"Barb Wire\" is based on a comic book by Dark Horse, a company known for characters such as The Mask, Hellboy and comics like \"Sin City\". Again....none of these characters or films were ever intended to be carried by the Criterion Collection nor to be up for Academy Awards!\n\nIn this story, Anderson plays the title character, a combination stripper, hooker and assassin. And it's all set in a dystopian and dark world...of the USA in 2017! She strips, turns tricks and leaves bodies where ever she goes! She also, interestingly, sounds like she's doing a Steven Segal impersonation in the film...softly mumbling most of her lines. Bad enough for a Razzie? I wouldn't say so...but it's not like I'm in charge of giving out these infamous awards!\n\nYou can probably assume that I thought the film was pretty dumb....and you'd be right. But it's exactly what many folks wanted in 1996...a chance to see Anderson at least semi-naked. It delivers this....along with a dark, silly and not especially enjoyable story.\n\nIf you actually JUST want to see Ms. Anderson's body, skip to the special features on the disc and select 'SEXY OUTTAKES'....then you can skip the silly movie entirely and just see what most folks who watch the DVD really want anyway.\n\n\n\nBy the way, the opening song was \"Word Up\"....an extremely catchy R&B/hiphop song by Cameo. But, oddly, some other folks perform it...and it's not nearly as good as the original. I wonder why they didn't just pay for the rights to the original....I can't imagine it would have been THAT expensive."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Enchorde",
        "review_rating": "3",
        "review_title": "Fortunately, it is not this easy...",
        "review_detailed_main": "Wow. Now this is not good. However, the movie sets its level right away, by having a stripping, dancing wet Barb (Anderson) already in the introduction of the movie. So, there you have what this movie is all about. Sure you get some violence, explosions and bad costumes as a bonus. Clearly, there is no relevant story in the movie, all revolves around (Barb) to show her off in different ways. The mentioned costumes are almost offending to the audience. Whoever responsible for them clearly did not work very hard. Barb competes with herself to wear some leather-thing that shows off as much as possible, but actually must be considered well dressed as compared to other ladies. The villains wear something that bear a striking resemblance to nazi-uniforms. Well sure, we know who's the bad guys, thank you. And some other people wear broken calculators and other piece of machinery that you'll find in a scrap-heap as hats, and are automatically dressed up like guys from the future. If it was this easy to make a good movie, I could have made it myself. Fortunately it is not, and Barb Wire is not a good movie.\n\nBut, and this is a mysterious but, I actually didn't get bored out of my mind and switched off. The movie actually, in some way, had some small piece of entertainment value throughout that made me stay. And that something, whatever it was, is what ultimately saves the movie from being complete junk.\n\nSo, if you have absolutely nothing else to do, you may want to watch this one, once. You may get some ideas how to (or not to) dress for the next masquerade.\n\n3/10"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "larserikg",
        "review_rating": "1",
        "review_title": "really, REALLY bad!",
        "review_detailed_main": "This movie is not a failure, because the movie makers obviously haven´t tried to make anything else than a mindless flick that lets Pamela Anderson show her cleavage. They have succeeded."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "SimPY_123",
        "review_rating": "1",
        "review_title": "great body, great agility, the rest is missing",
        "review_detailed_main": "Pamela Anderson's body surely looks great (although it may be 90% silicone and fiberglass), and she surely is very \"flexible\" (wich might have come in handy in porn movies, recommendations are welcome)... but this movie has only that... when watching the movie, everybody unifies with the character named Charlie (Barb's brother)... just because he's blind and he's got the luck to miss out part of the movie. Pamela Anderson has an annoying monotone story-telling voice, and the well known consistent-permanented-hairstyle, as well as the disability to truly act (only the little screams and moans sound natural, don't they) and the taste for choosing to play in a story as ridiculous as this one... I watched the movie because i saw a report on TV about classic movie-heroines, mostly created by comics (DC Comics for example made Catwoman after they made Batman, and many heroines were created in the series of another male hero in this way)... and i got curious, I was never suspecting SUCH a great disappointment... it must have been the third worst movie I ever saw (1st=Meet Joe Black ; 2nd=Cast Away) My advice: Watch the striptease at the beginning and then go look for another movie!"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "seanofthedead-79680",
        "review_rating": "1",
        "review_title": "Plot ripoff",
        "review_detailed_main": "Let's recap on this flim's storyline. A fascist government is looking for a scientist and spouse, who's working for resistance takes shelter in a bar. Under management by the spouse's ex lover and a corrupted cop, now where did I heard that before? Oh yeah, Casablanca. You mean to tell me that one of the greatest films get completely copied, and no one see the connection?"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "I_Ailurophile",
        "review_rating": "5",
        "review_title": "Not great. Not awful, either.",
        "review_detailed_main": "I didn't exactly have high expectations. I recall well when 'Barb Wire' was first released, and it gave the impression of being little more than somewhat exploitative schlock capitalizing on Pamela Anderson's body. The reputation it seems to have earned rather affirms that impression. Apart from a couple unexpected names in the cast (Udo Kier, Clint Howard), no one especially stuck out as a possible savior. Why, this remains the only feature film of director David Hogan, whose work otherwise seems to strictly have been in music videos. On the other hand, screenwriter Chuck Pfarrer is a familiar and welcome name; he's been behind a few quite excellent features. Now that I've watched this rather infamous slice of cinema for myself, color me surprised - I wouldn't go so far as to say it's good, but it's not all bad, honestly.\n\nWhile the presentation is very much a sci-fi action flick, the narrative, its characters, and even some of the less ham-handed dialogue in no small part reflect a neo-noir. I could almost imagine the bare bones of the screenplay serving a different kind of story, were it conceived 40-50 years earlier. To be sure, there are a lot of indelicacies in the writing - and many more in Hogan's direction, which in its own dire inelegance accentuates the problems with Pfarrer's contribution. Yet for all the garish gawkiness that pervades the feature, 'Barb Wire' is penned fairly deftly. Scenes are written well, and though I'm no fan of Hogan's eye as a director, nor his guiding hand, the same scenes are broadly ably executed, too. The narrative, characters, and dialogue, already mentioned as a relative anachronism by film industry standards, are stronger than I possibly could have expected. Far from perfect, of course, but my assumptions were \"rock bottom,\" so every little bit counts for something.\n\nThe marketing, costume design, and introduction of Anderson's title character portend a notably sleazy genre romp, so I was almost taken aback by how little the actress' physique is actually emphasized in the feature. It's refreshing, frankly: This isn't so much a \"look at the scantily-clad lady!\" action flick, as it is an action flick that just happens to star a woman famed for her stature. Her acting is another question, though. Whether it's from lack of ability, a series of bad days on set, or just the tawdry guiding hand of Hogan, there are few instances herein where her delivery and comportment is convincing. Or is it just that the character of Barb Wire is supposed to be calm, cool and collected? If so, that's definitely not how it came across. Other performances in the film similarly struggle with authenticity, though I think for the most part the supporting cast comes out looking better than Anderson does.\n\nThere's no mistaking that 'Barb Wire' is also distinctly over the top, probably too much so for its own good. Yet to my amazement, the biggest problem here isn't bombastic action, ham-handed dialogue or acting, or generally poor film-making - but just a lack of a meaningfully distinguishing element. Yes, all the other issues further weigh it down, but the movie above all just possesses nothing to really set it apart, or make it an essential experience. It's not bad, but when you can watch other action pictures with fewer weaknesses, there's no particular reason to seek this one out, save perhaps for curiosity. Oddly, given the low regard for the title at large, to simply call it unremarkable nearly feels like a compliment.\n\nThough not exactly riveting, I'm glad I sat to watch this - why not, after all? In the very least, I don't totally regret it, which alone says much. I can't really imagine recommending this, and to sit for it should likely only ever be a question of inquisitiveness, not active interest. Yet the fact remains that I plainly don't think 'Barb Wire' is half as awful as its reception would suggest. It's not specifically deserving of your time, but if you enjoy action movies, there are worse ways to spend 90 minutes."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "ironhorse_iv",
        "review_rating": "2",
        "review_title": "Barb-Wire is like a botch boob job. Pretty ugly and scarring. Not sexy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "midnightcub",
        "review_rating": "9",
        "review_title": "So much fun. A real Female superhero",
        "review_detailed_main": "Yes you read that right. Nine!! Oh it's B-grade. Cheesy. And so much fun. It's more than the 3 stars some give it. Pamela does MUCH more than show some cleavage. She even does many of her own stunts. Back when stunts were dangerous too. You can do FAR worse than this film. Especially lately."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "guisreis",
        "review_rating": "7",
        "review_title": "A distopic remake of 'Casablanca' with Pamela Anderson: surprisingly, it is not bad",
        "review_detailed_main": "Although based in comic book series, the \"Barb Wire\" movie intends to be a remake o classical \"Casablanca\". It keeps the core elements of the 40's film, but adapts it to a distopic sci-fi action futuristic movie. Pamela Anderson plays Barb, a role similar to Bogart's Rick. The gender of the love affair from the past and of the third part of the love triangle have also been changed. The fictional town of Steel Harbor in the United States replaces Casablanca and the story is held during a futuristic Second Civil War rather than in the beginning of World War II. Both protagonists own a bar/nightclub, but Barb Wire is also a bounty huntress. As this remake is a sci-fi film, special contact lenses that cheat retinal scans substitute the letters of transit kept with Rick. As predictable, acting is worse in this remake, which has much more action. Off course \"Casablanca\" is much better, but surprisingly \"Barb Wire\" is not bad, in spite of the bad critics it has received."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Uriah43",
        "review_rating": "5",
        "review_title": "Not That Bad",
        "review_detailed_main": "\"Barb Wire\" (Pamela Anderson) is a nightclub owner in a futuristic America where a civil war has broken out between two distinct factions. The first is known as the \"Congressional Directoret\" and the second as the \"Resistance\". Now, as it so happens Barb Wire also moonlights as a mercenary who has little sympathy for either side and operates in the only free city left which is known as \"Steel Harbor\". However, when a former government scientist named \"Dr. Corina Devonshire\" (Victoria Rowell) escapes from the Congressional Directoret and arrives in Steel Harbor carrying some special contact lenses worth $2 million-along with Barb Wire's former lover named \"Axel Hood\" (Temuera Morrison)-Barb Wire becomes indirectly involved. And that spells bad news for whichever side she's not on. Anyway, rather than reveal the rest of the details and possibly spoil the film for those who haven't seen it I will just say that this movie was widely panned by the critics when it first came out. As a matter of fact, Pamela Anderson received several Razzie Awards for her performance which included \"Worst New Star\" and \"Worst Actress\". Other Razzie Awards for the film included \"Worst Picture\" along with being nominated for \"Worst Screenplay\" and \"Worst Original Song\". So judging from these awards and nominations one would think that this was an extremely bad movie. However, rather than simply going with the proverbial crowd I happen to have my own opinion which is quite different. First, I didn't think her performance was that bad. As a matter of fact I kind of enjoyed it. Not only that but I have seen a lot worse movies than this particular one. Now, that's not to say that this film was great by any means because it clearly wasn't. But it was hardly the worst movie for that year. Nowhere close. Likewise, although I didn't especially care for the performance of Temuera Morrison I thought the performance of Udo Kier (as \"Curly\") was actually quite good. Anyway, there you have it. Again, while \"Barb Wire\" may not be a great film I didn't think it was necessarily that bad either. I rate it as average."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Kevin-11-2",
        "review_rating": "",
        "review_title": "Not great, but a lot of fun.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Chelman666",
        "review_rating": "1",
        "review_title": "Doesn't deserve the celluloid it's printed on",
        "review_detailed_main": "I almost find myself compelled to comment on this movie although i vowed to myself to ban it entirely from my memory after having watched it. However I think that this movie is so awful and terrifyingly uninteresting that I must warn all movie watchers from wasting 90 minutes or so of their valuable time. Essentially this movie is Baywatch revisited in cyberpunk. Like Baywatch there's no story, no character development, poor direction, poor...well everything. And just like Baywatch it focuses on Pam Anderson's breasts for the majority of the film. I would only suggest this movie if you're an adolescent admirer of movies which interchange a plot for a bra."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "sqsolross",
        "review_rating": "1",
        "review_title": "One of the top ten worst films ever.",
        "review_detailed_main": "It's worth watching purely for the cringe factor.\n\nThe acting is wooden. The story line is hardly existent, and the script writing is pretty poor too.\n\nLet's face it, Pam can't act. The number of cuts (with associated continuity errors) is testament to the number of takes it took to do some scenes. Even just the act of turning over a table seems beyond her and needs to be pieced together from multiple takes.\n\nGiven the number of takes they had to do they really should have employed a human to manage continuity, rather than the chimpanzee they seem to have had doing the job. If sitting in the corner throwing their poo at passers by can be called \"doing the job\".\n\nAnd at least they could have picked a stunt double who at least looks vaguely like Pam. The one they chose barely fills the bodice Pam wears, and looks like a man to boot. I mean, Pam's breasts spill over the top of her bodice. Her stunt double has noticeable gaps where flesh (or rather silicone) should be."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Tito-8",
        "review_rating": "4",
        "review_title": "Not horrible, but still weak",
        "review_detailed_main": "While this isn't the huge bomb that so many people seem to think that it is, it is a pretty forgettable film. There's nothing particularly bad about this movie, but things never get very interesting, and near the end I was getting somewhat bored. Pam is adequate at best, but did anyone really watch this film to see her give a great acting performance? Like most everyone else, I agree that she looked fabulous, but it takes more than some great eye candy to make a movie worthwhile. This is a passable time killer at best, and even Pam fanatics will be hard-pressed to actually call this a good movie."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "breakdownthatfilm-blogspot-com",
        "review_rating": "5",
        "review_title": "Is not a good film, but also isn't the absolute worst either",
        "review_detailed_main": "Thus far in mainstream comic book related movies, only one female antihero has turned out having very little complaints and that's Black Widow from Marvel's The Avengers (2012). Then again, she also has not had any solo film but she has appeared in several films prior and so far, there really hasn't been an uproar over Scarlett Johansson's portrayal as the deadly assassin. Beyond this character however, movie studios have not been able to pinpoint the proper approach to making a worthy female heroine film. There have been several attempts, but so far none have proved to be lucrative. For Dark Horse Entertainment, which was no stranger to their comic books being adapted to film took more than one wack at making a feminine hero focused film. The year before, they also helped surface British Comic, Tank Girl (1995), which also flopped. Then came this, which by many consider being one of the worst comic book films. As an overall film, it's not even near decent but it isn't the worst.\n\nThe setting takes place in 2018 where (like many other futures are described) the next all out war broke out. This time being called the \"second civil war\"; there's only one place among the whole land where people can live free without the strong eye of government looking over them. However even there, no one is safe. After learning a deadly secret, Dr. Cora (Victoria Rowell) and her husband Axel (Temuera Morrison) attempt to flee the country to Canada but are met with endless setbacks. It is at this point they look to find the only person who can help them escape, a local bar owner / bounty hunter known as Barb Wire (Pamela Anderson). As a story, not all of it is passe but a good portion of it is overused elements seen from multiple other films about dystopic futures. Plus cutting it off close to 2020 shot itself in the foot looking at it now. The writing for this screenplay was carried by Chuck Pfarrer (Darkman (1990) & Hard Target (1993)) and Ilene Chaiken (as her first work) did take care of properly giving the main characters' their back story but there are other parts that don't work.\n\nA subtle flaw is quick changes in character motivations. At one time in the film a character will have a certain opinion. Then, later on in the film they will declare the opposite opinion with no reasoning. That's a bit frustrating when trying to understand a character. Another matter of contention is convenient contrivances. If something is out of reach for an individual and then later on it is revealed to the viewers that they acquired it (again, with no reason how), it gets frustrating. Almost like the film is saying, \"they're just that good, no sense in showing how they did it\". The last poorly written component to this film is main villain Colonel Pryzer (Steve Railsback). Besides just being callous to everyone he meets, Pryzer is a very generic antagonist dressed in Nazi garb. It's nothing to point out or even worth remembering about because his character is so two dimensional. Surprisingly, the rest of the cast in some ways makes up for it. Local law enforcement Alexander Willis (Xander Berkeley) tries to add some humor to the situation as well as Charlie (Jack Noseworthy).\n\nThere's also guest appearances from character actors Andre Rosey Brown (as a more eccentric villain than Pryzer), Nicholas Worth, Clint Howard, Udo Kier and Nils Allen Stewart. The relationship between Axel, Dr. Cora and Barb Wire isn't the most believable but it isn't unlikable either. Actually, although Pamela Anderson speaks many of her lines in monotone, some of her quips are funny to hear. When she curses though, the viewer will be able to tell she's not acting material. Then again, if there's one thing Anderson nails, it's her figure of Barb Wire. Of all obvious reasons to pick her, what else? Of course, another curvaceous female could've been cast but let's deal with what's here. Plus, they got the costume down pat and it sure looks good on Anderson. Surprisingly Anderson can even handle the action sequences quite well. Yes, the fact that she also had stunt doubles is understandable but not truly noticeable which is required because viewers should not be able to tell.\n\nCinematography was shot by Rick Bota for this movie. Most of the time the camera-work is acceptable for the action scenes and dialog. The only areas where it fails to feel compelling in the story is in its tracking shots. This was specifically evident either when it was filmed in the bar that Barb Wire owned or outside in garbage dump like settings. Since the story takes place in a chaotic dystopic future, the use of dusty, beige colored, and dune infested backdrops is the ultimate cliché for this setting. At least try to make it look different than what's been normally used. It's just been seen too many times. Lastly the musical score was arranged by French composer Michel Colombier. For this round, his composition sounds a bit like Gary Chang's score from Death Warrant (1990) using occasional steel drums. However, a lot of his music is absent and is replaced by hard rock which I guess is appropriate but the sound gets very cluttered because of it and that doesn't help.\n\nMany people say it's one of the worst comic books put to film. It certainly doesn't have the most competent of storytelling (which includes the contrivances & clichés) and not every character stands out like they should. Pamela Anderson also isn't acting material but she actually gives the viewing a \"so bad it's good\" experience. The action does entertain and some of the other supporting cast members do help make it at least average."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "revival05",
        "review_rating": "2",
        "review_title": "Stay as far away from this movie as possible!",
        "review_detailed_main": "This ''movie'' is really bad. It is just a pathetic excuse to watch Pamela Anderson Lee in several nude-scenes (then specially the 10 minutes opening scene). The movie is filled with boring action, stupid dialogues and silly comments like ''Don't call me Babe''."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "dilgrod",
        "review_rating": "1",
        "review_title": "Barb Wire or how to turn a lovely classic in an awful cyberpunk cheesy movie, but with plenty of boobs",
        "review_detailed_main": "What a wreck...\n\nIf I could describe this film in short: one minute of the movie focused on Pamela's boobs, and then the rest of the movie consists in a group of cheesy B-actors defecating on \"Casablanca\" . This movie is SO BAD and SO badly acted, even in the boring and over exploited cyberpunk genre.\n\nThe actors are terrible, the screenplay is cheesy (even for a cyberpunk), and the EVERY character in this movie has the word \"cliché\" tattooed in his forehead.\n\nDo yourself a favor and don't watch this."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Quinoa1984",
        "review_rating": "4",
        "review_title": "\"A boob is just a boob...\"",
        "review_detailed_main": "I would've loved to see the pitch session for Barb Wire. After getting through the whole, \"it's a vehicle for Pamela Anderson Lee, Babewatch Babe, though we don't call her Babe, she's a kick-ass bounty hunter who runs a bar and does this and that and there's a lot of explosions and action and kills and more explosions, yada yada yada,\" they had to try and explain the actual story. What did they come up with? Apparently, not so much the comic book story (from what I've heard the comic book is about, which isn't much), but, well... Casablanca? Yes, Casablanca, at least to a great degree. It's hard not to see one of the most 'what-the-huh?' combinations of low-art with high-art since Strange Brew's story came right out of Hamlet. There's even Clint Howard as Peter Lorre and some character named \"Fatso\" who plays Sidney Greenstreet! One things for sure, folks, Pam Anderson is NO Humphrey Bogart (we all know who's were real and spectacular after all).\n\nBut I digress, this is a pretty stupid movie, made on the cheap all at the expense of men everywhere who can't get enough of the overly stacked blonde bubble of hot that is Pam Anderson (Lee at the time), who is pretty much either naked (and when so either in an overlong dance sequence in partial nudity, or wrapped conviniently in bubbles, or in leather, more so the latter) and spouts poorly written dialog like a pro. This is probably both a compliment and an insult; only someone like Anderson, who is some nice, Heavy Metal style eye candy but not that much of an actress, could pull off this script like she does, which features special contact lenses as the MacGuffin and a transport of some girl across the lines of some Nazi outback law enforcement agency out to hunt her like dogs. Did I mention there are explosions and stuff? They're cool, I guess... Not much else here, folks, unless you're Beavis and Butt-head. That being said, for a Beavis and Butt-head favorite, it's not the worst in the bin."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "tereseatbiocybernaut",
        "review_rating": "10",
        "review_title": "People don't get it",
        "review_detailed_main": "This show doesn't need to be any different than it is. The over the top craziness of the lines and the characters are more than enough entertainment for anyone. People who have critiqued this expecting a Bruce Willis type of action adventure just don't understand what this is about or where the entertainment factor lies in this show.\n\nAs far as action adventure goes, the stunts and the pace of the movie are great! It is full on fun and exciting. But it is not some macho style, take Barb Wire seriously as an action adventure. It actually is really cool and when people get over their judgement of Pamela Anderson and see the movie for what it is... light hearted entertainment... then they might enjoy it as much as I do. But then again, boobs seem to make men upset. They want to see boobs on someone that they think they can maybe imagine themselves with. And Barb Wire is not that woman. Her attitude doesn't lend itself to making men feel like they could rush in and save her."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "The_Movie_Cat",
        "review_rating": "7",
        "review_title": "\"Have you ever heard of overkill?\"",
        "review_detailed_main": "Picture this: a Pamela Anderson science fiction double bill on television. I mean, you'd just HAVE to watch it, wouldn't you? Just to see how bad it was.\n\n1995's Naked Souls kept making me look for the \"TV Movie\" credit that wasn't there. A cheap and exploitative \"erotic thriller\" where Pammie exposes her left breast within the first three minutes of the movie. Anderson is an artist, specialising in plaster-casting nude women, rubbing mixture over their breasts while they proclaim \"it feels kinda sexy\". Her boyfriend, decently played by Brian Krause, is studying brain wave patterns and accidentally crosses his own with that of a serial killer. It's all very silly and derivative, also involving a Faustian pact with a mysterious benefactor. What disturbs is that all the victims of the killer are nude women \u0096 I mean, who gets into a swimming pool naked? \u0096 meaning the film uses sexual violence as titillation. Dean Stockwell, in a minor role, is wasted in stuff like this.\n\nIf Anderson's role in the predictable Naked Souls was peripheral (and also completely irrelevant to the plot), then Barb Wire sees her take over the screen. Released the following year, this saw the now Pamela Anderson Lee as the titular character, a Barbarella of the 90s. Of course she can't act \u0096 she only manages one expression throughout the whole two hours \u0096 but her assured performance is wonderful here. While it's easy to lump both these films together as trash entertainment, Barb Wire is so much more than that. A vibrant, witty and well-directed cartoon for the screen, its constant energy is a delight. What really appeals is in seeing the sheer amount of cinema pastiches the film rigs up. Batman, Never Say Never Again and even The A-Team are all parodied. But most significantly, it shares multiple plot similarities with Casablanca, and I honestly suspect that this was intentional. Or would its 2017 planes really be so old-fashioned? Barb is a neutral bar owner during a war by day (ring a bell?) a vixen for hire by night. The landscape she occupies is an excitingly neon world of legalised prostitution, engineered diseases and sophisticated contact lenses.\n\nMaybe the opening moments \u0096 Anderson Lee exposing her bare nipples while water washes over them to a baying crowd \u0096 are tacky and unnecessary. The scenes that follow also contain a torture sequence that is not only misguided in its attempt to arouse but also transparent in its purpose for expository dialogue. Yet beyond those first few scenes we have an action movie that contains above-average scripting for the genre, and some fun moments. It's amusing to try and guess whether Pam knew she was being kitsch or whether she genuinely believed she was giving a good performance. But whatever the answer, it still gets a laugh when a rowdy customer finds his genitals in the mouth of her rabid Rottweiler. \"Sit\", she tells the dog, much to the drunk's displeasure. \"Now, you don't want to see her roll over, do you?\"\n\nAll the criticisms that can be made against this film \u0096 that it's badly acted, appallingly scripted, dumb and sexist (even though none of them are 100% true anyway) \u0096 can be disputed by the fact that it's SUPPOSED to be badly acted, appallingly scripted, dumb and sexist. This is a film that never pretends to be anything other than a pumped-up, camp and downright silly movie. What's more, it succeeds in being more entertaining and convincing than many of the \"straight\" versions of the same format, with particular note drawn to it's fight scenes. They may be excessive and lack maturity, but they're shot beautifully and are fun to watch. I'm not a huge fan of action pictures, but I thoroughly enjoyed this one. If you want a film that possesses depth and integrity, then see something else. If you want a lovably stupid movie, with Pamela Anderson sticking out her little finger as she burns rubber on a motorbike, then watch this. Tremendous fun."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "kevin_robbins",
        "review_rating": "3",
        "review_title": "This is a bad movie that is worth watching",
        "review_detailed_main": "Barb Wire (1996) is a movie I watched for the first time in a long time recently on Tubi. The storyline follows a struggling night club owner who is also a bounty hunter. Her life gets complicated when her wanted ex-boyfriend arrives back at her club bringing unnecessary attention to her life by the local police.\n\nThis movie is directed by David Hogan (Most Wanted) in his directorial debut and stars Pamela Anderson (Scream 3), Tony Bill (Pee-Wee's Big Adventure), Clint Howard (Apollo 13), Tom Lister Jr. (Friday) and Jennifer Banko (Friday the 13th Part VII).\n\nThe opening credits is the best part of the entire movie. It may be better just to watch that portion for 90 minutes instead of the actual film. The settings, attire and backdrop for this movie actually wasn't that bad. The costumes and wigs are great and bad at the same time. The soundtrack isn't that bad either. The movie is purposely bad and cheesy. The ending scene with the grenade is really good as are some other action scenes.\n\nOverall this is a bad movie this is worth watching. I would score this a 3/10 and recommend seeing this once."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Pam's got nice breasts.....and that's the end of the film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "dunmore_ego",
        "review_rating": "3",
        "review_title": "Livin' Large on Marketable Melons",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "The only good thing about it is Pamela Anderson's cleavage",
        "review_detailed_main": "Barb Wire isn't the worst movie of 1996(quite), Bio-Dome and Ed are worse, but it is a terrible movie with its only redeeming asset Pamela Anderson's cleavage. Anderson is very sexy and does better than expected in the action sequences, but the way she delivers her lines just for me amplifies her limitations as an actress. And the rest of the acting ranges to pretty poor to non-existent. The action sequences are in a way efficiently performed but choreographed in a generic way and some of the editing feels sloppy. I liked how catchy and how upbeat the soundtrack was but it got a bit too loud and too much after a while, the script is cheesy and weak and the story is so thin you have to watch closely to see if there is a story, and I have no better news about the direction. Overall, a terrible movie. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "DJ_Shilo",
        "review_rating": "1",
        "review_title": "Big Boobs and Big Guns",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "fntstcplnt",
        "review_rating": "3",
        "review_title": "Barb Wire (1996)",
        "review_detailed_main": "Directed by David Hogan. Starring Pamela Anderson (Lee), Temuera Morrison, Jack Noseworthy, Xander Berkeley, Victoria Rowell, Steve Railsback, Udo Kier, Andre Rosey Brown, Clint Howard, Jennifer Banko, Shelly Desai, Nicholas Worth, Mary Anna Reyes. (R)\n\nIn a civil war-torn future, the jaded, vixenish owner of a nightclub, Barb Wire (Anderson), struggles to stay neutral when an ex-lover (Morrison) comes back into her life. Of all the gin joints in all the towns in all the world... Indeed, while this movie is based on a Dark Horse Comics character, the plot is lifted straight from \"Casablanca,\" even though it seems aimed at an audience that has probably never seen (or heard of) that film. Grungy atmospherics aplenty, and some decent action during the climax, but its raison d'être is obviously so viewers can ogle its pneumatic star; fans should take note, however, that after she performs a peekaboo striptease during the opening credits, they'll have to settle for no more than a lot of leather-clad cleavage after that. She's also a pretty unimpressive actor who picks one vocal modulation and sticks with it throughout, but that doesn't really matter, does it?\n\n34/100"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "dr_necron",
        "review_rating": "1",
        "review_title": "hmm",
        "review_detailed_main": "An sci-fi action movie remake of casablanca with Pamela Anderson. Even the idea of this film is awful. The sad truth of the matter is it actually manages to be worse than that, I sat watching this movie with increasing horror trying to find a redeeming feature, something positive to say about it and the best i could come up with was \"at least I didn't pay to see it\" The acting is terrible the script is poor, most of the sets seem to be abandoned werehouses or waste ground. This movie was Pamela Andersons first and only big screen staring role to date, sfter this movie the chances of her getting another must have become very slim indeed"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "DanB-4",
        "review_rating": "1",
        "review_title": "Likely the peak of Pamela's Career",
        "review_detailed_main": "Like some IMDB subcribers, I tag the end of my comments with my own personal star rating for each film. Not that I think anyone cares, I am probably just feeding my secret desire to be a real critic. But I digress. The reason I mention this is that it takes a very special sort of bad for a film to get zero stars - it has to be completely devoid of redeeming quality - and this is it. You cannot possibly find a way to make this movie worse.\n\nEven Anderson's hose-sprayed, shoe-pitching, quasi-striptease act over the credits aren't worth the rent. Nobody's physique is more in the public domain than Anderson's and there is no need to endure this flea-ridden dog to catch a glimpse of her goodies.\n\nSome people are amused by its Casablanca plot line, but it offends me. But the film does not make me angry though - it fails generate any kind of response or emotion. It is an entertainment-free dead zone with some silicone and leather highlights.\n\nPamela Anderson has said several times that it is her goal to win an Oscar. Well .... she'd best take up Costume Design.\n\nAvoid this at all costs. Zero out of ****."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Anonymous_Maxine",
        "review_rating": "3",
        "review_title": "Babe... Babe\u0085 BABE BABE BABE BABE BABE!!!!!!",
        "review_detailed_main": "Ah, nothing. Just like I thought.\n\nLet's face it, Pamela Anderson can NOT act. Barb Wire is so obviously nothing other than an excuse to get the most famous blonde on the planet into a bunch of chesty outfits and occasionally not even that much that that fact alone provides much of the film's comic relief. This movie reminds me of a similar crapfest that Anna Nicole Smith put out the year before, called Skyscraper, which was basically a remake of Die Hard but without the acting, the budget, the script, or the brains. Similarly, Barb Wire does not do much to cover up how extensively it borrows from Casablanca. And also similarly, this time without the acting, the budget, the script, or the brains.\n\nWhenever you have a film that stars someone like Pamela Anderson, who is famous more for getting naked than anything else, it's not hard to predict that at some point during the film, she will pose as a stripper or a prostitute or something in order for the film to get her out of her clothes, and I'm pretty Pam does both here. There's a thin storyline involving politics and secret weapons and Canadian money, of all things, and this, along with just about everything else in the film, is set on the back burner in favor of the emphasis on Pam's breasts, which are clearly more famous than she is.\n\nWith movies like Barb Wire, I always try to look for a point where the film admits that it is not trying to be taken seriously. Bad movies can be highly entertaining when they come off as campy (see any of the three Evil Dead movies, the funniest and most entertaining horror films ever made), but not when they pretend to be something that they're not. I think that the biggest problem in this area about Barb Wire is that Pam seems to take her role too seriously (her reaction to the term `Babe' is a case in point). And I say `seems' because there is always the possibility that she is over-acting just for the overall fun of it. However, it's just hilarious how serious she appears and how she makes such an effort to sound threatening, when in reality it's totally obvious that it's all a joke.\n\nIn this sense, it's difficult to judge this film because it's hard to know how it feels about itself. Personally, I think that the film has grossly overlooked the fact that the vast majority of itself as a whole is going to come off in theaters (or, in this case, on video, seeing how this movie had been booed out of theaters before many people even knew it was there yet) as comic relief. Barb Wire is not really an action movie that makes every excuse possible excuse to get Pamela Anderson out of her clothes, but rather a comedy that amusingly poses as an action film, and the strange thing is that the nude or semi-nude scenes don't lead to sex scenes or anything like that, but usually to violence. This, I guess, is in bad taste depending on your personal views, but it's interesting to consider how many people consider BOTH of these to be in bad taste.\n\nOkay, I have to add something here. I just re-visited the Barb Wire home page on the IMDb, and the tagline for the film, which I never noticed, is based on one of the dumbest things about the entire movie.\n\n`Don't call me babe.'\n\nSigh"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "kersus",
        "review_rating": "10",
        "review_title": "No one else!!!",
        "review_detailed_main": "Not many actors stumble on a role that seems designed just for them. Barb Wire wasn't, as it was based on a comic book series. Yet Pamela Anderson was perfect for the role. I've never liked her in those ditzy roles as while she may not be the brightest girl on Earth, she just can't pull them off. She is far better in a serious (possibly pretend serious) role.\n\nNo one else could have fit the role so perfectly and she really did a great job. Sure people will mock her for being who she is, but if you are open before seeing the movie, she will surprise you.\n\nThis isn't all about showing off Pam's body (who's fake boobs are not anywhere near as nice as they were before she had them done) but is a decent comic book made into a dynamite film.\n\nPam needs more roles like this and should steer clear of the ditzy role she seems to prefer playing. She's made for this. I'd go see any sequels for this film.\n\nAn instant hit for anyone who likes the style of slightly corny comic book adaptations."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Hamstur",
        "review_rating": "7",
        "review_title": "Proper expectations",
        "review_detailed_main": "While Barb Wire isn't an Academy style good movie, it succeeds wonderfully at what it is: a comic book translated to film. It's over-acted and over-the-top, but it's supposed to be. It's great eye candy and lots of fun to watch. I think Pamela Anderson did a great job being a two-dimensional comic book hero - think Clint Eastwood spaghetti western with tight leather. Keep in mind what the film is trying to be and you'll have a great time."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "GiraffeDoor",
        "review_rating": "3",
        "review_title": "Don't...call it \"Babe\". I WISH I'd rewatched that instead...",
        "review_detailed_main": "I can so believe the base source of this was a dynamic, captivating and sexy creation.\n\nBut this is just flaccid. There is something perpetually lacklustre in the handling of this bland, leather bound thriller that seems to sort of want to be Mad Max but doesn't want to put any of the work in.\n\nBland settings, a slow, generic plot and a tepid script make sitting though this a bit of a chore. Anderson plays Wire with all the formidably of Rachel Green. It isn't even funny, I kind of feel sorry for her. The movie was pretty much made as a vehicle for her when she should have been playing, I don't know, the Stifler Mom in some teen comedy. But in her defence she had a pretty bad script to work off.\n\nI can believe that Barb is one of the greatest heroines of comics. But this movie feels like it was churned out by people who had only read summaries of her from her wiki page.\n\nOverall pretty insulting. Not even the striptease is captivating."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "drtommy94",
        "review_rating": "",
        "review_title": "not that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Rammstein-2",
        "review_rating": "1",
        "review_title": "A legend in its own right",
        "review_detailed_main": "Hahahahahaha, is this for real? Hohohoho hahahaha this is just too much! Hahaha...hoho...hehe...*sniff*\n\nWell, now. I could just as easily say that it's not that bad, and point out that I at least got a good laugh when watching it, which is endearing to me. But you know, when something so masterfully stupid is filmed with one of the most over-estimated beauties of the world (I won't even mention her acting) and haussed so dramatically by the producers - well... I dunno. They don't even deserve my laughter."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "DanTheMan2150AD",
        "review_rating": "5",
        "review_title": "Big tiddy glam rock hair metal the movie",
        "review_detailed_main": "There's a significant cult appeal with Barb Wire, one that I immediately understood from the opening credits, a film with outrageous, over-the-top comic book stylings through and through, not pretending to be anything more than that. With plenty of energy, an utterly deranged sense of pleasure and great cyberpunk aesthetics, the film ultimately becomes unintentionally goofy due to trying to approach its subject matter with a lot of misplaced sincerity. Oh, and there's boobs, lots of boobs. Pamela is pretty much there for the eye candy, I ain't complaining even if her acting and non-existent line delivery are nothing to write home about. The delightful supporting cast, however, more than makes up for Pam's shortcomings, featuring the likes of Temuera Morrison in chad mode, B-movie legend Clint Howard plus Udo Kier AND Steve Railsback?! What the hell?! Yeah, I liked this, sue me. Granted, Barb Wire is not a great movie, but the filmmakers didn't use that as an excuse to be boring or lazy, it's great fun if you can buy into the horny glam metal vibe. Low brow doesn't mean low effort."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Cinemaniac1984",
        "review_rating": "2",
        "review_title": "Barb Wire could have been Pamela Anderson's big break on the big screen, but this movie failed miserably.",
        "review_detailed_main": "Pamela Anderson became famous after her role on the hit TV series Baywatch, as well as being a popular feature in Playboy. I must also admit that I has a childhood crush on Pamela Anderson from her time in Baywatch and I was eagerly looking forward to Barb Wire. Needless to say, Barb Wire was very bad.\n\nAlthough I felt sorry for Pamela Anderson, she just sucked in this movie. It didn't help that the entire movie was of a poor standard. The movie was uninteresting, and I found myself agreeing with critics and audiences alike in expressing their dissatisfaction with this movie. It was no surprise that Barb Wire was a box office failure and easily one of the worst movies of 1996.\n\nBarb Wire could have been so much better, even a cult classic, however it was not meant to be. Unfortunately for Pamela Anderson, she never reached the same heights of success as she did with Baywatch and her highly publicized career with Playboy. Such a shame.\n\n2/10."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "vanilia-24825",
        "review_rating": "5",
        "review_title": "I have thoroughly enjoyed it",
        "review_detailed_main": "As much as I appreciate great movies and prefer to watch something that makes me think a little, a bit of brainless action and pure camp often does the trick too! Watching the trailers I expected more than I got but it was still enough. Despite it lacking orginal story, good acting and someone that you would care about in this movie besides Pam; it is not as bad as everone says. To me the worst sin that film can commit is being boring, which is something that I have not experienced here. The best characteristics of Barb Wire are the very well done action sequences and sexuality of the main protagonist. I mean c'mon, who would watch anything with Pamela anderson if it wasn't for her boobs. as much as I don't find women attractive and as I as woman I should say that she is just portayed as an sex object,but I think that is the whole fun in it! This movie is not pretending to be anything else than it is; a cool B-class film. I will definitely watch it again. For me it is way better than the Prometheus which I absolutely hate."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "moonspinner55",
        "review_rating": "2",
        "review_title": "Heavy-metal \"Casablanca\"...",
        "review_detailed_main": "Perfectly dreadful futuristic action thriller-cum-noir set in the year 2017. \"Baywatch\" babe Pamela Anderson Lee gives a faintly amusing non-performance as a sexy bar owner/bounty hunter/prostitute who gets involved with Resistance fighters during a second Civil War. Although based on the Dark Horse comic book serial, the film plays like a cross between a heavy-metal music video and an update of \"Casablanca\", complete with campy undermining and throwaway bad jokes. It's a mechanical dirge, a product of Hollywood deal-making (the posters with Pam were on display before the cameras even started rolling). *1/2 from ****"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Jayteasee",
        "review_rating": "1",
        "review_title": "Took me a while to figure out what's wrong with this movie...",
        "review_detailed_main": "I remember... when this movie was coming out, I was somewhat in the target group. At least I reacted strongly towards it.\n\nPamela Anderson has everything I like. Those who know me better know what that is. Her corset outfit with those boots are just the right stuff. A lot of that and leather.\n\nSo what on earth is wrong? It took me some time to figure out what's wrong with this movie and Pamela Anderson - or rather the character she plays.\n\nThe problem is, Barb Wire is a man! I don't know, that just dawned to me after the umpteenth time I watched this film. I couldn't figure out what was wrong with the character, as the exterior seemed just right.\n\nBut Barb Wire is a man! That's the problem. She's a man. The exterior is from men's wet dreams. Clearly. It's so much from the wet dreams that it turns her into a man.\n\nThat made me understand the whole thing better and made it somehow enjoyable. Maybe it's the \"don't take it too seriously\" department that others have mentioned around here.\n\nBut that kind of made it work for me. Strangely."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Varlaam",
        "review_rating": "1",
        "review_title": "Animal, Vegetable, or Mineral?",
        "review_detailed_main": "I feel like calling this mess a cartoon but that term already applies to \"What's Opera, Doc?\", \"Der Fuehrer's Face\", \"Peace on Earth\", \"The Sweater\", and so many more. Maybe we need a new word, \"barfoon\" for example, which would combine \"cartoon\", \"buffoon\", and \"barf\". Or maybe \"crapoon\". You can figure out the etymology for that one yourself.\n\nDo you remember Steve Railsback when he was in \"The Stuntman\" or \"Helter Skelter\"? Well, you'd better avoid this one then. Hang on to those happy memories.\n\nThe pneumatic star of \"Barb Wire\", who thrusts herself so protuberantly and tumescently into the camera, delivers her lines like a screenwriter's stenographer giving her read-back. Flat. Unmodulated. Mostly free of errors. She is reputedly Canadian. If we gather together enough signatures, can someone's citizenship be revoked?"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Fox in Socks",
        "review_rating": "10",
        "review_title": "My girlfriend liked it just as much as I did",
        "review_detailed_main": "Cheese. The key to enjoying this movie is not take it seriously! Don't expect great art! It's based on a comic book, it's got guns and 'splosions and Pamela Anderson pre-reduction. Waddaya want, Ingmar Bergman? It entertained me, and I didn't have to use my brain once. I even bought a copy, it sits on the shelf between \"Brief Encounter\" and \"Apocalypse Now\". Its miles better than the dreadful \"The Mummy\" or the unspeakably bad \"Independence Day\".\n\nOkay, have a review. The plot is a shameless rip-off of Casablanca and makes no effort to hide it. It made me laugh, has some great dialogue, and is never actually slow. It's OBVIOUS that the cast and crew had a brilliant time making it, and that really shows on screen. Steve Railsback is brilliant, as is the uniformly excellent Udo Kier.\n\nAnd its got guns and 'splosions and Pam!"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "johnc2141",
        "review_rating": "7",
        "review_title": "don't call her babe!",
        "review_detailed_main": "OK the critics dismissed this,and many call this a cheesy bad movie,all the Pamela Anderson haters,but me i thought barb wire rocked. its a good action movie,i think Roger Corman would envy,and yes Pam Anderson does look like a busty Barbie doll.she looks great.her acting is'nt great but who cares.its an action film.that follows the plot of Casablanca,believe it or not.Pam plays a variation of the Bogie character.Canadian actor Steve Railsback plays a Nazi type officer who runs around shooting people along with his Nazi like henchmen.i saw this originally in 1996 and did'nt really like it that much,i had re watched it recently and changed my mind.i know barb wire is mentioned on all these bad movie lists but its really pretty good.not a classic but a good action movie nonetheless.props to Pam Anderson playing a real kick butt heroine.7 out of 1o,just don't call her babe."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "JamieWJackson",
        "review_rating": "4",
        "review_title": "bad, but sorta fun",
        "review_detailed_main": "First off, I'm not one who found Pam's looks particularly attractive; yes, the implants certainly command immediate attention, but she just isn't _that_ gorgeous, in my eyes. Still, I've always sorta liked her for some reason; she just seems like a nice girl -- which is odd since practically her whole life has been a demonstration in being exactly the opposite. So I don't really know why I have that impression, but I do. Anyway, this was my introduction to Xander Berkeley, who I saw in something else recently (but I don't think it was any of the films in his filmography, so if anybody can add something -- something recent, I think -- to it, please email me and satisfy my curiosity as to what it was!!), and he's good here as a cynical, amoral cop. I also liked the blind brother a little, and had some fun with the plot; although it isn't overly impressive, it does keep things moving.\n\nI give it 4/10. It kept me entertained, but the fat guy character was horribly done (bad scenes, hammy acting, terrible!!) and of course Pam's acting skills are fairly thin, which keeps this from having any chance of a high rating. Could have been somewhat better; not as terrible as a lot of the reviews here claim. If you want to know what a REALLY awful movie looks like, see \"Freddy Got Fingered\". This is miles ahead of that waste of celluloid."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Simon-57",
        "review_rating": "",
        "review_title": "Isn't this a bad rip off of Casablanca?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "torrascotia",
        "review_rating": "3",
        "review_title": "Boob-A-Blanca?",
        "review_detailed_main": "Barb Wire is yet another of the 90's movies which tried and failed to bring the comic book experience to the big screen. It fits within the group of movies such as Tankgirl, Johnny Mnemonic and Street Fighter which bombed at the box office despite the significant interest of the public.\n\nIts basically a Casablanca rip off with Pamela Anderson as the main character who is some kind of bar manager/bounty hunter. While the first third of the movie tries to paint her as being some uber sexy vixen that goes out the window when the goofy violence and bad acting kick into gear. After that she is just an anybody in a badly fitting leather suit and clumpy 90's boots. The movie actually manages to make Pamela look unattractive. If your asking how is this possible well it looks like they picked a rock music video director to helm the movie. And it shows. The whole thing has a made for TV action movie/rock video look. Lots of filters and funny overhead camera angles for no reason and a Saturday afternoon TV show budget look, everything looks so sparse. There is zero excitement despite plenty violence and explosions, there is also zero evidence of acting ability despite some very well known faces.\n\nThis movie also shows that Pamela simply isn't a good actress and was hired for her looks. Its just that on Baywatch it doesn't matter because there isn't really an demands on her character as she's simply another beach girl, but Barb Wire is an actual character which she simply fails to project. Her tough girl act comes across as a mix between bored and annoyed.\n\nThat said it is worth watching for the sake of seeing what was a big trend in 90's movies, that of the cyberpunk/post apocalyptic vibe and failed comic movie attempt. Its ironic that some lesser budget straight to video affairs did a much better job than this ever did, despite the cast and money involved."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "SKG-2",
        "review_rating": "3",
        "review_title": "Ed Wood Jr. would be proud",
        "review_detailed_main": "In an era of just plain bad movies like STRIPTEASE and too many others to mention, one should be grateful to this movie for at least being funny (albeit unintentionally so). I wonder how anyone could take a remake of CASABLANCA starring Pamela Anderson, the BAYWATCH \"babe\" herself, seriously enough to just denounce it as a terrible movie. I remember one critic said he was both appalled and intrigued, and that's the right attitude to have."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "JoeB131",
        "review_rating": "3",
        "review_title": "Here's looking at you, Jango!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "jean-schlage",
        "review_rating": "3",
        "review_title": "Casablanca with explosions",
        "review_detailed_main": "I only saw part of this movie coming in the middle no less. I may not have missed much. My twin sister Betty Ceniza in the Detroit area bought this thing and gave me the following \"critique\": Who in their right mind decided to make this movie! It is Casablanca with explosions...but without the romance as people keep falling over. However there are Pam's boobs. They are everywhere. This could have been a \"tits & a$$\" movie but there is just Pam's tits and nobody's ass. Very bizarre to say the least. Pam plays the Bogart role, Temuera Morrison plays the Ingrid Bergman Role and Victoria Winters plays the Paul Heinried role. There are also people playing the Sidney Greenstreet roe, the Claude Rains and Conrad Veidt roles. This isn't WW2 but a future America that has become two armed camps. The scientist Victoria Rowell knows some secret but Betty was so hypnotized by Pam's boobs she can't remember what it was. Pam literally follows them into the room. After lotsa explosions and everybody saying sh%t (their byword in this movie) the heroes prevail. Pam is very shapely and good in the actions scenes but she really cannot act. At least Tem Morrison and Victoria Rowell can act as both of them are soap opera veterans and managed to lend some believability to their roles. Although having just seen Star Wars Episode 2 it looked like Jango Fett married to Drucilla Winters of Y&R. How did they get talked into this? The DVD had a section of \"deleted sexy scenes\" but all you saw was Pam swinging upside down on a trapeze, boobs exposed with water hitting her for extra affect, maybe so she could stay conscious??? All in all a very bizarre movie but at least the action kept you somewhat interested."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "mat-mcnaughton-254-33257",
        "review_rating": "4",
        "review_title": "Well, it could've been worse.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "MrGrundle",
        "review_rating": "2",
        "review_title": "the audacity to rip off Casablanca...",
        "review_detailed_main": "Ouch.\n\nOne must wonder who's idea it was to have Pamela Anderson essentially play Rick from Casablanca in a Mad Max/Escape from New York futuristic wasteland.\n\nBoy, i wish i partook of the drugs that must have circulated through that room!\n\nAnyway, Pam does her best to channel Snake Plissken. Udo Kier is creepy and cool, as usual. The soundtrack leaves much to be desired, as does the horrendous editing. If only they had a few more real actors in the room, this one could have been a load of fun.\n\nOr maybe they could've gotten John Carpenter..."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Sci-Guy-2",
        "review_rating": "2",
        "review_title": "What have they done to Casablanca?",
        "review_detailed_main": "The horrible truth that this movie was a remake of Casablanca struck me about 10 minutes in. For the rest of the film, I was alternately laughing and crying at what the makers of this dog had perpetrated.\n\nAs a lover of parody, I must say I enjoyed watching this film once. Trying to match characters between the old classic and this \"piece of work\" was fun while it lasted, but just wasn't very difficult. This was a thinly veiled copy that is funny only because it took itself seriously."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "BrettC",
        "review_rating": "10",
        "review_title": "Call Me Babe and you get a shoe in the head!",
        "review_detailed_main": "Okay, yes this movie is a cheesey Casablanca rip-off and stars Pamela Anderson Lee and her two biggest assets. But give it a chance, and what you see is a great B movie that has some good action sequences and funny dialogue. For a movie to be camp it can't know it is bad, and this one thinks it is serious. You can see Pam trying to hold her own, and amazingly she does for the most part. I loved how she dipped down her voice, and delivered her lines earnestly. She was great! I think they need a sequel. Hell, I think she needs a series about this bounty hunter than her bodyguard service."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Turanic",
        "review_rating": "2",
        "review_title": "One of the worst",
        "review_detailed_main": "The reason I watched it was because Baywatch was at it's height and I never seen a film with Pamela Anderson before... Other than that, the film is plain bad , it's definitely one of the worst films I ever seen and I was a teenager when I watched it... What should you expect watching it ? Batman And Robin, Peter Jackson's Bad Taste, t.; Battlefield Earth. ; Highlander 2. Anyway, if you watch it, don't watch beyond the first 5 min, it ain't worth it..."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Mitaka",
        "review_rating": "",
        "review_title": "A great comic book...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "paul_haakonsen",
        "review_rating": "5",
        "review_title": "Cheesy action movie...",
        "review_detailed_main": "I remember watching \"Barb Wire\" back in the mid-1990s when the movie was just released. And frankly speaking, then I haven't watched it since. But as I stumbled upon the movie once again here in 2022, I opted to sit down and watch it for a second time.\n\nGranted, I wasn't really harboring much of any expectations to the movie, given the premise of the storyline and plot, and also because the movie was starring Pamela Anderson (Lee).\n\nWell, \"Barb Wire\" is a watchable movie. Its script and storyline isn't exactly rocket science by any means. Now, I haven't read the comic books, so I am not familiar with the character from that media, but writers Ilene Chaiken and Chuck Pfarrer managed to put together a cheesy enough storyline for the movie.\n\nWhile \"Barb Wire\" isn't exactly an outstanding movie or a cinematic gem, then it was actually a fun and cheesy watch. You just simply unhook your mind, lean back in the seat and munch on the snacks.\n\nI will say that the movie actually had a handful of recognizable and adequate actors and actresses on the cast list, with the likes of Udo Kier, Temuera Morrison, Jack Noseworthy, Tom Lister Jr. And Clint Howard. So there are definitely some familiar faces on the screen. Needless to go into details of speculations of why Pamela Anderson was in the leading role.\n\nAnd while speaking of Pamela Anderson, then the whole first scene with the spraying water and the dancing, seriously? Was something like that really necessary for the movie?\n\n\"Barb Wire\" is a movie that you will quickly forget about once you've seen it and a day or two passes. It is watchable enough for the cheesy movie that it is.\n\nMy rating of \"Barb Wire\" lands on a five out of ten stars."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "It's not the worst ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "simonechieppe",
        "review_rating": "5",
        "review_title": "Disapponting, but better than many Marvel movies...",
        "review_detailed_main": "It's easy to laugh at a failure: let's check why it happened instead... That movie was never intended to be a masterpiece, but a honest and camp entertainment. In those years, it was still normal to produce films with a low budget, so they did it: a star (remember, there weren't reality show then), a story (based on comics), and a production team (related to Polygram, I suppose) . What went wrong? First of all, it needed more money, for the locations, the costumes and everything you have to buy to put it in a movie. The director is a music clip director, so he lacked experience, and you can really tell! The script is not bad even if the screenwriter did better elsewhere. The cast is ok, Udo is great and Pamela played quite good (I mean... it isn't Shakespeare, but she works) . A great problem is sexyness: you have got a sexbomb but you can't pass certain limits; it is obviously a fatal error, you must dare sometimes, but the worst is that Pam is often not at all sexy, on the contrary almost ridiculous (like H. Berry in Catwoman, not like M. Pfeiffer in Batman returns). Think about how the director of X-Men \"loved\" and enhanced Mystica, can you see what I mean?! Besides, in those years music was still important in an action movie, but here it's boring and annoying (and very cheap). However, I still watch Barbwire, sometimes, because it isn't boring like a 400.000.000 dollars blockbuster for dummies and when you watch it you can think how it could be, on the contrary those big movies are (almost) always the same..."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "se7endaze",
        "review_rating": "3",
        "review_title": "Watching Pamela scale a barbed wire fence naked... would be more entertaining...",
        "review_detailed_main": "As the buxom blonde, who by day is the operator of the nightclub Hammerhead but by night takes to her Triumph motorcycle to hit the streets to perform dangerous black ops, Pamela Anderson-Lee creates a titular character that is all snarl and sneer, all leather and leather (no need for lace when your outer garments are your undergarments). Despite being outfitted in leather and spike heels, Anderson Lee doesn't make for an appealing action star -- the silicon enhancements might have screen presence, but the star doesn't. Okay, so she looks good on a motorcycle, but that's about it. Her delivery of the requisite quips is awful, and her signature line \"Don't call me babe!\" is much weaker than anything Eastwood or Swartzenegger might ever have uttered\u0085\n\nThe film makers undoubtedly recognized that they were making a bad film. Why else cast such an obviously-untalented actress in the lead role? What they seemed to be banking on is that Barb Wire would at least be fun, which it isn't. The element of high camp that makes for enjoyable \"good trash\" isn't present. Bad movies like this often generate small cult followings, and that's about the size of audience the picture deserves\u0085\n\nUnfortunately, other than a couple of very obvious, absurdly over-the-top scenes, this film is just plain boring. Aside from observing Pamela Anderson Lee's apparent assets, the only reason to stay awake during Barb Wire, is to admire what Tommy Lee did\u0085\n\nWatching Pamela scale a barbed wire fence naked would not only be more entertaining, but a lot less painful than sitting through this monotonous, very \"Rusty\" film"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "fully B",
        "review_detailed_main": "It's 2017 during the Second American Civil War. The \"Congressional Directorate\" had overthrown the American democracy. Steel Harbor is the last free city. Barb Wire (Pamela Anderson) runs a mercenary operation out of her nightclub.\n\nThis is safely in the unmitigated B-movie territories. At least, the filmmaker seems to be fully aware of its cartoon comics aspects. It doesn't pull back from it. It embraces the Nazi allusions and Anderson's exaggerated curves. In fact, her acting is half achieved by her two best assets. Sadly, she doesn't haven't much else to fill the screen with the rest. She should be trying to inject comedy no matter how cheesy it sounds. It can't really get much cheesier and that's not this movie's weakness. This movie is just not able to go full camp and Pamela is not a good enough actress. I would compare this to Johnny Mnemonic (1995) where Keanu Reeves is simply better. It's no contest. It eventually loses steam in the second half."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Boba_Fett1138",
        "review_rating": "4",
        "review_title": "B-movie with a capital B.",
        "review_detailed_main": "This movie has B-movie written all over it. It's has a typical B-movie action atmosphere, a silly story, stereotypical characters and a lot of B-actors.\n\nI'm not a Pamela Anderson hater, she is a real character. She was well casted and is perhaps one of the few reasons why this movie isn't a complete disaster. Further more the movie is filled with some well known, mostly B-actors, such as Xander Berkeley, Udo Kier and Clint Howard. Those three appear in just as many good well known movies, as silly ones, like this movie is. They make this movie a B-movie fan heaven.\n\nIt's mainly the story that makes this movie a bad one. The story is very uninteresting and most of the characters are very dull. The movie lacks a real main villain and because of this the movie also never becomes really tense. It was also weird to see the villains walk around in Nazi-looking like uniforms. It felt highly unnecessary and was just plain silly and unbelievable for the story.\n\nSome of the action in the movie is good but it's nothing memorable, just like the whole movie in general.\n\nOnly watchable and recommendable to fans of B-movies. For them this is a must see in a way, everyone should just skip this movie.\n\n4/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Maziun",
        "review_rating": "1",
        "review_title": "Hollywood should officially apologize for this",
        "review_detailed_main": "Well , at least when the movie came up . Now barely anyone remembers it . It's not strange since this \"magical\" movie had achieved 2 unusual things : a) the comic book series on which the movie was based died shortly after the movie premiere and b) the producers shortly after the premiere of this \"masterpiece\" OFFICIALLY announced that there won't be a sequel. Wow . I don't remember anything similar in my life . Even \"Batman and Robin' didn't killed the Batman comic books (yes , I know that is a MUCH stronger franchise than Barbwire franchise , but \"B&R\" did have THAT strength to kill anything associated with it). And today we live in an era where even \"Alvin and chipmunks\" have sequels.\n\nThe movie is based on a comic book I've never read or even heard of . Not that I regret it . Some comic books are hard to stand while you read them and perhaps even unadaptable (\"Spawn\" anyone ?). I believe this is a perfect example.\n\nI have a theory that from time to time Hollywood makes a movie that is such a compilation of everything bad in American cinema (style over substance , kitsch , stupidity , bad taste , cheap at heart) that it has a power of nuclear bomb which destroys everything in it's range . \"Barbwire\" isn't really a movie made with BAD TASTE , it's more like a movie made with NO TASTE .\n\nThe ideal symbol of no taste is the star of \"Barbwire\" itself – Pamela Anderson . There is a scene here where she walks down a corridor . You see her breasts first . Almost ONLY her breasts . You will have to wait a few seconds before the rest of Anderson's body (including her face) will show up . I mean seriously – those breasts are walking by themselves.\n\nI can't believe somebody so UGLY was considered to be a sex symbol of the 90's . Maybe people deep down are very primitive like caveman ? Sure , it's good when a woman has more big than small breasts , but not TOO BIG . Otherwise she becomes a parody of herself. Anyway , Anderson was considered sexy and someone thought that big boobs will be enough to make a good or at least commercially successful movie. If you're a fan of Anderson's body you will be probably happy . She wears tight clothes and you can see her boobs few times. As for her acting skills – well she's better than Steven Seagal , but that's hardly accomplishment.\n\nThe movie is pretty much a remake of \"Casablanca\" only set in post apocalyptic future. It's kinda interesting how you could take one of the best screenplays in the world and f*** everything that was perfect in the original movie. I guess that what you get when you replace Bogart with boobs. Visually this movie rips off \"Batman\" and \"Mad Max\". There is no interesting character and you couldn't care less what happens in the movie.\n\nA movie scene where half naked woman kills a guy with stiletto pretty much defines what this whole movie is all about. While watching a bad movie I often think \"A porn version of this movie would be much better\". Funny thing – I don't think that even as a porn movie \"Barbwire\" would be watchable.\n\nI give it 1/10."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "raidatlanta",
        "review_rating": "8",
        "review_title": "Just a good action movie",
        "review_detailed_main": "Firstly, I give 8/10 in regards to action movies. What do you want in an action film? Actors who act like they own the place, a plot that holds together, explosions, fight scenes, and if you can get some sexy stuff, then that's a plus. This movie has all of this.\n\nPeople say Pam doesn't act well in this? Do the same people give good grades to films with Steven Seagal or J. C. V. D? Let's be honest, I love Stalone and Schwarzennger, but we can't say Schwarzzy acts better in Terminator, Conan, or most of his movies.\n\nThe only reason why people criticized this film, and Pam's acting, is PURE SEXISM. People are willing to accept that Rambo can take on half the soviet army with only a bow and a handful of grenades in the afghan desert, but people aren't willing to accept that a gorgeous big breasted blonde would be able to tear them a new one, ride a motor cycle while shooting down 50 guys, and screw over the whole legal and criminal establishment.\n\nI think this is the only reason why this movie has such a bad mark on here, and why it was so badly received. Pure sexism. In 1996, people were not willing to accept a woman as an action movie star.\n\nBy all means, I found it more fun to watch than Predator. Half of predator was just watching big muscle men crawling in the jungle, acting all tough. Here you have stuff happening. Could there have been more gunfights? Hell yes. Could there have been more Pam kicking ass? By all means yes - you can't have enough Pam kicking ass. Does the ending get to be a bit cliché? Yes.\n\nI liked this movie more than the average action film, not just because I think Barb Wire is a great character, and Pam does her super well. I liked that this movie had ambiance. Filthy streets, crummy buildings; something between sci-fi and Film noir. Ambiance is very important for me when I watch a movie, and this one has it. Finally, YES, I did enjoy all the crude nudity, sexy lingerie, and so one - though I enjoyed all this while the movie set badass empowering female characters.\n\nI think there is still time to make a series of these - I would gladly watch the next ones in the movie theatres."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Red-Barracuda",
        "review_rating": "7",
        "review_title": "Wham! Bam! Thank you Pam!",
        "review_detailed_main": "To be perfectly honest with you, my appreciation of this movie is almost solely based on Pamela Anderson's breasts. I'm not going to waste your time and claim anything else. Take Pammy out of 'Barb Wire' and you are left with something highly mediocre. The story, action and other characters are simply by-the-numbers and I really cannot be bothered discussing them. It's Pamela's film pure and simple.\n\nIt wouldn't be over-stating it to say that I thought the opening credit sequence was quite good. Pamela in tight black leather, half out of her top being soaked by a hose? I would say there's four good ideas in there, all in one. Unfortunately, this is where the film peaks and we are only two minutes in. Sadly, a story kicks in at this point and spoils things. But seriously Ms Anderson is perfect for this flick. Her pneumatic figure couldn't be any better for the role she's playing. She is quite ridiculously sexy throughout the entire picture and the film frankly flags when she is not on screen. She is more than serviceable in this action role too. It's worth pointing out here that I am a big Russ Meyer fan and, therefore, it's perhaps no surprise that I have a huge weakness for dangerous, sexy, buxom women. The biggest compliment I can pay Pammy, therefore, is that on this showing she would not have looked out of place as one of the lead bad girls in 'Faster Pussycat! Kill! Kill!' High praise but quite frankly true.\n\nThe only criticism I can level at Pamela here is she doesn't get naked enough."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "jboothmillard",
        "review_rating": "2",
        "review_title": "Barb Wire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Bob_Bask",
        "review_rating": "",
        "review_title": "So this is Barb Wire...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "zico-7",
        "review_rating": "1",
        "review_title": "Historic bad movie",
        "review_detailed_main": "This movie is a perfect fit for Pamela Anderson. The acting, the story and all one can think of that has to do with making a movie is below the worst level possible. The \"good\" thing about that is that this level happens to be the level where Anderson usually performs, meaning that she was perfectly casted for this waste of time and money. I expected this to be a bad movie, but it exceeded my expectations. Anderson's performance is (I don't know how she manages it) sub par and seeing the-blind-guy-called-Charlie trying to act (being blind) made me realize that by watching Barb Wire I was watching a historic movie. One of the worst movies ever made! The movie kept reminding me of Madonna's \"Shanghai Surprise\". Ouch!\n\nHenry Bos, Holland"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "thesar-2",
        "review_rating": "4",
        "review_title": "Mad Maxine",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "johnnyboyz",
        "review_rating": "4",
        "review_title": "Depending on what turns you on, this could be either a porn film; a crappy action film or what Casablanca might have been like in leather.",
        "review_detailed_main": "Oh what fun to watch a film like Barb Wire; a film so bad, it's good as they say. But to say this is terrible and painful to watch would be untrue \u0096 it's bad but it's that B-Movie bad that keeps the film on that thin line between watchable and un-watchable. Barb Wire is a film that is so audacious in its ideas and settings that it has to set itself further into the future to compensate for its obscure nature and content. What I'm referring to is the corrupt government run country that is the USA since they're into their second civil war: \"It was the Second American Civil War and the world had gone to sh*t.\" says Barbara Kopetski (Anderson). Oh right, the 'world' has gone down the pan too has it? I shouldn't think anything was wrong with anything else elsewhere, love (or should that be 'babe'?)\n\nIn this world, the government officials wear Nazi-like uniforms complete with caps and cloaks; all the civilians apparently wear bondage gear and I think I even spied some of the customs officers early on using AK47 machine guns: a favoured gun/symbol of guerrilla and communist warfare. I was puzzled about the bondage gear: If Steel Harbour is the only free city left in America and people are walking around in clothing that signifies the pleasure of being restrained, then what are all the other 'un-free' cities like? I suppose they must be the sorts of places where murder is legal or something. Anyway, Barb Wire is a film that places itself in history. It's a story about a hard bodied female hero going mano-on-mano with other men in a violent nature. Reagan's term had ended; the cold war had finished: we didn't need any more anti communist Rambo films; we didn't need any more films like Rocky IV where hard bodied American and Russian men beat the hell out of each other and we didn't need anymore western supremacy in the form of muscle man Schwarzenegger kicking arse in his films of the 1980s. No; Barb Wire is about a woman, written BY a woman but generally comes off as a bit of a dud.\n\nThe actual idea for this film on paper is nothing more than a B-Movie action film wanting to get made. Its premise of a leather clad hero out 'kicking ass' and rounding up all the dregs whilst living in a sadomasochist's wet-dream is the general theme of the film \u0096 it's so watered down and one dimensional in its premise that it needs to rip off Casablanca to get across any sort of plot. Barb Wire is a series of scenes from the beginning up until the forty minute mark consisting of Barb seducing, fighting, cuffing and knocking out men dressed in gimp suits with over-sized paddles - OK, well that last example only happens once but it's still there. Once it seems there is an actual narrative to be told in Barb Wire, the film cools down a bit and relies on Barb to narrate what's going on and how she's feeling in true noir style; needless to say it's more funny than entertaining. I don't usual write or talk about acting in a film because it's not something I usually notice; plus who am I to slate someone's acting? If I tried what they're doing I'd probably be awful but Pamela Anderson in this film deserves a special mention. Her eyebrows, eyes and lips do her acting here as she quivers and flexes these parts of her face in a vain and painful attempt to get across some sort of mood or emotion as to what Barb is actually feeling. Along with this, she talks in a low and gruff manner than just oozes the sort of accent you'd probably get on a phone sex line.\n\nI know you cannot take a film like Barb Wire seriously but usually when I get this feeling, it's because the film has been aimed at a child audience. This film is anything but aimed for a child audience: Anderson struts around in a series of costumes; each one different as the settings change. There are extensive shots of her night club named 'Hammerhead' as Gothic bands and dancers hang out, have fights and dance. There is even room for some apparent squaddies dressed in their normal soldier gear to make an appearance but why they're there, I just don't know. While we are spared horrid, juvenile rock music that is being spurted out from the band (you'd think music would've evolved a little by 2017) for long enough; you cannot escape the obvious references to S&M as women walk around in corsets, boots up to their knees and wear sunglasses indoors. I was surprised there weren't a few scenes set in a makeshift dungeon inter-cut with these tracking shots. Maybe Barb could expand her business and set up some bondage facilities: might earn her some money on the side. After all, why would everyone where what they wear in public anyway? Incidentally, when one woman in being 'tortured' by the government very early on via electric shocks; she is moaning in sheer delight, not pain, at the activity.\n\nBut above all this, the film lets itself down on a technical level. The bad guy's target is right there in front of him and when the scanner fails, he lets them go despite up to this point checking everyone's I.D. card for good measure. He doesn't check these individual's cards because the film would've ended right there! The 'search' of Barb's club is also more of a ransack: ale kegs are shot to bits and shelves housing glasses are crashed to the floor: you never know, the missing thing could be there(!) The film's final fifteen minutes is pure garbage but what did you expect? For the fetishist inside you, this film is maybe fun \u0096 for everyone else, it's dross."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "three8s2013",
        "review_rating": "5",
        "review_title": "Post Apocalyptic Casablanca",
        "review_detailed_main": "Barb Wire' was a good movie. If a big studio backed it with a big budget it would have been well big. \"Rick's Café Américain\" it's not but the pieces for a good movie were there they just couldn't put them together. With all the reboots what about giving this a chance with a better script and a bigger budget."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "LuckyFour-LeafClover",
        "review_rating": "5",
        "review_title": "Mindless",
        "review_detailed_main": "When this movie came out some friends and I talked about ways of getting in the theater. We were old enough to appreciate it if you catch my drift but still not legally able to see it. One plan was to have the \"cool dad\" buy tickets for everyone and get us in. But it never happened. It really doesn't take a rocket scientist to understand the movies appeal to a group of teenage boys.......\n\nSo many years later I finally did watch it out of nostalgia for my younger days plus being able to look at it through a mature lens so to speak for the films plot. I mean I've read here this is something of a Casablanca remake but I still didn't follow the plot. Pam played a night club owner during a civil war named Barb Wire but I didn't picked up on much else. She also didn't like being called Babe.\n\nNot awful not great. Ultimately mindless entertainment."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "disdressed12",
        "review_rating": "3",
        "review_title": "\"don't call me babe\"...,",
        "review_detailed_main": "and don't watch this movie either,unless you're really desperate for something to do.but trust me,you could always find something better to do.i mean wow,this was not good.i managed to get to the forty four minute mark before giving up and shutting it down.there's just no coherent plot here,and no real acting of any kind involved.plus,the music was awful,although that's just personal preference.the opening scene sets the bar pretty low and it just gets worse from there.for some strange reason,Xander Berkeley(who's a quality actor)decided to appear in this mess.oh,well,everybody is entitled to a bad movie once in a while.anyway,for me, because it's not the worse movie i've seen,Barb Wire is a 3/10"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "johnnymacbest",
        "review_rating": "3",
        "review_title": "This film's worth watching for Pamela Anderson alone....",
        "review_detailed_main": "but the rest of the film is simply an afterthought. As a comic book fan, I picked this up out of curiosity despite the low reviews this movie has gotten. Having just finished watching it, I can honestly say this film plain sucks. There are some decent action scenes and acting it's just too bad that the film, despite being based on a comic book (that I really wanted to check out when I was a child) never really reached it's potential (well there was also the fact that comic book movies took a nosedive after Batman & Robin) and could've been a highly entertaining film. At least Pamela Anderson is worth the price of admission alone but for those of you who want a more in depth insight into the character, I suggest reading the comic book series instead.\n\nThis movie sucks but Pam's in it so what do I know?"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "I am so glad this movie was made!",
        "review_detailed_main": "The guys who read this title will know what I'm talking about in this movie, \"Barb Wire.\" Two words: Pamela Anderson. Yes, the same lady you might have seen on \"Baywatch.\" With her, and the endless, numerous, totally exciting action scenes in \"Barb Wire,\" this movie is the bomb! It's exciting! Breathless! Great! Makes even the shyest guy put a huge smile on his face! The next time you have a free night, then buy this DVD, get some snackage, and invite all the guys over to watch this movie! Seriously! Then afterwards, you can watch some football or basketball and watch some dancing action after that! (Hint, hint! ;-) ) An 11 on a scale of 1 to 10 action movie! Watch it today!"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "7",
        "review_title": "A thoroughly entertaining movie",
        "review_detailed_main": "I know a lot of people hate this, but I personally think they're missing the point; It's not supposed to be taken seriously, it's just for fun. I almost rolled around on the floor laughing at times, due to the sheer stupidity of several scenes. It's so bad that it's good. It's so 'B-movie-like' that you can't possibly take it serious. A lot of people are saying the story is a rip-off of Casablanca. I don't know if that's true, since I haven't seen Casablanca, but I'll take your word for it. I didn't expect it to be an original story. In fact, I didn't expect more of the movie than to see Pamela Anderson naked. That was the primary reason I bought it, no reason to deny that. But the movie was just so entertaining, in every scene there was something so ridiculous that you couldn't help laughing at it. And that's the point. Don't sit down and analyze this movie, save that for intelligent movies. I knew from the very first scene, that this wasn't going to be intelligent, or great, or whatever. But it was fun to watch, and it does have a plot, and scenes that go together to create a meaning, which is more than what could be said about several new movies(Scary movie 2, just to name one). I didn't, for one single scene, find it to be boring, slow or just the least bit intelligent. And that's exactly what it was made to be. Entertainment. Nothing more.\n\nAs an added bonus, it has some great parodies on Bond and Batman movies. You should definitely watch it, if you're into B movies(normally I'm not, but this was just too good to miss.) 7/10"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "BA_Harrison",
        "review_rating": "3",
        "review_title": "Here's looking at you, Pammy!",
        "review_detailed_main": "The year is 2017 and the USA is in the middle of a second civil war. Top-heavy bar-owner Barb Wire lives in the country's only free city, supplementing her income as a mercenary/bounty hunter. When an old flame, freedom fighter Axel (Temuera Morrison), re-enters her life seeking assistance to help a wanted scientist escape to Canada, Barb is reluctant to get involved, but after her blind brother is killed by the Congressionals, she finds herself once again joining the cause.\n\nWith her ridiculously large chest, tiny waist, massive pout and cascading peroxide blonde locks, 90s sex-symbol Pamela Anderson certainly looks the part, but that's about the only good thing I can bring myself to say about this otherwise miserable mid-90s movie adaptation of Dark Horse comic-book character Barb Wire.\n\nClearly never intended to be anything other than a vehicle to exploit the former Baywatch star's plastic sex appeal, the film is a poorly scripted piece of near-futuristic drivel, a post-apocalyptic Casablanca (complete with thinly veiled Nazis!) that deals in well-worn clichés and keeps costs to an absolute minimum by filming exclusively in derelict warehouses, junkyards and dock-lands. David Hogan's direction is uninspired, the 'drama' falls flat (unsurprisingly), and the action, when it eventually happens, is explosive but unexciting, the outcome a long foregone conclusion."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "andrew-traynor1",
        "review_rating": "",
        "review_title": "Oh, for heaven's sake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "djensen1",
        "review_rating": "4",
        "review_title": "Plodding dystopian fluff",
        "review_detailed_main": "Barb Wire looks good. Most of the important roles are acted competently, and its star is luminous. In the hands of someone like Paul Verhoeven, it could have been another Total Recall--silly fun that might have balanced Verhoeven's usual violence with a little T&A.\n\nInstead, the story plods along in drawn-out sequences that drain the life out of what little fun was written into the screenplay or available from the stylish sets and lighting. The kinky prostitution scam, for example, is a grueling, humorless 3+ minute setup for a lackluster action scene that is followed by a grueling, humorless payoff scene that's just as long.\n\nWorse, whole scenes are completely superfluous. The scenes where Axel and Cora get into the city are unnecessary and unexciting. The drunk who is taken care of by Camille is both valueless to the plot and totally unfunny. It's odd that the story was lifted almost entirely from Casablanca and then flubbed so badly by adding such dull scenes."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Floated2",
        "review_rating": "1",
        "review_title": "Terribly bland and plain boring",
        "review_detailed_main": "Starring Pamela Anderson at around her peak of popularity. The plot of this film isn't original and truly lacks any real entertainment. It was seemingly marketed as an erotic thriller but is more of a dystopian futuristic action sci-fi. The main attraction of course is Anderson sporting the black futuristic cat suit like outfit.\n\nOverall, the dialogue is extremely cheesy with the delivery by Anderson where it's not convincing and plays off more comical than to be taken serious. The cheesy one liners such as \"Don't call me babe\" and the very ending close off \"get in line\". Parts of the plot is rather confusing where it's simply bland and just boring to watch. The action is very generic, there is no suspense or mystique and everything is predictable."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Flak_Magnet",
        "review_rating": "3",
        "review_title": "A Meatsack Classic",
        "review_detailed_main": "In the Special Features of the \"Barb Wire\" DVD is a 9-min, music video-style striptease sequence where Pam struts her stuff, largely topless, while riding a swing and being sprayed down by water cannons. It is pretty hot and definitely the best thing about the movie. If you want to see Pam Anderson topless, at probably the freshest point of her silicone bubblieness, this movie is probably as good as it gets. The rest of the picture, well, it is an incoherent meltdown and plays out similarly to \"Battlefield Earth\" and \"Batman & Robin.\" Expect a lot of inane character development, a ludicrous story, baffling scene direction; completely subpar action sequences, and unconvincing acting. Unlike the aforementioned films, though, you get to see Pam Anderson run around in leather corsets, bikini tops, and Go-Go boots, which does add a certain something. There are a few topless scenes, but nothing as good as the music video. Lastly, this movie has more anachronisms than I have ever seen; it is just unbelievable. Almost every scene will have you saying something like \"um...the cops drive 1986 Crown Victorias....in 2017?\" Anyway, this movie is going to have limited appeal. It wasn't funny or even all that entertaining, but that music video is worth something. ---|--- Reviews by Flak Magnet"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "bobgreenwade-369-913376",
        "review_rating": "3",
        "review_title": "Spoiled Cheese",
        "review_detailed_main": "I was bored one evening, and hunted through the movies available for free on Comcast On Demand. One was this film, which had intrigued me a bit when it was on originally.\n\nIt was just barely interesting enough to keep me watching until the end.\n\nYes, as has been said many times, the story is lifted almost directly from Casablanca, and otherwise adjusted to fit the characters from the Dark Horse comic. Many reviewers at the time of the film's release saw it as a ripoff, but to me it read more like an homage.\n\nThis was pretty much the extent to which director David Hogan made good decisions in this. Lighting apparently meant to be moody ended up only muddling the action. The sound mixing was awful (at least, for TV), and much of Pamela Anderson's dialogue was unintelligible. Any opportunity to flash Pam's breasts was seized upon.\n\nAt that, the writing is pretty weak too. Maybe it was because of the sound problem, but I was twenty minutes into the film before I was sure that the plot had actually started. How the writers did an homage to \"Casablanca\" while keeping the plot so paper-thin is amazing.\n\nAlso, most of the acting seems quite mechanical. Pam was highly criticized over this at the time, but I've seen better from her. For that matter, Victoria Rowell seemed quite one-note as well, and I know she has some serious acting chops from her years on \"Diagnosis Murder.\" Thus, I suspect that the problem was not in the performers but in the director and the script. Only Jack Noseworthy (Charlie), Jennifer Bank (Spike), and to a lesser extent Clint Howard (Schmitz) deliver really good performances.\n\nI do give high marks to the stunt department of this film, though; the fight scenes were for the most part nicely choreographed and well performed. Some of the action late in the film failed to deliver in that regard, but that seemed more an editing problem than anything the stunt people would have had to do with.\n\nThe soundtrack, though not generally my preferred style of music, was also well done and fit the setting and action appropriately.\n\nOverall I'd say this movie is worth seeing -- once and only once, provided you aren't actually paying any money for it that you aren't already spending."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Jemae",
        "review_rating": "4",
        "review_title": "Huh...",
        "review_detailed_main": "I was nice enough to give this a 4. The whole time I watched this film I was thinking, huh. It was a boring film! I also kinda felt it would be better if Barb covered her chest a little more.\n\nI understood where they tried to take the film, the plot kinda made sense but they failed horribly at showing that story. If you're bored enough, you can watch it. Yeah there's not much more I can say...."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "miketurner-16015",
        "review_rating": "9",
        "review_title": "I despise mean and cruel people",
        "review_detailed_main": "Ok......its not Shakespeare and pam is not Meryl Streep.....but who cares!!!!! Pam takes us on one helluva ride..... she makes The role absolutely hers taste control make us laugh make us cry make us wonder in most of all makes sure we have a great time.... Pam is incredibly beautiful and fun.....\n\nWhat did you fools expect ????"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Matt_Layden",
        "review_rating": "6",
        "review_title": "I would have loved this if I saw it when it first came out.",
        "review_detailed_main": "A sort of remake of Casablanca set in the future and in a strip club? Pam Anderson is Barb Wire and she must help someone get on a plane to Canada, with contact lenses. Whatever else the plot is, do people really care?\n\nThis film was made, marketing and watched because of one thing and one thing only, Pamela Anderson. This was her naked sci/fi Hollywood film, the opening of the movie shows her stripping, showing her breasts and getting hit with water. Ooooh, so sexy. This was probably the one scene many kids watched over and over. The film itself is regarded as one of those, it's so bad it's good. I can totally see that and once I got pass Anderson's wooden acting, I actually enjoyed myself. Guilty as charged.\n\nI said I would have loved this when it first came out. I say that because I was around 10 years old and a film like this, that is drenched in so called \"sexiness\" would have been imprinted on my mind. Seeing it for the first time in full when I'm 22, went to film school and have been on the internet since I was whatever age, the film doesn't strike me as sexy. Anderson does look good though and seeing her prance around in tight leather doesn't hurt either. Much better than what Halle Berry tried to do with Catwoman.\n\nAnderson became famous for her breasts and that was the focus of the film. Every other shot is of her massive cleavage. Am I complaining? Not really. But we have porno for that, the catch is that Anderson is someone \"somewhat\" famous. There is a special feature on the DVD called SEXY OUTTAKES. This is ten minutes long and it is of her stripping with the water. Basically the entire opening, but for ten minutes.\n\nJango Fett from the Star Wars prequels is in this film, I found myself saying \"Hey it's that guy\" a lot every time a character came on screen. The film is campy, what else do I need to say? The acting is campy, the script is god-awful and taken from Casablanca, the nudity isn't even that good. I expected more, the film feels like a tease.\n\nBarb Wire is like Showgirls. Made to appeal to the perverted crowd, only this one has explosions. I'm giving this one a high rating, for it's campiness feel. It's trash, but golden trash."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "ricklb-43546",
        "review_rating": "10",
        "review_title": "I'm putting 10 because I'm balancing out you mean reviews!",
        "review_detailed_main": "First off this movie is underrated, and before all the CGI generation stuff, it's an okay movie, no it's not a 10 but I had to after everyone's worst movie ever crap. It's not the worst movie, either that or you've only seen a couple movies. Are you kidding me after \"call me by your name\" and \"50 shades of grey\" have higher reviews, whatever! It's a niche cheesy noir film with nice action scenes, the dialogue is a bit off and cheesy, but she looks so darn good! Pamela's acting was spot on for this type of role. I thought she was great! It's a fantasy genre, it's not believable or accurate, so relax and take in the silly story, and a beautiful blonde chic in a leather corset!"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "jok-719-924842",
        "review_rating": "7",
        "review_title": "average 90's dystopian sci-fi action",
        "review_detailed_main": "Starts off looking like a softcore porn flick, but there is a true-to-form 90's dystopian sci-fi action movie in there. (Most of the mild nudity in the movie happens during the ridiculously long striptease scene in the intro.)\n\nI felt it was no worse than any run of the mill sci-fi with A-list actors of the era. There is a coherent plot, sets are well done, and clearly some money put into the action scenes and explosions. While the performance of the actors surely isn't oscar worthy, I wouldn't classify this movie as \"so bad it is good\", but rather a watchable sci-fi romp from the 90's, and the current imdb rating of 3.5 stars does not reflect that.\n\nTemuera Morrison does a solid early role, and there are some enjoyable side characters."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "marydm-43470",
        "review_rating": "10",
        "review_title": "Utter Gem",
        "review_detailed_main": "This is a brilliant piece of cinema. It is self-deprecating and fully conscious of itself as a parody of so many genres and so many tropes. Anyone who reads this movie literally is a cinematic naif. Pam is scintillating. All those \"critics\" focusing on her physical attributes come across as horny and clueless teenagers looking forward to their next wet dream. Please, do bother to look at her face and eyes for a minute. Pam oozes intelligence and wit, smashing to smithereens cliches of bimbos and dumb blondes. There's no rule that says sexy women must be brainless. Pam, you're one of a kind, the way you choose to live your life says oodles about your natural intelligence and integrity. Wish you had done more cinema. Dumb Hollywood. Love gorgeous Temuera Morrison. But I don't see anyone calling him a male bimbo because if his looks."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "yichihyon",
        "review_rating": "7",
        "review_title": "Attack on male dominant fascist society",
        "review_detailed_main": "I think Barb Wire is great for a heroine trying to survive in a society where women are being imprisoned in a fascist male dominant society, thus the cage and barb wire motif. She kicks ass and likes it when men are hard after she beats the crap out of them. Don't call me babe! She is not your baby, she is the new feminist woman and deserves respect. The alpha female will kill you without pity for not looking at her with new eyes. The blind, the eye, and the new vision motif is important, thus the contact lenses, eye retinal identification, and a friend who is blind after the war with the facists is important but not fully realized in the film. I want to see Barb Wire 2!!! Please!!!"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "gfarasheva",
        "review_rating": "8",
        "review_title": "Not bad at all",
        "review_detailed_main": "This movie is so underrated! It's not like Pamela is the best actress, but she's not bad either, and I know a lot of bad actresses who have found success so I don't get it why Hollywood didn't give her a chance! I like that she's using her deeper voice as it's a serious role, and the plot was interesting as I like cyber-gothic action-thrillers, and her outfits were all amazing, especially for the time! Definitely not a 3, it's more like a 6-7 stars but giving 8 to increase the overall rating."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Coventry",
        "review_rating": "6",
        "review_title": "Silicone Camp DeLuxe!",
        "review_detailed_main": "What's the matter? People don't have a sense of humorous camp anymore? I don't understand why \"Barb Wire\" is generally regarded as one of the world's worst movies ever made, whereas it's honestly not any worse than the vast majority of cheesy and violent post-apocalyptic Sci-Fi flicks from the late 70's/early 80's. Well, perhaps it's slightly worse than those, but at least the defects are widely compensated by the totally unpretentious atmosphere and the light-headed approach of everyone involved in the production, including Pam Anderson herself. Nobody who cooperated on \"Barb Wire\" seemed to take the film overly serious, so why should we? In fact, the concept is even quite unique and courageous! Who would ever dare to do a futuristic remake of \"Casablanca\" and replace the talented Humphrey Bogart with a busty blond bimbo, the cherubic Ingrid Bergman with a beefcake Maori rebel warrior and the legendary Rick's Café with a sleazy bar called The Hammerhead? It's a trashy, campy, sleazy, grotesque and incredibly flamboyant Sci-Fi story timed in the year 2017, in a society spoiled by the Second Civil War and a city dominated by mayhem, corruption and resistance. Barb Wire owns the successful bar, but makes even more money with her side jobs as rough bounty hunter and hired assassin. She leads a good life until her former resistance-lover shows up with a fugitive scientist who needs a special pair of contact lenses in order to flee to Canada. Barb always remained neutral in political matters (following her example Rick in \"Casablanca\"), but it looks as if she'll have to get involved now. \"Barb Wire\" may be bad, but at the same time it's fantastically entertaining, with horrible dialogs and one-liners (\"Don't call me babe!\"), hideous wasteland sets, explosive action sequences and extravagant costume designs. Mrs. Anderson herself continuously exhibits revealing leather outfits and sexy stilettos while her opponents the Congressionals harness Nazi-like uniforms. The relatively unknown director David Hogan even managed to gather an impressive selection of B-actors to fill up his supportive cast, like Steve Railsbeck, Xander Berkeley, Clint Howard and even Udo Kier. So, seriously, what's the problem here? \"Barb Wire\" surely isn't as worthless as it looks or everyone claims it is. Try to interpret it as a throwback to traditional post-apocalyptic cinema mixed with excessively violent modern day comic book adaptations and you'll definitely find some enjoyment."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "jjbeyonce",
        "review_rating": "10",
        "review_title": "PERFECTA!!",
        "review_detailed_main": "Una MARAVILLA de película y PAMELA ANDERSON en su MAGNIFICO ESPLENDOR!!!! Una película de culto,pese a quien pese y punto......................................................................................................................................................................................."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "robinhio84_",
        "review_rating": "6",
        "review_title": "This movie was to see Pamela running around",
        "review_detailed_main": "Pamela is running around in a hot outfit. What's not the like?\n\nHair looks good, make up is hot and the leather is tight. It's a home-run.\n\nWhat else can we judge it on, did anyone actually expect a plot and story? And yes there is some action, some real action here."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "byron316",
        "review_rating": "10",
        "review_title": "Top fun",
        "review_detailed_main": "This movie is not bad its actually very cool. The plot is not what this movie is all about but Pam's lovely body and outfits. She looks sexy in everything she is in and fans have been able to enjoy her in her recent FHM, Loaded, ICE, Maxim shoots here in the UK and US. In this film however its pam heaven as the title credits is a very sexy strip show in which she is hosed down in her hot black leather number. Get this on DVD get the unrated version as the title sequence is longer and the disk has the full ten minute strip in an outtake. This is a film that is not for people looking for realism or something heavy and moving its for men or women if that floats your boat who like to admire the hottest woman on Earth everyone else need not apply and should get something else."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "poolandrews",
        "review_rating": "6",
        "review_title": "\"That wasn't part of the deal big fatso!\" The best opening sequence in cinematic history.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Nylistic",
        "review_rating": "10",
        "review_title": "Comic book cheese brought to life",
        "review_detailed_main": "The comic book genre of overtly sexy female heroes probably hit its peak in the 90s so it's fitting that this movie was released at that time. For that focus, this movie is really the best of its kind.\n\nWatching this during the rampant political correctness of 2021 makes me wonder if we'll ever see a movie like this again, which is really a shame considering how much fun it is. If you enjoy watching a super hot chick kick ass while showing off her assets in skimpy leather outfits, this is the movie for you.\n\nPamela Anderson's acting is perfect for this type of role and it doesn't hurt that at her peak she was one of the hottest women that's ever lived. The rest of the cast plays into the cheesy 90s action aesthetic perfectly although the movie is at it's weakest when Pam isn't on screen, which thankfully isn't much.\n\nThe story and dialogue read like an issue of a comic you would have picked up because of the sexy seductress on the cover but actually better if you know how bad those often are. The cheesy dialogue and amusing quips against the dark post apocalyptic setting show that the filmmakers clearly have their tongues firmly in cheek and are having fun with it. It's well shot with nice action scenes and no CGI to be found.\n\nAs much as I love Casablanca, this low brow B-movie is also one of my favorites in it's own right. Your milage will vary based on how much you like comic book camp and Pammy."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "DJ FILMS",
        "review_rating": "6",
        "review_title": "Could have been awesome.",
        "review_detailed_main": "Pamela Anderson is (despite all the critical damnation) really good in her role as tough-talking Barb Wire. I find fault in the film not through her performance, but through the incredibly lame dialogue they make her say. Throughout the film she utters silly comments that are not necessary, and instead of making Barb look like a real Femme Fatale, it makes her look like a violent tramp with bad PMS, but I think given the right script and some more plot twists, this film could have been hailed as the best \"Chix with Guns\" flick of the 1990s. Pamela really shines through the drivel. Barb Wire may not be great stuff, but it's definetly not the disaster so many people have said it is. I for one am hanging out for a sequel."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "sandcrab722",
        "review_rating": "10",
        "review_title": "Dwelling In Misapprehension",
        "review_detailed_main": "*The* undiscovered *masterpiece* of American cinema hiding in plain sight for 26 years.\n\nIt's Mad Max. It's Casablanca. It's Austin Powers. Lara Croft and Batman rolled into one.\n\nIt's Die Hard, but funny as hell. It's Johnny English but sexy as hell. It's Tom Cruise, but without the painful dorkiness.\n\nI was really dreading watching this. My expectations were rock bottom. But OMG, this is the best film ever made.\n\n(The one itty-bitty, but tragic error was in marketing. Chose wrong genre. If they had billed it as comedy/parody it would have won Oscars.)"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "moviewizguy",
        "review_rating": "6",
        "review_title": "The Buxom Blonde Kicks Ass!",
        "review_detailed_main": "21st century. USA. The second civil war. The whole country is in a state of emergency. What was formerly called the American Congress now rules with fascistic methods. There is only one free city left, Steel Harbor, headquarter for the resistance. This is the hometown of Barb Wire, owner of the night club Hammerhead. As times aren't good, Barb has a second job. She's a bounty hunter and you probably wouldn't want her after you. Barb's credo is to never take sides for anybody and that's the only way to survive these days. As her former lover Axel Hood appears asking for a favor, Barb suddenly finds herself to be key player on high political stage. Now she has to take sides.\n\nI really didn't want to watch this film. I thought it would be all sex and nudity but I gave it a try and I was surprised. I actually liked it! First, without the bashing, let me give you some reasons: Barb Wire is a unique, kick ass character. I loved her! The one liners are extremely cheesy that it makes you smile. And this picture has a lot of work put into it like any other great film ever made.\n\nI like the whole look of the film. It's (obviously) exotic for the hormone raging male teenagers to love and the apocalyptic look is very good and realistic. You got to give these guys some credit. The action sequences were surprisingly decent, although there aren't many in this film as I thought there will be.\n\nThe character Pamela Anderson makes out is fantastic, but at the same time, it's kind of dull. Temuera Morrison gives a good performance as well as Victoria Rowell. I like that the last 15 minutes of the film has non-stop action. I love the explosions and fighting sequences.\n\nMaybe the reason I like the film is that this film knows it is being bad, but it has a fun time with it. Yes, there are gaping plot holes and it's preposterous but it doesn't matter. I really didn't care.\n\nOf course, this isn't going to be a very good film but it isn't a bad one either. It's surprisingly satisfying and the lines are cheesy that it puts a smile to your face. If you would like to watch a film with some good action sequences and a lot of exotic scenes (including nudity), you'll like this film. Even hormone-raging male teens will like this."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "stefan-12635",
        "review_rating": "9",
        "review_title": "I cannot understand the bad reviews at all!",
        "review_detailed_main": "The comic-like, exaggerated implementation makes sense for a film based on an equally exaggerated comic series. And isn't Ms. Anderson the ideal casting for the comic character Barb Wire? I also don't think it's blasphemy that the film is basically a Casablanca remake in a post-apocalyptic science fiction setting. We already had Barbarella, which received a much better rating, although the special effects there seem much cheaper, the actors act more woodenly and the plot is thinner than here. I really liked the implementation of the post-apocalyptic setting. The cinematography scores with unusual angles and perfectly composed images. I only noticed continuity errors and exposed stuntmen once, which can happen even in cinematic masterpieces. How can it be that the film is on the list of the 100 worst films of all time? There are plenty of more worthy candidates."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "pmtelefon",
        "review_rating": "6",
        "review_title": "A near miss",
        "review_detailed_main": "Pamela Anderson is unbelievably dreamy in \"Barb Wire\". It's impossible to take your eyes off her. She is not the problem with the movie. The problem is that the movie is too plot heavy. There's too much story. On the plus side, the stunt work, especially at the end, is very good. With anyone else in the lead, \"Barb Wire\" probably wouldn't be that good. With Pamela Anderson, it makes for a pretty good evening."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "penuss",
        "review_rating": "10",
        "review_title": "Nice",
        "review_detailed_main": "I watched it again, and I still liked it. I know it isn't the most fun or awesome film, and I would probably share another movie with a friend instead of this one. However, I really like this movie and I got into reading Dark Horse comics because of it."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Honesticedragon69",
        "review_rating": "6",
        "review_title": "I Don't Fully Hate It At Least.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "ratisha-belush",
        "review_rating": "10",
        "review_title": "perfect for what it is",
        "review_detailed_main": "If your looking for high brow, artsy and/or packed with deep meaning then go watch something like '12 years a slave' but if you want some silly fun with a beautiful woman then 'Barb Wire' is perfect.\n\nThis is for the people that like cheesy and fun, like Con Air or Batman and Robin - so if those films tickle your film bone then give this one a watch."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "kenstallings-65346",
        "review_rating": "6",
        "review_title": "Better than expected",
        "review_detailed_main": "The sad truth is that this movie suffers from the cultural persona of the star actor, Pamela Anderson. Script wise is an average sci-fi action movie, with many lacking in comparison rated higher.\n\nIf any other woman played the lead role, this movie would have been taken far more seriously. The sad thing is that Anderson can act. It's not Academy Award material acting, but it's better than average fare. The scene with her dog dragging a drunk out of her business is well performed and a very humorous and witty narrative. It adds new meaning to the phrase, \"Roll over, Spot!\"\n\nUnfortunately, few have the courage to rate the movie on its objective merits and instead play a two-faced game of rating the actor's real life vice the movie performance.\n\nThe plot is quite interesting, and given where the world appears headed right now, with a rise in authoritarianism, scripting these events to play out between 2017 to 2019 has a downright nervous tension to it.\n\nThere are great many plot twists, and the acting plays out the narrative effectively. That said, the movie isn't intended to be taken seriously. It's a full on popcorn epic, with a fair amount of cheesecake thrown in.\n\nTruth be told, if we're to be honest with ourselves, whether the star actor posed a half dozen times in a men's magazine shouldn't factor in to how we evaluate a movie. If we believe in people choosing the life they live, then we have to embrace those decisions with an open mind, or else we're just two-faced charlatans.\n\nSo, take the advice to lighten up and watch the movie expecting some brief entertainment. With that in mind, the result will satisfy."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "auror",
        "review_rating": "10",
        "review_title": "Ditto",
        "review_detailed_main": "I couldn't put it better than Richard Cat. Sheer lighthearted entertainment to while away the hours with a smile. Great spoof. Honest to goodness fun. References hark back to Barbarella, Max Max, Blade Runner, The Matrix in kaleidoscope.\n\nFirst class camera play. Slick choreography, decor to match. There's humour in Anderson's send up of classic erotica. Fine directorship.\n\nIt is an awkward logic that nominated the production for various \"worst\" awards (MTV), somehow one would not expect the industry to be capable of laughing at itself.\n\nQuestion: Could such a film ever have passed censor post 911? Anyone recommending more in this vein does IMDb surfers a favour."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "rrempel",
        "review_rating": "6",
        "review_title": "Not as bad as everyone says...",
        "review_detailed_main": "Not great art, but OK rental entertainment. Imagine \"Mad Max\" if the lead actor/actress wasn't all that talented ... a comic book story with some disjointed editing. Like \"The Destroyer\", or \"Captain America\" in quality and style, with a much better looking star."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "gastonmartinalvarez",
        "review_rating": "9",
        "review_title": "Deserve more",
        "review_detailed_main": "The movie is what one expects when watch the poster. An action movie with a sexualized super hero. The movie is very entertaining and was a victim of the events that happened in Pamela's life between 1995 and 1996."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "interceptor_nl",
        "review_rating": "6",
        "review_title": "Not that bad as you would think",
        "review_detailed_main": "It has been.a while since I watched this movie. But after the bad reviews I watched it and it wasn't that bad. I thought it was pretty entertaining to watch and isn't that what it is all about. Pamela isn't that bad she plays the part of Barb pretty well, it was not fair to hammer her down. It's an action movie with funny one liners and the story was fine."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "jamesmcconnon",
        "review_rating": "8",
        "review_title": "Play it again Pam",
        "review_detailed_main": "Had to rewatch Barb Wire after the recent Pamala Anderson documentary. And have to say its probably one of the best remakes ever, even if it strays a bit from the original Casablanca.\n\nTrue. Pammy is not as good an actor as Bogart, and she doesn't have anything like the same chemistry with Bobba Fett that he had with Ingrid Bergmann.\n\nIt's also true that the dialogue isn't quite as (mis)quotable. Don't call me babe isn't really up there with I think this might be the start of a beautiful friendship.\n\nAnd I have to admit, that even allowing for a good cover of dancing barefoot, it didn't have any songs up up there with \"As Time Goes By\".\n\nIt's also true that the guy playing the Peter Lorre character is doing a bad impression of the original so obvious you'd believe he thought himself to be in a cheap knock off of a much better film.\n\nBut look what it gets right.\n\nIt's way ahead of its time with all the gender and race swapping.\n\nIn predicting the second American Civil war would happen in 2017, it was only 6 or 7 years out (we'll find out soon enough)\n\nBut most importantly, it has Pamela Anderson in wet PVC. In the opening credits.\n\nGreat movie.\n\nPlay it again, Pam."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "trashgang",
        "review_rating": "6",
        "review_title": "was made at a bad time",
        "review_detailed_main": "15 years after it was made I finally bought this flick and even on Blu Ray, cheap of course. This is one of those flicks that always have got some bad reviews. I can't say anything about the script because I haven't seen the comic. But if I just have a look at the names appearing then you know that this isn't going to be a blockbuster. We have Udo Kier and Steven Railsback in it, for those into horror or exploitation those names are famous. And when I saw the name Rick Bota then I immediately must think of him being directing 3 Hellraisers. The story itself is post-apocalyptic so with those actors and the story we could add it into the grindhouse genre even as it wasn't attempt to be.\n\nNaturally the main lead was by Pamela Anderson Lee. Back then she was very hot on all aspects. Just made some nudity shots and a porn flick with her husband and of course Baywatch did the producers add her on the wanted list. But face it, she only in it as a teaser. Every time you see her, the most important things are her fake two penny worth breasts. I even has seen the unrated version and indeed, she goes naked now and then only showing tits and nipples.\n\nDid I enjoy it? Just looking towards the story and the actors and the gratuitous nudity I liked it and if it would have been made 20 years earlier or even nowadays (remember Bitch Slap also just made for the boys to watch girlies shooting around and posing) it could have been a bigger success. Naturally it was teared down due Pamela's performance. But Steve did good work as did the rest. But be honest, most flicks based on comics failed to deliver."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "carmelolia",
        "review_rating": "8",
        "review_title": "Why I liked this film for 2 Big Reasons",
        "review_detailed_main": "I really do not understand why this film is only rated 3.5/10 (as of 30/07/2024). The users and reviewers here on IMDB do not seem to like attractive buxom ladies for some reason. Even the plot was better than expected. It's not Shakespeare but anyone expecting so from a film with a scantily clad Pamela Anderson on the poster is the world's biggest idiot and it appears that there are a lot of them nowadays.\n\nSo, to get back to my my two big reasons why I liked this film (no pun intended). One of them is the concept. It has been described as \"A dystopic remake of 'Casablanca' with Pamela Anderson\" by one IMDB reviewer. I felt that the plot with its basis in sci-fi was ambitious even if nothing special. It is more than one would expect. The writers could easily have opted for a story which is more mundane, so to speak. The second reason is that this is a film which never forgets who its target audience is. It does not try to be something it is not. And I respect that.\n\nI happen to like attractive buxom ladies and entertaining sci-fi films. So this was an easy 8/10 for me."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Tweekums",
        "review_rating": "7",
        "review_title": "A trashy, dystopian take on 'Casablanca'",
        "review_detailed_main": "Set in 2017, at the time of making still twenty one years into the future, takes place after the United States has been ravaged by a second civil war. A fascist regime has taken over with only one city remaining free. Here there is little in the way of law and order. Bounty hunter Barb Wire, takes on various jobs when she isn't busy running her club, The Hammerhead. One day her former lover and his new wife turn up; she has evidence, and a cure, to the regime's war crimes but can't get it to Canada. To get there she must acquire a special pair of contact lenses that will enable her to pass the retinal scanners... will they be able to persuade Barb to take a side for once and get her out?\n\nFrom the opening scene it becomes clear that this is going to be trashy and cliché riddled. The dystopian aesthetic is typical of the era... I'm sure when society collapses people will were clothes that border of fetish gear. Similarly the landscape is typical with lots of dilapidated industrial sites being used. If the plot seems familiar it is because it has been taken straight from 'Casablanca'... strangely the moment I realised this I suddenly found myself enjoying it far more. The acting isn't great but I don't think anybody was in this film for the awards, unless they were hoping for a Razzie. Honourable exceptions for Xander Berkeley as the city's chief of police and Udo Kier as \"Curly\", the head waiter at The Hammerhead. There is plenty of action; lots of shooting and explosions but nothing gory to speak of. Mrs Anderson Lee's costume may be very revealing but there was surprisingly little nudity and I didn't notice any strong language so there isn't too much to offend; I was a little surprised it was enough to earn a UK-18 certificate. Overall I'd say this was good trashy fun; just don't expect greatness and you should have a good time."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "pieman",
        "review_rating": "",
        "review_title": "The Greatest Opening Credits Sequence in History",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "mikebassguitarking",
        "review_rating": "9",
        "review_title": "Pamela Anderson CAN act",
        "review_detailed_main": "A superb film, even if you ignore the starting huge boob credits... this gal can act in a way I never knew she could..... she is SOOO fitted for this character.. the whole thing was brill... I must have seen it a dozen times, and I'm sure it won't be the last time... don't make any pre evaluations about Pamela... just see the film for what it is.. a great sci fi with a GREAT looker as a lead..."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "edgar_domingues",
        "review_rating": "6",
        "review_title": "Very underrated",
        "review_detailed_main": "The movie has action and has Pamela ins they best moment. The story is good and editing , fotography is very satisfying. So how much this people want to pay to see Pamela's tweets?"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "uffe-5",
        "review_rating": "",
        "review_title": "Stay as far away from this movie as possible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "jayce2279",
        "review_rating": "7",
        "review_title": "Unjustly criticized",
        "review_detailed_main": "It always amazes me that there are so many people on this website who write negative reviews about movies that clearly weren't meant for them. If you don't like those kinds of films then don't watch them and certainly don't spread your negativity online. \"Barb Wire\" is an action movie set in a dystopian future that was made in the 90s for a predominately male adolescent audience. And, yes, the story is based on that of \"Casablanca\", but that is where the comparison ends. If you want to see Oscar material then don't watch this. If, however, you want to see a fun, entertaining action flick with a drop dead gorgeous lead set in a world that is straight out of a heavy metal video, then you can't go wrong here.\n\nI watched \"Barb Wire\" when it first came out in theaters in 1996 and I was a member of the aforementioned target audience and I remember me and my friends were so impressed we immediately went out and bought its posters, the soundtrack and even some Barb Wire comic books. Having actually experienced the decade in which it was released and having been of the right age to appreciate it, thinking back on that time, I can say that pretty much every one of my peers had been anxiously anticipating this film's release and I can't recall anyone leaving the theater feeling disappointed or thinking they had just seen some terrible movie. I recently watched it again on DVD and was expecting, now that I'm an adult, to understand all of the criticism, but I have to say I think it's even more unjust now than I did back then. Clearly, it wasn't as good as \"Escape From New York\" or \"Robocop\", but the sets looked really cool, I loved the world the film makers had created in general and Pamela Anderson was born to play this role. I'm so sick and tired of reading how badly she acted or how poorly she delivered her lines. I think she was absolutely perfect for the role and the film makers couldn't have cast a better actress. However, although I think the production design was absolutely top notch, I have to admit, I wasn't crazy about the bad guys' Nazi looks. I felt like the costume department could have been a little more creative with them and some of the side characters are a bit cartoonish. Then again, though, that shows the makers weren't taking the film too seriously, which is something the critics shouldn't have either. More on that later, but Barb's bar, the dark alleys, Steel Harbor as a whole and all the other costumes in the film looked absolutely great. You can tell the director got his footing shooting music videos and speaking of that, what a great soundtrack, considering this movie was made in the mid-90s when grunge, alternative rock and house were all the rage.\n\nA lot has been written about why it bombed and everyone seems to be quick to lay the blame with Pamela Anderson, but, as a lover of post-apocalyptic and dystopian action movies who grew up in the 90s, I think the answer is much more complex and, in fact, she is actually probably the main reason this film is still talked about in mainstream media today. Leaving out the \"Baywatch\" star's presence for a minute, \"Barb Wire\" is a movie along the lines of the typical post-apocalyptic or dystopian science fiction films of the 80s and 90s, which I happen to think are very good in their own right, but they're not for everyone. Hence, their budgets usually take this into account and, a few exceptions here and there, the most successful are the ones that were made on a modest one and star actors from the B movie circuit, so the limited audience that is into these kinds of films is enough for them to make a profit. \"Barb Wire\", however, starred Pamela Anderson, who at the time was every male adolescent's (and most probably adult's too, although they would never admit it) dream girl and the makers most likely thought they were sitting on a gold mine and they didn't spare any expense to make this film, such as including a short scene in a glass bathtub which ended up costing them $400,000. However, although every one of my peers at the time freely admitted to being in love with Pamela Anderson when surrounded by his friends, the media did such a good job ridiculing her and convincing everyone she was just a dumb blond that most of us (and I imagine this must have been even more the case for adults) were actually embarrassed to publicly admit we liked her and I suspect that is a big reason why more people didn't go see the movie in the theater, whereas millions were glued to their television screens in the privacy of their homes every week watching her prance around in a red swimsuit. So taking into consideration the dystopian science fiction action movie already has a limited audience and was generally misunderstood and underrated by movie critics at the time and that the media seized every opportunity to put Pamela Anderson down, especially in light of her sex tape scandal, is what I think is the real reason \"Barb Wire\" flopped. Of course it never would have gotten good reviews from professional critics, but I can attest that most members of its target audience liked this film and Pamela in particular. There just weren't enough of us for it to offset its big budget and make a profit.\n\nSo, if, like me, you're into movies like \"Waterworld\", \"Freejack\", \"Escape From Absolom\", \"Salute of the Jugger\" or even \"Mad Max\" or \"Blade Runner\", and if you also used to hide magazines from your parents that featured sexy photographs of every teenager's dream girl from the 90s, then ignore all of the negativity that surrounds this film, but watch it for the fun eye candy action movie it is and I can pretty much guarantee you'll have a great time doing so."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "gutrender",
        "review_rating": "7",
        "review_title": "A modern Casablanca",
        "review_detailed_main": "This movie will never be a classic but I believe it to be much better than most people seem to believe. The plot parallels Casablanca in a Sci-Fi kinda way and is a lot of fun. Pamela's acting does leave something to be desired, but, the character doesnt really demand the emotive ability of Bette Davis either.\n\nThis is a nice rental movie"
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "treakle_1978",
        "review_rating": "6",
        "review_title": "Don't call me babe!!",
        "review_detailed_main": "Ahhh Pamela Anderson such a gorgeous Woman!! Not a bad movie at all. It had its moments funny and action wise. Definitely worth a look."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "choppy",
        "review_rating": "",
        "review_title": "Better than expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "leplatypus",
        "review_rating": "7",
        "review_title": "Babe Wire (vhs)",
        "review_detailed_main": "This movie isn't as bad as it seems and it's definitely the best movie ever for Pam ! There's a real production effort to give coherence to it all the more it's not a blockbuster and it's indeed an anticipation movie ! There's a story, defined characters and a look ! I can even add a soundtrack as the songs are punchy, especially the Shampoo ones ! Pam does her job, not an unforgettable one but not a ridiculous either ! In comparison, i could name a lot of Hollywood scared cows who are always praised notwithstanding they are awful and unfit to act (Jolie, Bellucci, Kidman \u0085). I think that the problem of that movie is it's dark, violent whereas Pam is light and softness alive ! She made it with family shows (« Baywatch », « home improvement ») because they reverberate her kind personality ! Sure to balance it, she is attracted to darkness (rockers, violence) but her audience doesn't want her to fall in that pit ! More generally, it's true that this trend to put bad attitude and guns in women is dumb : I agree that women wants equality with men but this doesn't imply that they should be Rambo or Terminator \u0085."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Infofreak",
        "review_rating": "",
        "review_title": "Future camp classic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "SamJamie",
        "review_rating": "6",
        "review_title": "Trashy, campy & fun.",
        "review_detailed_main": "In the now-fascist USA, Barb Wire, a mercenary and bounty hunter, is forced into a secret government plan involving biological weapons when her former lover asks for a favour.\n\nTo be honest, the only reason I watched this movie is that I recently finished the brilliant \"Pam and Tommy\" on Disney plus. And although I was aware of the existence of this movie, I only thought to watch it now because it's heavily featured in one episode of the show.\n\nDon't get me wrong I wasn't expecting greatness from this film whatsoever, the show even made it quite clear the movie didn't meet its expected reception even on release. But I found the movie carries its self-aware campiness right through to the end, with enough wit and craziness to freshen the mix. Pamela's sexy and serious, scene-stealing performance deserves more respect than it almost certainly got. There isn't a scene that Anderson walks through that didn't grab my attention.\n\nThe director David Hogan keeps the action moving and loaded with fights, gun battles and other action-trashy thrills. The focus remains on Lee throughout, and (except for one flashback scene, in which we see the young, compassionate woman she once was). It's one of those outrageous, over-the-top comic book style movies, and as such, it delivers."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "MrTacchi",
        "review_rating": "",
        "review_title": "Unsettling and revealing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "nigel-18854",
        "review_rating": "6",
        "review_title": "The best of Pamela",
        "review_detailed_main": "Rating this was a bit difficult because Barb Wire is quite a bad film in a lot of respects but overall the effect is quite pleasing. The Pamela Anderson phenomenon passed me by without me taking much notice. I couldn't see that much attractive about a chick with a pudgy face, too much badly applied makeup and those horrible eye brows... and then I watched Barb Wire.\n\nOh right now I get it, she's not what I'd call a beauty but she's got a pot of pneumatic that just never runs out. Yeah there are problems with the film, the tone is a too light, too comical; during one particular scene, early in the narrative which should be disturbing and dark, I find myself laughing quite hard because it's just played so wrong. There is a secondary character that steals the climax from Barb Wire which is quite annoying but mostly the film works well, it has good a visual feel without it being overworked."
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "MovieTycoon_7",
        "review_rating": "",
        "review_title": "Heavy Metal + Porn + Batman= Barb Wire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Reeber",
        "review_rating": "",
        "review_title": "Typical male response.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "schweinhundt1967",
        "review_rating": "",
        "review_title": "Just One Additional Thought",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "killeo",
        "review_rating": "",
        "review_title": "A classic rip off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Kryptik Kritik",
        "review_rating": "",
        "review_title": "Casablanca, Mad-Max, and Strange Days thrown in too",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "Alph-2",
        "review_rating": "",
        "review_title": "Deserves Golden Turkey for 'Most Unsubtle Product Placement'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0115624",
        "movie_name": "Barb Wire",
        "movie_rating": "3.6",
        "review_username": "The_Film_Cricket",
        "review_rating": "",
        "review_title": "Not a total bust . . .",
        "review_detailed_main": ""
    }
]