[
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "agasheesh",
        "review_rating": "7",
        "review_title": "First half was brilliant, can't say same about the second one though!!!",
        "review_detailed_main": "I had no prior intentions of watching this movie on first day first show. Some of my friends were going to watch this, so I joined them. Having just watched a trailer, I set out to watch this film without any expectations. But, to my surprise this movie made me laugh a lot and by the interval most people were out of their seats clapping and laughing. Movie also had a spicy Indian flavor which mixed with great humor made for really some treat. But, soon after interval, it turned out that this was too good to be true. After interval, movie started taking sharp turns some of those were beyond Human understanding. This could have been a wonderful 100 minutes movie. Don't know why directors instead opted for stretching this movie so much so as to make it completely boring and quite predictable too in the end. But, you won't regret your bucks if you see it with your friends for first time. This movie had some awesome beats as well. Punjabi beats were just irresistible not to dance upon them. Do check out OST after watching this movie. Madhawan was awesome as ever. Kangana is a good actress as far as acting is concerned and she didn't disappoint. But, it was difficult to gage the kind of character she played, which turned out to be a bit frustrating. Award for special acting, if any, will go to \"Deepak Dobriyal\" who in the cast of Pappu delivers an excellent performance. He is the one guy who keeps movie one even in a supporting role. Jimmy Shergil in his guest role is awesome too. His performance was very realistic. Eijaz Khan in the role of Jassi is also quite good. Having said that, this movie could have been a real gem which it wasn't. This is kind of movie you would want to see and then forget. Those not familiar with Indian culture might get disappointed because, Indian flavor is what makes this movie enjoyable. I will rate this movie as an average one. 7 out of 10."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "hs-movieman",
        "review_rating": "7",
        "review_title": "A light hearted Rom-com Flick",
        "review_detailed_main": "Guys Tannu weds Mannu is a light hearted Rom-com flick which u can enjoy with Ur family.It has some down moments and some very top standard .The movie is all over nice but not too good.There is nothing fresh but still some scenes can grab Ur attention .The director \"Aanand Rai\" who directed \"Thoda Life Thoda Magic\" and \"strangers\" comes with his new flick.Performances are the top notch part of the movie with its soundtrack,the songs like \"Saadi Gali\" and \"Jugni\" are so groovy that gives u a feeling to dance and track like \"Yun Hi\" is really fantastic and memorable for me,sung by 'Mohit Chouhan'.The Screenplay which is always the backbone of a movie is good but not awesome to grab the audience.Cinematography is worthy to watch.R. Madhvan and Kangana done a great job with this movie and best for me is a Jimmy Shergil,he is in guest appearance nd he is too good.Dialogues are also one of the best part of the movie. The movie is stretched in many parts but still it has some pop up moments,it has great storyline but less messed up climax would have worked wonders for the film.\n\nOn the whole,Tannu weds mannu is a light family entertainment movie,if u love simple nd uncomplicated flicks than it is going to tug Ur hearts.So go nd watch it.Its a wonderful mismatch."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "himdesai",
        "review_rating": "7",
        "review_title": "A candy floss cinema for a perfect weekend.",
        "review_detailed_main": "TANU WEDS MANU is a feel good movie with its own pros and flaws.\n\nThe movie starts off well with a typical start like a rom com movie added a Punjabi funk and flavor to it.\n\nThe film manages to hook you with its sheer atmospherics.The director creates an extremely busy and colorful canvas brimming with characters who are anything but cardboard cut-outs.\n\nIf Madhavan fleshes out a heart-tugging, oh-so-lonely and acutely Desi NRI, winning you over with his shy smiles and well-mannered chutzpah, then Kangna Ranaut's wild cat rebel is endearing too.The feel good attitude of the film is what it makes a worth watch.\n\nThe story by Himashu Sharma is good but nothing new.The factor that keeps you engaged is the unpredictability.Dialogues are catchy and witty at the same time.Good score here.But the screenplay is okay.\n\nThe editing by Hemal Kothari is lousy.The film could have been tightened post interval.The ups and downs in the rom com could have been elaborated slightly better.Kangna's transformation from wild cat to Susy etches.Cinematography by Chitranjan Das is good.\n\nMusic is a complete surprise. Debutant Krsna takes a good start here.Background score is good and it complements the movie.\n\nAanand L. Rai after a good start with \"Strangers\" looks promising here.He has managed well to differentiate an ordinary rom com with this one.\n\nTANU WEDS MANU deserves to be a different cinema in its genre due to directions.Minus few Hiccups in story section,the director has managed well the overall flow of the movie."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Tanu and Manu's Snoozefest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "Peter_Young",
        "review_rating": "7",
        "review_title": "A colourful, entertaining romance",
        "review_detailed_main": "Tanu Weds Manu is an enjoyable film but sadly it never manages to be outstanding. And it could have been, had it been handled better. The film starts on a very nice note, and the first half is very good. Later on it becomes a little messy. The messiness however never takes away from the film's feel-good nature, its colour and wonderful music. The narrative style in this sense is really very good, it's very musical and makes the entire thing flow really well even if the writing is not at its potential best. The romance is particularly well-done, there's a right amount of balance in how the tension is between the two main characters, who are polar opposites, is built.\n\nMadhavan and Kangana Ranaut might be an unlikely couple at first, but it works well. Most of the credit goes to Madhavan's wonderfully subtle and profound performance. His Manu is kind and vulnerable and very easy to empathise with. As the wild Tanu, Ranaut looks prettier than ever and has a nice energy. She does get a little screechy and over-expressive at times, but her presence makes up for much of it. The supporting cast includes a host of familiar faces, and it is Swara Bhaskar who leaves a mark in a performance that is never less than convincing. The conclusion of the story is rather predictable but it's a nice one, as is this film, a watchable and culturally rich romance."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "pargat89",
        "review_rating": "7",
        "review_title": "A nice time pass movie",
        "review_detailed_main": "Today i watched Tannu weds Mannu without much expectations from it, but it turned out to be a good time pass movie.\n\nFirst half is really like a roller coaster ride. Lots of humor with some 'beeped slangs'. It was really funny to hear Indian slags from Kangna who is playing a role of a bindass girl.. ;). As the movie move on you create an interest in the story. Unlike most of bollywood movies where you can predict every scene before, this movie is some what different.\n\nSecond half is comparatively slow and the story calms down with some emotional touch in the movie. Story becomes somehow predictable, but it needs to be that way. They couldn't do much in that.\n\nKangna has shown in couple of her last movie that she can also act a bit. Madhavan is good as always.\n\nOverall it is a good time pass movie. Go and watch it if you are bored with you daily routine and want some fun."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "nitin-badhwar-598-920302",
        "review_rating": "9",
        "review_title": "Watched 20 times but still want to watch again",
        "review_detailed_main": "Watched 20 times and still there is something which attracts towards this movie. Such movies are hard to find...so do watch. The artistic skills of Manu, Tanu , Payal , Pappi , father of Tanu is tremendous ..... they are simply awesome\n\nSome stuff where some more work could have done was Punjabi language. The dialects spoken by Jassi ( hard core Punjabi groom ) is not that convincing.\n\nJimmy Shergill who himself is better Punjabi should have done the role of Jassi. But true to his name Jimmy has played a great role.\n\nRole of Payal is too good,she has long way to go"
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "Good Film...",
        "review_detailed_main": "'Tanu Weds Manu', directed by Anand L. Rai, is a Good Film, that offers entertaining moments in the first, as well as the in second hour, and manages to hold your attention. Sure, it's flawed, but it never really loses it's pace, which works on it's advantage.\n\n'Tanu Weds Manu' is a Romantic-Comedy, about how two extreme opposites attract. But, like every Love-Story, there are faced by several obstacles, which they face, and eventually get over with.\n\nHimanshu Sharma's Writing is First-Rate in the first hour, as it offers some really interesting sequences. But, the writing dips in the second hour, and tends to drag a bit. However, a convincing culmination does the trick. Anand L. Rai directs this Romantic-Comedy ably. Cinematography is perfect. Music by Krsna, is super.\n\nPerformance-Wise: Both R. Madhavan and Kangna Ranaut shine in their respective parts. Jimmy Shergill is excellent. An Under-Rated Actor! Deepak Dobriyal is lovable. Eijaz Khan supports well. Rajendra Gupta is flawless, as always. Others lend good support.\n\nOn the whole, A light-entertainer, that can definitely be viewed once."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "8",
        "review_title": "Realistic presentation of an unrealistic story",
        "review_detailed_main": "Last Sunday, just casually I went to watch Tanu Weds Manu with a low expectation. And to my immense surprise, I felt extremely satisfied after watching it. In fact, as the movie progressed, I found myself being lost in the narrative, flowing with the storyline and the characters (mainly with the hero). This low profile movie is based on an unrealistic story of a well-educated (and well-mannered) NRI doctor, falling for a drunkard, smoker, foul-mouthed and philandering girl of a middle class family of Kanpur (it's been told that she had had her education in Delhi). However, it's the utterly realistic portrayal of this unrealistic story on the screen which makes it a winner.\n\nAs expected, the boy falling for the charms of the girl (whom he sees for the first time in a highly intoxicated state and he thought she was slept), finally wins her over first emotionally and then practically. So the end of the movie is as predictable as any other bollywood movie of the same genre. However, the twists and turns in the story alongwith the highly realistic milieu and the supporting characters involved, turn the experience of watching this movie into a highly satisfying one.\n\nAt the very outset, it reminds the viewer of Hum Aapke Hain Kaun and later it is reminiscent of Jab We Met and Dilwale Dulhaniya Le Jayenge at places. However the commendable thing is that despite similarities in bits and pieces, this movie maintains an identity of its own. It's definitely not a copy of any other movie.\n\nThe locales of Kanpur, Kapurthala, Lucknow etc. have been captured by the cinematographer with a high degree of excellence for which he deserves an award for sure. The lives of the middle class people (whether they are from the prospective bride's side or the prospective groom's side) have been shown with so much naturalness that the characters and their homes look quite real and nowhere filmi. The middle-class India shown in the movie is, in fact, the real one with real flesh and blood characters that may be found at next door to us.\n\nThe first half is thoroughly gripping and entertaining whereas despite its shorter length, the second half is a bit dragging and edgy. However, overall the movie render an air of feel-good. We know that the hero will get his love in the end (after all, he is an Indian hero), still the script-writer has done a marvellous job by maintaining the curiosity throughout.\n\nAfter a very long time, I listened to such soul-soothing music in a bollywood movie. So full marks to the music director as well as the lyricist.\n\nThe supporting characters of the movie are above its story; utterly real, familiar and like a gust of fresh air. Whether it's the chaddi-buddy of the hero or his present best pal, whether it's the closest friend of the heroine or the fathers of the hero-heroine duo, all are able to leave their imprints on the viewers' hearts. In fact, it's the supporting cast which is the heart and the soul of this movie.\n\nJimmi Shergill stands out in the predictable climax and once again proves that he's an actor par excellence. I have been an admirer of R. Madhwan since his Rehna Hai Tere Dil Mein days and to me, he played the character of the mature and considerate hero, doing justice to his love at first sight, with perfection. His underplay deserves a standing ovation indeed. Many readers may not agree with me, however I found Kangna Ranaut as miscast in the role of the spoilt girl. Barring the final 15-20 minutes, I found her expressions and gestures as plastic, not emerging from her heart.\n\nWhen Dilwale Dulhaniya Le Jayenge had been released, I was a heartbroken boy and not being mature enough, used to think of getting the love of my life in the style of Raj (Shah Rukh Khan). Later on, upon growing up with age only I realized that I could never be so resourceful as the larger than life character of Raj in DDLJ. However I am able to identify with Manu of TWM; the considerate, understanding, well-educated, yet old-fashioned and traditional and above all, sacrificing, true lover."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "ian959",
        "review_rating": "7",
        "review_title": "Refreshingly different",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "bhaskarulichi",
        "review_rating": "2",
        "review_title": "Anand L Rai's Fantasy Rom-Com Sucks!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "harishmadireddi",
        "review_rating": "8",
        "review_title": "In Love with Manu, not so much Tanu.",
        "review_detailed_main": "Movie was very much put on the tanu's perspective towards life, marriage, boys and manu but out of all of these Manu and his genuinity stands out through out the movie. Tanu seems dumb at times to unnotice or consider Manu and we may tend to go to the state where its tanus loss if she doesnt find interest in manu and his world. Overall movie was very well made and it hits the audience anxiety because it is shown from tanu's perspective. Because almost everyone will hate so much by the time of interval that only manu bears all her tantrum's. Acting wise kangana was very very good and i think this is the first film of hers where she proved herself with her acting. Madhavan was as usually a best fit into the character. Songs where good enough. Overall a Good Cinema."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "call_dip",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "You can go along with the flow. Well made. Appropriately satisfying. Witty dialogues keeps the engine going all along."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "caroline-macafee",
        "review_rating": "4",
        "review_title": "What did I miss about this feminist wish-fulfilment fest?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "Harshithnagraj",
        "review_rating": "7",
        "review_title": "Half baked",
        "review_detailed_main": "Film is humorous but it's not complete comedy movie. Kangana's acting looks plastic but madhavan really he portrayed his potential. overall a one time watchable movie."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "saur-78",
        "review_rating": "6",
        "review_title": "Not worth the hype",
        "review_detailed_main": "The movie was alright but not the kind of entertainer it was made out to be. The storyline was straight forward with some not so required abuses at the start. (Girl's father throwing one when madhavan says no to marriage).\n\nMadhavan was ordinary and kangna's dialog delivery made me either laugh or irritated me. Movie's best moments belong to the gentleman playing \"pappi\" - madhavan's friend. I love the song kabhi saddi gully...\n\nI would definitely say no to a theater watch. Well if u have nothing to do on a hot afternoon and want to stay home and run a DVD..may be think about it."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "vishaal811",
        "review_rating": "8",
        "review_title": "A Fun Experience!!",
        "review_detailed_main": "Tanu Weds Manu is a typical romantic comedy movie which has got interesting characters to make the viewing pleasurable. Like Dilwale Dulhania Le Jayenge, this movie also makes the mistake of revealing the climax through its title. We know that at the end Tanu is going to wed Manu due to the hastily chosen title. R Madhavan and Kangana Ranaut play the lead roles and give decent performances. Kangana plays the effervescent, rebellious, emotional girl with perfection. However, Jimmy Shergill steals the show with him playing Raja who is a small time criminal who Kangana is about to marry before deciding that she was in love with Manu. The movie takes quite a lot of creative liberties as the number of coincidences that occur in the movie are highly unrealistic. But if you view the movie for what it is, that is a family entertainer that is not meant to be taken very seriously, then it does a good job. It is a feel good movie that works."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "aromal_unny",
        "review_rating": "6",
        "review_title": "Tannu Weds Mannu - An average Movie",
        "review_detailed_main": "Tanu weds Manu is an average ,usual Romantic Comedy . It has got a simple mix up, confusion kind of plot with a bit silly yet predictable ending. The movie showed its spark at moments but never really took off. It started at a very a high note the initial comic sequences were very good. A sequence were they go to Vaishnav Devi is very funny and \"Gaali\" is used in two places very hilariously.The romance in the movie is not evident at all ,infact there is only a couple of romantic sequences.The music was good except the first song which was unbearable but none of the songs was played fully they were played in traces mixed with movie sequences. One of the most romantic song of the movie \"Yun Hi\" is played only for a minute or two which was disappointing . After a good beginning the movie kinda switch to a steady mode with few good sequences here and there and finally declines towards the end. But its still OK and bearable .\n\nThere are no great performances . There are several character in the movie most of them have very small roles. Maddy has got a very easy role of a simple guy and does justice with it .Eventhough Kangana has got an interesting character her role is not very impressive . Kagana comes in a very different avatar never seen b4 and i just hope i never see it again. Her looks are neither cute , beautiful or hot . She looks very ordinary and at places hideous.The costumes and hairstyles add to her bad appearance. Her acting is also pretty uneven . she does a decent job with the comic scenes but slightly goes flat on the emotional sequences .Pappi is a wonderful character played by Deepak Dobriyal . He is the most impressive one in the movie ,he extracts smile out of the audience most of the time and very good to watch . Jimmy Shergil plays a tough guy and the way he looks and dresses very much goes with the character , He does a good job."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "dev_alok",
        "review_rating": "8",
        "review_title": "Not your usual cast of characters",
        "review_detailed_main": "I am not a big fan of Kangna and before watching the movie I was convinced that Kangna will flop at playing the role of a small town girl. However, I must say that Kangna performed very convincingly as Tanu from a small town in UP. Movie had lots of twist and turns but was very convincing up until the end. Madhavan as Munnu Ji was also very likable and convincing. The guy falls in love with a girl at first sight and does things for her even though she is cruel to him. Overall a very good movie that exceeded my expectations. The music of the movie was also very good. Especially like the punjabi songs. My favorite one was kadi sadi gali .. I also liked the rehash of Kajra mohabbat wala. Supporting cast was also strong."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Good things in life come in small packages",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "swagatam_82",
        "review_rating": "7",
        "review_title": "Smaller moments make the movie..",
        "review_detailed_main": "Tanu weds Manu was a low budget surprise box office hit in India that probably was unexpected even for the directors. It does have some merits to it's credit though.\n\n1. The setting is of course the film's strongest point. North Indian middle class family setting well supported by the ambiance and cinematography. The train ride, the rooftops of houses and the gully's everything adds to the rustic beauty of the movie. 2. The supporting characters especially Madhavan's friend who acts pretty convincing as well as Kangana's best friend who actually acted way better than the heroine herself.\n\nThe story in itself is beyond believable so definitely one is not expected to use logic. If you are also wondering why opposites always attract in Bollywood movies, that's because no one really shows what happens later on. I would have really liked to see how a nerdy, soft spoken overly polished NRI can peacefully coexist with a a loud ,foul mouthed rebel with absolutely no cause or conviction girl. However, one is not to think of this and enjoy the movie. Of course, he is madly in love with her after seeing her pass out and later hearing her cuss and swear. It proves again and again that in arranged marriages beauty still prevails. The story progression is pretty good although it's hard to understand where Kangana is coming from or why she is the way she is..or actually why Madhavan does what he does. But then again..forget logic...\n\nNevertheless the movie has a certain charm that cannot be missed. You still enjoy and identify with the smaller moments in the movie. Jimmy Shergill who is one of the supporting characters gives more attention to his role than needed. Everyone else is good where they are. Kangana does the loud mouthed part very convincingly , falls flat where subtlety is required. The songs are exceptionally good and very appropriate..beautifully sung.\n\nIf you enjoy simple narratives and love stories you may actually enjoy the movie."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "Yasmin_07",
        "review_rating": "3",
        "review_title": "Good music, that's about it. Spoilers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "gautam-moharil",
        "review_rating": "9",
        "review_title": "Small town romcom",
        "review_detailed_main": "It's one of the most common story tropes of Hindi cinema. Arranged marriage, one party is unwilling and at the end they fall in love and get married.\n\nWhat's different in this film is that the trope is set in a smaller city in North India and with it come the local vernacular, the local traditions and idiosyncrasies. The direction and dialogue and pacing of the film is good. The music uses the local vernacular and is great. You get the feel of the place which is a plus to the main plot.\n\nThe acting is good. I don't know what it is about Kangana Ranaut that works magic on you in every film she is in. He brash and jarring attitude works for the character perfectly. Without that the film looses the local colour.\n\nOverall a must watch."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "anshul2001anshul",
        "review_rating": "7",
        "review_title": "fresh but did not know how to end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "Vetrrich_Chelvan",
        "review_rating": "5",
        "review_title": "What a drag!",
        "review_detailed_main": "Despite the film's incredible success, I personally found it to be a simple film with nothing but overused clichés of Hindi cinema. A mess made for theatres, suitable as television serial, though has splendid actors in it, falls short because of it's boring screenplay.\n\nJust because you take a bakwaas bollywood film, remove all of it's cringe parts, and make a Desi film out of it with Desi music filling incessantly, doesn't make your film award deserving. It was rather disappointing."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "A pleasant surprise gift in a small package.",
        "review_detailed_main": "In Indian Cinema, a good musical score which has already made its impact on the audience is considered half the battle won. And further if the movie comes out to be a surprisingly pleasant experience then it becomes an icing on the cake for its makers. The same is the case with TANU WEDS MANU which despite of having its own shares of drawbacks, still manages to make you smile and enjoy while sitting in the theater and keeps the good waves of 2011 flowing.\n\nYes, the movie has some seen before settings, the same Punjabi wedding drama, the same NRI visiting the country in search of a girl, the same unconventional kind of girl's character and the same triangular love angle being played towards the climax. Moreover when you are going to see a movie called TANU WEDS MANU then you obviously know that whatever may happen, in the end its going to be a happy ending after all where the wedding between the two has to be there without any exception. But the beauty of the film is that regardless of all this known before and predictable kind of stuff, it still very successfully manages to keep you hooked and smiling, especially in the first half and in the climax.\n\nBefore intermission, TWM is highly enjoyable with many appreciable sequences supported by some great one liner dialogues in the local lingo. Particularly I would like to mention the sequences of family's VAISHNO DEVI visit. In no time the characters move from Delhi, Kanpur, Lucknow and Vaishno Devi to Punjab finally and then it all comes down the romance between the lead pair in some common friend's wedding. But even before you start thinking that its all the same, Kangna strikes you as a shocker with her Bindaas kind of character, who believes in smoking, drinking, changing boyfriends and then running along with them repeatedly. And from that moment onwards, director Aanand L Raj keeps giving you more surprising twists and turns right till the intermission which really works.\n\nPost intermission the film takes a slight dip, with few prolonged scenes, some dull moments and a stretching drama between the on screen friends. But again the final half an hour sets the things right and you don't mind seeing all those unwanted moments at all. In fact the last sequence where two baraats (heading towards marrying the same girl), meet each other on the road is well written and entertaining. However if only the second part of the film was a bit shorter and to the point then I surely could have rated it as a complete entertainer in the end.\n\nNow what really works in this somewhat clichéd movie? For me First is its brilliant on location cinematography giving you an earthy and authentic feel which wins you over in minutes. Second is its well written dialogues spoken by both men and women, using the local lingo superbly. Third remains its lovable characters which are very close to the ones we might know in our real life. And fourth is its winner soundtrack which has already been accepted by the Bollywood music lovers to a great extent. Especially, the sad song running in the background and the song & dance sequence intelligently choreographed on the Original Golden Track, \"Kajra Mohabbat Wala\" featuring Kangna in a freaking style. So all together it turns out to be a pleasant enjoyable surprise with some appreciable performances from the cast.\n\nOn top of all is the lead pair which impressively sticks to their given roles quite different than what they have already portrayed on the screen. Madhavan, playing the role of a NRI with no attitude or style of a foreigner, gives a very controlled and lovable performance. Breaking the old mould, he is an NRI who still loves the old Indian Traditions of arranged marriage and is also a fan of Mohd. Rafi's songs. In fact, TWM is one of those few movies in which I liked Madhavan frankly. Kangna Ranaut on the contrary, plays a completely unexpectedly bold and out- spoken girl who is pretty confused about the love factor in her life. Though for some she might have over-done it but as I see it, she played her part nicely and was able to leave an impact on the viewer. Her diction has no doubt improved but it still needs to be looked upon by her seriously. In short its one of Kangna's better performances till date.\n\nIn the rest of the cast, Jimmy Shergill once again proves that he deserves to be there in the frontline of Bollywood. The boy does a great job even in his under-written role of a Bhai. In the post interval part his character is not well defined enough and could be showcased in a better way. Yet Jimmy plays it real well in the last scene. Ravi Kissen shoudnt have done this meaningless role of just a few minutes. But Deepak Dobriyal gets most of the Taalis on his one liners. He is superb once again in a side-role and deserves a much better place unarguably. Other than these, the girl playing Kangna's friend is pretty good and all the elders of the two families have done perfectly well.\n\nSo, it all comes down to what you actually go for in a theater. If you really go for some fun moments accompanied by few worth watching performances along with some good music served with a little drama, then TANU WEDS MANU might turn out to be the right choice for you too. Because it worked for me in its major parts but still generated a slightly lesser impact than the last year's BAND BAAJA BAARAT."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "bisht-dinu",
        "review_rating": "6",
        "review_title": "Tanu weds Manu \"a crazy U.P. Bihar wedding\"",
        "review_detailed_main": "Tanu (Kangana Ranaut)an extra modern girl passionate for changing boyfriend after every week and also have habit of smoking and drinking.She is small town girl but also a Delhi university hostel student.\"she will be involve in scandals\" this is peoples thinking about her.Even her mom say \"she is now out of control\".And Manu(R.Mahadevan) a doctor (Indian N.R.I.) comes for marriage in his parents advice but still thinks like backward Indian society.He say \"marriage is like a work then it must be finished too\".Whatever Manu comes India for arrange marriage then, they go to visit girl in different location like Kanpur,Noida,Sahibabad...it seems a little flavor of mixed Indian culture.But when he meet Tanu he fells in love with her in first meeting while she is slept.When Manu knows about Tanu reality their marriage finally gets stopped.Then by luck they meet again in their respective friend wedding.Manu is in still love with Tanu.But Tanu have a boy friend who is a railway contractor.And she wants to marry him and Manu helps her.After lot of barriers finally Tanu decides to marry Manu.We can heard lot of abusive words as expected from Delhi- UP based movies.Also some conversation like \"we are from U.P. we can't control ourself in beating someone whenever it is fight.\"Basically it's a romantic-comedy but before interval it's a awesome comedy but after interval it doesn't seem romance nor comedy.After interval movie goes into breakdowns between Tanu and Manu.Kangana did good work in new genre film after her performances in \"Gangster\" \"Fashion\" and so on.R. Madhawan also did well in serious role.It's a good movie because of it's good comic screenplay."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "goelnimish-58173",
        "review_rating": "10",
        "review_title": "Brilliant movie...",
        "review_detailed_main": "This story tells about the story of modern women which is redifining the story of millions of lives in our country. The social message given by this movie is very powerful..."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "harjotsandhu",
        "review_rating": "6",
        "review_title": "Thick emotions, wafer thin plot...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "a_chopra",
        "review_rating": "8",
        "review_title": "A light mood entertainer...",
        "review_detailed_main": "After a series of boring movies like 'Yeh Saali Zindagi', '7 Khoon Maaf', 'Patiala House' etc. this is a very soothing light mood entertaining movie. Kangana looks beautiful and has acted as wonderful as ever in a chirpy naughty spoiled lass' role. Madhavan's role is of no meat except being a goody goody and low profile. Deepak Dobrial & Swara Bhaskar have done their roles very well. Jimi Shergill is good as a typical educated goon of UP. His character needed a little more emphasis. As his muscle-man, Ravikishan has got a tiny role too. The best part is that most characters are shown enjoying old Hindi melodious songs repeatedly in the movie, a trend now for quite sometime, because the new songs have nothing but trash! After Bunty&Babli and Tashan, once again the story is focused on Kanpur! Climax is tasteless and could have been better.\n\nHowever, the movie has got much of a regional touch of UP and at the best a Hindi state touch and will not be much appreciated by big town or English medium audience of India who live here but dream of west emulating every prank of theirs.\n\nThe goodness of any movie are damped by 2 things these days- horrid shouts and shrieks in the name of music with jarring noise in husky, feeble male voices with an overdose of Punjabi & Sufi music. This movies avoids it to great extent still Sufi boredom background shout (song) is there as a deterrent to the tempo of the movie. The second bad thing is poor projection by theaters these days to save electric power they use low voltage which casts a dark spell on the screen killing the joy. Even so called multiplexes do this mean practice."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "msrk-44000",
        "review_rating": "7",
        "review_title": "Entertaining and Interesting",
        "review_detailed_main": "Anand L Rai has done a good job with the film.. It's a comdey movie with lots of drama and it's really so interesting! Kangana and Madhavan acted really well.. Everything is good but at last the film gets lil boring,,The last 30 minutes is the minus point of the movie!"
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "anna-k-grover",
        "review_rating": "1",
        "review_title": "Pathetic characters and movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "saadgkhan",
        "review_rating": "8",
        "review_title": "on the lines of Jab We Met and Band Baaja Baraat. Where girls are loud, bold and fowl mouthed and boys except BBB naïve.",
        "review_detailed_main": "TANU WEDS MANU – CATCH IT ( B+ ) Tanu Weds Manu is a highly entertaining Bollywood movie on the lines of Jab We Met and Band Baaja Baraat. Where girls are loud, bold and fowl mouthed and boys except BBB naïve. Thanks to Jab We Met, now we get to see some real fun entertainer where heroin is not perfect. Otherwise watching goody goody heroines was getting pretty tiring. The first half of the movie is hilarious and really fast paces. In the second half the movie slows down and ends little formula type but still its really good. The direction, music and performances in the movie play a big part in making it so engaging and entertaining. Watching Ganghana Ranaut in comedic, fowl mouthed and typical Punjaban role was quite fun. She really proved that if role provides she can do comedy as well. For once she wasn't shedding tears except in the end. R.Madhvan is great as always. From T.V to movies he is always been good. Ijaz Khan, Jimmy Shergill and all supporting cast is perfect fit. Hands off to music of the movie, the songs are pretty awesome and enjoyable. Overall, a complete entertainer a must see. If you enjoyed Jab We Met and Band Baaja Baraat, you will love this one too."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "SumanShakya",
        "review_rating": "6",
        "review_title": "Slow but Refreshing.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "prats6",
        "review_rating": "3",
        "review_title": "Pathetic Attempt at Humour",
        "review_detailed_main": "The only reason of rating this 3 is the fabulous songs the movie has. Apart from that this is by far one of the worst mainstream movies to be produced.\n\nThe plot of the movie is simple, A guy meets a girl falls in love and their story. Its the typical bollywood drama that follows. Kangana plays the louder than life rebel character while Madhvan plays the sweet boy giving everything to the girl.\n\nThe story is worth 30mins which is dragged to over 2 hours. Just cannot believe that someone can actually make such a bad movie.\n\nAvoid at all cost."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "shivkantsg",
        "review_rating": "7",
        "review_title": "Interesting love triangle",
        "review_detailed_main": "Nice one with good starting, the story is keep you connected but sometime its story is strech out little bit, this Start a new type of bollywood movies , worth watching."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "lamemoviesguy",
        "review_rating": "10",
        "review_title": "Wow!",
        "review_detailed_main": "I had watched \"Tanu Weds Manu\" when it had released - without much attention to details, but I recently watched it again, this time more carefully, and I must say, what a movie! The subject of the movie is not complex; it has a very simple but realistic storyline. What holds one's attention throughout the movie are the performances of the actors, Kangana and Madhavan, and the very realistic representation of north Indian culture in the movie. Kangana is a superb actress, by far the most versatile actress in Indian cinema at this time. After her understated and subtle roles in movies like Gangster, Woh Lamhe, Fashion(in which she simply blows your mind away) and Life in a Metro, I was also floored by her dance with Hrithik in Kites, but here she does even better with her wonderful and so believable expressions. She has a very difficult role because the whole movie is basically about her character - she has to appear naughty, stupid, childish, free-spirited, sincere, love-struck, has to perfom high energy dance and overt gestures and expressions, but at the same time, also pull off moments of subtle emotion and expression in the movie, and boy - she does it all with aplomb! A lot of people may hate her character in the movie particularly if you do not like the kind of girl she portrays, and if you do, that itself says a lot about her performance. Her performance in the movie alone is worth the movie ticket. Madhavan is also absolutely suited to the sober role he has been given. The movie was not particularly liked by most people from south India or Indians residing abroad because they could not connect with it, but for someone who knows north Indian culture, the movie is an absolute treat!"
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "mr-surajit-ray",
        "review_rating": "3",
        "review_title": "Tasteless film making",
        "review_detailed_main": "Bollywood can do well to get some good script writers. This movie is like a test of patience. Its one thing to see a movie and know in the first 10 minutes that it is utter nonsense. This movie however will keep you on the edge - of boredom. You may feel throughout that things will become better and the script might become better - but it just rambles on.\n\nThe central problem with this movie is that it assumes that you have an IQ which is just higher than that of a rodent. Why else would you be \"amazed\" by the twists in the \"plot\". The sad fact is there are no twists and half way through, you will feel like you are dragging your feet through knee deep viscous mud.\n\nBollywood cant stop producing crap like this. Funnily enough the audience here also cant get enough of crap like this."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "chandansharma702",
        "review_rating": "10",
        "review_title": "It deserve more",
        "review_detailed_main": "This kind of movie recalling Rajshree style of movie.\n\nWe are loosing our traditional value in our movies because we are running behind western type of films which are just only being around fantacy, unrealistic hero like superman, avengers, batman. We need this family type of rom com movie.\n\nWe can't compare with others because it has unique flavoe."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "sanjay_267",
        "review_rating": "5",
        "review_title": "A Good Start But Fails to Carry on",
        "review_detailed_main": "Yet another Flick in the bollywood season of comedy with romance..yeah the movie seems promising in the start but fails to keep up thereafter.the Movie starts with the great Indian middle class arrange marriage version where NRI Dr.Ma(madhvan)comes to India for choosing girl for his marriage.where he met a unorthodox Tannu (kangna) who doesn't believe in arrange marriage and having all kind of stuffs in life(Smoking,Drinking etc.)soon mannu get notice that she is not at all going to marry him and ask him to say no for marriage.after that they again coincidently met in punjab and things become more complexed.. acting wise the madhavan is good but kangna's character seems bit overdone..though can be seen one time.."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "omc-44475",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "A well written script, well dress designing, all actors acting very well except madhwan, here you can see his worst acting.. like he stone with zero dilogue delivery and no face expression..just ignore him and everyone is fine in role."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "bharathkalyan-00107",
        "review_rating": "10",
        "review_title": "This is movie also remade in telugu language too..",
        "review_detailed_main": "Tasteless people rating as below average, what a movie man, direction, music, screenplay, story all at top, watch the movie guys both part 1 and 2 parts are worthy !!!!!!"
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "ak-greymatter",
        "review_rating": "1",
        "review_title": "don't even think of watching it..(if you are not suicidal)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "nikree",
        "review_rating": "8",
        "review_title": "2022 First Watch",
        "review_detailed_main": "Light Weighted.\n\nOf course, it was revolutionary great for 2011. But it has visible voids and skippable parts.\n\nThe screenplay could've been deeper and felt like the story is moving only in the surface. Not fantastic acting, but decent.\n\nOverall, it is decent!\n\nNo need to watch, if you haven't."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "How can you make an enjoyable romance if you don't like the prospective bride and don't respect the groom?",
        "review_detailed_main": "\"Tanu Weds Manu\" is a rather poor romance....mostly because the script manages to make the viewer dislike the leads...especially the prospective bride, Tanuja.\n\nThe film begins with Manoj arriving back in India. It seems he's a successful doctor in London and he's returning because his parents have arranged a marriage for him. However, his intended is simply awful. First, she arranges for him to get beaten up shortly after he arrives. Second, she's intoxicated and practically comatose when they meet...by her own choice. Third, she later tells him that she hates him, won't marry him and is in love with another man. Clearly she is NOT prime wife material. But Manoj is apparently a pathetic guy and he pines for her.\n\nSome time later, a friend invites Manoj to attend a wedding. Once in this city in the Punjab region, he realizes Tanuja is there and over time they eventually fall in love.\n\nSo why did I strongly dislike it? Well, Tanuja is an unlikable and awful person. And, Manoj isn't exactly a catch because in spite of this, he STILL wants her. Pathetic. Overall, a film I had a hard time finishing as I just didn't care about the characters...a fatal flaw in a rom-com."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "Kulin33",
        "review_rating": "8",
        "review_title": "The perfect Indian tadka that feels realistic and refreshing",
        "review_detailed_main": "This one just hits it right out of the park with just amazing performances from actors and just amazing script that makes you wonder whether being honest and true is such a bad thing in today's world.\n\nThe direction and cinematography goes so well, the sets and costumes are so authentic and to the point. Plus the amazing acting performances from all actors is cheery on top.\n\nThe directors and writers did a fabulous job with this low budget film that it makes you laugh, and emotional along the journey\n\nIt's a amazing watch for a weekend or when together with family as it can be so relatable to the audience that it just stays with them."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "dasm-18949",
        "review_rating": "9",
        "review_title": "Love",
        "review_detailed_main": "In my opinion this movie is perfect for that time and mein part you are not bored to watching this movie and that kind of movie is more enjoyable for present days romance movie."
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "ssvikas",
        "review_rating": "5",
        "review_title": "An entertaining beginning but a boring second half",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1694542",
        "movie_name": "Tanu Weds Manu",
        "movie_rating": "6.8",
        "review_username": "ahegde3149",
        "review_rating": "3",
        "review_title": "Starts well but goes downhill quickly",
        "review_detailed_main": "The best part of Tanu Weds Manu is the fun quirky interactions between its charming lead pair of R Madhavan and Kangana Ranaut. Both of them give fine performances without which it would have been difficult to sit through this overdrawn affair. It starts of well when Tanu and Manu first cross road but later falters and becomes a clichéd love triangle melodrama. The second half is extremely boring. It also had it too many vibes of 'Jab We Met' which is one of my favorite Bollywood rom-coms. The overdrawn climax doesn't help it either. I just saw this film so that I could see the sequel, but after watching the sequel ( which also was not so great) I felt it was unnecessary. Only reason to watch it would be for performances of Madhavan and Kangana. That's all.\n\nRATING: [1.5/5]"
    }
]