[
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Sparrow_in_flight",
        "review_rating": "2",
        "review_title": "Simply Put? Bad.",
        "review_detailed_main": "Sadly, the running joke of Engywook and Urgl having to go to the bathroom, but being unable to do so, is one of the entertaining things about this film. But it does get tiresome. And the baby rock-biter is cute, if incredibly stupid. But if you have ever seen the first movie, or read the book, you will most likely not care for this movie at all. The plot is poor, Falcore looks extremely cartoonish as do the Rockbiters, and the Nasties...well, they just aren't that scary. Give me Gmork any day, please!\n\nThis is a tolerable children's movie ONLY if you have no other knowledge of The Neverending Story."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "starcat500",
        "review_rating": "2",
        "review_title": "Huge disappointment",
        "review_detailed_main": "I cannot begin to describe how awful this movie is. I watched the first Neverending Story when I was 7 or 8 or so, it came out in 1984, the year I was born, and I was absolutely fascinated with it. A few years later I had the pleasure of watching the second one, and although not as good as the first one, I have to say it is one of the better movie sequels I have seen (the people who comment on it give it too harsh criticism) It was still as imaginative and beautiful as the first one, and kept all the main characters. I saw the third one in the movie rental part of our grocery store when I was 14, and I got exited. I immediately rented it and brought it home and popped it in our VCR (you remember VCR's don't you?). It was not much longer after that that I was popping it out again. NES3, for lack of a better term,... sucks. The storyline was as unimaginative and vapid as you could hope for, it takes place in the real world, and not(as the title would have you believe)in Fantasia, and I get the feeling that it is because creating a fantasy world was a little out of their budget. This movie has \"low budget\" written all over it. The childlike empress isn't even blond! they get some brunette chick who looks nothing like her to play the role. After the fart jokes and potty humor commenced, I just couldn't take it any longer. My advice is don't wast your time and ruin your childhood memories with this piece of refuse."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "kiawa77",
        "review_rating": "2",
        "review_title": "Sequels are usually worse, but this is just TERRIBLE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "kylopod",
        "review_rating": "1",
        "review_title": "So bad it's bad",
        "review_detailed_main": "When this film showed up on the cable listing, I had a sudden urge to see it even though I knew it was probably going to be terrible. The original was such a staple of my childhood, yet had such an incomplete ending, that I was intensely curious to see what they would do with another sequel. Besides, I knew that it could not possibly be worse than \"The NeverEnding Story II.\"\n\nBoy, was I wrong.\n\n\"The NeverEnding Story III\" has rightly earned its place among IMDb voters as the 79th worst movie of all time. It is so bad that, in writing this review, I risk making it sound like it's worth watching, sort of like \"Plan Nine from Outer Space.\" I assure you, this film is in no way in the Ed Wood category of being so incompetently done that it becomes enjoyable to watch. Those moviegoers who take pleasure in seeing cinematic disasters should be forewarned about this one, lest they never again be able to erase from their memory Rockbiter's gravelly-voiced version of \"Born to be Wild,\" played in a video sequence early in the film and again during the end credits.\n\nNo, I am not joking.\n\nThe second film does have its admirers, and as much as I hated it, I sort of understand where they're coming from. At least that film had a legitimate purpose, to tell the second half of the novel which the first film had neglected to do. But now the story is finished, so the third film has to make up its own reason for being, with an even shabbier budget than that of the second film. So it concocts a story that allows us to see as little of Fantasia as possible. Here, a series of magical mishaps causes a bunch of creatures from Fantasia to be transported into the real world. These include Falkor the luck dragon, a baby rockbiter about the size of a fountain statue, and a talking tree. (Falkor, who must have gotten a lobotomy sometime between the second and third film, will chase after a \"dragon\" at a Chinese festival.) What we do see of Fantasia makes the place seem a lot smaller than I had ever imagined. Almost all of the scenes there take place in the empress's chamber in the Ivory Tower, though there is also one sequence where we get to see Rockbiter's home (just what I've always wanted to do!) with Mama Rockbiter and of course the previously mentioned Baby Rockbiter sitting in front of a large stone TV set. Needless to say, the inhabitants of Fantasia seem to possess quite a bit more knowledge of Earth than they did in the first film. When the gnome describes Bastian as \"not exactly Arnold Schwarzenegger in the muscle department,\" we're reminded how much more enjoyable the film would probably be if Schwarzenegger were actually in it.\n\nThe cause of these events is that a gang of school bullies steals the book and discovers that it gives them the power to wreak havoc on the inhabitants of Fantasia. Strangely, these modern kids never seem surprised that magic exists. Think how long it took in the first film for even imaginative, ten-year-old Bastian to become convinced of the book's supernatural qualities. These bullies, much older and more concrete, never go through such a skeptical period. And later, when the Auryn falls into the hands of a teenage girl, she treats it with about the same level of awe as if she got hold of her parents' credit card.\n\nThere are actually some familiar actors in this mess. Mr. Koreander is played by the British character actor Freddie Jones, Bastian is played by the kid from \"Free Willy,\" and the main bully is played by a relatively young Jack Black, who now probably would like to do with this film what George Lucas wants to do with the \"Star Wars Holiday Special.\""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "iriegirl",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "I don't understand why they bothered to make this one. The first Neverending Story really put you in the feeling of a fantasy world. The second was not quite as good. This one? Good Lord! Super trendy, with people in Fantasia watching MTV type television. Falcor wasn't the same voice or personality. It always ruins a good children's movie that is attempting to take you to \"another world\" when they try to make it hip. The beauty of these films was that they weren't \"hip\"; they were a true departure from the everyday. Isn't that what going into the book in the first place was supposed to represent? When will film makers learn to leave well enough alone?"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "An insult to the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Wow, and I thought Home Alone 4 was bad!",
        "review_detailed_main": "This movie was awful, easily one of the worst movies I have ever seen, though not quite as abysmal as Home Alone 4, honestly that film is blasphemy. I love the first NeverEnding Story and consider one of the all time great fantasy films, and the second one while disappointing was pretty good, but this one was garbage. Sorry I hated it, it has none of the magic of the first film, none of the sense of wonder that enthralled me when I first saw NeverEnding Story as a child. The scenery was not at all good, dull and rather tacky, I just wonder whether the producers saw the first film for their inspiration, because actually in the first film, the sumptuous set design should've got an award, for it was fantastic. The script here was dreadful, and the plot was uninspired, and had many inconsistencies with the first film(ie. the omission of Atreyu and anything to do with Bastian's family). Not to mention the rushed ending and the rather cartoonish design of Falcor and his voice(ugh!). Even the acting was poor, Jason James Richter has little of the innocence and heroism and even the likability of Bastian, no matter how hard he tried. Jack Black, who I usually find entertaining was wasted and it doesn't help his character was such an unlikeable jerk, as was the usually brilliant Freddie Jones. All in all, awful, awful, awful! See the first film instead. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "KingAtor42",
        "review_rating": "1",
        "review_title": "In A Class By Itself",
        "review_detailed_main": "This movie does belong in a class by itself: Even worse than utterly terrible. I have been an aficionado of 'bad' movies for quite a long time, adoring those movies which only a group of friends and many drinks makes enjoyable. This movie was in fact so amazingly bad that I could not watch it past the first half hour or so. I only watched the rest via fast-forward the next morning. I've seen many films worse considered classically bad, this one beat them all hands down. I even had to start referring to possibly similar bad movies by saying \"They may be in the NS3 category\". There are those bad movies that are MST3K fun and then there are those that make you wish you had a sharp object to commit suicide with, this one is the latter.\n\nThis franchise went from excellent original fantasy, special effects for the genre, and well written characters to bad acting and writing in part 2, to movie of the week actors and rubber puppets in part 3. It's amazing how a film franchise that had such good promise sank faster than Lips Manless after taking \"the bath\". Especially if you're considering getting this for the kids, at least treat them to the original movie or something like the Peter Barnes inspired fantasy miniseries' from the late 90s."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "EmpressEmily",
        "review_rating": "1",
        "review_title": "do not ever watch this horrible film",
        "review_detailed_main": "In the beginning, there was The Neverending Story. It is the best film ever made.\n\nThen, there was The Neverending Story II. I'll vent my spleen over that mess later.\n\nAnd then, there came this waste of film and effort. Hold on a minute while I go throw up.\n\nWhile it is a clean, safe film in terms of subject matter, the third NES should never have been made. And I mean NEVER. The first two movies covered all the wondrous things within the original book, so I don't understand why this film was made at all. It is just cheesy, stupid, abysmal, and an absolute disgrace to the idea of The Neverending Story.\n\nFirst of all, what's going on with this stepsister of Bastian's that has somehow appeared? Wrong, wrong. . . Then, what happened to good old Falkor? And most of all, where is Atreyu? If you are bold enough to see this film, that is the one thing you will distinctly notice if you've seen the other two- no Atreyu.The boy who played Bastian was not nearly as obnoxious as the actor from the second film, but he just doesn't hold a candle to the original actor, Barret Oliver.\n\nI have only seen this movie once, because I was informed of how awful it was, and just had to see for myself. It was a waste of my precious time. I hardly remember the plot line or anything important like that because it just didn't stick with me. One gets the impression that this was made as a sort of kid/family-friendly approach to The Neverending Story, because it is just so simplistic, and sacrifices the charm of the original characters and settings for the sake of being funny and entertaining. But trust me, it is NOT funny and it is NOT entertaining. Any NES fan worth their salt would be appalled by this film. If however you are not familiar with the Neverending Story, see the original 1984 movie and read the book and be contented with that.\n\nDo not subject yourself to the torturous nightmare that is the Neverending Story 3, I implore you.\n\nAs for a star rating out of ten, I give this film nothing. Nil. Zip. Nichts."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "MattsMovieWatchingWorld",
        "review_rating": "5",
        "review_title": "NES III is a movie I really want to like...",
        "review_detailed_main": "I first saw the first movie a few years ago. I loved it and still love it. I saw the second movie a while later. It was okay then. After two or three viewings I saw Michael Ende's name in the opening credits, and decided to find the book and read it. I can't remember whether I saw NES III before or after I read the book.\n\nThe book was AMAZING. Probably the best stand-alone novel I have ever read. But the problem is: After you read the book, the movies always look worse because it's not like the book. The first movie is basically based on the first half of the book. A few things were changed and/or left out, but it's still a great movie overall.\n\nThe second movie is basically based on the second half of the book. A lot of things were changed and a lot of things were left out. This decreased NES II's score a lot, but it's still barely an okay movie.\n\nNow NES III is based only on the characters of the book. There's Bastian, of course, but in the book and the previous two movies, he doesn't have the attitude anyhow close to getting wild hair. No Atreyu, of course, which was probably one of the worst decisions made in the making of the movie. According to the first movie, Mr. Koreander doesn't like kids. But now he's school librarian, which doesn't make sense. Engywook and Urgl returning was probably a good decision, but their characterization was ruined when they were reduced to complaining about having to go to the bathroom the whole second half of the movie. The Bark Troll (there were bark trolls in the book) is not supposed to know enough about the human world to mention Vegas and Arnold Schwarzenegger. Bastian should not have been allowed to keep Junior at his house. Either Bastian would have said, \"No way! I'm not taking him to my house!\" or Junior would have wrecked his house down. Even the Childlike Empress was reduced to an idiot towards the end of the movie. NES III just doesn't have the feel that The Neverending Story was originally designed to have.\n\nPositive notes on NES III: Well, the story was actually okay in my opinion. Jack Black is a likable actor. Mr. Koreander's line: \"The story's not over yet, young man\" is the only time in any of the three movies where it talks about the NeverEnding Story's \"unendingness.\" I like seeing the Old Man of Wandering Mountain, but it's not the same part as the book. And the biggest positive note: I liked it a lot better a few years ago, when I wasn't as much of a movie critic as I am now.\n\n5/10"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Fyreffect",
        "review_rating": "1",
        "review_title": "Truly the Worst of the Worst",
        "review_detailed_main": "Anyone else out there may fondly remember the original movie. It captured our imaginations and took us to a place of fantastic adventure and will be remembered by most viewers as the pinnacle of family fantasy films. The second was not bad, but it wasn't exactly a shining gem of cinematic art either. Now comes Neverending Story III... absolutely, without a doubt, the worst of all three, and one of the worst movies of all time.\n\nI have heard so many negative things about it for many years, so one day I decided to watch it with an open mind. I wanted to turn it off 15 minutes in, but I held out hope that it could get better in some way. Well, I was wrong, and it just got worse and worse until the finale, which had me face-palming on the couch for what seemed like a number of minutes. Upon reflecting on what I had just seen, I just sat in a daze, astonished that a studio could manage to destroy a franchise's future so utterly.\n\nI will never watch this movie again and I regret ever watching it in the first place, because now that I've seen it, it is forever engraved in my memory and came close to ruining one of my fondest childhood memories. \"So bad it's good\" does not apply to this film. Some more creative viewers may find some small charm in it, but, as everyone had told me for years, it truly is THAT BAD! The studio who produced this garbage should be ashamed of themselves."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "janine_hueren",
        "review_rating": "8",
        "review_title": "never ending story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "earthasa",
        "review_rating": "6",
        "review_title": "Enjoyable!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "heichers",
        "review_rating": "1",
        "review_title": "Did the producers even pay attention to basic points?",
        "review_detailed_main": "I thought Bastian's real mom died? Now his real mom is alive and his dad (except his new stepdad) is gone. Did I miss a step between NES 2 and 3? Then, all the fantasy characters (Falcor, Rock Biter, etc.) change looks (and in some cases, even names)!\n\nIf I could rate this negative #'s, I'd rate this a -10. However, Jack Black showed how he could actually act (in a rather early appearance before he became the likable guy he is/plays now), so I think I'll give it a -5."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "DesertHedgehog",
        "review_rating": "",
        "review_title": "THE worst film. Ever. (Small SPOILERS.)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "kittykat665",
        "review_rating": "1",
        "review_title": "What is this?!? I don't even.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "nicklindenmeyer",
        "review_rating": "1",
        "review_title": "Why God?",
        "review_detailed_main": "This movie is hands down the worst movie I've ever seen in my entire life. I'm now dumber having watched it. This movie is so bad that I took the time out of my day to sign up for an account on this website just so I could warn everyone that hasnt seen it yet to throw it in a trash fire if they ever come across it. They should of taken whatever money they spent making this film and gave it to starving kids in Africa because wasting it on this obnoxious trash is a crying shame. It doesn't even deserve a star at all..I kind of feel like killing myself...why did I put that movie in? Why God? It goes to show that time travel will never be possible because no one has come from the future yet to abort the making of this horrendous mind numbing black hole they call the never ending story part 3...oh its never ending alright...you just want it to end but it never does..it just gets worse and worse..."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Not one of the finer kids' movies, that's for sure.",
        "review_detailed_main": "I have watched many, many more movies than the average normal person. My tastes are varied...classic films, foreign films, silents and more. But one of my odder pursuits is my weird desire to watch all 100 of IMDB's Bottom 100 List....the 100 lowest rated major release movies. It's important to point out that I have never seen any of the \"Neverending Story\" films and I started with #3. And, since it made the list I thought I'd give it a watch.\n\nIn this film, Bastian is a kid who appears to be about 10 or 11 year-old. Oddly, he's begun at a new school...one that allows 'kids' there who are nearing retirement age (or so it seems). This small kid is chased and assaulted by a group of 20-something punks (led by 25 year-old Jack Black) and they're going to beat the stuffing out of him. To escape, he uses his magical book to enter the land of Fantasia. The problem is that the punks find the book and keep it...somehow realizing that will keep him stuck in Fantasia forever. But apparently there is another way out....and it's long and complicated and boring. And, somehow, some creatures from Fantasia were accidentally brought to the real world with Bastian...and he needs to find and return them.\n\nThe Henson creatures vary. A few look really nice. A couple seem rather dated and creepy. What's REALLY dated is the introduction, where you see some very early CGI which looks horrid today. Perhaps in 1994 folks were impressed by it.\n\nWhat doesn't vary much is the writing and acting. The story seemed tired and the characters were often annoying. I particularly hated the rock creature who sang Steppinwolf's \"Born to Be Wild\" sequence and I assume a lot of folks in theaters felt the same way. I also thoroughly hated the bullies...who were old enough that they should have known how to act...but didn't. At least Black landed on his feet and eventually learned to act.\n\nSo do I recommend it? No...there are much better kid's films out there that WON'T make parents watching along bored. Plus, smaller kids probably shouldn't see it because the bullies are pretty frightening. And who should see it? Probably no one.\n\nIn spite of this, I don't think the movie deserves to be on the Bottom 100 and think mostly this was the result of folks who loved the original being so angry about the poor quality of this third film."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "We must not give into the Nasty!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "tsnake",
        "review_rating": "2",
        "review_title": "Almost makes me want to watch football",
        "review_detailed_main": "Football is nearly all that is on right now and I caught up on TV shows, this movie is on and I figure to give it a shot.\n\n1994!?!?! This movie reminds me of the worst of 80's low budget fantasy. Even how the characters dress, with their preppy plastic clothes or stereotypical \"punks\" outfits.\n\nAs another commenter pointed out, the references from Fantasia characters to real world people and places is insulting.\n\nThis movie kills fantasy.\n\nThe contemporary soundtrack also destroys whatever potential there could ever be for a lasting (positive) impression.\n\nEverything about this is horrible. I gave it a 2 because it's better than watching football."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "aleclemlij",
        "review_rating": "2",
        "review_title": "neverending reputation? Ended!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "rapt3",
        "review_rating": "1",
        "review_title": "Daaaaaahhh... neverEnding negative points!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "The 3rd story that never ends...",
        "review_detailed_main": "Yes, the story of the \"NeverEnding Story\" doesn't stop here! The family fun goes on and on and on and on and on........\n\nGet your family ready as y'all go on an exciting adventure through a fantasy land, meet lovable characters, hear stories with great values, and more! Much, much more! But wait! There's more! There's terrific animation, terrific voices, a great story, a great plot; mix them up, put them all on a greased cake pan, put the pan in the oven already heated up to 350 degrees Fahrenheit, and in 30 minutes or less, you've got a great family film that's been nominated for best film! (Hint: if your movie is not done by that time, it's free. LOL) I sure hope this series lasts as long as the \"Land Before Time\" series! (Man, how many more movies can there be?)"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ghettodogaudio06",
        "review_rating": "7",
        "review_title": "Cool but Super Cheese!",
        "review_detailed_main": "I still think the first Neverending Story is the best of the series. I didn't so much like the second one as it was super cheese. This one is still super cheese but I enjoyed this movie. This version is so 90's. The music is so Dance Mix Tape style. And I loved Jack Black as the bully. This movie is not as well done with the fantasia characters but I really liked the story line with Bastion's little sister. And the nice family moral at the end of the film. This movie is not as cool as the first one but maybe because I'm a kid of the 90's I liked this version because I can remember growing up in the 90's. Hopefully they will not make anymore versions of the Neverending Story unless they do a really good job. Falcor was so cheese in number three that I can't bare to see anymore movies made of this series unless they do an amazing job on a fourth one. I am so cringing the new Lost Boys Tribe movie as it will be nowhere as good as the 80's original."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "perfectway76-901-658919",
        "review_rating": "1",
        "review_title": "Absolute trainwreck!",
        "review_detailed_main": "I checked this movie out earlier today out of curiosity after reading the reviews on here. Wow!! I'm still shaking my head over how incredibly bad it is!! Too bad I can't give this movie a 0. All the reviews are true. At least I saw it for free on youtube so the only thing I lost was time. Well that and braincells. I didn't even care about the characters, not any of them. This movie is incredibly boring-- non-existent plot & nothing makes sense. The characters are annoying, one-dimensional & too cartoony. The whole movie is a weird combination of trying to be funny & hip but serious at the same time, which of course fails because the viewer can't make heads or tails of this mess. This miserable excuse for a sequel doesn't belong on the same planet as the wonderful original, which i'll always love & can't wait to see again!!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ladybug37211",
        "review_rating": "",
        "review_title": "Poor, Poor Neverending story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "adanathel",
        "review_rating": "2",
        "review_title": "Oh dear god....",
        "review_detailed_main": "Why oh why didn't they try a little bit more.Just a little....Or maybe they did try...Because you have to try hard to have such a shitty and boring story and to destroy the main characters in such an extent.And the villain...The nasties...Really....It went from the Nothing to the Emptiness and end up in the school bullies?Going from abstract meanings symbolizing the disappearance of imagination to the school bullies?The first time i saw it i actually stopped watching it in the \"bike scene\".Unfortunately i made the mistake of continuing it some other day...Wish i hadn't...\n\nGo watch the first movie again which is a masterpiece of children fairytale movies and don't ever touch this one....\n\nPS And all you trolls reviewing this saying it is fantastic and tricking people in to seeing this awful thing...YOU ARE TERRIBLE HUMAN BEINGS!!!!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "zakso999",
        "review_rating": "1",
        "review_title": "This movie does not exist. There is no NeverEnding Story III. It's a lie. Nothing more, nothing less.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "abbienicolew",
        "review_rating": "1",
        "review_title": "If I could rate in negatives, I would",
        "review_detailed_main": "Absolute joke, the fact money went into this film is just depressing. Should've saved that money for therapy for people who watched the second. I'd rather watch dog crap turn white than even hear this movie from a distance. -12/10."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ericstevenson",
        "review_rating": "1",
        "review_title": "Why was this movie made?",
        "review_detailed_main": "I was so interested in seeing this movie because it was featured in my favorite review of the Nostalgia Critic ever. It's hard to say that I really suffered while watching this because it's so much fun to learn more about it from the Critic's review. I loved hearing the commentary from them saying it was so bad we should all just make our own reviews and I am now! The basic plot is that Bastian uses the book from the first two movies and is pursued by a group of bullies called the Nasties. I remember watching the second movie and being amazed at how bad it was. I'm so glad the awfulness of this film puts that one to shame.\n\nThe Critic didn't even mention the fact that the secondary character from the first two movies, Atreyu wasn't in this film for no reason. Okay, the reason was that he didn't to be associated with this horrendous film. We get a lot of characters like the Rockbiter's son, a talking tree, and gnomes and you know what? Every single one of these characters is completely and utterly useless. They only make things worse, make stupid jokes like referencing Arnold Schwarzeneggar and making jokes about barking up the wrong tree. The designs, especially the Rockbiter are terrible and stupid looking.\n\nThe childlike empress and the people she works with are also completely useless, boring and dumb. She never even explains why Bastian can't just wish everything to go back to normal. The second film at least had purpose in that it adapted the second half of the book, although loosely I heard. Falcor is now an idiot who thinks airplanes and paper dragons are living things as opposed to his wisdom from the first movie. We get toilet jokes and a story that really does seem to have no end. There's sort of a sequel hook but thank God this film was so awful it killed off the franchise forever. Zero stars"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "D_Burke",
        "review_rating": "2",
        "review_title": "Easily One of the Worst Sequels Ever Made",
        "review_detailed_main": "Imagine that you are reading an entertainment magazine like \"Entertainment Weekly\" or \"Rolling Stone\", and you happen to look in the news section where they give you information about a movie that is in production. It is a children's movie distributed by Miramax, who has made dozens of Oscar-winning films over the last 30 years. It has special effects by Cinemagic and the Jim Henson Creature Shop, and Jack Black stars in it. You would want to see it, right? Well, not if it's \"The NeverEnding Story III\".\n\n\"The NeverEnding Story III\" is disappointing in every sense of the word. It is by far one of the worst sequels ever made, and it does a disservice to the book by Michael Ende and the original 1984 film on which it is based (My review: http://www.imdb.com/title/tt0088323/usercomments-250).\n\nThis movie takes characters from the book and creates a new story that is full of plot holes, bad puns, and very little logic whatsoever. It helps very little that none of the cast members from either of the first two movies were involved in this film.\n\nThis time, Bastian is played by Jason James Richter (\"Free Willy\" (1993)). Although Richter looks like a preteen model, he is still harassed by a gang at his new school known as the Nasties (or the Nastys) whose leader is Slip, played by a then-unknown Jack Black.\n\nAs it turns out, Bastian's new school also happens to be where Coreander, the owner of the book store in the original story, works as a librarian. British actor Freddie Jones plays Coreander in this movie, and fans of the original may be disappointed not to see Thomas Hill reprise his role. I don't blame them.\n\nAnyway, Coreander happened to bring the NeverEnding Story with him to this school library. It's a pretty contrived way to bring the book back into the story after the main character has moved away if you ask me.\n\nWhat's even more contrived is when Bastian, hiding from the Nastys, retreats into the world of Fantasia, only to have Slip retrieve the book, realize its powers, and try to destroy the world and Bastian. In the book and the first two movies, the reader had little to no control over how the NeverEnding Story would be told. How the Nastys get control is never explained anywhere in the movie. The NeverEnding Story being an enchanted book is no excuse to cover up such plot holes.\n\nWhen Bastian realizes he has to re-enter the real world to obtain the book and save Fantasia, the movie just gets worse. Even with the Oren (the token worn around the neck that resembles two snakes), Bastian alone can't make it back home. So a number of creatures from Fantasia have to wish with him, and be transported into his world, for him to save Fantasia.\n\nSuch a subplot wouldn't be so bad if the supporting characters weren't so annoying and intelligence insulting. There's the Rock-Biter's baby boy who talks in annoying \"baby talk\" that real children under 3 don't use as vernacular, an anthropomorphic tree who talks like an old Jewish comedian except not as funny, and two gnomes (Urgl and Engywook, featured in the first movie but played by different actors) who have a tired running joke about needing to use the bathroom.\n\nOh yes, and who could forget Falcor, the luck dragon? In the first two movies, Falcor was a hero to Atreyu and Bastian, and was the voice of reason in many situations. He also had a voice like Walter Cronkite, which made him ever cooler. Here, he not only looks different from the previous two films, but he's whinier and dumber. When, in the real world, he mistakes an airplane for a female luck dragon, I could only hang my head and wonder, \"Why?\".\n\nTo make matters worse, Bastian can't wish the book back after the Nastys stole it because he can't use the Oren to make wishes in the real world. That plot point is well and good, and makes a setup for a great conflict that adds to the story. Unfortunately, the people who wrote this screenplay forget that plot point and failed to explain why Bastian's stepsister Nicole (Melody Kay) could make wishes when she had possession of the Oren. Any script reviser could point out these plot holes, and it most especially amazes me that filming progressed despite these inconsistencies.\n\nIt is even more amazing that no one in this movie actually acts poorly. Richter does well in his role, despite his voice obviously cracking and no one noticing. I don't bring that point up to be mean. It's just that the filmmakers could have used his voice changing as a good subplot to explain why he's being picked on. But I digress.\n\nThe point is that everyone involved in this film just could not save the story having so many inconsistencies. By the end, the story bears no resemblance to Ende's original book at all. The Fantasia creatures are also too annoying, trying too hard to be comic relief and inundating their dialogue with uncharacteristic pop culture references. Case in point: the Rock Biter rides his bike while singing \"Born To Be Wild\" by Steppenwolf. What were these filmmakers thinking?\n\nAnd you would think that the Jim Henson Creature Shop working on your side would be a valuable asset in this film. In this case, none of the recurring characters look like they did in the first two movies (the Rock Biter, looking like a pint-size version of his predecessor, was the biggest disappointment), and they weren't strong characters either. They did not live up to Henson's high standards of storytelling and development. If you don't believe me, try finding this movie on Muppet Central. You would have had better luck finding this film in a theater that ran it for two weeks back when it was released."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "princessstrickland21",
        "review_rating": "1",
        "review_title": "Please shoot me",
        "review_detailed_main": "I'm serious, what the chocolate coated hell is this.\n\nThe first one was a master piece, the second one was ok and this.....\n\nShould not be seen by a living soul.\n\nThe rock biter is different looking, falkour looks and sounds like Patrick Star as well as being wrong.\n\nJack Black, who plays a cillian HATED how the movie turned out. I dont blame him one bit.\n\nEven the kid saying Bastin sucks! His dad marries a widow and gets a sister. I'm sorry, it's just not worth the watch AT ALL!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Atreyu_II",
        "review_rating": "1",
        "review_title": "One of the worst movies I've ever seen",
        "review_detailed_main": "Without surprises, I was expecting this to be very bad. On one hand, I saw no reason to watch this at all. On the other hand, I had nothing to do, so I decided to watch this just to see how bad it would be.\n\nMy oh my, the many negative comments I read about this movie have all the reason to be. This movie is garbage, capable of making any fan of the original blush of shame. Seriously, I don't get how in the world did this movie lost its place in the IMDb Bottom 100 because that's where it belongs.\n\nThis terrible film should have never seen the light of the day. What did they think they were doing? This is not even a shadow of the original. Frankly, this is an offense and mockery on the original and a strong one to win a place of \"honor\" at the Razzies, being the worst of the trilogy.\n\nIf the 2nd one is already quite bad and a huge mess, this one is even worse. It's a movie without reason to exist. Everything is bad in this movie: the crude puppets and sceneries, the very poor plot, all of the characters (especially the more than annoying bullies, the Nasties) and the crappy lines (such as a reference to Arnold Schwarzenneger and Jean Claude Van Damme).\n\nBut that's far from being all. The bullies here are really nasty and way more annoying than the bullies from the original film. Just as bad as this or even worse is that here the bullies have the power over Fantasia!\n\nPlus, what have they done to good old Falkor? Here he is so ugly and has no personality at all. Here he has nothing to do with the beautiful and happy creature from the 1st film we all love so much. And what's the point of putting Falkor flying next to a Lufthansa plane? Other annoying things are, without a doubt, the walking tree that also talks... bah, I hate that kind of thing! The Rockbiter here is slim and small, so much that I didn't realize it was him until the 2nd half of the movie. Here he's got a wife and a son, Junior. Can't describe how annoying is the Rockbiter and his family here. And now they've got a television? My goodness, what a silly nonsense!\n\nThe soundtrack is a mistake. I mean, the songs themselves are great, such as \"Born to be wild\", \"Crash! Boom! Bang!\", \"Kiss From a Rose\" and \"Games People Play\". But these songs aren't for a fantasy movie. As for Fantasia, as one can (and should) expect, it hasn't got the magic, enchantment and beauty of the original.\n\nJason James Richter, although he was a competent actor, can't be compared to the charismatic Barret Oliver. Once again, the cast is entirely different. None of the characters feel like those of the original at all. They're a joke instead of captivating. Yet there is nothing funny about them or the movie itself. And that thing of Bastian's new family and lifestyle... no comments.\n\nThe cast, the director and all the artists involved in the 1st movie must have had quite a shock with this joke of a movie. This has nothing to do with their masterpiece. They must have laughed out loud about how ridiculous this movie is..."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "elisereid-29666",
        "review_rating": "8",
        "review_title": "A good ending to the saga",
        "review_detailed_main": "Say what you like about the sequels to The Neverending Story, but at least they do something that most movie sequels utterly fail to do. They dare to continue the story started in the original, rather than simply repeat the first story ad nauseum. This is to be expected to a degree, because the source material was a very long book, of which the first movie covered only the first half. The second movie, therefore, had material to work with without having to repeat the formula (though it was only very loosely based on the original source material). The third movie was another question, because the source material had been used up. This is why I did not have high hopes for this movie.\n\nAll the same, I waited over twenty-five years to see The Neverending Story III, because the first two movies were a major part of my childhood, as they were for many people. Upon finally sitting down to watch it today, and having heard all the reviews everywhere about how awful it was, I was surprised at how much better it was than I anticipated.\n\nThe movie is at its best when it is telling the story set in the real world about Bastian adjusting to his new family, and there are quite a few wonderful moments of truth in his relationship with his new sister. It tells a story that many kids that come from blended families can relate to, and I think they can also relate to wanting to escape into a magical book, as Bastian does throughout the series.\n\nThat said, I found much of the humor unfunny and labored. This is the film's weak spot, but overall I liked it better than the second movie. Though I loved it as a kid, the second movie did not age as well for me because the acting seems subpar in retrospect, especially Bastian and Atreyu (who is absent entirely from this second sequel). However, Bastian in this movie echoed the Bastian from the original, and very much seems like the same character, but older-unlike in the middle sequel, where he largely seems like a different person altogether.\n\nPurists and people who grew up with the original movie will likely be disappointed, but I have a philosophy of walking into every movie with an open mind, and therefore, I tend to enjoy most movies more than the average critic-a characteristic that is sadly missing from most reviewers (and which should be a requirement)."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "DoctorSkyTower",
        "review_rating": "1",
        "review_title": "DUMB",
        "review_detailed_main": "Saw the original Never ending Story years ago, I loved it! Adults as well as kids will enjoy this first film. There were all manner of strange and wondrous beasts to keep the audience interested. It also had a great story line.\n\nSequel to first film.... Ahhhm....\n\nThis Third installment... Oh Dear.\n\nThe set has moved to the modern day 'human world' of earth. Climax of movie is at the local shopping mall (during Halloween!). We have 90's music and mannerisms, and a bunch of pathetic bullies called 'The Nasties' are the antagonists. A motley assortment of Fantasia life forms romping about the boring local shopping mall not only looked cheesy, it reeked of the standard, well-used cliche. 'Non-human' characters were very poorly designed, they looked exactly like men in suits, lame-o borrowed from the 70s!\n\nPlot line was a very long, (boring) worn-out cliche, unlikely to hold your attention for long. There have already been countless movies done before with the same story line. One gets the feeling of 'made for the pre-teens only'. Unlike the first film, which appealed to all ages, this is a definite yes.\n\nCONCLUSION: Not impressed. This whole thing should have stayed where it was created - in the fantasy world the book was based on."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "BorgQuen",
        "review_rating": "2",
        "review_title": "Pure Crap",
        "review_detailed_main": "I hated this movie, though I absolutely loved the first two. This sequel is totally off track from the original. Many points were changed in the story and descriptions. Also, the Fantastican characters weren't the original ones (even the Auryn and book were different) and ended up looking silly and dumb. In fact, the characters acted liked they looked! It's a movie to avoid AT ALL COSTS!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Naughtia_Nah",
        "review_rating": "2",
        "review_title": "Stone characters reminded me of Jim Henson's 'Dinosaurs'",
        "review_detailed_main": "I'm just trying to understand why this movie was made with so little effort. The plot could have worked but these filmmakers totally trashed the lovable concept of the magical Neverending story. The magic that captured me in the first two movies is non existent in this one.\n\nI cherished The Neverending Story 1 and 2 when I was a child, and I remember these stories being much more tragic and more magical. In this movie they made the characters a whole lot more silly than they had to be, and they have totally changed the looks of the characters. For instance the stone people were ridiculous and reminded me about Henson's TV-series 'Dinosaurs'. Falcor's looks have totally changed, I'm wondering if they did burn the Falcor puppet from the other movies? The only thing I loved about this movie, was Jack Black's performance. If it wasn't for him I would rate this movie with 0%."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "thewag777",
        "review_rating": "1",
        "review_title": "Worst movie ever made",
        "review_detailed_main": "Oh how the mighty have fallen. The first one was brilliant, full of imagination, and completely unique. The second was a cheap knock off of the first. This 3rd one, however, was an abomination. It was nothing more than a pathetic attempt at humour with the unnatural mixing of the Fantasia world with the materialistic pop-culture that I watch fantasy movies to try to escape from. The rock-biter is singing 'Born to be Wild' and the child-like empress is going on a shopping spree. Worst of all, they butchered Falkor, the luck dragon. Another commenter referred to Falkor as the wise old dragon. Rightly so, and might I add courageous. But in this one, there version of Falkor is a stupid, clumsy, cowardly excuse for a dragon. What they did to Falkor is unforgivable. What a waist of a Hollywood budget. Needless to say, I gave it 1 star. I wish I could give it negative 10. Watch this movie once just to see the stupidest movie ever made. You will get a good laugh out of it perhaps."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Banky-4",
        "review_rating": "1",
        "review_title": "What were they thinking?!!!",
        "review_detailed_main": "This movie is only the second to put me in the fetal position and almost make me cry out of it's sheer badness...(the other movie was Dr. Giggles, thank you very much) This movie has lost all the magic the other two had. I have no idea what went wrong, but I'm sure the writers and Director aren't getting much work anymore.\n\nBut, to be fair, the story had a good premise, but it's execution was terrible. And the whenever Jack Black is on-screen, the movie becomes stomachable.\n\nIt still gets a one though, because they turned Falkor into a yellow bellied wimp, and forgot about Atreyu. Ugh...the pits."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "Pales in comparison to the first and even the lackluster sequel.",
        "review_detailed_main": "This movie is nothing but a slap in the face to fans of the original film. The second movie was bad enough, but at least they tried....this was just stupid. And the sad part is this movie will probably appeal to young kids more than the other two.\n\nIn this atrocity, Bastian Bux's father gets married and Bastian has a new stepsister who doesn't like him for some reason. He goes to a new school and gets picked on by the group of bullies called the Nasties, led by a young Jack Black. He goes into the Neverending Story to escape the bullies, but they find the book and start changing it in their image. Chaos ensues. One thing I can say about this movie, is it's actually somewhat entertaining at times because of it's stupidity, where the second film was just boring. But nonetheless, this is still the worst of the films. It seems as though the writer and director didn't think to use the other two movies as references on how the characters should look or act. Falcor in the first film is an intelligent heroic creature, here Falcor has a deep, dumb voice and he serves as the stupid coward comic relief, similar to the Cowardly Lion. The Rock Eaters have totally changed what they look like from massive and wide to skinny costumed characters. One of the worst scenes involves the Rock Eater singing \"Born to Be Wild\", which was horrendous. Atreyu, the co-main character of the last 2 films is gone, and everything about Fantasia has changed in this terrible so-called final Neverending Story film.\n\nMy rating: BOMB/****. 90 mins. Rated G."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "abeighrw",
        "review_rating": "1",
        "review_title": "Embarrassment to a built legacy",
        "review_detailed_main": "I have so many issues with this movie. It is a mess! The looks like it's from the 70s and the first is from 85! I watched this movie as a kid and knew it sucked and miles apart from the first... but never knew to what extent till watching it again as an adult.\n\nWhat's the point of having an iconic movie with a iconic symbol like the Orin but use a completely different necklace and symbol??\n\nConstant questions about the characters that have lost all there meaning and depth that was built from the first.\n\nFirstly, Falkor has gone from a wide, comforting and kind luck dragon that was brave and confident to a derpy quivering mess. The rockbiter and family is a joke that's not funny when Rockbiter was such a prominent, relevant character with such depth before. New characters like Barky (tree, obvs) try to hard to be funny. The best new character was Slip (Jack Black) while he was in a cringy gang called The Nasties. The acting isn't bad, it's just awfully written with a awful plot that drags everything else down."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "sledgehammermessiah",
        "review_rating": "1",
        "review_title": "Insufferable",
        "review_detailed_main": "Unbearable voice acting and dialogue makes this a chore to get through. Aside from a young Jack Black and some decent practical effects and puppet work, this movie is just awful. They turned the Rock Giant into a joke and Falcore into a doofus. It has a completely different tone from the previous 2 films."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Retrovenger",
        "review_rating": "",
        "review_title": "Watch Nostalgia Critic Review Instead!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "sxccevdet",
        "review_rating": "10",
        "review_title": "This is a work of Dream Day.",
        "review_detailed_main": "Imagine your imagination and your heart, you can understand this film. The lessons and emotions in this film are treasure. People unfortunately have forgotten their hearts dreams. so they never understand this film. This movie; Imagination, Love and Feelings for people living."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "AnnieLola",
        "review_rating": "1",
        "review_title": "UNWATCHABLE!!!",
        "review_detailed_main": "Alas, poor Neverending Story! Now that VHS is considered obsolete (though I still find it perfectly acceptable, easy to record on and cheap or free) it's easy to build up a great film library for nearly nothing or nothing. So while browsing the ten cent videos at the thrift store I thought that a dime could be hazarded on something that might be worth watching. Mistake. Ten cents is too much to pay for this dismal mess. I have fond memories of watching the first installment back in the 80s, never bothered with the second, and sincerely regret having even discovered the existence of #3. On the bright side, my dime wasn't actually wasted because I can record over it."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "seanofthedead-79680",
        "review_rating": "1",
        "review_title": "Stick to the first one, please.",
        "review_detailed_main": "What can i say that hasn't been said before? This movie sucks, who in their right mind would think this film was such a good idea? The main hero is complete moron, the beloved characters from the first one are butchered. As the villains, how do we go from an all powerful entity known as the nothing to bunch of school bullies known as the nasties? Did the forces of evil lowered their standards?"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "kaidacane",
        "review_rating": "1",
        "review_title": "Total utter crap",
        "review_detailed_main": "This movie was so horribly done I was waiting for the moment for it to be over with. It was pretty torturous, from the bad acting, lame jokes trying to be \"hip\" to flat out disappointment in character development. This movie is just an embarrassment. I don't even associate this nor the NES II with the NES I(which was the only good one). The series could have been great if it was consistent in actors & quality.\n\nI think I'm going to go cry about the hour I wasted watching this movie.\n\nThis site asks for my review to be at lest 10 lines.... How much can you write about a movie that sucked so bad you were on the edge of your seat waiting for it to be over? I literally just watched it so this review is fresh...and yes it was my first instinct to write a review for this movie so no on else has to suffer."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "T-ZER0",
        "review_rating": "1",
        "review_title": "The VeryEnding Story",
        "review_detailed_main": "Firstly, I want to apologize to IMDB. I wrote a review about this film earlier and it was rejected because it was a flat-out rant. It was not a review that was explainable. It was a flat-out rant. Now, that I've apologized. Let's write a REVIEW of this film. Not a rant.\n\nSo what may confuse most people is the title of the film. It's called \"The NeverEnding Story III: Return to Fantasia\", or \"Escape from Fantasia\" depending on where you live in the world. It really should have been called: \"The NeverEnding Story The Adventures of Bastian Bux the Movie\". Because this movie is basically an adaption of an animated show. Not of the book source material which it should have been based on.\n\nLet me just say that there are ideas in this film that sound like they COULD be good. Hear me out, think about this. And this only, what if someone evil was in control of the book \"The NeverEnding Story\"? If you think about that alone, that sounds like an interesting concept. Also, if you think, \"What if the creatures from Fantasia got into the real world?\" That sounds great on paper, but not for a movie.\n\nThe movie just should've been a cartoon. It has musical numbers that could've been fine if it was something like Lion King, but some of them are cringeworthy. Example: Born to be Wild by the Rockbiter! 😖\n\nAtreyu is not in this film. Here's the reason why: When he read the script for it, he escaped Fantasia and never came back. That's the reasonable explanation. Also, why are the bullies called the Nasties? They could've been called the Bullies and it would've been better than the nasties. I'm sorry that you had to act in this Jack Black.\n\nAt least they added the Old Man of the Wandering Mountain, but still. This is a terrible movie. It's amazing how bad they did on this film. It's a disaster! The animontronics are creepy, the villains are annoying, I cannot take Bastian seriously, and the plot needs major work.\n\nOn the upside, I did love Julie Cox as the Childlike Empress. To me she's the best and prettiest one of all three. I guess it's just because she's British.\n\nHow I rank the Childlike Empresses:\n\nThree: Alexandra Johnes (Did not look like an empress)\n\nTwo: Tami Stromach (Great role for her, but I like Julie Cox more)\n\nOne: Julie Cox (The prettiest empress and the most believable).\n\nSo yeah. Don't ever watch this movie. If you must take something from it. Take the fact that Julie Cox did great. But don't waste any hours of your life or brain cells on this disaster."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "IonicBreezeMachine",
        "review_rating": "2",
        "review_title": "With the producers firmly in control, their first move without Ende boils down to \"How do you do fellow kids?\"",
        "review_detailed_main": "One year after Bastian Bux's (Jason James Richter) last trip to Fantasia, Bastian's father Barney (Kevin McNulty) has now married Jane (Tracey Ellis) who has with her a daughter, Nicole (Melody Kay), from a previous marriage who carries barely concealed disdain for Barney and Bastian. As Bastian enrolls in a new school, he runs afoul of a gang of bullies known as The Nasties lead by Slip (Jack Black) who immediately start victimizing Bastian which only escalates once Bastian has them expelled. Seeking refuge from the group in the school Library, Bastian meets up with Mr. Korreander (Freddie Jones) who still possesses The Neverending Story. As a last resort Bastian uses the Neverending Story to escape the Nasties into Fantasia where a strange force called The Nasty is slowly overtaking the land and its inhabitants. The Nasties take control of The Neverending Story and start wreaking havoc upon Fantasia and plans are further complicated when Bastian accidently brings several Fantasians into his world.\n\nThe Neverending Story III is the third film in the film series based on the novel The Neverending Story by Michael Ende, but unlike the first or second one, this is not based on Ende's writing and is instead an original story based on the characters from the book. While the second film saw a noticeable decline in critical reception and gross from the previous entry, it still made $50 million against a $25 million budget, and thanks to strong home video sales this persuaded the producers to make a third entry in the series. Unlike the prior two films, the producers had completely free reign from Michael Ende and were the driving force behind the film which they specifically tailored towards the American Market after the prior two entries struggled to gain much of a foothold which lead to the casting of Jason James Richter hoping his association with the Free Willy films would be a selling point. Once again more a product of the producers than the writers or directors with director Peter MacDonald barred from the editing room, the film was sold to Miramax at the American Film Market and sat on a shelf not being released until going straight to video in 1997 three years after the film had underperformed elsewhere (rather ironic given how it was tailored to the American market). Critical and fan reception to the film was overwhelmingly negative and the film has a place in history as one of the worst sequels and films ever made and I'm inclined to agree on both fronts.\n\nWhile Neverending Story II featured an absolutely stupid rendition of Bastian who was terribly written on every level, there were still some parts of both the original novel and first film that were carried over and elevated the film to a point where it was mediocre but not without some points of ambition (in spite of how bad and forced the writing was). With Neverending Story 3 pretty much every problem that was introduced in the second one is magnified 10 fold with all the original charm gone and replaced with the most soulless and empty of pandering that feels like the product of several of the worst meetings at the worst board rooms chasing the worst trends of the 90s. The film has no interest in exploring any of the themes of the original film (or even the watered down version of the second one) and instead is built around stupid comedy revolving around Bastian's bumbling, his obnoxious step-sister Nicole, The Nasties who feel like soulless rehashes of Power Rangers' Bulk & Skull (though to Jack Black's credit he's trying), and a sloppy disjointed screenplay that doesn't have any semblance of continuity with the first two films or even works in a self-contained manner as it's filled with plot holes and character contrivances that pile upon themselves and become worse and worse as the movie progresses. The movie's performances are amped up with lots of tired mugging, one liners, and pop cultural references (another symptom of studios copying that damn Genie from Aladdin even if it doesn't fit) and it results in a film that's a maelstrom of annoyance that will test the patience of even the most tolerant of individuals.\n\nI hate this movie and there's so much here that does not work on any level that the nicest thing I can say about it is that at least it feels like a \"complete\" product unlike the worst film I've ever seen, Nukie, which at least had the excuse running out of money and having to fix some unacceptable parts of the original cut. This was the creative effort of producers who think their audience is stupid and have no problem showing their contempt by releasing such substandard material. One can only imagine what would've come afterward if heaven forbid this was a success and we got a Neverending Story 4."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "kosmasp",
        "review_rating": "4",
        "review_title": "B(l)ack again",
        "review_detailed_main": "Who knew, that Jack Black was in this? Well I reckon those who had watched it and remember of course. Now we get new actors again - in the same roles/characters. But the father seems to move and so is the audience. Well we are supposed to. This is quite the mess - and while small children may find redeemable comedy in it, overall this never achieves any heights the second movie had, never mind the first one.\n\nSo if you can get behind a story that is so simple and characters doing terrible things for no apparent reason and cliches abound ... well do I need to tell more? Still the flavor of the Never Ending Story does a bit of magic (no pun intended) and the puppet work still works ..."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "TheDvDFan",
        "review_rating": "",
        "review_title": "What were they thinking???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ab-2",
        "review_rating": "5",
        "review_title": "The worst of the series no doubt",
        "review_detailed_main": "Usually when a movie goes into its thrid sequel the second and this one stunk but there are a few exception (ex. Evil Dead, Indiana Jones, Star Wars etc). This is definitly not one of the examples. The thing that ticked me off most about this film was the childish humor it was going for. I admit at laughed at some of it, but then it got really annoying. Also what did they do to Falkor, they totally changed his physical appearance not to mention the way he acts. And if this movie was supposed to be based on the characters where was the main character Atreyu? Overall a big disappointmeant. See it just for Jack Black who is hilarious.\n\n5/10"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "davidsalter-43786",
        "review_rating": "10",
        "review_title": "Absolutely amazing",
        "review_detailed_main": "Best film I've ever seen, definitely way better then the first, number one was so boring I felt asleep, but number 3 is nothing short of a masterpiece with amazing cgi and special effects that would give modern films a run for their money.\n\nFalkor was a huge improvement in this film, he was so lame and boring in the first.\n\nThe sexaul tention baston and his step sister is intense\n\nAnd the character development of rockbiter and meeting his family was simply fantastic, making the carat her seem less one dimensionable. Can't wait for number 4."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "geekgirl101",
        "review_rating": "1",
        "review_title": "Terrible, just terrible",
        "review_detailed_main": "The first movie wasn't too bad, the second movie was not as good, this one is just plain awful.\n\nLet's start out with the villains. They have a level of retardedness as in a lot of children's' movies where they crash into each other a lot and can't keep control of their limbs on every corner as if they're running on ice.\n\nMany of the characters that were in the original have had their looks and personalities changed, even some have had their names changed, and there's many inconsistencies. Where's Atreyu? And Bastions' family has for some reason changed from having a dead mother to a dead father. Even the cover for The Neverending Story book has changed and is much thinner than it used to be.\n\nThe puppetry looks ridiculous and the costume design has the same cheese factor as the early episodes of The Power Rangers. Falcor is no longer the wise luck dragon we remember but is now a clueless abomination that looks stoned. Rock Biter has somehow shrunk from being the size of a 3-story house to the size of a door.\n\nI couldn't watch this movie all the way through. It was poorly scripted, poorly acted, the costumes were poorly designed, and the whole movie in general was just plain stupid and dumb and totally destroyed the magic.\n\nI'm not surprised that Warner Bros. decided against distributing this, after watching it themselves they probably wanted to gouge their eyes out and have themselves hit on the head with a baseball bat to give them amnesia to forget what they saw and never have to see ever again."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Skywalker1974",
        "review_rating": "",
        "review_title": "Terrible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "theninja",
        "review_rating": "1",
        "review_title": "Hey did anybody else notice this movie sux?",
        "review_detailed_main": "Let me just say that I never had any intention of seeing this film. Ever. I have only tried to watch it (tried and failed!) because I bought the Trilogy on DVD, being that it was only a few bucks dearer than buying just the first movie by itself, and it came in a nicer box.\n\nPlus, I thought it was a novelty to be able to see Moya Brady in a film (any fans of \"The Bill\" would know her as Robbie Cryer), and there was the added bonus of Jack Black as well.\n\nI had extremely low expectations of this film, and I must say, I was still shocked at how bad it was.\n\nWorst. Movie. Ever.\n\nThis film should have NEVER BEEN MADE. Especially since the second film in the trilogy was such a huge disappointment.\n\nI find it an absolute insult to the original film, the book, and Michael Ende that this rubbish shares the name \"The NeverEnding Story\".\n\nThe character of Falcor has been murdered beyond recognition. This was the part that made me really angry, and that really made this a waste of film. Same for Rockbiter. Their appearances were not even accurate, let alone their voices, and Falcor seemed to be a stupid, bumbling fool of a thing. Nothing at all like the Falcor we all loved in the original movie. PATHETIC to say the least.\n\nYet another new cast means that the characters have changed yet again since the second film. Something which I find completely unacceptable. If they insisted on making a 3rd movie after they couldn't get the 2nd one right, then they should have at least kept Jonathan Brandis as Bastian. At least then there would be a shred of continuity (something which is non-existent in this film).\n\nThis has to be one of the biggest wastes of film, money and time in the world. I can't think of a worse film that I have seen (except maybe \"Freddy Got Fingered\" - that's definitely worse).\n\nI'll say it again. This film should have never been made. And that's a fact. If you haven't seen this movie, DON'T EVEN BOTHER. I have it on DVD, and I will not even be watching the ending. It's JUST THAT BAD.\n\n1 out of 10 (What an absolute stinker! Movies like this ruin careers!)"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "siderite",
        "review_rating": "2",
        "review_title": "Oh, god, what a rip off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "FiendishDramaturgy",
        "review_rating": "2",
        "review_title": "I wanted to love it, but I can't even like it.",
        "review_detailed_main": "One of the main reasons this installment tanked is that it depends entirely on the second installment to bear it up. The problem with that is that the second installment was horrendous, so anything at all that depends upon it can not possibly be great. It could be better, but it can't be great.\n\nThis isn't even better. I don't know if it's because the movie feels and runs like they spent a grand total of twelve minutes in development, or if each and every individual element is inferior (if that's even possible) to the second installment.\n\nEither way, it's not worth my time to figure it out, it's just that bad, but if you happened to be among the two or three people who liked the second installment, the third is necessary to fill in the numerous plot holes.\n\nIt rates a 2.4/10 from...\n\nthe Fiend :."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ss_xfp",
        "review_rating": "1",
        "review_title": "Where's a gun? I need to shoot myself after watching this...!",
        "review_detailed_main": "And I thought Troll 2 was the worst! Now, whenever I hear, \"Nilbog is spelled 'Goblin' backwards! This is their kingdom!\" I will praise the coming of the Lord. However, with sequels like this movie (and it does NOT matter that it was a sequel), it has officially been proved that moldy water-smelling garbage can be fed to you by a movie producer who swears on his children's' lives it's Superman ice cream. Not even the awesome Jack Black could save it!\n\nI was kinda hoping my computer would blow up right as the movie started! This movie did not satisfy my craving for something exciting or imaginative. All it did was make me want to start drinking to excess and run into heavy traffic! I feel... I feel like I want to hurt something now... Like a small animal... Not only did this movie fuel a rage and hatred far beyond that of the movie 'Blue Demon,' but it also proves that God does not exist...!\n\nDON'T WATCH THIS MOVIE, FOR GODSAKES!!! UNSUSPECTING, GOOD-NATURED PEOPLE WERE NOT MEANT TO BE TORTURED IN SUCH INHUMANE WAYS!!! WHERE'S THE GUN??? I NEED TO SHOOT MYSELF AFTER WATCHING THIS!!!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ljusalv",
        "review_rating": "1",
        "review_title": "Why did they ever make it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "one9eighty",
        "review_rating": "1",
        "review_title": "This is what happens when you a flog an idea to death and the director smokes crack (unconfirmed but possibly)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "mark.waltz",
        "review_rating": "2",
        "review_title": "One step below ripe, which means rotten.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "demelzawinters",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "I got to say that I am a huge fan of The Neverending Story movie. I enjoyed the first film and it brings back my childhood. Then the second film? I loved it as well. This third one? Why the bad ratings? I freaking loved it to be honest. And the mini series? Yeah I loved it as well. I guess not everyone is a huge fan of all but I am a true fan. Anything that has to do with the whole thing I will love it just because it's an amazing films. Who cares about the ratings? I don't. If anyone tells me not to waste my time watching it I'm ignoring them cause I will watch them again and will love it. I'm going to get all my friends and family to watch all the films as well."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "mlewando22",
        "review_rating": "1",
        "review_title": "Pure Garbage",
        "review_detailed_main": "Unwatchable, terrible piece of garbage. This makes The Karate Dog look like a gem. So lame, so poor... Born to be BAD! Do not watch this. A pure waste of time. Terrible dialog. Terrible gags. There is nothing to write about this. Ugly chicks. I hate this movie. Unwatchable, terrible piece of garbage. This makes The Karate Dog look like a gem. So lame, so poor... Born to be BAD! Do not watch this. A pure waste of time. Terrible dialog. Terrible gags. There is nothing to write about this. Ugly chicks. I hate this movie.Unwatchable, terrible piece of garbage. This makes The Karate Dog look like a gem. So lame, so poor... Born to be BAD! Do not watch this. A pure waste of time. Terrible dialog. Terrible gags. There is nothing to write about this. Ugly chicks. I hate this movie."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Sylviastel",
        "review_rating": "",
        "review_title": "Only Jack Black is Worth Watching!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "filipemanuelneto",
        "review_rating": "3",
        "review_title": "Only comedy redeems this film.",
        "review_detailed_main": "There is no two without three, people used to say. And the third film in the \"NeverEnding Story\" trilogy is surely the most unpopular and disagreeable of all. And I can see the reason: it almost becomes an insult to admirers of the first film.\n\nIn this film, Bastian is a preteen who moves with his father to a new home, where he goes to live with a stepmother and her daughter from a first marriage. In addition to the new family and the new city, he will have to go to a new school where there are much older students. And one group in particular, the Nasties, will dedicate themselves to making his life a real hell. Coincidentally (one of those that only happens in films), the school librarian is Koreander, the bibliophile. And of course, the book \"The NeverEnding Story\" is there. Providential! Bastian flees to Fantasia as if the book were a magical portal. There he finds the Empress, now a marriageable beauty, but unfortunately for everyone the book is in the hands of the Nasties, who soon realize their potential and begin to destroy Fantasia. It is up to Bastian to recover the book and restore order, if in the middle of the process he is also able to recover the Auryn, which his new sister will use to get all the clothes she always wanted.\n\nThe film is a total stupidity if we think of the two predecessors: the whole concept involving the original story (the power of imagination, creativity, the value of reading) is perverted to create a film where fantastic beings enter and leave our world and, by taking a book, we can fall into a surreal and fantastic world. That was the worst thing in the movie. In the other films, the trip to Fantasia was mental and worked better as such since it was something more in line with the film's message: the importance that people should give to reading, creativity and the use of imagination. Despite this, the film is not even so bad if we forget the previous ones. And that is due to one factor: it is effective in comedy. In fact, there are enough comedic moments to be able to swallow it, if we don't take it seriously. The dialogues have many witty strips that sound funny and a lot of effective situational comedy, making the film more palatable than we would expect.\n\nThe cast has a very recognizable name that we could even think that signed the contract by mistake: Jack Black always assumed himself as a fan of the first film and must have been excited about the project, which justifies why he never wanted to talk about this film again. I would also feel betrayed in my expectations. Even so, he performed well and did a positive job as an actor. Jason Richter was good enough as Bastian and pretty Julie Cox was a decent Empress, but there's no decent material for them, and he just runs around like a fireman, running away or to trying to find this and theirs, as she watches everything on \"television\". Melody Kay was not up to the challenge and is irritating, as are the parents. Freddie Jones was uninteresting, having been happier in the role of Old Man than in the role of Koreander, who is over the top and is just a hook to bring the book to Bastian. The group of villains is cliché and uninteresting, more boring than really intimidating.\n\nTechnically, the film is a shadow when compared to the two predecessors and is guided by a Franciscan poverty regarding the technical aspects: an uninteresting cinematography and washed colors does not appeal to the visual beauty, and the bad scenarios and terrible CGI made Fantasia the fantastic world more depressing of cinema. The effects also add little beauty to the film and the costumes are not convincing. Worst of all, however, was the poor conception of magical creatures, which never looked so artificial and ugly as before: dwarves are so interesting that they literally spend most of the film in a cardboard box, while the son of Rock Biter is simply nauseating and it is clear that it is made of foam. Regarding the sound, we have bad sound effects, horrible incidental music and a soundtrack that is almost nonexistent and where a very ugly version of the famous song \"Born To Be Wild\" reigns, totally without purpose."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "nbutcher-69458",
        "review_rating": "2",
        "review_title": "A textbook example of how NOT to make a sequel",
        "review_detailed_main": "The NeverEnding Story III would be bad enough as a standalone film. Given it's a sequel to a beloved classic film - it's crime against motion picture productions is particularly egregious.\n\nThe NES3 makes a mockery of the lore and characters proceeding it. The acting is atrocious and goofy and full of cringey dialogue. Many scenes are stupid. The story makes no sense and completely lacks any of the profound metaphor the original did. Worse of all, the movie can't seem to get itself to Fantasia. It's stuck in a \"saved by the bell\" school drama with school bullies.\n\nThe music is uninspired, and don't even get me started on the \"born to be wild\" final scene of the movie.\n\nThis movie doesn't deserve to exist. It only has value is in being a warning to any writers and directors who deign to work on a sequel to a successful property that they had nothing to do with."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "tequila101",
        "review_rating": "4",
        "review_title": "The Fun is played out Well, but it still doesn't hold well and in the end it becomes a major disappointment",
        "review_detailed_main": "Once upoun a time there was a legendary tale like the Dark Crystal called the Never ending Story which is adventurous, fun and has many fantasy elements to enjoy.\n\nThen there was a mess of a sequel and now fours years after that messy muck, we have another ridiculous sequel, the Neverending Story III.\n\nIt was getting good at the start and then 5 minutes later, towards the end it just felt like a funny, doo film and in this film especially, all the magic has died.\n\nThe acting is still up to scratch which is good but director shame on you for destroying their talents. There are many things which bring this film down and it is a shame that they actually tried to be like the first one, e.g Rock biter's bike.\n\nI'll go through many weakness of this film: - The Bastian character is really weak, annoying, irritating and comes up with the most stupidest accuses ever e.g. when the elves are in the box, he says the parrot I brought, for gosh's sake the bird would have been dead in 2 hours or less.\n\n\n\n\n\n\n\nThe only good things about this film is the (NOT ALL OF them) funny moments. Jack Black does a great job but that ain't enough and even that Tree Branch is weird.\n\nI'd only watch this if I'm bored but that will hardly be ever.... It's a good film for kids from ages 4-7 and that's it.\n\nLike the Never Ending Story 2, I really tried to like this but it ain't enough, the magic is gone like I've said, even some of the dialogue is stupid.\n\n4/10"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "warthogcc",
        "review_rating": "1",
        "review_title": "The 2nd sequel is an insult to the original storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "mr_waterfall",
        "review_rating": "1",
        "review_title": "What am i watching.",
        "review_detailed_main": "To me it looks like the writers and directors were tripping on acid. When made this Falcor or so spelled what is he? I mean really? He looks like a dog, or a big anirexic or so spelled dog, tripped on acid, and in Zoobiezoo. I couldn't bare watching 10 mins of this, then i saw trailer and saw Falcor and was like what what what! They must be on acid, mushroom or psp. People trash the 2nd i love the 2nd one if or not better than the 1st. Jonathan Brandis i always liked that character. Sadly he died. But what the heck was this 3rd one. I mean really. Cheap or not, i mean wow. They were clearly on something."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Some-asshole",
        "review_rating": "1",
        "review_title": "The Neverending Story 3 is ONE OF THE WORST FILMS OF ALL TIME.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "imp-6",
        "review_rating": "5",
        "review_title": "watch for loyalty and curiosity if you saw the other two",
        "review_detailed_main": "It is not bad but surely not good. Effects are middling; acting as required; silly as it integrates a modern school day with 30 year old bullies and Fantasia. Doesn't work well. If you are loyal to the series, you should see it. It is better than pulling weeds out of the garden."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Laura B-2",
        "review_rating": "10",
        "review_title": "A Must See!!!!!",
        "review_detailed_main": "I've seen the first two NeverEnding Story movies, but none of them have a script like the third one! This is the most down to earth NES of all, not to mention the great cast! Ryan Bollman is TERRIFIC!!!!!!!! This is a great movie, trust me! Go out and rent it tonight!!!!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "blacklily-c",
        "review_rating": "3",
        "review_title": "Early bad memory",
        "review_detailed_main": "My - let's see, I would have been in - fourth grade teacher showed us this movie soon after it came out on video. We couldn't exactly decide for ourselves whether or not we wanted to watch it, but most of us were fairly enthusiastic, since movies have to be much better than taking notes and listening to Teacher.\n\nNot this one.\n\nI can't really speak for more than myself and the five people closest to me, but if we were representative, 5/6 of the class was catatonic before the movie was finished.\n\nWe were ten years old. Every movie that interrupted class without being itself educational was absolutely fascinating. And yet, NESIII failed us.\n\nI can still hear Heather's voice clearly: \"Wasn't that the STUPIDEST movie?!\""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "A poor film on so many levels",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "x46589",
        "review_rating": "1",
        "review_title": "Awful doesn't even come close",
        "review_detailed_main": "This poor excuse for a film makes me sick to my stomach...it doesn't even pass off as a quality children's film; it simply confuses the hell out of them and scares them. Don't ever rent this movie, even better, if you see it in the store, drop it in the garbage when the clerk or the security camera isn't looking. If they catch you, I don't think they'll really care anyway."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "bluzman",
        "review_rating": "2",
        "review_title": "This story must end",
        "review_detailed_main": "The first movie was such a wonderful movie, like the Princess Bride, for example. The characters were real in a fantasy sorta way. You could relate to them and the mission. The second movie was a horrible, anemic shadow of the original on a sub-level only rival by Lawnmower Man II (Jobe's War)as opposed to the original. My only thought as to why anyone would make a third installment of this movie after the second one was to prove to the critics that things can always get worse, which is to say that the second looks pretty good compared to this...how is that for damning with faint praise? The director, creators, producers and such of this movie should be banned from touching another camera or even going to the movies in the future."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "TheGreenSaga",
        "review_rating": "2",
        "review_title": "This movie gets a 2 only because it has the words \"Neverending Story\" in the title",
        "review_detailed_main": "I would have given this movie a 1, if not for the fact that is has something to do with The Neverending Story. That alone is points. Unfortunately, this movie had not other points.\n\nIt is silly, overacted at times, and underacted at others. The story and the way it's played out insult even the youngest viewer's intelligence.\n\nHmmm... well, I would say Jack Black's presence alone might boost it up to a 3, but then again I'm embarrassed he was here. As a matter of fact, I'm embarrassed this movie has the title it does. So here's my new breakdown for this god-awful piece of crap: 1 point is the minimum, and then a half-point for being a Neverending Story movie, and another half-point for having Jack Black in it."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "SithApprentice",
        "review_rating": "2",
        "review_title": "Another crappy sequel",
        "review_detailed_main": "I admit that the first part of the \"Neverending Story\" saga ranks as one of my favorite fantasy movies, because it just had everything you need for a good fantasy flick: beautiful sets, good actors, a great story, and most importantly, you could actually feel the magic of movie-making in almost every scene. \"Neverending Story II\" was a bit of a letdown, but still an enjoyable flick. And then we got this terrible piece of garbage, called \"Neverending Story III\". It's always a difficult task to make a sequel to a good and successful movie; so producing a third part is even more complicated. Still, there are some great Part IIIs, like Star Wars Episode VI: Return of the Jedi (part 3 of the OT), Star Wars Episode III: Revenge of the Sith (part 3 of the PT), Indiana Jones & the Last Crusade or Back to the Future III. They all succeed by staying true to the original movie's formula, having the same main actors, cleverly introducing new characters or expanding the storyline of the forerunners (and by having a big budget, by the way). Unfortunately, does neither of the things mentioned above. Because I don't want to say too much about this disgraceful sequel, only a small rundown of why it sucks so bad: 1. The setting was changed. The story now takes place in the real world, no longer in Fantasia. That's a good idea, but it simply doesn't work at all, mainly because of the interaction of the Fantasia-characters with the real world (what's with the Rock Biter singing \"Born to be Wild\"? Or a fantasy character mentioning Las Vegas? How do they know that stuff? Doesn't make sense at all. 2. The movie is unbelievably silly. I just say Rock Biter family...what a terrible scene. 3. The personality of some characters has changed. That's especially bad with the childlike Empress. She's no longer childlike, kind, smart, caring and lovable, but a snobby teenager. 4. The movie was made cooler, or at least it was supposed to be cooler, for example by introducing the (incredibly dumb) Nasties and the above mentioned \"Born to be Wild\" thing. 5. The actors are simply terrible, neither of them is convincing or even has potential (except for Jack Black). 6. The visual effects are truly horrible, even the first part looks way better. But that might be because of the rather low budget. Still, the way the fantasy characters are created and presented in this one is embarrassing, just look at Falcor or the Rock Biter (did he shrink since part 1?) 7. The most cruel thing: Atreyu is missing, for no apparent reason. So one of the most popular and beloved characters is simply wasted. Normally, you don't throw away interesting characters like him in any movie series. It's a crime he was missing. If you're a fan of the book and the first (or even the second) flick, then avoid this stinker at all costs. Simply watching it could make you cry, because it destroys it's forerunners legacy. Pure and utter garbage."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "black_rose11",
        "review_rating": "1",
        "review_title": "why did they do this one",
        "review_detailed_main": "I have watched the other two and well all i can say is number one is the best,did they pay attention to the first one at all i mean this is so bad,my own children wouldn't even sit and watch this they turned away quick.This didn't put me or anyone i know in the fantasy world at all,if you have seen the first one then i have a feeling you will be very disappointed with this indeed.Falcor didn't even look look the same in fact it was a big let down to the one in the first one,they could have made the story line better that would have at least been something.well when i watched this movie i was so bored and well i wont be watching it again,i was not impressed in the least and well if your thinking of watching it then you need your head testing.Being honest don't waist your time."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Avwillfan89",
        "review_rating": "1",
        "review_title": "Witness the death of Fantasia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "anxietyresister",
        "review_rating": "3",
        "review_title": "Third time isn't the charm..",
        "review_detailed_main": "Where to start? Which is worse, the complete demolition of the history set up by the previous films? The totally inappropriate pop music heard throughout in a vain attempt to connect with a modern audience? The makeover given to all the characters which strips Falkor of all his former majesty, and turns the Rock Biter into a costumed freak? The dreadful, completely stupid voiceovers given to the above? The unfunny modern jokes about Arnie and runways that the citizens of Fantasia could not possibly know about? Perhaps the poor performances of the parents of our hero Bastian, probably the most unconvincing screen couple ever with their extremely fake squabbling? Or maybe the whole mall sequence, which is so badly directed and scripted it will have you screaming \"WHAT THE HELL?!\" at the top of your voice in front of the television? (Be careful not to disturb the neighbours..)\n\nYes, those are all worthy winners, but for my money what really takes the cake in this debacle is THAT DAMN ROCK BABY. Honestly, everything about it, from that cutesy way it repeats it's one word sentences, to it's ugly features as it wanders around getting in everyone's way, makes me just wanna grab a pneumatic drill and turn the little git into rubble. A pathetic attempt to pander to children, this grotesque creation is NOT funny, NOT cute and is even more annoying than it was when it was introduced in part 2 of this trilogy. Mind you, the other new additions to the cast, like those two chattering dwarfs and the tree creature, aren't particularly endearing either. They are pointless, badly thought out and totally unnecessary.. a bit like the whole film, really.\n\nJack Black has fun in an early role as one of the Nasties (what kind of a name for a high school clique is that?) and the actress who plays Bastian's stepsister is quite charming (if a slightly amateurish thespian) but we're a long way from the superb original here. The series has now degenerated into a knockabout farce for the kids. Except, they won't enjoy it either. With classic fantasies like Harry Potter and Lord Of The Rings waiting on the video shelf for them, why would they want to dwindle their time on this twaddle for? I'll leave the final word to the new, impostor Falkor who says just before the credits roll: \"Ooo this is my favourite part!!\" Mine too, mate, mine too.. 3/10"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "naughty-gurl-11",
        "review_rating": "10",
        "review_title": "Great Great Great JOB!!!!!!!!!!",
        "review_detailed_main": "Oh my god I love this movie soo much even though its 13 years old. I to be honest I don't really like watching movies that are older, But I love this movie soo much because I think its a very good movie also the story is great, the actors are amazing, I think the little boy who played in it did such an amazing job. I also think that he was the right actor to play in it because I don't know I just think that he was the right one to play in this kind of movie. Ohh and also I love the song too because It represent the movie. I just love that movie I think it's a very good movie. I mean who wouldn't like it everybody likes it in my family small kids, teenagers, and adult too. Most of my friends think that it's for little kids. I don't really give a crab what they say or if they like it or no because I like it and thats what matters to me. u know what to be honest i don't think it's a kid movie because if it would be s kid movie for example \"franklin\" no adults or teenagers would like it, and obviously they don't. Me and My whole family were upsest with that movie when we first saw it. We would watch it every single day and over and over again and never get tired of it. I can't say more than it's such an amazing great entertaining cool movie. I just love it soo much. This is the only old movie I love. I watched it since I was like 5 or 6 years old and I still watch it now sometimes. I'll never get tired of watching it. Now my little sisters watch it too and they love it. They always bother me to put it on for them. haha... I think its such a great movie not only because of the actors but mostly because of the director Peter Macdonald and also because of the people who wrote the credits. Greate job!!!!!!!!! One more time I LOVE IT!!!!!!!:))))))"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "johnng45",
        "review_rating": "5",
        "review_title": "It wasn't a good movie !",
        "review_detailed_main": "I like the first one & the 2nd one.They can be one of my fav movies :-).I gave it 5/10 because Jason James Richter was in this movie and he's a capable actor. The reality's it's not a good movie. The movie seems weird & Creepy & the magic disappeared. It lacks a lot of works.Just some bad students did stupid things to kill Jason.I don't like these guys very much. They are so stupid.By the way, may be filmaker made this for $. It's not a bad movie,but if i'm peter,i'd not like to make this one. If people like to see some Magical movies,you'd better see Neverending story ,II ,Bogus & Home alone.If people don't like this movie, please skip it."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "grass_fairy",
        "review_rating": "",
        "review_title": "This movie gives the NeverEnding Story a bad name!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "LukeGuitarGuy",
        "review_rating": "2",
        "review_title": "Entertainingly bad film...makes the 2nd look like a classic!",
        "review_detailed_main": "I think I'm the only person who has seen this twice. It's so bizarre in it's badness that I felt compelled to make someone else watch it with me. First off, the title is all wrong, the basic plot does not involve an escape FROM Fantasia. Points off. Second, the villain is ridiculous. The first film in the \"series\" had The Nothing, Part II had The Emptiness, but this film is left with The Nasty. The Nasty is a much less formidable and threatening enemy. Third, this movie disrupts itself with so many out of place scenes that really hurt the tone of the film. Moment of Truth: The Rockbiter, while riding on his rocky tricycle, sings a cover of Steppenwolf's \"Born to be Wild\" too octaves lower than the original. Ouch. Combine those things with overall poor acting, dialogue, and total lack of budget for sets and effects and such, and you are left with a hysterically awful film."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "jenluv90",
        "review_rating": "1",
        "review_title": "What a Disappointment!",
        "review_detailed_main": "This was probably one of the most worst acted, poorly written and childish movies that I have ever seen. Even when I was 7 I thought this movie totally sucked! It is a disgrace and should rename itself and not be connected in any way to the other NES movies. The first Neverending Story was beautiful, beautiful graphics, acting, plot and characters. The second one was okay, but not as compelling as the first. Acting was good by the kid who played Bastian and Atrayu. This third movie completely cut off Atrayu and made Fantasia look like a piece of garbage. Rock Biter and Rock Baby were totally unrealistic and the plot line sucked. Jason James Richter's performance in this movie was a disgrace. I wish they would have used the same actors, but hey we all have to grow up, but come on this kid had no resemblence whatsoever to the first Bastian and for that matter the second... Come on people.. This movie was HORRIBLE!!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "g-dude",
        "review_rating": "1",
        "review_title": "A disgrace",
        "review_detailed_main": "my question is: why?\n\nWhy not make a movie that compleates the other half of the book (sorry, number 2 did diddly for the book, but the first covered maybe the first half with the Nothing and Gmork and all)?\n\nWhy make Rock Biter wear clothes and have a son and a wife (although juinor was in #2)\n\nAlso, WHY CHANGE FALKOR?!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "David-234",
        "review_rating": "1",
        "review_title": "It's an all right movie",
        "review_detailed_main": "I don't understand why this movie was such a low budget movie that they had to shrink the characters specially Rock Biter. Wasn't Rock Biter, a bigger giant in the first two movies?\n\nAnd why did a different movie company Miramax, release it instead of Warner Bro's who released the first two movies. This movie didn't capture the magic of the first two movies."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ADOZER200",
        "review_rating": "1",
        "review_title": "Lord have mercy on my soul",
        "review_detailed_main": "This is by far one of the worst if not the worst movie i have ever seen. It saddens me today that the sequels they are making are the worst movies in movie history. really cant understand why movies are made the way they are made now. People suck at making movies now. Every now and then you see a movie that has great potential. Plot lines dont even exist anymore, the use of CGI is too extreme, and actors try to hard now...lets face it. Movies will only worsen. The only reason why people have sequels is to squeeze ever last penny out of the movies gross. This is a good example of how movies shouldnt be made. I was actually ashamed to be watching a movie so stupid."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "r96sk",
        "review_rating": "5",
        "review_title": "Barely resembles the ace original and doesn't even feel that similar to the average 1990 sequel.",
        "review_detailed_main": "This probably merits a lower rating. To be honest, though, it didn't bore me as much as it should have.\n\n'The NeverEnding Story III' is a mess, in short. It barely resembles the ace original and doesn't even feel that similar to the average 1990 sequel. The story is all over the place and doesn't hold any sorta magical feel, with it more being a 'fish out of water' sorta movie.\n\nStill, it went by quickly enough for me to avoid leaving a negative taste. It's a bad movie, no doubt, but is more watchable than it ought to be. The cast do alright. I was not expecting to see Jack Black appear, even with the name in the opening credits I kinda still thought it'd be a namesake - but no, Mr. Black is indeed in this (his fourth movie!) and is OK.\n\nElsewhere, Jason James Richter is decent, I don't have any issues with the actor directly - just the writing etc. For his character. Away from him, the voices are a further downgrade when compared to the preceding entries; though Kaefan Shaw is almost good. Tony Robinson, who I know more of as a television presenter here in the UK, is possibly the standout of the cast as Engywook.\n\nThis film also ruins the Rockbiter character(s), however that scene of them travelling to \"Born to Be Wild\" is actually minorly amusing - the only scene of the movie that comes close to being entertaining. Overall, this trilogy shouldn't exist given that first film is an obvious one and done thing. Oh well!"
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "VanillaLimeCoke",
        "review_rating": "5",
        "review_title": "It's not great, but c'mon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "brittanytgoble",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": "This was one of my favorite movies growing up and continues to be one of my favorites. I thought it was funny and cute. I'm not sure why there is so much hate around this one. It is a lot different than the first two but I still loved it."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Cawgirl01",
        "review_rating": "2",
        "review_title": "I Can't Believe My Eyes",
        "review_detailed_main": "I happened to be flipping through stations last night and I came across the last hour or so of this \"movie\". All I have to say is: Thank god I didn't watch the whole thing!! I would be afraid that I would have to gouge out my eyeballs. No, seriously this movie is terrible. The acting, the script, just everything was terrible! Well, Jack Black was a little bit funny. I don't need to compare this to the first two movies to know that this one stunk! I gave it 2/10 only because I felt like being generous."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Gmork-2",
        "review_rating": "",
        "review_title": "THIS FILM IS MISSING THE MAGIC THE SERIES EVER HAD.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Camelot_2000",
        "review_rating": "2",
        "review_title": "Stretching The NeverEnding Story Into A 3rd Film Was A Big Mistake",
        "review_detailed_main": "The very first film from 1984 was visually stunning and of good quality with a memorable title tune. The quality sunk a bit with the sequel, The NeverEnding Story II: The Next Chapter and then things get worse with this 3rd trip to Fantasia.\n\nThe whole thing looks cheap and comes nowhere close to what the very first two films offered. It's bottom-of-the-barrel filmmaking with a focus placed on the real world this time (to obviously fit the low budget). Jason James Richter is okay as Bastian Bux though he stumbles through the whole story with uncertainty and acts lost for most of the time. He's never sure of what he should do next.\n\nHis new stepsister turns out to be a resentful brat with a sour attitude while his meek new stepmother constantly acts self-conscious about how to properly treat him. There's also a continuity error with Bastian's father who became aware of the magic book and Fantasia in the second film, but mysteriously doesn't know about it in this one.\n\nThe one character to really stand out though was Jack Black as the evil leader of 'The Nasties'. He really is a good actor and that's apparent in this film where he conveys a highly menacing presence bent on taking control of the magical powers of Fantasia for his own devious purposes.\n\nHe and his gang of misfits would've been better suited though in a post-apocalyptic thriller in the same vein as \"Mad Max\" instead of in this lame G-rated flick. They cause all sorts of mayhem here as school bullies and as possessors of the book of power, but the goal of what they're trying to accomplish out of all that isn't made clear. What other benefits could they have wanted out of the magic besides causing chaos? That's all they seemingly wanted to do.\n\nThe characters from Fantasia are also not up to standard. Falkor the dragon is depicted as dimwitted and goofy this time around while those two nagging gnomes are just apparently there for irritation purposes.\n\nThat mischievous Baby Rock is also downright annoying, but the Tree Man is bearable. They all accidentally get taken to the real world with Bastian and, wouldn't you know, Halloween conveniently happens so they could all pretend they're trick or treaters in costumes.\n\nIt's not surprising this film wasn't a very successful one. I recall seeing ONE quick preview on TV about its theatrical release in the 1990s and it did look quite good from that brief glimpse, but then it suddenly wasn't playing anymore. I can now see why it had a limited run.\n\nIt's no surprise that a NeverEnding Story IV hasn't appeared afterwards. This low grade installment and its subsequent failure is obviously the reason why. A fresh reboot of the series just might happen again someday though."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "MorbidMorgan",
        "review_rating": "4",
        "review_title": "It's Fantasia but not as you remember it...",
        "review_detailed_main": "Fans of The NeverEnding Story are likely to be disappointed by this third installment which differs completely from it's predecessors in turns of characterization and tone. Whilst the first sequel may not have lived up to some expectations, it did at least contain that same sense of wonder and fantastical charm that enriched the original. This third entry abandons our awe in favor of gags and goofs.\n\nBastian this time around is played by Jason James Richter of 'Free Willy' fame. His father has remarried and he has subsequently acquired a teenage step-sister. It's not long before Bastian and his extended family are caught up in Fantasia, his land of imagination. Particularly when a group of comical high school bullies, led by Jack Black, steal The NeverEnding Story book and create havoc in both Fantasia and our world.\n\nThe creature design this time is by the Jim Henson workshop. Sadly, their renditions of the inhabitants of Fantasia and indeed their personalities are inconsistent with the previous entries. For example, Falkor is reduced from being a noble and brave luck-dragon to a whiny and cowardly puppy dog. And this is what hurts the film the most. To the younger viewer it will be a mildly amusing affair, but to those who have followed the film series, it will appear to be a complete deviation that will have you aching for the Fantasia of old.\n\nThe actors all turn in good performances but you feel they would all be best served by a more earnest script that employed plot lines from Michael Ende's novel. Still, it's far superior to the live action television series that would later follow."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "erminahotmail",
        "review_rating": "4",
        "review_title": "the usual bad luck of number 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "nlk87",
        "review_rating": "3",
        "review_title": "Better than the other 2...",
        "review_detailed_main": "See I saw this (3rd installment) before 1 & 2. I loved this movie when I was little! Mainly because I knew Jason James Ritcher from the Free Willy films & I also saw Melody Kay in Camp Nowhere, so I was already acquainted with the 2 main characters. Plus that little song the stepsister sings about her father, I could relate. Now as an adult, & re-watching all 3, honestly none are good. & 1 & 2 certainly does NOT deserve ratings of 7 & 5 & the 3rd film getting a 3 rating.. 3rd film is WAY better than 1 & 2. I gave the 3rd film a 3/10 cause well my rating system is different from other people's reviews. For example over 1800 films that I've rated, more than half of those are rated 4/10. 4/10 means I enjoyed it & will re-watch it again someday. 3/10 means I really didn't care for it but perhaps 1 day I'll re-watch but I wouldn't recommend it to anyone. Now the 1st & 2nd movies I gave both of them 1/10 ratings. I get technology in the 80s were awful but the acting in those films were bad like the effects... Most of my ratings like I mentioned above are box office hits & I still gave them 4/10. For example: Avengers EndGame, Neighbors, Maleficent, Mr. & Mrs. Smith, etc.. Never have I ever rated anything 9 or 10/10. Nothing deserves ratings that high. The highest rating I've rated is 8/10 & out of 1,842 movies that I personally rated, only 14 titles did I give 8/10 rating. & 3 out of those 14 were tv series.."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "joanns-1",
        "review_rating": "10",
        "review_title": "Fantastic",
        "review_detailed_main": "You cannot judge a movie from the 80's & 90's and compare the special effects to today that is unfair. The Never Ending Story trilogy is and always will be fantastic... I wish they would make more of them.. My children enjoy them and their friends enjoy them and if you look at the age of my children and compare it to when I started watching them we are the same age. An adult might not enjoy it but the never ending story is a movie for children and for adults that are still children at heart. I would without hesitation recommend this movie to all my friends and family who are looking to watch a movie that is entertaining and those who enjoy fantasy movies would definitely enjoy these three movies. My only hope is that the writers of these stories would come up with another sequel with todays technology it would be a best seller in every country around the globe."
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Quiescence",
        "review_rating": "",
        "review_title": "Dissapointmentism",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Miklos7",
        "review_rating": "",
        "review_title": "This movie ended the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "RichardKleiner",
        "review_rating": "",
        "review_title": "There is no part III",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "random-somebody",
        "review_rating": "",
        "review_title": "I'm confused!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "ridley_64",
        "review_rating": "",
        "review_title": "Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Jordan-15",
        "review_rating": "",
        "review_title": "this movie should not have even existed!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "jtpaladin",
        "review_rating": "",
        "review_title": "The NeverEnding Tragedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "FatherMulcahyFan",
        "review_rating": "",
        "review_title": "As the British would say...bloody awful!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "TheFemaleCenobite",
        "review_rating": "",
        "review_title": "Pretty bad, but I've seen worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Al-174",
        "review_rating": "",
        "review_title": "I like the second one best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "Goon-2",
        "review_rating": "",
        "review_title": "aptly titled",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "JupiterAmy",
        "review_rating": "",
        "review_title": "Whoever is doing this, please, stop.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110647",
        "movie_name": "The NeverEnding Story III",
        "movie_rating": "3.2",
        "review_username": "SevenQueen",
        "review_rating": "",
        "review_title": "Painful",
        "review_detailed_main": ""
    }
]