[
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Fella_shibby",
        "review_rating": "7",
        "review_title": "Watch out for the aeroplane n bike scene. It will give Peter O'Brian from The Stabilizer sleepless nites.",
        "review_detailed_main": "Salman shooting villains as he slides backwards down a flight of stairs is amazeballs.\n\nRoger Moore's film Octopussy can boast of these stunts which were done decades before Ek Tha Tiger.\n\nMoore catches an aeroplane while riding a horse.\n\nMoore does a sliding on the rail of steps while shooting villains.\n\nI saw this for the first time recently n was pleasantly surprised. I had seen part 2 in theatre without watching this part.\n\nThe film has a different take on the spy genre with some good action but the parkour stuff is lousy.\n\nWe have people jumping from high heights n land straight on both feet without hurting ankles or any injuries. The film has some unnecessary n irritating slow mo stuff. It has some lovely locations.\n\nSalman shud have opted for weight loss n shud hav hired a good stylist. He is very overweight in this film n his baggy trousers outdated.\n\nThe film lacked fine editing."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "aaravpanti",
        "review_rating": "7",
        "review_title": "Good job Mr. Salman!",
        "review_detailed_main": "To start of with, I didn't like the previous 2 movies of Salman, viz. Ready and Bodyguard. But Ek tha Tiger for me, is a pleasant entertainer. Kabir Khan after 'Newyork' does a good job as a director again. Credit goes to him coz he makes Tiger a very charming character like Chulbul Pandey and Salman Khan executed it precisely.\n\nSalman is at his best, both in romance and action. Katrina looks gorgeous and has equal screen time. She has performed well. Both the leads are in the best costumes, specially in songs. Cinematography is top-notch. The screenplay works at a decent pace though some cinematic liberty has been taken in the storyline. I wasn't bored throughout. The action is excellent, thanks to stunt crew from Hollywood. Music is OK. Its one of the good films of Salman and a must watch."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "jhabrijeshbk",
        "review_rating": "6",
        "review_title": "Don't expect to be 'wow'ed just simple entertainment like a mediocre novel.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "jayflora",
        "review_rating": "6",
        "review_title": "Ek Tha Romance",
        "review_detailed_main": "The trailer is a bit misleading. The movie is showcased as a spy thriller/suspense sort of a movie with little love/romantic angle, so the viewer might expect a lot of action. But it turned out to be a love story and the whole movie revolves around it. Of whatever action there is, its because of two lovers trying to be together and not a spy trying to steal valuable information or anything. Its very well put together, and Katrina has acted well, loved her in this role and she looks like a charm considering she didn't use any makeup for this one. I went with 4 other guys, all of them were disappointed, I wasn't, I cant say its good, nor can say its bad, its a bit above average, hence 6.If the trailer showed Salman holding hands with katrina showing her the stars rather than him shooting people, and the intro line was something like \"Two lovers.......\" rather than \"RAW and ISI.............\", than people wouldn't have expected so much love/romance and wouldn't be disappointed. People found it slow since love/romance is slow, and a few would also have a problem seeing Salman in a much lighter shade as compared to boastful/salman focused movies like Dabangg/ready/bodyguard. Its definitely a one time watch, if its playing on TV, i'll watch it, not change the channel, it does strike a chord."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "jefflouvre-435-77367",
        "review_rating": "5",
        "review_title": "Salman finds love in a time of political tensions.",
        "review_detailed_main": "FASTER than Usain Bolt, more charming than Rudolph Valentino and able to leap from building rooftops gracefully.\n\nSalman Khan does these and more, including stripping off to show off his torso and wiggling his hips to dance music.\n\nHowever, his two most impressive feats are stopping a runaway electric tram with only his jacket, and becoming Evil Knievel to jump into an aircraft that's just taken off.\n\nSalman plays Indian spy Tiger, who's never taken a day off in 12 years and hasn't had time for romance.\n\nHis next assignment takes him to Ireland to keep an eye on a professor (Roshan Seth, who appeared in Indiana Jones and the Temple of Doom), who may be leaking missile secrets to Pakistan.\n\nHis first introduction to the professor's assistant, Zoya (Katrina Kaif), is by way of her lithe body and wiggly buttocks. Which tough guy could resist that?\n\nTo cut a long story short, Tiger falls for Zoya, who is revealed to be a Pakistani spy. The movie purports to show him killing her, but I knew that this flick wouldn't dare to portray our dear hero as a heartless killer.\n\nThe two run off together but not before triggering an international manhunt from the two countries. They attempt to lie low in Havana but those Cuban robbers just can't stay away from a handsome Indian couple.\n\nWhen Tiger's boss asks him why he ran off, he says that he's now choosing his heart over his mind. Dear viewers, this is an eye-opener.\n\nThe movie wants us to believe that love will conquer all and even makes a case that Romeo and Juliet will bring two spy agencies that hate each other to the table to tackle a common enemy.\n\nThis was my first Salman movie, and I must say that I was pleasantly surprised by his clownish antics, cute dialogue, non-stop roller-coaster action and his chemistry with Katrina. The final part must be because the two used to date each other.\n\nKatrina shows that she's no shrinking violet as her character beats the hell out of some baddies.\n\nI also liked the travelogue feel of the movie, which takes viewers to New Delhi, Ireland, Istanbul and Havana.\n\nThe dance scenes in Ireland and Cuba are colorful and full of verve, and they reflect the cultures of the countries. For example, there's a salsa beat to the music in Cuba. For this, credit goes to director Kabir Khan.\n\nHowever, the movie's interminable length, implausible action and cheesy love theme will get you down.\n\nLove transcends boundaries, but it can only get you so far with viewers.\n\n** Movie Magic With Jeff Lee (blogspot and Facebook)"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "payallgade",
        "review_rating": "7",
        "review_title": "Romantic Cake with ACTION topping!!!",
        "review_detailed_main": "Definitely a one time watch.... Watch it in theaters for: 1)All the action sequences(specially Kat in second half...it even beats the BOND series) 2)Mesmerizing Salman-Kat Chemistry....(Even they look awesome here :D ) 3)Few witty dialogs about Indo-Pak relations(Its from a common man's heart specially the one at the end) 4)Salman Salman and Salman....(\"kya TIGER!!!....TIGER to kutte ka naam hota hai..\") He portrays an extraordinary spy who's needs are as ordinary as our's(After long time he play a common guy)...Its all about sallu-kat romance and love with a strong flavor of action(Best part of movie)\n\nPlease don't search for following : 1)LOGIC 2)LOGIC 3)LOGIC Just don't expect logic or loads of twists...keep your brains out and enjoy the film!!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "callmeshaun",
        "review_rating": "1",
        "review_title": "Ridiculous Tiger whose mission was just a laughing stock",
        "review_detailed_main": "First of all the good side: 1) Different from Salman's signature films (BG, Ready, DBNG) 2) Decent Action (though usage of Body Double is very much visible) These are the two reasons why I have given a 2 star rating\n\nNow coming to the Negatives: 1. Kabir Khan wanted to juxtapose everything on top of nothing, as a result this effort is nothing but a damp squib 2. The script forcefully wanted to add a sensitive chapter which became just a laughing stock, basically 0 research on life of secret agents 3. There is nothing called Climax in the movie because Salman Khan finally has to succeed in any kind of chase, action etc. The final scene is utter non-sense 4. The twist that has been added during the intermission can be guessed by anyone from miles away, the director thought it would outsmart us but sadly did'nt 5. Wrong Positioning of the Film - It may read interesting when the plot summary goes like this \"A RAW agent goes on a mission to observe Trinity Scientist ...\" but believe me, that is just for 15 mins after which he just falls in love without doing any duty...\n\nVerdict - Mashallah !! Salman can only sell a Maruti 800 as BMW !!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "tharukshan12",
        "review_rating": "8",
        "review_title": "Entertaining in every segment..................",
        "review_detailed_main": "This is one of my best seen action films in bollywood till date. From beginning to ending it's gone through as an actionable thriller along with love story very smartly. Beneath the whole movie, salman's performance as a spy could be acceptable. Apart from this point, actions sequences from him really come out stunningly and surprisingly. And his love interest, katrina kaif who's also a spy has given her best in both lovable scenes and action scenes which will undoubtedly make you to be excited. According to me this movie is a great recipe which has tasty ingredients such as action,thriller and love altogether perfectly. All action lovers should not miss this film for any reason which is not only for sallu bhai and kaif but also for this amazing scripted film.\n\nPlus points : Action sequences.\n\nPerformance of lead roles.\n\nAmazing climax.\n\nLovable songs and so on.\n\nMinus points : Movie could have been even lengthier.\n\nDon't miss this wonderful entertainment!!!!!!!!!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "jay-techie2007",
        "review_rating": "7",
        "review_title": "If you can bear the first half, second half is worth it!!",
        "review_detailed_main": "Brilliant plot which has been poorly executed till the first half. Bollywood directors seems to be poor in setting up stories (like Players vs. The Italian Job) and that's where this movie takes a beat. The movie bores you till death with poor story flow, pathetic dialogues, mistimed punches, dragged and unrealistic chases/fights. Even the heroics of Salman Khan and acting icon like Girish Karnad could not wake you up.\n\nBut come second half and the movie has everything you can expect in this kind of movie. The surprizing twists n turns in the story (reminds me of RACE), perfectly timed punches and very well executed fight sequences will make you change your opinion. For Salman Khan and Katrina fans, its a must watch. Rest might save their money for something better."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "dineshprakash",
        "review_rating": "5",
        "review_title": "It is not a Tiger's roar rather it is Meow.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "danny_alam007",
        "review_rating": "10",
        "review_title": "Excellent Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ilpintl",
        "review_rating": "6",
        "review_title": "This Tiger earns his Stripes!",
        "review_detailed_main": "After watching recent Salman Khan starrers – completely idiotic movies combining dreadful writing, infantile humor, and hammy acting, most of it courtesy Mr. Khan (\"Ready\", \"Dabangg\") – I decided to steer clear of Salman Khan films, unless the word of mouth was overpoweringly good. However, do note that \"Ready\" and especially \"Dabangg\" were huge hits, so the paying public is not necessarily complaining about the quality of Salman Khan films. Rather, they flock to see middle-aged but well-muscled Mr. Khan as an ageing Romeo romancing nubile Juliets young enough to be his daughters. Mr. Khan, affectionately known as Bhai or brother in the Bombay film industry, is famous for his idiosyncrasies, his volatile temper, his feuds, and in the past few years, for his philanthropy through his NGO \"Being Human\". Underworld dons are also called Bhai, so one is not certain if it is filial affection or pure fear that earned him this nickname.\n\nBut due to the promising press for \"Ek Tha Tiger\", I checked out Mr. Khan's latest release. Like Jason Bourne in the deservedly successful Bourne franchise, Mr. Khan portrays a covert agent of India's Research and Analysis Wing. This would be equal to the US CIA or UK's MI5 (or is it MI6? – I can't keep my spy agencies straight), and like the globe trotting Mr. Bourne, Mr. Khan's Tiger criss-crosses the planet battling nefarious Pakistani agents from their secret service, ISI.\n\nKabir Khan, the writer-director of this film, constructs an entertaining popcorn flick utilizing Mr. Khan's strengths: his macho persona, his eccentricity, and his muscled torso. He also concedes Mr. Khan, nudging fifty, should no longer portray lovelorn teenagers. Instead, he plays a lovelorn middle-aged man, and does what Jason Bourne wouldn't be caught dead doing: he sings, he dances, he brandishes enormous bouquets and prettily wrapped presents. And he has a lot of fun doing it; Jason Bourne might find these activities effective stress diffusers, and would do well to unclench and enroll as \"John Smith\" in a salsa dancing class or take up pottery or French cooking. He'll live longer this way, and we'll be assured of many more installments in the Bourne saga. But I digress\u0085\n\nThis tale's spectacularly filmed opening has Mr. Khan, er, Bhai, tracking down and kicking the stuffing out of a rogue RAW agent in Iraq. Then his commanding officer (a magisterial Girish Karnad) dispatches him to observe an oddball professor Dr. Kidwai (Roshan Seth) at Dublin's famed Trinity College, suspected of sharing his expertise in a nuclear missile deflection system with the Pakistanis. When Tiger meets the charmingly fey professor under the pretext of collecting material for a book on India's finest minds, the don balks at the amount of shadowing Tiger is going to subject him to. His query is justified: Do you want to write a book on me, or do you wish to marry me?\n\nKabir Khan peppers his screenplay with dry wit, takes us to far-flung places with genuine payoffs, and gets the proportion of the ingredients just right.\n\nWithout giving anything away, I can tell you that Tiger falls for one Zoya (Katrina Kaif), cleaning woman for the loopy Dr. Kidwai and his pug, in between choreographing dance routines that are straight lifts from River Dance. An avid multi-tasker, she also embarks on a romance with the fumbling Tiger, new to wooing instead of wounding. His secret agent buddy Gopi (an excellent Ranvir Sheorey) looks on in bafflement as the fearsome Tiger morphs into a bashful suitor.\n\nThen, as must always happen in such tales, Tiger and Zoya find themselves on the lam in picturesque Havana. Unlike other people in deep cover, they sing, they dance, they get caught on camera (that's Jason Bourne rolling his eyes, muttering \"Amateurs\"), which results in the combined spy forces of India and Pakistan giving pursuit.\n\nIt's thrilling, it's engaging, it features white-knuckle chases and stunts, some by Ms. Kaif, who plays the conflicted Zoya. I always anticipate Ms. Kaif's artistic evolution with bated breath. She has demolished more movies with her bad acting than Mr. Khan ever did with his fists. Finally, in last year's \"Zindagi Na Milegi Dobara\" (You Only Live Once), she played a character with some measure of conviction, the sporty, mixed-race Laila. Her Zoya here is an extension of that Laila persona: once again, she is of mixed parentage, and again, she gets to use her athleticism.\n\nThrough diligent study, Ms. Kaif has pared her acting approach down to a single facial expression. We, the audience, are meant to decode the emotions in that expression in different situations – Ms. Kaif does not encourage lazily sitting back and letting her do all the hard work. The onus is on us: we are meant to look at that pretty, unchanging visage and deduce, aha, now she feels despair; now resignation, and yes, this has to signify either sultriness or acute constipation, and this, immense yearning. I liked that she kept me on my toes throughout her scenes, figuring out just what she was communicating through that one versatile all-purpose expression. Ms. Kaif can no longer be accused of being wooden; I salute her intelligence in pioneering a unique acting style offering discerning audiences a collaborative experience.\n\nThe film ends with one astonishing stunt, and we can only hope this means Tiger lives to roar another day. Amid the noise and fury of his rambunctious high-octane actioner, Kabir Khan makes one important point: it is truly obscene that India and Pakistan, countries with staggering amounts of poverty, illiteracy, starvation, and poor health care, earmark disproportionately large percentages of their national budgets for defense spending. Both nations would be infinitely better off, if like Tiger and Zoya, they opt to make love, not war. Human nature being what it is, such hopes would meet with Girish Karnad's cynical parting shot in the film: \"Good Luck\"."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "inavneetsingh",
        "review_rating": "1",
        "review_title": "Avoidable!",
        "review_detailed_main": "I went to watch this movie with lots of expectation(because some of my friends told me it's Salman's best) but what it sucks totally.\n\nWhy people make movie when they don't have a story?? Yes, Ek Tha Tiger is without story.\n\nI think this is worst movie i watch after bodyguard with worst ending.\n\nYes it's smashing all record because of Salman Khan presence and Independence day is another factor.\n\nOther(Dabangg,Wanted) salman's khan movie is good in comparison with ek tha tiger.\n\nI kinda like music only, Mashallah is good.\n\nin sort this movie is for Salman Khan fans, who worship him!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "maneckk-414-209658",
        "review_rating": "7",
        "review_title": "Ek Tha Tiger ... aur uski Tigress",
        "review_detailed_main": "An out 'n' out Salman Khan Movie, Ek Tha Tiger or ETT (sounds like a sci-fi movie) is a heavy-duty masala entertainer, which is high on machismo & romance. The production team has heavily banked upon the Katrina-Salman real life (past) chemistry, which is also the USP of the film. Even though ETT has been publicized as a Spy Thriller, for me that was not the underlying concept & romance is the central feature of the movie.\n\nThough most of the reviews I have read advocate that the film has a weak plot, the story is interesting as it deals with the pros & cons of a secret agent falling in love and the constant struggle between the heart and mind. Having said that, director Kabir Khan (Kabul Express & New York) left a brilliant concept upon the dependable shoulders of Salman Khan and his huge fan following. The treatment of the story is hurried and patchy (making me wonder what's with Indian spy movies \u0085 Don 2, Agent Vinod, and now this), it is extremely low in detailing and more stress has been given to hunting of exotic locales rather than research. Action is slick and a lot of mixed martial arts have been used. Music is average and he videos are colourful. Besides the already famous Mashallah and Tiger Theme, Banjara did catch my attention.\n\nThe characterization of the secret agent Tiger has been tailor-made to suit Salman Khan's personality and sense of humour. Spooks or spies are hardly pompous and over the top like Salman and it is quite visible throughout the movie that he has tried hard to fit into the character. But, Salman is Salman and you either like him or you don't. My issue is that I am a huge fan of Salman Khan and please forgive me if I sound biased in this review at places. Salman single handily like his previous movies carry ETT on his strong & dependable shoulders (I already said that). His good looks, signature facial expressions and idiotic sense of humour (which has earned him the largest fan following amongst the masses and movie lover like me) keep idiots like me entertained throughout an otherwise weak movie. Even when he is trying to hide behind the facade of a boring writer to shadow a professor and impress the heroine, he overwhelms you with his regular antics. No matter what the intelligent critics say, Salman's fan following is not going to diminish with this but steadily grow even though he has looked a tad older in this outing.\n\nKatrina Kaif looks WOW and surprisingly contributes much more than other Salman heroines in the past. She has a great screen presence and fits well into the character. She looks amazing in all her scenes and you can't help being smitten by the beautiful lass. Out of the rest of the cast, Ranvir Shorey is usual and shines in between scenes. The disappointing fact was great actors like Girish Karnad and Roshan Seth are completely wasted with no scope for them in the script, to portray their brilliance. The surprise package in this one is the costumes and the sunglasses (now I would like to own a wardrobe like that).\n\nIf it was not for Salman and Katrina this movie would have hardly recovered its costs. So, full marks to the production team for casting them and thinking of a brilliant plot, but below average score for a weak script & lack of research.\n\nI think you might say that I am insane, but I loved the movie and would not mind watching it again."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "lamba-2",
        "review_rating": "1",
        "review_title": "i have seen advisements that entertained me more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "mudassir191",
        "review_rating": "7",
        "review_title": "Good needs to be appreciated and ETT is definitely a good movie!!!",
        "review_detailed_main": "Ek tha tiger is definitely a good movie. It is a true entertainment movie, thats what one expects when one is entering a cinema. I knew nothing about the movie when I went to watch it but came out satisfied that I had made the right choice. I saw two movies on the same day, the other being Bourne legacy which is one of the successful movies in Hollywood. The action in ETT is on par with the action in Bourne Legacy, It was not like I had watched a very good Hollywood action movie and then I was watching a crap Bollywood movie. I'm happy that Bollywood has also managed to produce movies such as ETT. The on screen chemistry between the couple, the locations, cinematography everything is perfect except the story line which is a bit weak but thats acceptable, and these things make it a must watch movie on the Big screens so don't miss it....Enjoy!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Somak21",
        "review_rating": "5",
        "review_title": "Salman - Jungle Ka Sher, Movie - Cicrus Ka Sher",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "youmylove_2526",
        "review_rating": "10",
        "review_title": "one of the best movie i ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "bhaskar-agnihotri-114-294004",
        "review_rating": "6",
        "review_title": "Salman Rocks!!! Film Disspoints!!!",
        "review_detailed_main": "Indian Film Industry has yet to produce a spy thriller which justifies the challenges faced by RAW against ISI.Sunny Deol's HERO-LOVE STORY OF A SPY,AGENT VINOD were some of the earlier failed attempts.The marketing of Ek Tha Tiger was done in such a way that viewers got an impression that the film would be dealing with the challenges faced by a RAW agent against ISI.But the film was a love story instead.The story as well as the screenplay was weak.The stunts filmed on Salman were well executed.The film might prove to be a profitable venture due to the SALMAN MANIA!!! and initial buzz created, as well as the rise in the ticket rates in multiplexes and single screens but will not be remembered for long as a path breaking film in the spy genre."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "pcinpocket",
        "review_rating": "5",
        "review_title": "One time watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "lieutenantarpit",
        "review_rating": "10",
        "review_title": "Critics are Going to be humble this time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "mukesh658",
        "review_rating": "7",
        "review_title": "Lot of action ! One time watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "user-223-361915",
        "review_rating": "4",
        "review_title": "big disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "jordondave-28085",
        "review_rating": "7",
        "review_title": "It's good but not a great Bollywood movie.",
        "review_detailed_main": "(In India with English subtitles)\n\nI saw it as \"Once There Was A Tiger\" a movie that is co-written and co-directed by Kabir Khan, the theme may be nothing new but it's new to me where a secret agent aka Tiger (Salman Khan) a spy for the India govt in a foreign country his job was to expose the spy working for the ISI the Pakistan government. He meets and falls in love what he thought was just an ordinary woman, Zee (Katrina Kaif) with an ordinary job working in theater. Him posing as a teacher's protege. Except that the secret agent spy working for the Pakistan gov't turns out to be Zee who's actual name is Zoya. And they both decide to elope from their respective gov'ts for the intention of becoming a couple, forcing them to flee and go into hiding.\n\nAlthough, there are some action set pieces is nothing spectacular without the help from CGI, what does help this movie are the locales, the concept and the chemistry of it's 2 leads using the India vs Pakistan theme. Why can't we all get along!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "kunalkhandwala",
        "review_rating": "5",
        "review_title": "Wait for it on Doordarshan or Zee",
        "review_detailed_main": "Any reason why those critics would have praise for 'Ek Tha Tiger' is because they were promised a share of its opening success. But just as its box-office smashing opening, it begins on an impressive high in a sequence that is supposedly shot in Iraq with some stunning cinematography. The breathtaking location is supported by a well choreographed action sequence atop roofs of the low structures and bazaar streets. However, once we are introduced to this R.A.W. Agent named 'Tiger', it all starts going downhill from there. Dublin, Havana, Istanbul, London or New Delhi no longer resemble those breathtaking visuals we had seen in Iraq. It's as though the cinematographer and director had changed for the rest of the movie. The action starts looking amateurish and the R.A.W. Agent loses his credibility of being an agent at all. With its non-existent story-telling, weak direction and Salman's stiff, expression-less portrayal, one loses respect for 'Ek Tha Tiger' and rather appreciates several aspects of its predecessor of R.A.W. Reference, 'Agent Vinod'.\n\nAfter he is done showing off his macho physique in the Delhi neighbourhood upon his return from Iraq, Tiger is keen on jumping to his next assignment that takes him to Dublin, on the trail of a professor (Roshan Seth) who is reluctant to meet anyone but his own dog. Tiger meets Zoya (Katrina Kaif), who introduces him to the professor, he falls for her, digresses from his mission completely, sings a song or two and is then shocked to find out Zoya's true identity who is actually.... wait for it..... an I.S.I. Agent!! Kabir Khan plays 'New York's surprise story once again while Tiger gets all gloomy back in New Delhi. His next mission takes him to Istanbul where he decides to elope with Zoya, right under the noses of R.A.W. And I.S.I's officials. Then, by switching identities and putting up incredulous disguises that makes Salman look like Suryavanshi all over again, they escape to Cuba where they stupidly pose in action in front of the camera for the world to see. Once again, they're on the run in undisclosed locations and false identities. R.A.W.'s chief, (Girish Karnad) thus concludes the theme of the movie – Ek Tha Tiger. If this was lame to read through, you have no idea how it is to sit through the film when the action simply becomes laughable with conspicuous body doubles doing all the work for our senior citizen Tiger. These sequences also involve him jumping from an airborne motorcycle into the open door of an already flying airplane in a choppy CGI shot. Rajnikant's jaw must've dropped as well.\n\nKabir Khan never had it right after the opening sequence. If this is the story that Aditya Chopra comes up with, then it's time he hands over all creativity back to his father. The plot has no complexity whatsoever and Tiger's weakness as a dedicated R.A.W. Agent simply dampens the already struggling plot. Compare all this to Shriram Raghavan's slick 'Agent Vinod' - The plot was convoluted for being a spy thriller, the romance never became too serious and it never digressed the film's focus which revolved around the agent's mission. The action was more credible and so was Saif's portrayal as a secret agent. 'Ek Tha Tiger' makes 'Agent Vinod' look like it was made under the MGM banner with Martin Campbell directing it.\n\nKatrina Kaif does well in her role as an I.S.I. Agent. Although, she looks too beautiful to be taken seriously as one. In the Mashallah song, Katrina looks like a gift from the Gods to mankind. Salman Khan looks much older than ShahRukh Khan did in Ra.One and his physique is perhaps so bulky that his movements are even more restricted. For a simple jump from the first storey, he needs a body double. His movement in action and dance is just so stiff that it robs the essence of the character he is playing. To the extent that agent Tiger is too Salman- ish rather than the other way round. Yet, he has done his best in portraying a character that wasn't even well written to begin with. Ranvir Shorey is the most fun to watch though. His performance is brilliant as Tiger's support and he brings the humor as well as the seriousness in the film. Girish Karnad seems a bit extreme as the chief of R.A.W. while he devours Tiger's special Daal and sulks about his lost love. But we'll take that since we haven't seen him in a while.\n\nSohail Sen's music will be remembered for the arabic tune of Masha-allah and for Mohit Chauhan's melodious singing in Saiyaara to some fine tunes.\n\nDirector Kabir Khan has reportedly used Salman's advice while filming 'Ek Tha Tiger' and certainly that did not help his cause. While he had the potential to create something superlative with such a cast and the promise of the opening sequence, he washed it all down with the ridiculous action sequences that followed, the frivolous plot-line and poorly written characters. It seems like anything goes for success these days and 'Ek Tha Tiger' is a shining example that audiences can decide the fate of any film. With its ginormous collections already, there is no need to contribute more to its makers' wallets. You can wait a while and watch it on Zee or Doordarshan...."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "shafiq-siddiqui81",
        "review_rating": "7",
        "review_title": "Ek Tha Tiger? Or Ek Tha \"Copycat\"?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "saifsattani",
        "review_rating": "3",
        "review_title": "Downfall of Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "karizmabadrinath",
        "review_rating": "10",
        "review_title": "Salman khan rocks again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "phadvijayanand",
        "review_rating": "6",
        "review_title": "It's a Bollywood action with romance.",
        "review_detailed_main": "This movie is for people who love bollywood films or Salman or Katrina ! Story is really simple & nothing new.\n\nDirection in first part is little bit slow. but next half gets the pace & works actually on the story.\n\nSalman's RAW agent - He done it fantastically with his styles & does better than Shahrukhs DON & Agent Vinod !\n\nKatrina as usual does her job well, from a cute looking bubbly dubly girl with some action tigress.\n\nThere is nothing much in the story neither in the direction, movie takes ups & down at many places.\n\nSalman's romantic scenes with katrina, could have been more interesting but director chose to go old way & there is nothing you can surprise for.\n\nBut thumbs up to the action, which neither like Dabangg or Bodyguard. Action is similar to 007 or Ethan Hunt.\n\nSo overall 6 ratings, watch it for Bollywood or Salman or Katrina ! One time watchable."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "silvan-desouza",
        "review_rating": "5",
        "review_title": "Better then Salman Khan films but not great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "cholobarite",
        "review_rating": "10",
        "review_title": "My one of the favourite movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "An Entertaining Film! Salman Roars!",
        "review_detailed_main": "Kabir Khan's Highly Anticipated 'Ek Tha Tiger' is An Entertaining Film, that blends romance & action efficiently. And Salman Roars as Tiger! He's In Terrific Form!\n\n'Ek Tha Tiger' tells the story of a Trinity College scientist suspected of selling missile technology secrets to Pakistan. The Indian government sends a secret agent, codenamed Tiger, to find out about the professor's activities. Tiger falls in love with the professor's caretaker Zoya who is studying at a fictional dance academy located at TCD, and together they embark on a roller-coaster journey that takes them from Dublin to Istanbul & Cuba.\n\n'Ek Tha Tiger' is a romantic-action-thriller, that has a decent screenplay, written by Kabir Khan himself & Neelesh Misra. Sure, there are a few minuses in the screenplay, but overall, it works, as it entertains & doesn't take itself too seriously. The Twist at the interval point, is indeed interesting. Kabir Khan's Direction is proper, he has handled the dramatic as well as the light moments effectively. Production Values are top-class. Cinematography by Aseem Mishra is excellent. The Lens-Man has captured the stunning locales appropriately. Editing is fair. Music by Sohail Sen & Sajid-Wajid is memorable. Action-Sequences are superb.\n\nPerformance-Wise: Salman is in terrific form. As Tiger, he breathes fire into his part & performs with flourish. He roars from start to end. Katrina Kaif, as always, delivers sincerely. Girish Karnad is fair. Ranvir Shorey is likable, his scenes with Salman are pleasant. Roshan Seth is his usual self.\n\nOn the whole, 'Ek Tha Tiger' offers what it promises: Entertainment."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "apoorvsharma2006",
        "review_rating": "2",
        "review_title": "Why Salman's euphoria bubble is about to burst!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "rajking-455-325697",
        "review_rating": "",
        "review_title": "Ek Tha tiger --what a fuss!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "gbasandani",
        "review_rating": "7",
        "review_title": "Espionage romantic thriller with robust star cast",
        "review_detailed_main": "Ek tha tiger is a bewitching romantic story woven behind an espionage thriller with larger than life superstar Salman Khan with his ex-flame Katrina Kaif n they exhibit perfect on screen chemistry.\n\nETT has more coherence and emotion in story than his previous flicks: Bodyguard n Ready. Sequence have grip and suspense to keep audience hooked for what is next and of-course added with humor and wit.\n\nYashraj banner has fort in love n romance but this time they have skillfully brewed with undercover thriller, taking full leverage of Salman's charismatic image, who has done wonderful stunts, sprints, chasing on roof tops, smashing heads and even stops a tram with a skimpy jacket. To keep audience enamored, Salman has body, boyish charm and delivers action with dynamism, vivacity and smartness of bond. Katrina is not mere Barbie but with each passing films she is getting refined in acting fort, and here apart from juicy dialogs, she has fight n stunt sequence to suit her figure and constitution. She is certainly not a glamor doll but has gravity in her role with equal footage. I, being her ardent fan claim that she can win millions by her smile, poise and suppleness. In songs Laapata and Mashallah she looks heavenly with devilish facial gestures and curves.\n\nIt is a reality that love has no parameters, limits and boundaries, and can cross any madness, zealotry even as contradictory as ISI n RAW. ETT dares to prove that through idiosyncratic twist n turns.\n\nAll the overseas locations have been well picked and are not common Bollywood shooting destinations. Parks, tree lined avenues and medieval architectural buildings in Dublin are picturesque and breathtaking. Byzantine and Ottoman architecture with cobblestone alleys, downtown crowded market, pavement are nicely shot during tacking, running and chasing in Istanbul. Havana city lied on low hills with Narrow Street and hanging balcony is another fascinating pick out\n\nIn nutshell it is a comprehensive entertainment with action, stunts, nice songs, glamor and story with a message with your favorite stars."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "legend_killer0123",
        "review_rating": "4",
        "review_title": "Kabir Khan's Worst Film To Date",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "subbuparam",
        "review_rating": "7",
        "review_title": "Decent enough for a one-time watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "abhinavbom-450-306088",
        "review_rating": "1",
        "review_title": "bad movie",
        "review_detailed_main": "Movie is exactly what I was anticipating. NO action, no romance, no thrill...just a typical community attraction that is bringing crowd to theaters. Salman's acting is ordinary. Katrina is nothing more than an eye candy who hardly knows how to speak Hindi. The stunts are simply ordinary. This movie is not even equivalent to the other Eid releases like Dabaang and Wanted. Even though these movies are bad as well. But Ek Thea tiger has really broke all bounds of stupidity. there is no point in comparing this movie with the like of 3 idiots or Ra- one. Its not about the figures like how much earning will the movie make, its about getting real appreciation from the fans. This movie is a complete waste of time."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "parekhdhrumil-374-333873",
        "review_rating": "10",
        "review_title": "Ek tha TIGER, Ek hai TIGER aur Ek hii Rahega TIGER.",
        "review_detailed_main": "Where do i Start? Whatta MINDBLOWING film.Like Romance? Ek Tha Tiger has it.Like Drama? Ek Tha Tiger has it.Like Action and Stunts? Ek Tha Tiger has it and in Abundance quantity. Like World Music? Ek Tha Tiger has it. Like Comedy? Ek Tha Tiger has it. Like Thriller and Suspense? Ek Tha Tiger has it throughout.I will Segregate the Review by Rating the Different Departments.\n\nActing- Salman Khan is Baap of all Actors and yet maintains his Natural outlook towards acting which is spontaneous. Its Sheer Fun and Pleasure to Watch him On Screen in this Larger than Life Character who is Lovely, Cute, Brave and a Hero as the situation demands.I am Sure even if you are not a Salman Khan fan, you will convert and become one. Welcome to the Club. Katrina Kaif has surely improved a lot and Acts with Grace and is convincing as Zoya.\n\nCinematography- The Cinematography of this Film is SPLENDID. It has been shot in many Countries namely Iraq, India, Ireland, Cuba and Istanbul. All the Locations look Surreal and Out of the World on screen. The DOP has captured every frame with Heart and its apparent on screen. You will fall in Love with the locations.\n\nDirection- The Direction is top notch and truly Kabir Khan knows how he wants his Film to Progress and culminate smoothly and has got a Great vision of making a highly Commercial Love story and how he want to tell his Story to the Audience.\n\nMusic- The Background music is the Main and a Key factor of the Film. The Background music plays a huge role in making Ek Tha Tiger so Mindblowing. In fact you will not enjoy an Orgasm as you will Enjoy the Background music. The songs are good too.Banjaara,Saiyaara and Mashallah are Superb Example of World Music. Laapata is shot beautifully in the Lavish locales of Cuba.\n\nWriting- The Writing is Brilliant and it manages to tell a Highly complicated and Controversial story in a Commercial and a Feature Film Format. Dialouges are Very nice too.\n\nProduction Values- As i said, The Locations are Shot beautifully and Looks Splendid on Screen. The Production Values are Superior.\n\nAction- The Stunts and Action Scenes of Ek Tha Tiger are SUPERB. In fact, Audiences haven't seen such a Out Of Box and innovative Action Scenes in any films till now- Not even in Hollywood. Salman Khan looks convincing while performing them since he has got a Larger than Life persona. The stunts are On Bike, Helicopter, Car, Train and Ship. The Stunt and Action are totally Adrenaline pumping and makes the Audience excited.\n\nThough i Must Admit that the 1st Half was Lil Boring and was like any other YRF film which had a Focus on Emotions and Drama but once the 2nd Half Started it was a Rollercoster Ride in literal Sense. Edgy and Gripping Second Half. I am Sure Salman Khan changed the Entire 2nd half to suit his Fans Sensibilities and made it Kickass and Awesome.Salman Bhai truly knows what his fans want and has made it just the way it should be.\n\nOverheard after the film- \"Aree Salman Bhai ne Kya Film banayi hai\" \"Isliye toh hum sab Salman Bhai se itna Pyaar Karte hai\"\n\nGuys, Fasten your Seat belts and get ready to Witness a SUPERAWESOMEMINDBLOWING Film. Don't miss it, Its more Addictive than Drugs and the Experience is like Total Nirvana."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "genext-brite",
        "review_rating": "7",
        "review_title": "Stunt saves the Tiger",
        "review_detailed_main": "Given : I'm not at all a big Salman fan. Never believed in Bollywood action. And of course never liked Salman-Katrina romance.\n\nPost watch - All of the above 3 beliefs broke away ,may be for a long coming time. Aditya's story directed by Kabir's direction did a great job allover. Salman Khan again emerges as a one handed movie uplifter. Although action stunts were mostly inspired from Conrad's , but portraying them in Bollywood flick by an already hyped superstar did the whole work. In fact movie would have no soul without these stunts specially the last helicopter one.\n\nOnce again music duo Sajid-Wajid proved to be Salman's saviour (or say vice-versa). Each location had its own tradition music be it Havana or Dublin (although violin's in Banjara was lifted from Corrs.) . Background score was also perfect and filled the gaps between scenes.\n\nOverall its definitely a one time watch if not more (in comparison to Bollywood level). 7 points out of 10."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "aumlan-971-613355",
        "review_rating": "5",
        "review_title": "Ek Thi Katrina",
        "review_detailed_main": "The first time in Salman's long & illustrious career that he has worked with Yash Raj. Ek Tha Tiger naturally raised huge expectations. Were they fulfilled? Read on..\n\nEk Tha Tiger is essentially a montage - mostly of action & chase sequences, and a couple of songs thrown in. Yes, the action is absolutely top-notch, and the visuals esp the cinematography are to die for. Yes, the performances are largely adequate - Salman, Girish Karnad, Ranvir Shorey and Roshan Seth in a cameo; but it is Katrina who is the winner in the performance stakes - whether it is matching Salman kick for kick in action sequences or doing some real daredevil stunts (at least that is what I gather - and boy, she looks really cool in the action sequences).\n\nBut at the end of the day a solid storyline and a good screenplay are crucial in how a film turns out. Aditya Chopra himself is listed as one of the story-writers - but I am sorry to say that the storyline is really a downer - I mean, yes, there are a couple of twists, but none that an experienced movie goer would not have been able to guess . Kabir Khan - I had high hopes from u after Kabul Express & New York. Better luck with your next film. I also realize now why YRF were keen on Salman Khan for this film - if anyone can still make such a sorry script work and bring in the crowds, it is him.\n\nMy rating is a 3 stars. 1 each for Katrina, the Action/Stunt directors & the cinematographer... very disappointed with the poor story & direction."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "princeindia86",
        "review_rating": "9",
        "review_title": "Not your typical Salman masala film, but it has a good plot (for a change) and is thoroughly international look.",
        "review_detailed_main": "The term well made is rarely used when it comes to Salman Khan movies, perhaps because his primary aim has always been to entertain, at pretty much any cost. However, this change is a welcome one! Hopefully he'll continue to select films with good scripts that do justice to his image.\n\nSalman is all his fans would expect in this film, and more. He's multi-layered. This is perhaps the first time since Dabangg that his character development has been good and interesting.\n\nKatrina has come forward in leaps and bounds. It's remarkable that, at first, she could speak Hindi very well at all, and now she's injecting personality into her characters quite effortlessly.\n\nThe supporting cast is good.Veteran Girish Karnad does well, as does Ranvir Shorey, who's quite brilliant (and very funny!) actually.\n\nLoved the album. A few people said it could of been better but 2 tracks are amazing and one is good, so I'm not complaining.\n\nOverall, it's a Hollywood-style action film with Indian elements such as a strong romance, but also nice additions like humour. Entertainment is what you want and it's what you get.\n\nYou may be persuaded into the Salman fan club after seeing this. I certainly was!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "gautam-lakshmiratan",
        "review_rating": "7",
        "review_title": "Ek Tha Tiger, Phir then was Salman",
        "review_detailed_main": "An all & out movie for Salman fans!!! Salman's presence seen on all aspects of the movie. Very stylish performance by him, action sequences, his signature dance moves & some inputs in other small nuances in film making. There is more too be done to the story, with the script-writing team no justice. Starts alright, however fizzes out in the middle, leading to a family entertainment (Salman;s presence). Girish Karnad could have been used better with a twist in the story line, something to explore! The music average with Katrina's action sequence being something fresh in Indian cinema. Ek tha Tiger- phir then was SALMAN!!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "muneeb_afzal",
        "review_rating": "2",
        "review_title": "give yourself a favour, never watch this movie",
        "review_detailed_main": "couple of my friends are like big fans of bollywood cinema and music, i do kind of like their music but when it comes to the movies, I never actually understand the mind of the filmmakers of bollywood. take this movie as an example full of show off scenes, overacting and trying to make sentimental scenes when actually there is nothing happening inside the story. Why they make movies just for commercial success. It used to be a bearable cinema and I remember some movies namel \"DEVDAS\", \"RAND DE BASANTI\", \"CORPORATE\" and not to forget the best Indian movie \"Swades\". Why they stop making Swades kind of movie which was truly best movie i was really moved when watching that movie."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "Ek Tha Tiger:Salman Khan's most accomplished work.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Parulsc",
        "review_rating": "7",
        "review_title": "A Great Watch",
        "review_detailed_main": "Try to avoid listening to many of the misleading reviews, the movie was an excellent watch and was even better to see it with a family. Perhaps the people who say that the movie had \"no story\" didn't actually watch the movie. Want evidence? The movie is the story of a man who has lived a life in order to fight for his country who eventually falls in love and realizes that there is something beyond fighting for his country, fighting for peace and love. Sounds like a solid story to me. A great watch with the family because kids will love the comedy and action and I'm sure adults will enjoy the comedy and romance.\n\nDon't get me wrong though, there were parts of the movie that were almost laughable. Some of the action scenes and stunts looked entirely fake, mostly towards the end. However, it will do for a great story and a very original movie. Salman Khan seemed much younger and he played the role very well. Katrina Kaif did exactly the same (there were jokes going on about their relationship throughout the movie) and the movie couldn't have possibly been a better watch.\n\nHonestly, I'm seeing almost a fourth of the votes here giving it a 1, and that is ridiculous; This movie is a SOLID 7, no doubt about it. It's worth the price of the ticket I'm sure. So please don't let these reviews misguide you; go out, see the movie, and enjoy a great night with your family."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "halakoo840",
        "review_rating": "2",
        "review_title": "An awful watch",
        "review_detailed_main": "First of all i want to say this is my most anticipated movie of the year along with some others and have high expectations from Kabir khan due to his previous work. now come to the movie i must say i was hugely disappointed by the film, i have such high expectations from it but Khoda Pahar Nikla Chuha, i have become so bored while watching it Ke Mujhe Yuvraj Ki Yaad Aagaye. so many people are praising action sequences of the movie but i have seen these type of action sequences thousands of times in so many Hollywood movies that it didn't interest me much may be emotional content is missing for these action scenes which are the forte of Bollywood movie like action in wanted or Dabang in which u feel something emotionally for your hero. script of the movie is so vague and lame that i thought is it by Aditiya Chopra and directed by Kabir khan. Salmans worst performance in my opinion from his last 5 outings even in veer he was much better than that. the only little good thing which i like is the performance of Katrina which keeps improving in every film.\n\nI think Kabir khan got confused with what he wants to made a full blown Masala entertainer or pure slick spy movie and in the end he really messed it up pathetically."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "shahbaz-nips-312-738297",
        "review_rating": "6",
        "review_title": "James 'Tiger' Bond in an Mr and Mrs. Smith Story",
        "review_detailed_main": "In a nutshell it's James 'Tiger' Bond in an Mr and Mrs. Smith Story. Katrina (the girl who tames Tiger) justifies her casting in an action oriented role and stand side to side with the \"Tiger\" Salman in the movie. Salman looks good both in action sequences and idiotic scenes. Background Music and Mixed Martial Art Action Sequences are the things which impress most(5 star for both of them). The romantic portions are warm , the humor thankfully clean. Music is mediocre (except \"Mashalla') but Cinematography throughout the movie is Superb. The biggest weakness of the movie is it's plot holes (e.g Most stupid people in this movie are Intelligence Peoples themselves!!! Instead of bugging the apartment of scientist RAW send a writer!!!) The supporting characters are very underused. Twists are very obvious while Logic is taking rest again. Given how Salman earlier movies have done, I expect a more better box office performance as movie have some sense this time although screenplay is appalling."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "mack-daze16",
        "review_rating": "2",
        "review_title": "How is EK THA TIGER....",
        "review_detailed_main": "PART 1 - Those who saw the movie & said that its an \"awesome movie\" with all kind of entertaining things like action, style & story concept.... Then I must say that he or she don't have any kind of knowledge about movies & they shouldn't watch movies again.... (Just watch family daily soaps with your mom & neighbour aunties.... It suits YOU.\n\nThis movie is the most BULLSHIT movie in bollywood.... More than that, in the world....\n\nI don't know how BOX OFFICE get the screw out of every publics brain...."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "zeerocks91",
        "review_rating": "8",
        "review_title": "A pure ACTION-ROMANTIC movie",
        "review_detailed_main": "EH THA TIGER ..... Its a pure romantic action packed film which was above my expectations. its not only a Salmon khan movie but a SALLU-KAT movie .Brilliant work by Katrina Kai and for Salmon no words .Unlike salmons other movie , here there is a story which everyone will feel .Loved the direction and the tigers theme background music suited in the film .You will love not only Salmon but even Katrina after all she balanced her character in the movie.Excellent action , brilliant background and a pure packet of enjoyment . You will like the small bunch of comedy non-evenly in the film. Overall its a film about the line LOVE HAS NO LIMITS ~~! EK THA TIGER ........AT ITS BEST!! WORTH WATCHING ....LOVED IT !!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Saayer",
        "review_rating": "6",
        "review_title": "Success Matters... and ETT is a success!",
        "review_detailed_main": "Phrases like 'it's a masala film', 'total time pass' and 'mass entertainer' have been used by filmmakers to cover up for bad scripts and below par performances. The same excuse with which films like Bodyguard, Ra.One and Rowdy Rathore are being made. ETT promised to go a notch or two above these films with its pre-release build-up because even though Kabir Khan's previous ventures (New York and Kabul Express) were not pieces of cinematic brilliance but were not absolute brain farts either.\n\nEk Tha Tiger (ETT) was the most anticipated film of 2012. Released on a mammoth screen count (3,350), ETT was touted to become the first ever film to cross 40 million USD from theatrical revenues and break all the records. Breaking the records it did anyway by fetching 7 million USD on the first day and on the long weekend is expected to cross 20 million USD in the first week in India alone. Besides the economies of the film, I have to admit, I really liked the first promo of the movie. It did give a feeling that it will be a film with high entertainment value like Dhoom 2 or Dabangg. Also, the premise of the hunter becoming the hunted has always been one of my favorite subjects.\n\nETT is a love story folded in the milieu of espionage and cross border relations. Hardcore fast paced action, grandeur of songs, dancing and locations and a hot on-screen and real life couple set to make an intriguing buildup but the predictability of the story and formulaic screenplay ends up giving up several face-palm moments. The screenplay is so formulaic that you even know the dialogues of the next scene let alone the scene. Here is the formula: Intro action scene of the spy, return to office for a new assignment, find the girl in the new assignment, fall in love and begin the chase, defeat the villains, happy ending. The film does entertain though. Action is good. Acting has its moments. Songs are worth watching. Aseem Mishra is a star with his cinematography. In fact, camera-work is the best thing about the film. Don't miss the first action scene, or any action scene for that matter.\n\nAditya Chopra has not wasted much time and effort in writing the script. Combining a James Bond film with Mr. and Mrs. Smith does not take long and then you only have to add India-Pakistan rivalry flavor into it. Forget the basic facts like there are no daily flights between Havana and Karachi or that 'secret agencies' are actually secret too. Not to forget that the film touches all the possible stereotypes about Pakistanis and spies like a Pakistani ISI senior officer calling his agent \"Bibi\" and giving her taunts on her \"Izzat and Aabroo\" while confronting her or that all the Pakistani agents have a beard. Never mind the fact that an Indian agent creates havoc in Dublin, damages a train and goes unnoticed or that Chopra has used \"shooting star and praying\" scene in a 2012 film which was done and dusted in the 90s. The weak script sand lose screenplay are the culprits of ETT.\n\nKatrina Kaif has really improved. Here, I said it. I couldn't find a problem with her dialogue delivery this time. Hopefully, she will finally live up to the revenues her films reek up on the box office. Her chemistry with Salman is fantastic. The couple literally sizzles the screen with their demonstrative glances, one liners and extremely likable warmth. This will be one of the biggest factors in making the film a huge success. Salman is being Salman. He knows his star power and he knows what the audience wants. He knows what can make the crowd whistle and dance and that's exactly what he will make them do with his performance. An aging but active spy with a touch of his old schoolboy charm. Ranvir Shorey also delivers a strong performance. His role had a lot more meat than shown and could have made the script stronger.\n\nKabir Khan is a successful director and there is a reason for that. His films look intelligent to the masses. A regular film goer does not need to solve intricate riddles to understand the twists in his plots and still feels that he has achieved something by understanding the plot. His films pretend to have a great message and bigger aura than they are but they click with masses exactly because of that. Despite weak executions of New York and now ETT, Kabir Khan knows how to taste success with masses while critics can debate whether he is a good director or not.\n\nIn a nutshell, ETT does go above Ready and Bodyguard but only by a narrow margin. Too bad for me, I watched it after watching Gangs of Wasseypur after which only really good films will look good. ETT does not break the myth that the audiences don't need a good film but only need the stars in them. Even in entertainment, it's not better than Dabangg but who cares when Salman Khan has taken off his shirt in the film?"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "bluffmasteranshuman",
        "review_rating": "3",
        "review_title": "Ineffective story with average acting and average stunts.",
        "review_detailed_main": "Yours truly went to see this movie on the sunny Independence day morning and to summarize it in one word... DISAPPOINTING! The storyline was very average and ineffective, the screenplay was as good as it can get with a story like that, but still could not save it. Best thing... well... the music. We have been listening to the songs for a month and I have to admit that they are catchy. The Stunt work reminds me of the Prince of Persia games, jumping across rooftops and disabling all enemies, but it is not up to a level that a spy flick should have. This film is nowhere close to Salman's Dabangg, but more like Bodyguard where the flick can make money only by the sheer Superstar status of the actor. Can't think of any more good things about the movie to write about except this one: This is better than 'Agent Vinod'. Only die hard fans of Mr Khan will go for repeat viewings, but I would rather spend my money on Jeremy Renner's Bourne Legacy or wait till next week for the sequel of Sly's Expendables featuring a whole bunch of action stars. Peace."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "arjun-jhawar",
        "review_rating": "10",
        "review_title": "Go for it..",
        "review_detailed_main": "Salman Mania... Salman's charisma... Salman's screen presence... oh wait.. there is our beautiful KAT too. First things first, Movie is not about some James Bond style trilling missions or turn-around. The movie is about a spy who falls in love with another SPY of an arch-rival country(Pakistan). So please don't go for a BOURNE series type of plot or a JAMES BOND style storyline. Instead, go for SAL-MAN. And his lady, KATRINA. And of course, the ACTION is fantastic. The on-screen chemistry is awesome between the couple. The songs are good. The story is good, for a change(and not like a south-Indian remake).Phew... The best thing about this film is that it leaves you wanting for more in the end..(yes, there is a scope for a second part, which i think will happen for sure) considering the amount of success this movie would garner at the Indian box-office. Final word:- Go for it, and look at it from an entertainment perspective. You will fall in love with the film. Full marks to Salman and Katrina."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "gapingzulu",
        "review_rating": "6",
        "review_title": "Even though I'm not a big Salman Khan fan",
        "review_detailed_main": "I must say this movie was pretty good and entertaining. Forget logic when you are watch Sallu's film, only expect entertainment and Salman in every frame. This movie has action, bit of comedy, over the top action and zero acting from Salman Khan.\n\nThe song are pretty awesome and unique to be honest.\n\nMy favorite being \"Banjaara\". Even the video is great with Katrina looking cute.\n\nSad but lovely song \"Saiyaara\".\n\n\"Ek the tiger theme song\" which make you feel part of the song movie.\n\n\"Laapata\" only dud but works okay on screen.\n\nAnd \"Mashallah\" only good for it's arabic appeal which is played in ending credits.\n\nSo watch Ek Tha tiger but it will only entertain you if you are into illogical Sallu movies.\n\nI'll give it 6 out of 10."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "krishanu-nandan013",
        "review_rating": "2",
        "review_title": "not to be watched",
        "review_detailed_main": "The movie is very badly finished. Action sequences are not regular. As per the Tittle there should be no love story and also the romance is not in complete form. Also comic phrases are very dull Over all movie doesn't contain anything in proper fit.\n\nI recommend not to watch this movie, i wasted money in it. You will feel that what was this ?? after watching it\n\nSecondly story line is not what is was in promos. Kabir khan did a good job and locations were good along with action sequence (what ever in it) Salman look good, Katrina is descent. Cinematography is also worth to watch."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "sribornagain-394-460163",
        "review_rating": "6",
        "review_title": "Time-pass",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "abhishekforu",
        "review_rating": "1",
        "review_title": "Ek Tha Tiger Aur Do Thi Disprin!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Leofwine_draca",
        "review_rating": "6",
        "review_title": "A nice surprise - providing you don't take it too seriously",
        "review_detailed_main": "EK THA TIGER is an Indian action thriller of the kind that could only ever be made in that country. It stars big shot heart throb Salman Khan who plays a globe-trotting secret agent on the hunt of traitors selling military secrets to Pakistan. His adventures take him to Ireland, Turkey, and many other places besides, and there are always beautiful women to romance and bad guys to fight.\n\nLet me make this plain from the outset: EK THA TIGER isn't a film you want to be taking seriously. It's incredibly cheesy at frequent intervals and totally unserious. Realism is out of the window so you can forget that. Khan's character is so impossibly perfect, heroic, and stylish that he becomes a caricature of the movie action hero. The use of slow motion shots in the action scenes make them impossible to take seriously too.\n\nLike many Indian movies, EK THA TIGER has a long length which means there's a lot of padding here. Some of it I didn't care for much; I didn't like the female lead and the romance and flirtation scenes between the two bored me. The song and dance numbers are limited but a lot of fun. Where this film held me really entranced was in the action sequences, which are something else. They're heavily indebted to Hollywood cinema, in particular THE BOURNE ULTIMATUM which is openly copied in some scenes. They're elaborate, expertly staged, and have great choreography. Sure, they're over the top, against the laws of physics and occasionally reliant on cheesy CGI, but it doesn't matter when the action is handled this lovingly and is so much fun. The action is explosive, violent, and hard-hitting and makes great use of an extraordinary stunt team who go the extra mile. I hope to encounter more of this delightfully over-the-top Indian-style action in my future viewings."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "shashankss",
        "review_rating": "3",
        "review_title": "Far below average and the much hype the first day collection created.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "barvechinmay90",
        "review_rating": "8",
        "review_title": "Ek tha tiger [2012,Hindi,Very good]",
        "review_detailed_main": "When 2 history makers come together, they create a new history. Yes, I am talking about Yash raj films & Salman Khan. Ek tha tiger is a perfectly blended recipe with appropriate proportions of comedy,romance, action & so on. Salman & Katrina chemistry does work. all other actors doing a pretty descent job. Music of this film has some very good tracks where I think movie scores. Also the action sequences are pretty good. But, if you are looking for south Indian typical action sequences in this movie then you will be disappointed. Salman doing very good job as always which can be proved by people in cinema hall cheering on appearances of him. Still I think a lot could have done with this movie considering its story line. although the movie keeps audiences glued, you feel somethings missing while watching, otherwise its a very good movie to watch. So I am going with 4/5 for Yash Raj's Ek tha tiger."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "sallubhaithegreat",
        "review_rating": "6",
        "review_title": "interesting watch",
        "review_detailed_main": "first of all i am not a salman fan and i didn't have any expectation when i went to the theatre and to be honest this movie was much better than his last two films ready and bodyguard.action was brilliantly choreographed and it was very stylish.salman was surprisingly good in this film and his screen-presence was literally unmatchable.katrina's performance was okay,girish karnad was good in his role.music of this film isn't that great,songs like mashallah and laapata were good.cinematography was top- notch,editing was OK,screenplay could have been better.kabir khan used salman very well and it will be right to say that this film is entirely depends on salman as this film was neither spectaular nor poor.it's refreshing to see salman film with proper story."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "sps-srk",
        "review_rating": "3",
        "review_title": "R U Fan of Sallu Miya OR Fan of Good Movie",
        "review_detailed_main": "If you r fan of Sallu Miya than go and watch because nothings new in this film. Bakwas action, - u can see more better action in a south movie. All this action came from South Movie only.\n\nif you want watch a good movie than go for Gang of washier 1/2. We show in last week , really its good movie. I do like Sallu Miya but I am saying that this movie is not that much good which we are expecting. There two kinds of people watching this movie 1, fan of Sallu Miya and 2nd because of Katrina. but dude the there nothing we can see i between Sallu and Katrina. SO you have to decide - its up to you .... because end of the day u r going to spend your money ? AM I right ? Am I right.\n\nR U Fan of Sallu Miya OR Fan of Good Movie ?? R U Fan of Sallu Miya OR Fan of Good Movie ??"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "rahul-bisht-2112",
        "review_rating": "8",
        "review_title": "Tiger did roared and even the tigress...",
        "review_detailed_main": "Ek Tha Tiger, terrific action packed thriller with a romantic touch. Delicate romance is sandwiched between the hardcore loafs of action and thrill. Salman, well no words for him, he was at his original best. He did some extreme fight sequences and made them look nonchalant. He was looking raw and rugged. But the pleasing surprise was the Tigress..Katrina. She conjured up with some athletic fight sequences which were done so perfectly that no other actress wouldn't have done anything better than her. Katrina's foreign 'jeans' did help her in her action sequences. At no point did she looked delicate and awkward while doing it, which one can associate with bollywood actress of Indian origin. 'Ek the Kat' wouldn't have been a bad name either. Even her acting skills much improved than before. She was looking a bit plump in the movie but beautiful nevertheless. Nothing much can be said about the story though. This is the story of a spy named Tiger from Indian Intelligence agency RAW who met Zoya during a mission in Dublin while spying a professor. She was the caretaker of the professor who later turn out to be a ISI agent. Tiger fell in love with her despite her being Pakistani agent. Later he ran away with her for the sake of love, both of then damning their respective agency. The rest of the movie is about their struggle in running away from the agencies and at last they were able to dodge them forever. The theme of the movie is romance topped with some breath taking action sequences. The director Kabir Khan did a great job, he never tried to make it a technical James Bond movie which is neither the forte of bollywood nor the taste of our audience. The chemistry of Salman-Katrine really did wonders for the movie. They complemented each other in romantic as well as the action scenes despite their first film in three years after Yuvraj. Katrina was bargaining for a 100 cr movie and she is well on her way..."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "akshaychopra889",
        "review_rating": "6",
        "review_title": "OK But salman in it what huh????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "starrys8000",
        "review_rating": "4",
        "review_title": "Load of crap",
        "review_detailed_main": "Clearly a big letdown considering the hype it generated. Reminds me of Ra.One. Though there is enough masala for the front benchers to make the film a hit in small towns. Other audience wont return for a second watch. Kabir Khan continues with his half baked stories and loses focus by the interval. He starts off with something and ends with something else. Poor!!\n\nAll about a RAW agent. Did the director think a RAW agent is going to be so foolish?? Not by any chance. After all they are going to be secret servants of the country.\n\nThe question then remains – should they have attempted to have a coherent story when they didn't intend to make anything substantial, impactful or entertaining about it? Or should they have simply stuck to what Salman Khan fans enjoy best - mindless action"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "harshdgenius",
        "review_rating": "3",
        "review_title": "Average from all angles!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ravindra-lb",
        "review_rating": "2",
        "review_title": "If you liked Ready or Bodyguard, you might just like this",
        "review_detailed_main": "The movie starts with great actions and promises you to expect great thrills ahead. But it just starts to fade away with some unacceptable awkward actions like where he stops a running train using his shirt and races his bike to jump into a running flight after being shot.\n\nThere is absolutely no chemistry between Katrina and him and their love story bores you. Salman is not Sharukh (you see?) But Katrina's role is interesting but not her acting.\n\nBeing an Indian Spy he's shown to be very passionate to take on enemies fighting in all different countries and exotic locations and we'd expect him to be like one James bond of India, but within no time he ends up giving up the fight like a love bourne normal man. In that case why name him Tiger I ask?\n\nWe have seen spies giving up their life to protect the National Security and Interests but Tiger gives up and chooses the romantic side.\n\nNot sure what Kabir khan wanted to prove in this movie. This movie is not a treat even for die hard Salman fans which i am one of, and it ends up to be just like another Salman's movie with a weak script (Remember Veer, Ready or Bodyguard etc.,).\n\nDo not watch if you're looking for some real action thriller. For a moment i felt Ra.One was more thrilling than this.\n\nThere is no doubt it might reach the 100 Cr mark. What's the point if it's just because he has a huge fan following?\n\nTotally the movie disappoints in all aspects. Just not good enough!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "prasannavenkatesh08",
        "review_rating": "10",
        "review_title": "awesome movie.James bond meets Mr & Mrs smith.superstar of Bollywood is back.",
        "review_detailed_main": "fantastic movie.both Salman and Katrina done their job superbly.brilliant direction by Kabir khan.screenplay is fabulous.i watched the first show of Ek the tiger.it is a tremendous action and commercial entertainer and recommended for all types of movie lovers.because it contains all variety elements suited in a proper way.Salman and Katrina are the best pair. their acting and performance is the key factor of the movie.Sajid Wajid's background score is awesome.especially in the train chase scene and sallu's introduction scene.interval block is a good twist.second half is chance less.stunt sequences are mind blowing(both Salman and Katrina).In one word Ek the tiger is a must watch and it's a treat for Sallu fans and others also.our favourite star is back with a bang.this time he is fully loaded with non-stop action.Ek the tiger is the biggest blockbuster of Bollywood 2012. no doubt."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "gaurav-amatya74",
        "review_rating": "2",
        "review_title": "Ek tha tiger or Ek tha giraffe it still doesn't matter",
        "review_detailed_main": "The only good thing about this movie is Salman Khan and his body other then that there is nothing to see in this movie. No story at all its just action all over and never know why is it all about. The main suspect The scientist he just has 2 scenes and has nothing to do in the movie. Ra.one would be better if compared cause it has a little story line at least. Katrina's acting was as usual dull and Salman has a great sense of humor but very less of it in the movie. In-spite the good action there is nothing in the movie. Watch it and go crazy. I am still in a buzz that I saw a movie or played a puzzle which cant be solved by not even the best puzzle solvers in the movie."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "thesuperfatsumo",
        "review_rating": "10",
        "review_title": "The best action film made in Hindi by a distance, with great stunts and breathtaking visuals",
        "review_detailed_main": "I mean, I really don't have to say much more than what's in the summary. This film will entertain you but also make you think. It's the complete package: stunning action, great romantic chemistry, great visuals and a great background score (the best of the year in my view).\n\nSalman Khan plays Tiger with ease. He's very lively and serious as the purposeful and ruthless RAW agent. He's done a great job of doing his own stunts. It's especially commendable considering he underwent treatment for trigeminal neuralgia shortly before the first shooting schedule.\n\nKatrina Kaif is the most natural the audiences have seen her since New York. The progress she's made since her entry in Indian cinema really shows Ranvir Shorey and Girish Karnad have done exceptionally well in the roles of Salman's aide and friend and RAW chief.\n\nIt's worth mentioning that, although this film is a romantic action thriller, the humorous elements prove to be the perfect addition. The way Kabir Khan has subtly incorporated humor into an action film is Hollywood-esque and terrific.\n\nThe international locations are amazing. The film's a visual treat.\n\nThe music is amazing, with 'mashallah' really sticking out for me. Mohit Chauhan does an amazing job with 'Saiyaara'.\n\nKabir Khan has done an amazing job. He completes a hat-trick of meaningful films, all different in their respective styles.\n\nOverall this film is a treat to the senses. You just have to watch it and enjoy the experience. I give it the full 10/10."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "zuhaib_the_hero",
        "review_rating": "2",
        "review_title": "Absolutely useless Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "shariq-maverick9875",
        "review_rating": "1",
        "review_title": "Nothing new...juss 4 brainless Salman Fans",
        "review_detailed_main": "The Hero in d 1st half Agent Vinod in d 2nd half action sequences inspired 4m Dabangg,Bodyguard,Don 2 Salman Khan Katrina Kaif=Ek Tha Tiger.... ETT opens well,the 1st half entertains..there's a twist in d interval,but that can b easily guessed.problem starts with d predictable 2nd half,n after 2 n half hours,ETT turns into a mindless Salman action flick.. Plus points: 1.Katrina Kaif-it may b called Ek Tha Tiger,but the Tigress impresses d most..still weak in romantic scenes,but kickass in action...plus,that she looks ultra-gorgeous in it is an understatement..ETT cud have been easily called EK THI TIGRESS 2.Salman's intro in d midst of cigarette buds,n d action sequence that follows 3.Salman-Kat's chemistry in d 1st half 4.The locales Minus points: 1.Salman Khan-the trump card,but also d biggest problem with Ek Tha Tiger..while he is gud in d action scenes n straight-faced humor,but looks tired n disinterested in d rest of d film...emotional scenes r disastrous 2.the predictable 2nd half 3.the songs....barring Saiyyara,every song acts as a speed-breaker 4.Action scenes,though enjoyable,are ridiculous 5.Direction overall,Ek Tha Tiger,though btr than Salman's last 2 headache-inducing films,is only 4 his die-hard fans...which is a pity,cox Salman could have silenced his critics with this one...non-fans,watch it for the ravishing Katrina Kaif,skip otherwise...a gud premise wasted...2.25/5"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "paragdubey",
        "review_rating": "1",
        "review_title": "Don't waste your time or money....",
        "review_detailed_main": "This film is another over-hyped product with the Salman Khan brand name. I have no doubt that this will be another addition to our ever growing 100- crore film club. But a good film this is not. Far from it. This is not a spy thriller. It is a love story disguised as a spy film and a bad love story at that. The action scenes are choreographed well but Salman isn't even in most scenes. The dummy is clearly visible with Salman's face pasted on him. The storyline involving the mission Salman is sent on is conveniently forgotten and instead we are left with a runaway couple being chased by RAW. The twists are stale and stupid. Nothing engages you in the film. By the time the film ends, all you will wish for is a refund and a strong cup of coffee to revive you from this snore-fest. Go at your own risk."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ats_en",
        "review_rating": "10",
        "review_title": "Awesome Ek Tha Tiger",
        "review_detailed_main": "Tiger Roar's!!!! This movie is brilliantly crafted & narrated. Sometimes it shatters your thinking & takes a new turn ....twists & turns of the movie makes it more delegate to watch..Its a Full On Family Entertainer...Loved the movie, planning to go again with friends!!! Salman & Katrina looked stunning in the movie, great songs n lovely locations make the movie soothing to eyes, Yash Chopra Production is famous for its Quality Products & this one is no exception..Locations like Istanbul, Cuba, & London are explored as never before..Loooks amaziing..So this movies for sure deserves a good take from the public, Its first day collections in India are in range 35-38 Crores which is the 1st for any bollywood movie in Indian Cinema!!!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "o-ladin",
        "review_rating": "1",
        "review_title": "This tiger doesn't roar!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ketgup83",
        "review_rating": "8",
        "review_title": "Ek Tha Tiger delivers what it promises - Entertainment. SALMAN ROCKS once AGAIN !!!",
        "review_detailed_main": "Ek Tha Tiger was one of the best Bollywood action movie made in the recent time with well-executed action scenes , snippy-snazzy stunts and of course it gives you one and the only SALMAN KHAN's charisma.It is enthralling and gives you an entertainment potion right from the beginning till the end.\n\nEk Tha Tiger tells the story of a RAW agent Tiger(Salman Khan) who has been given a secret assignment to observe a Trinity College scientist(Roshan Seth), suspected to have links with ISI agents and selling missile technology secrets to Pakistan. Tiger reaches Dublin and follows his activities with help of Professor's care-taker, Zoya( Katrina Kaif). Doing his duty , Tiger falls in love with Zoya and is occupied in two states of mind that whether he will perform his duty or began a brand new life with Zoya.\n\nDirected by Kabir Khan ( Kabul Express , New-York), Ek Tha Tiger starts off very well with wonderfully executed opening action scene where Tiger fights the other spy agents followed by couple of scenes in London and Dublin. Kabir Khan has done a good job by keeping the movie entertaining right from the beginning till the end. He is thought provocative and does not loose focus. Full marks should be given to the action director who has choreographed the action sequences with aplomb and looks are stylish and superbly-executed. The tram chasing scene , the fight scenes in Havana are just mind-blowing and give you an appetizer for more. However , the film do contains some loop holes like the story-telling which is weak on merits and could have been worked upon. Screenplay is decent with few loose ends. The ending of the film could have made little crispy rather than just showing simple one. However , all these demerits are compensated by stupendous performances by Salman Khan and Katrina Kaif. Salman delivers yet again with crispy humorous witty one- liners. Watch for him in the action scenes as well.He just surprises you in every sequence. Katrina did leaves an impact and is not sidelined considering that it is a Salman's movie.She was fantastic in the fight scenes choreographed in Havana.Cinematography by Aseem Mishra is eye- catching capturing beautiful locales of Dublin , London and Istanbul.Music by Sohail Sen and Sajid-Wajid is good but not great. \"Mashallah\" and \"Banjara\" are the pick of the lots. Also , full marks should be given to the rocking background score.\n\nOverall , Ek Tha Tiger delivers what it promises - Entertainment. This has style as well as substance. Salman's super stardom and well-defined content will make it sustainable at the ticket window and has good legs to prolong its splendid run.\n\nGo for it.\n\nDefinitely Watchable 3.5 /5"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "parmvir_87",
        "review_rating": "5",
        "review_title": "Good Action, everything else not so good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "xxxanand",
        "review_rating": "5",
        "review_title": "Ek Tha Tiger can be ignored",
        "review_detailed_main": "If you expected from Ek Tha Tiger then you will be disappointed in a way, because it doesn't keep the promise the title and the previews offered.\n\nKicks off at Iraq where the protagonist a RAW agent n a mission which he successfully completes and returns home and picks up the assignment travels to London and keeps in touch with a so called scientist with the help of his house keeper lady which he eventually falls for turns to be an ISI agent. And Shifts to Istanbul they decide to unite which makes the agencies think they double crossed the country, decides to finish the RAW agent by RAW head and bring the ISI lady to Pakistan by their respective agency. The plot then focuses on how they counter the attack on them and how they succeed. thats all..\n\nKabir Khan done a great job with out his usual way of terrorism by making a love story out of it. And the special mention should go to the action choreographer ropped in from Hollywood, marvelous. The beauty of Istanbul Havana worth special mention doesn't see more often.\n\nAll in all Ek Tha Tiger is worth a watch for Sal-man and Kat only."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "r_omuz",
        "review_rating": "1",
        "review_title": "Ek Tha Mickey Mouse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "kashwin_kohli",
        "review_rating": "8",
        "review_title": "Worth a watch!! Defo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "nisarg11",
        "review_rating": "1",
        "review_title": "If salman khan personally give u ticket for this movie ek tha tiger i suggest PL z don't go.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "gillu2710",
        "review_rating": "9",
        "review_title": "One of the best movies in Bollywood !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "anagpal",
        "review_rating": "4",
        "review_title": "New genre created : Mindless romance, with just a dash of action",
        "review_detailed_main": "This film creates a new genre. We've had mindless comedies, romantic comedies, action films. This one is a mindless romance, with a touch of action and lots of unintentional comedy. Missing is the slickness or tightness or the set piece sequences of action films. Missing is the emotional depth of earlier romantic YRF films, here it is literally like two songs and the romance is done. And most sadly, missing are the memorable, larger than life characters of several films from the same production house, giving us only cardboard cut-outs instead.\n\nNothing makes sense. Not Salman's, a deadly RAW agent's, mission, to find out what a professor is upto (surely there are easier ways of surveillance in todays era of satellite technology and phone taps ?). Not his finding Katrina there, as the professors housekeeper, who's apparently had full access to his house for the last six months but spends most of her time dancing with her vacuum cleaner & choreographing plays. Not Salman's falling for Katrina (didn't really take much to make him fall for her). And then the inevitable discovery of who is who in reality and the equally inevitable drama that follows.\n\nYou're left with several questions as you watch. If you were an agent on the run, would you behave as our friendly neighbourhood RAW man behaved, or would you show more discretion ? For example, if you were caught on CCTV, (even mouthing the words 'we need to run'), would you peacefully be watching a fight in an open square the next day ? Surely there would be some practical conversation with Katrina before taking some of the steps they take ? And perhaps some emotional conversations with her, before or after falling in love ? Everyone, though, RAW, ISI, our lead pair, behave as if they're inhabiting planet dreamland.\n\nSalman looks cool, though a bit stiff and definitely overweight. Katrina looks gorgeous, none more so than while wearing a kilt during a song. Some of the comic moments of the first half are good – Salman's collecting milk amongst his neighbours comments, the DD / Zee joke, the hotel check in and even in the second half the small solution to the door with multiple locks, all bring smiles to the face but the meandering storyline quickly wipes it off. The visuals of the song 'Banjara' were good, wish the lyrics were as memorable.\n\nNo amount of fancy locations, super slo-mo action, A list leads can paper over the fundamental lack of a sensible story. I walked in expecting a slick action thriller. What I got was a mushy, senseless romance. Best to walk in with no expectations, then perhaps there is a chance it works for you. More at www.apurvbollywood.blogspot.com"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "nikhilbhalwankar",
        "review_rating": "4",
        "review_title": "And...TIGER fights only for love !!",
        "review_detailed_main": "If anybody is going to watch EK THA TIGER thinking that its a film based on patriotism and love, then please be aware that its purely a romantic film with action sequences for saving his love. From the trailers, it looks like it would be an action flick which involves fight for country with some quality suspense like WANTED but ultimately its an action flick for saving his love.\n\nSome of the action sequences are really good. Katrina Kaif too showed her action skills well. But some action sequences look completely unrealistic. The movie is better than BODYGUARD (which was worst as far as action sequences were concerned) but not better than WANTED. WANTED always will be on top as far as action, romance, story and direction is concerned.\n\nIn brief, its a purely bollywood type movie with full to romance tadkaa which you should watch keeping your head aside. It could have been made more better if film makers put more efforts on story.\n\nI will rate the movie with 4 stars."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ssvikas",
        "review_rating": "5",
        "review_title": "Typical romance flavored with espionage; a pastime flick",
        "review_detailed_main": "Describe a typical love story: It begins as Boy meets Girl, they don't like each other initially, but love blossoms; then parents oppose and then the couple runs away. But they are chased by both the families who are out to finish them off. Now, just scale-up the scene to two countries, instead of families and you get 'Ek Tha Tiger'.\n\nTimed for release on Eid, Salman's presence ensures a big collection at the box office, irrespective of how the movie actually turns out. Most multiplexes screened shows at hourly intervals across screens to make the best of the long weekend.\n\nSalman Khan plays Tiger, a much sought after RAW field agent who has spent a decade away from home in many adventurous missions. Upon returning from Iraq, Tiger is assigned the task to collect information about an Indian-origin Irish professor (Roshan Seth) facing suspicion of selling missile secrets to Pakistan.\n\nOn his mission, he falls in love with Zoya (Katrina Kaif) who is soon revealed to be an ISI agent trying to hack into the professor's computer. At this point, it seemed as if the film would go the 'Mr. & Mrs. Smith' way, but rather sticks to its roots as a love story. Now, the two agencies, RAW & ISI are out to finish off Tiger & Zoya.\n\nThere are claims that story was inspired by real-life spy Ravindra Kaushik who is said to have served in the Pakistan Army and passed on valuable information to India. The similarity with the story would be that Kaushik fell in love with and married a local Pakistani girl, an uncanny resemblance with Ek Tha Tiger.\n\nTalking about performances, Ranvir Shorey does a good job as Gopi, Tiger's friend and fellow agent who is later sent by his bosses to hunt down Tiger. Girish Karnad returns to the big screen after a long time and he plays Tiger's boss Shenoy. About Katrina & Salman's acting, lesser said the better. In any case, Salman's role is not as annoying or silly as most of his other roles are and he takes off his shirt only once.\n\nThe good part in the film is some awesome stunts and stunning visuals, the latter being the signature style of its director Kabir Khan, best remembered for 'Kabul Express'. The desert scenes are filmed in Turkey stand out, the best are those filmed in Cuba with a 60's charm. The good part is let down by a sloppy writing in some parts and a general lack of suspense or thrill, something germane to an espionage setting.\n\nAlthough the film may perform well due to its star-cast and timing of its release, it will never be considered a good film by any segment of the audience. While the lack of an engaging story will not interest the discerning type, the lack of good songs that flow with the story will not go well with the masses. The popular song 'Mashallah' is played with the closing credits, a time when most people leave the movie hall.\n\nVerdict: Salman fans may love the film and his critics may flay it, some may just watch it for Katrina. At best, this entrée will pass off as an average pastime flick."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "johnronald",
        "review_rating": "10",
        "review_title": "Very Good Action and Romantic Movie.",
        "review_detailed_main": "Salman Mania... Salman's charisma... Salman's screen presence... oh wait.. there is our beautiful KAT too. First things first, Movie is not about some James Bond style trilling missions or turn-around. The movie is about a spy who falls in love with another SPY of an arch-rival country(Pakistan). So please don't go for a BOURNE series type of plot or a JAMES BOND style storyline. Instead, go for SAL-MAN. And his lady, KATRINA. And of course, the ACTION is fantastic. The on-screen chemistry is awesome between the couple. The songs are good. The story is good, for a change(and not like a south-Indian remake).Phew... The best thing about this film is that it leaves you wanting for more in the end..(yes, there is a scope for a second part, which i think will happen for sure) considering the amount of success this movie would garner at the Indian box-office. Final word:- Go for it, and look at it from an entertainment perspective. You will fall in love with the film. Full marks to Salman and Katrina."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "vijay-atwork13",
        "review_rating": "1",
        "review_title": "Not as Expected",
        "review_detailed_main": "Sad to say Salman really disappointed. Ketrina has done well this time. Ek Tha Tiger isn't what one would rate as great cinema, but it isn't just harmless fun. The pacifist message dovetailed into its core lends the film a far greater degree of relevance than Bollywood spy thrillers generally strive for.I am going with two and a half stars. Ek Tha Tiger has enough zing, visual and otherwise, to keep you in your seats for its runtime of a little over two hours. Afterall I can say is One time Watch. Salman's die hard fans will not find movie bad. Movie is enough entertaining and containing new action scenes, dance style. Since the story is based on true events it is totally new."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "arifhasantheking",
        "review_rating": "10",
        "review_title": "Gorgeous movie",
        "review_detailed_main": "One of the best movie 🍿 I love this movie.\n\nSalman Khan perfect for this role.\n\nSo gorgeous movie."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Secysecy",
        "review_rating": "1",
        "review_title": "Stupid movie",
        "review_detailed_main": "The boring and stupid movie! If i get to see this director i will beat him and ask him to stop making movies! Total wastage of time and money! Its better to sit back n watch TV serials! Now u can imagine how boring the movie is! I am not going to waste money on these foolish movies again! Bollywood movies are senseless except for Amer khan's movies! It seems like Salmon, Katrina and director went for vacation and just made a movie to cover up their expenses from people. Please don't watch this movie at all! Its a complete wastage of time and money and mind too! Just relax at home and better enjoy TV! What i have to write two three lines more. The movie is slow boring nonsense awful dumbest"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "achraj",
        "review_rating": "3",
        "review_title": "Huge disappointment... senseless movie...!!",
        "review_detailed_main": "As for Katrina Kaif, she has a large presence in the film and does well in the light hearted scenes as well. In fact her on-screen chemistry with Salman is good too. However one wouldn't term this either as a performance oriented role per se as action takes over the entire second half.\n\nDisappointing. Now that's quite painful outing for a film which had created so much excitement and hype. Of course regardless of the average content, box office will tell a different story since the extended week is going to throw some extraordinary numbers.\n\nAs stated earlier, nothing wrong with that but then the edge of the seat impact is missing, especially when one would have expected a film to go one up over the likes of 'Agent Vinod' or 'Kurbaan'."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "abhishekdas2006",
        "review_rating": "2",
        "review_title": "Tiger or a Cat????",
        "review_detailed_main": "The first promo of the movie created a curiosity in me to watch it. But when watched it....i remained stunned. Who can a director like Kabir Khan can do this? One can not call it a spy movie, nor its a romantic one. A total time and money waste. YRF's only intension is to make money which they did but compromising on the factors of story. The film did well because of Salman Khan and strategic release date. A decent request:- To Yash Raj Films If you want to make a spy film keeping RAW agents in future please stop thinking of Pakistan as a market for your movie. To Kabir Khan Watch some good Hollywood spy movie. RAW and ISI can never be friend."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "rshaikh1992",
        "review_rating": "4",
        "review_title": "?",
        "review_detailed_main": "First, I don't know what the movie is all about. I mean whatever happens with the scientist's story? There is so much focus on the love story but then how is the title suitable to the love story? \"Ek Tha Tiger\" will definitely make one think that the actor does something exceptional to deserve that title of \"Tiger\" but in this movie, I felt like I would have given that title to any other actors (SRK, Hrithik Roshan, etc.) and it would have just worked fine.\n\nOverall, people who have never seen other parts of the world, this movie does an okay job to present other cultures. However, it is the notion of mixing two cultures that often ends up producing movies without any specific plot line such as \"Ek Tha Tiger\". I wouldn't say I enjoyed the movie thoroughly, nor would I recommend the movie to a friend. It's fun watching if you're only looking for actions, nonetheless, not worth your time."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "manojthecoolhunk",
        "review_rating": "10",
        "review_title": "Loved the jodi of Salman and Katrina.",
        "review_detailed_main": "This movie doesn't deserve 5.5 ratings, should have been around 7 or 8."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "bonaparte_abhi",
        "review_rating": "2",
        "review_title": "save urself from big headache",
        "review_detailed_main": "this movie completely sucked.. its not like i hate salman movies.. i watched it this movie as a complete movie fan of action movie.. as all of them were saying, its an action movie.. but to my surprise, there is no action in this movie.. okay 10-15 minutes action scenes.. whole movie was based on romantic genre.. my advice to director.. by putting 15 mins action scenes and RAW and ISI words in a movie, doesn't make it an action movie.. moreover last minute action scenes were lame.. indeed funny.. watch it urself and you will also find it funny.. on the whole.. if u wanna go watch this movie.. bring TIGER balm with urself.. it will help you a lot..cuz this movie will definitely give u a headache."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Zeppelien",
        "review_rating": "1",
        "review_title": "I didn't know ISI & RAW are so 3rd degree agencies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "chowdhurytuhin",
        "review_rating": "2",
        "review_title": "I curse the day when i went to watch this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "islamicvideossu",
        "review_rating": "8",
        "review_title": "Best action thriller movie of the Bollywood",
        "review_detailed_main": "This movie brought the trend of spy action movie the Bollywood. Action was just superb. Even if you are not salman fan you'll enjoy the movie but if you are blind hater then you'll find your way to criticize it."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "arijit-pritamzoro",
        "review_rating": "3",
        "review_title": "cheap method to pass the exam....BUT STILL BLOCKBUSTER",
        "review_detailed_main": "i'm telling you the whole story of my journey to watch this costliest and most predictable hit movie of the year..No doubt we always have a big arrangement on our independence day.so every of my friend just got the issue to watch Ek Tha Tiger first day first show.but i denied and stayed home and waited for the review..at 7 o' clock eve i opened my TV and saw people are cheering and hugging each other and saying \"salmaan is god,and movie is the best\"and no doubt it created history in every section of India..so no issue i booked my ticket on 2nd day show.movie started and after 30 min i got it..I DID ANOTHER MISTAKE AFTER RA.ONE..i mean what kabir khan actually thought about his most expensive movie of all time???can't believe this.he wrote a story exactly same as Agent vinod released some months ago and flopped.he used the same story to run using lots of money to buy Salaam khan and Katrina kaif and their rumor chemistry.seriously i can't rate this movie at all. kabir khan used most cheap method to pass like a 5 pointer engineering student do before exam..by buying expensive pen and pencil and rubber and lots of xeroxes .same thing happened here also,pen was salmaan khan and pencil was Katrina kaif.and rubbers were songs and no doubt story was xeroxed.mashallah song also they put in the end title like agent vinod did with pungi baaja de.i mean why?i can say now\" I betrayed AGAIN! AGAIN!\"..it's too much to write this review in anger.But as i gave this movie 3 stars.because 1>salmaan khan is big factor and main key of entertainment 2>Katrina kaif's smile ..you can get lots of rest on her smile like me..3>LAST 20 MIN (action only)..BUT NO DOUBT..it already a BLOCK BUSTER HIT..BUT STILL A BIG LOOSER..."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "alikhan-23790",
        "review_rating": "10",
        "review_title": "nice nice movie",
        "review_detailed_main": "This is one of my best seen action films in bollywood till date. From beginning to ending it's gone through as an actionable thriller along with love story very smartly. Beneath the whole movie, salman's performance as a spy could be acceptable. Apart from this point, actions sequences from him really come out stunningly and surprisingly. And his love interest, katrina kaif who's also a spy has given her best in both lovable scenes and action scenes which will undoubtedly make you to be excited. According to me this movie is a great recipe which has tasty ingredients such as action,thriller and love altogether perfectly. All action lovers should not miss this film for any reason which is not only for sallu bhai and kaif but also for this amazing scripted film.\n\nPlus points : Action sequences.\n\nPerformance of lead roles.\n\nAmazing climax.\n\nLovable songs and so on.\n\nMinus points : Movie could have been even lengthier.\n\nDon't miss this wonderful entertainment!!!!!!!!!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "anugrah_charles",
        "review_rating": "1",
        "review_title": "Just another Love Story with lots of Action",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "srikanta-52816",
        "review_rating": "1",
        "review_title": "For cast",
        "review_detailed_main": "A cast that dont know how to act. Wonder how these worst actor/ actress are still getting movies. No charm in story. A complete failure. You should not waste your time on this."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Shubham007",
        "review_rating": "1",
        "review_title": "I hate this Movie",
        "review_detailed_main": "Worst Movie Of Salman Khan. I was a big fan of Salman before (EK THA TIGER) and watched almost all movie of him. But this movie is the worst movie I ever Seen. He is becoming Akshay Kumar. On the date of release I buy a ticket for RS 1500 in black to watch this movie but after watching the Movie i thought I will not see any Movie of Salman Khan in My Life. Don't Watch this Movie. Why people make movie when they don't have a story?? Yes, Ek Tha Tiger is without story. it's smashing all record because of Salman Khan presence and Independence day and EID are another factor. It is only for those fans, who worship him!! You cant put comedy and such a serious topic together and be hopeful that it succeeds."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "skazharuddin-26032",
        "review_rating": "10",
        "review_title": "Best Movie Tiger",
        "review_detailed_main": "Salman Khan Performance my God, yeh Story Salman ke sibah koi nhi kar sakta tha.. salman & Katrina Chemestry best.. What direction kabir khan, story, screenplay Outstanding."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ethan_3686",
        "review_rating": "1",
        "review_title": "Awful and boring movie. Avoid please",
        "review_detailed_main": "This movie is so hyped. And the outcome is just a fizzle! Absolutely disaster of a movie.\n\n1. RAW and ISI people are shown as fools here. Two people are able to trick and fool the top secret agencies of the world. Wow 2. Its moral is that one should betray his own country for love. 3. No other interesting characters in the movie. its just running away from secret agents. 4. Acting wise no one stands out. Salman looks fat and katrina is plastic as usual. 5. Not even the songs are good. Just put in unnecessarily!\n\nIn the end all i can say is this movie is a boring mess of a story. Actually no story at all!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "labonytlr",
        "review_rating": "8",
        "review_title": "A Non-Typical Action Film.",
        "review_detailed_main": "Watched Ek Tha Tiger yesterday for the first time because I am going to watch Tiger 3 after releasing, I was not too much tiger fan, but after watching 1st Tiger, I loved it. Considering it's a 2012 movie, that's why the VFX are not Pro-Level, but they are alright. Nothing to say about the acting, SK is BhaiJaan of all. Katrina Kaif's acting was also good, others are not bad. Amazon prime experience was poor, I can't be able to adjust the quality of movie. The picture quality of the movie was good. Bad Part: The Acting of others can be better and Picture quality can be better. I think after watching Jawan at theater, every movie is looking cheap to me.\n\nThe BGM was also Insane.\n\nSo yeah, That's The review if Ek Tha Tiger, No spoiler, Alright?"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "Another sure shot hit, 'Star Guided' business project which is just made to en-cash the 'Idol Worship' in our country.",
        "review_detailed_main": "To begin with, I was really excited to see one of the most hyped movie of our times EK THA TIGER not just for Salman Khan, but for the rare combination of a sensitive director and a super star coming together. Having loved director Kabir Khan's first venture KABUL EXPRESS and to some extent his NEW YORK too, I was eager to see what the 'thinking director' does with the aura around a mega star and how he deals with the interference often seen in such big films from their known names.\n\nThe excitement was also accompanied by some fear generated by its promos, which were clearly cut to exploit the Star-Mania in the nation, instead of stressing more on the film's content or storyline. Unfortunately, my fear won over the excitement as I found EK THA TIGER once again a project just made to en-cash the \"Star Idol Worship\" in our country and nothing else. Being released on a National Holiday (15th August) with an open 5 day weekend (including Eid) and a never heard before number of prints, it is sure going to be a mammoth blockbuster, perfectly planned by its producers and Salman himself. But coming from a director like Kabir Khan, its in fact quite sad and disheartening for the future of our own Indian Cinema which more believes in bowing down in front of its Stars than being confident on their own vision, content and talent.\n\nETT starts off on a typical note with a long fight sequence and then enters into a romantic zone as a trademark feature of a Yashraj film. In the first half it stresses more on the romance between its two stars and less on being a spy thriller. Revealing two completely predictable twists before and after the interval, its pace drops hugely as it progresses towards it overstretched uninteresting climax. So where the first half tries to win over the viewer with its romantic moments, the second half tries the same through its prolonged actions sequences which are well directed but tend to go overboard too (like the train stopping with a coat and again wearing it calmly).\n\nAs expected it's a Salman Khan movie all the way, with him being there in its almost every frame as a RULER. He does everything in the movie ranging from dance, comedy, action and romance regardless of the fact that he is actually playing a country's official undercover spy. Yet for the fans who love watching his comic scenes, the film might turn out to be less entertaining as compared to Salman's last few South remakes. No doubt, the one line basic plot of the film, of showing a love affair between two extreme personalities related to RAW & ISI is interesting. But the way it is executed on the screen, can easily be rated as completely filmy, with the agencies of two major countries of the world trying to catch their own spies like kids. The writers take the viewers as granted as they easily forget their initial plots and get on to the others without caring about any continuity. For instance, the suspicious professor suddenly disappears out of the film and the story shifts to another plot altogether post intermission.\n\nMusic further remains one of the ineffective points of ETT with no particular songs making a solid impact as seen in Salman's previous projects. However Cinematography makes it likable along with a fine background score by Julius Pecham, which majorly works in its action sequences.\n\nTalking about performances, when you have a star called Salman Khan in the film then you don't have performances but only people reacting to his dialogues in the script to their best of their abilities. So Salman plays the part of a powerful spy in his own usual unique carefree style, providing a lot of moments for his fans to cheer loudly. Still one can say that he has a better role to play this time, moving far ahead than his own READY and BODYGUARD.\n\nKatrina Kaif as her rival lady love, holds herself well in front of Salman and looks stunning in some fabulous outfits. She features in few exceptional stunts in the second half (done by a professional), which are bound to get her enough claps and shouts despite of Salman being there in the fight. Supporting them both are all the other actors in the cast who obviously don't have any important significance in the script. And the list has names such as Girish Karnad, Ranvir Shorey and Roshan Seth.\n\nComing to the most unfortunate feature of EK THA TIGER, it's indeed disheartening to say that there is no sign of director KABIR KHAN in the film from start to finish. The sensitivity with which he handled the issue of terrorism in both his KABUL EXPRESS & NEW YORK is simply not there. The interesting writing seen in his above mentioned films seems to be lost in the aura around his STAR and as a result Kabir Khan comes up with the weakest film of his career after an unconvincing NEW YORK. Probably the reason for this lies in his flawed script which keeps shifting its focus from one aspect to another touching romance, action, sacrifice, revolt and patriotism in a vague manner."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "devs_sarkarr",
        "review_rating": "1",
        "review_title": "Below mediocre movie",
        "review_detailed_main": "Below mediocre movie, overacting by Salman, hype around him & absence of acting in Katrina Kaif. And also the movie hurts the sentiments of India's most respected agencies."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "baldaniyajanak",
        "review_rating": "5",
        "review_title": "A waste of time",
        "review_detailed_main": "Is it easy to fight terrorists like this? Why is it possible that Salman Khan alone kills other terrorists. This film is a joke. A waste of time"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "sanketsatbhai-97463",
        "review_rating": "9",
        "review_title": "Tiger awesome",
        "review_detailed_main": "This is one of my best seen action films in bollywood till date. From beginning to ending it's gone through as an actionable thriller along with love story very smartly. Beneath the whole movie, salman's performance as a spy could be acceptable. Apart from this point, actions sequences from him really come out stunningly and surprisingly. And his love interest, katrina kaif who's also a spy has given her best in both lovable scenes and action scenes which will undoubtedly make you to be excited. According to me this movie is a great recipe which has tasty ingredients such as action,thriller and love altogether perfectly. All action lovers should not miss this film for any reason which is not only for sallu bhai and kaif but also for this amazing scripted film."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "aayanmughal-413-449536",
        "review_rating": "4",
        "review_title": "Why did I trust Salman this time?",
        "review_detailed_main": "I would directly start by saying that the movie was utter disappointment and disgrace to spy-action-romance genre. Story was terrible specially in the first half, by terrible I mean lacking in content, illogical and too many unnecessary characters. I guess the basic selling point in writer or director's mind was 'bashing ISI as much as you can.' It's pity that such a film got a huge box office success because I am afraid it will only encourage others to follow the same trend. I mean I understand that its a movie on a RAW James bond and one must not expect anything good for ISI in the movie but guys do it with some logic. Agent Vinod was way better than this. Acting on the side of Salman was just average as usual, Katrina Kaif is Bollywood's Kristen Stewart, no expressions what so ever. And yeah, girl if you have fighting skills then what happens to you when you confront ISI guys. The same illogical unnecessary drama to end first half. Acting on behalf of Roshan Seth as professor Kidwai was outstanding, I guess no one could match him acting wise in the movie. The movie was lacking proper research a big time, Spoken Urdu was as bad as Kaif's real life Hindi skills. I mean guys if you are making a spy movie, do it correctly. Put some class, style, story, logical twist and turns. Action was good I must say, but it didn't look as compact as in Bourne series or even in MIs. Overall, I regret that after successfully avoiding Salman Khan films from Ready on wards, why did I trust Salman again. In a nutshell, movie was too scattered and illogical. Don't waste your time, not recommended."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "subratosaha-60344",
        "review_rating": "10",
        "review_title": "Awesome Movie",
        "review_detailed_main": "Movie Superb... Action fantastic 😍 Salman always best 😍😘😘 Kat Supb 😍 Awesome movie 😍"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Jithindurden",
        "review_rating": "4",
        "review_title": "Bollywoodized spy romance",
        "review_detailed_main": "A Bollywoodized spy romance starring Salman Khan, well you can't expect much more than this from that. Even though I didn't like it the first time a decade ago, people talking about it kinda made me think it was at least average which doesn't seem to be the case. But the music made it well worth it. Even if I could live in a world without this movie, it would've been a very sad world without Mashallah, Saiyaara or Lapata. But what's with the theme music of Tiger? It makes me wanna sing Mai Hoon Don, it sounds like a total ripoff and no one noticed this or am I being dumb?\n\nFor a Bollywood movie from more than ten years ago, this had a surprising amount of longer action sequences even if the film is not filled with action. I guess this is when that started to get serious here. But post-2000s Salman's wooden face seemed to have helped CGI it into the stunt double's face. A lot has been done in terms of action but it's mostly carbon copies of some scenes from a Hollywood movie made a little bit over the top with so many bad camera angles and editing to hide the stunt double that doesn't really work or the movements just not looking good enough. Even if I wasn't expecting too much action from a 2012 Bollywood movie, I expect them to shoot it a bit more stylishly even if it is little. And what's with the horrible continuity errors throughout the film? So many mistakes, and so many props showing. An empty chair from one side, and the person on the chair when the camera angle changes to the other side. Car door changing into beds etc, so many!\n\nNonetheless, the pacing was perfect in a way that is not too fast but fast enough to see the Bollywood silliness but not be too cringed with it, so it was still kinda fine. So, the film had a nice flow even if most of it was stupid, and the ending with the Mashallah song sequence worked out to make me feel satisfied at the end."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "pshukla-34986",
        "review_rating": "1",
        "review_title": "Absolute flop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "behnamboogi",
        "review_rating": "5",
        "review_title": "NormaL",
        "review_detailed_main": "Ek Tha Tiger, also known as Once There Was a Tiger, is a 2012 Indian action, adventure, romance, thriller, and drama film directed by Kabir Khan. It was produced by three companies, CounterPunch Studios, Fantastic Films and Prime Focus; Aditya Chopra, Kabir Khan and Nilesh Misra jointly wrote the script of this film and artists such as Salman Khan, Katrina Kaif, Ranveer Shorey, Girish Karnad, Roshan Seth, Gavi Chahal, Rajendra Sethi, Avinesh Badal, Bhupesh Singh, Sanjay Gorbakhani, Samar Jai Singh, Ashok Awasthi, Xerxes Khandadia and others have played roles in it; Once upon a time there was a tiger was first released on August 15, 2012 by Yash Raj Films in Indian theaters and managed to gross $62.5 million at the box office, then on November 19, 2016 by Amazon streaming service. Amazon Prime Video was released online simultaneously in America, England, Canada, Australia, Brazil, Italy, France, Germany, Belgium, Sweden, Finland, Denmark, Taiwan, Tunisia, Luxembourg, South Africa, Norway, India and other countries. ; Once upon a time, Tiger was there, after participating in many international festivals, it won 19 awards, including the best film, the best actor, the best actress, and the best special effects, and was nominated for 16 other awards, among them We can point out the nominations for the best dance, best film, best actor, best actress and best action film; When Tiger Existed is the first part of Tiger's film series in the spy world of YRF (Indian Cinema Spy World."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "raktimdhar-65847",
        "review_rating": "9",
        "review_title": "GREAT",
        "review_detailed_main": "Its an out and out Blockbuster movie... salman katrina... great action .. beautiful locations..."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "khushisengupta",
        "review_rating": "10",
        "review_title": "What a Movie.. Blockbuster",
        "review_detailed_main": "This is Awesome.. Best movie.. tiger & zoya rocks. Music, Action, story, screenplay, salman khan & katrina Performance awesome."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "nikhil-thakur4",
        "review_rating": "2",
        "review_title": "The Best Part",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "dhananjayjadhav-39578",
        "review_rating": "1",
        "review_title": "Boaring",
        "review_detailed_main": "I watched this movie This more than boaring than any movie Whenever kat comes on screen you goes to sleep automatically Only stardom not works salman Half of the movie is shot by your duplicate Andhbakt fans of salman Vfx of last shot made me go to die"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "theranjith",
        "review_rating": "4",
        "review_title": "Tiger?? Just stop kidding..!!.",
        "review_detailed_main": "I decided to watch this movie for its box office record. Yes.. i know how sallu movies would be despite its success. It's a love story between a Indian RAW and Pakistan ISI agents. Movie starts with some good action sequence. Then it drags when the romance sequence starts. The romance between Sallu and Kat is not sizzling. First half is more like boring and test your patience. Comparing first half , second half of the movie is OK. It's full of chasing sequences and twists. Ya.. whenever the director wants to surprise the audience they will make a twist and it fails to attract most of the time. Kat in action sequences fights more like a super woman :). And yes need to mention about RAW and ISI officers. Lol. They make fun of our RAW agency. We may start to think how silly those guys are . Second half fully lacks of logic. When you exploring into the secret agencies, the logic must not fail into any place, but in this movie you hardly find any logic. And whenever the villains(RAW n ISI) tries to shoot the Hero, the bullets would be empty in their gun (logic!) so they can't shoot the hero and kill him ;). Huh.. you must leave your brain away even for this Action/Thriller at least to watch this movie fully. Totally avoidable. Not worth to watch."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "surajseervi",
        "review_rating": "9",
        "review_title": "Tiger's swag is unmatchable 🔥",
        "review_detailed_main": "What an amazing movie by salman Khan and kabir Khan, Beautiful love story with spy action 👌👌👌, the ending scene and salman's entry scenes were amazing 👏"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Sherazade",
        "review_rating": "4",
        "review_title": "Glorified fluff with glitter on it, is still fluff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "chiremath",
        "review_rating": "8",
        "review_title": "Power-packed spy movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "suranjanadsys",
        "review_rating": "1",
        "review_title": "Ek tha G a * * * d u",
        "review_detailed_main": "Sorry to say but its a worst one again by our derfutia. This der futia should stop playing with the half age girls. I am late to review this film...wish I could make time earlier to write few words on this earlier.\n\nThis Derfutia's overacting days are gone now. Do the things that suits him why pressuring himself to those young ladies romance. I am sure even katrina is fed up with this old derfutia. Hope he use some brain n see the world around. New comers are way ahead of him in terms of acting, physique and in every field.\n\nIts time to step down and get some Dadaji or papaji type role to feed himself in the industry."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "mayank_782",
        "review_rating": "5",
        "review_title": "Over-hyped film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "nesrine-ghajati-178-813028",
        "review_rating": "3",
        "review_title": "torture...",
        "review_detailed_main": "I like Bollywood movies...I kinda like Khatrina..but Salman..why is the guy even still making movies? the dancing was bad..the plot bad..the acting bad...come on they are supposed to be special agents for god's sake..apart from a little action..no character or behavior of a spies!\n\nanyhow..I just finished in the breaks I took from studying..which I never do to a movie!\n\nSalman looks tired all the time.. Apart from one song ..I could not understand why some songs even were there..\n\nThe movie could have been longer.. That wouldn't have bothered me ..\n\nAnd the issue India/Pakistan ..come on..if you have to chew that chow that shoo some more..do it with style!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "dbk-36829",
        "review_rating": "10",
        "review_title": "Stylish action",
        "review_detailed_main": "Go for it if you love to watch action movies. Songs are also nice , must watch action flick"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "awsaf_rahman-1",
        "review_rating": "1",
        "review_title": "Agonizingly awful",
        "review_detailed_main": "There are certain movies that are so bad that they give you a bad headache along with a sense of regret for wasting time and money but ek tha tiger eclipsed that feeling! If I wasn't watching this film along with a bunch of other people I'd have puked or may be tried to strangle myself to death rather than watch this horror of a movie. Please for your own sake, steer clear of this. I'm a self proclaimed huge Salman fan but even I couldn't digest this disgraceful movie. These petty action sequences where Salman beats 50-60 guys with his bare hands and mind you bare chest as he always takes his shirt off, is getting ridiculous! I couldn't rate this movie even if you put me at gun point cause even 1/10 doesn't seem bad enough! Mindless Flick!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "messigoats",
        "review_rating": "10",
        "review_title": "Tiger",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "rajlal1331",
        "review_rating": "1",
        "review_title": "run,run far away from it",
        "review_detailed_main": "khan tries to play bond,don and all his unfulfilled desire and could not even match johnny English.he jumps like monkey ,talks like donkey and dances like chimpanzee. he just looks stupid doing all the actions. add to that the an inconsistent and messed up script. songs are awful .katrina is only the good thing in the movie. she dances well and does action better than her counterpart. the background music is so horrible that u cant even sleep and have to watch this torture. do not recommend this. u also don't recommend even to your enemy. highly avoidable.waste of your time.it is waste of your money.it mocks your intelligence.proved again this khan only does films for money. pity is he neither can act nor has any script sense. run,run far away from it."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "willcundallreview",
        "review_rating": "4",
        "review_title": "Cake!",
        "review_detailed_main": "Ek Tha Tiger is an Indian action spy film starring Salman Khan and Katrina Kaif in the two main roles. It's marketed on the posters and images of the movie as if it's some kind of full throttle action movie but in truth although containing some fighting and shootouts, it's mostly a weird kind of Rom-Com movie. Of course Bollywood rarely lacks romance and this is the same, it does try to thrill and the ending does add a little boost to the story but it's the beginning that truly drags this down and stops it from being near okay. The choreography is nicely done when it is shown and the dancing and singing is lacking in true style but is still pretty nicely taken care of. The main problem is with the story itself and the over dramatic or just plain stupid scenes that really make this not worthwhile.\n\nListen Salman Khan isn't half bad in this but he never truly gets into the role, the action scenes he more than takes care of and he excels mostly at the end, I just don't think he is overly great here in serious dialogue. Katrina Kaif is well cast as Zoya, a lady who reveals her back story the more the story goes on but really she is no different here to a lot of similar leading ladies roles seen elsewhere in Bollywood and fails to make an impact. The cast is kind of well used but never truly that great, it is better when the film focuses more on Salman Khan's character Tiger as the rest of the cast feel a little pointless and the goons placed around the movie are pretty dispensable.\n\nKabir Khan the director and co-writer had never really made an action movie before doing this so it can't be expected for him to get it spot on; he does however keep it at least fast paced although it can be a little implausible at times. The story is a little stupid in truth and the beginning is not handled well in the script but also in the direction and even in the background music, it can feel as if this is two films split into two and then wrongly put together. The choreography of the dancing as mentioned can be nice but can also be too random, I have always felt that in Bollywood movies the singing and dancing has to be positioned just right for it to work within the plot, this I feel does not time it all right.\n\nSo really overall a pretty lame movie but one that can the slightest bit enjoyed if you ignore the silly parts of it. It also has some really nice locations and it isn't filmed that badly, hey even the effects used aren't used overly that much and you don't notice them too much so it's not annoying in that way. Salman Khan can probably take some positives from this as maybe can Kaif but truly this could have been done better, but to be fair I just think the whole story just never worked."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "BeingFara",
        "review_rating": "10",
        "review_title": "One of my fav SK's action film & Bollyw as well",
        "review_detailed_main": "First of all to say how shocked I am by the rating of SK's genuinely good films on this platform. How can a film like ETT hv such a rating Its an extraordinary film, I was super impressed with this film it looked like I was watching a Hollyw film the Bourne Identity franchise, be it for its story, direction, location or the action of the film. Not saying this bcs Im a SK fan but ETT is among one of the best Bw action films. Congrats to the whole team especially to Kabir sir."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "radatarun-47564",
        "review_rating": "9",
        "review_title": "Action thriller",
        "review_detailed_main": "High octain action perform by Salman khan And Katrina Kaif..."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "cacmabikram",
        "review_rating": "9",
        "review_title": "Heavy action sequences",
        "review_detailed_main": "Both Salman & katrina are perfectly match the characters."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "zqsvzddw",
        "review_rating": "9",
        "review_title": "One of thw best movie of Salman.",
        "review_detailed_main": "I can't forget the craze and appreciation of audience , that I have experienced while watching it in theatres."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "salmasekh",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": "One of the my favorite movie, romantic thriller action.. Screenplay, salman & kay rocks."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "khushipatil-53835",
        "review_rating": "10",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "tusharadhikari",
        "review_rating": "9",
        "review_title": "Best action film",
        "review_detailed_main": "This a film whose action and love chemistry will be remember in future days a must watch movie."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "samiulhoque-94948",
        "review_rating": "10",
        "review_title": "Excellent movie",
        "review_detailed_main": "Salman sir superb story: interesting story Direction: Kabir khan was superb Production: we all know Yash Raj banner every movie outstanding Music: superb Background score: superb."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "pranjulpoonam",
        "review_rating": "8",
        "review_title": "A fantastic thrilling entertainer",
        "review_detailed_main": "Ek tha tiger is a superb entertainer and winner in all the ways. Two opponent spies love each other and then what happened....this tells Ek tha tiger Kabir khan direction is very good,story different and very nice, screenplay is also up to the mark. Music is very good,all songs are very lovable Salman khan again looks dashing macho man as raw agent,he delivered one of the best performance,his fight scenes are tremendous.katrina did a very good job as Pakistani agent.Girish karnad is excellent. Overall Ek tha tiger is a beautiful action thriller and deserve to worth watch in my opinion."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ramkumar-28288",
        "review_rating": "9",
        "review_title": "Action flick",
        "review_detailed_main": "A very good action film by Salman. a must watch for everone"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "rs-24335",
        "review_rating": "10",
        "review_title": "Come on man! It's a good movie!",
        "review_detailed_main": "Come on! It's an action entertainer and it does it's job. You come out experiencing a good amount of action and blissful music. Stop being hypocrites people. You love it when Hollywood does a linear action movie. But when Bollywood does it, you start bashing it. This won't make you cool. It's a damn good movie."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "muhammadsuel",
        "review_rating": "9",
        "review_title": "Top Indian spy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "worldbeateruk",
        "review_rating": "9",
        "review_title": "This film has converted me into a Salman Khan fan!",
        "review_detailed_main": "Before this film, I wasn't really a Salman Khan fan. His last couple of films weren't really my cup of tea. Dabangg was OK, but this is amazing! There's no two ways about it. I hope it's onwards and upwards for him from here! The film is a romantic espionage thriller where Tiger (Salman), an Indian RAW agent, is sent to Ireland for a simple mission. There, he edges closer to his human side after a meeting with Zoya. It's a global roller-coaster ride from then on, packed with amazing music, breathtaking locations and stunts.\n\nOne thing that may influence your decision to watch this is the performances. But let me tell you that they are second to none! Salman Khan is the best I've seen him since 'Tere Naam' (2003). Katrina is the best I've seen her since 'New York' (2009). You may be pleased to know that veteran actor Girish Karnad is also part of the action, as is offbeat actor Ranvir Shorey. Great job guys! Overall this is just the complete package. If you don't see it, you'll be missing out on a great, exciting experience for sure. Go watch it!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "gofernandof1",
        "review_rating": "10",
        "review_title": "Epic!! You wouldn't expect anything less from Kabir Khan's exploration of the world of espionage.",
        "review_detailed_main": "Saw this film on Eid (19 August here in the UK), in a packed auditorium at a cinema. Here's what I thought.\n\nFirst thing's first. The film is a romantic action thriller, set in the world of international espionage. It tells the story of Tiger, a RAW agent, who's sent to Dublin to observe the activities of an Indian scientist suspected of leaking missile technology information to Pakistan. However, a meeting with Zoya (Katrina Kaif) makes things very interesting. I'm not going to say anymore, you're just going to have to watch it. Director Kabir Khan, primarily of New York (2009) fame, has gone for another meaningful story, and it works big time! The action in this film is spectacular. The stunts set up and choreographed by Conrad Palmisano are simply breathtaking. It takes action in Indian cinema to new heights.\n\nPerformances: Salman Khan as Tiger: Great performance by him as a ruthless, duty led, agent - his best since Dabangg or even Tere Naam.\n\nKatrina Kaif as Zoya: Katrina shines again after New York. One of her best performances for sure.\n\nRanvir Shorey as Gopi: Tiger's aid, another RAW officer. Both are good friends really but does their friendship get tested? Ranvir is great as he has consistently been throughout his career.\n\nGirish Karnad as Shenoy: The veteran plays the RAW chief and Tiger's boss. He is consistently good throughout. He plays this role with authority.\n\nLove the cinematography and foreign locations, especially Istanbul and Havana.\n\nMusic's great too.\n\nOverall a must watch for those who have been waiting for an amazing action thriller. The romantic element has pretty much all sections of the audience covered. I can't recommend it enough.\n\n10/10"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "pratyush149",
        "review_rating": "10",
        "review_title": "awesome....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "vickyboyin",
        "review_rating": "10",
        "review_title": "Supppperrrrr",
        "review_detailed_main": "Ek Tha Tiger is a awesome movie.. must watch... Action sequences are good and best in the Bollywood till now.. Salman and Katrina's romance scenes are really good.. Songs are good too.. The song lapatha is picturized very well.. Salman looks awesome and so do Katrina (she is a eye candy)\n\nIn a nicely done opening, with enough slo-mo shots for the fans to whistle at, we're introduced to RAW agent Tiger (Salman Khan), who, in a gritty Jason Bourne-ish action sequence, swiftly dispenses with a turncoat agent, then dodges armed assassins through the cobbled streets and dingy alleyways of a busy town in Iraq. Back home unscathed, Tiger, who we discover is just as comfortable with a ladle as he is with a gun, bribes his boss with homemade daal before begging for a new assignment."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "luckylaraib",
        "review_rating": "9",
        "review_title": "Ek Tha Tiger Super Awesome Blockbuster",
        "review_detailed_main": "Hmm.. Where to start.. Summery: Ek Tha Tiger is a action/love Story. Salman Khan from the first scene to the last rocked.. Katrina was superb.. others acted also well the music was good the action was awesome.\n\n*Details: The movie is a Action packed Love story Salman khan did awesome job as Tiger From the first scene of the movie he was awesome all the Dialogue's were awesome the action was there the romance was there everything worked well. In the action scenes Salman khan looked like he is doing the scenes in real and the expression were very awesome. Katrina Kaif Did splendid job and her action scenes were awesome too. Both Kat n Salman rocked the other cast members did their job well the music was there and at the right time.\n\nafter i finished watching the movie i wanted more i was like no i wanna watch it more.. and these type of movies are very few which ends and give you thrust for more.. :)\n\n*Music: 10/6 \"Songs i Liked Saiyarah & Masha'Allah Other Songs Were Also Good\n\n*My opinion: If you ask me ill say Watch it now 10/10"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "chandank13",
        "review_rating": "10",
        "review_title": "A Full Paisa Wasool Movie",
        "review_detailed_main": "EK THA TIGER is just an awesome movie! I watched it today at V3S Mall (FR). The opening sequence was just more than awesome! The rest of the movie was also great. The action was superb and top notch and far better than any other Hollywood Spy Movies like recent James Bond movies! There were not pure comedy scenes but some situations and dialogues were just funny! Music has been always a best part of Salaman's movies and it shows here too! A full PAISA WASOOL movie! And a great applause for the Director Kabir Khan for his best direction ever! Go and watch this movie with your family! Missing this will be a crime ;)\n\nPS:- Please watch any movie while keeping your 'brain' at your home. If you want to apply 'Brains' then better watch Discovery Channel."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "sabyasachi-kakun",
        "review_rating": "9",
        "review_title": "Best Movie of Salman in the last 4 years",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "kamalkaran",
        "review_rating": "10",
        "review_title": "Amazing!",
        "review_detailed_main": "Salman Khan, Kabir Khan, Katrina Kaif, Girish Karnad, Ranvir Shorey and co have given us an unforgettable film.\n\nThe film is a romantic action thriller that is wholesomely entertaining and has a message. For this reason, I hope Saif Ali Khan (Agent Vinod) and JP Dutta (Border, LOC Kargil) watch this film. Director Kabir Khan does it again.\n\nNot only are Salman and Katrina amazing in their respective roles, but they also have great chemistry on screen. I never thought I'd see Salman doing such a role but now I hope he does interesting roles like this more often.\n\nThe visuals in the film are top notch, as you would expect for a film shot in several countries worldwide, Ireland, Turkey and Cuba being only 3 of them.\n\nI just fell in love with the album. All the tracks are pretty spectacular.\n\nAll in all I loved this film, and I hope you will too. Not only is it a film that's easily a landmark in Indian cinema in terms of action/stunts, but it's a film that will keep you interested for 100% of its running time too. Just watch it. I won't blame you if you watch it 2 or 3 times in theaters."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "khanbaadshah23",
        "review_rating": "10",
        "review_title": "I agree that this is the best action film in Indian history, even with the romance. It's so good it reminded me of the time in Salman's career when he",
        "review_detailed_main": "This film is superb, and it totally lives up to the hype created previously.\n\nPerformances: Superb, Salman is totally on it in this film. Katrina is great too - one of her best performances. Girish Karnad is amazing, and Ranvir Shorey does well.\n\nCinematography: was always going to be amazing. After all, it's shot in several countries worldwide, including Turkey, Ireland, Istanbul, Iraq, Cuba.\n\nDirection: All I can say is that Kabir Khan has done it again.\n\nMusic: An amazing album. Mashallah and Saiyaara are the best tracks.\n\nOverall: Amazing. I'm sure everyone in your circle of family and friends will enjoy this. Having already smashed box office records, this is a sure shot Blockbuster!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "skthebigstar",
        "review_rating": "10",
        "review_title": "Even critics are praising this film! And I can't say I blame them.",
        "review_detailed_main": "There's no question that the 3 Khans (Salman, Aamir, Shahrukh) have ruled the Hindi film industry, unrivaled, for the last 20 years or so. But the question is: why? Answer: this film is an example that shows why. Indeed, the films they've made have pulled crowds to theaters time and time again, but this one is special. For the figures seen on the box office reports are unheard of, as they were for 3 Idiots.\n\nWhat you get with this film is sheer value for money. Not only that, the sheer nature of the film will and has enticed many to go for second and even third helpings.\n\nEven here abroad, there were whistles in the crowd when Tiger appeared on the screen. This is the first time since Dabangg he has provided unquestionable justification for them. His best film in some time.\n\nKatrina Kaif delivers her best performance since New York (2009). Truly Kabir Khan has got the best out of her yet again.\n\nThe supporting cast don't have good amounts to do. This is the first time I can say that about a Salman film in a long time. However, they complement him well and complete the package. Special mention to Girish Karnad and Ranvir Shorey, and even to the professor! Dublin is stunning, and Havana and Istanbul are amazing too.\n\nChances are that you'll absolutely love the visuals! Costumes in this film are stunning, way better than Agent Vinod. Probably because it's a Salman Khan film.\n\nLoved the directors touch in providing us an insight into different cultures and injecting humour into the film.\n\nThis is a complete entertainment package that will make you think too. It's not mindless like Ready, but it's not as complex as Inception either. It's more international than ever before for Salman. Kabir Khan gets it right. Watch it, but make sure you're prepared of the possibility of watching it a second or third time.\n\nSo finally this isn't your typical Salman Khan film, you know like Ready, Bodyguard and so on. There's method in this. You just gotta watch it.\n\nP.S If you're concerned that it's anti-Pakistan, it's not. Kabir Khan was right, and it wasn't the right decision by the Pakistani censor board to ban it."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "yunusitboss",
        "review_rating": "8",
        "review_title": "Ek Tha Tiger (U/A)-----------my Rating: 4/5 EXCELLENT",
        "review_detailed_main": "Ek Tha Tiger (U/A)-----------my Rating: 4/5 EXCELLENT\n\nIt is an action romantic thriller movie..... * Katrina and salman rocked their performances in both action and romantic scenes... * Story was simple but enjoyable with very fast screenplay... * Direction and cinematography stunned the audiences with very fresh locations.... * Songs were different and suites to the moods of the location....\n\nStory is not ended probably but we can except EK Tha Tiger Part-2 - Masha Allah song comes at the end that lacks the audiences to stand and watch through it.....\n\n\nFinally the movie has many fresh things .. It is more than one time watch...\n\nEk Tha Tiger is a romantic thriller which tells the story of a college scientist suspected of selling missile technology secrets to Pakistan. The Indian government sends a secret agent, codenamed Tiger (Salman Khan), to find out about the professor's activities. Zoya (Katrina Kaif) who is studying at a fictional dance academy located at TCD, and together they embark on a roller-coaster journey that takes them from Dublin to Istanbul then to Kazakhstan and Chile."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "indianfilmfan89",
        "review_rating": "10",
        "review_title": "I absolutely loved it!!!",
        "review_detailed_main": "So I've been hearing a lot about this film since last years digital poster. I did some research and found that it was being directed by Kabir Khan, one of the best storytellers. A year later it's released and it's all that I was expecting.\n\nSalman and Katrina light up the screen with amazing chemistry. Salman Khan does his own stunts and the breathtaking action sequences by Conrad Palmisano did get whistles from the crowd. They both fulfill their roles very nicely!! Girish Karnad and Ranvir Shorey are great too.\n\nI totally love the worldwide locations of this film. It made me want to go on a world tour!\n\nIt's worth noting that this is a romantic film too and a balance between the romance and the spectacular action sequences is required and is well achieved.\n\nMusic is great. I mean, I really don't have to say anything more about it.\n\nOverall this film is an experience and a half. Watch it for Salman-Katrina, Girish Karnad and the amazing action and locales! Highly recommended!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "chaingangritesh",
        "review_rating": "9",
        "review_title": "Perfect entertainer",
        "review_detailed_main": "Well, first things first, general notion has been that one never watches salman movies with brains unlike srks, because salman portrays larger than life roles, especially in recent years, so all you do is just buy the ticket for your entire family(yes you can watch mostly only his movies with family now a days) when his films releases, and have real masala entertainment, laugh, some visual treat to watch salman on screen, because no doubt he has a unique persona that charms from toddler to grandparents.\n\nCome back to movie, well with this movie one notion of salman, that he cant act gets eroded, because he plays perfectly RAW agent, action sequences are as promised never seen before, kat's role too perfect too. story may be missing to some extent but their action itself is a story of the film.\n\ni think this movie can surely garner 200cr plus within 2 weeks\n\nit has already garnered 33 crores for first day collection, which is highest ever collection by any bollywood film in the history.\n\nso only I say, on 15th august 2 histories were made, one being in 1947, we getting freedom, and in 2012 we getting this awesome blockbuster to remember throughout life.\n\nhope you all like my review."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "hyadav278",
        "review_rating": "10",
        "review_title": "one of the best movie",
        "review_detailed_main": "it is awesome movie..... one of the best movie of khan best action best romance one of the best movie of bollywood.... overall very good movie. i love it so so so much i watch movie 2 times and want go another 2 times. love u salman and thank u. every one go to watch the movie . there are so entertainment .he is playing a cherecter like a Indian james bond . so no one create logic for salman movie . just go and watch movie with fully entertainment. i am salman kahn fan but after this movie i am the biggest fan of salman khan. katrina also play a good character and (ranvir )was also excellent. there are no reason to say not a good movie........best of luck salman khannnnnnnnnnnn"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "danishcurrent999",
        "review_rating": "9",
        "review_title": "blockbuster ek tha tiger..!!",
        "review_detailed_main": "romantic thriller with awesome action scenes..... story line up was damn good and acting was also very good..... climax could be made better than that..... just for the climax there are many mixed reactions... for me its a blockbuster.... liked it over all... i can give 9 out 10 because of climax... if the climax was better than that .... i can guarantee that this movie would get 10 out 10...!! anyhow awesome acting of salman khan and katrina kaif will impress every one... and mainly the stunts made by katrina... damn gud....!! music at the time of actions give's feeling of 3D.....and the leg tapping songs with sexy look of katrina makes the movie blockbluster.The movie has all kinds of scenes-Comedy,action,romantic etc etc which makes it must watch...!!"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "gajjar-rushi-a",
        "review_rating": "8",
        "review_title": "It's an awesome blossom movie & I loved it!!!",
        "review_detailed_main": "Hi, I believe in quality of movies & I enjoy various types of movies. Earlier I thought that I would not watch this movie EK THA TIGER (now I am happy that I've seen it) because of promos & not-so-nice-music but while watching movie I didn't know when it's about to over, I wished it could run some more & I would see some next chase, next action sequence, & some next twist in the movie. Ultimately it's a pure entertainer & believe me, it's not a non sense flick. Action, dialogs, direction, & above all, photography of this movie is really appreciable & hats off to Kabeer Khan (director) and Salman Khan (the actor).\n\nI enjoyed it from 1st frame to last frame & never felt bored, irritated, overwhelming, & awful. It's AWESOME movie & those who likes fast paced action flicks they'll enjoy this movie.\n\nI don't know much about rating system & I don't go on critics as well but all I can say is this is worth your every penny & every minute.\n\nThis movie has already broken various records on box office & it's rocking. Salman Khan finally became Rajnikant (South Indian mega star) of Bollywood film industry. He gave 5 hit movies in the raw (WANTED, DABBANG, READY, BODYGUARD, & EK THA TIGER) and for producers he's like an ATM so hats off to my dearest Salmanbhai.\n\nThat's all guys, if you've not enjoyed this movie yet, don't listen to anyone who says it's a bad movie & enjoy it like me. :) I am happy with EK THA TIGER.\n\nRushi Gajjar (Ahmedabad, Gujarat)"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "akshay-akki24",
        "review_rating": "10",
        "review_title": "FACT : A Salman Khan film does not need a review! (Ek Tha Tiger Review)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "bhasinenator",
        "review_rating": "8",
        "review_title": "TIGER does fall in Love",
        "review_detailed_main": "The movie starts off as a typical Salman style action genre.As the movie progresses plots change real quick.Thus, asking the viewers to second guess what the plot is.\n\nAs the movie unfolds with Katrina's marvelous physique and Salman's style, the viewers start to understand the love angle inherent in the movie.With back to back detective movie like scenes the movie races to its actual plot.\n\nFull with probably the most contemporary James Bond and Arabic musical combos, the movie does set your pulse racing more than once.A pinch of Mr and Mrs Smith factor to this and we are ready with crux of the plot.\n\nAll in all, brilliant music,attractive frames, impressive supporting cast and well directed action scenes make this flick a distinctly positioned must watch Bollywood movie-probably marking the beginning of a new short and sensible movie making."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "jassujith",
        "review_rating": "8",
        "review_title": "Not a must watch movie... But n entertainer",
        "review_detailed_main": "Am not a big fan of Salman or Katrina.Went to see this without much expectation too. It is a good film. At some point of time Salman says ... \" Will hide until India n Pakistan throws out ISI n Raw\". That sentence has many meanings in it. Pros- Unlike other movies, they don't abuse Pakistan or ISI much.They don't even praised India too.That part I liked .Action scenes are good. Songs were average. Good Love story + action thriller. Cons - On some scenes we can see the face of dupes of Salman n Katrina. Could have avoided some extra talented fight scenes (which is normal these days in Tollywood and Kollywood). This is not a must watch movie but an entertainer."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Ek Tha Tiger",
        "review_detailed_main": "Salman Khan in recent years have been in top form, becoming the box office phenomenon and cementing his popularity and legacy with iconic roles in films from Wanted, Dabangg, Ready, Bodyguard, and now Ek Tha Tiger. Not to diss the other filmmakers who have enjoyed success together with Salman, but his first work under the Yash Raj banner has the usual YR gloss being applied, making it quite the stylish affair to accentuate Salman's charisma on screen as the larger than life Tiger, formidable and arguably the most fearsome field agent for RAW, India's external spy arm.\n\nPakistan had reportedly banned the film, since the story deals with RAW vs Pakistan's ISI in highlighting the obvious odds between them, in a spy versus spy world where the opening act had Tiger tail, intimidate, interrogate, battle, and finally walking away victorious from scores of ISI agents hot on his trail. We see him exercising his reputation first hand, and is what 007 is to MI6, and come to observe plenty of his parkour like skills in many rooftop chases throughout the film, with Salman doing what Salman does best in his many action roles, to thunderous applause of approval from fans in the audience.\n\nThe setting in this film is ambitious, with similar 007 jet setting to beautiful though not quite far flung locations with the likes of Iraq, Ireland, and even Cuba, so with different locales brings about different stunt teams and choreographers to vary the flavour of the action. It's a little pity though that at times, because of Salman's bulk in physique, it's quite discerning to note when a stuntman takes Tiger's place, since one would not want to risk the big star's safety in some of the more dangerous stunts. And because Salman will always be Salman in a film and does what he does best, there is no lack of camp and sense of fun, with movie logic thrown in by the bucketloads for good measure, otherwise you can't get away with sliding down a hill on a car door and passing through highway traffic unscathed, or have the ability to call upon a ramp in the middle of a runway. Yes, we live for moments like this in a Hindi action movie.\n\nStill, with big budget action spectacle, such as the stopping of a runaway tram being one of many highlights, the story grounds itself into a romantic one. On his latest mission to spy on an Indian scientist allegedly giving away trade secrets on India's anti-missile system, he falls for the scientist's caretaker Zoya (Katrina Kaif) unwittingly, and having not been in love before (you see, it's an occupational hazard), he turns from tiger to tame pussy cat in her presence, going extra miles and veering out of mission objectives (he would deny it of course) just to spend more time with her. And ultimately, it is this emotion that will cause him to hang a target board on his back from both RAW and ISI, and for a man in love, will do just about anything to be able to walk into the sunset with his lady love.\n\nSpilt into two halves, the narrative in the first comes complete with comedic moments, especially with Tiger's Ally McBeal-ish moments of fantasy each time Zoya's questions becomes something of a funny reminiscence that screams of what he would like to explain, but can't. It gets all serious with the politics in the second half though, with fears from Tiger's direct supervisors of his potential of leaking information of his country into the enemies should he be captured, so in true clandestine style, the Tiger has to be put down without prejudice. Such is the world of the movie spy, with a twist in the romance that Shakespeare himself would be proud of, especially when it has to rival the bard's greatest love story ever.\n\nIt's no doubt that Ek Tha Tiger would be the blockbuster it's expected to be, for its lush production values now combined with two of the hottest Hindi stars of the present moment. Salman Khan and Katrina Kaif sizzle on screen with their chemistry each time they appear together, whether for a lovers' sharing of sweet nothings, or when it's time to hit the action button. At some points in the last act come questions of loyalty and allegiance that would put you on the edge of your seat because you'll find yourself drawn into rooting for them to get out of the deadly scenario they have put themselves under, though credit has to be given for not stretching those moments too far that it gets bogged down by its own doing.\n\nThe songs in the film serve as another major highlight, since they punctuate the romance and the action, without a song and dance moment in the film being felt out of place. Banjaara had Sukhwinder Singh's vocals, and allowed Katrina Kaif to become the clotheshorse with a number of costume changes throughout. But my personal favourite from the soundtrack is Mashallah, though featured in the film only as the end credits roll. Anyone doubting the chemistry between the leads, should just take a look at any of the film's music videos to be convinced.\n\nDirected by Kabir Khan, who was at the helm with films like Kabul Express, and New York, he has shown a knack for being able to craft stories that are larger than life, and being entrusted with Ek Tha Tiger after only two films with the studio, demonstrates the confidence it has in the abilities of the director. Hopefully, with the announcement of a sequel being green lit, we'd see another Tiger outing with Kabir at the helm again. Definitely recommended, for those eager to watch a Hindi blockbuster that can rival Hollywood's anytime."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "akkimaramar",
        "review_rating": "8",
        "review_title": "A good movie for Bollywood Standards",
        "review_detailed_main": "Ek tha tiger is like the Knight and Day of bollywood, with a better story believe it or not.\n\nWith Kabir Khan behind the camera expect an average movie at the the least, with sallu acting expect a blockbuster.\n\nThe biggest USP of the movie is its action. The fight at the start was awesome, the fight with the cops was awesome too.\n\nActing by sallu is great, its the first time hes actually acted as a character since Dabangg. Kat is good, their chemistry isn't anything special though. Supporting actors were great especially ranvir shorey.\n\nThe music takes away from the movie, when its getting fast a song slows it down. The humour is well put in he movie with some pretty funny stuff. The movies pacing is good, it was tiny bit boring in the first half but the second half is great, an at one point it got a little unpredictable.\n\nKabir Khan created one of the best action movies to come from Bollywood. Kabir Khan didn't take any risks, with this story he could've created a great movie with no love story, just good storytelling, but he wanted to keep the movie right for the Indian audience and put the masala elements in which i wish he didn't.\n\nThe movie is nor masala nor intelligent, you don't need to leave your brain at home, its a movie where there isn't any stupidity but nothing where you have to use your brain.\n\nWith this weeks releases id prefer this over Bourne Legacy"
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "GypsiB",
        "review_rating": "9",
        "review_title": "All Around Enjoyment",
        "review_detailed_main": "Tiger (Salman Khan), an Indian special agent, is sent to Dublin on assignment. While there, he falls in love with Zoya (Katrina Kaif) and serious complications arise. Ek Tha Tiger is a satisfying mix of action, romantic-comedy, espionage, and drama, with fantastic musical numbers.\n\nFilmed in five countries, the scenery, location shots, and cinematography were stunning. The fights and stunts were impressive, the costumes wonderful, and the plot engaging. I did not expect it to be an all-around great movie, and was pleasantly surprised. I highly recommend it."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "Raja79",
        "review_rating": "10",
        "review_title": "The Songs!",
        "review_detailed_main": "The Songs of this move, whether it be the masterpiece Saiyyara song, or the nice Mashallah song or the wholesome and vibrant Laapata song, are just so nice, enchanting and memorable!\n\nI love this movie only due to how it expresses emotions through the songs. It's a masterpiece."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "ImAbhikBiswas",
        "review_rating": "8",
        "review_title": "Salman's Best Action",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "npb786",
        "review_rating": "9",
        "review_title": "full family entertainer",
        "review_detailed_main": "SALMAN a sensation in Bollywood. Ek Tha Tiger is one of the greatest film of Salman. The most protective man in the bollywood, again he gives a clean and enjoyable movie to the audience. STORY: the story is mainly love story don't get confused with the spy genre the spy thing is just to create an environment but at the core its a love story of two true lovers but separated by country's hate.but after all love is above all and how they manages to get their love despite of the contradiction of two country is the film that you will see. WHATS SPECIAL: yes you will surely want to know whats been the special and why would you watch this, for Salman lovers there is no need to say anything but for the classy audience i suggest to go and watch because of the action of this film. action is really outstanding you can say its best of bollywood till now.and the locales are just charming you will love to romance at these places, and the action locales are also superb. Katrina's action stunt and improved acting skills will impress you salman is as always awesome. BRIEFLY: EK THA TIGER has the best action in bollywood till now, you would not want to miss it. the dialogues could have been made more adorable by adding some more humor and the music could have been made better if Sohail sen have tried harder.Its a opportunity for the audience those who want to watch the movie with their family because now its difficult to get a clean and family film you will regret if miss it."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "superindrajit",
        "review_rating": "8",
        "review_title": "Salman Khan returns with a bang",
        "review_detailed_main": "Ek Tha Tiger released in Eid and I got a chance to watch it. Even Rowdy Rathore got mixed review and when I saw it, I didn't get why some critics hated it so much. This is why I didn't gaze upon any reviews. I went in the theatre and had an awesome 2 hours 30 mins, and yes it was worth it. The film is a romantic film with loads of awesome action like Bodyguard(Salman's last release from last Eid) though this was much better than that. This movie has a good story, how they mix the emotions and how the struggle of decisions is shown must be given full marks. The film has several twists and turns which keeps you entertained and always engaged. The best part has got to be the dialogs which as kept simple and the light hearted scenes. Every scene is well placed and there is no sign of poor editing. The cinematography is superb, the locations, the scenes captured are brilliant. There are some illogical goof ups. Firstly, Khan is not a superhero, he is made look like a superhero is some scenes and sometimes the action is overdone yet it keeps you engaged and is brilliantly shot. The action is also the best part as it is realistic and not people flying around like most South Remakes. Salman Khan is the main USP for the film, he is one of the main reasons people will watch this film and yes he is very popular. He has acted well, though a blank expressions is spotted at times, his acting is remarkable. He is even good in the romantic scenes. Katrina Kaif is good though her Hindi needs to roughly improve a little. She has done a brilliant job in not only looking beautiful but acting well too. Ranvir Shorey entertains and provides comic relief in the film. On the whole, Ek Tha Tiger is a good film and if you are a die hard Salman Khan fan you wouldn't mind watching it again but general people would love it too. Despite the mixed reviews, this film just like Rowdy Rathore, is a winner."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "amit-chaurasia1981",
        "review_rating": "8",
        "review_title": "Good initiative",
        "review_detailed_main": "I was expecting a time pass movie just like Dabang and Wanted, but I got far lot more than that.\n\nIt was a nice initiative. The fight sequence and the action directions was just awesome. Specially Kat's action sequence.\n\nIt is the perfect blend of action and humor with lot of Bollywood masala at last 20 mins.\n\nPeople who have seen a lot of Hollywood action movie might feel the movie bit low, as there is a typical romance between the couple. But you know Bollywood don't run like that.\n\nI am crazy about action movie but I avoid drama movies.If I can give Avengers 2012 9 rating then of-course this is 8."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "keeranilchouhan",
        "review_rating": "9",
        "review_title": "A one sided movie",
        "review_detailed_main": "\"Ek Tha Tiger\" is a Bollywood action film released in 2012. It stars Salman Khan and Katrina Kaif in the lead roles and is directed by Kabir Khan.\n\nThe story revolves around a RAW (Research and Analysis Wing) agent named Tiger, who is assigned to keep an eye on a scientist who is suspected of having connections with Pakistan's intelligence agency. Tiger falls in love with the scientist's caretaker, Zoya, who turns out to be a spy for the Pakistani agency. The film then follows their journey as they try to outwit each other while keeping their emotions in check.\n\nThe film received mixed reviews from critics, with some praising the chemistry between Salman Khan and Katrina Kaif, while others criticized the screenplay and the predictable story. However, the film was a commercial success, with Salman Khan's charm and impressive action scenes drawing in audiences.\n\nThe soundtrack of the film was also well-received, with the song \"Mashallah\" becoming particularly popular.\n\nOverall, \"Ek Tha Tiger\" is an entertaining Bollywood film that provides a good dose of action, romance, and humor. While it may not be a cinematic masterpiece, it is still a fun watch for fans of the lead actors and the Bollywood genre.\n\n\"Ek Tha Tiger\" received mixed reviews from critics upon its release in 2012. Here are some common criticisms of the film:\n\nPredictable Plot: Critics felt that the plot of the film was predictable and lacked originality. The spy-thriller genre has been explored extensively in Bollywood, and the film failed to bring anything new to the table.\n\nLack of Substance: Some critics felt that the film lacked depth and substance, focusing more on the action and romance than on the story and characters. The film was criticized for being more of a commercial venture rather than a well-crafted film.\n\nOne-dimensional Characters: The characters in the film were criticized for being one-dimensional and lacking complexity. The lead characters, Tiger and Zoya, were seen as caricatures rather than fully fleshed-out characters.\n\nUnimpressive Screenplay: Critics felt that the screenplay of the film was unimpressive and lacked tension. The film's pacing was criticized for being slow at times, and the dialogue was seen as lacking nuance.\n\nDespite these criticisms, the film was still a commercial success, due to Salman Khan's star power and the mass appeal of the Bollywood genre. Overall, \"Ek Tha Tiger\" can be seen as a fun and entertaining film, but it falls short in terms of delivering a well-crafted and thought-provoking story."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "mohit_sinsniwal",
        "review_rating": "8",
        "review_title": "Worth watching!!",
        "review_detailed_main": "After a certain period of time we get used to certain things.For example if Shahrukh laughs in a certain way or Salmaaan renders a dialog or Akshay give a one liner we just may just like it without any logical reason. So if you are someone who asks questions like, Is 'RAW' run by just one person?Don't they have any protocols?How can a spy just asked to be part of a meeting because it will be the hub of intelligence and get the go?, then probably this movie isn't for you.\n\nFrom a pure entertainment perspective the movie seems to be okay.There are occasions to laughs and some action sequence are nice.Katrina looks lovely as usual.Her Hindi is much improved.\n\nPace of the movie could have been better.I find it hard to understand why so many songs have to be coaxed into a spy movie.Imagine five songs playing during mission impossible!Overall I would recommend to wait for it to come to one of the channels and watch it on a lazy Sunday.\n\nAfter a certain period of time we get used to certain things.For example if Shahrukh laughs in a certain way or Salmaaan renders a dialog or Akshay give a one liner we just may just like it without any logical reason. So if you are someone who asks questions like, Is 'RAW' run by just one person?Don't they have any protocols?How can a spy just asked to be part of a meeting because it will be the hub of intelligence and get the go?, then probably this movie isn't for you.\n\nFrom a pure entertainment perspective the movie seems to be okay.There are occasions to laughs and some action sequence are nice.Katrina looks lovely as usual.Her Hindi is much improved.\n\nPace of the movie could have been better.I find it hard to understand why so many songs have to be coaxed into a spy movie.Imagine five songs playing during mission impossible!Overall I would recommend to wait for it to come to one of the channels and watch it on a lazy Sunday."
    },
    {
        "movie_id": "tt2016894",
        "movie_name": "Ek Tha Tiger",
        "movie_rating": "5.6",
        "review_username": "subhampatel00",
        "review_rating": "9",
        "review_title": "Very Nice.....Stunts were a big +",
        "review_detailed_main": ""
    }
]