[
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Sleepin_Dragon",
        "review_rating": "5",
        "review_title": "Don't expect much.",
        "review_detailed_main": "It's fair to say that it is the worst of the series, it's let down by some really awful scenes, and some dire performances, but, it still has some of the old magic, and a few times I did find myself laughing. The scene between Sheen and Lohan was perhaps the worst thing I have ever seen, it was appalling, almost like an attempt to replicate the Pamela Anderson scene, but it was just terrible. The Black Swan scenes were lots of fun, and nicely produced, they felt at odds with lots of the film.\n\nIs it the case that people's humour has changed since the early films, or were the jokes simply not funny? Personally I think it's the latter, in fairness though it isn't as if there were great horror movies to parody.\n\nIt's poor, but will still give the odd chuckle. 5/10"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "naregian",
        "review_rating": "3",
        "review_title": "I almost regret not walking out of the theater.",
        "review_detailed_main": "The era of spoof and parody is dead.\n\nLet me start off by saying that I knew this film was going to be horrible from the start. I had read reviews and knew it was bad, but being so infatuated with film and theater, I actually wanted to see the movie to diagnose exactly what made it so horrible. (Insult me if you must, but I have a lot of free time on my hands and I love all kinds of movies.)\n\nI'm not gonna lie, I went into the theater with the hope that on some slight chance, I would enjoy the film. Wrong. The movie was so boring and tasteless that I was actually distracted with my phone for some parts during the film, which is of the utmost rarity for me.\n\nThe horrible acting and line delivery dried this film out so much that I don't know where to begin. Ashley Tisdale was definitely not as good as Anna Faris was, and obviously, everyone will compare the two. I hate to admit it, but Mac Miller, Snoop Dogg, and Katt Williams all could have made audiences laugh with the material they were given, but were just too dry.\n\nAdmittedly, there were some very rare parts of the movie that had a somewhat witty humor to it, but it was only once or twice, and weak at that. The rest of the stupid slapstick humor was just so lame and dragging. Slapstick humor should stay within the PG level of humor for the kids.\n\nOn that note, the movie had overly crude, and just STUPID sexual humor that was just stupid and weak. Even hard R teenage sex comedies are more sophisticated than this. I laughed maybe one time, and it wasn't even a laugh. I kinda exhaled sharply while smiling.\n\nOverall, there was almost no sophisticated or witty humor, horrid acting, and it was all just plain bad. So yes, the reviews are correct, it was horrible. The only reason I give it a 3 instead of a 1 was because hundreds and hundreds of people put months and months of work into an 85 minute piece of what they thought was art, and giving a movie a 1 or maybe a 2 is too disrespectful to the art that is film. (But then again, this movie is pretty disrespectful to the art that is film as well.)"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "tadpole-596-918256",
        "review_rating": "5",
        "review_title": "Much of the trailer is missing from the actual movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "xdex_corex",
        "review_rating": "1",
        "review_title": "Warn others not to see it!",
        "review_detailed_main": "I will start off by saying I LOVE the Scary Movie franchise, especially scary movie 3. My girlfriend and I went to see it on the 12th, we were so excited because we both love the previous films. 5 to 10 minutes into it, neither of us were laughing, just straight face. I whispered over to her and told her this is really stupid, she agreed. None of other people that were sitting in the room laugh either. I can't believe we actually sat through the whole movie until the end, since we paid for it already. It had like 3 moments that made us chuckle a bit, but that was it. If I could demand my money back, I would. Little note for the producers- Instead of paying huge amounts of money to the celebrities, how about spend some in developing the story and jokes? I would say this movie *might* make little 10 years old children laugh, but that's about it.\n\nIt was so bad that I decided to make an IMDb account to criticize."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "markfran6060",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Don't bother going to see this junk. It appears to be very low budget and infantile. I have enjoyed the other Scary movies but this one has no redeeming value. My 15 year old son said it was the worst movie he has ever seen. Disjointed. People were leaving the theater before the halfway point and it is only an hour and a half. There is really not much you can say about it except to wait until it comes out on Netflix and even then it will hard to watch. Honestly I can't believe that after the movie company watched this movie they had the nerve to release it. In my opinion this would hurt your reputation as a Film maker more than helping by a long shot. There is a considerable difference in the quality of this Scary movie and the others, none of the original cast appear in the movie and it seems to be based mostly on paranormal activity, the set becomes very stagnant. My son said that the actual paranormal activity was funnier. My son loves the Scary movie brand, he said this one would give the franchise a bad name and he would give it a -2 if he could.\n\nThis is a good reason to use Pirate Bay. The public is certainly being ripped off by paying for this kind of crap.\n\nAnyone who gives this movie a positive review should be suspect. They are either being paid or benefiting in some way.\n\nI like this type of movie - this one is just bad."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ndallas1983",
        "review_rating": "1",
        "review_title": "The worst one of the entire series",
        "review_detailed_main": "The only intelligent actor/actress from the entire Scary Movie series is Anna Ferris. You know why I say that, is because she wasn't in Scary Movie 5. She was smart. I'm not sure exactly what went wrong with this one, but I enjoyed the last 4 a lot more. Given that the 4th one was reaching a new level of stupidity, it was still 10x more funnier than the 5th. I regret paying $10 to watch this. This is the 2nd time in two weeks that I have made the mistake to pay money to see a stupid movie that ended up making me completely question why I go to the movies. Hollywood needs to wake up. Just because you can charge people money to see a movie, doesn't mean you should. Certain movies do not belong at the movie theater, and this one should have been on that list. The director should have never let this movie leave their studio, and for the sake of all of the actors, someone there should have stopped this movie from being produced. Again - I enjoyed the first 4, but I am now done with the Scary Movie saga. Enough is enough, this is just insulting. You can easily tell that even the highest paid actors like Charlie Sheen and that chick from Modern Family, put on a massive layer of suck in their roles. Are we all getting that lazy now days that we are going to record ourselves doing a horrible job, posting it to the world, and expecting money to come rolling in? I think the writers of Scary Movie should delete this one, and make a new Scary Movie 5. The next one that comes out will only be watched on DVD."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "cragsyj1-292-890188",
        "review_rating": "1",
        "review_title": "Worst movie i've ever seen in my entire life.",
        "review_detailed_main": "I've never written a review before, in fact i've never logged into this before, but i HAD to...just to say this is hands down the worst movie i've ever seen in my entire life, people were leaving the cinema and sadly we stayed hoping and wishing it would improve. It didn't!\n\nYou know those kids shows on Disney channel where someone bangs their head and you see kids crying laughing, picture that but even less funny, oh and by the way, constantly through the movie it's people banging their head etc, they've ripped the Disney channel off for comedy and failed, HOW BAD DO YOU HAVE TO BE AT COMEDY???\n\nI'm actually angry at the movie, i got home about 15 minutes ago and i haven't stopped swearing since. Seriously don't watch this movie, don't even watch the trailer. If you see it on a bus stop sign graffiti it."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "cromwell_316",
        "review_rating": "",
        "review_title": "Sharknado, without the Sharks or nados",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Jonathon_Natsis",
        "review_rating": "1",
        "review_title": "Terrifying in all the worst ways.",
        "review_detailed_main": "It is almost inconceivable to imagine how much effort a group of people would have to put into making a film as bad as Scary Movie 5. The latest instalment in the series of lazy spoofs, not including some unforgivable side projects including Date Movie and Epic Movie, this film offers virtually nothing to its audience, insulting their intelligence for an hour-and-a-half with perhaps the worst collection of blatantly uninspired and recycled gags ever put to celluloid.\n\nThe film's horrendous excuse for a plot centres on a suburban wife (Ashley Tisdale) and her dimwitted husband (Simon Rex) moving into a haunted house with their possessed adopted children. From there, the film brings its staple of parodying the biggest blockbusters of the last few years, but does so without a semblance of relevance, creativity or wit.\n\nIt says a lot about the film that the only half-laughs to be had come from Charlie Sheen and Lindsay Lohan sharing the opening scene- an incredibly stupid and borderline cringe-worthy, but inexplicably entertaining chuckle at their fall from grace.\n\nIt's all downhill from there, though, as the rest of the film plays out as a series of unconnected set pieces seen literally hundreds of times before. Often, such an unappealing movie is still able to salvage some hope by suiting itself for a target market, but it is hard to see any audience group, from 15 year-olds to stoners, defending this abomination.\n\nOne would have to drink Lindsay under the table, smoke copious amounts of bud with Snoop Dogg and/or Lion and snort pure tiger blood with Charlie to even come close to drawing any semblance of enjoyment from this disaster. An imminent sweep of this year's Razzies doesn't seem like ironic punishment enough for one of the worst films ever made.\n\n*There's nothing I love more than a bit of feedback, good or bad. So drop me a line on jnatsis@iprimus.com.au and let me know what you thought of my review. If you're looking for a writer for your movie website or other publication, I'd also love to hear from you.*"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "elinguation",
        "review_rating": "1",
        "review_title": "Basically, an exploitation film for weed- and gangsta rap-obsessed 13-year-olds",
        "review_detailed_main": "I really don't know where to even start with this, so let's just get started. This movie is not funny. There you go - it fails as a comedy. In addition to that, it's dumb, mean-spirited, and in poor taste, and I think you're going to agree with me about that even if you like stuff that is in poor taste. I mean, this is basically an exploitation film for weed- and gangsta rap-obsessed 13-year-olds. It covers all the bases: sex scene involving clowns and ponies, sex scene involving pool cleaning machines, dildo collections being found by small children, things getting stuck up dogs' anuses, a scene featuring Snoop Dogg (or Snoop Lion or whatever he insists that people call him now) and a giant blunt, etc. Wow, this is multiplex entertainment in 2013?\n\nI saw the first Scary Movie and thought it was pretty amusing in places. I'm also a huge fan of totally absurd slapstick comedies like Airplane and the Naked Gun movies. What is it exactly that makes this film so awful where the others, at least on some level, succeeded? I can't think of any way to explain it except this: watching Scary MoVie is the film equivalent of eating White Castle sliders for an hour and a half, washing them down with a gallon of Mountain Dew, topping it all off with seven pounds of cheesecake and then doing the Mentos and Coke thing (featured in this film, incidentally) so you can projectile-puke the stuff you just ate all over your friends who were expecting it and think it's funny. Truly, honestly, that's the caliber of stuff you're going to subject yourself to for 90 minutes if you insist on watching this.\n\nThe movie tries to make fun of Inception, Black Sawn, Evil Dead, etc., but it seems to me that you have to actually be smarter than something if you want to effectively make fun of it. Instead, they should make a movie that makes fun of all the Scary Movie movies. Honestly, they should be pretty easy targets. This movie does not have the minimum level of intelligence required to comment about anything at all. The best it can do is make \"peehole\" jokes and try to get the audience to laugh at monkeys flinging poo at the wall. No, it's really not funny.\n\nI'm racking my brains trying to recall if there was anything at all good about this film. I do remember laughing at a couple of the gags. That sex scene with clowns and ponies was actually somewhat amusing - there, I said it. I'm afraid this review is going to come off the wrong way because it sounds like I refuse to watch stuff that pushes boundaries of good taste. Hardly, man. I even liked Videodrome, which Roger Ebert called \"nauseating.\" The real problem is that this film uses boundary-pushing as an excuse to be stupid. In reality, it's about as intelligent as a stoned middle school dropout, incidentally the only type of person I can imagine enjoying this.\n\nI was about to start getting depressed about the state of the world given that this kind of obvious dog dookie is considered entertainment, but it doesn't seem that other people found it all that entertaining either. I watched at least two couples walk out of the theater before the end of the film, so ultimately I'm concluding that there's probably some reason to have hope about the future of this planet. Thanks, Scary MoVie! Not that there's anything to be thankful for except that no one actually came up to me and hit me in the head with a shovel while the film was playing. They'll probably include that in part six."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "austinpwillcut",
        "review_rating": "1",
        "review_title": "Wow! This is the pits!",
        "review_detailed_main": "All I have to say is this is the worst of the franchise and really sucks, what happened to make people want to create a POS like this? David Zucker you should be ashamed for producing this and ripping people off! The Wayans bros. need to come back! This shouldn't be making a dime, it is trash and not funny! Ashley Tisdale is a Disney has been and so is everyone else here. The jokes were written on a nap kin by a toddler, these are the worst gags ever, I am not kidding! Dimension films does not care about making good stuff and that's why they are douche bags! This is proof! Do yourself a favor and watch Airplane instead, at least it's funny and not retarded like scary movie farts(excuse me, 5!. This franchise is dead."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "lutherdwl4",
        "review_rating": "8",
        "review_title": "OK. It is a PARODY movie. Cut it come slack.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "cherold",
        "review_rating": "7",
        "review_title": "I like all of them",
        "review_detailed_main": "I like the Scary Movies; all of them. Yes, this one and the one preceding it are probably the weakest of the series, but I still laughed a lot. It's just silly, unapologetically stupid comedy.\n\nIt's also a series I just have to watch regardless of what people say, because for the entire series, people have been declaring it horrible and not worth watching. Even the first one, which is acknowledged as the best of the series, was viciously slammed when it came out.\n\nAs with all the movies in the series, it's very hit and miss. Sometimes it's laugh out loud funny, sometimes it's just unpleasant.\n\nMy biggest objection to this one is some of the racial stereotyping. It's not just that racial stereotyping is not a good thing, but that at this point it's been so played out that it's not remotely funny.\n\nStill, overall, I laughed a lot."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "darin_lanes",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": "This is a complete waste of time. The script seems rushed and if you have epilepsy please do not go it will cause you a seizure in the club scene (which is completely pointless). The beginning is pretty much filler just to say they have Charlie Sheen and Lyndsey Lohan in the credits (which is the only part they take in the movie (first 10mins). I promise this movie will disappoint unless you're a teen which you may find poop and fart jokes funny. I didn't go to this movie thinking it was going to be good, I actually was looking forward to the parodies which were very weak and since when is planet of the apes a scary movie?"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "sam-burf",
        "review_rating": "1",
        "review_title": "You couldn't pay me to see that again.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "johen92201",
        "review_rating": "1",
        "review_title": "\"Please run as fast as you can\"",
        "review_detailed_main": "Let me first start by telling you that I really wanted to rate this movie a 1/2 star, but the system they have set up here wouldn't allow me too. This movie was one of the top 10 worst movies that I have ever seen before in my \"ENTIRE\" life. Why? First lets start with the plot, Oh! I'm sorry there was none!!! All I will say is \"KEEP YOUR MONEY\" this was $15 that I could have spent on something worth while. I actually spent more time looking at my watch than I did the movie, because it was just that awful. Malcom Lee you must really needed the money, because this movie sucked!!! I am so used to seeing very funny skits with the previous scary movies. In my opinion this movie series has been going to the dogs ever since the Wayans Brothers stop contributing to the funny nature of this series. Also, the movie is more sexual in content than I would have liked and I really believe it should have been Rated R instead of PG-13. The acting is very poor in this movie and you would think with the actors that were involved you would have expected it to be very humorous. I cant tell you how long the movie was because after an hour I just couldn't take it anymore so my wife and I walked out of the movie."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "DICK STEEL",
        "review_rating": "1",
        "review_title": "A Nutshell Review: Scary MoVie",
        "review_detailed_main": "I thought after some days of hectic work I'd pick the funniest film on release this week to laugh my rear off, but unfortunately Scary Movie 5 turns in a disappointing form, with the Wayan brothers abandoning their franchise for A Haunted House instead. Despite having David Zucker in a writing capacity, this installment seems finally to have run out of steam in its long-running franchise, one which took the horror films in between them and give them the spoof treatment. And the lack of material shows despite the seven year absence, having to touch non-horror films as well given the wafer thin content upon which to draw inspiration from and to make fun of.\n\nAnd you would think that their crowning glory, having the two Tinseltown folks who can't seem to get out of trouble and the wrong side of the limelight - Charlie Sheen and Lindsay Lohan - would be a tad interesting, but it's not. Both look like they were in it for the paycheck, and couldn't care less to ham it up a little. The jokes they partook in were really bad, with absolutely nothing to laugh at or about, and if they were to think they have a second career as comedians, they just might want to think again, given their lack of comic timing.\n\nNo spoof of any horror film today would be without the Paranormal Activity style of video cameras being mounted almost everywhere, with the playback naturally being remotely hilarious, especially when people tend to miss the whole point of what they were hoping to see. Forming the basis for whatever semblance of a storyline is that of Mama, which involves Jody (Ashley Tisdale) and Dan (Simon Rex) picking up three spooky kids, thrown into a mix of Paranormal Activity, complete with a haunted house, Mama, and a housekeeper whose antics were probably the best bits in the film.\n\nThen came some other story development that linked up Black Swan, RIse of the Planet of the Apes and Evil Dead, for the most parts, and so you have one really amalgamated piece of narrative that had tried its best to blend these diverse stories together, but as it turned out, someone forgot to include genuine comedy in the film, short of tapping into the same old bags of toilet humour just for laughs. Some worked, and most didn't. Perhaps it is time to retire the franchise, for good. Even A Haunted House, was miles better than this, without having its jokes run stale, or feeling forced.\n\nThe many cameo appearances, do nothing to save the film from its depths of woeful scenes trying their hardest to pass off as comedy. And as if sitting through the film isn't torture enough, you can elect to stay until after the end credits to extend that dreaded feeling for a scene longer."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "1",
        "review_title": "\"Scary Movie 5\"- Unwatchable.",
        "review_detailed_main": "Look, I'm not going to sit here and try to explain and justify my enjoyment of the first four entries in the long-running \"Scary Movie\" series. It's trash in every capacity, plain and simple. Cynical, trendy trash that only seeks to quickly capitalize on whatever is new or hip with filmgoing crowds through only the most base and lowest-common of denominators. Not a single film in the franchise could be called \"art.\" And yet... I get a kick out of them. Particularly the second and third films, which were actually very amusing. They may be trash, but they're fun trash. Enjoyable trash. Entertaining trash. Trash with a charming cast and just enough chuckles to make them worth a go on a slow, rainy day at home. Yeah, you'll feel your IQ dropping during some of the stupider moments of those previous films, but they were never so bad as to be offensive or outright dismissed.\n\nThen there's \"Scary Movie 5.\" ...whelp, this series was fun while it lasted, I guess.\n\nI'll level with you. This is one of those very rare occasions where even trying to force myself to watch a movie in order to be able to write a fair and balanced IMDb review, I just couldn't. I honestly was unable to. I had to start skimming through because the film was making me angry. Furious even. How could a series that was honestly never more than just silly, broad parody fall so hard, so quickly? It's shocking just how aggressively unfunny and tedious a film this is. Even by the midway point of the opening scene- a brutally prolonged \"Paranormal Activity\" parody involving Charlie Sheen and Lindsay Lohan trying to make a sex tape- the humor had been completely sapped and it was running on fumes.\n\nAnd this downward spiral only continued with each passing scene, every awkwardly contrived pop-culture reference and all the nonsensical attempts at lampooning then-recent releases. Essentially a melding of \"Mama\", \"Paranormal Activity\", the rebooted \"Planet of the Apes\" series and \"Black Swan\" with a smattering of plot elements from other major films, the storyline is a fundamental mess, with only the most tenuous of connections to string together the constant barrage of shockingly dead on arrival humor. Yes, you could argue that the fourth film's combination of \"Saw\", \"The Grudge\" and \"War of the Worlds\" was messy and contrived... but at least it tried. This one can't even muster up the energy to do that.\n\nStory goes that the production was a bit of a mess, with upwards of half the film being hastily re-written, re-shot and re-edited during last minute pick-ups barely two months before release without the participation of original (and solely credited) director Malcolm D. Lee. And it shows. Badly. Even giving it the biggest cut of slack I can, it feels like a mish-mash of several different visions and just stinks of a perplexing combination of apathy and desperation. I have a feeling you can tell which scenes were re-shot and which were in the original version as the tone and feeling will radically change from scene to scene. Some scenes feel like soulless attempts at patching together jokes whereas others feel like everyone was trying... way too hard. And as a result, it comes off disjointed and honestly just uncomfortable to watch.\n\nEven the return of Simon Rex in a starring role after his turn as a supporting character in the previous two films (albeit as a new character here) can't save this trainwreck... and I'm one of the people who actually really enjoyed his work in those films as the lovable goofball. Then again, he's the only returning co-star of any previous films, with series leads Anna Faris and Regina Hall- the two beating hearts of the entire series- having long since jumped ship. So I don't know what I expected. If the franchise film can't even attract the attention of its own lead cast members and instead has to upgrade a smaller supporting cast member to be the new star, it's usually not the best of signs.\n\nWhile it may not be quite as condescending and grating as, say... a \"Seltzerberg\"-level parody, there's just no salvaging any laughs here. It's a confused, contrived, unfunny and even uncomfortable experience trying to watch \"Scary Movie 5\", and try as I might... I couldn't do it. It's up there with \"Going Overboard\" and \"Fat Slags: The Movie\" as one of the most inherently unwatchable comedies I've ever had the displeasure of witnessing.\n\nI really have no other choice but to give \"Scary Movie 5\" a tragic 1 out of 10. It's a shame."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "terence666",
        "review_rating": "1",
        "review_title": "Seriously don't bother...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "pooyan-nabipour",
        "review_rating": "1",
        "review_title": "Worst Scary Movie (Any Movie) of All Time!",
        "review_detailed_main": "I can't even explain how I wish to take back the 86 minutes of my life. It is a movie by which all badness can be measured.This movie can be turned into a documentary or training material for the novice filmmakers to show them what to avoid making.I pity those who watched it in cinema without the ability to fast forward it. This movie fails across the board. It fails in acting,directing, cinematography, jokes and any other conceivable cinematic component. Even the movie's behind the scenes sucks (Although much funnier than the movie itself). The only reason I didn't just throw my TV set out of the window and then shoot myself was that I didn't want even my tombstone to keep its record. Be safe and keep away!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "akiskaratz",
        "review_rating": "1",
        "review_title": "I used to like parody films, but this...",
        "review_detailed_main": "I have seen all Scary Movies, Disaster Movie, Superhero Movie, Epic Movie etc, and almost every time I was enjoying it, because of some funny scenes. If you like this type of movies - even if not, sometimes -, you can laugh out loud and have a good time either alone either with party. I am not saying that those films are the best way to spend your time with friends, but it could be a good - just good - choice. Definitely better than watching a horror movie like Scream, Paranormal Activity etc, in my opinion.\n\nHowever, in the case of Scary Movie 5, things are, unfortunately, different. What I am trying to say, is that this movie is not even amusing. Scary Movie 5 is really boring. The first time I tried to see the movie, I stopped watching at 30 minutes. The second time I was determined and, honestly, I tried to see the whole movie from the beginning, but it was hard. I asked myself: \"Why are you doing this to yourself? What's the purpose?\", and I stopped watching again.\n\nIf you are in a good mood, and you want to see something that will help you, prefer Airplane, Naked Gun, Life of Brian or some other parodies. Maybe those movies not extremely funny, but I think they're better from the 5th Scary Movie. I don't recommend it, it's unworthy."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "The Scary Movie franchise has run its course!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "sdabobby",
        "review_rating": "10",
        "review_title": "The Weakest of the series, but still Hilarious",
        "review_detailed_main": "Forst off, yes, it is stupid and ridiculous, but it is supposed to be. Whoever doesn't get that should never watch it, but don't trash talk a movie just because it does not appeal to your taste. It does feel choppy, but so did the other 4, which all have random scenes that don't have anything to do with the plot (such as the \"wazzup\" scene in the first or the basketball scene in the second). Overall, most of the spoofs were done well, even though the younger crowd won't get a lot of the ones from more \"grown up\" material such as 50 shades, Inception and Black Swan, which are dated and would have been funnier two years ago when those movies were still fresh. Despite what's wrong, I rated it a 10 because it did exactly what I wanted it to do, make me laugh. It is a great addition to the series, and the new cast does their best, although they are weak in comparison to the original stars of the series. The biggest mistake was having Simon Rex play a different character. He could have definitely been George again, because it's not like we aren't used to characters dying and coming back. The filmmakers probably watched A Haunted House and realized that they had to do re-shoots, which was a great decision. There are similar jokes, but they are definitely different in terms of humor and content. As usual, this film has had quite a large lack of promotion, just like Scream 4 and Spy Kids 4, which i'm sure has led to it's sad box office results. Movies like Date Movie, Epic Movie and Meet the Spartans were all huge hits and proved that the opinions of critics do not matter, and once people actually watch the movie instead of bad mouthing it, they'll realize that it is hilarious for what it is. I hope that there is an alternate cut on DVD. I would love to see how it was before the re-shoots, which were obviously done to make it stand out from a Haunted House, an under-rated spoof which in my eyes is the real Scary Movie 5. the actual SM5 is a good try and I would love to see another, even though this will probably be the last."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ivern-326-711636",
        "review_rating": "7",
        "review_title": "I Don't Get the Hate...",
        "review_detailed_main": "This movie came out so late here in Norway! Jesus!\n\nAnyway, Scary Movie V is the latest installment in the Scary Movie franchise. In this one, most of the cast from the previous movies are absent. That's not a good sign. In this one, we get parodies of more recent movies, like Paranormal Activity, Mama, Rise of the Planet of the Apes and ... The Shawshank Redemption? Oh well, only two of those are horror movies, but oh well...\n\nI'm gonna cut right to the chase. This movie is not horrible. If you thought the previous ones were funny, you're gonna think this one is funny. In fact, I find Scary Movie V to be one of the funnier movies in the series. That may be because I've seen most of the movies parodied in this one, as opposed to the other ones where there's only a couple parodies per movie I actually get.\n\nAnyways, back to the point: Everyone seems to hate this movie, and I say: What do you except? Do you really want a clever comedy with smart humor and jokes that you are gonna remember your whole life? No. The Scary Movies are stupid. Some of the stupidest movies ever, but that doesn't matter, because they know it. They don't try to make it good, they're just making another Scary Movie.\n\nI think a lot of people have forgotten to have mindless fun with comedies. Everyone expects a comedy to be memorable these days. Yes, this movie's not the most fun you'll have in the theater, but it is a fun movie to watch with friends none-the-less.\n\nAgain, if you like the other Scary Movies, there's no reason not to watch this one: It's pretty much a modern take on the same formula that's been going on for 13 years now. It's good for what it is."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "slicedbread117",
        "review_rating": "1",
        "review_title": "Why does this movie even exist.",
        "review_detailed_main": "This review won't take very long, as there are literally zero positive things to say about this film. It is beyond awful, one of the worst films I've seen ever, period. The movie didn't have me laughing once, the script seems to have been written by a room full of monkeys. The acting was awful and the effects (audio and visual) were laughable to say the least. I mean, this movie seemed like it was literally pulled from the trash and put in the theaters. The first Scary Movie wasn't half bad, but holy crap this series has gone done quicker than Lindsey Lohan's career. I just really don't know what else to say, the movie had absolutely no entertainment value of any kind, anywhere in the film.\n\nWhile I understand this movie is a parody and is supposed to be a \"so bad it's good\" movie, someone could make a parody of this movie it's so bad. Simply put, Scary Movie 5 is far and away the worst film of 2013, and possibly the worst film I've seen in my entire life.\n\n1/10"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "zbeltran3",
        "review_rating": "1",
        "review_title": "it sucks!",
        "review_detailed_main": "Honestly I don't have much to say about it, other than it was horrible in all the senses, I thought the 4th was the last one, and it should had stay like that, cause now this one adds to the list as the worst of the whole scary movie collection. It was so kiddy in some stuff and overly done I honestly don't know what they were thinking or even if they were thinking when they did this movie, just awful. I liked more a haunted house and that is a lot to say cause it wasn't that good either but at least it made me laugh a few times, well maybe the only thing i like more than the haunted house is that they didn't go showing butts around or sexual actions every 5 seconds, I am not saying they don't, but is less than the others. I still don't recommend anyone to see it, not even in red box wait it to be on TV :)"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "DarkVulcan29",
        "review_rating": "4",
        "review_title": "Only good for a few chuckles",
        "review_detailed_main": "They through a lot of parodies at you in this fifth installment, and there where only 3 or 4 times that I laughed, but for the most part I'm just staring at the screen and wondering how is this funny. It seems that the filmmakers are trying to too hard to be funny, and the more they are trying they fail completely failed. But I can see the parts where they where not trying so hard, are probably the parts that i was laughing.\n\nAshley Tisdale who I don't doubt is a very talented actress, but is incredibly bland here, nothing she does just does not jump out at you. Charlie Sheen and Lindsay Lohan are pretty good spoofing themselves, but lets face they are already become parodies of themselves at this point. Simon Rex is alright, but really he is just there also. Not as bad has Movie 43, but still not as funny has it tried to be, but still good for a few chuckles."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "tom-ko",
        "review_rating": "1",
        "review_title": "A terrible instalment to the hilarious franchise",
        "review_detailed_main": "When I sat down at the pictures to watch this film, I had no idea that I was about to waste 90 minutes of my life. When I got there, my expectations were right in the middle of low and high. I left the cinema regretting I had ever gone to see it.\n\nScary Movie 1,2,3 and 4 all had stories that made sense to parody a range of different horror films. They all had a unique story that combined lots of different films. However Scary Movie 5 doesn't make sense, doesn't make you laugh and has terrible acting.\n\nLike everybody else in the Cinema, i did not laugh once (Apart from laughing at how bad it was) I left the cinema unsatisfied and unwilling to ever watch it again.\n\nScary Movie is one of the worst films I have ever seen and definitely will never be seen by me again."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "buktopster",
        "review_rating": "1",
        "review_title": "Never waste your time on this movie.",
        "review_detailed_main": "I might go paragraphs berserk about how boring and unfunny this movie is but I will not. I am just going to tell you that even Movie 43 was funnier than that. Hell, even the American Pies (Book of Love, Band Camp, Beta House) are like a masterpieces compared to this. NEVER. WATCH. THIS.\n\nThe minimum required lines for a review are ten so I am just wasting lines now. I have nothing more to say but warn anyone who might consider even paying to see this movie at a cinema... I would however give money to ban this utter nonsense from ever seeing a DVD. Don't be fooled by the SCARY MOVIE title. It's just nothing like the old movies WHICH WERE FUN.\n\nNEVER. EVER. WATCH. THIS."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "1",
        "review_title": "Unbelievably sh!t",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nI'm used to seeing spoofs where I know the films that are being parodied, but the recent crop of franchised, sanitised horror films have failed to catch my attention, so it was no help that I hardly even knew any of the films Scary Movie 5 was sending up. But know them or not, what can't be denied is what started out as an inspired, refreshing, if gross and thoroughly none PC idea got completely carried away with itself and just descended in to painfully unfunny dross. And so this fifth instalment, coming seven years after the last one, has an air of desperation about it, like some lazy studio executives thinking up something cheap and heartless for a quick buck. They've certainly failed to provide something even vaguely resembling a coherent plot, and so Scary Movie 5, lacking the Wayans Brothers touch that got it started, is left to just drag on in to the wilderness.\n\nBarely 70 minutes long, it's hard to think how something so short could be so torturous, but as it drags along without the merest hint of a laugh as it does, it becomes even more of a painful slog to the end. I'm just glad I didn't really pay to see it. NO STARS"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "sauravjoshi85",
        "review_rating": "2",
        "review_title": "Easily the worst film of entire franchise!!",
        "review_detailed_main": "Scary Movie 5 is a comedy horror film. The film is directed by Malcolm D. Lee. The film is a sequel to Scary Movie 4 and the fifth and final installment in the Scary Movie film series.\n\nThis is the weakest and the worst film of the entire franchise and apart from some very limited giggles the film faced a severe drought of comic and funny scenes.\n\nThe plot of the film is as usual is a parody of lots of other films but the execution is not that exciting. The intro scene between Charlie Sheen and Lindsay Lohan sets up the mood very nice and gives a glimpse of another roller coaster ride of fun and humor but apart from that very scene the film struggles to entertain.\n\nThe acting is average and screenplay of the film is lethargic, climax of the film also doesn't entertains. The worst film of the entire franchise."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ggomes-01525",
        "review_rating": "1",
        "review_title": "So bad I'll need therapy",
        "review_detailed_main": "\"Scary Movie 5 is an absolute disaster of a film. It's so bad that it makes you wonder how the people behind it managed to greenlight such a travesty. Everything about this movie is awful. The humor is painfully unfunny, the plot is nonsensical, and the performances are cringe-worthy. It's a cinematic train wreck that makes you question the very concept of making movies. The creators of this film should be held accountable for subjecting audiences to such a dreadful experience. From the abysmal writing to the uninspired gags, it's hard to find a single redeeming quality. Even if you're a fan of the parody genre, this film will leave you utterly disappointed. It's a textbook example of how not to make a comedy. The previous Scary Movie entries had their moments, but this one takes the franchise to a new low. You'll be left in awe at the sheer lack of quality on display. The only scary thing about Scary Movie 5 is how anyone thought it was a good idea. If there were ever a case for a movie to be locked away and never seen again, this would be it.\""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Looks Like Everyone Would Want Their Name Off This Disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Snyder-matthew23",
        "review_rating": "10",
        "review_title": "I thought it was pretty fun!",
        "review_detailed_main": "I LOVE the Scary Movie franchise and, to be honest, I thought this movie would have been a total bummer but it was pretty funny! This wasn't my favorite of the series although it's one of them. I don't know why people hate this movie so much! If you don't even have a sense of humor or don't like parody's, then don't watch these kind of movies! I like parody movies a lot and yes, they can be very dumb and stupid but that's the fun part about it. So if you don't like these kind of movies then just go watch something else that you think is worth your time! I thought this was a great and funny movie and I would recommend this to my friends and family who want to see this."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "OllieSuave-007",
        "review_rating": "7",
        "review_title": "It's actually the second best, I thought.",
        "review_detailed_main": "Despite the mostly negative reviews, I think this movie is actually the second best of the Scary Movie films. It's one hilarious scene after the other, from Jody (Ashley Tisdale) and Dan Sanders (Simon Rex) dealing with their weird nieces in their paranormal-activity infested home to Jody's ballet dancing misadventures and Dan's ape experiment chaos. The movies Paranormal Activity and Inception are two of the main spoofs in the film and they are hilariously done, and the prologue with Charlie Sheen and Lindsey Lohan was just good, funny starter to the film, especially when Lohan spoofs her own real-life legal woes.\n\nSeeing every actor's facial expressions, especially Simon Rex's when he experiences ghost stuff, are just fun to watch. The acting, I thought, was pretty good and the plot was well-paced. There are plenty of slapstick humor and so-stupid-it's-funny comedy, but I think the sexual innuendos are a little overboard - especially the spoof to The Black Swan. But overall, it's not a bad film - good for some laughs and popcorn time.\n\nGrade B-"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "BA_Harrison",
        "review_rating": "1",
        "review_title": "A new low for the Scary Movie series.",
        "review_detailed_main": "Most spoof movies tend to be a bit hit and miss; Scary Movie V is all miss. Its targets are a selection of recent horror movies - Mama, Paranormal Activity, Insidious and The Evil Dead - and, for no discernible reason at all, non-horror hits Inception, Black Swan, Rise of the Planet of the Apes, and 50 Shades of Grey.\n\nHaving already suffered through part 1-4, I was expecting part 5 to be bad (Anna Farris went so far as to get pregnant to avoid appearing in this one), but I never imagined it could be this awful! It's 88 minutes of utterly puerile, laugh-free nonsense that feels like it was written by a bunch of teenage boys (and not very smart ones at that).\n\nA jaw-droppingly terrible sex scene starring Charlie Sheen and Lindsay Lohan, Snoop Dogg raiding a marijuana farm, a crap Leonardo DiCaprio lookalike, monkeys throwing poop, a little girl humping someone's leg, a baby on fire, and a wild pool party held by automated pool cleaning machines (yes, you read that correctly!): just a few of the unbelievably dreadful moments in this total wreck of a movie. Rarely has $20million been so poorly spent.\n\n1/10, for the lovely Ashley Tisdale, who I'm guessing didn't watch the previous movies before signing on the dotted line, and because 0/10 is still not an option."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bassrourke",
        "review_rating": "5",
        "review_title": "It's alright but what did you expect, class?",
        "review_detailed_main": "Charlie Sheen is himself and very funny in the opening scenes with Lindsay Lohan sending each other up perfectly. Forget plot, it's a Scary Movie film, just like Hot Shots, Not Another Teen Movie, Epic Movie, Superhero Movie and so on.... just a reason for a series of good and not so good parodies of pop culture films. And, in this case the book 50 Shades of Grey gets a look in with the unlikely pairing of Jerry O'Connell & Mike Tyson appearing opposite Ashley Tisdale in that sequence. My highlights were the Black Swan & ongoing Paranormal Activity rip offs, especially the pool cleaner party. Look at it this way, it's mindless fun, better with a beer in hand. It has it's moments and for those who care, stay on AFTER THE CREDITS for an extra scene. Ashley Tisdale is brilliant at the dead pan comedy required although I did miss Anna Faris a little."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "nikozguri",
        "review_rating": "1",
        "review_title": "Oh my god!",
        "review_detailed_main": "So, \"Scary Movie 5\".. it's just \"Scary Movie 5\". Which is funny, cause before it came out, i thought \"Scary Movie 5\" was kinda like \"A Haunted House\", and i thought OK, that's \"Scary Movie 5\". I don't wanna see it, and i don't wanna talk bout it. And sometimes it's fun to talk bout a movie that's terrible. This movie's FREAKING TERRIBLE!!! Alright, so in \"Scary Movie 5\" they spoof Mama, Paranormal Activity 4, but they don't just spoof horror movies. They also spoof Rise of the Planet of the Apes and Inception, ya these kinda movies. At the start of this movie, we see Charlie Sheen banging Ashley Tisdale, and then they get killed in the beginning, then a text comes up and it's like \"Charlie Sheen's body was found in October 27. His body didn't stop partying\" or something. Ya, the only funny part in the movie is in text form! What the hell is that supposed to mean?! Like there's a segment where they spoof \"Mama\": the little kids like \"Don't look in the closet!\" Ashley goes at the closet, opens the door and we see the maid on the toilet. And she farts, flies of the toilet and hits Ashley Tisdale. Right there, i was like \"What was that?\" The thing i don't get is: Why's there a toilet in the closet in the kid's bedroom? They put the toilet there so then they can have that moment, that's not funny at all. And they also spoof the \"Evil Dead\" remake, that came out 1 week before this movie came out. Which is why i believe that the production of \"Scary Movie 5\" a week before it came out. The execution's sloppy, the script's terrible. It's just filled with stupid jokes that u just don't care about. It's not funny at all. You just look at it and go \"Why am i here?\" So, just skip this, don't watch it, don't download it, don't rent it for free. 1/10"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bob-rutzel-1",
        "review_rating": "1",
        "review_title": "BAD and not in a good way",
        "review_detailed_main": "Don and Judy Sanders (Simon Rex & Ashley Tisdale) believe their family is being terrorized by a demon and must find a way to have this stop. This the basic plot. The rest are just skits that revolve around humans and demons to basically spoof other scary movies. None are funny or even come close to being funny.\n\nBeing the brave soul I took out Scary Movie 5 (ah, but you knew it was a comedy and not scary) and found it quite unfunny and mostly annoying. . Some have said that this movie spoofs a lot of other scary movies. I wouldn't know, but if you have seen those movies, it will be up to you to decide what skits herein this movie spoofs. I could care less. But, I did learn that this was not a funny movie.\n\nIt's true that the promos led me to believe I might enjoy this one. Wrong again. And, I was sure that the Mandatory Hollywood Rule for Silly and Stupid things would play a large part. And, without fail, they did, big time throughout the entire movie.\n\nThis movie is all raunchy slap-stick and done badly by everyone. There was no one in charge of anything.\n\nThere are a lot of stars in here for cameo purposes. I found the Charlie Sheen and Lindsay Lohan skit shown in the promo to be good. I laughed when Sheen was pulled out of bed by a demon and his jewels stopped his flight into the door. Ouch, ouch, ouch! Sorry, but that was funny. However, that scene WAS NOT in the movie. Fooled again. They used another unfunny skit to Benny Hill music.\n\nCelebs I recognized: Snoop Dog, Heather Locklear, Jerry O'Connell and Mike Tyson and there are others whom I have no knowledge of. Other actors were made up to look like the real stars for example: Leonardo DeCaprio and the movie character: Madea. .\n\nWhat you will see: adults hitting kids, fecal fights, child's hair on fire, things shoved up rectums, a lot of fighting some with fists and pots and pans, pies and fruit made with fecal matter, kids humping legs, a microwave being humped\u0085\u0085 I just cannot go on with this.\n\nThere are outtakes after the movie and none, again, are remotely funny. You will see some mouthing language that you didn't hear during the actual movie.\n\nThere is a Narrator throughout and he sounded very much like Morgan Freeman, but it was Josh Robert Thompson instead.\n\nTo give credit to this movie for spoofing other movies would be wrong because everything was done in ultra raunchy and disgusting ways. Basically, what we have is raunchy slap-stick throughout. (1/10)\n\nViolence: Yes. Sex: Simulated often. Nudity: No, but they came close. Lesbians: Soaping in the shower and later kissing. Language: Soft Stuff, but the outtakes had characters mouthing the other stuff."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "katherine-stephens27",
        "review_rating": "4",
        "review_title": "Was OK",
        "review_detailed_main": "I love parody movies, and have seen and have in my possession quite a few, especially those that feature the late and fantastic Leslie Neilson, including the previous Scary Movies. The previous 4 are great, they're funny and you can actually have a good time watching them. Laughs aplenty. This one... not so much. It had it's moments, but other than that it was just a ho-hum type movie. Didn't have the engaging action and comedy that you're used to from the previous films, and just didn't really do anything for me. I like Charlie Sheen as an actor, and he's can play some funny parts, and this was no exception, but then it kind of dwindled after that. I think it's because the previous cast were not there. I think that if all the previous actors were included, it would have been a great movie."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Kenjislamberry",
        "review_rating": "5",
        "review_title": "Not the same without Anna Faris and Regina Hall",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ThePhantomMovieBuff",
        "review_rating": "1",
        "review_title": "Are we funny yet?",
        "review_detailed_main": "One cannot really expect much from Scary Movie 5, the weakest and most tedious of the so called \"comedy\" franchise so far. Starring Ashley Tisdale and Charlie Sheen (who is only present within the first painful five minutes in a non funny sketch with Lindsay Lohan) the film spoofs big hitters such as Mama, Evil Dead and mostly Paranormal Activity, as well as non horror films Inception and Rise of the Planet of the Apes, which believe you me, comes across as an even more boring watch than the actual horror spoofs. The film drags from one loose plot line to the next, and literally rams down unfunny toilet humor gags down our throats in the hope that we find them the least bit humorous or clever. Scary Movie 5 possess no humor whatsoever, and let's be honest, does it really come as a shock?\n\nThe not so painful truth is behind this movie is, every gag resolves into a heavy sigh and the rolling of eyes. The thing is with Scary Movie 5 is that it is rated as 15 like its predecessors, but the truth of it all is that the film really is aimed at anyone under the age of 5. The funniest part about Scary Movie 5 is that the target audience is not even old enough to watch it, and by the time they are, the film will be forgotten. I wouldn't even give it that long.\n\nMy Verdict: A mindless bore that really doesn't improve on any of its previous instalments, and makes you sincerely wish that the Scary Movie franchise will just go away forever."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "PhoenixEndSong",
        "review_rating": "1",
        "review_title": "Scary Movie 5... the low down",
        "review_detailed_main": "I had high hopes for this movie, i highly enjoyed 1 & 2, and 3 has its funny moments, with 4 being worth a watch (if only to say you have seen it) This film is without a doubt the worst film i have ever seen in cinema history, it has nothing of the humour in the first couple of films that was expertly provided by the Wayan Brothers, and the main (wo)man herself Anna Faris, who's expert timing and well placed gags literally made the Scary Movie franchise what is was, This film has none of their talents (which is extremely obvious) and has obviously been purchased by some obscure nobody who hoped to capitalise on the successful franchise.... Which FAILED in epic proportions, throughout the entire movie, i laughed a grand total of twice... and not the roll around belly ache laugh, just a minor chuckle... twice. In my opinion this film should be eradicated from history and be re-written ONLY if the Wayan Brothers are on board and ONLY if Anna Faris reprises her role as the hilarious Cindy Cambell."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jtungsten16",
        "review_rating": "10",
        "review_title": "This movie was not as bad as people are saying!",
        "review_detailed_main": "i think Scary Movie 5 was good, I would not say it was great, but it had its moments where it made me laugh, I think the funniest and best part of the movie was Lidia Porta (Maria) she was so funny and a great actress. One of my favorite scenes was the pool vacuum party in the back yard! That was hysterical. This movie reminded me a lot of Airplane the same kind of humor. Scary Movie 5 did its job and entertained us and made us laugh, it was not meant to win any Oscars and it did not deserve all the hate that it got. Scary Movie 5 will always be one of my favorite movies and the bluray version of the DVD is better. Please don't listen to all of the hate and give Scary Movie 5 a chance, I don't think you will be disappointed."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "XanderDevil",
        "review_rating": "6",
        "review_title": "Scary Movie 5 follows in the footsteps of its predecessors",
        "review_detailed_main": "Scary Movie 5 is a parody movie comprised of slapstick humor, whimsical characters, and celebrity satire. The movie is done in the same vain as all the other Scary Movies. I think that Scary Movie 5 is one of the better movies in the series, Scary Movie 3 being my favorite one.\n\nThe movie is over-the-top and there is hardly anything witty about the humor or writing. Some of the scenes are ridiculous enough to come out of a child's imagination. Or maybe a child's imagination would have resulted in better quality humor than what was presented in this movie. Nevertheless, I really enjoyed this movie, even though I know that the jokes are childish, over-the-top, and exaggerated. I have always enjoyed movies within this genre, movies such as the Scary Movies and The Comebacks. Meanwhile, I am not one to enjoy other exaggerated movies, like Anchorman: The Legend of Ron Burgundy. I am not sure why such movies appeal to me more than others. If I had to come up with a reason why I liked the Scary Movies is parody: I like the satirical and ironic imitations that are intrinsic of parody.\n\nThe difference between this movie and the others is, for a lack of better word, subtlety. In previous movies, especially the first two movies, there are a lot of jokes related to disgusting events or disfigured and disturbing people. The first movie had an explicit over- the-top sex scene. The fifth installment's sex scene used more figurative imagery to represent what went on. A disfigured man in the second movie was the basis of a lot of jokes. Here, the only thing that comes close to that is a genetically-enhanced ape that is parodying The Rise of the Planet of the Apes.\n\nI like Scary Movie 5 because of its parodies of movies, its slapstick humor, its whimsical characters, and celebrity satire. I am overlooking stupidity and the exaggeration because it does not bother me at all: I expect it as part of the movie."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "stephanie-06",
        "review_rating": "1",
        "review_title": "Why ruin a great movie franchise?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "cairn6",
        "review_rating": "1",
        "review_title": "85 Minutes of My Life I'll Never Get Back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "view_and_review",
        "review_rating": "5",
        "review_title": "As Far as Parodies Go This Wasn't That Bad",
        "review_detailed_main": "I had lost count of the Scary Movies. I actually thought I'd already seen this one. They're all one big blur with the exception of the first Scary Movie; that was undeniably the best and it went downhill after that. I believe there was a sharp drop after Marlon and Shawn Wayans left the franchise.\n\nAt any rate, it was on Netflix so I figured there was no loss if I watched it to see if in fact it was one I'd seen already. Well, it wasn't and I did enjoy it. The main spoof was the movie Mama which I have seen so I was able to understand many of the references. Parodies are typically bad so this one was probably above average for a parody. It wasn't too vulgar, the slapstick and physical comedy wasn't too over the top, I got to see both Sheen and Lohan ridicule themselves. Not too bad."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "alexjtonks",
        "review_rating": "1",
        "review_title": "IQ above 0? If so this is not the film for you...",
        "review_detailed_main": "I have been a fan of the scary movie series for a good few years and have seen them all multiple time and had high hopes for this film HOWEVER this was not the case\n\nIf you, for one, have an IQ above 0, then you will find this film lacklustre, humourless with a severe lack of acting ability The appalling performances will astound you like you've never seen it before. What makes this worse is the appalling excuse of a story line which is next to non existent. Don't get me wrong there were some amusing moments in the film which were well scripted and thought out but as for the rest of the film it appeared to be built around these moments unfortunately dwarfing them.\n\nThis film was overly disappointing and unfortunately this film does not fit in with the rest of the scary movie films and is a let down to the franchise and does not do the series justice."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "karolainza",
        "review_rating": "1",
        "review_title": "Just save yourself and don't watch it.",
        "review_detailed_main": "I am so angry. I used to love scary movie saga and I waited years for the fifth episode and I am so disappointed. This was BAD BAD BAD. I don't understand why did they do this? I am sorry but I just don't understand what was that. I watched the trailer and I thought this was quit bad but I waited so long for new episode, so I just had to see it my own. So when I started watching the movie, my first thought was: why haven't I laughed yet? When I had watched almost entire movie..than there was thoughts like: What happened with this movie? Why the movie doesn't make any sense? I did not understand the script, is there any? This was new level on failure..It seems the actors and writers were like: Hey let's get together and make a some money for just sitting there and talking some pointless things out of our mouth and hope fot the best.\n\nAgain I am so sorry for you guys..I hope you understand that you used to be such a great comedy, but now this is nothing. This is just so sad..."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "LLinus",
        "review_rating": "5",
        "review_title": "A fairly enjoyable movie to enjoy with good company",
        "review_detailed_main": "Watching this with good company and i can assure you'll be amused. To discover what is in the minds of the writers who banged their skulls together writing this comedy one can speculate if they are all right. I'd never thought Ashley Tisdale would want to be associated with a movie similar to this one, however, she acted just decent enough for the 'Scary movies' absurd life atmosphere, not to mention Simon Rex, as disoriented as usual but yet so funny having brought this with him in every 'Scary movie' he has appeared in. As of young age i was enjoying these flicks already, so i felt the urge to watch it for old times sake. Needless to say, it's a laughable movie, yet a brainless one."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "sebastian-38-327488",
        "review_rating": "1",
        "review_title": "2nd worst movie I've ever seen",
        "review_detailed_main": "My friends said this movie was good, so when i saw this movie at Best Buy i decided to listen to my friends when they said it was good; one of the worst mistakes I've ever made. This movie was so awful, i don't understand why this one was so bad, i saw 1 and 4, and I loved those. This one was awful, i didn't laugh once, the special effects were bad and the script sucked. In the movie, you could see the mask lines, you could see they were cheaply made, the mama costume was just cheap cloth and the make-up was really bad, and to finish it off: just the whole plot and charters were awful This movie cost me 2 things: 15 bucks, and 1 hour and 15 minutes. I thought 3.6 was generous. The worst movie I've ever seen is \"Meet the Spartans\" NEVER WATCH IT!!!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "hakon-hein-2-597678",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "This is the single worst movie I've ever seen. The \"-movie\"movies doesn't exactly have a good track record at this point, but the first Scary movies were actually quite funny. Scary movie 1 actually had me rolling at times, but also had great comedic timing. This movie however, lacks EVERYTHING. I didn't laugh once, ONCE. Not ONE thing made me laugh, no nothing. The scenes that were supposed to build some suspense weren't even laughably bad. The \"scary\" scenes weren't even close to scary; sped up and the music was so unfitting. Don't get me started on the so-called \"acting\" in this movie.\n\nDon't even consider watching this. Save yourself both the time and frustration of watching this movie. 0/10."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "PoisonKeyblade",
        "review_rating": "9",
        "review_title": "Hysterically Funny Spoof Film",
        "review_detailed_main": "It's been 7 years since Scary Movie 4 hit theaters to a pretty impressive box office run, and Scary Movie 5 brings the series back in a big fun way. If you loved the other four films (especially part 3) you will definitely get a kick out of Scary Movie 5. This is a spoof done right, written by David Zucker, the master of slapstick humor. Sure, like any spoof movie there are tons and tons of jokes and some miss the mark. However, Scary Movie 5 succeeds by sticking to its roots and rebooting the entire series for new audiences and old fans alike.\n\nThe first thing you will probably notice is the rather unfortunate and upsetting lack of Anna Farris. Farris rose to stardom almost exclusively through the Scary Movie films at first, building her comedic repertoire along the way. At the time of filming, Farris was pregnant, so Ashley Tisdale fills Anna's shoes in a surprisingly fulfilling turn. Sure, she's no Cindy Campbell, but Jody is a character you can root for and Tisdale really does prove she has good comic timing. Unfortunately, there is also no Brenda (Regina Hall) or any of the other great characters to be found in the other sequels. For this film, it actually works this circumstance to its advantage, bringing back both Charlie Sheen and Simon Rex as relatives (again) but playing completely different character than their counterparts from the third and fourth installments. Some of the side characters bring the most laughs, from Molly Shannon as Heather to Tyler Posey as a hardcore Christian chilling at a cabin in the woods (long story.) The opening scene rivals the best ones in this series, and the scene fully concludes after the credits roll so stick around for a fun moment and obvious ode to the other four movies. Lindsay Lohan and Charlie Sheen were absolutely perfect choices for the opening and I really missed them once they were gone. Also, I could watch Simon Rex do his awkward comedy schtick for hours and never get bored. Rock on, Dirt Nasty!\n\nThere are some really nitpicky issues to be found within this feature, but when you are watching a spoof film you really need to switch your brain off to have any fun. There are some odd dubbing issues as far as sound goes where it looks like the actor was saying something else, which most likely was a product of the numerous reshoots this movie underwent to remain more relevant. The Inception and 50 Shades of Grey spoofs kind of fall flat on their faces and bring the movie to a bit of a halt, but they are mere bumps in the road compared to the laughs to be found in the rest of the movie. I'm anxious to see an unrated version of this on DVD to see what was cut out or what footage/spoofs were excised completely from the final product.\n\nIf spoofs are your thing, there is plenty of hysterical moments to be found within Scary Movie 5, which actually takes chances and doesn't rehash the same material over and over again. This isn't your typical throwaway spoof. Though the ending could have used a bit of polishing (come to think of it, I've never been fully satisfied with an ending apart from the first), the final product is very watchable and has some decidedly off-the-wall moments. I can honestly say I loved Scary Movie 5, and if you're a fan of spoofs you will probably love it too."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "alexanderbrath",
        "review_rating": "6",
        "review_title": "Another hilarious movie from the Scary Movie team.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "Starts off completely wrong aka Paranormal Mama",
        "review_detailed_main": "But maybe that is why in the end I kind of enjoyed some of it. Not the beginning bit, mind you! Even Charlie Sheen explaining that (which is the only thing worse than his skit/intro with Lohan) does not make it better. We get, the two of them are making fun of themselves. Not something that is particular funny though.\n\nThe rest of the movie though: There are a few things, that were so silly that I had to laugh. Maybe it only makes sense or is kind of funny, if you have seen the other movies. Like \"Mama\" or \"Paranormal Activity\" which are the biggest influences here. If you have seen Haunted House (which I watched after Scary Movie 5) before you watch this, you might even like it more than I did. Regular Anna Faris is not back this time, but we get another actress who's doing a decent job of replacing. Though I guess if you were a fan of Farris, than you might be mad at her (not her fault though).\n\nBy far not the best spoof I've seen, but if you let yourself to it (and be silly) this actually has some funny moments (don't let that stupid beginning ruin the whole movie for you)."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "peidex",
        "review_rating": "1",
        "review_title": "Worst movie of my life",
        "review_detailed_main": "I loved the first 3 scary movie films, and the 4th one was kinda OK, but when this one came out I really wanted to see it because I love scary movie in general. But in this film, they took away everything good about it. Where is Cindy? Where is Brenda? And who the hell decided to put Snoop Dog in the film? I mean seriously, he is not an actor, please don't. This film has the worst acting of all time, awful editing, and zero imagination or effort put into it. Sequels tend to usually be worst the the first film but there is a limit. I didn't laughed once, and neither did any of the people in the theater. If you like scary movie please don't see this one or it will ruin it for you."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jessietrevino",
        "review_rating": "2",
        "review_title": "No Anna Faris. No good.",
        "review_detailed_main": "The absence of Anna Faris was a dead giveaway that this movie was gonna be trash. Awful, unfunny and painful to watch. They should have stopped at 4. You will be more entertained watching paint dry."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "filipemanuelneto",
        "review_rating": "4",
        "review_title": "An inglorious ending, even if it's not as bad as everyone says.",
        "review_detailed_main": "Okay, this film is not a good one. But honestly, I didn't think it was as bad as everyone says it is. For me, the worst film in the franchise was the second on the list. Anyway, this film is bad, and that is indisputable. With him, it seemed, definitely in a definitive way, a franchise that had an unusually long life, considering the kind of films presented.\n\nThe biggest problem with the film is not being funny. The jokes are within the standard of the franchise, but they are lukewarm, they bet a lot on eschatological humor (I don't know what's worse, that or the sexual obsession that abounds in teen comedies) and the fact that we easily predict them takes away from them grace. Some satires (like the one made for the films \"Mama\" and \"Cabin in the Woods\") did not work, although the script also seemed to me within the standard that the franchise has accustomed us to. There was a lack of a more competent and funny cast, in addition to the firm hand of a director capable of demanding more from everyone involved. Zucker, who signs the script, is good at making comedies when he can do anything he wants, and he has already demonstrated it, having been responsible for \"Scary Movie 4\", for me the best film in the franchise. But he is not alone here, neither in the direction nor in the script, and I do not know how well the joint work went.\n\nThe cast is amateur, to be nice. I don't know where they were recruited, but what gives the film some life is decent acting and Ashley Tisdale and Erica Ash alongside some of the cameos: the opening scene, with Linsay Lohan making humor out of her own personal misfortune, it just doesn't become infamous because she's comfortable with it, and Snoop Dogg doesn't seem to know how it got there."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "capone666",
        "review_rating": "1",
        "review_title": "The Vidiot Reviews",
        "review_detailed_main": "Scary MoVie\n\nThe key to creating a great parody is to never watch any installment of the Scary Movie franchise.\n\nRegrettably, the makers of this comedy not only ignored that rule but also made one of their own.\n\nOn a mission to snatch weed plants from the wild, Snoop Dogg and Mac Miller encounter a cabin that is occupied by three wilding girls.\n\nThe offspring of Charlie Sheen, the feral orphans are entrusted to his brother Dan (Simon Rex) and his girlfriend Jody (Ashley Tisdale).\n\nProtecting the sisters from harm is an evil spirit named Mama.\n\nJody later uses the book of the dead to exorcise Mama from the children's lives.\n\nInfantile and redundant comedy combined with overt and pointless references to contemporary movies, Scary MoVie is devoid of purpose and laughs.\n\nNow, if we can get Scary Movi6 to lampoon Scary Movie 1-5 than maybe this series will implode.\n\nRed Light\n\nvidiotreviews.blogspot.com"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "pmtelefon",
        "review_rating": "5",
        "review_title": "Watchable silliness",
        "review_detailed_main": "\"Scary Movie V\" wore me down after a while and I ended up kind of liking it. It's helped a great deal by a very game cast. They all know that it's a silly movie and they seem to be having a good time. Ashley Tisdale is the biggest surprise for me. Not only is she very dreamy looking but she also gives a fearless and very funny performance. What she does in this movie is no easy task. She does a great job. The rest of the cast is also very good. Once I got into the groove, \"Scary Movie V\" ended up being worth the watch."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jevosborne",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "I wish I could give it a lower score than 1, I'm being extremely generous with the score I gave it. It didn't even seem like a Scary Movie at all. It was just horrible, I didn't laugh at all. It was worse than those cheap sex and drugs comedy movies that are a dime a dozen. I expected more from it. The mise en scene was completely different than the other Scary Movies. And it lacked the flow typically found in a Scary Movie, the flow was completely off. As a comedian, I was in physical pain while watching this movie. There were so many places during the movie that could have at least been marginally better had they done things slightly differently."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "luukvanblankers",
        "review_rating": "2",
        "review_title": "it is never good when the trailer also sucks",
        "review_detailed_main": "I went to scary movie with no expectations I knew it would most likely suck and thought i knew that i still disappointed.\n\nwhen you go to a comedy movie you expect to get at least a few laughs, let me tell you you will but not because the movie is good.\n\nThrough the whole movie me and the person I went with where saying: Are you F*cking kidding me, OMG and you've got to be kidding me. it was so unreal to be in a movie that sucks that much. half way in the movie you want to leave but you wont because there will be a funny part? let me tell you there are no funny parts!\n\nyou will see what feels like a high school project which wont even be enough to receive a C. and that movie did cost 20 million dollars.\n\nthe first scary movie was pretty funny from there on it went down the road with this movie as the lowest point you can get."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "gamachenj",
        "review_rating": "10",
        "review_title": "Loved it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "neil-476",
        "review_rating": "6",
        "review_title": "So-so spoofery",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "leonblackwood",
        "review_rating": "1",
        "review_title": "Waste of time! 1/10",
        "review_detailed_main": "Review: This movie was completely ridiculous. It's totally not funny and the acting is really terrible. They based the movie around Mama with a touch of Evil Dead, Black Swan and the Cabin In The Woods, but they didn't do the movies any justice. The writers really didn't do a good job and most of the actors are either in debt or have suffered a slump in there careers. I'm not a big fan of the Scary Movie franchise, so I got what I expected from this film. Judging by the money that this movie has made, I sure that they will be releasing more movies in this franchise, but I personally think that they should look for some better writers or just leave the series alone. Terrible!\n\nRound-Up: The out takes at the end of the movie are much funnier than the actual film itself. There are loads of innuendo's which refer to other movies but they weren't that cleverly done. Tyson had sunk to a all time low by making an idiot of himself in this movie, as well as Charlie Sheen and Lindsay Lohan who have gone through there own personal turmoils of late. If they were using this movie to boost there careers, they have definitely picked the wrong film.\n\nBudget: $20million Worldwide Gross: $64million\n\nI recommend this movie to people who are fans of the Scary Movie franchise, but don't expect much. 1/10"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "stankyshorts123",
        "review_rating": "1",
        "review_title": "This \"movie\"...",
        "review_detailed_main": "I feel embarrassed to even give this \"movie\" 1 star out of 10. This abominable piece of sh*t deserves a flat out ZERO. This \"movie\" is a collection of pointless and painfully unfunny jokes that have nothing to do with the \"storyline\". Never can anybody force me to watch this godforsaken disgrace of a \"movie\" ever again. There is NOTHING redeemable about this \"movie\". The makers of this \"movie\" should be ashamed. The only good Scary Movie was the first one. I think the only good thing I can say about this \"movie\" is that it is so bad, that there may not be a sixth one! But really, this is the worst \"movie\" I have ever seen in my entire life. I bet the script to this \"movie\" was written on the cheapest toilet paper ever with a red crayon. The jokes in this \"movie\" are not funny whatsoever, and it just comes off as immature and unbelievably stupid. Never in my life have I ever seen a \"movie\" this bad. Seriously, WHO IN THE HELL THOUGHT THIS \"MOVIE\" WAS A GOOD IDEA?! How in the F**K did this get greenlit? I don't know, and I don't want to know. All i want to say is f**k this \"movie\". Thank god I saw this for free, so no money was wasted...but unfortunately some of my time was. Why am I even wasting time writing this review? I don't even know...f**k it. 0/10"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "TheMovieDiorama",
        "review_rating": "1",
        "review_title": "Scary Movie V not only killed a franchise, but a whole sub-genre.",
        "review_detailed_main": "I honestly wouldn't be surprised if we never get parody films being produced ever again after this. Holy. Mama. Flipping. Spoof. Balls. What a monstrosity. I can't believe I endured it. I've done it guys! I actually watched the whole thing in one sitting. I've evolved as a film critic, and I didn't press B to cancel. Throw anything at me, I'll watch it. Unstoppable. Uncontrollable. Un-flipping-believable. I am...that guy. A family adopt two feral girls and move into a house that is haunted by a mothering ghost. 'Mama' plus 'Paranormal Activity' divided by 'Cabin in the Woods' multiplied by 'Inception' and halved by 'Fifty Shades of Grey' equals one of the worst films I've ever seen. It's not even bad good...it's just plain bad. It started off well with a self-referential scene including Charlie Sheen and Lindsay Lohan, and then it declined to nothingness. I didn't laugh once, heck I didn't even smile. The jokes were horrendous and seemed like they could only appeal to a three year old. Honestly. There were more jokes orientated towards bums then actually anything witty...in fact, there was no wit. It was aimless. Dumb. When was sticking an object up your ass and smelling it funny? When was spontaneously combusting babies humorous? I just can't even comprehend the thought process of this! The lack Anna Faris and Regina Hall was noticeable and was a huge detriment to this fifth instalment. Ashley Tisdale? Really!? Shouldn't she be singing next to a swimming pool in 'High School Musical 2'? Heck, I don't want her on my screen! Snoop Dogg? Usher!? They really were clutching at straws here, sweet lord! I saw better acting in the porn video I watched this morning, and there was no talking in that! Christ! This genre is done. This film has resulted in the decimation of parodies. It's outdated. It's stupid. It's absurdly unfunny. It's just wrong. Scary Movie V is, without a doubt, atrocious. Now, if you'll excuse me, I'm going to chill in the sun with a fresh cold cider and rethink my life..."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "rahmannoodles22",
        "review_rating": "1",
        "review_title": "Worst Movie of 2013 - Noodles Review",
        "review_detailed_main": "It sucked. I don't really even want to talk about it. I actually sometimes enjoy watching the first two Scary Movies, but this one is just so bad. It's not even funny! I thought we already got our horror parody of the year with A Haunted House like yesterday. Scary Movie 5 is even worse than that. It's written terribly, it's acted terribly, it's jokes are terrible. The movie relies on poop and fart jokes; c'mon, that's too stupid. I only laughed for about 2 minutes, during the Inception part of the film. But even that was just a small smirk-type laugh. That's sad for a movie that's supposed to make people laugh out loud. All in all, I really don't want to talk about this movie anymore. It's stupid, unfunny, and unnecessary"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "aesgaard41",
        "review_rating": "2",
        "review_title": "New Sequel, Same Jokes, Same Mistakes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "By far and away the worst of the series",
        "review_detailed_main": "The first Scary Movie was very entertaining if rather mindless, 2 is uneven though much better than what is often said about it, 3 was a mixed bag and 4 was poor and until now was the worst of the four. This fifth entry was just awful with no redeeming values, the only movie of the series to be on the same level as rubbish like Disaster Movie and Epic Movie and actually comes dangerously close to being even worse. Visually it's cheap, with the way it's shot and edited strongly reminiscent of a poorly done direct-to-video movie and that is the same with the sets. The soundtrack is generic and like a noisy music video with a lot thrown in for the sake of it and very little adds anything to what is going on. The dialogue toe-curlingly bad in how inane and excessively vulgar it is. Nothing about it is funny or witty, much of it is immature and insulting, if the writers were clueless as to what was funny that comes through loud and clear. The funniest it gets? \"Help, there's a mad demon in my house\", and if you're thinking that that is also stupid, you're right, it is. There is not much story here to speak of, it was just an excuse seemingly to cobble together genre send-ups and parodies and the sheer idiocy only increases. And none of these are funny, some of the gags are drawn out to an unbearable degree, the ones sending up horrors like Evil Dead have nothing atmospheric, scary or remotely creepy about them and the bulimia and pregnancy gags were tasteless(and not mildly, this is more above-borderline offensive, in quite some while no other movie has evoked a reaction as extreme as this). There's even a surreal spoof on Fifty Shades of Grey, which came across as out of place. The acting is awful, and even that is an insult to the word awful. It wasn't a problem that the original cast weren't there, what was was that none of the actors had any spirit and energy to their performances, the few actors who do have some talent are wasted and some overact, Ashley Tisdale being the worst offender. Charlie Sheen and Lindsay Lohan send themselves and their tabloid reps embarrassingly, the Paranormal Activity spoof wasn't scary or halfway amusing in the slightest. In conclusion, a complete mess and by far the worst of an overall hit-and-miss movie series. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bibs213",
        "review_rating": "1",
        "review_title": "I wasted my time and money, don't waste yours",
        "review_detailed_main": "I would've walked out, if my friend hadn't fallen asleep.\n\nThis is my first review and I'm only writing this as I don't want you to be 'robbed' of your time or money (as I was).\n\nThis movie had lacklustre jokes, wasn't fun, really poor script! I really can't believe this script was given the go ahead, it was as if it was written by a elementary pupil.\n\nUse of familiar actors are used to make you believe that this film will have some credibility but don't believe the hype!\n\nDon't be fooled into watching it under the pretence of the original scary movie franchise quality. You've been warned, don't get milked!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jeffrey-utley",
        "review_rating": "1",
        "review_title": "This Movie Wasn't Horrible",
        "review_detailed_main": "Fans liked 'Scary Movie and 'Scary Movie 2' when they came out in 2000 and 2001. After that the director was changed and in 2003 'Scary Movie 3' came out, which fans didn't like, even though it had a higher budget and bigger cast. The budget was even higher for 'Scary Movie 4', which came out 2006, which fans hated. 'Scary Movie 5' was meant to come out in October or 2008, but that never happened. Now, from the same writers of 'Scary Movie 3' and 'Scary Movie 4', comes 'Scary Movie 5', the real release date. It's not called 'Scary MoVie'. I don't know why it's called that on IMDb. Anyway, since it had a failed release date, didn't have a real one until five years after the failed one, and was from the same writers of two movies that did poorly with fans and critics, the expectations were very low for this movie... But it still had a negative 4% Rotten Tomatoes critic score, and a 57% user score, which was also negative, but almost positive. I really didn't think this movie that horrible.\n\nThis movie was stupid... It was very very stupid. There were many, many jokes in this movie, which was a bad thing. The jokes were almost all from the same humor. It was very strange humor. The humor was funny, but not hilarious. The humor also got old very quick. Since it went on so long, and didn't really change, it had a clear path to get old quickly, and it did. The jokes were also all over the place, and sometimes they would drag on too long and not be funny anymore. Sometimes there would be many things happen in a row that were too similar to be funny, even the second time. I don't dislike stupid humor, but there's a right way to do stupid humor, and they didn't pull it off very well.\n\nGetting past that the humor was stupid and the same and all of the other faults I found in it, 'Scary Movie 5' was a funny movie. At the beginning, when the humor wasn't old yet, and some other parts in the movie, I laughed most of the time. The jokes still lingered for a while in some of the funny parts, but the beginnings of the jokes would be enjoyable. Even though the humor stayed the same in the movie, They changed what they were making fun of several times. Some of the times it matched the movies they made fun of, and sometimes it didn't. When the humor and jokes hit the movie spoofs they matched, 'Scary Movie 5' would be funny and enjoyable then. They could never pull off a very long portion of the enjoyable parts, though. It would only pick up for a few scenes, then go back to the usually unfunny parts. It switched movies several times, though, so it would always come back around. This movie had many funny parts, like in one scene I laughed and laughed and laughed. They had pulled it off right. The writers set up the right things in the movie to poke fun at and make fun of with the right humor, almost perfectly. But the jokes stayed the same, so eventually it died down.\n\nThe verdict on this movie is that it was alright. I mean that as It was not bad, but I didn't necessarily like it. I was gonna rate this movie as a 5/10, but I walked out thinking positively of it. I understand why someone wouldn't like this movie, though."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "s_campanale",
        "review_rating": "10",
        "review_title": "Mama meets Paranormal Activity 2 meets Rise of Planet of the Apes meets Black Swan meets Inception meets Evil Dead - And has a Hell of a party!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "westsideschl",
        "review_rating": "7",
        "review_title": "Spoofing Horror part 5",
        "review_detailed_main": "Mostly spoofing the well done Mama and Cabin in the Woods as well as other modern horror genre films and their overuse of the same hooks (pun) over and over again. I should give accolades to the Morgan Freeman like narrator spoofing - had me fooled. Morgan's science docs will never be the same. Spoofing of the following: Any desolate cabin in the woods with hanging dead animals and mysterious object (book in this case). Flickering lights; moving household items although I don't recall the customary opening/closing doors. Floating/suspended people. Inanimate objects coming alive - pool vacuums (and their regular vac friends) in this case. Shadowy figures moving in the background. Shadowy figure tends to be female with long dark hair. Excessive number of cameras placed to see every corner of the house. Rec symbol in the corner. Loud, including the tiresome banging, noises. Possessed and/or wild animal like kids. Helicopter view of lone car moving along country road which the film substituted for by using a toy car performing the same hook. Loved it! My criticism, which mirrors some of the negative reviews, is that it seemed to get a little slow and redundant at times - could have used more hooks from other films."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "denis888",
        "review_rating": "1",
        "review_title": "Cringy",
        "review_detailed_main": "The previous 4 parts were really great, and Anna Faris shone as a great awesome star. She held this all together. Now, after 7 years, the fifth part came. No Anna Faris, no Regina Hall, and no Wayans Bors. NO Zucker, no humor, no laughter, no wit and no sense. No good script, no real twists, no hilarious spoof, no clever parody, no smart jokes and no real essence. No good play, no great actors, with Tisdale being wooden and wry, then no serious try to make anything valuable. No real effort. In a word, the worst of the worst"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "lorcan-61881",
        "review_rating": "1",
        "review_title": "In the name of God..",
        "review_detailed_main": "Scary Movie 5 came out in 2013,7 years after Scary Movie 4,this film made YouTube blow with fan trailers and scripts that made this film look awful. This tells the story of Jody and her husband who move into the house that's haunted and woooo,scary stuff happens that isn't scary,ha ha!! This film was utterly awful. First of all,the acting,this films acting was f*cking terrible,Ashley Tisdale:Awful,Simon Rex:Awful and everyone else was just awful. This film parodied 'Mama,Paranormal Activity,Rise of the planet of the apes,black swan,cabin in the woods and evil dead'. This film is absolutely horrible and it was such a waste of gathering all my excitement up for this film because it was so bad. I was so so so looking for forward to this. HOW DARE YOU!!!!!!!!! Scary Movie 5 is terrible. Don't Watch This.\n\nNo plans have been made for a sixth film and lets hope it stays that way"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "cosmo_tiger",
        "review_rating": "5",
        "review_title": "I have to say this was much better then I expected. Laughed throughout. Started funny but then drug to end. I say B-.",
        "review_detailed_main": "\"I think there's something going on in this house. Something about this mama.\" After Charlie Sheen dies his kids are left to themselves in a cabin in the woods. When they are found they are returned to his brother and his new wife. The new parents discover that the kids are not normal and strange things begin to happen around the house. There really isn't too much I can say about this movie. I will say that it was much better then I expected, but I also expected it to be very awful. I thought the first movie in the series was funny. I didn't like the second one (because of the tin arm guy). The third one was OK and I really don't remember the fourth one but I know I saw it. I was even more leery about this one because Anna Faris isn't in it. I will admit that I laughed out loud a few times throughout but like most spoof movies it starts out funny then by the end you are just waiting for it to be over. I did expect much worse though. Overall, better then I expected and it did make me laugh. I give it a B-."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Oer-6",
        "review_rating": "1",
        "review_title": "The disappointing breaking point",
        "review_detailed_main": "The poisonous humor of the Scary Movie spin-offs has seeped into the Scary Movie franchise and destroyed it from within. Epic Movie and Disaster Movie are the worst of the spin-offs and this one is pushing the limits of being grouped in the same category. I found Scary Movie 1 and 2 hilarious. Scary Movie 3 and 4 were also funny. When I heard about this I had hopes and doubts. Unfortunately it turned out like the bad spin-offs. Date Movie was OK... This one was not. I prefer A Haunted House over this one.\n\nI hoped that the days of the Scary Movies were not over. But after 4 years now it seems more likely that this fifth movie killed the Scary Movie franchise.\n\nStill it's not as bad as Epic Movie and Disaster Movie. I think. It's hard to compare bad movies. And I don't really have the need. I did however, have the need to share my distinction between Scary Movie 1-4 and 5.\n\nBottom line is: IT'S NOT THE SAME AS THE OTHERS! And it most likely spelled the end of the franchise. Which is sad and disappointing. Even though we will always have the memorable and hilarious quadrilogy before this one. The other movies had some lame sections which were survivable. But this whole movie is a lame section. I'm putting all my hopes in the new \"A Haunted House\" franchise. May it live long and prosper."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "lil_miss_emo08",
        "review_rating": "1",
        "review_title": "Worst. One. Yet.",
        "review_detailed_main": "I love the original scary movies with the some of the original cast, when they announced this I thought hey I've seen the rest I'll watch this.. omg I wish I hadn't... the beginning was so long and over played I was bored before it even started... I like ashley tisdale but her acting in this was so off, so not her best.. tbh the acting in all of this was shocking... if your tempted dont be you will never that part of your life back..."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "EpimetheusA1",
        "review_rating": "1",
        "review_title": "Ugh",
        "review_detailed_main": "So, this movie is terrible. Seriously. Want to see the reputation of a decent parody movie franchise go down the crapper? Look no further. This movie feels like it was written and filmed the month before the release date. Yes, that bad.\n\nRun away from this one.\n\nRun far, far away."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "wslb-79384",
        "review_rating": "1",
        "review_title": "Trying to hard",
        "review_detailed_main": "The movie was a huge let down they should have never followed through with this, the jokes are very cringe worthy, not even funny. Deffinetly worst of the series, I miss the original cast when the slap stick comedy was original. Shame."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "callanvass",
        "review_rating": "1",
        "review_title": "You might as well bang your head on the wall a few times in lieu of watching this, because it is headache inducing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "RyanLawrence",
        "review_rating": "9",
        "review_title": "Hilarious Movie, but a bad movie",
        "review_detailed_main": "Honestly if you want to see this movie because it looks funny, you should still see it. The only reason this movie got bad reviews is because it is a horrible movie. However if you want to go just to laugh, you should definitely see it. In my opinion, it is one of the funniest ones so far.No Scary Movie movies are supposed to be good movies, they're supposed to be funny movies. That's the point, they are made to be that way. Critics should know that. It's a 0.5/10 for a good movie but 9/10 for the funny parts. Don't listen to the critics they don't know what they're talking about . Movies I recommend you see before just watching it: -Paranormal Activity 4 -Black Swan -Cabin In The Woods -Planet of the Apes -Evil Dead"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "djkbee",
        "review_rating": "7",
        "review_title": "If you watch this & don't laugh you need Anti Depressants",
        "review_detailed_main": "I'll keep this short and brief. It's very funny and does not deserve these 1 star review I'm seeing here. Thats ridiculous and blatant sabotage against the idea of the movie and probably the whole series. If your a horror fan you will get all the jokes which in this one refers to Evil Dead, Paranormal Activity and few more references to other big films like year such as Black Swan, Planet Of The Apes etc.\n\nVery funny from start to finish, was surprised to see Mac Miller and Snoop do their part near the beginning and end... was funny. Charlie Sheen is only in this movie at the very start not throughout the rest. All in all it should definitely give you a good giggle on a regular basis... the series of Scary Movie is still alive and funny."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jaydenjcrowe",
        "review_rating": "1",
        "review_title": "The worst film I've seen in a while.",
        "review_detailed_main": "Plain awful. Just awful. Atrocious. In fact worse then atrocious."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "osj2507",
        "review_rating": "1",
        "review_title": "I think time has run out for spoofs",
        "review_detailed_main": "Why is every spoof movie taking so much, and turning it so bad, from the paranormal activity and many other great movies, it should be possible to make a spoof that is actually funny and not just lame jokes and bad parodies.\n\nThis film is very much concentrated about the Paranormal Activity concept, that franchise have already made kind of a bad situation for themselves and all the spoofs like this one is even worse.\n\nThere where some funny moments, but mostly it is not good and not even funny, if you cannot make something worth seeing, please stop this franchise."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Screen_Blitz",
        "review_rating": "1",
        "review_title": "Horrendous waste of time",
        "review_detailed_main": "I honestly cannot stress how terrible this movie was. I have seen the other four scary movies, and I didn't ever find them funny (except the first one), but watching this one was ABSOLUTE torture. The humor was mind-glowingly dumb and made zero sense whatsoever. The entire plot made no sense, and all the jokes this movie spits out were so random. Is this movie even a comedy? I think I have seen suspense-thrillers with more humor than this. All this does is just spoof scenes from different movies, and I never laughed a single time.\n\nThis movie was bad on so many levels. Every time a character would crack a joke, I just rolled my eyes. The humor consisted of nothing but fart jokes, poop jokes, toilet jokes, slapstick jokes, and stupid sex jokes that are not even funny on paper. There are sex scenes that are not real sex scenes at all, there are a fight scene that looks like a dumb cardboard cartoon off of Youtube, a man who gets injured like every scene from dumb random activities. All in all, this is one of top ten worst movies I have ever seen. It is not so awful that it's good, it is not awful good, it's just AWFUL!!!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "richieandsam",
        "review_rating": "5",
        "review_title": "Please kill off the Scary Movie franchise now.",
        "review_detailed_main": "SCARY MOVIE V\n\nBlimey\u0085 again we have a franchise that doesn't know when to end. This movie should have never been made.\n\nThis movie parodies other horror films that have recently come out. In this film we see spoofs of Evil Dead, Mama, Paranormal Activity, Cabin in the Woods, Rise of the Planet of the Apes, Black Swan and Inception.\n\nI loved Scary Movie. I thought the original movie was brilliant. But after the second one they all mingle into one big mess for me. There are far too many parodies out there these days that they have stopped being funny. I guess it is one of those 'too much of a good thing' situations. I have always enjoyed stupid humour. It started when I was a kid and watched the Naked Gun. From then on I always looked out for them. But now it seems they are pushing it too far that it has lost its comedy value. I remember going to the cinema to watch Vampires Suck\u0085 the whole movie sucked!\n\nAnyway\u0085 back to Scary Movie 5.\n\nThe movie has a lot of famous faces in, but they are mostly just cameos. They even put the cameo stars on the front cover of the DVD\u0085 it's as if they knew that no-one would watch this unless it has some decent names attached to it. The main character is played by Ashley Tisdale. I was watching this movie looking at her thinking \"I know her from somewhere\" But I could not remember where I had seen her. Then the nightmare came back to me\u0085 \"NOOOOOOOOOOOOOOOO\u0085\". It is Sharpay from High School Musical. I tried my best to delete that film from my memory. But to be honest, she didn't do a bad job in this. She was funny in places and can imagine she could be a comedy actress if she had a decent film to be in. The cameo stars were Charlie Sheen, Lindsay Lohan, Snoop Dogg, Terry Crews, Bow Wow, Heather Locklear, Jerry O'Connell & Mike Tyson. That is one hell of a cast list\u0085 but they are not really on screen long enough for you to appreciate them. In some cases if you blink, you will miss them.\n\nThis film is not all bad. I was laughing out loud to a few scenes. There were some scenes that were very funny. Just not enough of them. I think the main reason I found them funny is because I have seen the movies they were mimicking.\n\nI was also very surprised to see the film was only on for 1 hour 8 minutes (not including the credits). That is very short for a movie\u0085 and even though it was not a great film I still would have wanted it to go on a bit longer. It felt like they had run out of things to parody so they ended the movie.\n\nOverall the film was amusing in places, but I did find myself watching it with a straight face through a lot of the gags. Mainly because they have been done a million times over. I really hope they don't make any more now. I believe this was the final nail in the Scary Movie coffin.\n\nI will give this film 5 out of 10.\n\n\"I'll pay you to get me out of this movie\"\n\nFor more reviews, please like my Facebook page:\n\nhttps://www.facebook.com/pages/Ordinary-Person-Movie- Reviews/456572047728204?ref=hl"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "terrorfirmer-ie",
        "review_rating": "5",
        "review_title": "Not quite as bad as the rating suggested",
        "review_detailed_main": "I wouldn't argue this isn't the weakest of all 5 movies or that it's a good movie, but it's not downright awful if you enjoy the others.\n\nThere was enough laughs and decent scenes that I felt it was worth watching even if there's a lot of misses as well.\n\nAshley Tisdale does a decent job replacing Anna Faris but the film definitely missed having the Brenda + Cindy duo in that Black Swan sub-plot.\n\nI'd say 5/10 for the inconsistent laughs, but they're not entirely absent despite a fair few scenes that fall completely flat."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "m-47826",
        "review_rating": "2",
        "review_title": "One of the best sequels.",
        "review_detailed_main": "Which says a lot. The humor is unapologetic just like we would expect from a good parody movie. And some of the actors energy was contagious. Which all those various cameos, being highlights of this otherwise mediocre sequel. And maybe that was the true appeal of this last installment. Which storyline goes in all directions at once. And some jokes can be funny, if you make the effort of not being a self important Dbag. Just to be clear, the first movie was the only good one of the franchise. But amongst all those bad sequels, this one isn't so awful after all..."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "wiltoncarter",
        "review_rating": "1",
        "review_title": "AN 86 MINUTE TRAILER FOR HELL",
        "review_detailed_main": "I loved the opening sequence with sheen and lohan, i'm not a very big fan of those two, i just though it was the only funny part of this monstrosity. I nearly died laughing at their bedroom shenanigans, but now that i think about it i might have really been dead, that would explain the rest of the movie."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "rivertam26",
        "review_rating": "5",
        "review_title": "Better than 3 and 4",
        "review_detailed_main": "Everything and the kitchen sink defininitely describes this overworked franchise perfectly. As the latest installment spoofs Paranormal activity, Mama, Black Swan, inception, Evil Dead, Madea and so many other films. Like the last 3 installments most of the jokes are misses but some of them hit way better than they should. And with that being said I'll say that the latest entry is the best the franchise has been since the second film for better or worse. As the film opens Lindsay Lohan and Charlie Sheen are in a bed ready to get it on as they spoof their various life choices cleverly for the most part. But as they are murdered by a sinister force their three children go missing. Months later they are found in the woods \"Mama\" style by a couple of stoners (Snoop Dogg) and returned to their Uncle (sexy Simon Rex) and his new wife (a perfectly vacuos Ashley Tisdale). Moving things along a spirit haunts their house, they have a super religious hispanic maid, Tisdale rediscovers her love for the ballet with a jealous new lesbian understudy and they go ins earch for an evil book that they changed the ghost into what she is. It's all fairly nonsensical but some of it is actually funny not enough to merit a recommendation but if your super bored or feel you must you could do a lot worse like Scary Movie 3 or 4. **.5/5"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kols",
        "review_rating": "10",
        "review_title": "Review the movie on the screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "trashgang",
        "review_rating": "6",
        "review_title": "not good but better then a lot of spoofs made these days",
        "review_detailed_main": "Having a big laugh with the first Scary Movie (2000) the second entry was already a downfall and it got worse with every release. Enter number 5 into the franchise but this time my twelve year old daughter wanted to see it too because Ashley Tisdale (Jody) was in it who she knew from High School Musical (2006). And I must say that she did have a few scene's laughing out loud, especially with the baby but after 30 minutes she went back to her multimedia. Do I need to say more?\n\nI watched it until the end and stated as 85 minutes it stops around 72 minutes, from there on it's the end credits but they warned the viewer, bloopers on the way. So I waited, and watched the bloopers who some looked like they were set in scene. Overall, I did had a smile here and there but still it's a turkey.\n\nIt's always so weird to see big names from back in the days coming into the franchise. There only for a few minutes in it so don't pick it up for that reason. This time the story is based on the horror Mama (2013) and the Paranormal Activity franchise. It do works here and there but some parts are really childish or on the edge of slapstick. For me the best part was the spoof on Evil Dead (2013),the split tongue and the removal of the arm, it's all there, and the lesbian scene of Black Swan (2010).\n\nThe producers clearly made it for teens because there's no nudity in it. Two girls do have a shower scene but are dressed in their bikinis. It's not good at all but I have to say better then the Twilight spoofs out there or zombie spoofs.\n\nGore 0,5/5 Nudity 0/5 Effects 3/5 Story 2,5/5 Comedy 1/5"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Robert_duder",
        "review_rating": "2",
        "review_title": "Mind blowingly awful...which is exactly what I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "It's terribly bad, but we already know before watching it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "what do you expect",
        "review_detailed_main": "Punk rocker Jody (Ashley Tisdale) and her ape researcher husband Dan (Simon Rex) are a happily childless couple. Their lives are turned upside down when Dan's lost nieces and baby nephew are found. Despite her objections, he eagerly takes them into their home. The former wild kids claim that they were being looked after by an entity called Mama. Jody has to abandon punk rock and follows her mother's career into ballet.\n\nIt is exactly as one expects from the fourth sequel in the horror spoof franchise Scary Movie. It is much too scattered. It doesn't have Anna Faris. None of it rises to be funny. It would be more compelling to stay strictly with Mama even thought that movie isn't that popular or good. The Black Swan stuff is a waste. It would be well advised to fast forward sections of this movie."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "DarylJGittings",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "Scary Movie V is a disappointing entry in the popular Scary Movie franchise. Despite a strong cast that includes: Snoop Dogg, Charlie Sheen, Terry Crews, Heather Locklear and more, this film doesn't cut it.\n\nThe humor has always been juvenile in this series, but this time out most of the jokes fall flat. Writer David Zucker was part of the team that brought us many humorous parody films such as Airplane and The Naked Gun, so my expectations were higher than they should have been for this.\n\nI don't know if it's a lack of familiarity with the material that they're trying to parody or what, but I didn't find Scary Movie V to be funny or entertaining. Maybe it's the watered down PG-13 rating? I thought the series was pretty funny when the Wayans were involved.\n\nAvoid this one. Even if you liked the previous entries."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "JamesIan2021",
        "review_rating": "3",
        "review_title": "A Weak Addition",
        "review_detailed_main": "Ashley Tisdale does her absolute best but even she can't save this film from mediocrity. In this fifth instalment, slapstick runs rather dry and many, many gags outstay their welcome. Hits like Inception, Black Swan and Mama are spoofed earning some healthy laughs but many dated cultural references and pop culture gags fall flat, this isn't as bad as the first two Scary Movie films but it's certainly one of the weakest, reaching to the bottom of the barrel in desperation.\n\nScary MoVie sees young parents Dan and Jody raise their adopted nieces who have a twisted spirit overlooking them. Jody begins to experience paranormal activity in their new home, and soon realises an evil dead demon is stalking them, Jody must now venture to the cabin in the woods to find the book of the dead and stop the deadly curse, whilst Dan focuses on his job at the Ape research facility. The problem here is too many big films are being spoofed, from Inception, Black Swan, Mama, Evil Dead, Paranormal Activity, Insidious, The Cabin In The Woods, even Tyler Perry's Madea and Fifty Shades Of Grey. Writers David Zucker and Pat Proft cram it all in, the film is bursting at its seams with a lot of bad jokes and a feeling of desperation. The scenes where Simon Rex falls over whilst trying to set up the cameras drove me mental as it wasn't funny, the fight between Dan and Rosa, and the repetition of the Cabin in the woods joke fizzled out quicker than you can say boring. The dancing Mama and the Ape's talking about Matt Damon really killed hope, there's so much that falls flat, the Fifty Shades Of Grey scene was pointless and the Inception scene really felt forced.\n\nHowever, the whole Black Swan sequences work superbly, the Evil Dead book scene was hilarious and the opening with Charlie Sheen and Lindsay Lohan ripping their personal lives maybe lousy but it works. Erica Ash is superb as Kendra, J.P. Manoux is very funny as Pierre the ballet teacher, and Molly Shannon reels out some big laughs as a broken, alcoholic smoking professional dancer, there are some great jokes here, Ashley Tisdale is great at slapstick and she echoes an Anna Faris in the making, although Faris cannot be beat when it comes to these films. The found footage aspects are decent, especially when exploring their new home, seeing Jody smack the baby into the door frame, setting its head on fire then blasting fire extinguishers reign madness, it's unapologetically poor humour but I chuckled.\n\nRunning in at under feature length, Scary Movie 5 feels long and exhausting, it tries to be something big but it really is just a squashed mixed bag labelled as a movie, and Director Malcolm D. Lee does nothing to polish or let alone add craft to this tiresome spoof."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "MovieProductions",
        "review_rating": "5",
        "review_title": "I liked it better than the third and fourth?",
        "review_detailed_main": "(**) out of (****)- ROTTEN\n\n\"A Haunted House\", \"Movie 43\", and now \"Scary MoVie\" in my opinion are actually not the death of cinema and while they are all awful, they do so in a way that's pretty entertaining in a so-bad- it's-good theory but still guys, don't waste your time if you have it elsewhere to spend it on.\n\nAfter riding of our beloved Anna Faris.. and pretty much everyone, leaving us with Ashley Tisdale left me worried. But actually, I liked Ashley! She put a fresh spin on the genre and is good at playing crazy. Everyone else? direct-to-DVD level acting. The jokes? Immature, gross, mildly amusing. Actually \"Mama\" and \"Black Swan\"'s spoofs steal the show.\n\nClocking at an 80 (last time I checked) minutes, this runs pretty short and without its credits, so if you're hurling at the inaneness of it, it'll be over in no time.\n\nMaybe I'm being more lenient on films because I feel I've been too picky, or maybe I'm just having a field day, but I truly believe there are far worse films out there. That's not to say these aren't bad, but for what I was expecting, not that bad. And Lindsay Lohan pretty much MAKES the movie, even though she's in it in the blink of an eye. And for what it's worth, it's actually better than the tepid 3 and 4 of the series."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "anaconda-40658",
        "review_rating": "5",
        "review_title": "Wish It Was All Sheen and Lohan.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "alrusafi",
        "review_rating": "1",
        "review_title": "A historic failure!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "aftermathsample",
        "review_rating": "3",
        "review_title": "The worst one of the bunch",
        "review_detailed_main": "Since the very beginning this movie had such bad moments that I thought I was watching some kind of cheap parody, I wouldn't be surprised if people walked out of the theaters watching this. The acting was poor and I sincerely feel that Simon Rex should've said no to the role once he read the script, he's better than this. Most of the \"funny parts\" of the movie were just so terrible, I don't think I laughed once.\n\nPositive notes? The surprising amount of celebrities that were on the cast, quite honestly they made the movie worth watching till the end since you never knew who was showing up next.\n\nThis movie is a 1 star or 2 at best although I'm giving it 3 JUST because of the many celebrity cameos, therefore watch at your own risk.\n\nRIP Mac Miller."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "zardoz-13",
        "review_rating": "8",
        "review_title": "Not the Funniest Spoof But Pretty Fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kluseba",
        "review_rating": "7",
        "review_title": "Love or hate this nostalgic junk food cinema",
        "review_detailed_main": "In case you didn't know, Hollywood is becoming less and less original. The number of sequels or remakes even seems to be at new heights this year: \"Carrie\", \"Die Hard V\", \"Evil Dead\", \"Fast & Furious 6\", \"Iron Man 3\", \"Man Of Steel: Superman 6\", \"Star Trek 12: Into Darkness\", \"Very Bad Trip 3\" and so on. The strange thing is that people seem to want to see the lukewarm old stuff again and again and massively run into the theatres. Guess why I've switched to European and Asian cinema over the years. But from time to time, you go back to the movie theatres on a nostalgic note to watch some of those sequels. I've enjoyed the Scary Movie instalments when I was younger and when a few friends asked me to watch the new output I spontaneously joined them and gave this film a try.\n\nI must admit that this fifth part of the series had a couple of good laughs for those who know horror movies quite well. I laughed about the absurd sex scenes in the \"Paranormal Activities\" beginning, the stoned dialogues between Snoop Lion and Mac Miller on their way to \"The Cabin in The Woods\", the strange rituals executed by housemaid \"Madea\" Maria, the appearance of the intelligent ape Caesar as in \"Rise Of The Planet Of The Apes\", the \"Inception\" influenced dream sequence about \"Fifty Shades Of Grey\" or the religious teenagers in the cabin in the woods reminding of \"Evil Dead\" were quite funny. On the other side, other passages were rather dull and had their lengths as the \"Black Swan\" and \"Mama\" scenes.\n\nI must admit that I got out of the movie theatres with a big smile on my face and I had really enjoyed this entertaining and short flick while it lasted. It's not the best \"Scary Movie\" but also far from being the worst part of the series. That being said it was better than I had expected it to be.\n\nWhat really struck me though is the fact I have some problems to call back in mind all the details of this movie. This is due to three reasons. The story line of the movie is even more stupid than usual and had an almost total absence of sense. The acting is even less impressive and more stereotypical than before. I'm aware of the fact that this kind of movie won't win any Academy Awards but this time the flick was only centred around quick jokes and a few cameo appearances. This movie is another meal of Hollywood junk flick food. It's entertaining but after all quite predictable and superficial of course. It's easy to digest but it's quickly gone as well.\n\nIn the end, the film can be resumed like this: it's entertaining and quite funny when you watch it but you will soon forget it as well as there is honestly said nothing memorable or outstanding about it. Fans of the first four instalments should watch this fun ride as well. Those who didn't appreciate the first parts won't like this movie either and probably hate the fact that these instalments have been brought back to life again."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "funnycommentor",
        "review_rating": "3",
        "review_title": "Probably, one of the worst movies series I have ever seen",
        "review_detailed_main": "First of all, when I first watched the official trailer of the movie I didn't really liked it and I didn't had high expectations about it. Eventually, it was as bad as I had imagined and I didn't really enjoyed it. The plot of the movie was kinda interesting and different than the previous movies. However, the storyline wasn't well-written, because it was very silly. The characters weren't very interesting, nor well-developed and they were all so annoying. The filming location of the movie was mainly, inside a haunted house. In my opinion, that movie probably had the worst casting and their acting wasn't really good. It wasn't a scary movie and there weren't any jumpscares, even though there were some creepy scenes. Sadly, it wasn't a very funny movie and most jokes were so stupid. The ending scene was definitely predictable and it was just fine. Overall, \"Scary Movie 5\" wasn't a nice parody film, kinda boring and I wouldn't recommend it to my friends."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "nirmaata",
        "review_rating": "2",
        "review_title": "Unbelievably weak parody",
        "review_detailed_main": "Servus from Austria. Watched the movie at home. German dubbed.\n\nOverall impression: Absolutely terrible, sketches were predictable and lacked originality\n\nStory arc: 1/10 There is not much about the story to say. The plot is not coherent, which is an obvious downside of this series anyway.\n\nEntertainment: 2/10 I watched this movie to have a laugh, which I honestly did have at one or the other moment. But apart from these rare rays of hope the movie left me frustrated.\n\nCharacters: 2/10 The acting was as bad as it could get in this movie franchise. Acting comedic scenes felt forced.\n\nOriginality: 1/10 Since this is the fifth part of the scary movie series, there are not much new elements to discover.\n\nVisuals: 2/10 The visual effects appeared cheap overall.\n\nSound design: 4/10 Sound effects were alright in my opinion. They were never off."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Horrible...but probably not deserving to be in the Bottom 100.",
        "review_detailed_main": "I have not seen any of the previous \"Scary Movie\" films. The reason why I chose to watch this one, the least financially successful and apparently worst one of them is that it has made it to the infamous Bottom 100 on IMDB....the lowest ranked major movies of all time. I have a weird desire to not only see tons of foreign and art films, but occasionally I love a bad film...particularly if they are unintentionally funny. In the case of \"Scary Movie 5\", it's a case of being unintentionally NOT funny!\n\nWhen the movie begins, you know you are in for a horrid film as the opening scene stars Lindsay Lohan and Martin Sheen! What follows is a very episodic film starring many C and D-list actors that parodies (or is supposed to parody) scary teen films and a variety of non-scary movies as well. During the course of the story there are jokes about weiners, drugs, feces, demonic possessions, vomit, farting, toilets and other intellectual subjects. These jokes are presented rapid-fire. Most fall pretty flat or are disgusting...and a few actually are funny...but only a few.\n\nOverall, this is a mostly unfunny movie starring many annoying actors....but, it is NOT so horrible that it deserves to be in the Bottom 100. Bottom 250...sure...but I can probably come up with at least 200 films worse than this mess...not that this is any sort of endorsement for you to watch it. If you do...don't say I didn't warn you!!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "YungRapunxel212",
        "review_rating": "5",
        "review_title": "I miss the old ones.",
        "review_detailed_main": "This is the worst \"Scary Movie\" yet, for many reasons. Reason 1 - Brenda isn't back! Brenda was played by Regina Hall in the first four films, and she wasn't in this one! Yeah, Anna Faris isn't in it either, but Brenda was the best character! She was the funniest one! Reason 2 - Two people who died in \"Scary Movie 4\" were back. They played different people though. They were Charlie Sheen and Simon Rex.\n\nIt was funny, but it should have been rated R. There is the bottom of a butt, nonstop sexual stuff, and one clear use of the f word, and the n word, used by the physic. If you are a big fan of the franchise, you should go see it, and if you never heard of the series, you can go, because it is not a continuation.\n\nRecommended for 15+"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "GTeixeira",
        "review_rating": "1",
        "review_title": "Embarrassingly bad, from the cast to the spoofs; the franchise reaches a new low",
        "review_detailed_main": "The fifth installment of the popular horror spoof franchise, 'Scary MoVie' is shameful in its badness. With a spoof consisting of mainly 'Mama' and the 'lost footage' horrors, as well as many non-horror films (such as 'Black Swan' or 'Rise of the Planet of Apes'), it is outclassed in every way by 'A Haunted House'.\n\nThe 'Scary Movie' franchise, while very fun, tends to lose a bit of strength in each next movie. This time around it is the absence of Anna Faris and Regina Hall, the only regulars since the first one, that brings it down a lot.\n\nInstead, the new cast is atrocious. Ashley Tisdale, of the 'High School Musical' (in)fame, is completely lacking in both the funny, acting or charisma departments; Erica Ash is even more atrocious, and tries too hard to be a substitute for Regina Hall but falls flat; Simon Rex, a returner from the third and fourth films, is likable but ends up far too silly to work. Lidia Porto is another particularly full of bad moments, while the kids are surprisingly better than the adult cast.\n\nAnd what is there to say about Charlie Sheen and Lindsay Lohan? Their cartoonishly goofy scene at the beginning almost had me giving up on watching.\n\nThe jokes fall flat most of the times. Some of the ideas had potential, but were too badly handled to work. In particular, the 'Evil Dead' and 'Black Swan' spoofs and the scenes involving Snoop Dog (Lion?) could have been great; but the first two ended up too stupid to work, whereas the last one was just too dry/badly acted.\n\nThe closest to a saving grace this movie has is the 'Inception' spoof, which might be the only moment I laughed at all, and the fact this is a relatively short film at only 86 minutes long. This was just embarrassingly bad."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Laakbaar",
        "review_rating": "4",
        "review_title": "Inane slapstick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "paul_haakonsen",
        "review_rating": "5",
        "review_title": "Another spoof launched...",
        "review_detailed_main": "I found \"Scary MoVie\" to be a refreshing revisit to the series, especially after parts 3 and 4. However, if you are just the slightest familiar with the \"Scary Movie\" movies, then you know what you are in for here in this fifth installment - more goofs, spoofs and cheap laughs.\n\nThe storyline is basically the same as the previous movies, a vague red line throughout the course of the movie, on which a series of spoof elements of other movies are built up. Does it work? Sure, as there is coherency in the storyline.\n\n\"Scary MoVie\" does manage to pull off the spoofs in the great way that the the movie series is known for and doing well, compared to other spoof movies available on the market.\n\nHowever, the movie never really manages to rise itself above mediocrity, rolling on jokes and situations that you see coming a mile away. Is the movie funny? Yeah, to a certain extend. Does it entertain? Yeah, to a certain extend. Is it a movie that is a must to watch? Hardly so.\n\nThe people cast for the various roles were doing great jobs with their given silly roles, as always and as in the previous movies. So they are keeping the style going from the previous movies. Also the effects in the movie were quite good and did really work out quite well in favor of the movie. And the movies spoofed in \"Scary MoVie\" were nicely made fun in great ways and isn't a good spoof always good for a couple of laughs?"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Charlesnaulder",
        "review_rating": "1",
        "review_title": "So many big names... Still terrible",
        "review_detailed_main": "Just goes to show you how much the scary movie franchise plummeted after the Wayans stopped making them. So many good actors and celebs in it as well, it had potential to rebuild the franchise, but due to a lack of humour it failed.\n\nI preferred \"a haunted house\", wasn't the best out of all the wayans films, but in my opinion no one could ever do better than a wayans film. People can steal ideas from the wayans, but no one comes close with the delivery of satire except the greats.\n\nBut we're talking about the future of comedy here Leave the comedy to the comics the rapping to the rappers and the acting to the actors. How original was it to use charlie and joke about him dying and partying on. Its not even offensive.... Thats the problem here"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "A New Chapter in the 'Scary Movie' Franchise!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "lledain-796-978822",
        "review_rating": "7",
        "review_title": "This movie wasn't even that bad...",
        "review_detailed_main": "Personally I think this movie was actually quite funny. Yes they had a few childish jokes in there but so what?!\n\nIt's a comedy not a bloody horror!!!\n\nThis movie made me laugh a lot as a matter of fact, But don't watch it if you want an intelligent movie. Watch it with your friends at a party.\n\nHowever; On the other hand. If you have not seen the movies it is parodying then you are less likely to find it as funny or really understand the jokes to their full extent.\n\nSo if you are going to watch this be sure that you have or be sure to watch: Evil Dead Paranormal Activity 1-4 Mama and Insidious."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kelsweexo",
        "review_rating": "1",
        "review_title": "Just... wow.",
        "review_detailed_main": "I won't write any spoilers because there are no spoilers to this movie. There really isn't any point, and I know that generally all the scary movies are supposed to be stupid (and making fun of scary movies) but at least the other ones contained SOME laughs and the jokes/spoofs were funny. I read the reviews previously posted and I thought to myself \"hey, maybe people are just looking into it too much and maybe it isn't THAT bad\" but only about 5 minutes in did I already realize just how terrible it was. The acting was horrible, the script was horrible ... Ah, I just wasted an hour of my life on that. I was very disappointed and expected a lot more. I seriously don't recommend anyone watch this because you will be severely disappointed."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "pauldmccaffrey",
        "review_rating": "",
        "review_title": "Oh dear me please make it stop please. ;(",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "rogerdob",
        "review_rating": "1",
        "review_title": "100% unfunny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "oldman007",
        "review_rating": "4",
        "review_title": "You will laugh at least twice..and that's a fact.",
        "review_detailed_main": "I thought all the references all came together quite nicely. However, it is not all that funny. I don't recall even laughing at all during the Lindsey Lohan and Charlie Sheen scenes. It just had nothing to offer. And it went nowhere. There were scenes, however that were funny. i enjoyed Snoop Dogg's short performance. He was actually quite funny. I also thought the Nanny in the Paranormal Activity reference was hilarious.\n\nThere were plenty of scenes I found funny, but some of them were just so stupid and just so bland that it wasn't funny. I hated the Black Swans references. They just weren't funny at all. It had nothing intelligent to say. It's like a 5 year old just told them what to do.\n\nBut there are funny scenes in it, just needed so much more. 4/10"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "m_burr1",
        "review_rating": "1",
        "review_title": "Wasn't Expecting Much, Worse then I Expected",
        "review_detailed_main": "I've been a big scary movie fan and the last two have really let me down. I knew not to expect much based on Scary Movie 4 but was hoping with the amount of hype and good trailer I could expect more. However, this feel very far from the mark, it wasn't humorous at all, I understand they go over the top, but this just looked like they were trying way to hard to be funny, with material that has been done a thousand times. I've seen better low budget parody movies in the last 6 months, that probably had about an 8th of the budget as this. The actors used were of very low talent, and you know you've done something wrong when you cannot even get the series lead star to come back for the fifth movie. Giving this an honest 1/10 because it was really that bad, extremely poor writing, extremely bad acting and just no scene where I could laugh and I laugh at everything."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jonahs-43260",
        "review_rating": "1",
        "review_title": "Barely watchable",
        "review_detailed_main": "I didn't make it far I'd put it at 15 minutes at most but that's being generous. What I saw was one stale reference joke after another rapid fire, pacing was terrible, everything was too fast and it just made it feel like one since the jokes don't even land, it feels like these guys were a one trick pony, a reference isn't a joke. Two, it was rushed.\n\nThat's all I have to say, it was painful to watch."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Reno-Rangan",
        "review_rating": "4",
        "review_title": "Not even worth to have a fake laugh",
        "review_detailed_main": "Scary movie series were famous for spoofing other great movies. It all began with a decent first, then sequel after sequel declined its originality as well the fun parts. This fifth movie was below average, had some of the good guys in guest roles and that did not bring the movie upwards. I don't know what's with the Snoop Dogg and Mike Tyson's cameo, anyway the movie was almost crap.\n\nDuring the watch I almost sat idle throughout the movie without having a laugh. I believe that was not intended to give the viewers by this filmmaker, but that is what really happened to me. I know they won't stop here with this, so I say better luck with the next movie of this series."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bravesfanc",
        "review_rating": "2",
        "review_title": "How did this get made???",
        "review_detailed_main": "It's movies like these that make me wonder why normal people can't just put together a story and make a movie. Because honestly, this was one of the worst movies I've ever seen. The \"Scary Movie\" franchise should've stopped after the first one. I didn't mind the second or third films but this one was by far the worst.\n\nA lot of big names are in the movie, mainly Ashley Tisdale who is the main character and I can't believe she read this script and thought \"Wow, this is a great idea\" but hey, she probably made good money. This spoof mixes \"Mama\", \"Paranormal Activity\", \"Rise of the Planet of the Apes\", \"Black Swan\" and every single horror film with a cabin in the woods, which is quite a bit. And there is one scene where it makes fun of that exact thing which was probably the funniest scene in the film. And that scene was in the first 5 minute.\n\nThe jokes are horrible and way too over the top. I really don't remember much else because I was too bored to care."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "JBTV1991",
        "review_rating": "1",
        "review_title": "What A Pile Of S***",
        "review_detailed_main": "This Series Started Funny And Gradually Ending Up Stupid And Boring. The Best Film Out Of The Series Is Scary Movie 4."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "vengeance20",
        "review_rating": "8",
        "review_title": "Pretty good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kylehaines96",
        "review_rating": "6",
        "review_title": "Scary Movie 5(2013) Film Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "dar0417",
        "review_rating": "1",
        "review_title": "Bring back the Wayans brothers",
        "review_detailed_main": "This was a lot better then Haunted House. That does not say a lot."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "robin-72-718219",
        "review_rating": "2",
        "review_title": "Not even worth a rental",
        "review_detailed_main": "This is what you get when you get greedy, the original movies by the Waynan bros. SM1 & SM2 were fun, funny and original. SM3 was stolen from the bros and done poorly, here we are at SM5 and it's painfully obvious that it lacks the brilliance of the first two. Scary Movie 5 is a knock- off of a knock-off and even as a parody movie it's just awful. I love silly bad movies, but this is just bad bad, nothing to redeem it at all, for the exception of a few cameos. The laughs are few and far between. They would have done better casting unknown actors instead of filling it with D list actors like Charlie Sheen and Lindsay Lohan. Save your money and your time - check out the first two or go see A haunted house instead."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "alizekeriya",
        "review_rating": "1",
        "review_title": "Awful, just awful!",
        "review_detailed_main": "I personally think that it went down the Seltzer/Friedberg Route. Too much Cameos and random Pop culture References, not even the Actors could carry the Film. This and Movie 43 were the biggest \"Comedy\" disappointments of 2013 so far. Even the rushed Reshoots of Evil Dead and others show they went the Garbage Movie route, parodying something based on Trailers. I went in with low expectations, but with a slight hope that it would be along the lines of funny, Considering this is coming from David Zucker(of Airplane! and Top Secret! fame and of course the unforgettable ZAZ team). What disappointed me the most was that these movies show that spoof is a dying genre, back in the days we had amazing spoofs, now we have garbage. I wasted 10 Euros for this s**t (about 8 dollars) so if anyone is reading this please don't waste your hard earned money on this, go watch The World's End instead, it's not a spoof per se but it is very funny."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "RevRonster",
        "review_rating": "1",
        "review_title": "Horrible beyond words...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Poor Zucker",
        "review_detailed_main": "David Zucker was the man responsible for some of the funniest spoofs of the 1980s - I'm thinking AIRPLANE! and the NAKED GUN trilogy - so it's sad to see how far his gravitas has fallen in working on the fifth instalment of a film series that was rubbish from the outset. The only good thing about SCARY MOVIE 5 is that Anna Faris isn't in it, which has to be a positive. Other than that, it's business as usual, with no story, tons of cameo appearances, and loads of lame, gross-out jokes.\n\nThis film's opening scene, featuring Charlie Sheen and Lindsay Lohan, is actually the funniest of the entire movie. It's a short spoof of PARANORMAL ACTIVITY, and it plays out ridiculously over the top, as you'd expect, but it did make me laugh out loud. Unfortunately the film then shifts to a pair of uninteresting characters and virtually retells the plot of the horror flick MAMA while throwing in lots of other random spoofs along the way.\n\nThis series has always had a scattershot approach so we get riffs on the likes of DAWN OF THE PLANET OF THE APES, EVIL DEAD, and even BLACK SWAN for random measure. The humour is always stupid and only a small handful of the jokes actually work. I guess with Marlon Wayans being out of the franchise the film-makers had to bring in a black 'street' presence, so we get Snoop Dogg in some random, extraneous sub-plot. Terry Crews, Jerry O'Connell, Mike Tyson, and Heather Locklear have cameos. Overall, I'd recommend changing the channel."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "themissingpatient",
        "review_rating": "1",
        "review_title": "An all-new low",
        "review_detailed_main": "2013 has had a very serious lack of comedy. What we have been sold in the comedy genre has been embarrassingly bad, low-brow humor or indie dramatic comedies where the film's emotional core always over-shadows any potential laughs. They are cute but rarely deliver true laugh-out-loud moments. As we patiently wait in anticipation for the master of comedy, Adam McKay, to have his newest film, Anchorman 2, released in theaters, we find ourselves desperate for a fix of comedy. This is how we end up watching a film like Scary Movie V.\n\nThe original Scary Movie was a much needed parody of Scream and all the pathetic slasher film rip-offs that followed. While there were some scenes where the film was trying too hard to be funny, the screenplay flawlessly blended together all the slasher flicks that followed Scream and had it's own original twist ending that took bits from all the best films of the 90's. It was the first good parody film since the 80's when Jim Abrahams and Jerry and David Zucker were working together on such classics as The Naked Gun and Airplane!\n\nThe poster for Scary Movie had the tagline: No mercy. No shame. No sequel. Yet they didn't just make a shameful sequel, they made 3 of them. Even bringing in David Zucker to take over for Keenen Ivory Wayans as director for parts 3 and 4 didn't help. With every entry in the series, the films only got worse. Even as guilty pleasures to watch with friends for mindless entertainment, they stopped working as all the attempts at jokes were only pop-culture references that quickly became out-dated. We didn't think it could get worse than Scary Movie 4 but we were wrong, dead wrong.\n\nScary Movie V or Scary MoVie takes both film parodies and film itself to an unprecedented new low. While it's safe to say this will be the worse movie of 2013, it is an understatement. It is worse than that. It's one of the worse films to have ever been made and makes Grown-Ups 2 seem Oscar-worthy."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "martienpostlabour",
        "review_rating": "1",
        "review_title": "what a shitfest",
        "review_detailed_main": "What a total waste of effort time and money was this piece of crap. I stopped this so called movie after 15 minutes in. I save the stop button for the real stinkers and this one deserves an award in the shape of one. Worst movie ever even cosmopolis lingered longer than 30 minutes on my screen.\n\nNot once did we laugh at the terrible stale jokes convoluted by the most wasted talents ever.\n\nReally have i ever watched a pile of stinking poo like this.\n\nEven The naked gun is watchable compared to it. All people involved should shame their asses of.\n\nDO NOT WASTE YOUR TIME WATCH OBLIVION INSTEAD WHICH WAS FANTASTIC!!\n\nI'm gonna go wash my TV now to cleanse of the stink"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "impendingdd",
        "review_rating": "1",
        "review_title": "Bring the Wayans Brothers back",
        "review_detailed_main": "This isn't a movie. I'm not sure what it is. The writers must have smoked an entire rock of crack thinking this movie was gonna be even remotely appealing."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Leeconvery0",
        "review_rating": "10",
        "review_title": "Excellent, they just needed a few more laughs,",
        "review_detailed_main": "The whole \"Scary Movie\" franchise was in my honest opinion dead until the arrival of number 5 which turned the tables around bringing a new set of characters and one or two returning faces. I don't think people are being very enthusiastic about number 5 as it lacks our favourite characters Brenda and Cindy although they are gone we can be sure that there is still some hope that we will meet them once more in the final instalment of \"Scary Movie\"\n\nWhile on the subject of the final instalment of the franchise \"Scary Movie 6\" is rumored to be the whole revival of our classic movies bringing parodies from: The Devil Inside, Insidious, Childs Play, Dark Skies and its hard to forget The Woman In Black.\n\nWell we can only hope to see Brenda and Cindy returning to fight evil once again."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "stevendbeard",
        "review_rating": "6",
        "review_title": "70/30 Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "anthonymontanna",
        "review_rating": "1",
        "review_title": "Really terrible",
        "review_detailed_main": "I rarely come onto IMDb to rant about a bad film, i only take the time to write a review if i really enjoyed a certain movie. This however, was dreadful from start to finish. Scary movie 1 and 2 were very funny imo and 3 had a few laughs in it 4 was just about watchable, but this was bad. Its hard to believe how this film was even made and whats more shocking is that the actors actually thought it would be a good idea to be in it.\n\nI will point out that i am not a huge fan of horror films so i may not have a great knowledge on some of the movies being parodied. I shouldn't and wouldn't expect a movie like this to be 10/10 as it is just a silly parody movie and i have seen the others in the series. The writing was okay in the previous ones and there were definitely laughs throughout but this one the writing is awful and the movie relies heavily on slapstick humour. I half giggled once i think in the whole movie.\n\nI wouldn't bother wasting your time to see this, i even think 'A haunted house' is better than this and that is saying something. I can see why Anna Farris wasn't in it.\n\n1/10 I hope this is the last one."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "StevePulaski",
        "review_rating": "1",
        "review_title": "A parody film for the generation who can't sit still",
        "review_detailed_main": "If there was ever a franchise to run out of steam before it even began and was already too long and overdone simply by having one film in its series, it's a franchise belonging to the modern parody genre. I've mentioned before that this is probably the worst genre in cinematic history, and few other genres have experienced such a rapid decline in quality since their birth. The parody genre is still relatively new in terms of feature-length films, with works such as Airplane! and The Kentucky Fried Movie only dating back to the late seventies.\n\nWhy did those films work so well and why does Scary Movie V fail so miserably? Because their prime goal wasn't to parody as many films as possible, but rather try and make fun of genre-conventions and certain obligatory things audiences have become accustomed to for so long. When watching a film like Airplane!, it almost makes you a more aware moviegoer because you're seeing how often these clichés are used and how laughable they actually are when put to a sillier context.\n\nScary Movie V has nothing - simply nothing - to work with, and for sixty-eight minutes does it lumber lifelessly to the next ridiculous and boring film parody before abandoning it almost entirely. There's so much going on, while simultaneously so little, that the film gets its story lost. It keeps changing tones, parody elements, themes, characters, and events to the point that this is nothing more than an overlong collage of cheaply redone scenes from other films of recent years.\n\nThe four main films the picture is predicated off of are Mama, Paranormal Activity, Black Swan, and Rise of the Planet of the Apes. Right off the bat, boy are we a dated party-guest trying desperately to be in-the-loop. Bloody Disgusting's website tells me Scary Movie V began shooting in September 2012, but the film managed to incorporate parodies of Mama and Evil Dead, which didn't hit theaters until the first and second quarters of 2013. This is obviously a move to try and remain current by the time the film comes out. However, because these movies weren't out at the time, the material used to parody them is thin and taken from the trailers, which isn't very convincing or fun. And even so, in three years, who will laugh at these references? More films along the lines of the aforementioned horror films will inevitably be released. Films like Airplane! never get old because their genre-clichés won't allow to them.\n\nFor the first time in the franchise's history, Anna Faris and Regina Hall do not appear at all, and the dubious honor of being lead characters in a redundant parody film are handed to Ashley Tisdale and Erica Ash. Other stars such as Lindsay Lohan, Charlie Sheen, Snoop Dogg, Mike Tyson, Jerry O'Connell, and Katt Williams star as predominately cameos in a film where itself is one big cameo in the field of cinema. Nobody looks to be trying here, and frankly, they don't need to. Pat Proft and David Zucker's screenplay leaves almost no imagination and in just over an hour's worth of time manages to make every joke go on for way too long and make one of the tedious comedy ventures so far this year.\n\nWhile I haven't formally reviewed the previous films in the series, I have seen them all in either the theater or on DVD. The first was a nifty little feature, following in the footsteps of Scream to a reasonably charming effect. The second film is one of the few cases where the sequel is actually more impressive and funnier than the original film (the same thing happened with Scream 2, in my opinion). The third and forth were instantly forgettable endeavors capitalizing off of the goal to make these films more of a competition of references than actual films with plot that feature jabs at conventions and modern films. The series fell off when Shawn and Marlon Wayans were booted, resulting in David Zucker taking over from there. This is when the films became safe, woefully unremarkable, stale, and disposable.\n\nThe word for Scary Movie V is \"lifeless,\" as everything from writing, acting, and even directing by Malcolm D. Lee seems to be nothing more than a pitiful cash-in on material gone dry. When a film dedicated to lampooning other films is trying this hard to make the audiences laugh, it doesn't seem to be any better, more sophisticated, or on any other level than the films being mocked.\n\nStarring: Ashley Tisdale, Erica Ash, Simon Rex, Molly Shannon, Heather Locklear, J.P. Manoux, Jerry O'Connell, Charlie Sheen, Lindsay Lohan, Mike Tyson, Snoop Dogg, and Katt Williams. Directed by: Malcolm D. Lee."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "rigoalexander",
        "review_rating": "1",
        "review_title": "A complete deception! Please think it twice.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "generationfilm",
        "review_rating": "",
        "review_title": "A Humorless Abomination of Rushed Satire that Falls as Flat as the Poorly Delivered Verbal Jokes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "atinder",
        "review_rating": "5",
        "review_title": "Some decent spoofs here but not the best or worst spoof made !",
        "review_detailed_main": "I thought this movie would be really bad, I do like some spoof movies, I liked all the other scary movies and I even liked some bad one such as Shirke you know what you did last summer,\n\nI didn't Not mind Not Another Teen movie , I thought those were decent movies, also really liked Superhero movie but\n\nThis scary movie 5 is no were near as bad Disaster Movie (2008), Date Movie or Stan Helsing (2009) or Vampires Suck (2010)\n\nYes is it the weakest of the series not as those bad spoof listed above\n\nAt the start of the movie, they tried way to hard to be funny, yet could have been funny, I don't think Benny hill music really worked with that scenes.\n\nThe main spoof this movie focus on is Mama and Black swan and paranormal activity, planet of the apes and there are other spoof as inception and Evil Dead spoof.\n\ni Thought Evil Dead spoof was really funny, I laughed Few times in those scenes as for rest of the movie, I did found some scenes funny and other were Jokes goes a little to long and fall flat a number of times.\n\nI didn't really like how the movie ended, I didn't find ending that funny at all,\n\nAlso those fast forward can bit really annoying at time, I there were not that funny at all.\n\nI enjoyed it and I laugh a number of times but I did miss Anna, it dose feel a little strange her not being the movie, They were trying to go for a re-boot of series but kinda shot them self in foot with that.\n\nAshley Tisdale was decent but i didn't find her too funny as did the Cindy scenes in all scary movie.\n\nThey must of cut some scenes out trailer, Some scenes trailer were not in the movie.\n\nI really enjoyed 5 out of 10"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "frosty-44431",
        "review_rating": "2",
        "review_title": "I like to pretend this one didn't exist",
        "review_detailed_main": "All I'm going to say is.... don't waste your time watching this."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Bored_Dragon",
        "review_rating": "5",
        "review_title": "Why are you so hateful ?!",
        "review_detailed_main": "I'm reading other people's reviews and I cannot believe how many of you hate this movie. I think 9 out of 10 people gave 1/10 only because 0/10 does not exist. OK, the movie is unbelievable retarded, but what else did you expect?! Darn, this is \"Scary Movie\" franchise = bunch of retarded parodies of blockbusters that were kicking through the roof since last \"Scary Movie\". Like all of its prequels, this one has a shallow and vulgar sense of humor that will sometimes cause you to cry from laughter and sometimes it will kick you in the face with the cruel transfer of embarrassment. It cannot compare to Wayans movies, but it is definitely better than the previous one, \"Scary Movie 4\". So if you want quality subtle humor, based on deep thoughts and philosophy, then skip it, but if you want to give your head a break and just relax and have some retards make you laugh to their stupidity, you are on the right place.\n\n5,5/10\n\nMovies parodied in SM5, at least those I recognized:\n\nTitanic previous Scary Movies The Ring The Cabin in the Woods The Passion of the Christ Paranormal Activity Inception Black Swan Mob Wives Planet of the Apes Ted"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "aaronoshea58-403-119530",
        "review_rating": "3",
        "review_title": "Could have been good???",
        "review_detailed_main": "I honestly thought that scary movie 5 could have been somewhat OK, but i was ruined be crappy editing and god awful acting on Simon Rexs' part. One of the things that really annoyed me was the voice editing as it was easy to see where they changed it. The film had some good ideas, like the \"Black Swan\" and \"Evil Dead\" but were poorly excited. The only character in the film I actually enjoyed seeing was the Spanish Maid. The rest were unmemorable and a poor choice. Simon Rex ruined this movie. I also loved how at the bottom of the screen (only when it is meant to be shot by video camera), they is the REC or the time, even when they are looking at different angles when there should be no camera there. Main example being when Rex is putting up cameras and he keeps harming himself and we see everything from direction but there are no cameras to be seen. Even when he is supposed to be screwing in a camera in his hand to the wall, we see everything for a cameras point of view from where he is going to put it. Overall, this new addition to the Scary Movie franchise was a letdown due to bad editing, bad writing, bad casting and the evident absence of Anna Faris."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "fernandoschiavi",
        "review_rating": "3",
        "review_title": "\"Scary Movie 5\" is certainly the worst of the series so far and t's time for the franchise to rest, being buried six feet under the ground",
        "review_detailed_main": "This is the bitter end to a series that brought the parody genre to the fore again in the early 2000s and, unfortunately, what we see is a depressing ending, and that is not a word that should be used to define a proposed film. Making you laugh. Gathering a handful of actors without criteria was definitely a bad idea and a lack of commitment to the loyal audience of the series, who valued the old cast. The embarrassment of seeing jokes being made without any effect, or the rescue of commonplaces already overused in the previous four features, is to discourage anyone who has followed the development of the first films. The frustration, among other reasons, is to see a comedy that once was so authorial become silly, with bad seats, jokes out of timing and an excess of nonsense that often does not fit the scene.\n\nAfter David Zucker passed the baton of direction to Malcolm D. Lee, the Scary Movie franchise reached its fifth volume, rivaling in formula and content with the production of Marlon Wayans, Paranormal Inactivity, even coinciding with the parody objects, using the typical first person footage of Paranormal Activity to start your tape. The first news that shocked fans and made us wrinkle our noses was the news that Cindy (Anna Faris) and Brenda (Regina Hall) would not return. How would they manage to make a film in the series without the two main stars? Perhaps the new part of the franchise could be saved by other characters, such as Mahalik (Anthony Anderson), CJ (Kevin Hart) or the president (Leslie Nielsen), but they also don't appear. In fact, \"Scary Movie5\" does not bring back any character in the franchise, absolutely none. Charlie Sheen and Simon Rex even return, but playing different characters, the first participates in the bad opening scene and the second is one of the protagonists.\n\nAfter a mysterious incident involving a couple, played by Charlie Sheen and Lindsay Lohan, their daughters Kathy (Gracie Whitton) and Lily (Alva Kolker) somehow - equally mysterious, but this time, because of the script - they end up in a cabin in the forest, where they are found by a pair of stereotyped drug addicts experienced by Snoop Dog and Mac Miller. After being rescued, the children are adopted by their father's brother, Dan (Simon Rex), and his wife Jody (Ashley Tisdale). After that, strange things start to happen at the family home.\n\nLet's talk more about opening this part. The scene begins with Charlie Sheen and Lindsay Lohan as a couple about to have sex and who are haunted by a ghost. The scene is ridiculous and sloppy from start to finish, with poor performances and an even worse script, full of exaggerations and appeals to make the viewer laugh forcibly, which does not work. Soon after, we have another \"opening scene\", in which two friends, played by rappers Snoop Dogg and Mac Miller, come across a hut in the middle of the forest and there are two children. The scene is as ridiculous as the first, with stupid dialogues and even worse performances.\n\nThis fifth part of the series focuses on the story of \"Mama\", but obviously makes reference to several other films - regardless of the genre - during the narrative, such as \"Paranormal Activity\", \"Evil Dead\", \"The Conjuring\", \"The Last Exorcism\", \"Black Swan\", \"Inception\" and the prelude to \"Planet of the Apes\". Originally, the feature would be a parody of \"Panic 4\", just as Inceptional was a parody of the first feature in the horror franchise. However, Wes Craven's film did not achieve the expected commercial success, forcing the parody producers to change their minds. This highlights the fragility of the proposal, which depends directly on the public's prior knowledge of other works to be minimally understood.\n\nReferences to horror films continue, showing Jody's dramas, with repetitive jokes that compare ballet to pole dance. The freak show involving ghosts and demons continues to haunt the existence of the couple, without any condition to make their viewer laugh, making the level of the first four films worse. The tape tries to mix all the aforementioned films looking for an identity, failing to find a minimally acceptable narrative line, since all the elements that add to Jody's drama are completely dispersed from any cohesion or dramaturgical structure. Few of the moments of humor manage to overcome the simple barrier of comedy, not even amusing the public accustomed to torn humorous.\n\nZucker's departure from directing, for him to only write and produce the film, exhibited a considerable decrease in quality, not even having what worked in the rest of Everyone in Panic. The complete absence of positive predicates makes fans more eager for this cinematographic subgenre to ask themselves if the format has any chance of returning to function as entertainment, because even the undemanding viewer this Scary Movie5 is unable to please.\n\nIncidentally, the main gags of the film are totally unnecessary for the story's progress, demonstrating the lack of creativity and resourcefulness of the writers. This incompetence can also be seen in the appealing content of some scenes, where the extreme bad taste gets to be offensive, especially in the scene involving Lily and an ice lollipop. Some moments try to emulate the silly humor style of silent films, even using stop-motion in a desperate attempt to offer something that the public has not yet seen in previous films. This is so out of context that they look like bonus scenes during the film itself. When a parody reaches the point of parodying itself - as in certain scenes that refer to the first feature of the franchise -, it is a sign that it has reached rock bottom.\n\nThe seven intervening years, which took place between the launch of Scary Movie 4 and the production of Scary Movie 5, served to age the type of humor that had been done so far very badly. The audience is different and has aged together. The poorly thought-out sexual scenes are not so pleasing to an audience that in the early 2000s was excited about the bizarre American Pie, and that Scary Movie explored so well. The jokes with the monkeys, the horrible prologue that makes the parody of Paranormal Activity, the first entire act contained of absurdity etc. Takes this film to the bottom of the well. Places that could be used so well here are thrown in the trash.\n\nThe prologue's metalanguage, of playing with the figures of Lindsay Lohan and Charlie Sheen, does not bring anything new, in fact, it embarrasses the lack of humor in the initial scene, which does not even try to overcome what had already been done. A big problem in this film is the fact that many jokes need to be explained, reaffirmed, many times, by the character who does it. By the way, if humor needs to be explained it is a sign that there is no genuine connection between what is said and the recipient. Already aware of the lack of creativity in the script, many insights are explained within the narrative itself, as in the scene of the newspaper anchor's wife, who needs to reaffirm that she is betraying him - this after the joke has already been made - so that we realize that the scene has a touch of humor. Kind of like making a joke and explaining right away: \"Hi, I made a joke, you know?\". In fact, narration is used within the film, a resource not previously used, which only highlights the need for this film to seek grace at all costs, even if it explains its own jocularities.\n\nWith the departure of Anna Faris and Regina Hall, the cast became very weak. Simon Rex has never been one of the strengths of the franchise, but here it is ridiculously bad. The famous non-actors invited to participate, such as Mac Miller, Snoop Dogg and Usher only make things worse and there is more for Ashley Tisdale, the only one with a really good performance in the film. The actress is no Anna Faris, but she manages to perform quite well in the midst of so much mediocrity. Probably \"Scary Movie5\" will not have a continuation, not only because of the bad reception by the public, but also because it got the worst box office. If that happens, we will miss Cindy, Brenda, Mahalik, CJ and the others.\n\nAs if that were not enough, added to all of this we have a montage out of rhythm and continuity that further impairs the effectiveness of humor, which no longer works by itself. \"Scary Movie5\" is certainly the worst of the series so far and one of the worst films ever made in recent years. The sensation of total loss of time invades the thought of those who watch the tape until the end, making the prospect worse by imagining that there may be other numbers like this. The relief almost comes after 74 minutes when the final credits go up after it wasn't possible to have a laugh. Malcolm D. Lee's film suffers from the worst thing that can happen to a comedy film: lack of comic timing. It's time for the franchise to rest, being buried six feet under the ground."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "851222",
        "review_rating": "9",
        "review_title": "The best \"Scary Movie\" since the original",
        "review_detailed_main": "Greetings from Lithuania.\n\n3,5 is the rating this film has at this moment at IMDb, so here is the question - what did you expect? It's a parody for god sake. Silly as hell, and funny as well. \"Scary MoVie\" delivers! Seeing the rating i thought this is going to be terrible, but what a surprise - i laughed very hard, it was very funny movie. If you don't like parodies, you will hate it. But if you love them - this film is a real fun. And as i said - it's the best part since the original. Seriuosly. Sure, when you watch this kind of film, don't expect brilliance, just open you mind and close your brain - this parody really works. Now i know for sure, when in the titles you see names Bob Weinstein and Harvey Weinstein - this film is going to be good, they definitely know how to make movies work."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "dogma-53668",
        "review_rating": "7",
        "review_title": "Not on par with the others but still funny",
        "review_detailed_main": "Weaker entry to the franchise but still quite funny in some parts. Got some interesting cameos. Fine to pass the time during the pandemic. Don't forget the popcorn."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "SBreezy29",
        "review_rating": "2",
        "review_title": "Worst of the Scary Movies",
        "review_detailed_main": "Watched this past weekend, and fell asleep not even half way through! Ashley Tisdale really isn't a very good actress at all, and should stick to just TV from now on. The beginning with Charlie Sheen and Lindsey Lohan playing themselves was actually funny. They poked fun at themselves in a good way, but other supporting cast wasn't that good at all.I think after the first 2 they kind of lost their luster. Just kept getting more ridiculous. I get the point,but it relied way to much on physical humor. Simon Rex isn't that horrible of an actor, he just needs some better material. Bottom line is don't waste your time on this crap! I liked the Date Movie parody better."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jsucie",
        "review_rating": "4",
        "review_title": "Hollywood cash grab",
        "review_detailed_main": "This movie is the culmination of comedic era headed straight into the dumpster brought on by the Hollywood Cash Grab Machine. This franchise and its subsequent spin offs started strong with the first 2 Scary Movie films, Date Movie, & at the bottom Epic Movie; then everything really went down hill as more and more got pumped out like Meet the Spartans, Vampires Suck, Disaster Movie, Superhero Movie, & the rest to follow in the spoof category. It's a shame really because with proper innovative writing there should have been many better spoof movies to be made with so much content to pull from and make fun of.\n\nNow for this movie, it is simply meh. There's a couple of chuckles here and there but mostly you'd have to be 13 and this is the first comedy you've ever seen to enjoy this really. A shame really because it does have quite a few talented comedic actors in it but I think they went to a junior high and asked them to pen the script or the \"adult\" writers were far too baked at work."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "maralex-68464",
        "review_rating": "2",
        "review_title": "Disastruous and loathsome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "vincentlagana",
        "review_rating": "2",
        "review_title": "TRASH",
        "review_detailed_main": "Bad, Just awful, it never should have been made.. it's the worst out of the whole \"Scary Movie\" franchise."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "nametagone",
        "review_rating": "3",
        "review_title": "What happened?",
        "review_detailed_main": "I loved the previous scary movies, especially 1 and 3. This one however, not only did it not take all the elements of the humor from the previous ones- the clever spoofs, the witty jokes, the plot twists- but it ruined them.\n\nThey did not put any thought at all at how they will direct the story, they just threw together movies like the paranormal activity, black swan, the evil dead, but they did not make any parody of them in any clever way, they just made references to them.\n\nThe movie is plot-less in a bad way, boring and practically no moments of laugh. Not recommended."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "JackEyres",
        "review_rating": "2",
        "review_title": "Absolutely Awful",
        "review_detailed_main": "I loved Scary Movie 3, 4 wasn't too bad but this film is terrible. Its just Paranormal Activity 2 with gags and jokes about poo that are not even funny. The only funny part involved a bottle of coke and some mentos but i only giggled at that. The acting is awful the jokes sound like they were made on the spot. The plot is that a couple and their child move into a new house which is haunted. And that's it nothing else happens. This film is probably one of the worse films i have ever seen. Its not funny and... well its just overall a terrible movie. Please don't pay for this movie, it will just encourage the director to make another one."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "FlashCallahan",
        "review_rating": "2",
        "review_title": "An unfunny ordeal.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "G_ses",
        "review_rating": "2",
        "review_title": "Nothing to laugh",
        "review_detailed_main": "Look here's the thing: Like all the jokes are bad. I wouldn't even describe them as jokes, they're just...words... The only thing which is kind of humoristic to me are some references. Like Charlie got called by a dealers. It's like: \" *breathing out loudly like \"ha\"* got it ? Cause the actor is a drug addict hehe\". Or when there's a \"Cabin in the woods\" reference I feel like \"ha. I saw the movie. I got this reference hehe\" (Cabin in the woods didn't got really popular in Germany) So when people get hurt it's kind of funny too...I guess... But you got the point right ? Every \"joke\" is MAXIMALLY a \"breathing-out-loudly-like-\"ha\" \" There's literally nothing you could really laugh about. But hey what did you expected right ? So ok whatever... The female characters are pretty attractive... Some kind of a positive thing\n\n...I guess..."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ataelosher",
        "review_rating": "8",
        "review_title": "Extremely overhated.",
        "review_detailed_main": "This movie is no way near as bad as people make it out to be. What do you expect from this? Good character development? A plot? The other films don't have any of these either yet people love to give crap to this one. Maybe because it has a different cast? I grew up with the original actors but I don't mind the new casting. Big deal. Boo hoo. Maybe people don't like this one because of the humor? I guess that depends on your preferred type of humor and mood. Don't expect these movies to be spectacular, just see them for what they are, parodies. And for what they are, I think that they're great."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "selectamd",
        "review_rating": "7",
        "review_title": "Disappointed but still LIKE it",
        "review_detailed_main": "Plot 9/10 Acting 9/10 Cast 9/10 Direct 7/10 Edit 3/10 Funny 9/10\n\ni feel like this plot is for Anna and Regina but replace by Ashley and (black girl). Ashley is lovely, funny. i give 9/10 for Ashley, Simon, Charlie, Lindsay, and for every actors in this movie.\n\nMain plot is OK, i expect more laugh on cabin in the wood, inception but i disappointed. Opening scene i like in trailer more than in theatrical.\n\nif there will be scary movie 5.5 which re-cut and add more scenes that will be another great scary movie in franchise\n\ni don't like to see anybody hit kids. i hope studio will cut it out in DVD release."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "JayPatton88",
        "review_rating": "2",
        "review_title": "Death to the Franchise",
        "review_detailed_main": "Laughs well some, was this The Disaster movie? Different title? After this I wouldn't expect the \"Scary Movie\" franchise to return from the coffin this film placed the franchise in."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "illusion_at_rest",
        "review_rating": "1",
        "review_title": "Tradegy",
        "review_detailed_main": "It's so bad I just couldn't finish it. it is supposed to be a comedy but during the first 30 minutes of the movie, I didn't laugh even once. People might say that it is because I had no idea what movies it is making fun of, but the fact is that I have to watched all those movies but this movie is just not funny. The story, the lines, the actors, everything. Sigh."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "electricchurch",
        "review_rating": "5",
        "review_title": "Incoherently related skits bemuse and amuse to extremes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "pazhilo7p0n4uk",
        "review_rating": "1",
        "review_title": "Worth it?",
        "review_detailed_main": "Why does this movie exist? It was this question that was spinning in my head throughout the entire viewing of the film-I apologize for calling IT a movie, nevertheless. To begin with, I like the \"Scary Movie\" franchise. I really think that the first four parts are a very inventive banter on the American cinema of its time. But, I got the impression that this time the screenwriters decided to make banter on the \"Scary Movie\" by removing humor and meaning from there. What's worth watching this movie for (not worth it)"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "AntonioAntonio91",
        "review_rating": "1",
        "review_title": "No.... just no....",
        "review_detailed_main": "Scary Movie was a franchise about mocking A list movies, making fun of them and still have some class about that. Scary Movie 5 fails so hard in this attempt, it's not funny, it's stupid, it fails as a comedy. I am not even gonna waste my time writing how wrong everithing is in this movie, DO NOT WATCH!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "rileyjustin306",
        "review_rating": "2",
        "review_title": "It's exactly what you'd expect",
        "review_detailed_main": "You know, the Scary Movie franchise might have been stopped being funny after 2, but at the very least 3 & 4 weren't offensively unfunny and had a decent cast (I'm looking at you Seltzerberg.), sadly the same cannot be said for Scary Movie 5. If you've seen any of the trailers, you've pretty much seen the entire movie.\n\nThe \"plot\" follows Ashley Tisdale and Simon Rex mimicking scenes from the latest horror flicks the likes of Paranormal Activity, Sinister, Mama, & Evil Dead, & inserting fart jokes. The movie also features a plethora of celebrity cameos from Jerry O'Connell, Terry Crews, Katt Williams, Snoop Dogg, etc. In a painful attempt to squeeze out a laugh from the audience.\n\nThis probably won't surprise any of you but.....All of Scary Movie 5' s attempts at humor are Needlessly Vulgar, And painfully unfunny and actually mean-spirited. The only time I remember laughing was Molly Shannon' s cameo. The biggest problem with this movie (Aside from the fact that it exists.) Is a problem that Selter/Friedberg movies have...they're out of date by the time they hit the theater.\n\nFinal Verdict: Skip it!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "maciejwaszkiewicz",
        "review_rating": "4",
        "review_title": "You know what i mean",
        "review_detailed_main": "Some funny Gags if you know what i mean. Nit enough snoop dog as character."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "GiraffeDoor",
        "review_rating": "8",
        "review_title": "Possibly the most under-rated movie ever. Certainly the best of the gross-out parodies.",
        "review_detailed_main": "I thought this was just excellent.\n\nI will be the first to say that these parody movies are on the whole pretty terrible. It's not that they're dumb and gross that makes them bad; it's just the laziness in a lot of them.\n\nBut here we get another winner. If you enjoyed part 3 and part 4 you're in for another treat. We get a more or less completely new cast of characters but I think it's about time to let Cindy and the gang just chill.\n\nIt's so cool to see adult Ashley Tisdale as the woman-child suddenly under parental responsibilities. It's actually more engaging that her counterpart in \"Mama\".\n\nThey pack in a lot of contemporary movie references, fascinatingly woven together, fun gags, some naughty stuff, cute little girls and a few pretty pertinent comments on the aesthetic choices of movies.\n\nWhy are people tearing into it? It's basically got all the things that made part 3 and 4 brilliant. How is this one different except in the ways it needs to be to be a different good movie? I'm baffled. Beats part 2 at the very least.\n\nJust put on your sweat pants, put some extra butter on your popcorn and pig out on this low-brow delight."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "hotcars1784",
        "review_rating": "7",
        "review_title": "Expected SO much more...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jeremycrimsonfox",
        "review_rating": "1",
        "review_title": "Saving The Worst For Last",
        "review_detailed_main": "Scary Movie V (Sometimes called Scary Movie, with the V stylized as the roman numeral for five) is the final installment of the Scary Movie series of horror movie parodies, and was released a good seven years after the fourth film. You'd think with that long a wait, the creators would at least try to improve on the humor so it wouldn't rely too much on gross out toilet and sex humor, but sadly, we are mistaken.\n\nStarting with Charlie Sheen and Lindsay Lohan trying to do a video (can't say which kind in case IMDb guidelines are against it) in a messed up parody of Paranormal Activity, the story begins with Sheen's children being found by two guys who were fleeing from cannibis growers (played by Snoop Dogg and Mac Miller), they are taken under the care of his brother, Dan Sanders, and his wife, Dina. However, by bringing them to a new home, they also bring home a terrible evil.\n\nBasically, the gross humor is back, and it's joined by another kind of humor: child abuse, as some scenes have the children being harmed in what looks like comedic situations (one scene has Aiden, the baby, get his head set on fire, with Dan using a fire extinguisher to put it out, which also launches Kathy, another of the three kids, into something that bumps her head). Also, this film has a lot of disturbing stuff for a film carrying the PG-13 rating, making me wonder how they got away with it. Stay away from this film at all costs."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "squeakydrummer",
        "review_rating": "3",
        "review_title": "Strike 3 And you're out.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Coventry",
        "review_rating": "4",
        "review_title": "Stupidity and redundancy, part V",
        "review_detailed_main": "Either I was still high on the antibiotics I was taking for that viral infection I suffered from or either I've grown entirely numb for awful horror spoofs over the years, but fact remains that I was a lot less irritated by this fifth installment in the \"Scary Movie\" franchise than by any of the previous ones. Could it be that this latest and still equally redundant sequel is slightly better than the previous ones? Don't get me wrong, it's still a very lackluster effort – hence my four out of ten rating – and it's maximally on par with the mediocre original of the series, but at least I chuckled a couple of times and I even caught myself thinking that a handful of the gags and situations were moderately ingenious! Maybe it's because the annoying lead actress Ana Faris got replaced by the less annoying Brittany Murphy lookalike Ashley Tisdale or perhaps the parody veterans David Zucker and Pat Proft (\"Airplane\", \"Hot Shots!\") found their occasional old shape back? Who knows, maybe it's even linked to the fact there was a decent period gap of seven years since the last film this time, whereas the previous films followed each other with an interval of one or two years. Part five primarily focuses itself on spoofing the okay but vastly overrated \"Mama\". Next to that, it also makes fun of a series of other recent attempts at horror/thriller, including \"The Evil Dead\" (remake), \"Black Swan\", \"Paranormal Activity\" and the latest sequels to \"Planet of the Apes\". For me personally, it probably helped that I disliked every single one of these flicks. Simon Rex' stupid facial expressions are sometimes fun and particularly the parody of \"The Cabin in the Woods\" and \"The Evil Dead\" made me smile. Still 90% of the script is downright embarrassing and even too retarded for words, most notably all sequences with the Latina housemaid and the intelligent monkey. My advice would be not to spend any money on this, but watch it when it comes on television and don't be afraid to fall asleep, since you won't miss out on anything."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "sonofmarvin",
        "review_rating": "2",
        "review_title": "Sucked",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "rumbustiousben",
        "review_rating": "2",
        "review_title": "An absolute waste of money, time and popcorn.",
        "review_detailed_main": "Against my own will, I was brought to watch Scary Movie by my friends, expecting to watch a movie that was so awful, I would find good jest amongst it. However, this was not entirely the case. Scary Movie 5 showed a lack of intelligence, that was seen in the first two, and meant for a great lack of enjoyment for the whole film with unfunny and unoriginal jokes that have been poorly used many times before. At times the movie is actually quite repulsing and disturbing with a humor that only the hardest of snuff fans would understand.\n\nThe humor in other parts of the film were at times worthy of a chuckle or a smile, but not the whole hearted roaring laughter that the first scary movie scavenged from me. I would not recommend this title to anyone who likes to spend their money on enjoyable movies and popcorn that isn't tossed towards the screen in a violent flurry.\n\nHowever, one aspect worth merit from me was the portrayal of Lindsay Lohan and Charlie Sheen in the opening scenes as they were captured perfectly and did very well playing *themselves.*"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Kartmanka",
        "review_rating": "4",
        "review_title": "Kinda disappointed",
        "review_detailed_main": "I like the scary movie franchise.Especially 3rd and 4th part. This was the worse part to me.Its just not it,not my imagination of scary movie..Like it's some other franchise There are some funny jokes but that's it. The storyline is clear and easy watch but I don't know, I just didn't liked it. Its usual for franchise to be weird, but I watched it with my friends and most of the time we were like \"what the hell\". Actors were OK,although I don't know if Ashley Tisdale was the best choice. Loved to see Snoop Dogg and Mac Miller.. I saw from other review \"The only intelligent actor/actress from the entire Scary Movie series is Anna Ferris. You know why I say that, is because she wasn't in Scary Movie 5. She was smart. \" I can't agree more.. And there are lot mainstream celebrities in the movie,too many I'm glad I didn't waste money.Mind blowing-ly bad.I know you should expect stuff like this from a scary movie,but this is kinda bad"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "careybrandon-41144",
        "review_rating": "1",
        "review_title": "The worst of the 5",
        "review_detailed_main": "This is the worst movie of the 5 Scary movies. It has a horrible plot."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "migz0621",
        "review_rating": "4",
        "review_title": "WAS OK, but c'mon, SHARK ATTACK?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "simonkelesidis5",
        "review_rating": "10",
        "review_title": "This is actually well done",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "feeferscat",
        "review_rating": "6",
        "review_title": "Not a masterpiece but...",
        "review_detailed_main": "The Scary Movie franchise has been around a bit and slowly slipped down hill in quality.\n\nBut that doesn't mean this isn't one of most fun movies currently out, it has some genuine laugh out loud moments that aren't sexual or crude; sure not many but a few at least.\n\nTaking parts from Inception, The Cabin in the woods, The Curse, The Evil Dead and blending them together is pretty hard but Scary MoVie does pull it off and whilst it's probably not going to win many awards it does exactly what it promises, a silly rather fun parody movie that continues some gross out humour."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "mr_cumshot",
        "review_rating": "1",
        "review_title": "horriawful (worse than horrible and worse than awful)",
        "review_detailed_main": "First of all I just want to warn everybody that hasn't watched this abomination yet, just stay away from it (as far as possible). It's the one of the worst things I have ever seen in my life (so far).\n\nI had to try it out, although my friends told me not to, because I'm a fan of the scary movie saga. The first one was great, the second was kind of good, the third was hilarious and the fourth was good.\n\nThere are so many things that don't make sense in this movie. I didn't crack a smile the WHOLE 86 minutes. I'm being dead serious. It's not even funny because I wasted precious time of my life, but that's what happens when they make very bad movie attempts.\n\nI still have a few questions on my thoughts though... What happened to the movie parodies they used to do? Did they run out of ideas? Why is it so unoriginal, boring and stupid? What's with all the celebrities that don't fit in? Is this a celebrity hangout or something? Who would want to watch that? Is it time to end the scary movie saga here?\n\nIf anybody is kind enough to answer my questions I would really appreciate it..\n\nI'm telling you right now I would have more fun watching a rhino taking a dump. I didn't think it was this bad but I was wrong. If you are curious to see how bad it sucks just do yourself a favor and buy some candy or do something else with your money and time.\n\nBefore I end this I just want to say it is not worth the time nor the money so don't even try! You have been warned!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "newmoon96",
        "review_rating": "",
        "review_title": "My faith in spoofs is now gone.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "satanclaw",
        "review_rating": "1",
        "review_title": "Scary MoVie? Boring, Unfunny Crappy MoVie is more like it....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "diegorkz92",
        "review_rating": "2",
        "review_title": "Worst parody ever.",
        "review_detailed_main": "Only few of the scenes caused me some grace, I think if it had receded somewhat in quality, with some of the previous films, I think this is pretty poor. Many scenes to me were poorly developed, in my opinion not good, but if you like the series of films Scary Movie, well, watch it and then tell me that you think, because as far as I'm concerned, I did not like.\n\nThey mixed some scenes from last Horror movies that are in theaters, such as Evil Dead, Mama, and one that has not been lacking in recent parodies films, Paranormal Activity, plus add scenes related to Black Swan.\n\nIt seems that in many of the scenes, not know what to do, and would do anything, trying this would laugh, and for me it was the opposite, seemed rather silly scenes. The worst movie of Scary Movie. What's more, the worst movie I have seen on parodies.\n\nIf you ask me, I do not recommend."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "gruffmn",
        "review_rating": "1",
        "review_title": "By far the worst comedy I've ever seen...EVER",
        "review_detailed_main": "Going to see this \"film\" (Would prefer to use the term garbage) I had semi-high expectations, Yes we all know that the scary-movie brand is all about going over the top and constantly forcing jokes down your throat, but in the previous movies it was rather enjoyable and something you could consider watching on a rainy day.\n\nThis movie however was all about forcing, it was like listening to a comedian constantly hurling out punchlines with nothing to back it up.\n\nIt saddens me to say that with this crappy wannabe-movie the entire brand of scary movies has come to an end and I advice everyone who has ever seen a scary movie and thought it was OK to never see this one.\n\nIt felt like torture in the theater and more than half of the crowd left 30 minutes into the movie because of its incredibly bad humor and timing.\n\nThis is about as bad of a movie that you can make, really...\n\nPS: made this account only to warn others not to go and waste their money to see this garbage, it will make you angry and most likely give you the urge to continuously punch someone in the face in order to get rid of your frustration from all of the bad attempts of making you laugh.\n\nbye..."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "raulfaust",
        "review_rating": "3",
        "review_title": "Pretty bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "starfishr-751-546917",
        "review_rating": "3",
        "review_title": "A disappointment.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "i-am-a-psycho-freak-mons",
        "review_rating": "2",
        "review_title": "I seriously expected it to be better and less infantile",
        "review_detailed_main": "I used to love the Scary Movie films, but this one really made me regret that. The whole changes in the cast and the really low budget shots made the film really bad. The jokes are infantile and seem to have been written by a 13 year old. I give it a 2 because that's how many times I almost laughed at their jokes. This is supposed to be a funny film, but I found the jokes really dirty and immature. Scary Movie's jokes used to be mature and funny. Maybe that's just me, maybe I grew up for those jokes, but I bet if I watch the first one I'll laugh my pants off. I really wonder what came through the producer's minds when they made it. The plot is terrible, everything seems to be sped up, everything happens really fast and unprofessionally. I would not recommend anyone watching it. It was the biggest waste of time of my life. I don't remember watching such a terrible movie in a really long time. But oh well, what could we expect from a series of movies that has been inactive for 7 years. I only expected better quality and good jokes. I didn't get any of those, instead we see plastic babies and 12 year old jokes. I feel sorry for everyone who lost one and a half hour of their lives watching this crap. Cheers."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "djay782",
        "review_rating": "2",
        "review_title": "Worst \"Scary Movie\" Movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "JonJo979",
        "review_rating": "10",
        "review_title": "Brilliant and so funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bowmanblue",
        "review_rating": "6",
        "review_title": "Ask yourself a question...",
        "review_detailed_main": "...if you saw someone fall over in the street, not really hurting themselves, would you laugh? Probably. However, if you saw someone fall over in the street twenty to thirty times, would you still find it that amusing? Unfortunately, the latest in the Scary Movie franchise does to rely on people simply falling over again and again (and again) to get the majority of its laughs. And this is a shame, because - believe it or not - there are actually some quite amusing moments in the film.\n\nThe first Scary Movie (if you can remember that far back!) parodied Scream and, as a result, followed the story pretty closely. Therefore, Scary Movie (1) actually HAD a story. By the time we arrive at number five, it's a mish-mash of a dozen different horror films, therefore there's hardly a story to speak of. Yes, most of it tries to copy 'Mama' (and if you haven't seen Mama then most of the remaining gags will probably be lost on you), but expect moments from Evil Dead, Paranormal Activity, Inception, Black Swan and Rise of Planet of the Apes.\n\nHowever, it's not all bad. Ashley Tisdale is surprisingly enjoyable and dippy to watch (a reasonable substitute for the missing Anna Farris) and the opening with Charlie Sheen and Lindsey Lohan mercilessly lampooning themselves is sheer comedy gold (just a pity they're only in the first ten minutes).\n\nIf you're a fan of the series, you may get some enjoyment out of it. I think it's certainly better than parts 2 and 4 (which I hated). However, you really have to know ALL the horror movies lampooned to get maximum enjoyment out of it (plus be able to overlook the numerous pratfalls which make up too much of the film)."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ben-seal-609-589948",
        "review_rating": "1",
        "review_title": "If you are looking for the smutty crude humour you loved from SM1 & 2 avoid this mess.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "stivo_paokever",
        "review_rating": "",
        "review_title": "worst movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "dfc-london10",
        "review_rating": "2",
        "review_title": "Worst Scary movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "nairtejas",
        "review_rating": "2",
        "review_title": "The Death Of Spoof Comedies. ♦ 20%",
        "review_detailed_main": "Previously this year, Movie 43 tried and failed abruptly to charm the audience. The fifth installment of the beloved/famous series marks the death of spoof comedies. I don;t have the courage to watch other spoof movie in my life.\n\nSpoofing heck of a lot of horror movies, it turns out to be a horror to the audience. Cheap dialogs, gross-out sequences, vulgar references all induce repugnance, but humor. The main idea of the Scary Movie franchise is lost in this piece of extremely ridiculous depiction. I laughed countably 2 times and that I don't wanna remember. Supporting cast sucks with the lead ones. If one thing I liked about it is the spoof on Inception. That was funny.\n\nMusic is average, editing is fine. Awful direction & writing makes this a no-brainer. It has nothing to deliver. I thank the makers they did not instill flesh show. 2.0/10.\n\nBOTTOM LINE: Not recommended. The worst film in the series. The worst spoof comedy ever.\n\nCan be watched with a typical Indian family? NO\n\nProfanity: Strong | Nudity: Mediocre | Sex: Implied | Vulgarity: Mediocre | Violence: Strong | Gore: Mild | Smoking/Alcohol/Drugs: No"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Scary Movie 5",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Christian_Dimartino",
        "review_rating": "3",
        "review_title": "The saddest movie since Amour.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kamamoney",
        "review_rating": "1",
        "review_title": "Five too many",
        "review_detailed_main": "OMG please don't make any more \"scary movies\" they're just not funny anymore, same gags, same cheesy one liners, same Predictability, it's boring i won't be watching this, just not funny anymore, ONE scary movie was enough, PLEASE I BEG YOU STOP making them, the jokes are always the same or very similar, there needs to be some new original material, try introducing a comic who knows what he is saying, or get less lifeless characters, i really didn't like the trailer and i therefore will not be watching this film nor will i ever watch another \"scary movie\". 21 jump street, was funny original, and very well made the jokes and gags are well timed, sorry but this is my feeling i don't like these films, just make ONE and then move on get bigger get creative don't make the same thing over and over people will stop watching after a while."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "rivado9",
        "review_rating": "3",
        "review_title": "the worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "martitah_1",
        "review_rating": "1",
        "review_title": "I was expecting something bad but this was actually terrible",
        "review_detailed_main": "The only parts I've actually laughed apart from the first few minutes were actually the parts they show at the end with the deleted footage. And some of the deleted parts were actually better than the ones they chose to put in the movie itself...I was very disappointed. The Scary Movie series should have ended either on the second or third movie. I've found this review online which practically sums up my opinion on this movie: \"How bad is it? SCARY MOVIE 5 is so bad that the two best performances in the film come from Charlie Sheen and Lindsay Lohan, and they're both out of the movie within five minutes. I'm not saying they're good in it. They're awful. It just so happens their level of awfulness is slightly above anyone else unfortunate enough to be part of the cast. When you find yourself wishing there was more Lindsay Lohan in a movie, you know it's bad.\""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kenlaw30",
        "review_rating": "10",
        "review_title": "good",
        "review_detailed_main": "It's also consistently funny. Sure, the nature of many of the jokes is that they exist in a vacuum and aren't necessarily related to what's going on or what matters,thought motion-capture animation was beyond the range of foul-mouthed R-rated comedy, here's your evidence to the contrary.There aren't exactly any curveballs in this story, but that's when you realize you're watching a film in which a man is trying to stop hanging out with his profane teddy bear. Despite the obvious outcomes, \"Ted\" has to be considered an original comedy. this movie was funny i'm glad snoop dog was nit and mac miller they were funny together"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "Is there a cellar?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "cstull91",
        "review_rating": "1",
        "review_title": "Do not go see this movie...no matter how much you love the Scary Movie Franchise...please",
        "review_detailed_main": "I'm a huge movie buff and I'm a huge fan of the Scary Movie Franchise....this movie should not even be included in the scary movie franchise.I know what your thinking, oh just another review bashing a movie, seriously do not waste your money seeing this movie, no matter how badly you want to see it because you think it looks \"funny\" do not! It will just make you want to ask for your money back and ruin your evening. There were people walking out the whole movie, but I for some unknown reason decided to stay and watch the rest with my girlfriend and her brother....We all walked out angry and wanting the hour and like 10 minutes back from our life. I know I know your thinking oh maybe I'll still go, maybe this guy is wrong, but seriously...if you don't believe me about how bad it is, I'm sure there is a Cam download out by now that you can see what I'm talking about before you waste your time with this movie. Sorry for ranting I'm just extremely mad that it got to theaters the way it is...\n\nP.S.-worst sound and dialogue editing ever for those who care...completely out of sync almost the whole movie....seriously...I want to contact the sound department and figure out how they let all the non stop mistakes slip..."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "WoLf_DiGiTaL",
        "review_rating": "1",
        "review_title": "To catch a predator future alumni",
        "review_detailed_main": "I believe that the writing staff, producers, actors, and crew will appear on a future episode of \"To Catch a Predator.\" It seems like they are normalizing the sexualization of children through inappropriate humor. If anyone points out this issue, they are dismissed as people who don't understand jokes. What's even scarier is that it seems to be working, as none of the top reviews mention this problem. If this were happening anywhere other than California, these individuals would likely face legal consequences and have child services checking on the welfare of any children they have. 8mm was funnier than this movie. Putrid comes to mind."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kierankearney123",
        "review_rating": "2",
        "review_title": "disgusting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Hellmant",
        "review_rating": "4",
        "review_title": "Not as bad as the Wayans brothers' two installments.",
        "review_detailed_main": "'SCARY MOVIE 5': Two Stars (Out of Five)\n\nThe fifth installment in the never ending 'SCARY MOVIE' franchise, which began in 2000 with the Wayans brothers at the helm (the eldest, Keenen, directed the original film and his brothers Shawn and Marlon co-wrote and co-starred in it). It was a huge financial hit but was also loathed by most critics and movie fans. The second film was helmed by the same trio of Wayans, performing the same duties, but was much less successful at the box office and even more despised by critics and cinephiles. David Zucker (who co-directed and co-wrote such classic spoof comedy films as 'AIRPLANE!', 'THE NAKED GUN: FROM THE FILES OF POLICE SQUAD!', 'TOP SECRET!' and 'BASEKETBALL') took over directing duties (from Keenen Ivory Wayans) on the third film and Craig Mazin (who also co-wrote the 'HANGOVER' sequels) and Pat Proft (who co-wrote such classic comedies as 'POLICE ACADEMY', 'HOT SHOTS!', 'BACHELOR PARTY' and 'REAL GENIUS') took over writing duties. It was a huge hit and a noticeable improvement over the previous installments. Jim Abrahams (who also co-wrote 'AIRPLANE!', 'TOP SECRET!' and 'HOT SHOTS', as well as another classic 'THE KENTUCKY FRIED MOVIE') also joined the writing team on 'SCARY MOVIE 4'. It wasn't quite as good or successful as '3' but it was still a better film than the first two movies. Now we get 'SCARY MOVIE 5', which was written by Zucker and Proft but directed by Malcolm D. Lee (who's directed such hit comedy films as 'UNDERCOVER BROTHER', 'SOUL MEN' and 'THE BEST MAN'). It's not as bad as the Wayans brothers' two installments but it is a lot worse than the last two movies.\n\nLike all the other films in the series it spoofs mostly current hit horror films but it also parodies popular movies in general, as well as pop culture (like the 'Fifty Shades of Grey' novel). This one mainly spoofs the films 'MAMA', 'PARANORMAL ACTIVITY', 'BLACK SWAN', 'RISE OF THE PLANET OF THE APES', 'INCEPTION' and 'EVIL DEAD' (even though the last film was released just a week prior to this movie). The film revolves around Charlie Sheen and his three children going missing. Sheen's kids are then found in the woods, living like wild animals and having been raised by a spirit called 'Mama'. Sheen's brother and brother's girlfriend take the kids in. The movie stars Simon Rex as Sheen's brother (who also appeared in 'SCARY MOVIE 3' and '4', as another character) and Ashley Tisdale as his girlfriend. It features cameos from other stars like Lindsay Lohan, Darrel Hammond, Molly Shannon, Snoop Dog, Heather Locklear and Jerry O'Connell. It's the first film in the series to not feature Anna Faris or Regina Hall.\n\nThe film is bad, there's hardly a funny joke in the entire movie, but I still found it amusing. Mostly just because I like movies so much (and especially the horror genre) that I just enjoyed all the film references. I agree with all the critics that it's poorly written and just plain stupid but it at least isn't full of over-the-top gross-out humor like the first two movies and it isn't quite as stupid either (in my opinion). The Wayans' films were painfully bad and unfunny (for me). I couldn't stand watching them. This installment was at least amusing (for me) and I liked watching all the stars in it. It's not as good as 'SCARY MOVIE 3' or '4' but some film nuts might get a slight kick out of it (like I did).\n\nWatch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=6JDL6l-UAwQ"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "askeland89",
        "review_rating": "4",
        "review_title": "As much as I wanted to like it..",
        "review_detailed_main": ".. I just couldn't. I love this series in general, even the fourth one which for some reason remains my favorite.. Don't ask me why, I'm a clown.\n\nThis one however felt wrong in every possible way. Yeah it was cool to see the \"return\" of Charlie Sheen and Snoop's cameo was pretty awesome but it doesn't excuse the rest of the movie. The earlier installments were undeniably cheesy and stupid but that's why I love them. This one was cheesy and stupid for the wrong reasons and I didn't laugh a single time.\n\nI finished it even though it felt like torture. Would not recommend you waste your time on this one."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "derezonajazz",
        "review_rating": "3",
        "review_title": "Why??",
        "review_detailed_main": "They keep making scary movies for reasons beyond me. The jokes are bad enough let alone you have to have seen the films they'd parodied to get where they're going. Poor acting/direction compounds the issue."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "hadilookscool",
        "review_rating": "5",
        "review_title": "A whole new installment",
        "review_detailed_main": "With a whole new cast being brought in ,comes new and abrupt audience reactions .Even Charlie Sheen in the introduction did not really stand out in the movie that much as he is being thrown around in the room with ridiculous clichés .The scary factor is mediocre as this production really shows that it does not understand the trilogy of the balancing of scare factor and humor frequencies in the franchise .Scary Movie 2 had a similar parody box ;The Haunting 1999 and The Exorcist.Even if The Haunting 1999 had very large scare criticisms according to critiques ,Scary Movie 2 still could carry the parody atmosphere with characters like The Caretaker .However ,Scary Movie 5 had a very large parody box thrown on the table for them ;Paranormal Activity ,TheCabinintheWoods and Sinister .These movies boomed above average with their setup and horror avalanche ,but this movie could not seem to understand that .Halfway through ,the ridiculous attempts to make the audience laugh non-stop was just utter rubbish for a horror parody movie.The past 4 movies executed humor with great timing along with its scary factor .The only movie this movie parodied well in their parody box is MAMA .That I am actually impressed .The connection with the other parodied movies collapsed but the sequence and humor was above average ,but still it did not carry the theme of family like in MAMA.The movie tried so hard trying to show the so-called 'family connection' between Jodi as the stepmom and Kathy and Lily and Aidan as the children .The movie didn't even try to show the sense of family relationship and love as we do not see Jodi or Dan even feeding them or showing any signs of family love after Maria was fired .Even with Maria there ,the movie did not give these three a chance to show affectionate love towards the children .All they did was to make Jodi asking herself whether she was getting in touch with them(the children) and expose her to ridiculous humor .Overall,the movie was very close to performing a mediocre showcase."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "g-bodyl",
        "review_rating": "4",
        "review_title": "I Want Anna Faris Back!",
        "review_detailed_main": "Scary Movie 5 is a giant letdown which is unfortunate. Of all the spoof movies that came out in the past decade, I only enjoyed the Scary Movie franchise. Scary Movie 3 is by far the greatest, and Scary Movie 4 is not that fare behind. But then there is this....honestly, they should have never made this film. What made the first four film successes are gone. This film has some good moments but on the whole, it's not a good or funny movie.\n\nMalcolm D. Lee's film directs this spoof that spoofs films like the Rise of the Planet of the Apes, Black Swan, Mama, and so on. It's basically about this girl who believes her house is haunted by this terrifying poltergeist.\n\nIs it even safe to talk about the acting? The acting is pretty lame. Ashley Tisdale has the makings of a good actress, but not here. Simon Rex, what on earth happened from the good ol' days of Scary Movie 3? Everyone here made Lindsay Lohan seem like an Oscar-nominated actress.\n\nOverall, Scary Movie 5 is very disappointing because it's just a lame duck. All the Scary Movies are stupid and dumb, but in a fun way. In this film, I did lots of grimacing. There were some good moments here, namely the real-life spoofs of Lindsay Lohan and Charlie Sheen. Here's hoping they make no more of these films. I rate this film 4/10."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Really",
        "review_detailed_main": "As good as the first one plus the second one times the third and fourth ones"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "influxtwo",
        "review_rating": "6",
        "review_title": "Doesn't deserve the hate",
        "review_detailed_main": "I had zero expectations for this but actually really enjoyed it. The writing, performances, and cameos was a bit entertaining for me. Some of it was in incredibly poor taste but I laughed at a lot of it. As a stand alone spoof I enjoyed this. It tackled the material it was making fun of well. A wink to horror comedy and it's heyday."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "michaelfesting",
        "review_rating": "2",
        "review_title": "wow this is actually unbearable",
        "review_detailed_main": "I actually feel kind of bad for all actors involved. unreal. i guess everyones hurting for money when u make a film like this im not sure how they got the actors must've been a huge loss in box office."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Budruss",
        "review_rating": "4",
        "review_title": "About Average For The Franchise",
        "review_detailed_main": "Just to get this out of the way: This is not a good movie.\n\nThere, Now that we have that established we can move on.\n\nScary Movie 5 is about on par for the rest of the series in that is has some quite hilarious scenes and a lot of others that just aren't funny and drag on until you start to look for something sharp in the room to end your suffering.\n\nThis is pretty much the way all of the 'Scary Movies' have gone. Flashes of brilliance amid a lot of unfunny filler.\n\nThe highest praise I can offer this one is that since they use none of the original characters (but a few familiar faces in the cast) they could release it without crediting Jason Friedberg or Aaron Seltzer anywhere on it.\n\nIf you liked the previous 4 movies then you will probably like this one as well."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "comedyfan71",
        "review_rating": "2",
        "review_title": "Almost unbearable",
        "review_detailed_main": "I liked the first Scary Movie film, it was a decent spoof of the horror genre and while the others are noticeably weaker they still have their moments. Scary Movie 5 has absolutely none of that and is sadly one of the worst comedy films I have ever seen, if not films I have ever seen. It isn't even a horror parody by this point, it's just references to pop culture at the time like in the Friedberg and Seltzer films, and it's just as bad as those.\n\nThe storyline is non existent, it's a string of completely humourless scenes after the other and it is difficult to watch. The acting is poor, even Charlie Sheen who is usually a pretty good actor falls flat, much of it is to do with the writing I would guess. Anna Faris did a decent job in the first 4 films and her deadpan and comedic timing weren't bad. Snoop Dogg should stick to rapping.\n\nThe characters are all so one dimensional and boring it makes you wonder how the writers were allowed to work on this film. One surprising fact is that David Zucker of all people worked on this, the same Zucker that wrote two of the funniest films ever made, Airplane and The Naked Gun.\n\nI didn't laugh once in Scary Movie 5, I found about 2 moments funny but not funny enough to generate a laugh.\n\nThe gags are so lowbrow even Date Movie's jokes are intelligent by comparison. There is no value to this film and its spot in the bottom 100 is well deserved.\n\n2/10. Awful."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "anthonyf94",
        "review_rating": "4",
        "review_title": "Literally a scary movie",
        "review_detailed_main": "Worst chapter of the saga. Sketches too predictable. Remains the affection to a series that with its bad and good things characterized surely '00s years. Nonsense, American comedy, sexual and horror sketches: funny for a stupid evening with friends, not more."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "lukehere99",
        "review_rating": "4",
        "review_title": "Scary MoVie = Scary Movie 5",
        "review_detailed_main": "The first Scary Movie was decent. It didn't deserve a sequel let alone 4! Scary Movie 3 was alright, mainly because they had replaced the foul juvenile Wayans brothers with the writer of Airplane! and The Naked Gun. Getting rid of the scatological crude humor and bringing in the cleverer intelligent laughs worked. But Scary MoVie is just as bad possibly even worse than the sickening antics of Scary Movie 2.\n\nUsually in a review I would do a summary of the plot. But the writers of Scary MoVie haven't got time for plots! Ashley Tisdale and Simon Rex adopt some weird kids, movie into a new house and vulgar toilet jokes ensue. The weird kids are obviously meant to be like the weird kids from Mama. (SPOOF NUMBER ONE). And Simon Rex works at an ape training lab, which is meant to be like Rise of the Planet of the Apes. (SPOOF NUMBER TWO). His girlfriend Ashley Tisdale is a ballet dancer who is trying to keep the lead role of The Dying Swan which is meant to be like Black Swan. (SPOOF NUMBER THREE).When their asleep loads of jump scares and loud noises are happening, all while being filmed with surveillance cameras. That's meant to be like the Paranormal Activity franchise. (SPOOF NUMBER FOUR). At the beginning of the movie Snoop Dog and some other guy (who looks like Macklemore but isn't Macklemore) are going through a forest and find an old cabin in the woods, that's meant to be like you guessed it The Cabin In The Woods. (SPOOF NUMBER FIVE). Later on Ashley Tisdale goes to the cabin in the woods and a bunch of teenagers are there. There all praising religion and singing cheerful songs, which is the exact opposite of what they do in The Evil Dead. (SPOOF NUMBER SIX). A Morgan Freeman soundalike is narrating the movie, which is meant to be like all those movies which Morgan Freeman has narrated. (SPOOF NUMBER SEVEN). When Ashley Tisdale starts having messed up dreams she gets a dream specialist to help her out. The dream specialist looks exactly like Leonardo Di Caprio from Inception, they even have the bit where he's explaining everything at a cafe. (SPOOF NUMBER EIGHT). And finally for one reason or another Ashley Tisdale ends up in a bedroom about to bang with Christian Grey. That's meant to be like the book 50 Shades of Grey. (SPOOF NUMBER NINE).\n\nSo there are 9 different spoofs in an 86 minute movie. That's something like 1 spoof every 8 minutes. When a movie copies a scene or a concept from another movie but adds in some sh*t jokes, it doesn't make a parody it makes a sh*tty mess!\n\nTo makes matters worse all of the characters in the movie are annoying and deserve to die. I was trying to think of someone who was likable and appeared in Scary MoVie. But they don't exist! Simon Rex's character wasn't too bad at the start, but he got so stupid it was unbearable. This is just another 21st century spoof movie - not funny at all! There hasn't been an above average spoof movie since 1994 when the third Naked Gun movie came out. It seems to be no longer possible!\n\nOverall I give Scary MoVie 4/10 for 7 laughs throughout the whole 86 minute movie, mainly because of the mildly amusing narrator."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "lev-nemkin",
        "review_rating": "5",
        "review_title": "Has some decent moments...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ierenz",
        "review_rating": "2",
        "review_title": "Scary Movie 5 is the ghost of a once-good idea",
        "review_detailed_main": "You want to see something really frightening? If so, with Scary Movie 5, the recent ghastly issue from the horror parody franchise that refuses to die, you've come to the incorrect movie.\n\nIt's not to be terrified. It's meant to be funny, but you'd find it simpler to read the pulse of a zombie than you'd find a single nice laugh in the film that opened, natch, without any critical previews."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "SaraHarveyforpresident",
        "review_rating": "4",
        "review_title": "scary movie 5 is the worst film of the series",
        "review_detailed_main": "I though scary movie 4 was bad but this film was terrible . the film is the same as any other paranormal activity spoof but some of the other ones are better.\n\nIt stars a different main actress because they couldn't get the old cast back and\n\nit is basically a different movie but with the Scary movie name.\n\nI wish I enjoyed this film but sadly it left me feeling annoyed\n\n4 out of 10 stars\n\ndon't watch\n\nTHE END"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "furryfrenzi",
        "review_rating": "9",
        "review_title": "Why does everyone hate this?",
        "review_detailed_main": "I don't know why people hate this movie. It may be the worst movie, but I think it's really good. The comedy, the spoofs, the scares and all of that sh*t. If they make another scary movie, I'll just get to watching it. I did miss Anna Faris and Regina Hall in the other ones, though. Whoever directed this movie, keep it up!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "td_username",
        "review_rating": "6",
        "review_title": "Entertaining",
        "review_detailed_main": "Not as bad as some comments suggest. The first scary movie is obviously the best. I hated the haunted house one, with the butler's grotesque hand. I liked this one (scary movie 5) a lot better. Ashley Tisdale looks so good."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "jacobjohntaylor1",
        "review_rating": "1",
        "review_title": "Worst then Scary 4 and that was awful",
        "review_detailed_main": "There as never been good movie in this franchise. This whole franchise sucks. You might think this is the worst one if you did not see the first one. Scary movie 2 is a better movie and that was awful. Scary movie 3 is a better movie and that was awful. Scary movie 4 was a better movie and that was awful. This is not funny. I liked most of the movie they are were making fun of. They did not insult or put down these movies. They just were not funny. This is just a gross and stupid movie and kind of sick at times. But never funny. Even the bad horror movies they made fun of are better. They did not point how stupid some of the movies they made fun of were. They just did stupid collage hummer. This whole series sucks"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "metalrage666",
        "review_rating": "1",
        "review_title": "Unfunny and Unnecessary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "antony-1",
        "review_rating": "5",
        "review_title": "Not as bad as it's rated, but not great",
        "review_detailed_main": "We had a movie marathon and watched Scary Movies 3, 4 and 5 in a week.\n\nThis was definitely the weakest. It felt flat. There were moments that should have been funny but just didn't land and I wonder if that was the direction. Some of the acting wasn't great too, from both the actual actors and the cameos.\n\nIt held my interest, it was generally entertaining. A few laughs. It's not as terrible as people make out. But certainly watching it on streaming probably makes a difference - if I'd paid for cinema tickets I would be perhaps less forgiving.\n\nThe weird thing is the outtakes were funny. The cast were clearly having a blast. So it's weird that the movie felt so low energy.\n\nWatch if you are bored, but have low expectations."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "burlesonjesse5",
        "review_rating": "4",
        "review_title": "VIEWS ON FILM review of Scary Movie 5",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "m-ramanan",
        "review_rating": "4",
        "review_title": "Watch trailer and stop there itself...",
        "review_detailed_main": "RATED 4/10 Language: English Source: Nil\n\nJust want to continue the series and watched this crap. Each sequel is getting repeating the spoof style and becomes irritating one.\n\nHow much ever you lower your expectations, this movie will beat that one, you will definitely get disappointed in the end.\n\nIt has own moments but that is not enough to hold the audience for 1.5 hours.\n\nBest advice, skip this one. Just watch the trailer all the best parts are there in the trailer. And it will be over in 2.5 minutes.\n\n--just to fill 600 characters repeated below How much ever you lower your expectations, this movie will beat that one, you will definitely get disappointed in the end."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "ITALUKE",
        "review_rating": "3",
        "review_title": "A comedy that is not funny.",
        "review_detailed_main": "This is the worst Scary Movie in the entire franchising. Not once I laughed out loud, the best reaction this got out of me is a chuckle. When chuckle is the best a spoof movie could do, you know you failed. The best part of this movie was the main actor that played the father. I imagine that if for the main female character they had chosen the protagonist girl from all the previous movies, this would have turned out much better. I have to admit that my knowledge is lacking this time, as I had no idea (and I still don't) what were they parodying with the whole dancing audition, is it another horror movie?"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Floated2",
        "review_rating": "2",
        "review_title": "Not Much That Hasn't Already Been Said",
        "review_detailed_main": "The Scary Movie franchise grew popularity within the starting of the early 2000's decade as a new and fresh comedy/horror spoof films. Since then there have been many mishaps with the franchise, but each film since its original has seem to appear lower than its processor (with some exceptions) due to subjectivity. However Scary Movie 5 appears to be the lowest the film has sunk. We are witnessed to an unfunny and tiresome spoof film where the directors use tiresome and rehashed jokes to fill time. The film does have certain moments but even in those moments the jokes rarely connect. In general the jokes are mainly misses and the film becomes uninteresting towards the final act. Perhaps it is for the best that this was the final nail in the coffin for the Scary Movie franchise.\n\n=== As a rewatch 01/04/19' Scary Movie 5 remains the worst of the franchise. Having watching the previous films upon the week, and having forgotten much about this film, one remained slightly unaware of how this film was.\n\nThis film is quite short in runtime, ending at about 73 minutes (excluding end credits) with many more misses in laughs than hits. The main parodies included Paranormal Activity, Black Swan and Planet of the Apes, along with the Cabin in the Woods, Inception and a few other major blockbusters (many non horror films).\n\nThe Inception scene parody was possibly the highlight, along with some of the Ape scenes. There were several cameo appearances but most of them were quite dull. Apart from that, this film was mainly unfunny and reason as to why this was the lowest grossing film of the Scary Movie franchise.\n\nAs a rewatch 04/06/23' opinions remain same. Easily the worst film of the franchise and what ultimately killed the franchise. Tries a little too hard in being funny where everything misses."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "zhyarTheChosen",
        "review_rating": "3",
        "review_title": "Ewww",
        "review_detailed_main": "Why those scary movies sequels are so disscasting it got worst"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "puppycupcake",
        "review_rating": "10",
        "review_title": "This was the worst movie I have ever seen in my life.",
        "review_detailed_main": "First of all, I usually love spoof movies that are goofy that everyone else hates. This one is different. Ana Farris was terribly missed. Regina Hall was also noticeably missed. This movie didn't have a single laugh. It was just a spoof of Mama, which I don't even know how they got it made so fast considering Mama just came off the movies. It also spoofed Evil Dead which just started this same weekend. No matter how much you think you might like this movie, or how much you think you would like it anyway, I warn you. You WILL wish you hadn't gone. I guarantee this movie will not be showing in two weeks. It had to be a fairly decent budget because the production values were pretty decent, but I just don't see how this movie ever got approved to be made. The casting was horrible. They should have just waited for Ana Farris to be available. This movie is not even worth renting at Redbox or even watching on cable for free."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "padariaukaas",
        "review_rating": "1",
        "review_title": "This is Agenda 21 and not a movie. Zucker does not give a damn about its ratings and reviews.",
        "review_detailed_main": "This is as disgusting as it gets, but this is intentionally created like this, to promote an agenda of the \"elite\", to send a message to humanity that certain groups are as evil, satanic and sexually perverted as it gets and they are to demoralize your family with intention and should not be allowed to be in the positions of power and banned from Hollywood and movie production. Agenda 21 and not a movie. Zucker does not give a damn about its ratings and reviews.\n\nRate it RRR, which stands for prison for life the producer and adults should not be allowed to watch it and allowing kids to watch it should be criminal offense. This \"movie\" should be BANNED and destroyed and its creators banned from movie making for life. Now!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "happytoms",
        "review_rating": "2",
        "review_title": "It's not worth your time so don't even bother",
        "review_detailed_main": "It's the early 2000s parody formula but \"butchered\" in 2013. All you need is to base the story on few recent and successful high budget movies, make fun of everything and everyone in the most ridiculous ways, have action/horror which mostly leads to comedy which in this case leads to very bad comedy, sexy girls and everything else you would expect from a parody.\n\nIt took them 7 years to finally release another Scary movie. My expectations were low but I didn't realize it would be this bad. It has maybe a few funny moments but the rest of it for me was just painful to watch. I managed to watch it all despite that. I tried to watch it as open-minded I as I possibly could but overall the movie feels like it trying too hard and usually doesn't achieve the goal it pursues. I liked the original few movies of the franchise. They are not good but not too terrible. They are kinda alright and even watchable after all these years but this wasn't and feels like the Scary movie magic is gone.\n\nOverall I think a lot of people will not enjoy it and a small portion will. Personally, after watching the original movie this feels like the worst parody I have ever seen so it's a 2 out of 10 and only because I liked one scene otherwise it would be a 1/10 I wouldn't recommend this to anyone familiar or not with parodies at all."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "kitsune_vook",
        "review_rating": "2",
        "review_title": "Seriously disappointed",
        "review_detailed_main": "I mean it. I've been a HUGE fan of all Scary movie's (except the second one, which was awful but watchable), so I got very excited when I knew there was a 5th movie to watch, now that it's on Netflix I decided to continue watching the series but... oh god. I just couldn't stand more than 40 minutes, no laughing at all, the more that I got was some \"heh..\" twice, that's it. The movie got me SERIOUSLY depressed and I'm not being sarcastic, I was expecting to see another great movie and all I got was cheap repetitive and predictable jokes over and over, with non sense dialog leading no where. This HAS to be the worst movie Simon Rex has been, and that's sad.. because he can do way way better.\n\n2/10, I'll go back to scary movie 3-4 over and over to try and delete this one from my mind."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Kyleeeeeeeeeeeeeee",
        "review_rating": "2",
        "review_title": "Umm...",
        "review_detailed_main": "I can't even begin to describe how much I despise this movie. They seriously cram in as many pop culture references as possible. Some don't even have to do with scary movies! Scary Movie 5 is an unclever, unoriginal parody of films like The Paranormal Activity series and Black Swan (Black Swan, really guys? Are you that desperate for stretching your movie length?). The ONLY thing that I sort of liked in this movie was the stop-motion they used to parody Paranormal Activity, but still every single joke they crammed in there that actually worked they constantly repeated, ruining the joke altogether. It truly is scary what parody movies have become nowadays."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "sakul-51912",
        "review_rating": "4",
        "review_title": "trying to make this short",
        "review_detailed_main": "The movie had some fine fun ideas behind it's jokes but the delivery is kind of bad. Also the camera, scenes and acting feels really cheap."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "chrbro26",
        "review_rating": "3",
        "review_title": "lacking in laughs",
        "review_detailed_main": "Is this the worst of the Scary Movie films? Not really, Scary Movie 2 still holds that claim, but this movie just might be the killing blow to the franchise. The main parody here is the film \"Mama\" which I have never seen, probably never will, and as a result, a vast majority of the movies \"jokes\" flew over my head. The jokes I did understand weren't even that funny. The Inception spoof was probably the funniest part of the movie, but even that only provided a couple of chuckles. I laughed a few times, which is more then Scary Movie 2 (Zero) but the negative reception this film got, as well as poor box office will probably put this franchise to sleep for good."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "cac_70",
        "review_rating": "8",
        "review_title": "if you don't get it",
        "review_detailed_main": "Then that means you just don't get the humor. It's funny, and is about a B+ movie. But you have to actually watch it and not be messing with your cell phone at the same time. All the negative reviews must be from people \"watching\" the movie while they are distracted."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "Behdinderakhshan",
        "review_rating": "7",
        "review_title": "The best one",
        "review_detailed_main": "The series of \"scary movie\" are the very fun and hilarious parodies of many nostalgic horror movies, on a very high level of ridiculing every possible things that you might imagine, the very well made structure of the series which is also so simple, is not offensive in any ways to original versions. The first and the second episodes of the series are unbelievably creative and magnificent which I believe makes everybody laugh, but when we move on the third and forth one we see drastic changes in the form of the series, which is expected due to the change of the director. But unbelievably On the fifth part, the series truns on its previous great shape; the fifth part has the lowest rate but i personally believe due to its hallucinating form of jokes is the best one."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "denseafood",
        "review_rating": "10",
        "review_title": "I liked it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bigred-85068",
        "review_rating": "10",
        "review_title": "It's awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "deepperple68",
        "review_rating": "7",
        "review_title": "Lighten up people......",
        "review_detailed_main": "Its a Scary Movie !!!! Did you expect an Oscar winner or something?? I thought it was pretty good.....for that type of movie. You just have to have a sense of humor going into it. All the Scary Movies are the same. There's not much more you can do with them. If you didn't like the first one, you will not like any of them. Are they stupid? Yes!!! But they are meant to be!!! If you are looking for award winners, you shouldn't be watching this kind of movie anyway. These are meant for people with a sense of humor......and even a weird sense of humor sometimes. So all the one star submitters probably shouldn't have even tried watching this type of movie to start with. Bad acting....bad special effects. ...weird....politically incorrect scenes. ...is all part of it. So yes....I enjoyed it. It had all the things you would usually expect with a \"Scary Movie\""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "stephenchase-63504",
        "review_rating": "10",
        "review_title": "I love this entry of the quintrilogy!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "nybred4",
        "review_rating": "7",
        "review_title": "The reviewers need to reboot.",
        "review_detailed_main": "I read many of the 'hate' reviews, some from the 'prolific or prominent or prophylactic' reviewers. Let's understand something immediately. If anybody begins a review with \"Scary Movie #5 had not ONE funny moment in it\", that reviewer is lazy at best and at worst, a liar. Then, other reviewers spend better than 2/3rds of its review discussing the plot and why it may be flawed. Then they score it a one.\n\nThis movie is very funny. This movie is often clever. Tisdale and Rex execute clever stuff beautifully. No doubt in my mind they will live up to good scripts and make bad scripts watchable,,--- No doubt.\n\nDo not press the play button with an edgy mood that fosters political correctness and inappropriate expectations, (whatever inappropriate expectations may be) or innovative genius. Expect a funny movie and damn the high brows, and me too if you like."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "davepolain64",
        "review_rating": "8",
        "review_title": "Much funnier",
        "review_detailed_main": "After the ABYSMAL 3 & 4, this was a welcome retro funny films. Zucker is still a great and funny writer and this had some genuine laugh out loud moments, without the brutally annoying stoned character.\n\nWell done!!!"
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "bryanmusgray",
        "review_rating": "10",
        "review_title": "gold",
        "review_detailed_main": "The single handed greatest thing i've ever seen. This ain't a movie. Its an experience."
    },
    {
        "movie_id": "tt0795461",
        "movie_name": "Scary Movie V",
        "movie_rating": "3.5",
        "review_username": "annevejb",
        "review_rating": "",
        "review_title": "Surprise surprise, sick humour, v1.00",
        "review_detailed_main": ""
    }
]