[
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "matija-trost",
        "review_rating": "3",
        "review_title": "THE WORST PREQUEL...",
        "review_detailed_main": "...or how to make a comedy without a laugh?\n\nWhen I first heard that there's a sequel to Dumb and Dumber I was ecstatic since this was the best comedy in ninenties and certainly one of the best comedies ever. But after seeing opening credits (No Jim & Jeff), I was a little sceptical. Never mind, it still can be good...\n\nErghh, wrong. The movie was getting worse and worse. The leading characters were shown like a couple of retards (very unlikable, since in original there aren't THAT slow), who were just trying to imitate Jim Carrey and Jeff Daniels and failed miserably. Lack of charm, i guess. But the main fault goes to script writer who provides a lot of already seen jokes as the rest of the producers of this crap.\n\nI agree, it would be nearly impossible to beat the original version, since it was full of original black humor, but hey, at least they could try harder. Despite that movie sucked, it has some moments...but since i can't remember any if them, i couldn't rate it higher than\n\n3 out of 10."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Anonymous_Maxine",
        "review_rating": "3",
        "review_title": "So I think by now the title officially refers to the writer and the director and not anyone in the movie itself.",
        "review_detailed_main": "It's hard to believe that it's actually been almost a decade since the first Dumb and Dumber, which was deservedly a smash hit, was released on the unsuspecting populace. I can see it now. I was in tenth grade, and I still remember ditching class in beautiful Irvine, California to ride my bicycle over to Fashion Island in Newport Beach so my friend and I could steal bubble gum from one of the ritzy drugstores and then go see this movie, which we must have seen in the theaters half a dozen times or so. Where we got the money I've been trying to remember for years.\n\nI'd like to start out by saying that I don't know that the prequel to the brilliant Dumb and Dumber (easily one of the most hilarious comedies to come along in decades) really deserves all of the vicious reviews that it has received from professional and amateur critics alike. It has been a popular and critical disaster from the day it was released, and while it's true that it is simply a bad, bad movie, I think that anyone claiming it to be 'absolutely THE worst movie I've EVER seen' might be exaggerating just a little bit. Or maybe I've just seen worse movies than these people. I've seen some seriously bad movies, and while Dumb and Dumberer is certainly an embarrassing flop, I've seen worse. It's better than Scary Movie 2 and 3 combined, for example.\n\nThat being said, on to the crapfests. Dumb and Dumberer, since I have neither the energy nor interest to research the intentions, strikes me almost unmistakably as one of those movies that one studio makes of another studio's movie. Kind of like how Pixar just publicly insulted Disney at the same time as they ended the two companies' partnership, and Pixar promptly announced that they would be making Toy Story 3. I expect Toy Story 3 may be a disaster (if the 'threat' was serious), possibly even purposely, in order to get back at Disney. I don't know that this prequel to Dumb and Dumber was done for revenge at all, but I can't say that it's all that mysterious as to why the original cast and crew had little to nothing to do with it.\n\nThat being said, I have to say that I'm impressed with the actors they found to play the younger Harry and Lloyd, especially Lloyd, because this guy, without the bowl-cut and the chipped tooth, looks NOTHING like Jim Carrey's Lloyd, but in the movie he's the spitting image. This is one of the reasons that I think the movie deserves at least minor respect. At least the casting director was on the ball. Sadly, it's all downhill from there. I have to admit that I was pretty happy to see Bob Saget acting again. Granted, I barely remember him in Full House at all and I saw his one spoken line in Half Baked as the official end of his acting career, but I loved his cheesy jokes on America's Funniest Home Videos (the ORIGINAL show) so much that seeing him on screen again was almost like a trip back to my childhood.\n\nAnd then Harry had a little incident involving chocolate, and I started to squirm in my seat, as I'm sure many other people started to do, given the reviews I've read. It is expected that some memorable scene from the original film would be almost duplicated in a sequel like this, but Harry getting diarrhea in the original movie was funny because it was there for a reason. Lloyd put massive amounts of laxative in Harry's tea to get revenge on him for dating the girl that he was after. Crude, yes, but still funny. In this movie, Harry goes nuts with the chocolate in the bathroom and then Jessica's poor dad (Bob Saget) comes in and screams a numbing stream of profanity about there being feces all over his bathroom. Not only is this supposed to be funny, but there is so much stock put into this idea that it's duplicated again later in the film.\n\nIt's sad that a comedy as smashing and brilliant as Dumb and Dumber has been followed up by such a stupid, stupid film. While I admit that you can hardly expect for them to have created something as great as Dumb and Dumber again, I really didn't think that they could have come up with something THIS bad. I mean, just the name itself should have inspired some better ideas for the movie. Sadly, it seems that the powers that be were more interested in throwing a sequel out there than they were in actually making it deserve its title.\n\nAnd when a movie isn't good enough to deserve a title like Dumb & Dumberer, it's a bad, bad sign."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "ma-cortes",
        "review_rating": "3",
        "review_title": "Below average prequel film about two odds boys in their adolescence",
        "review_detailed_main": "An ordinary story of sex-minded people , dealing with brainless youthful and made without solvency . The movie talks upon the adventures and misfortunes of two no brain teenagers from the beginning their acquaintance , when Harry (Derek Richardson) and Lloyd (Eric Christian Olsen) meet themselves at high school . The picture narrates the various pranks , the mischiefs with schoolmates and teachers (Eugene Levy) . The respective parents (Mimi Rogers and Luis Guzman) try to resolve the problems without success . They are idiot pals who are continuously doing jokes and seeing lustfully by the opposite sex .\n\nThe film mingles irony , chuckles , giggles , comedy and numerous sex jokes . And of course , there's very bad taste , being the extreme when happen the incredible scenes on the crap in the bathroom . The comedy is cheesy and gross-out but has some moments here and there . The film is an embarrassing and absurd mess , the plot is ridiculous and monotonous and is formed by several humor set pieces , being quite disagreeable and graceless . There are some steamy hot scenes and some memorable and hilarious happenings of dirty humor which will rejoice the rogue aficionados to these kinds of things . Neither the players , nor the filmmaking seem to be nice , and the storyline is utterly embarrassing , but , curiously , it has some amusing moments and I found myself laughing in some times of the movie . Eric Christian Olsen was repeatedly denied the role of Lloyd because the producers thought he was \"too good-looking\" . It was only after seeing some home-video footage of Eric in full make-up improvising a scene with already-cast Derek Richardson that they gave him the role . The cast secondary is pretty good , such as : Luis Guzmán , Rachel Nichols , Eugene Levy , William Lee Scott , Shia Labeouf , Bob Saget , Julia Duffy and Mimi Rogers . Lin Shaye was the only cast member to star in both the original Dumb and Dumber and the sequel . The motion picture takes part of the large group about filthy and dirty humor , such as : ¨Scary movie¨ , ¨American pie¨and sequels . The previous film (Dumb and dumber) is much better ; plus , there were Jeff Daniels and Jim Carrey who are greatest actors , here the protagonists are unknown . Rating : It's a awful turkey . Disconcerting as well as inferior sequel and bottom of barrel . Yawner and snooze is continued."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "beardsleythesaint",
        "review_rating": "1",
        "review_title": "Pathetic cash in on Hilarious original",
        "review_detailed_main": "Was this movie necessary!? This is a truly terrible film, woefully unfunny to the extreme. Jim Carrey and Jeff Daniels were excellent in the first film and in a different league to the two actors in the roles as the young Harry and Lloyd (the guy cast as Lloyd does look like Carrey, except for the blue eyes). If there was ever going to be another film about these two characters it should have been a sequel starring the original pairing, instead we get this stinker. Dumb and Dumber hardly had an Oscar winning story line but gave us some great characters and a hatful of ball bouncingly funny gags, in the 'prequel' the weak story collapses under the weight of even weaker jokes! So uninspired is this movie that there are even rehashes of jokes from the original, just done slightly differently but in a totally inept manner. Dumb and Dumber is a classic, this is a pile of steaming doggy doo doo's. Do yourself a favour stick with the Carrey film and avoid this limp fish at all costs."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "DomNickson843",
        "review_rating": "",
        "review_title": "Not as bad as everyone says!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Hail2thechimp",
        "review_rating": "1",
        "review_title": "Ugh",
        "review_detailed_main": "I saw this movie with my cousin at a nine o'clock showing on the first day it was released. We expected nothing of it, and we were not disappointed. The best part was Bob Sagat screaming \"there's sh*t everywhere\", at the time I commented how prophetic that line was. I just don't understand how they could make this movie and throw feces all over the memory of the first one. The only thing the movie had going for it was that the two guys who played Lloyd and Harry looked like Jim Carrey and Jeff Daniels if you kinda squinted and turned your head at the right angle. Oh yea, and when we left that movie so brain damaged us we forgot where we parked and spent 5 minutes looking for his car."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "patrick_bateman_90029",
        "review_rating": "1",
        "review_title": "90 Minutes of Pure, Excruciating Torture",
        "review_detailed_main": "I really liked the original Dumb and Dumber. I thought it was a hilarious comedy that was better than it looked because of the writing/directing of the Farrelly Brothers and the acting of Jim Carrey and Jeff Daniels. When I originally heard that they were doing a sequel to Dumb and Dumber, I was somewhat enthusiastic. Then, it was announced that they were doing a prequel. Enthusiasm meter dropped some. Then, the Farrelly Brothers announced that they wouldn't be involved. Enthusiasm went down some more. And finally, it was said that Jim Carrey and Jeff Daniels weren't returning and were to be replaced by younger people. Enthusiasm went straight to hell. But I still decided to give it a chance because Eugene Levy was in it and he always finds a way to make the movies he's in funny. I was wrong again.\n\nThe plot - Harry and Llyod meet in the '80's and foil the corrupt principal's plans to steal money for himself and his mistress, the trashy lunch lady. Easily the stupidest plot I have ever heard. And I haven't even started dissecting this trash yet.\n\nBesides being a waste of celluloid, I have never seen such a cast whose talents were so horribly wasted. And there were so many good actors in this. There was Eugene Levy, Cheri Oteri, Luis Guzmán, Mimi Rogers, Shia LaBeouf, and the obligatory cameo by Lin Shaye that happens with nearly every film from New Line (in fact, I wonder if she has some hidden cameo in the Lord of the Rings trilogy). The two actors who replaced Jim Carrey and Jeff Daniels - Eric Christian Olsen and Derek Richardson - are good replicates, but they just weren't Jim Carrey and Jeff Daniels. The cameo with Bob Saget was dead before it even began. And then, this \"film\" is so filled with so many mistakes (not including the film itself), I still wonder if this was done accidentally or by the filmmakers to see how many people would notice every mistake the film was filled with.\n\nI thought Gigli was a much better film than this (and that's saying something). This film is nothing but a waste of time, celluloid, talent, and air. I would rather have a root canal without anesthesia than sit through this hunk of garbage, which I rated as the #1 worst movie of 2003, ever again."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Juni78ukr",
        "review_rating": "1",
        "review_title": "Worse than awful. 3,4 is too high for this rubbish",
        "review_detailed_main": "Quite simply, this is an awful movie. There is no excuse for people who made this crap. I thought Gigli was much better film than this. I believe this one is was worst film of the year and at least worst of the decade. No story,no acting, no brains, no heart, no comedy - only waste of time and money for everyone. But that's not all! Also I found this movie absolutely not funny but it's simply insulting and disgusting instead. You must protect your kids from seeing it. It's very sadly to see so talented actors (including Shia Lebeouf, who looked very good in Holes) involved in this disaster.\n\nAvoid all costs and stay away as far as you can from this garbage. It worse than anybody could expect. Don't see it even for free! Trust me! I never felt so miserably than I watched this trash. Why, Why I have lost my time and my money for it? Nobody knows. Anyway, you've been warned.\n\nMy rating: F- or 0/10.\n\nSorry for my bad English."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "skysthelimit08",
        "review_rating": "1",
        "review_title": "some actors, writers, and a director fail miserably at making something entertaining.",
        "review_detailed_main": "This is the worst movie I have ever seen. I'm serious. Do yourself a favor and stay as far away from this movie as you can....ESPECIALLY if you are even just a small fan of the original movie. The actors are horrible, the plot is even worse, and the jokes are completely unoriginal. I am the biggest Dumb and Dumber fan, and when I saw this prequel, I would've rather been stabbed with a pitchfork and dumped in boiling hot wax than sit through the rest of the movie. It was just so disappointing. Of course, I didn't really have high hopes for it to begin with anyway. Instead of seeing this movie, just watch good old' Dumb and Dumber ONE a couple times."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "icechalkhands",
        "review_rating": "1",
        "review_title": "What the ****",
        "review_detailed_main": "I challenge anybody to tell me what the f*** I just saw. I mean is Hollywood even trying anymore. Well I can't lie, I knew it was going to be a piece of s***. But I never expected it to stink this bad. The weird thing about this me being mad thing is, that I'am not mad like disappointed mad, but I could just start kicking someone's a** mad. Who funded this undeserving prequel. Why was there ever a prequel anyways. Please don't waste your life line on this movie.\n\nFor one the jokes are so forced on you that you'd have to be a child to understand the humor. Some of the actors in the movie, I've seen in very good movies, like the kid who where the donkey head in the parade, he was good in \"HOLES\". But I guess he didn't see this hole coming. In summary don't and I repeat don't expect to find some humor in this movie because there is none. I hate this f****** movie."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Ford_Maverick",
        "review_rating": "1",
        "review_title": "I feel dumberer for having watched it.",
        "review_detailed_main": "So my roommate borrowed \"Dumb And Dumberer\".\n\nGod only knows why.\n\nAnyway, he puts it in the machine and shortly afterward leaves the room to take a phone call.\n\nHe owes that caller more than he knows.\n\nSee, as I hadn't paid any money for it, nor even gotten my butt up off the couch to load the disc, I had little investment in it. Thusly I figured it wouldn't take much to meet my relatively low expectations for it. After all, the first one was pretty funny, right?\n\nBefore I continue, it should be noted that this movie had none of the original cast members, writers, directors, etc from the first film.\n\nNo one, at least, worth noting.\n\nNow, back to the story. Where the first movie had laughs galore (most of them cheap lowbrow humor, but hey, if I want Shakespeare, I'll read Shakespeare...) this movie had a sprinkling of \"That's kinda funny...\" and \"Was that funny? I can't tell anymore...\" moments.\n\nThe most telling thing I can say about this movie is that I DIDN'T FINISH IT. Nay, I COULDN'T finish it.\n\nA friend of mine that had the misfortune of being in the room with me at the time said it best when he said: \"At one point I laughed at how painfully unfunny it was and I realized that it (the movie) had pulled me down to it's level.\"\n\nOf course he also said: \"Another reason dumb and dumbrererererrer sucked is that both guys were trying to cop Betty White's \"Rose\" character from the Golden Girls but neither of them possesses her panache or supple buttocks.\"\n\nVerily, it is a thing of evil.\n\nHaving said that, it's not the worst movie I've ever seen. I would have to give some thought to exactly which movie holds that dishonor. \"Batman and Robin\" is pretty close. But no, I've actually finished worse movies than this. Thing is, in those movies I held out hope that they would get better before the end. With Dumb and Dumberer, there was no such hope. In fact, there was utterly no hope at all.\n\nI did get a chuckle from a couple moments though. Like when the two titular characters walk down the school hallway with their Special Ed class to the theme from the A-Team, and... well, that's it actually.\n\nOh yeah, Mimi Rogers made out with a little hottie named Rachel Nichols.\n\nThe most notable thing about Nichols, other than her being very attractive, is that she's in the new Bruce Campbell film \"The Woods\" which is currently in post production.\n\nApart from that \"Dumb and Dumberer\" can be summed up by the fact that I actually got up off my couch to remove this ultra-boring, ultra-unfunny piece of cinematic spam from the DVD player.\n\nPS: I did put it back in to check the not-so 'Special Features', but I did not find the apology I was looking for.\n\nMaybe it's an 'Easter Egg'.\n\nI don't recommend checking yourselves, but if someone finds it, please let me know. I feel it's owed to me."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "safaritom",
        "review_rating": "10",
        "review_title": "Give credit where credit is due.",
        "review_detailed_main": "I think those that give this movie such horrible ratings have no sense of true artistry. The plot was fine... simple. Look at the plot of the original - plain and simple.\n\nThe acting was stellar. Harry and Lloyd could not have been portrayed any better. The actors did a stand up performance, incredible. They deserve to be recognized for this...\n\nThe movie was great, at its core it was about a fanatical friendship, which is what the world needs more of.\n\nI give the movie 2 thumbs up, way up.\n\nJoel Schumacher"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "cstover-28468",
        "review_rating": "6",
        "review_title": "Actually not that bad, Far better than the sequel",
        "review_detailed_main": "People judge this movie too harshly because it's a prequel to a beloved movie. Yes, the original Dumb & Dumber is far better. Of course it is. No one expected this movie to surpass the original. I honestly think they did a pretty good job. A good number of jokes landed for me and the actors did a great job of portraying what I think a young Harry and Lloyd would act like. They do a better job playing the characters and the actual same actors did in the sequel \"Dumb and Dumber To\". This movie is way better than that one in my opinion.\n\nOverall, not nearly as bad as people say and deserves more credit. 6/10."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "bellygod",
        "review_rating": "1",
        "review_title": "Unfunny Ripoff",
        "review_detailed_main": "Words fail to express my dismay at having wasted a half hour of my life on this film. If it seems unfair to review a movie based on only watching it 30 minutes, excuse me, but how about the unfairness of duping viewers into thinking they're gonna see the sequel to 'dumb and dumber' which was a FUNNY film, with this bait and switch trash? You've got two (to me) unknown, and sadly, unfunny actors replacing the demented and dumb, yet humorous originals Jim Carrey and Jeff Daniels. Then you get a story going nowhere My half hour was spent without a single chuckle; I might have moaned once or twice from indigestion. I couldn't stomach watching any more; I felt I was gonna hurl.\n\nThis is one of the worst sequels of all time."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Ladiezman911",
        "review_rating": "",
        "review_title": "Painfully bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "I only saw this in order to see as many of IMDB's Bottom 100 as possible....and it IS annoying!",
        "review_detailed_main": "I have a weird obsession....to see all of IMDB's Bottom 100---the one hundred lowest rated major release films of all time. Unfortunately, I'll probably never complete the list, as a couple of the remaining films are Turkish and one is German...and it's highly unlikely they'll bother captioning films hated this much by the audiences. For me, \"Dumb and Dumberer: When Harry Met Lloyd\" is the 95th film I've seen...a dubious accomplishment, I know.\n\nThe original \"Dumb and Dumber\" was a silly but mildly enjoyable film (I just rewatched it). And, the studio came up with a brilliant idea....since they couldn't get Jeff Daniels and Jim Carrey for a sequel (or, more likely they didn't want to PAY them for a sequel), they made a prequel with unknown actors playing the leads. The fans were NOT amused.\n\nThe story begins long before \"Dumb and Dumber\" and near the very beginning, Harry and Lloyd* bump into each other for the first time. Soon they are buddies and soon the pair are assigned to the school's new fake special needs class. This is because the evil principal (Eugene Levy....who is just too good for films like this) wants to create a fake special needs class to get additional funding...which he can embezzle. Instead of a real classroom, it's in a shed and the lunch lady is in charge....and soon Harry and Lloyd sign up several other students for the class. Will the Principal be able to get away with this case of fraud?\n\nSo is any of this funny? Not especially. Mostly it's annoying and occasionally offensive (such as how they deal with mental disabilities as well as the MANY sexist jokes). This isn't too surprising since it is on the list AND the original folks who made the film had nothing to do with this project. However, it's not among the very worst films I've seen and I think it made the list mostly because compared to the original film it was an unfunny abomination.\n\n*FYI, the actors appear to be about 25...a bit old for high school. But a lot of the 'students' in the movie appear to be quite old as well."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "christian123",
        "review_rating": "2",
        "review_title": "The Most Unnecessary Movie Of 2003",
        "review_detailed_main": "Dumb and Dumberer: When Harry Met Lloyd is really just a dumb comedy, the only problem is that it isn't funny. It's the first day of high school and Harry, who previously has been home schooled by his mother, needs someone to show him the ropes. Lloyd, who lives in the school's basement with his adoptive dad/school custodian Ray, turns out to be just the guy. They unknowingly fall into the web of the corrupt Principal Collins and his girlfriend, head lunch lady Ms. Heller, who want them to be the first students in a phony \"special needs\" class in order to bilk $100,000 in grant money for themselves. Harry and Lloyd go out to look for more students for this new class, they catch the attention of Jessica Matthews, a hard-hitting reporter for the school's newspaper, who suspects foul play. The plot sounds like it has some potential but the execution is very bad. This has to be the most pointless film of 2003 and one of the least funniest as well. Most of the jokes just fall flat and apparently the filmmakers weren't trying at all. I can see now why Jim Carrey and Jeff Daniels backed out of this one. They are replaced by Eric Christian Olsen and Derek Richardson. Derek and Eric both play their roles dumb, they just try to hard most of the time and aren't funny. Eugene Levy is embarrassingly bad and this has to be his worst film ever. Mimi Roger's role is small but its nice to see her on screen. She is also one of the few saving graces in this film. The rest of the cast is mostly unfunny except for Bob Saget who does have some funny moments. Troy Miller does a poor job of directing and writing as he didn't seem to really put a lot effort in. People are defending this film, saying that you can't take every film seriously. I wasn't taking this film seriously and it still wasn't very funny. There might had been a laugh here or there but that's it. The original was fine and didn't need a prequel to explain what happened before and this film just ruins the original. The running time is also a good thing as its only 82 minutes long though sometimes it feels longer. Is this film better then the original? No, not even close and this comedy should be forgotten. In the end, this film is not worth the time or money to watch and its better if you just skip this. Rating 3.3/10, rent the original instead."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "CodyB488",
        "review_rating": "5",
        "review_title": "I give it a 3/5. Nowhere near as great as its predecessor, but still a decent movie.",
        "review_detailed_main": "First off, I have to say that Dumb and Dumber is one of my all-time favorite films. I've seen it countless times and it's just as funny as it was the day I first saw it. That being said, I was delighted to hear that a prequel was going into development in late 2002. The fact that Carrey and Daniels were not returning was a bit upsetting at first, but the fact that it takes place in 1986 would just make them feel out of place and I was more than willing to give new actors a chance. After the official trailer, people bashed the flick relentlessly, vowing never to watch it because it looked like pure s*** and nothing more. I, on the hand, couldn't wait until June 13th.\n\nI was there opening day, and I have to say this is, hands down, the funniest film I've seen in a long time. There were a few nods and references to the original, and Derek Richardson and Eric Olsen really perfected the parts of Harry and Lloyd. Everyone seemed to love the Bob Saget cameo, myself included. Funny, funny stuff.\n\nThere were a couple of major problems, however. First of all, there are anachronistic errors littered throughout, the music being the most distracting. Artists like Vanilla Ice and Good Charlotte certainly were not around in '86. Another problem is the editing. Test audiences weren't big fans of this film, as it was trimmed down from 115 minutes to 82 minutes. Luis Guzman and Mimi Rogers had decent-sized roles, but in the final product their presence was just about wasted. They even went as far as to delete a musical number and scenes from Lloyd's childhood (i.e. how he eventually came to live with Ray).\n\nBut, despite being historically incorrect and having major editing issues, the film was still full of laughs and ends up being an enjoyable way to spend an hour and twenty minutes."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Senorls",
        "review_rating": "1",
        "review_title": "Absolutely foul",
        "review_detailed_main": "I love gross and vulgar movies. I love bad movies that have some redeeming\n\nvalue. I will keep this brief--avoid AT ALL COSTS!!!!! I don't recall ever seeing anything as worthless as this. Everybody below has said it in one way or another. No need to repeat them except to WARN YOU NOT TO SEE THIS MOVIE!!!!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mjw2305",
        "review_rating": "3",
        "review_title": "As if you needed another Warning",
        "review_detailed_main": "I'll start with the good points or should i say point. so here it is, the people cast in the roles of Harry and Lloyd (I forget their names) do actually mimic some elements of the great Jim Carrey and Jeff Daniels; and for the first ten minutes or so you could be forgiven for thinking the film might get better.\n\nOK now for the bad, i'll keep it simple. The story is weak, the gags are infrequent, very tired and they just aren't funny. The majority of the cast are awful, and the title of the movie describes the director and producer more than it links this rubbish to the original Dumb and Dumber.\n\nNuff Said\n\nUnless your younger than 8 years old, avoid this movie\n\nA lame 3/10 (it only scored this high because my son enjoyed it, he's out grown it now though at age 9)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "El_Guapo9",
        "review_rating": "1",
        "review_title": "Well, it definitely is Dumb",
        "review_detailed_main": "While this film's predecessor is not exactly the height of cinematic achievement, it blows Dumb and Dumberer: When Harry Met Lloyd right out of the water. Sure, they were able to find some guy who looks like Jim Carrey to play Lloyd, but they weren't able to make any semblance of a movie out of this mess.\n\nBob Saget steals the show in this movie, and he only has a maximum of two minutes of screen time. Eugene Levy is completely wasted in this film as corny joke is followed by corny joke and laughs can't even be forced to follow them.\n\nIf I had to sum this movie up in one word, it would be quite simple: Terrible.\n\n1 out of 10."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "CodyB488",
        "review_rating": "5",
        "review_title": "I give it a 3/5. Nowhere near as great as its predecessor, but still a decent movie.",
        "review_detailed_main": "First off, I have to say that Dumb and Dumber is one of my all-time favorite films. I've seen it countless times and it's just as funny as it was the day I first saw it. That being said, I was delighted to hear that a prequel was going into development in late 2002. The fact that Carrey and Daniels were not returning was a bit upsetting at first, but the fact that it takes place in 1986 would just make them feel out of place and I was more than willing to give new actors a chance. After the official trailer, people bashed the flick relentlessly, vowing never to watch it because it looked like pure shit and nothing more. I, on the hand, couldn't wait until June 13th.\n\nI was there opening day, and I have to say this is, hands down, the funniest film I've seen in a long time. There were a few nods and references to the original, and Derek Richardson and Eric Olsen really perfected the parts of Harry and Lloyd. Everyone seemed to love the Bob Saget cameo, myself included. Funny, funny stuff.\n\nThere were a couple of major problems, however. First of all, there are anachronistic errors littered throughout, the music being the most distracting. Artists like Vanilla Ice and Good Charlotte certainly were not around in '86. Another problem is the editing. Test audiences weren't big fans of this film, as it was trimmed down from 115 minutes to 82 minutes. Luis Guzman and Mimi Rogers had decent-sized roles, but in the final product their presence was just about wasted. They even went as far as to delete a musical number and scenes from Lloyd's childhood (i.e. how he eventually came to live with Ray).\n\nBut, despite being historically incorrect and having major editing issues, the film was still full of laughs and ends up being an enjoyable way to spend an hour and twenty minutes."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "scruffycub2-1",
        "review_rating": "10",
        "review_title": "What were you expecting?",
        "review_detailed_main": "Boy, people have sure been knocking this movie. I personally, thought it was hilarious. I loved it. I don't know what other people were expecting, I mean, glance at the title. If people are looking for intellectual stimulation and a subject for discussion at their next Mensa meeting, then no...this movie would not be for them. Derek Richardson and Eric Christian Olsen did a great job. They both had their work cut out for them, and they came through."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "zitajohann",
        "review_rating": "6",
        "review_title": "I can't lie... I just watched this and laughed alot",
        "review_detailed_main": "Make no mistake, this is no masterpiece of comedy, its not even really a great movie but it is a funny dumb comedy. I put it off for almost 20 years because I just couldnt bring myself to watch it, and I think giving it years of space benefitted it for me. The two leads did their jobs well, especially Lloyd Christmas and the gags genuinely made me laugh (the Cyrano bit with the chocolate bar was really funny). Even some of the side characters were good (Bob Saget, Cheri Oteri, Shia Labeouf, Eugene Levy). Watch it if you want to give it a chance. If you're attached to the original in a blindly loyal way do not bother."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "wcwsux",
        "review_rating": "1",
        "review_title": "Embarrassing",
        "review_detailed_main": "I could not even finish even watching this so called movie just for the mere embarrassment I felt for watching it. The only laughter experienced was the laughter of my own disbelief that this tripe was actually accepted by Hollywood and transformed into a prequel of arguably one of the greatest comedies of the 90's. No original comedy, no plot, no character development, nothing that could even be considered comedy. All of the members who participated in this movie should be ashamed, for they tainted a classic.\n\nDo not watch. Watch the original again if you have to. Just avoid at all costs.\n\n0/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "krbalko",
        "review_rating": "",
        "review_title": "Sucks!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "themessiah1988",
        "review_rating": "1",
        "review_title": "The Worst Film Of All Time!!!",
        "review_detailed_main": "Before you consider renting this horrific sequel to the classic movie \"Dumb and Dumber\", please, by all means, think again.\n\nI call this the worst film of all time because, well, it just is. The acting is terrible, the plot is horrendously absurd and predictable, and it is just not uplifting to watch. Probably the absolute worst aspect of this movie is how it tries to be funny. I'm not kidding when I say that Harry and Lloyd produce absolutely no humorous line, joke, or action in this entire film. If there was one god-forsaken reason to watch this movie, it could be either that you are under six years old, enjoy Eugene Levy's acting abilities, or are stoned out of your mind. Other than that, there is no point in viewing this movie, which should have never been made, and should have absolutely no connections to the fabulous \"Dumb and Dumber.\" Please, join my quest in getting this terrible movie back into the bottom 100, where it should achieve its rightful #1 spot some day soon."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "bljk_15",
        "review_rating": "1",
        "review_title": "Not as funny as it looked.",
        "review_detailed_main": "When I first saw the preview of this film I thought whenever I had the chance I would buy it and watch it. This movie thankfully, is not as GROSS as Me, Myself & Irene, that movie was much worse than this. I just think trying to make another film connecting to the original (Dumb & Dumber) which I have to admit was a lot funnier than this. I gave that movie a \"7\". But this is just DUMB. The humor is sort of crude but it's not too too bad, but it's not funny either. I have to say this was not what I expected it to be. I expected it to be good but I was wrong. After watching it repeatedly I could already guess the user rating it has. (3.3/10) Even though this film is not obscene well, at least not really,it just has to be a waste. I mean in this film their stupider than they are in the other one, and plus they're not even funny. They're just plain stupid. Don't waste your on this film, buy the first one. You'll enjoy that one much more than this one. Rating-\"1\""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Sandcooler",
        "review_rating": "1",
        "review_title": "Wha?",
        "review_detailed_main": "There's plenty of terrible comedy around, but I've never ever seen anything quite like this before. It presents itself as some kind of prequel to \"Dumb & Dumber\", but it doesn't really get into that because it's so busy being insanely bad. It's not by any of the makers of the first one (clearly), and all the actors are new, but there is a guy with brown hair and a guy with blonde hair so there you go, it's a prequel to \"Dumb & Dumber\". Only problem is, the guys in that movie looked pretty dumb but at the same time sympathetic, and you wanted good things to happen to them. The guys in this one look like they've just peed their pants. Like, all the time. The only direction the actors got must have been like, stare blankly into space and be loud and annoying and high-pitched. I can't remember any jokes in this entire movie, I suppose there were some but I have blocked them from my mind. Well, there is one scene that comes to mind, in which the low-budget Jim Carrey sits in a hot tub and farts. Sounds promising, no? I've witnessed comedy's rock bottom. It wasn't pretty."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "floridanate",
        "review_rating": "1",
        "review_title": "Why are some people allowed to write?",
        "review_detailed_main": "Writing credits (WGA) Peter Farrelly (characters) & Bennett Yellin (characters) & Bobby Farrelly (characters)\n\nRobert Brener (story)\n\nRobert Brener (screenplay) and Troy Miller (screenplay)\n\nSomewhere along this line, somebody made a big mistake. This was the crappiest thing ever, and a HUGE HUGE HUGE insult to the original. I felt bad for the two lead actors, who made a valiant and admirable effort, in vain."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "wayofthecass",
        "review_rating": "3",
        "review_title": "Badly Made: Poorly Conceived: Has 1 funny scene!",
        "review_detailed_main": "One of those films that will astound you in that it actually got made. The script and direction here are poor and some of the 'comedic' performances are non-existent. But then again dialogue wise nobody has really anything to work with. The first film was made on the basis of a strong script. This sorry mess is made simply on the basis of a 'good' idea (that being lets cash in on the first one).\n\nThe studio probably commissioned this after seeing only a treatment or maybe even just a pitch which probably went something like \"Dumb and Dumber made a lot of money. Lets make another one\". If that's the case then they should have got some performers who are good at improvisation but alas.\n\nTo the film itself.....the leads do a good impersonation of Carey and Daniels but lack the comedic flair and material. It must have been a tough job I admit but the Loyd Christmas character struggles to get any laughs at all. The Harry take-off fairs better though. The one scene in the film which had me laughing was set in the school babe's house when she invites Harry round for dinner. But this was about the only one which had the whole audience, or indeed even part of it, going. It involved some pretty base toilet humour but in this movie you take the chuckles where you can. As for the plot. What can I say?! Its a prequel to the aforementioned original set during the terrible twosome's school years. And really that's about as much info as you need in terms of the character's motivations.\n\nIn regards to the other more notable cast members present here Eugene Levy stole the show in 'American Pie' but most of his scenes here stink of being painfully under-written. He almost looks embarrassed to be in it. Also the rest of the kids in the special needs class just ain't funny. For a start they don't actually do anything and when they do get screen time they are about as charismatic as a career stoner. And when we find out that the Asian foreign exchange student is actually American the general reaction is not laughter but more wondering 'Who is she again?' I don't know why Mimi Rogers and Luis Guzman are in this. Their roles are small and uninteresting. I think that's meant to be the joke. Ha, Ha. Also that Loyd's dad(Guzman) is an Hispanic for some unexplained reason. Wacky! The role that must get the most criticism though is that of the store clerk. This guy's timing and general acting, if you could call it that, are just terrible. He stinks the house out . I can only imagine that they found him on the street and were unlucky to uncover America's worst performer. I mean what kind of audition , if any, did he go through for this? He has a gratingly monotone voice and a face you would like to hit.\n\nIn summary: you can see 90% of the laughs coming and when they do come they ain't funny; the ending has huge plot holes in it that are never explained(I know. I may have taken it a bit too seriously) and even the out-takes struggle to raise a snigger. The film has the same poor pacing and direction of 'Dude.Where's my car?' but is even less funny than that piece of $h!t. 3/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "heebyjeeby-1",
        "review_rating": "2",
        "review_title": "wow.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "saint405",
        "review_rating": "2",
        "review_title": "Not even Bob Saget saying the 'S' word can save this load of crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dentontotg",
        "review_rating": "10",
        "review_title": "Not that bad",
        "review_detailed_main": "It is tough living up to D&D I so you have to take this money for what it is, a brave attempt to relive the first one. Do they pull it off? Kind of. It is worth the money to go see this if you don't take yourself too seriously.\n\nI think that the people that made this movie are having the last laugh, it will go over $30 million by the end of next week. For a movie, any movie, to bring in $30 million bucks on about a $15 million dollar budget is a coup. After this is all said and dumb with the DVD sales and the HBO licensing this movie will make a cool $50 million bucks profit, easily.\n\nStop taking yourselves too seriously, go watch a stupid movie and laugh your ass off. Hell, if we can sit through a funny movie, maybe we can all lighten up a little in these way too serious world."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "MovieAddict2016",
        "review_rating": "6",
        "review_title": "Not nearly as bad as I was expecting it to be - but then again, not nearly as good as it could have been, either.",
        "review_detailed_main": "Want to hear something funny? I laughed at \"Dumb and Dumberer: When Harry Met Lloyd.\" In fact, at about four scenes I was rolling over in laughter. And not just me -- people in front of and behind me were roaring in laughter, too.\n\nIt's not a good movie. But I have seen far worse. Yes, the movie is filmed in the distinct style of a bad movie. It has a bad script. Most of its jokes are bad. It's essentially a bad movie. But it's not awful. And when I left, I had a smile on my face, because I had expected a depressing comedy and I got a goofy, good-natured one with a few good gags and a lot of good spirit. In its essence, it is quite easy to watch and -- perhaps -- just a little bit fun.\n\nI say this not out of prior prejudice, as much as I may have enjoyed the first installment, but out of surprise, because I expected it to give a bad name to the first film, \"Dumb and Dumber\" (1994). I read all the bad reviews before going into \"Dumb and Dumberer.\" I didn't expect to laugh a single minute time, and I expected it to be a pale imitation of its predecessor.\n\nI did laugh. Not much, but I did. And it's not a pale imitation of the first film--it isn't nearly as solid in direction (thanks to the absence of the Farrelly Brothers), but this is a good thing. I don't think it wanted to try to be like the first film, because it knew that it couldn't be and never would be. So it's just a sappy little 90-minute movie with a few good gags and a notably convincing portrayal of a younger Jim Carrey (or Lloyd Christmas) from Eric Christian Olsen. His face is often contorted with an arched eyebrow. To those who said he didn't look like Jim Carrey: Shame on you. He's even got the movements and physical gestures down pat.\n\nIt's 1986. Lloyd (Olsen) lives with his stepfather (Luis Guzman), the local high school janitor. Rushing to catch the bus for school one day, he turns around a corner and (literally) bumps into Harry Dunne (Derek Richardson), a homeschooler whose first day of school begins on that very day. Lloyd gets his tooth chipped when they bump into each other and immediately they are best pals.\n\nAs Lloyd shows Harry the ropes at school, Principal Collins (Eugene Levy) sets up a \"special needs\" program at the school as a way of cheating his way to a 100,000 dollar grant from a pay program, which -- unbeknownst to him -- is all just an FBI sting. The cafeteria cook (Chery Oteri), who is also Collins' lover, plays teacher to Harry, Lloyd and a band of other \"special\" kids. Meanwhile, Harry and Lloyd's friendship starts to blossom.\n\nYou want to know the scene that had my hysterically laughing in this film? It's the most juvenile scene in the entire movie, and I know this, but it was great. Bob Saget (\"Full House\") plays the uptight father of Jessica, Harry's wannabe love interest. Invited to dinner at their house, Harry accidentally spreads melted chocolate all over the bathroom wall. After leaving, Saget walks in and sees it, completely freaks out, and starts to curse up a storm. Let's just say that he thinks it is something other than chocolate covering his bathroom.\n\nI cherish \"Dumb and Dumber,\" the original, because I find its buddies lovable and its goofiness contagious. I am a big fan of the buddy movie sub genre, specifically the Odd Couple stuff. \"Dumb and Dumberer\" is not in its league. It's too childish, too crude, too immature, too plain stupid. But y'know what? It sure is a lot dumber than the first film. Perhaps even dumberer. Like I said above, after reading the negative press about this film I really expected a shameless cash-in on the original. In a way, that's what I got. But I admire this film's spirit. It knows it's nothing great. And it didn't harm me, despite all its crude humor and childish jokes. In a way, it's almost admirable because the director, Troy Miller, managed to create a film that plastered a goofy little grin on my face without disgusting me like \"Daddy Day Care\" did, a \"family\" comedy minus the laughs. This one works, in an odd sort of way. And, for once, a film title lives up to its name. This movie is certainly dumberer than the first.\n\nNote: I seem to be praising this film. I'm not. It is merely a mediocre comedy. I withhold its flaws in my review specifically because it surprised me very much and, despite being an undoubtedly bad movie, I don't necessarily find it harmful in any way, shape or form. It's a goofy little comedy with a smaller heart than the first but a heart nevertheless. I give it a bad rating because it trips more than it succeeds. But I will add a disclaimer to this review: It's not as bad as you think...and you may be surprised. This film puts a small little smile on your face."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "chubbydave",
        "review_rating": "1",
        "review_title": "Among the Worse Movies Ever",
        "review_detailed_main": "This was one of the worse movies I've ever seen. I can't think right now of a movie that was worse. I did not laugh once during this movie. It's a cheap insult to the movie going public. You saw the first Dumb and Dumber, and that was funny. I was laughing so hard during the bathroom scene that I was worried I would hurt myself. So after having seen the first one, you gotta go see the sequel, and the movie executives know this. They knew that just the title alone would fill a lot of seats, and they made absolutely no effort to make a decent movie.\n\nThroughout the movie I sat there. The lady I was with wanted to walk out. I paid $7 for myself and another $7 for her, and I'll be doggoned if I wasn't going to get at least one laugh out of it. I sat through the whole movie hoping that I would get at least a chuckle. After the first few minutes I knew I wasn't going to get a laugh worth $14, but I at least wanted something for that kind of bread. I didn't get it. I never laughed once. When I came out, not only was I disappointed but my lady friend was angry with me. I don't know what they could have done to make this movie worse."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "JesusFreak36",
        "review_rating": "",
        "review_title": "Awful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jonny07326",
        "review_rating": "1",
        "review_title": "Why are Jim Carrey classics always ruined?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "paulyestermonky",
        "review_rating": "1",
        "review_title": "If I could go back in time, I would stop the production of this movie at all costs!!!!",
        "review_detailed_main": "This movie was a complete disgrace!!! I would give this movie a 0 but that is not a number in the scale!!!! How could they ruin such a classic!!! I really don't understand how people could take one of the greatest movies of all time and put it to shame. FIrst of all, if you watch Dumb and Dumber, the amazing original, you would realize Lloyd and Harry have known each other since elementary school, NOT high school. And what the **** was up with Lloyd's father being a Spanish janitor?????? I was So confused! This \"movie\" (if it can even be called a movie) had a horrible plot, horrible acting, and it was just down right not funny. I was actually sobbing to see such a classic movie like Dumb and Dumber being demolished into oblivion! This movie is not even worth watching for free!!!! This movie is a complete waste of time!!! DO NOT WATCH THIS MOVIE!!! Trust me on movies!!! i am a huge fan of movies and i know what i am talking about when i criticize movies!!! If you read my other comments after watching the movies i commented, you will agree!!! Do Not Watch This Movie!!!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "smirre44",
        "review_rating": "1",
        "review_title": "Oh no...",
        "review_detailed_main": "It really was as bad as I predicted... Unfunny and devoid of the whackyness the first movie was endowed with through rubber-face Jim Carreys antics.\n\nI stopped watching some time into the movie. (never bothered to check how long it kept me watching) This turkey (and it's a big one) really deserves its place in the bottom 100 movie list. And I hope it stays there too."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mwendel",
        "review_rating": "2",
        "review_title": "Just Dumb",
        "review_detailed_main": "This movie is just dumb. I mean the actors themselves are actually quite good, but the story line development is lame. Character development direction is virtually non-existent. The lines are poorly crafted that even people with the most juvenile sense of humor will cringe in pain as each line is delivered. I forced myself through the whole film to ensure I was not judging a book by its cover, but with the exception of a few rare moments this movie is surely one that you will want to forget. This a movie should have been left on the shelf. Don't feel like you've missed anything if you haven't seen this one."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dinojerome",
        "review_rating": "1",
        "review_title": "Worst Movie Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "ckhosra1",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": "I loved Dumb and Dumber with a passion. All of my jokes came from that movie and I still say them even today. So when I saw the trailer in the theatres with Harry and Lloyd just laughing, before they said what movie it was I was jumping up and down in my seat I already knew! So I was excited the whole summer, then saw the movie, and it just stunk. If you want to watch this movie because of the original, forget it...it's not worth it. I will give the new movie another shot and see if it's still as bad or not, but I expect it will still suck. There were some funny parts, the bus was great. Bob saget and the American Pie dad were cool too. The guys who played Harry and Lloyd did a good job with their characters, but the movie just wasn't good and not all that funny"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "BigPsycho",
        "review_rating": "1",
        "review_title": "Sets the standards",
        "review_detailed_main": "Hard to believe this movie fell out of the worst 100. It is by far one of the worst 5 movies I have ever seen. I might argue it is the worst. I didn't make it past 45 minutes. Other movies are equally as bad but at least I made it thru them...this one I could not. IMDb has a problem too many juveniles stuffing the boxes for movies they have not seen. THis movie was in the bottom 100 not that long ago. Believe me it belongs there.\n\nSo IMDb says I need to write at least 10 line for this review to count. Why was this movie ever made? It was made years after the original and none of the original actors appear here. Totally pointless and all I can say is I am proud I never saw it in the theater or spent a sent to watch it."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jaclynleem",
        "review_rating": "10",
        "review_title": "Stupid but funny !",
        "review_detailed_main": "All the negative reviews of this movie are from small minded boring people who obviously don't understand the humor in the film lol The movie is definitely stupid/goofy type humor but is funny if you have a good sense of humor & are able to understand jokes that normally go over peoples heads."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "brodie6",
        "review_rating": "7",
        "review_title": "A Funny Movie",
        "review_detailed_main": "Having read the reviews prior to seeing this movie I was expecting the worst. There are quite a few bad reviews. I was pleasantly surprised though. I watched it with my 10 year old kid and we both laughed heartily at a lot of the scenes. It was exactly as the title implies DUMB, which is what made it so funny. It was stupid, good stupid. If you don't compare to it to the original it stands on it's on own as a decent film. The pranks and jokes are quick and well... funny. I know there a lot of people who really hated this film and generally I agree with the majority on when a film is not good. This time I must disagree. It was very entertaining. Watch it with a kid and you'll enjoy it even more. Oh one thing in closing, Bob Saget did get a little annoying with the S word one too many times. It was funny the first 5 times but lost it."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "wickedmonster2002",
        "review_rating": "1",
        "review_title": "Blatantly Stupid!",
        "review_detailed_main": "i couldn't get through the first 20 minutes of it. Its forced comedy with poor punchlines that becomes pure torture to a persons mind. This should have been rated the Worst movie of all time, bar none (including Gigli)!\n\nPerhaps if they starred the original cast, maybe it would have brought justice to the whole prequel idea. These two wannabes just try TOO hard to be in their predecessors shoes. But they don't fit in at all.\n\nAgain, i repeat, AVOID AT ALL COSTS!\n\nGood thing i didn't waste much of my time watching this movie neither did i waste my money on it. I'd rather be listening to David Letterman's cheesy musicals than bear another minute of this crap of a movie.\n\nWM"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Eyes_of_Emerald",
        "review_rating": "",
        "review_title": "Stupid and Stupidest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jimkiser",
        "review_rating": "2",
        "review_title": "\"This is the suckiest bunch of sucks that ever sucked.\"",
        "review_detailed_main": "If you liked \"Dumb & Dumber,\" then you will HATE THIS MOVIE!!! It is horrible!!! I cannot stress this fact enough. I have to admit that I giggled a few times, but the script was bad, the characters were bad, and the story line was so bad that at one point I couldn't figure out if there was even a plot. They try to do some \"Dumb & Dumber\" call-backs with a few lines, but it all failed. Don't waste your time, your money, or your disk space for this sad excuse for a comedy."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Rob_Taylor",
        "review_rating": "3",
        "review_title": "The title says it all...",
        "review_detailed_main": "Let's face it, if you went into a restaurant and ordered a sh*t sandwich and got precisely that, could you honestly complain about what you got?\n\nDumb and Dumberer is precisely that. The title sums it up and you really shouldn't expect anything other than rubbish when you sit down to watch it.\n\nThat said, I am surprised to see it in the bottom 100 of IMDb's lists. It is bad, but I'm sure there are many films far above it that deserve its place at the bottom much, much more.\n\nDumb and Dumberer could never hope to compete with its predecessor but its no worse really than any other teen-comedy-high-school nonsense. If the original movie had not been made, then this one wouldn't have gotten anywhere near the bad press it has. But, alas, it was not to be, and so this film will slip into obscurity like many ill-conceived sequels, destined to be forgotten, or talked about with ill-disguised scorn when reminiscing over the original movie.\n\nThe best way to watch this film (if you have to at all) is to try and forget the characters Jim Carrey and Jeff Daniels made their own, and view it as if that first film had never happened. Also, console yourself whilst watching that there are a few bloopers tacked onto the end that are the comedic highlight of this unfunny movie, although its really not worth watching the film just for them. You might then get some enjoyment out of an otherwise bland film.\n\nIn summary then, its bad but not really deserving a place in the worst 100 of IMDb."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "cousyrules1",
        "review_rating": "1",
        "review_title": "Not even a smile..",
        "review_detailed_main": "This has to be one of the worst comedies i have ever seen. Not only were the jokes unfunny, but the movie was so boring. When I saw that none of the Farrely brothers had directed this, i knew i was in for a disaster, and i was right.\n\nThe first and best \"Dumb and Dumber\" got me laughing so hard i pooped a little. Now this movie so good because the acting, the directing, and improvisation. This remains to be the best comedy i have ever seen, next to \"Theres something about Mary\" I officially hate \"Dumb and Dumberer\" They should never have remade it, and this director should be shot.\n\nThankyou for reading this."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "acquiredsense",
        "review_rating": "3",
        "review_title": "Not a sequel but still has its moments",
        "review_detailed_main": "I don't really disagree with the bad comments except that I don't think it was as bad as people are stating.\n\nThe original is obviously a different movie because it was original, and even undertaking this movie was a difficult task.\n\nAlso, they tried to use jokes from the original to tie it in I guess (\"i like it a LOTT\") but not even one of them worked.\n\nThe things I did like were the original jokes with the other characters. I did laugh at the mascot guy, and some of the interactions between the characters were original.\n\nBut again, my expectations were very, very low when I watched it and I also watched it at 4 AM so I might be biased.\n\nBut I know a horribly unoriginal movie when I see one and they definitely tried to add an original flair to this, which is funny at times.\n\nI would say it's about 25% as engaging as the original."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "rainbow_man23",
        "review_rating": "1",
        "review_title": "Weak follow up to the 1994 hit",
        "review_detailed_main": "A poor dialogue in this prequel.The actors did a good job imitating Jim Carey and Jeff Daniels, but the story itself is really bad.Some laughs but for a limited time. At least the first one had a funny story. I think they shouldn't have done a second movie who ruined the image of the first one.\n\nI saw this movie in july 2003 but i had the chance to see it again in 2006 on TV and it was worse from watching it in a movie theater.At least in a theater you cant sleep. I really felt like sleeping because its not enjoyable at all. I gave this a 3 just not to destroy the actors future...Good luck"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "maschoemaker",
        "review_rating": "1",
        "review_title": "It just isn't funny!",
        "review_detailed_main": "It doesn't happen a lot that a movie is really awful, but this is everything! It just isn't funny! The physical comedy is totally ridiculous! How hard Eric Christian Olsen and Derek Richardson try, there getting more embarrassing every minute. There is no way they can replace unthankfully replaced Jim Carrey and Jeff Daniels. The harder they try, the worse it gets. Also the story is nothing. Even a children's movie has got a more intelligent story line than this film. Dumb and Dumber are such a great characters. As well as in the previous real movie as in the cartoon. Unfortunately, they really don't take advantage of it, because the movie is even dumber than the characters.\n\nSo only watch this movie if you are really (and I mean REALLY) bored! Else: don't even bother to think about it! That's why I rate is 1/10."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "shutupnow1212",
        "review_rating": "1",
        "review_title": "Are you serious?",
        "review_detailed_main": "Whoever made this movie is a degenerative member of society. To take an amazing concept and destroy it must be an appealing task for the \"idealists\" that created this abomination of a sequel, but I was more disappointed with this movie than any other that I have seen. The reason for this is that I felt that \"Dumb and Dumber\", the original, was the absolute hands-down funniest movie I have EVER seen in my life. This movie, however, I would rank along with something like \"The Hot Chick\"... It's a movie that tried to be funny, but fell too far into the commercial grasp. Additionally, I was surprised as to how many recycled jokes were attempted... and failed miserably. This movie is terrible."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mattster-61157",
        "review_rating": "10",
        "review_title": "HILARIOUS AND AWESOME PREQUEL/GREAT SOUNDTRACK",
        "review_detailed_main": "I dk why so many bad reviewS?? I usually do not do reviews but after seeing the rating i feel like i want to give this movie props. It is one of the funnier movies ive ever seen. It Definetley top 50 all time comedies for me. The actors do a marvelous job acting like harry and Lloyd. The 2 actors do such a great job acting like jim carrey(Lloyd) and jeff daniels (Harry) and impersonating lloyd n harry from the 1st dumb and dumber. I think it's hilarious. A cult classic to me, especially if you like the dumb n dumber movieS. I encourage you to watch n choose for yourself. This movie also has a great soundtrack in my mind. Great film all around!! You gotaa remember that is harry and lloyd. Their character's are kind dumb lol.... Actors act/ portray themselves just like jeff daniels and jim carrey. Priceless classic!!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "madmagician",
        "review_rating": "6",
        "review_title": "Almost better than the original!!!",
        "review_detailed_main": "I went to see a sneak preview of this movie just yesterday, and the audience, including myself loved it. Yes, it sounds like I'm on crack but I really liked this one just as much as the first. Maybe it was Bob Saget from Full House cussing up a storm, but I thought this movie was great. I also liked the way that the actors they got to play Harry and Lloyd looked like the original actors. I won't spoil the scenes for you, but I would strongly suggest that if you liked the first one, to go see this one. The preview audience I was with was basically rolling in the aisles laughing."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "kevcoop7",
        "review_rating": "2",
        "review_title": "Stay Away",
        "review_detailed_main": "To be honest, I have completely forgotten about this movie, in two ways, I forgot what it was about, and that it even exists.\n\nDumb and Dumberer: When Harry met Lloyd is a sad excuse to cash in on the very highly successful and well liked Dumb and Dumber.\n\nI applaud Jeff Daniels and Jim Carrey for not appearing or even involving themselves with this movie in the slightest sense.\n\nThis is one movie I liked the first time I saw it, and then when I watched it again, it was so stupid, and I have never watched it again, in effect, I have only watched this movie exactly twice, and that is far too many. heck, even one viewing is far too many viewing."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "thomasvis222",
        "review_rating": "",
        "review_title": "Dumb and \"dumberer\" indeed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "tangoviudo",
        "review_rating": "1",
        "review_title": "An Obscenity",
        "review_detailed_main": "This film is obscene for any number of reasons, but mainly because it took two marvelous comedic creations (Harry & Lloyd) and maligned them by suggesting they are both gay and retarded. The genius of the Farrelly Brothers' characters is that, while not particularly bright (and who doesn't know people like that?), Harry & Lloyd's friendship is both touching and funny. In this prequel, it is sad and disgraceful. This is too bad since so many obvious comedic talents are wasted - Eugene Levy, Cheri Oteri, and Bob Saget particularly (although it was a treat to hear squeaky-clean Saget screaming \"Sh*t!\" over and over - in outtakes he tries the word \"poop\" instead, but it isn't nearly as funny). When Harry Met Lloyd deserved so much better than this. I've often wished the Farrellys would make a sequel to \"Dumb and Dumber\". How about \"Dumbing Down\" - with Harry & Lloyd in Washington? Or should that be called \"Dumb and Dubya\"?"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "abbazabakyleman-98834",
        "review_rating": "3",
        "review_title": "An Underwhelming Sequel With One Saving Grace",
        "review_detailed_main": "This has got to be the worst sequel for a movie I've ever seen. Nobody asked for it, but we got it thanks to New Line, who used it as just a cash-in. The basic premise has Lloyd and Harry first meeting in high school in 1986 as part of a special-needs class. The only funny thing about the film is the presence of Bob Saget, who plays the stuffy, put-upon father of the love interest that Lloyd and Harry both have eyes for and his character hates any form of fecal matter. If it wasn't for Saget's appearance, this score would be limited to one star and I'm being generous."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "brian71283",
        "review_rating": "1",
        "review_title": "A new low...",
        "review_detailed_main": "I cannot believe I paid what I paid to see this movie! I feel dumb and dumberer after watching it. If it wasn't for the beautiful Rachel Nichols I think I would have walked out. This girl could be good if she had someone ACTING with her in the movie... unlike Dumb and Dumberer. This movie rates up there as one of the stupidest movies I have seen in my life. DON'T WASTE YOUR TIME! GO SEE SOMETHING ELSE!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "view_and_review",
        "review_rating": "5",
        "review_title": "not Dumb and Dumber but not bad",
        "review_detailed_main": "Granted the plot was not as good as Dumb and Dumber, nor were the jokes, but it was watchable. I don't think that the younger Harry and Lloyd had quite the chemistry as the older two did, but they made it work. I must say that I was impressed with the acting jobs of Eric Christian Olsen (Lloyd) and Derek Richardson (Harry), they did a heck of a job emulating Jim Carey and Jeff Daniels.\n\nThere were flashes of comedic brilliance throughout the movie making it very reminiscent of its predecessor, but there were just too many weak points. I think the weakness came from the lack of a fixed goal for Harry and Lloyd. In Dumb and Dumber you knew that their purpose was to deliver a briefcase to a woman in Aspen Colorado, so no matter what happened throughout the movie you knew what they were trying to accomplish. In Dumb and Dumberer they don't have a similar fixed goal.\n\nThe movie was not worth my $8 but it was good enough for an average rating, nothing less."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "p-braham",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "The best thing about this film is the title, and I'm not saying it's a good title.\n\nAs a sequel to a funny film it had a duty to be funny if only to avoid accusations of cashing in on the franchise. However, it is a hideous disappointment. It's so bad it's embarrassing. There isn't a single laugh in it. I feel sorry for the people who went to see it because they liked Dumb & Dumber - I imagine it left a bitter taste in quite a few mouths.\n\nThe makers must have known it was going to bomb so hard, which makes me wonder how it ever got released. I can only imagine that it was a cynical attempt to make some easy money."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "johnymutton",
        "review_rating": "4",
        "review_title": "Well, that wasn't very good now was it?",
        "review_detailed_main": "I loved Dumb and Dumber, I own it, gave it a 10 in the imdb database and have probably watched it 15 times or more.\n\nWhen I first saw the trailer for Dumb and Dumberer, I raised my hands in the air and said \"YES!\"\n\nUnfortunately, after my viewing today, all I could say was \"Well, that wasn't very good now was it?\"\n\nThere are so many things wrong with this film, I can't even start to list them, but the one that bugged me the most was probably the way that they took many of the lines from the first movie and tried to incorporate them in the prequel. Usually this incorporation was either wrong or poorly timed. Granted the one good line from the film \"Chicks are for fags\" is kinda funny, they tried to use it twice, since there were so few other lines that were memorable. Maybe the next best line was Bob Sagget's tirade of \"You got poo all over my car\" and \"You got poo all over my bathroom.\"\n\nAs a huge fan of the first film, I am glad I saw this film, but it was so bad that I had to come home and watch the original another time to make up for it.\n\nI don't plan on buying this film on DVD, but I will probably watch it again when it comes on cable.\n\nIf you do need to see this film, see it at the matinee, at least save yourself a few bucks.\n\nThe best thing about it was Eric Christian Olsen. He did a very good job imitating Jim Carey, and I predict that he has a nice future ahead of him in either films or comedy skits."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "tankace",
        "review_rating": "3",
        "review_title": "A crime against comedies",
        "review_detailed_main": "I really hate this movie for a number of reasons, which I will tell you right now. At first It is not funny at all, its humour is to stupid for even a 10 year old child. I know that the first dumb and dumber hasn't the most original nor the cleverest comedic quotes or scenes,but at list the fun is not force and when you laugh its real. Secondary the characters are not likable at all, they are horrible people who if you meet you would try your best afterwords to forget that they exist at all.Lastly the directing is ,for a lack of a better world ,awful. In conclusion here dear readers we have a prime example of a film which was made in order to steal money of the audience using a previous hit as a starting point for a possible cash cow of a franchise, likely the film-goes were smarter than that and the film failed big time."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "coldplay030277",
        "review_rating": "10",
        "review_title": "This movie is awesome",
        "review_detailed_main": "I thought this movie was great and Eric and Derek did great jobs playing the characters. They are both very good looking as well. I hope everyone that sees this enjoys it because its good. And if you dont like it, then you can go away and not say bad things about it. Great job to all of the people who worked on this movie. its my favorite movie at the moment. :-D"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Amityville15",
        "review_rating": "6",
        "review_title": "The evolution of dumb...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "StevePulaski",
        "review_rating": "2",
        "review_title": "Dumb as Can Possibly Be",
        "review_detailed_main": "This movie flat out sucks. There's no other, smart guy way to put it. Its horrible. Its the worst prequel I've ever seen, the jokes are pure, raw slapstick in it's lowest possible form, and the two leads may look like Jim Carrey and Jeff Daniels, but there's no way in hell they could pull it off like they did in 1994. Also, if you're going to make a prequel, set in 1986, use stuff in 1986. We see new dollar bills and the most fatal flaw is the song \"Ice Ice Baby\" by Vanilla Ice. The song came out in 1990 and this is set in 1986. Sense? Nada. This movie was clearly rushed, not thought over properly, and serves no purpose.\n\nLets begin with the cover for the DVD. If you closely at Lloyds tooth it is clear that the left corner is just drawn with Sharpie marker or some dry erase marker to look as if it was missing. Nothing says a movie is worse than when the cover doesn't even look believable. A poor entrance to a poor movie. Fits perfectly.\n\nBefore Harry and Lloyd where the best of dumb buddies, they were in high school struggling to make the grade. Now we get to the moment they first met by bumping heads. Harry was homeschooled and is now attending regular school. Upon meeting Lloyd whom gives him a half assed tour of the school, they now become the best of friends and are inseparable. After a class opens called \"The Special Needs\" class, Harry and Lloyd are asked to get people to attend. A good girl Jessica finds out why the lunch lady would be teaching a class and she soon discovers that the principal and the teacher for the fake Specials class are stealing money from the school and it's now up to Harry, Lloyd, and Jessica to stop them.\n\nSince the movie is supposed to be focused on the stupid characters of Harry and Lloyd, I shouldn't say this, but need to. It gets incredibly aggravating because the stupidity of the characters makes the movie move in a slow pace and even though its a mere 86 minutes it feels way longer. Harry and Lloyd are portrayed as stupid beyond belief. There's no way anyone in the world could be this stupid and not be mentally challenged. Its an insult.\n\nI too find it absolutely hilarious that the cameo appearance by Bob Saget is funnier than the two leads in the movie. Bob Saget's cameo is nowhere near as funny to earn this movie an extra star, but its damn sure funny to earn it probably the most memorable thing about this movie. Julia Duffy doesn't do much in the movie, but I remember her as Mrs. Hayfer in Drake & Josh. Those will be the only two people who I cite as a \"decent job done\" in this movie. Eugene Levy is awful in this movie and so are the actors who portray Harry and Lloyd. Luis Guzmán also does a poor job in this as well.\n\nI thought I'd approach this film with an open mind and have a decent attitude and relate it to something me and my friend do. I like a lot of stupid movies like Bio-Dome, but this just completely blew my mind. From the DVD menu gags to the \"Dont press this button\" joke on there as well I knew this movie was going to be no more than two stars if they found burping and farting to be the most hilarious joke on the planet. Sure enough I was right. Worst prequel to any movie and awful movie all together.\n\nStarring: Eric Christian Olsen, Derek Richardson, Rachel Nichols, Bob Saget, Luis Guzmán, Eugene Levy, and Mimi Rogers."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "bkshortie22",
        "review_rating": "",
        "review_title": "An Aptly titled movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "brendenhows",
        "review_rating": "1",
        "review_title": "Very BAD Movie and nothing like the first one!!!",
        "review_detailed_main": "This movie is so bad that the only thing good about it is that you can use it as a Frisbee! NOTHING like the first one, the actors are TERRIBLE (and resemble something totally different from the first) and everything about the movie was bad. Who made this movie 10 year olds? The plot is all over the place once Harry and Lloyd are doing something one minute and another minute they are doing something totally different. And when I was watching the movie I did not conceive what the conflict was about throughout the whole film! This whole movie was a total waste of electricity watching it! Once you have made a very funny and original movie, don't make another one."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Hollywood_Yoda",
        "review_rating": "5",
        "review_title": "Wow...I Can't Believe This was Made",
        "review_detailed_main": "This film, a prequel to the 1994 hit Dumb and Dumber is a travesty of the film world. The title, I will admit is somewhat funny, but that's about all the funny you'll get. It's a play on the 1989 film, When Harry Met Sally. The only recognizable actor in the film is Eugene Levy, none of the others are memorable.\n\nThe story is ridiculous, nothing at all like the film it's based on (which had a solid script). The writers and director of this train wreck rely on making fun of the less fortunate and mentally challenged. The only connection the Farrelly brothers have is that they created th characters of Lloyd and Harry. It's hard to believe they allowed this film to see the light of day!\n\nDumb and Dumberer is honestly the stupidest film of the 2000s decade. If you really want to see this, it's probably available at your local Walmart in the cheap dvd bin."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "hell-of-a-place-for-a-ba",
        "review_rating": "3",
        "review_title": "Stupid with no plot",
        "review_detailed_main": "This film had too be one of the most unnecessary, pointless(and plot less for that matter)films I have ever seen.\n\nWith the other Dumb and Dumber being so successful I thought I would go along to see what this one was like.I was so disappointed. It has no plot and basically drags on for a while.\n\nI did not even laugh once but crindged at the cheesy jokes and cliché phrases. I could have made a better movie myself. Some parts were mildly amusing like the polar bear suit and the woman suit.\n\nI found the end totally off the point but Eugene levy did play Pricipal Collins quite well even though at some points his acting was quite wooden.\n\nA good enough shot but wouldn't buy it on DVD * 3 / 1 0"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Zingbot_9000",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "Why did they make this? Why did I attempt to watch this? Why did I expect more?\n\nThis movie was total garbage. I liked the original too.\n\nWhat you get with this movie is a script that is not funny and young actors doing impressions of Jim Carrey and Jeff Daniels.\n\nI was really tested to make it threw the movie. And I failed. Just couldn't do it. I made it 45 minutes.\n\nLucky me for not renting this movie - my step-son did and i burrowed it. I asked my stepson before watching this one what he thought and he said it was ok but not funny. Should have gotten the clue.\n\nAfter watching the first 45 minutes I said ENOUGH and decided to watch the extra features. I'd get more background on why this movie was made and get clips of the parts I didn't watch. The funniest parts were supposed to be in the beginning - of which I saw and didn't laugh. A part where both characters play tag in a 7-11 type store and those same characters drinking a slurpee and getting brain freeze. Horrible, Horrible, Horrible. What has become of todays comedy? It's all about cheap humor and is so unoriginal.\n\nSo back to the extra features, the people who made this movie in the extra features acted like they had somekind of comedic masterpiece here. They say they were looking for people who were funny and just didn't do impressions. Well all you get here is impersonations that were not funny.\n\nI've wasted enough time here on this one. My review is to hopefully save others from watching this. Please, don't even rent this one if you know what is good for you - it's in the bottom 100 for a reason. That's it - goal achieved."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "TheFatManNotJake",
        "review_rating": "1",
        "review_title": "If I've had a worse time, I don't remember when",
        "review_detailed_main": "I am a laughing kind of guy. I laugh at the dentist's office, in the ER, and sometimes I even laugh on the toilet. I went through an eternity of Harry and Lloyd; I think I may have chuckled once. This is a movie that should be lauded in some way as being the ultimate pain that $8 can buy. I loved the original Dumb & Dumber; I will even say Ace Ventura has its moments. This movie is a soulless, macabre piece of celluloid through which evil incarnates itself. Oh, and I hope everyone involved in its making suffers from horrible cases of: diarrhea, herpes, and possibly gout."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "David-427",
        "review_rating": "2",
        "review_title": "I.e. Director & Writer",
        "review_detailed_main": "The actors playing Harry and Lloyd gave it a good effort but the script, other acting talent and plot were diabolical. 84 minutes of my life has passed, 82 minutes of it in mispent optimism, don't repeat my mistake ... apart from Mimi Rogers' french kiss!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dioloveabel",
        "review_rating": "1",
        "review_title": "Read this review..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "psychoferret96",
        "review_rating": "10",
        "review_title": "Impressive!",
        "review_detailed_main": "I saw Dumb and Dumberer on opening night. I entered the theater with a highly skeptical attitude toward this prequel to a classic movie that I love for its total randomness, stupid hilarity and countless other details Jim Carrey and Jeff Daniels brought to the part. The movie began with some of the most terrifically horrible ads I've ever seen in my life, and I was losing hope for this movie rapidly if this was how they were going to front the audience before playing it. And then it began...and I was extremely impressed! The actors sincerely looked and acted like teenage versions of they're predecessors, and as such a great on screen team the laughs never subsided when Lloyd and Harry were in the scene.\n\nI found only a few faults that would irritate the average movie-goer and criticizer of this movie, as they bugged me ever since I left the theater. One is that Lloyd, Jim Carrey's old part, is very controlling of Harry and is a 'jerk' the majority of the way through the movie, which really got on my nerves. In addition, Harry seemed too laid back and just let Lloyd treat him somewhat negatively. Also, there was almost no plot line! In the first 1994 movie there was an ultimate goal, a reason for the movie. In this prequel, there was one but it seemed as though New Line Cinema Stuck it in there just for spite. Thirdly, they didn't film it in the same way as the first! In Dumb and Dumber, every place the characters went, several funny things happened there that the viewer remembered later as the 'Cafe scene' or the 'beer scene'...In Dumb and DumberER, each clipping was significantly shorter, leaving the audience to figure out later what happened or why something occured, which is, in truth, an insanely poor movie-making technique that irritates.\n\nBesides those problems, however, and despite this movie being very different than its well-loved predecessor,it's hilarious! Many parts I found myself not able to breathe from laughing so hard, and maybe you need to be a teenager as I am to fully comprehend the jokes, but it was hilarious in its own way. This is a movie you'll want to take your crew of friends to and laugh at all the sickening stupidity and overall dumbererness of the first adventures, when Harry met Lloyd. I was impressed as it excelled past the standards I set for this flick, and maybe you will think so as well. Give it a try and go see it! An 8 out of 10 stars. Fantastically humorous and, well..dumb!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "DarylJGittings",
        "review_rating": "6",
        "review_title": "Much better than it's reputation!",
        "review_detailed_main": "If you keep your expectations in check this is a decent prequel. No, it doesn't have Jim Carrey or Jeff Daniels, but Derek Richardson and Eric Christian Olsen do a good of portraying Lloyd and Harry during their high school years.\n\nA crooked high principal (Eugene Levy) and the lunch lady (Cheri Oteri) have a plan to bilk the school out of a large some of money. In order to pull the scam off they need to put together a special needs class. They enlist Harry and Lloyd to pick the other students for the special class. Another student Jessica, who writes for the school newspaper is suspicious of this new special needs class and aims to get to the bottom of what exactly is going on with the help of Lloyd and Harry.\n\nI think people dog on this movie because of how popular the original Dumb and Dumber is. This isn't in the same league, but all things considered it's a fairly decent film with some good laughs. There's a couple of humorous scenes with Bob Saget. I recommend this over Dumb and Dumber To."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "solidgameboy12-1",
        "review_rating": "2",
        "review_title": "Why this movie does not work.",
        "review_detailed_main": "It is very strange that when I read the user reviews of this site, so few actually talk about why the movie is so bad. Well, I'd like to take a moment to say why I didn't, and in better detail than most, hopefully, enjoy the movie.\n\nDumb and Dumberer is a prequel, which if the word \"sequel\" is of any indication, means it is a continuation from the first. Well, \"Prequel\" implies it as a \"beginning of\" story, sort of what happened in the childhoods of Harry and Lloyd, who were originally played by Jeff Daniels and Jim Carrey, respectively.\n\nThe characters in the story are Harry and Lloyd, two simple minded teenagers, who lack any real charm or clever idiocy that was played so well in the original. The idea in this movie is that the principal, played by the legendary Eugene Levy (Jim's Dad in American Pie and most of its sequels) is trying to find a get rich quick scheme, so he develops a special needs class to make the money, but he needs students.\n\nIf that part of the plot doesn't offend you, don't worry, the rest will.\n\nHarry and Lloyd go on a search to find kids who are just like them, (although its so insulting to think special needs kids can't tell an Asian girl from a mentally handicapped child) and needless to say, a class is formed.\n\nJessica, a very smart teenage girl (which only implies the entire school isn't smart enough to recognize this plot) sees the ruse, and uses our heroes to dig up the dirt on the principal.\n\nTo be honest, if the movie didn't have the \"Dumb and Dumber\" moniker or even a mentioning of Harry and Lloyd, this movie probably would have faded into obscurity, nary, even been made, and if it did, it might have been a cult classic if it had been better written and not as relying on the first movie's jokes.\n\nThe movie has some references to the original picture, but the problem is that references aren't usually funny. So when this movie references the laxative from the original as a large truck carrying said product, it doesn't make it funny, you are just implying that you watched the movie enough to notice it.\n\nThe problem with this movie is just lazy writing. The creators probably thought watching enough of the original was a good idea to create a sequel, but what it does is insult anyone who tries really hard to write good comedy with insulting retreads from classic movies.\n\nHarry and Lloyd aren't some kind of smart, they are all kinds of moron. In the original, it is implied they aren't smart, but in reality, it's that their ideas of intelligence is slightly askew from most people, but it was mostly honest mistakes. Lloyd hearing the country Austria and playing it off as Australia is believable, and more than likely a mistake a person has made before, as opposed to say, talking about who Benjamin Franklin is (Where Lloyd explains that Ben Franklin was the \"Pilgrim who invented Penicillin and defeated Godzilla\").\n\nCritics and most writers will tell you that was is usually funny isn't funny, it's what you play off as serious that's funny. The characters aren't serious people doing funny things, they are played off as funny people doing funny things, and that doesn't always equal funny.\n\nThe actors seem rather detached from the project, as if they all simultaneously had a large bill to pay, so they played their appropriate roles just to pay it off to do better movies. It was strange that from the years 2003 and 2005, people thought that making sequels to previous Jim Carrey movies was to be cinematic gold, was actually just copper painted up and advertised as gold.\n\nIt is always going to be argued that sequels are never better than their original counterparts, and that's understandable, only so many movies have that bragging right. That doesn't mean if you have an idea for a sequel and you feel strongly in making a sequel that you have to do it poorly in every means possible: in writing, in acting, in character development, music, staffing, ETC. It should be room to improve. A sequel, in particular, a prequel should challenge the audience to see how the characters became who they are when we remember them, not putting them in a less than original story.\n\nThis concludes my review, I give it a 2/10."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "MJBujold4431",
        "review_rating": "",
        "review_title": "Far and Away the Worst Movie I've Seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "crisuslan",
        "review_rating": "1",
        "review_title": "There is a difference between dumb and very stupid.",
        "review_detailed_main": "Bad, and tasteless comedy that makes Jim Carry look like a comic genius in comparison, and makes the Farrelly. brothers look like prestige directors of tast. Every thing that can go wrong with this film goes wrong, and it's not even funny.\n\nKeep a way and rent the original."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "zardoz-13",
        "review_rating": "1",
        "review_title": "Bum & Bummer!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mohaawx",
        "review_rating": "1",
        "review_title": "Utter bilge but better than the first",
        "review_detailed_main": "From the trailers, it would appear as though this movie was better than the first. It was but it was also a complete pile of crap as expected from such an undertaking. With terrible acting, no story, horrible jokes, toilet humor and utterly disgusting events, this movie is something that should have priority on everyone's avoid list. The two guys playing with each other like children is not funny nor cute nor dumb. They look more like gay lovers by the way it is crudely portrayed in this movie. This movie should be in the bottom 100 and I don't know why its not? Easily one of the worst movies ever made. Don't fall for the commercials and torture yourself by seeing this movie. Avoid at all costs."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mdsegalo",
        "review_rating": "1",
        "review_title": "terrible",
        "review_detailed_main": "This movie was a sacrilegious follow up to the original. It should have never been created without the original cast. The lines are terrible and who ever wrote the movie tried to take all of the one liners in the first one and put them in the second on. Dont bother wasting your time or money on this piece of trash."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "bgjunkacct",
        "review_rating": "1",
        "review_title": "This movie was SO BAD, I wanted to buy all the copies to BURN THEM!",
        "review_detailed_main": "In short? This movie is absolutely terrible. The plot line is terrible, the actors are terrible. When I watched it, I thought to myself \"Why in the heck did I pay $6.00 to see this? As mentioned in my title, this movie is SO BAD, that I would love to buy every copy in existence just to burn them. I think one of the parts of the movie I hated the most was when they called the Asian girl \"Ching Chong\". Really? I know Asian people that saw the movie, and were highly offended at the fact that they would even fathom calling an Asian person \"Ching Chong\". However, there was one good part in the movie (The only good part)... Bob Saget and the \"There's SH** EVERYWHERE! Ordeal. Best part of the whole movie. For those that want to see it, don't bother... it's not even worth it if it's in the $1 bin at Dollar Tree."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "cuckingfunt",
        "review_rating": "1",
        "review_title": "Crap, crap CRAP!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "udeaasykle",
        "review_rating": "3",
        "review_title": "Not a very good movie, at all!",
        "review_detailed_main": "I didn't have high hopes for this movie and i was right about that. I absolutely love dumb & dumber so i was really dissapointed when i saw this. It is like they are not even trying to make a good movie. Just put in two new actors and make them try to act like Jim Carrey and Jeff Daniels. And allthough Eric Christian Olsen sounds like Jim Carrey's Lloyd Christmas sometimes, it is not enough to save the movie."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "xyle666-236-135213",
        "review_rating": "8",
        "review_title": "Not as bad as it seems",
        "review_detailed_main": "I know that the movie is not the best of well, anything, but if you go into it knowing that, you may enjoy it. It's beyond ridiculous and they tried waaay to hard to make it the cringiest experience you've ever had, but in all honesty I loved it. It probably helps that I saw the original dumb and dumber when it was in theaters at least 7 times since it was my favorite movie hands down back then (I think I was 11 or 12) and in my eyes at the time Jim Carey could do no wrong. While the reviews really aren't too positive about it, I really do recommend watching it at least once to make up your own mind."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Denpon",
        "review_rating": "6",
        "review_title": "What Is This?... Not Worth Seeing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "FilmFanInTheHouse",
        "review_rating": "4",
        "review_title": "Very Childish and Disappointing!",
        "review_detailed_main": "Dumb and Dumberer: When Harry Met Lloyd (2003, Dir. Troy Miller)\n\nIt's the 80's, and it's the moment that Lloyd Christmas and Harry Dunne meet. The two individuals are seen by many as 'special', and become best friends as soon as they meet. Principal Collins and his lover, the lunch lady, Ms. Heller want to make as much money out of scams, and their next idea is to create a special needs class. Ms. Heller is the teacher, and they have assigned Harry and Lloyd to round the special students up. School News Reporter Jessica is suspicious though, and desperately tries to find out the truth, even if it means gaining Harry and Lloyd's help.\n\nOK, where do i start? If you was a huge fan of 'Dumb and Dumber' then i advise you to stay clear from this. If you liked the original, and is just interested in what the prequel contains, then don't go into this viewing with high hopes. To sum up this film is one word, i would use 'bad'. Just plain bad. The main problem with this film is the jokes. There is a story but only a very basic story, and the jokes are focused on innuendos, which sounds as if they were written by 12 year old's. Although some of us might have been 12 when the original film came out, we would definitely not be 12 now. Innuendos jokes just does not make a film good, especially when the innuendos jokes aren't even that good. The acting is OK. There impersonations of Harry and Lloyd are not exactly perfect, but they do a good job. The rest of the cast are OK. Seeing Eugene Levy and Cheri Oteri in a scene together, did actually make me chuckle a little, but Eugene Levy should have known better to pick a role like this. There are the few other good appearances from stars such as Shia LaBeouf, Mimi Rogers and Lin Shaye. Still, if i was you, i would only watch it for the performance of a specific actor.\n\n\"Come on out, you little b******.\" - Doctor (Timothy Stack)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Bruce_Lee_the_Dragon",
        "review_rating": "",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "emilie8605",
        "review_rating": "4",
        "review_title": "what were they thinking?",
        "review_detailed_main": "what on earth were the people thinking when they made this one? the movie had few (and when i say few i mean like one or two, nothing higher than a 3) funny moments that only lasted a minute to me and that was all. i had a whole movie store and i pick one of the dumbest movies ever. they should have made one with jim carrey and jeff daniels and saw what happened after the 1st one, not go back and mess it up! I can picture the title Dumb and Stoopid and having lloyd and harry meet someone not as dumb but not like a genius and have them get married or something. i would have rather seen that then dumb and dumberer. but i give the guys that played them from back in the day credit for at least looking like lloyd and harry. (D D-)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "charliegeeza",
        "review_rating": "2",
        "review_title": "A major let down - awful script and thoughtless directing",
        "review_detailed_main": "I was a big fan of the original. I think I laughed more at it's mindless humour than I did at any other movie I can recall. Admittedly, I was 12 at the time, but have seen it more recently in my adult years and was still highly entertained.\n\nSo I was looking forward to this. The trailer promised more of the mindless action provided by the first film and the characters Harry and Lloyd looked well cast.\n\nThat was where the positives ended really. As well cast as Harry and Lloyd were - Eric Christian Olsen was excellent and true to Jim Carrey's original portrayl of Lloyd - there is nothing they could do to rescue a diabolical script and storyline.\n\nPart of the humour of the first was that only Harry and Lloyd were that ridiculously idiotic. They were misunderstood by a believable world. This was part of the strength of the first, which allowed for an excellent story line and some near-water inducing situations. But such clever circumstances are left well behind in this prequel.\n\nEverybody is an idiot in this movie and that immediately impacts on the humour potential. If anything, the poor and corny quips from the supporting cast detract from the movie. Ms. Heller (Cheri Oteri) comes across as even more stupid than the two main characters. Such ridiculous but plot-centric concepts as Principal Collins (Eugene Levy) keeping all the evidence of his crimes, needed to bury him in jail for life, baffle the mind for their awful stupidity. Even the funnier moments wear out quickly - somebody can only think chocolate is poo for so long.\n\nPerhaps I'm doing this movie a disservice, but I'm not. There are a few laughs, however they are few and far between. The plot is substandard. There are none of the classic settings, for Lloyd and Harry to create carnage in, that were in abundance in the first movie. The directing is poor and misses many things (like the 90s cars and songs in a movie set in 1986).\n\nThis calamity of a prequel is no fault of the actors. Most of the major characters do as well as could be expected with what is just a lame script. Even the end of movie 'girls in need' part is pathetic.\n\nThis movie was abysmal. The only reason it gets above a 0 is because Harry and Lloyd were well portrayed and managed to provide an occasional laugh despite the script/director's best attempts. You'd have to be seriously devoid of comedy in your life to find this movie funny.\n\nIt just doesn't belong in the same video store as the original. 1/5."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "elefzonot",
        "review_rating": "2",
        "review_title": "What a terrible movie!!! god!!",
        "review_detailed_main": "After the huge success of \"Dumb & Dumber\" (which i liked very much!!)with Jim Carrey and Jeff Daniels.. somebody wanted to ride the \"wave of money\" again and made \"Dumb and Dumberer: When Harry Met Lloyd\"..oh what a mistake!!! This movie is not even near to the hilarious original one. The new actors of the movie are a lame copy of the previous ones, the plot is stupid and most of all not funny at all!!! Why the hell did this movie came out at the first place!!! And why i lost a very important hour and a half of my life on this moronic movie!!!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "InsaneWerewolf80",
        "review_rating": "3",
        "review_title": "Stupid Movie",
        "review_detailed_main": "This movie was not really that good. First, it lacked Jim Carey, and b/c of this I don't think that the comedy was as funny. The movie actually discourages me to go see another D&D movie if it was created. For, the most part the movie included more stupidity than comedy."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "WintersTale",
        "review_rating": "2",
        "review_title": "Skip it",
        "review_detailed_main": "Being a huge Dumb and Dumber fan, I checked this movie out anticipating mediocraty. It met my expectations alright. The movie is not the same without Carrey, Daniels and Farrelley Bros. D'uh, we knew that. But what makes the movie even worse is the writing. It was one of the most poorly written, thrown together for profit piece of trash ever. The jokes were recycled, the acting left much desired for(with the exception of Richardson), and even Eugene Levy's part wasn't funny. Levy is a great actor who can be very funny and this movie didn't utilize his talent at all. They made the characters appear to be retarded instead of just dumb (what's so funny about that!?), they made Lloyd come off gay which he wasn't in the original. Lloyd's dad was ridiculous and not in the good way.\n\nTo make up for jokes, talent and creativity, they inserted music montages throughout using footage you JUST saw 5-10 min earlier. This movie has nothing to do with Dumb and Dumber. It's completely terrible and not worth seeing. I'm angry that they tried to franchise the coolest movie ever into this rubbish. Thumbs down."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "FilmFan19",
        "review_rating": "3",
        "review_title": "Stop with the prequels, already",
        "review_detailed_main": "This was, as far as I can remember, the least funny movie I have ever seen. Although I avoid the movies that I know will be lousy, like \"Kangaroo Jack\" and junk like \"From Justin to Kelly\", I really blew it with this one. The first movie had the strength of the comedic legend Jim Carrey, whereas this one has only two established actors, and they are playing the 'villians'. There was basically no story, and the only part that I laughed at was a scene where Bob Saget makes a cameo. Most of the movie even followed the structure of the first, including the ending! This certainly ranks as the most unnecessary prequel ever made. Now I know why Jeff Daniels and Jim Carrey stayed away from this project. A definite candidate for the worst movie of the year."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "nette_loves_jesus",
        "review_rating": "1",
        "review_title": "I must have been dumb to have paid to watch that",
        "review_detailed_main": "Do I have to be DUMB to enjoy this movie? I am very upset and it was a waist of my sixteen dollars. I really think that the movie was a rip off only to make money. It is said I am struct by that show It wasnt funny it was stupid"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "otherotherside88",
        "review_rating": "10",
        "review_title": "ONE FUNNY ASS MOVIE!",
        "review_detailed_main": "Oh man I have never laughed so hard in my life! That movie was the GREATEST! I couldn't stop kicking the chair in front of me, thank god there was no one in it! I began to tear! Both actors chosen for Harry and Lloyd did fantastic jobs and I don't think any other cast could've been better!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "empress-5",
        "review_rating": "7",
        "review_title": "If you loved the original, you'll hate this; if you didn't like the original, this will seem kinda cute",
        "review_detailed_main": "The starring actors, who had some big shoes to fill, were excellent as both their characters and portraying the original actors. There were some genuinely funny lines. The plot needed strengthening and there were some extremely tiresome bits, but this movie is not at all as bad or as worthy of hatred as some of the comments and reviews would lead one to believe. It isn't a Farrelly Brothers comedy, it isn't a Jim Carrey comedy. As a light-hearted teen stoner comedy, it's cute. But if you're expecting the unique type of humor the Farrellys and Carrey are famous for, you'll be disappointed simply because this just isn't them. If it stood alone as summer fluff, there would have been a lot of fans who genuinely enjoyed it. Leave your preconceptions behind. Go into it with an open mind and without expecting a cinematic masterpiece, and you'll get some laughs."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "random_avenger",
        "review_rating": "3",
        "review_title": "Dumb and Dumberer",
        "review_detailed_main": "The prequel to the 1994 comedy hit Dumb & Dumber is set in 1986 when Harry Dunne and Lloyd Christmas (Derek Richardson and Eric Christian Olsen) were in high school. Due to their tremendously stupid behaviour they are put in a special education class that the school's principal Collins (Eugene Levy) has created in order to embezzle the money meant for advancing the special students' rights. The shady actions of the principal are being investigated by a smart but good-looking student named Jessica (Rachel Nichols), who also evokes feelings in both Harry and Lloyd.\n\nAs Dumb and Dumberer is a prequel, it's only natural that neither Jim Carrey nor Jeff Daniels of the original movie reprises their roles. Instead, Richardson and Olsen try to emulate the original actors' styles, but since they haven't got the natural aura of comedy like Carrey and Daniels do, the result is just painfully unfunny. Both protagonists, especially Harry, are essentially retards whose constant yelling and bantering is nothing but irritating. Olsen's attempts of capturing Carrey's trademark facial expressions are probably the best thing about the performances, but that is a very, very faint praise. One can only wonder how a talented supporting actor like Luis Guzmán ended up in a movie like this.\n\nAs opposed to the road trip theme of Dumb & Dumber, the jokes in the prequel are largely based on tired high school stereotypes, so it must have been difficult to come up with anything we haven't already seen many times, if the writers ever even tried to achieve anything that ambitious. Plenty of sex jokes and toilet humour are also present, and while one gross-out scene actually is funny, the premise of the joke is essentially recycled from the first movie, raising even more questions about the point of this movie's existence. In addition, the film comes across as mocking and mean-spirited towards real-life special education students. As not even the blooper reel over the end credits is funny, Dumb and Dumberer seriously cannot be recommended to anyone but the most undemanding of comedy fans, if even them. The rest of us should just avoid it altogether."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "pitiful attempt to evoke laughter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "johnnyboyz",
        "review_rating": "3",
        "review_title": "Full and empty at the same time: Empty of humour and plot yet full of offence (amongst other things).",
        "review_detailed_main": "Going into this film, I thought it would be a little risky to make a prequel to a film entitled Dumb and Dumber; especially with the gap between films a whole nine years. The reason I thought it'd be risky is because the recent spate of sequels, prequels, remakes and so forth hasn't exactly been a success story so another helping to two misfits in their younger years in a film entitled Dumb and Dumberer: When Harry Met Lloyd could've been a disaster.\n\nIt's probably been said before but few films actually come close to having their titles describe them - Dumb and Dumberer does this. Some other films that have done so could include Scary Movie (although that wasn't too scary) and Epic Movie (although by sounds of things, that wasn't too epic). One thing all these films have in common in the long run is that they're all failed comedies. Dumb and Dumberer isn't just a failed comedy; it's an insult to a number of things, one of which is us, the viewers. The reoccurring joke in Dumb and Dumberer is that of the mocking of people with disabilities or special needs. People who find it difficult to learn at the same speed or are 'below' the average when it comes to day to day skills are the overall butt of jokes in Dumb and Dumberer and it's difficult to watch at times. This is probably Dumb and Dumberer's biggest error.\n\nIt's not just people with disabilities that are targeted but they do get a pretty rough time. One person thinks Marco Polo invented the swimming pool; he also thinks George Washington invented money since the guy's face is all over it. But no: the crippled, the foreign and women in general are targeted in such a way; even mildly smirking at it could be considered a crime. A Chinese girl doesn't speak much English: she's special; a guy with a broken arm is useless: he's special and the way the women (the mother character, the female student Jessica and Principal Collins' (Levy) scenes with Ms. Heller (Oteri)) are treated is extremely disrespectful and sexist. Jessica (Nichols) is put across as a prize to be won but it later turns out she has a boyfriend and merely runs off to him whenever the situation calls for it, Ching Chong (Krusiec) despite having a ridiculous name eventually tells everyone she can speak English (why she kept it a secret, I don't know) but goes right back to submissive, dumb Chinese girl who \"don't speekee Inglish\" on a male's demand.\n\nThe film also lacks any sort of a story and thus; doesn't have that much conflict, it's just making fun of these different groups. Whatever conflict there is, is so watered down and weak, it's incredible. The Principal and a teacher want to stiff the school and its special needs department just so they can run off together to Hawaii; that's it. They conduct this evil scheme that just isn't really that evil; we realise they're not likable people but because you have no caring towards the people they're trying to stiff you don't really care. Although one or two situations arise that are funny such as the melted chocolate scene and the window exchange scene where Lloyd transports a convocation to Jessica through Harry who's actually talking to a stray dog, the bulk of the humour is either unfunny slapstick or of the racist/sexist/disabilities mocking variety.\n\nI wasn't really engaged by the film in fact I felt sorry for Harry and Lloyd more than anything and wanted them to succeed through pity than anything else. I really liked the way Derek Richardson and Eric Christian Olsen were made to look like Carrey and Daniels from the first film \u0096 that was impressive but this is real borderline trash with no laughs and pretty damned offensive material which will only encourage children to act against foreign people, girls and people with disabilities in a negative way should they see it."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "bibleboyiam",
        "review_rating": "1",
        "review_title": "This Movie Insults the Intelligence of 1st Graders",
        "review_detailed_main": "This movie was a complete pile of soggy sh*t! After sitting through the first 15 minutes of it I felt like I was back in the 1st grade when fart jokes and toilet humor ruled the day, but sadly this movie didn't even live up to the standards that I held when I was 6 years old. When I left the theater, there was a unanimous vibe coming from the audience that screamed \"I can't believe I just wasted 90 f***ing minutes and $8.75 on such a loathsome trash heap of a movie!!!!!!!!\" There is absolutely nothing worthy of praise here. I give it a 0/10, which means to avoid it even if a raving lunatic holds a gun to your head and proclaims that the only way to live is to watch this movie."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Antagonisten",
        "review_rating": "1",
        "review_title": "Something awful",
        "review_detailed_main": "Sequels is something that plagues the movie industry, today more than ever. Every successful movie must have a sequel it seems, and sometimes even not-so-successful movies get their share. Next to remakes, lame sequels is one of the worst things i know.\n\nRight from the start it's obvious that this movie has absolutely nothing to offer in way of comedy. I read in the trivia that most of the cast were chosen on the grounds that they were \"huge Dumb & Dumber fans\". I'm not surprised. This movie is simply put what you get if you lock a bunch of talentless retards in a room and loop Dumb & Dumber. We have a duo of \"actors\" (and i use the term loosely here) acting the parts Jim Carrey and Jeff Daniels had in the original. And watching them act is like seeing 10-year old kids in front of a mirror making faces and trying desperately to sound like their idols. Sure i have a laugh with my friends quoting movies, sure i sometimes say \"Like a glove!\" to myself when i park the car trying to sound like Jim Carrey... Most people do stuff like this. Most people however don't record it on film and try to sell it as a sequel to their favorite movies! Of course the biggest flaw is still not the crappy actors or the complete lack of comedy in both script and acting. Rather it's the complete lack of understanding for what made the first movie such a success. I know a lot of people who loathe silly comedy who still like \"Dumb & Dumber\". Why? Because the Farrelly brothers have an uncanny sense when it comes to making their oddball characters lovable in a strange way. There is a warmth in the portrayal even when they are at their most pathetic (or even twisted). Of course that is completely missing here, just like everything else that makes a movie good...\n\nEven though expectations were abysmally low this movie still managed to put them to shame. I rate this 1/10 since that is the lowest grade it's possible to give."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "richard-wheeler",
        "review_rating": "5",
        "review_title": "\"When Harry And Lloyd Met\".",
        "review_detailed_main": "Rhose Island, 1969. Harry Dunne (Derek Richardson)was born. It was so funny when he was about to be born, he bit the doctor. And the doctor said that Harry was a baby who liked to play hide and seek and he was a shy one! Eight years later, Harry had an imaginary friend named Captain Rob and the cops always had to save Rob from from the well in Harry's backyard! Ha! Ha! Ha! And ten years later, Harry's mother (Mimi Rogers) sent Harry and Rob on a treasure hunt. And that was, finding the school! Ha!Ha! Lloyd Christmas (Eric Christian Olsen), on the other hand was an adopted child and his father was a janitor of a school. And they together lived in the school.\n\nLloyed and Harry eventually bumped into each other and Lloyd chipped his tooth when they both went around a corner. Harry was running away from a Rot Veiler and Lloyd, however, was looking for the when in fact, he was living in the school! Lloyd had a bully named Turk (Elden Henson) was sure was a real thug! And Lloyd also met a girl named Jessica Mathika (Rachel Nichols). Lloyd and Harry , however, attended special classes which were in the school's cafeteria and was run by the Lunch Lady, Ms.Heller (Cheri Oteri). And Lloyd and Harry had to find students who were \"special\" like them.\n\nLloyd first got a boy with casts named Toby (Josh Braaten), Turk, Carl (William Lee Scott), who injured himself in a Football match, an exchange student named Ching Chong (Michelle Krusiec) and a half horse, half human boy named Lewis (Shia LaBoeuf). They were the \"Special Needs Class Of 1986\".\n\nThey had a kiff bus. It was so hilarious when Jessica was chasing \"The Special Needs Bus\" because, she thought it special. And then, the bus went flying into the air in slow motion and inside, everyone was screaming in a decreased tone. And then , when Jessica went flying into the air, she landed with a thud! Ha!Ha!Ha! It was funny when Harry was spending time with Jessica at her house, Harry thought Jessica was making him hot when in fact , it was the heater which he was sitting on which it making him hot! And then, he went to the bathroom and when he removed his hand from his back pocket, and he sniffed his hand due to it being covered in a brown substance. It was chocolate! Mmm! That is something lovely to snack on when you needed to. And when he removed the rest of the chocolate from his back pocket, he threw it up into the air and, it went everywhere! And he wasn't able to clean it up! Lol.\n\nI was so charmed when Lloyd was talking to a dog when he was outside Jessica's home. And Harry repeated after him: \"Oh, I remember you. How could I forget those hairy nipples?!\" And then Jessica's father, Mr.Walter (Bob Saget) entered the room, he asked Jessica why Harry was talking to Jessica like that. And Jessica said, \"It's because he's special\". Lol! And then! Mr.Walter entered the bathroom and yelled how harry didn't know how to use a toilet when it just chocolate everywhere.Ha!Ha!Ha!\n\nIt was hysterical to see Jessica take on Harry's mother. It was one of Lloyed's dreams about Harry's mom. And who would fall in love with Lloyd. And suddenly, Harry appeared and Harry was shocked to see it!! Lol! Another amusing moment was when Harry thought he found the treasure which he had been looking for all this time when in fact, it was a chest which belonged to Mr.Collins (Eugene Levy), the Headmaster of the school. Collins' chest had the scams. And soon, all the kids of \"The Special Class\" realized this was all a scam! So, to get Collins back, the gang created a huge version of Collins in pirate style and it spoke in Collins voice about his \"Grand Master Plan\". And it sure was the crime of the century! He was trying to make a run off with all the extra money he and Ms.Heller made with that \"Special Class\". The kids weren't even getting an education!\n\nNow, to end this review. I didn't mention all the other laughs in the movie because, they were all clichés and I am sure you would recognize where they got the ending for the movie. But anyways, the film still was fun with style. And you could see that they were even worse when they were kids! Ha!Ha!Ha!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Dumb and Dumberer: When Harry Met Lloyd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mmssrreez",
        "review_rating": "2",
        "review_title": "The Long Life Waiting",
        "review_detailed_main": "I've Spent one hour and a half waiting for the Storyline and it turns out that these 90 minutes are Supposed to be the Storyline.\n\nIt's soooooooo boring and useless."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "wdm1981",
        "review_rating": "10",
        "review_title": "Not a great movie, but good for a laugh or two",
        "review_detailed_main": "When i first heard that there was going to be another \"Dumb and Dumber\" movie, i was really excited, but then i heard that Jim Carrey and Jeff Danials would not be returning, so i figured, this ones gonna suck. So sitting down to watch it i was expecting the worse, but i was delightfully surprised when i found out this movie is actually good. Pretty much all the jokes are funny and there really isn't any sort of lull in the film, like the first one had. The story is simple and the characters are great. All the performances are really great, especially Eric Christian Olsen and Derek Richardson both a very good and pull off a young Harry and Lloyd very well, i found Richardson to get annoying after a while, but Olsen was dead on the entire movie, he is exactly how Jim Carrey used to be (before he left wacky comedies to do more dramas)This kid could be Carrey's son, and could probably pull off young versions of Ace Ventura and The Mask. I predict you'll be seeing more of Mr. Olsen in the future. The other actors in the film were also very good, but the one that stood out most was Eugine Levy, Man, is this guy hillarious or what, just seeing him makes me want to laugh, and he's particularly effective as the principal in the film.\n\nSo basically this isn't the greatest film ever made, but its also not the worst. It does what it sets out to do, which is to provide a few laughs for an hour and a half. If you loved the first then you should for sure check this one out\n\n7/10 stars"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "nrapny-01694",
        "review_rating": "7",
        "review_title": "Eric Christian Olsen nailed it",
        "review_detailed_main": "This movie isn't so bad. Its very entertaining. But most of all, Eric Christian Olsen plays Lloyd perfectly and his performance alone is worth the watch."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "XavierAngel69",
        "review_rating": "1",
        "review_title": "WORST MOVIE",
        "review_detailed_main": "This is the worst movie I have ever seen, besides 'Sugar and Spice'.\n\nThis was a complete waste of time, two hours of my life wasted. (It's okay though because I snuck into 'Dumb and Dumberer'. I can't believe people actually paid for this movie!)\n\nSome guy feel asleep in the theatre I was watching it and and began to snore. I, and the other people in the theatre thought that he was funnier than the movie! It was horrible-- the WORST experience I've ever had in theatres! This movie does not even come close to 'Dumb and Dumber'.\n\nIt seems that 'Dumb and Dumber' is a masterpiece compared to 'Dumberer'. I hated it and did not even laugh more than two times-- no exageration!\n\nNo one see this movie.\n\nI give it F."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "george.schmidt",
        "review_rating": "",
        "review_title": "Dumb-dee-dumb-dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dauitsone",
        "review_rating": "1",
        "review_title": "What. Was. This??",
        "review_detailed_main": "It's a shame you can't give negative ratings on imdb, because then this awful piece of crap \"movie\" would get a minus 10 from me.\n\nThis is possibly the worst movie ever made in the history of man.\n\nThe \"actors\" are so horrendous it's laughable. I realized that one of these shooting stars is also a main lead in the abomination of a movie \"Hostel\".\n\nReally makes you wonder who hires these bozos? Or who poures in millions of dollar into these projects?\n\nDo not, I repeat do NOT watch this movie! Ever!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "FeastMode",
        "review_rating": "3",
        "review_title": "my notes",
        "review_detailed_main": "Some funny parts but mostly terrible and very stupid (3 viewings)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "kyle-mcdonald",
        "review_rating": "5",
        "review_title": "it's OK.",
        "review_detailed_main": "I saw the movie in theatres i liked but it was not as good as the first one maybe the reason is for everyone is that Jim carrey and Jeff Daniels were not in it. but other than that it was good also it was not as funny as the first one. Also the actors that are in it are not very good but the story line is good the script is really good the way harry and Lloyd meet is very funny but my only wish was when i heard of this movie was that Jim carrey and Jeff Daniels would be in it but to bad it was still good but not the best in my opinion if Jim carrey and Jeff Daniels were in it it would have been much more funnier. Also i heard that Jim carrey said he hoped it failed at the box office and it did. see Jim carrey don't do sequels any more sense ace Ventura when nature calls i don't know why but he don't.\n\nIt is not the best but it is OK."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "awesomness-94748",
        "review_rating": "5",
        "review_title": "Meh...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Iguanatic",
        "review_rating": "1",
        "review_title": "The worst movie ever made!",
        "review_detailed_main": "I rarely swear in a movie review. If I dislike a certain feature, I always try to describe it as 'disappointing' or 'only mildly enjoyable'. Unfortunately, there's only one word in the English language that could possibly sum up DUMB AND DUMBERER - and it rhymes with kite.\n\nPlotwise, and that's a laughable word to use here, D&D tells the story of how dumbass friends Harry and Lloyd came to meet at high school. Forget the original's gutsy charm; this is a teen gross-out movie along the lines of \"American Pie\" - but as the two main protaganists have the mental age of a five year old (between them) - their goals aren't to lose their virginity or anything adult like that, simply to recruit people to be in their special needs class.\n\nSound fun? I especially like the way that director Troy Miller decided to make Harry and Lloyd unlikeable dur-durs, thereby removing the only possible remaining interest for the audience. In the original, Harry and Lloyd were funny - braindead, for sure, but funny. You wanted to see them succeed in their wholly unattainable goals; here, you're waiting for something bad to happen just to get them off the screen for a few precious minutes.\n\nThe only positive thing about this movie - and it's a very small positive, nowhere near enough to actually go see it - is Eugene Levy as the school's scheming headmaster. Eugene is one of the funniest actors in America at the moment and it's sad to see him in drivel like this. Were it not for his presence, I'd definitely have walked out the cinema mid-movie.\n\nAvoid this, it's the worst movie of the year. * / *****"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "gb42",
        "review_rating": "1",
        "review_title": "One word: god-mother-freakin-AWFUL!",
        "review_detailed_main": "This might qualify as the worst movie ever made. If there is a movie hell, this would be showing every night. Please, I'm begging you, DO NOT WASTE YOUR MONEY/TIME ON THIS SORRY EXCUSE FOR A COMEDY!!! I'm not usually a very harsh critic....but this was just plain bad."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "TheOtherFool",
        "review_rating": "4",
        "review_title": "It's Dumb Alright",
        "review_detailed_main": "Prequel to the '94 Farelly movie 'Dumb and Dumber', which starred Jeff Daniels and Jim Carrey. In this one, the two nitwits meat each other in High School. The principal at that school (Eugene Levy) has a scheme going on in which he will steal the money the school will get for a 'special class' programme. You kinda guessed who will be the stars of this special class...\n\nThere's a 'romantic' lovestory as well but it's dumb and stupid more than anything else. Not that I haven't laughed at this movie, or would put it in my bottom 100. But that's about it.\n\n4/10."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jab177",
        "review_rating": "10",
        "review_title": "Not as good as the first, but still kicked ass!!!!!!!",
        "review_detailed_main": "This is a hilarious comedy. i own the first one and have watched it probably over 50 times now. Its my favorite comedy of all time. I went to see this movie not expecting much because it wasnt the original actors( Carey,Daniels) but i really enjoyed it. Bob saggot did an awesome job and the guy who played Lloyd did a great job following careys role. I give it a 8.7/10 for the great acting and hilarious jokes."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "gereezi",
        "review_rating": "6",
        "review_title": "Funny...but very³ stupid.",
        "review_detailed_main": "This movie is everything I expected. I saw it yesterday and I just knew it would turn out to be a \"funny, but stupid\" movie. Also, I think Dumb and Dumber is funnier than the prequel (considering the fact that Carrey and Daniels are in it, who are funnier). But if you like what I like to call \"immature comedy\" then you'll love it! Overall, I'd say it's OK on a borderline level....if that makes any sense..."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "ginchean",
        "review_rating": "1",
        "review_title": "Just finished watching the movie",
        "review_detailed_main": "This movie is pathetic at best. The original actors are gone from the movie...which made it watchable in the first place. My main question is why? There are so many mid name stars they should have cleaned house of them and brought back carrey/daniels. who cares to see cheri oteri, eugene levy, mimi rogers, luis guzman, bob sagat, etc. ? Use that money to bring back the actors who are irreplaceable. Another problem is there are too many things in this movie that are taken from the first....no spoilers just take my word. My advice....wait for dumb and dumberer to come out on dvd then trick a friend into renting it so you dont feel ripped off."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "slashgnfnr",
        "review_rating": "",
        "review_title": "Perhaps the Worst Comedy Ever Made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "arvind_19",
        "review_rating": "1",
        "review_title": "all time worst movie award",
        "review_detailed_main": "Ok, this movie was made for dumb people, unlike the first movie which was one of my all time favorites. I actually registered so that I can let everyone know how terrible this movie is. Avoid this at all costs.\n\nThere is no story line to speak of. The situations are not even intersting and the actors are horrible. I did not laugh even once during this movie, infact I nearly cried that I was watching this horrible movie. I cannot imagine why this movie is such a disaster when the first was sooooo good."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "toby-chi",
        "review_rating": "2",
        "review_title": "The joke is on me",
        "review_detailed_main": "This sorry Excuse as a movie gets 2 stars for just getting funding to be made. Studio should've invested the money to help real children with special learning disability instead of wasting money on wasting the moviegoers' time and money."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "miss_niss",
        "review_rating": "3",
        "review_title": "Pretty crap except for one or two scenes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "weberpr",
        "review_rating": "3",
        "review_title": "Dumb and Dumberer",
        "review_detailed_main": "Dumb and Dumberer is the prequel to the original smash hit with Jim Carey, The second stars Derek Richardson and Eric Olsen with Eugene Levy playing a very entertaining role.\n\nDumb and Dumberer was just not the right film to make after the first one which was just funny and well done. The second was beyond stupid it was very comic but just not believable of the stupidity, lacking in storyline besides the fact they meet in high school nothing else occurs in the film its a big nothing flat film, that probably would have been better off left.\n\nIts worth a 3 because of the comedy, but the storyline and predictability and originality leaves a lot to be said, or in this case little."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Quinoa1984",
        "review_rating": "2",
        "review_title": "An Apt title; makes the original look like a masterpiece",
        "review_detailed_main": "In the original Dumb and Dumber review, I said that it was a \"reason to see comedies\". For me, the original had a special place in my childhood, I've seen in many times since, and I still consider it to be the Farrelly Brothers' best work to date. Now here is a prequel (the execs probably thought, hey Lucas can do it, how hard can it be) and I think that, if anything else, it is an extremely pale retread/imitation of the original material. I'm not saying the movie is entirely laughless, in fact there were a few moments when I had a chuckle or two or some grins at the reckless ingenuity of the characters' stupidity (there's even one laugh out loud moment inside the \"Special-Needs\" classroom involving a quiet jock when he gets riled up by the other students). The problem lies in that any of the \"original\" jokes or gags have been done in so many other movies it can only be amusing after a while to the most slight of minds...which means that it will at least earn back a little of the money it took to make it. In other words, Dumb and Dumberer: When Harry Met Lloyd is precisely for it's target group, and it doesn't aim for anything more or audacious like the original, and there's only a minor curiosity to see these two knuckleheads portray younger versions of Carrey and Lloyd. I didn't hate it, but when I left I wanted at least half of a refund. D+"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "DanielMcB3",
        "review_rating": "1",
        "review_title": "Talk about dissapointment",
        "review_detailed_main": "I saw dumb and dumber years ago in the cinema and thought it was 'the best thing since sliced bread' and when I heard they were making another one I was so happy and wondered how this could top the origional and when I saw it I realised as anyone who are put through it will that they didnt try to top the original they tried to destroy it. I feel sorry for the cast of this who will have one hell of a fight saving their careers. I mean the carachters were so dumb and the ending prodictable."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Beta_Gallinger",
        "review_rating": "5",
        "review_title": "Harry and Lloyd weren't as funny back in high school",
        "review_detailed_main": "The Farrelly brothers' first movie, \"Dumb & Dumber\", turned out to be a hit, and has been enjoyed by many people with a sick sense of humour over the years, including me. This prequel, on the other hand, released nine years later, which the Farrelly brothers did not write or direct, turned out to be a flop. While it seems that \"Dumb and Dumberer: When Harry Met Lloyd\" is generally considered terrible, I don't think it is, but it's certainly no match for its predecessor.\n\nHarry Dunne is born in 1969, and as he grows up, he is home-schooled by his mother until one year in high school, in the 1980s. This is when his mother finally sends him to regular school. After this happens, he soon meets one of his peers, Lloyd Christmas, and they soon become two very dimwitted friends. Ms. Heller, the school lunch lady, gets Harry and Lloyd to gather some students for a \"special needs\" class, which they will also be in. However, the two pals have no clue that this is all a scam hatched by Ms. Heller and Principal Collins to cheat the school out of enough money to buy a condo in Waikiki! Jessica, a girl that Harry and Lloyd know, however, is suspicious!\n\nYou might think I'm crazy for saying this, but watching \"Dumb and Dumberer: When Harry Met Lloyd\" wasn't a completely laugh-free experience for me. I didn't laugh very much, but did at times, such as when Harry is at Jessica's house and gets chocolate all over the bathroom, causing her dad to throw a fit when he sees it, thinking it's feces (yes, that is very immature, it still made me laugh, I can't deny that)! There were also times when I just smiled. However, for the most part, I didn't think it was funny. The last time I watched \"Dumb & Dumber\", I think I had a smile on my face as I started watching, knowing what I was in for, but that wasn't the case with this sequel. Also, the two famous main characters are just not the same.\n\nWhen a movie is as poorly received as this one turned out to be, I usually understand. I wouldn't say I like \"Dumb and Dumberer: When Harry Met Lloyd\" too much, my 5/10 rating makes that clear, but the fact that it has gotten more 1/10 votes than any others still makes me feel that I mustn't have seen the same movie. I might even be able to give this movie a 6/10. I guess I'm in the minority of viewers who weren't absolutely disgusted by this 2003 flop, but I still don't think it's really that good overall. I wouldn't say it should be avoided like the plague, but since many others would, you might want to do so, I just don't know."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "breanailkb",
        "review_rating": "10",
        "review_title": "This is my first review. I love this movie!",
        "review_detailed_main": "This is my 1st time writing a review after being a huge fan of IMBD for years! 99% of the time, I dont start a movie without checking the rating here. I was highly upset to see this movie with such low ratings. This is one of my favorite comedies. It's one of those movies you have to watch twice to see its full potential. I've seen this more than I've seen the original and Jim Carry is one of my all time favorite actors. They chose the perfect cast. Its was awesome watching the making of this movie. They decided to keep everyone who tried out for the main casting and did their best to give them a part.\n\nDont watch with high expectations and you wont be disappointed."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "iccle_hayley",
        "review_rating": "6",
        "review_title": "Not an Oscar Winner-but what the Hell did you expect?",
        "review_detailed_main": "I give this film a very respectable 6. It would've gotten a 7 if it wasn't for my cousin constantly reminding me that it wasn't as funny as the original at every chance.\n\nWere this film not a 'prequel' but released before the original it may have been given half a chance. But if your the kind of person who thinks that different actors ruin a movie then you wont like it. If your a 'silly-film-lover' like myself or even just a general film lover then I advise you to give it a chance!\n\nGranted - Carrey and Daniels are classics-Carrey is one of my all time faves! But surely without the writers, a film is nothing? Well it's the same writers so that must mean something\n\n-and I think Richardson and Olsen were brave to step in to such legendary shoes - but you'll never please everybody, I s'pose."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "It Goes Below Dumber.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "whose_your_daddy_1999",
        "review_rating": "",
        "review_title": "When Harry Met Bad Reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "veemee78",
        "review_rating": "3",
        "review_title": "The born loser",
        "review_detailed_main": "Dumb & Dumberer is a classic example of a movie idea that will turn out 'bad,' no matter how 'good' you make it. I think the writers of this one did the best they possibly could with the idea... but it was doomed to fail from the start. The original Dumb & Dumber was a risky movie to film; there were so many areas in which the movie could fail, and the sequel manages to fail in all of them.\n\nStill, you may want to check this out if you want a quick laugh. Pretty much everything in here is a hit or miss, and while nearly everything is a miss, there are a few memorable moments that will manage to get a chuckle out of you. But if you want a true comedy classic, go rent the original."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jrice70",
        "review_rating": "1",
        "review_title": "Thanks Hollywood... you've managed to swindle my money once again.",
        "review_detailed_main": "I see there are a few people that actually liked (no, LOVED) this movie... I am going to keep tabs on them and make sure I stay away from anything they recommend... ever.\n\nI cant say that this production was the absolute worst thing Ive seen, because that would have to mean it fails on all cylinders. I didnt laugh at all, but I did stick around to watch the superb performance by Eric Olsen. He nailed Jim Carrey's character of Lloyd Christmas perfectly, no one else could have even come close. Although it was a shame this role was ever resurrected.\n\nWhat is so sad is that the production company knew it was god-awful, yet still pumped about $15 million into hype advertising, praying to break even.\n\nThanks Hollywood... youve managed to swindle my money once again."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "lilcutie18613",
        "review_rating": "5",
        "review_title": "Stupid, but not in the way Dumb & Dumber was stupid",
        "review_detailed_main": "I didn't have high expectations for this movie, which is the way you should go into this movie. I knew that it would be mediocre in comparison to the masterpiece that is Dumb & Dumber played by wonderful hilarious actors. Obviously, not everyone's going to like the fact that it's played by different people (including me.) It's enjoyable though there are some eye-roller moments. It's a fun movie that's easy to watch, especially if you're bored. If anyone expected a masterpiece, they probably came out of the theater wondering why they even bothered. But what do you expect from a sequel with different people playing the roles? It was just a bomb waiting to happen."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "smarttcareer",
        "review_rating": "2",
        "review_title": "Should have never been made.",
        "review_detailed_main": "The original hasn't aged well but was extremely in the time period. I can't imagine anyone from a newer generation laughing at any of the original either. It was funny for the dark shock humor but we've had shows like Jackass since then. The original was the perfect movie at the perfect time for that sort of comedy. That time is over. There was no way to recapture that again so this movie was doomed from the start of filming."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "moviesforreal",
        "review_rating": "1",
        "review_title": "No word's",
        "review_detailed_main": "Jim carry and jeff daniels are not in this and i am glad they weren't in it because this would have ruined there career 's which brings me to the original actor's aren't in it those two had personality these guys who replaced them are horrible the acting is terrible the directing is bland and boring this movie is also very ugly but the biggest flaw is the humor since this was the two thousands comedy's were just nothing but gross out humor and this is a prime example"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Derek237",
        "review_rating": "1",
        "review_title": "One of the dumberest movie's I've seen in a while",
        "review_detailed_main": "Dumb and Dumberer: When Harry Met Lloyd is a prequel to the Jim Carrey/Jeff Daniels comedy Dumb and Dumber, but it lacks all the heart of it. In Dumb and Dumber, the characters were so dumb that it was funny, but in this one not only the characters, but the actual movie is so dumb that it's just....dumb. It uses some of the same gags but it's overall style is what makes it so bad. It seems more like a gross-out teen comedy than a buddy comedy.\n\nEven some hardcore fans of Dumb and Dumber will probably not like this. The plot is stupid, and there aren't enough funny parts to save it. I do give those two guys credit for doing such a good job in filling Jim Carrey and Jeff Daniels' shoes, though. Their Harry and Lloyd impressions are almost perfect. Other than that, and maybe one or two funny parts, this movie blows.\n\nMy rating: 1/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dwebber",
        "review_rating": "1",
        "review_title": "Rachel Nichols is what made the movie worth watching",
        "review_detailed_main": "she made the movie worth watching...especially her in the two piece bikini. mmm mmm mmm. otherwise, the whole movie blew. and if anyone thought this movie was great, they have a poor sense of humor. this movie sucked along with the nutty professor 2. a giant BOO to both films"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "pedrothelion",
        "review_rating": "10",
        "review_title": "Underrated comedy genius --- or mental dysfunction...",
        "review_detailed_main": "Now, mainstream critics and audiences alike are pathetic at this point in history. Accepting humor and just having a good time is hard with many, especially when some are trying to maintain a grand reputation. This is the case with the overall acceptance of this riotous film. A campy plot and set of jokes couldn't possibly lose a viewer's interest, could it? I mean, people laugh at Family Guy, a show with humor clearly as subjective and ridiculous as that of Dumb and Dumberer. Even Blue Collar humor is more clichéd than this. I admire the entire good mood of this film. I felt great after viewing it. I also haven't laughed that hard in an unnamed amount of time. Don't believe the criticism --- the only reason I can think of for those types of comments is that the lead roles aren't played by the same actors. Yet, who would want to see 40-somethings playing teenagers?"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "anchoreddown",
        "review_rating": "7",
        "review_title": "clear your mind first of your expectations",
        "review_detailed_main": "Considering this is a prequel to one of the most popular cult classics of the 90s, something like this is going to get back-lashed.\n\nFirst off, to all the critics, please stop calling this film a piece of crap. It may look like crap, but seriously people, I think Dumb And Dumberer is a great idea.\n\nDidn't see this in the theater, but saw the trailer plenty of times to get me interested in the idea. The trailer alone was really funny, and reminded me that every once in a long while, there has to be a movie that has to be this ridiculous to laugh at. With that said, I honestly think that the sequel coming out later this year will hopefully resonate well with the fans.\n\nSlap yourself a few times over, then sit down and see what you think of this movie when you put it in next, or when it shows up on TV.\n\nThe female lead will be at the Seattle Comic-Con this year, (2014) and will hopefully meet her.\n\nIt may not live up to the original, but they used plenty of original material to give you an idea of how dumb Harry and Lloyd really are.\n\n(Loved the idea of Harry's invisible captain friend! Seeing the car hit that wooden wagon was pretty priceless!!)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "caspian1978",
        "review_rating": "3",
        "review_title": "Good acting....terrible script",
        "review_detailed_main": "I agree with most reviews that this movie was far from anything great. The script needed a re-write, possibly help from the Farrelly Brothers could have helped. This movie had nothing to do with the creators of Dumb and Dumber, Bobby and Peter Farrelly. Besides having their names in the credits, the movie had nothing to do with the funny filmmakers. If they did, the film could have been saved. Unlike the story, the acting in the film is very good. Eric Olsen and Derek Richardson do the impossible. They have to act stupid, funny, and also portray the characters of Harry and Lloyd. They do an amazing job portraying younger versions of Jeff Daniels and Jim Carrey's characters from the original 1993 comedy. With a better script, the movie could have done much better."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "whose_your_daddy_1999",
        "review_rating": "",
        "review_title": "When Harry Met Bad Reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "rainking_es",
        "review_rating": "5",
        "review_title": "Better than what I expected...",
        "review_detailed_main": "If you're about to watch a prequel of \"Dumb and Dumber\", well, you sure know what you're about to see: an idiot and a retarded doing and saying things typical of an idiot and a retarded. In some sequences you'll wet your pants, and in some others you won't. That's it.\n\nThose ones which are looking for intelligent humor, please just keep your distance. Those who wanna have a funny time \"When Harry meet Lloyd\" ain't that bad. It's quite remarkable the work of the guys in the casting section, for they've found an actor that REALLY looks (and behaves) like Jim Carrrey with 20 years less.\n\n*My rate: 5/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "kfc_colonal",
        "review_rating": "5",
        "review_title": "Coulda been done without the Dumb and Dumber name.",
        "review_detailed_main": "They could have done this movie without it being the prequel to dumb and dumber. Most of the jokes related to the original dumb and dumber aren't even funny. The movie does have it's moments though, like the scenes with Bob Saget. It didn't even bother me that these guys weren't Jeff Daniels and Jim Carrey. One of the major gripes i had with this movie was when it explains the origins of Lloyd's chipped tooth. When they run into each other you can clearly see that their heads don't even come close to touching. I give this movie a 5 out of 10."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Galto",
        "review_rating": "4",
        "review_title": "A let-down",
        "review_detailed_main": "I saw the trailers, noticed Eugene Levy and Cheri Oteri were cast, and was amazed at how close the two young actors looked like Carrey and Daniels from the original. I thought I was in for a treat.\n\nSadly, it was mostly painful to watch. Lowbrow humor amuses me - don't get me wrong, I loved the first film - but this one just couldn't pull it off the way the Farrelly brothers did it. Bob Saget shouting about poo was funny the first time, but hearing him continue to shout just got lame after 10 seconds or so. And when a similar scene came up near the end... well, just forget it.\n\nA few amusing scenes...\n\n\n\nsigh.... at least it was a slightly cheaper matinee..."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "myersb",
        "review_rating": "2",
        "review_title": "Bob Saget sumbed it all up",
        "review_detailed_main": "Bob Saget correctly summed up this movie in one word. See the movie, and you'll know what that word is. It had its moments, I admit, that I enjoyed and were funny. Some of the gags were just plain stupid. The whole thing lacked direction, as evident by the montage scene and the deleted scenes over the credits. To me it seemed the writer and director had a whole load of gags that they knew were good for laughs, but just couldn't find a believable way to connect them all. This film will find its audience, just like Adam Sandler and Tom Green have their audiences. Different people find humor in different things. I just didn't find the majority of the film to be funny, it was just stupid."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "gccuconati",
        "review_rating": "2",
        "review_title": "How do I put it nicely... dismal",
        "review_detailed_main": "Dumb and Dumber truly is a comedy classic. And getting it on DVD at Walmart a bunch of years ago is how I was introduced to this prequel, Dumb and Dumberer: When Harry Met Lloyd, since it was a double feature. Now, as everybody knows, whereas the original continues to get immense praise to this day for the Farrelly Brothers' clever writing, and especially Jim Carrey and Jeff Daniels' off-the-charts comic chemistry, this prequel, which, unlike the sequel that I already reviewed, involved none of those men, was panned by critics and audiences alike upon release, and is mostly forgotten (to the point that the sequel openly ignored it and showed that the Farrelly Brothers had their OWN ideas about Harry and Lloyd's past). Honestly, I myself have never been really fond of the prequel, to the point that I do not watch it as frequently as the original. And after watching it with a friend who came over just tonight, I understood why very few people like it; this movie only had me laughing sporadically.\n\nSet in 1986, 7 years before the events of the original movie, after being homeschooled all his life, 17-year-old dim-bulb Harry Dunne (played by Derek Richardson) is encouraged by his mom (Mimi Rogers) to attend public school, where he meets Lloyd Christmas (Eric Christian Olsen), who's exactly his age, and just as stupid to boot. On their first day of school, the duo are promptly roped into a phony \"special needs\" class set up by Principal Collins (Eugene Levy) with the help of his personal lover and cohort, school lunch lady Ms. Heller (Cheri Oteri), in a scheme to embezzle enough of the school's money to fund their new Waikiki condo (having already stolen a lot of the school's money using several other methods). Fellow student and school newspaper journalist Jessica (Rachel Nichols) soon catches wind of this corruption, and turns to Harry and Lloyd for help in her efforts to prove Collins and Ms. Heller's guilt.\n\nYou see, given this is a prequel, you should definitely expect re-used jokes and lines. But here's the problem: this entire prequel is basically a mix of jokes geared mostly toward grade-school age boys and overabundant nods to the original. To name a few: the scene of Harry's melted chocolate incident in Jessica's bathroom is a nod to the famous scene of him brutally pinching a loaf in Mary's toilet after Lloyd pranked him with laxative, the scene of Harry and Lloyd drinking slushies, leading to Harry getting brain freeze, is a twist on Harry and Lloyd burning their mouths when trying hot peppers, and the sexy twin girls in the convertible that Harry and Lloyd meet at the very end are a nod to the bikini models on the bus. Oh, and one of them is actually Fraida Felcher. Are you kidding me? When Fraida was mentioned in the first movie, Harry had no idea that Lloyd already knew who she was, so it would make zero sense for them to have both met her at the same time. It may just be that since Harry's dumb, he forgot, but I don't know.\n\nThis movie also gets several other things wrong from the original; one particularly egregious oversight is that in this movie, Harry seems to be the dumber one, having an imaginary friend and been held back at least 3 times during homeschooling, whereas Lloyd is the dumb one, acting as his mentor and guide to everyday life. This clashes with the original, where at the very beginning, the only dumb thing Harry did was get some dogs dirty on the way to a show through a combo of reckless driving and feeding them messy food, while Lloyd did a much larger amount of dumb things, not to mention much later in the movie, Harry had to help Lloyd read a simple sentence. It kind of makes me question whether Robert Brener (whoever he is), who came up with the story idea this movie is based on and co-wrote the script with director Troy Miller, and has never written another movie before or since, actually watched the original. In fact, as a YouTuber pointed out, he's likely directly related to New Line Cinema executive Richard Brener, and was hired to crap out a story outline and script for that reason alone. Hollywood nepotism right there.\n\nThen, we've got the music. Eban Schletter, one of the guys behind the music on SpongeBob SquarePants, scored this movie. And honestly, outside of the grand, sweeping cue when Harry and Lloyd meet, it doesn't do much beyond underscore the onscreen action. In regards to the songs, many of them fit, but I do have one complaint: why, during the opening, do we have Lloyd dancing to Vanilla Ice's \"Ice Ice Baby\" being played diegetically over the school PA? That song did not even exist until 1991; 5 years after this movie's events!!\n\nNow, let me get into some of the things that I did like about this movie: there were definitely a few scenes that did crack me up. In particular, the montage of Harry and Lloyd recruiting students for the special needs class had some really funny parts. I also loved any scene with the disgruntled gas station guy. But the funniest scene in the movie was Jessica's dad's profanity-infused rant when he thought Harry had defecated all over his bathroom (\"HE S**T EVERYWHERE!!!!!\").\n\nAnd one other thing: the cast. This prequel is rounded out by several terrific actors. Derek Richardson and Eric Christian Olsen were, in my opinion, perfectly cast as Harry and Lloyd. In terms of both their mannerisms and their appearances, they definitely feel like high school versions of Jeff Daniels and Jim Carrey's portrayals. In addition, Eugene Levy is clearly doing his best as Collins. Cheri Oteri is fine as Ms. Heller. Rachel Nichols is good as Jessica. And even though he has only two scenes, Bob Saget (may he rest in peace) makes the most of his role as Jessica's dad. *sigh* I just wish the cast was given quality material to work with. No matter how well an actor plays their role, it'll always be constrained by how poorly written their character is, or how bad the script in general is, and this prequel is no exception. In particular, Shia LeBouf (who I remember as Stanley from Holes) was terribly underused in this movie, as special needs student Lewis, the school mascot, who Harry and Lloyd recruit after mistaking him for a centaur. That being said, his reaction when the tiny special needs bus jumps a hill (\"HEEEEEELLLLP MEEEEEE!!!!!!\") was priceless.\n\nBut everything considered, Dumb and Dumberer: When Harry Met Lloyd really is nothing more than a lame prequel. People love to throw the term \"cash-grab\" around too much, but unfortunately, that's exactly what this movie is: a very brazen cash-grab, meant to profit off the original's success. In fact, it feels like New Line Cinema didn't understand its audience at all. Whereas the original Dumb and Dumber is a deliberately stupid comedy for smart people, this prequel is JUST stupid. Despite a great cast and a few good gags here and there, this prequel has nothing else to salvage. All the same, I find myself revisiting it (quite rarely) for those alone, mostly because it's tacked on my DVD with the original, which I've had for many years, and the few good laughs it has to offer hold my attention before I get bored. Even so, you may wanna stick with the original."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "TOMASBBloodhound",
        "review_rating": "2",
        "review_title": "A complete letdown.",
        "review_detailed_main": "Quite simply put, this is a terrible attempt at a movie. Troy Miller should go back to directing Mr. Show, and the people who starred in this film have probably ruined whatever careers they had.\n\nThere are painfully few laughs as this thing lurches along. I think the main reason it seems so unfunny is the fact that the original film was one of the funniest movies made in the last decade. I have never laughed as hard since the original came out in 1994. I think I was even on the floor of the theater laughing during the snowman scene.\n\nSadly, this sequel has nothing that will make you more than slightly chuckle. Please don't waste your $ on this one at the theater. If you must see it, wait until it comes out on cable next year.\n\n1 of 5 stars\n\nSo sayeth the Hound."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Chixdigme06",
        "review_rating": "1",
        "review_title": "Waste of Money",
        "review_detailed_main": "I probably only laughed twice the whole movie. I was so dissapointed in this movie. The previews make it look hillarious, but I guess we were wrong. The whole story line and everything was so corny I almost got up and left, but I payed $6.50, and I wasn't gonna waste my money. I feel like I did though. There were only a couple funny jokes but the rest of the movie was unoriginal. I can't believe this movie made it to the theaters. It was a complete waste of time and money and I strongly recomend not seeing it. It recieves 1 out of 10 stars, and thats being generous!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "ichabod_crane1899",
        "review_rating": "10",
        "review_title": "I think this is funny stuff!",
        "review_detailed_main": "I had the feeling this movie was going to do bad with the critics, I was right and I didn't think it would do good at the box office because this movie didn't have very good marketing and again I was right. But I still had high hopes for this movie! Jim Carrey is my idol and I was a little mad that he wasn't coming back, but you gotta understand, this dude wants to explore different characters. Anywayz, I went into this movie with my brother and we laughed out loud. Yeah there were some not so funny scenes, but it was still hilarious! Especially Bob Sagat! Eric Christian Olsen play Lloyd Christmas very well, but Derek Richardson is alright. I didn't think Eugene Levy gave his best, but Cheri was very funny! And that Rachel Nichols lady is mighty fine! Anywayz, all in all, this movie made me laugh, I wasn't disappointed, and I'm going to buy it when it comes out on DVD! I do have a life, but I can't put a movie down that easily (like Dreamcatcher), but this movie I didn't feel sorry for! But, yes, this movie could've done better with the Farrelly Brothers! I hope they get the thought to making a sequel and bring back Jim, Jeff, and Sebass! Although Dumb and Dumberer is funny stuff my man! 4 stars out of 4 stars\n\nSincerely Sidekick Jolly!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "drunken_critic",
        "review_rating": "6",
        "review_title": "Alrighty then",
        "review_detailed_main": "It really was not as funny as I thought it would be. It definitely would have been better if it had the original cast of Jim Carrey and Jeff Daniels. The original Dumb and Dumber was made almost ten tears ago, (1994). Wow! Time flies! I remember seeing the original at Mission Drive in San Antonio. Oops enough nostalgia.\n\nThe positive of this movie is that the make up was great. Harry and Loyd looked exactly like Jim Carrey and Jeff Daniels. I saw the actors in an interview without the makeup, and they are completely different looking. It was quite a transformation. Unfortunately this movie was just plain boring and not very humorous. One of the few funny scenes is when Harry pulls out a melted Hershey bar from his pants, and tries to get the chocolate off by rubbing it on the walls of the bathroom. Jessica's dad played by Bob Saget cannot believe that he rubbed excrement all over his walls, and starts freaking out. 6/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "fireZtar",
        "review_rating": "3",
        "review_title": "Oh it's dumb alright",
        "review_detailed_main": "Catching the first teaser that came out on cinemas I was very excited about this movie since I thought it would be a Jim Carrey movie. Later I realised it was not and was kind of disappointed.. still, I had my hopes up when watching a sneak preview.\n\nBut gosh was I wrong, altho the actors do a decent job in portraying the young Harry & Lloyd, it's just simply not as funny. Instead it rolls out into an average 'stupid-comedy' a la a bad sequel of Police Academy.\n\nThe jokes are too few and when they do pop up they're not allt that funny. Too much time is spent on the characters actually getting into character.\n\nNaw, just a bad sequel living on the hype of it's prequel. One of many. Stay away from this one, and if you have to catch it, I'd wait and get it on VHS/DVD.\n\n3/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "kgilroy130",
        "review_rating": "",
        "review_title": "First One is 1000x Better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "tbc0",
        "review_rating": "1",
        "review_title": "Good lead actors, bad writing and directing",
        "review_detailed_main": "The story was lame, not just dumb. The scatalogical jokes were constipated. The scenes between the principal and his lover were pathetic. The best part of the movie was the imitations the new actors did of Jim Carey and Jeff Daniels. Too bad they will never get a chance to do it over. The writing was simply putrid."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jbuch26",
        "review_rating": "1",
        "review_title": "As bad and badder: Somebody owes me money",
        "review_detailed_main": "I believe that somebody owes me $12 (one ticket for my girlfriend and I) for that horrible movie. I have never gone into a movie with lower expectations...and I was still disappointed. This is the worse movie I have ever seen. However, I will give props to the guy who played Lloyd Christmas. He did a great impression. That's the best I got."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "NawlimitSoulja",
        "review_rating": "4",
        "review_title": "It almost put me to sleep",
        "review_detailed_main": "Out of the hour and twenty minutes or so, I laughed about approximately thirty minutes. Sure Harry and Llyod were all right, but Eugene Levy was wasted and not a single thing he said was ever funny, Cheri Oteri was boring and both of them together were on the screen too much to be enjoyed. Bob Saget made a return to the big screen but overplayed his part and was a little bit exaggerated. Not enough to save the movie to be a disaster except the same jokes used in a different manner. Half the movie jokes were based upon the original's and it just wasn't good enough."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "xtrememainstream",
        "review_rating": "1",
        "review_title": "An absloutly horrible film...",
        "review_detailed_main": "I had the unfortunate opportunity to see a sneak preview of Dumb and Dumberer last night. This movie (not film) did not have ONE redeeming quality. People were leaving the theater a half hour into the film. I however was not as smart as said people and left with about a half hour left. DO NOT see this movie. It is not even \"dumb funny\", it is just boring and was a big mistake from the beginning. Trust me, this movie is a waste of two hours."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "rman726",
        "review_rating": "5",
        "review_title": "Stupidest Film Of The Year Award?",
        "review_detailed_main": "That was one stupid film! Everything I expected though, a poor sequel, or rather prequel. :) It had some funny parts however which made me laugh. It was nice and short, but nothing like the original. Not worth spending money in the theater though, maybe a video rental? 5/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mattatthemovies",
        "review_rating": "3",
        "review_title": "Inept and Cringeworthy attempt at Comedy",
        "review_detailed_main": "This was a trainwreck that everyone should have seen coming. A sequel to a comedy classic that had a new director, new writers, and new forgettable nobody actors playing the leads. Lloyd is played by Eric Christian Olsen, who is most remembered for his role in Not Another Teen Movie and as a regular on NCIS: Los Angeles. Olsen does a fine job imitating Jim Carrey's Lloyd Christmas from the original, but the writing doomed this movie. Derek Richardson plays Harry Dunne, Richardson is most remembered for his role in Eli Roth's film Hostel just a few years later.\n\nThe comedy in this film is extremely underwhelming, I didn't laugh once. Even the best jokes this movie has are only slightly amusing, you may crack a smile but nothing more. Eugene Levy and Bob Saget are the saving grace that keeps the movie out of 1 star territory for me. Both actors are trying their best and are easily the funniest parts of the movie.\n\nIt's truly incredible that the original film has aged as well as it has. All the jokes that landed in 1994 still land three decades later. The same cannot be said about the follow up, which has aged like a raisin in the Nevada sun. Whether it be having the Asian foreign exchange student referred to as Ching Chong. Or the many jokes about special needs students, or a gay slur being used repeatedly by the protagonists. These cringeworthy missteps just shows the difference that quality script writing and directing can make."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dragslidefade",
        "review_rating": "2",
        "review_title": "not good at all",
        "review_detailed_main": "As a huge fan of the origional Dumb and Dumber I saw this movie, even though everyone I talked to said it was horrible. This movie should have went strait to video. I left the theater half way through the movie because it was so bad. The actors did a good job with what they had, but the script is just terrible. If you want to see this, definately wait for it to come out on VHS or DVD and watch it. I'm glad the Jeff Daniels and Jim Carrey did not get involved in this because they are both much better actors than what this script could even dream to offer."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "poochenstein",
        "review_rating": "10",
        "review_title": "Funny and Funnierer (ok, bad joke)",
        "review_detailed_main": "When I saw the first trailer for this movie I thought to myself, \"No way, if Jim Carrey ain't in it, what's the point? It's just some crappy movie the studios are trying to get money for. It'll suck.\" And I'm sure most people will tell me I was right. And okay, it was some crappy movie the studios were trying to cash in on BUT, it most definitely did NOT suck. In fact, it rocked!\n\nIf you want to see this movie because you loved the first one, you probably will hate it. You'll probably say it lost all the appealing features of the first one and just kept the dirty \"potty humour\". And I won't argue with you. But, if like me, you can look at this film, not as a prequel to a great movie, but as just a movie, you should find it has a certain charm.\n\nEric Christian Olsen made a complete transformation for this movie (its hard to believe, but he's the \"cocky blonde guy\" from Not Another Teen Movie\"). He did as good a job, if not better, than Jim Carrey could have done himself. It's a worthwhile movie, just to see ECO play this character so well.\n\nAnd then there's Bob Saget. Everyone knows him as the dad in almost every cute kids TV show, so to hear him swear like that...well that's worth the price of rental at least!\n\nAnyway, this movie isn't going to make you think, or do anything more than make you glad you have a better IQ that Harry and Lloyd, but it is one of those movies that is so funny and simple that I, at least, want to watch it over and over again. Give it a chance, keep an open mind, forget about the original. It might not be a good \"prequel\", but it is a great movie. In my humble opinion, at least. :-)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dobbin-4",
        "review_rating": "6",
        "review_title": "Not the worst movie ever but not one third of the greatness of the first.",
        "review_detailed_main": "Dumb and Dumberer is a sequel to the Farrely Brother classic Dumb and Dumber and does not deserve the horrible rating it has got. The movie is about before the first movie or when Harry and Lloyd met each other in High School. The movie is a bit of a copy but brings a new look on the first one. The movie is good most of the time but like in the first movie they are pretty stupid in this movie they are the biggest pair of Retards ever and are beyond stupid. Overall this movie is good but nothing great. You should definitely watch this movie if you have nothing better to watch but should probably just watch Dumb and Dumber again and if you have not already seen Dumb and Dumber see it now. I rate this movie 62%. Also Eugene Levy is pretty good as the bad Principle."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Robocopm4",
        "review_rating": "1",
        "review_title": "This movie caused vomiting, headaces, and then I left.",
        "review_detailed_main": "Trash is all I have to say. I mean I gave this movie the hope of it being funny but it was just horrable. One of the many problems is they make them too dumb. I mean in this one they think getting beat up is a type of showing ones love. Levy's charecter gave me hope that it would be a litle funny, wrong! There is nothing funny I saw, t was killing me so when they did the gag of Harry looking at a state and hearing it talk onlt to be shocked that it was someone next to him, I left. I walked out and I could tell all the Dads watching that movie with there kids wanted to join me. So this is a great attempt of butchering up a classic, I hope to relieze never to make a sequel if the orginal crew or cast rejects it for being so stupid!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "leathaface",
        "review_rating": "",
        "review_title": "Oh, no!! Another teen movie cleverly disguised as a sequel to a GOOD movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "shadow3531",
        "review_rating": "2",
        "review_title": "What? There was a second Dumb and Dumber?!",
        "review_detailed_main": "Talk about disappointment. The whole time I was watching this movie my friend and I shook our heads in shame as the two main actors (playing Harry and Lloyd) tried to impersonate the infamous Carrey and Daniels' jokes from the first movie. It just isn't happening. From the \"I LIKE IT ALOT\" to the \"It\" game, the movie just flunked in the joke area and impersonations. It was full of potty humor, that mainly kids would enjoy. I will admit. I did laugh at a few parts in the movie. For example, best part - Bob Saget swearing at the top of his lungs. However, just as most of us thought, this movie was a pitiful attempt to try and recount the hilarious movie of 1994. No Farrelly Brothers, no Jim Carrey, no Jeff Daniels! You know it's going to be a flop. One of the best parts of the first movie was the quality songs that went along with the plot (i.e. \"The Flower Girl\", \"Boom Shack-a-lak\", \"Oh Pretty Woman\", etc.). This movie was void of a good soundtrack. Save your $8.25 and wait until this comes out on video. P.S. - Sorry to Jim Carrey and Jeff Daniels - this movie is an embarassment to your brillance and laughter you created in the first movie. YOU SHOULDA BEEN IN THE SECOND ONE!\n\nRating: C- (2 out of 5 stars)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "martyrff5",
        "review_rating": "3",
        "review_title": "Wow",
        "review_detailed_main": "This movie was not funny. The only reason I give it a 3 is because the actors did a decent job portaying the originals. The only time I laughed was at Bob Saget. What does that say about a movie? Bob Saget is funny and all, but is he usually the most memorable piece in a flick? I feel soo bad for the actors, they did a great job."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "omniwarp",
        "review_rating": "2",
        "review_title": "I want my two hours back...",
        "review_detailed_main": "The title of the movie goes perfect for this flick. To bad its not funny :\\ Personally I didnt think the first one was overly impressive either... But this one had a poor cast of no name actors, who arent overly funny, and writters who arent sure exactly what humor is. The plot: not so good, a few funny lines here and there... Dont waste the $9.00, wait for it on dvd, or just read the reviews :) - I wouldnt have seen it if I wasnt offered a screening oppurtunity... Hopfully I saved two hours of your life... Becuase I clearly lost mine, and may never get that back... You can owe me later..."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "FunkMcLovin",
        "review_rating": "1",
        "review_title": "Ed Wood, Meet Troy Miller",
        "review_detailed_main": "WARNING TO THOSE WHO MAY NOT HAVE SEEN THIS YET: avoid this movie at all costs. Count to a million, start a used gum collection, bang your head against the wall until you pass out, do anything as long as it is not going to see this movie. Yes, it is that bad...\n\nIn twenty or thirty years, the people of my generation may look back at Troy Miller the way many others look back at Ed Wood, Jr... as the worst director to ever make a movie. Yes, it IS that B-A-D. Eugene Levy, Luis Guzman, what the heck were you two thinking? This movie is stupendous in its badness.... triumphing in its apparent goal to challenge \"Plan 9 From Outer Space\" for the title of the worst movie ever made.\n\nThere is nothing good to say about this movie, plain and simple. The plot is shotty at best, the acting is off the charts bad, and the dialogue is so incredibly bad that you start to think that the writers belonged in the \"special class.\" This movie succeeds in damaging the legacy of its predecessor, which is an extremely funny movie that solidified Jim Carrey's status as the comic genius that he is, and that is a shame.\n\nThis movie should have never been made. The Farrelly brothers and Jim Carrey knew that it would not work, this should have been enough for New Line to not make this movie.\n\nJust think about how bad a movie must truly be for it to be carried by Bob \"Full House\" Saget in a two scene role. Troy Miller, please stop making movies now."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "redbirds525",
        "review_rating": "1",
        "review_title": "TERRIBLE AND TERRIBLERER",
        "review_detailed_main": "One of the worst movies I've seen in the last 12 months bar none. This movie actually made THE RING and SIGNS look GOOD. When I saw THE RING and SIGNS, I was laughing throughout the entire movies. When I saw DUMB AND DUMBERER, I did not laugh one time, except for the Freda Felcher part. That is pretty bad when I laugh at movies that are supposed to be scary and just sit there with no expression during a movie that's supposed to be a comedy.\n\nThere is a lot of good talent wasted on a TERRIBLE script. The guys that played Harry and Lloyd had the characters to a T! Good performances by Mimi Rogers, Eugene Levy, Cheri Oteri and others.\n\nSave your money."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Edvis-1997",
        "review_rating": "5",
        "review_title": "5",
        "review_detailed_main": "It's not that bad but it's not good. It's this movie that you watch, you didn't feel anything at all, no happy,no laugh, just nothing. It was going in straight line and finished."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "iain-imdb",
        "review_rating": "1",
        "review_title": "No one in the cinema laughed throughout the entire film.",
        "review_detailed_main": "The funniest thing that happened was that someone pretended to fart loudly when the lights went out. Once the film started there was silence as all the attempts to be funny just failed.\n\nThe audience ranged from adults to 12 year olds. And once the 12 year olds started saying things like \"Oh, wasn't that funny?\" out loudly you knew the film was bad for all age ranges. People walked out constantly and as soon as the credits started rolling there was a sarcastic burst of applause and everyone left, ignoring the outtakes.\n\nThis is possibly the worst film I have ever seen in my life. And I've sat through some bad films."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "MrsKat38",
        "review_rating": "10",
        "review_title": "Love this movie",
        "review_detailed_main": "I don't know what it is about this movie but but I love it so much. There is some dumb parts for sure but they are still funny as heck."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jonathanfdaly",
        "review_rating": "1",
        "review_title": "What was I thinking?",
        "review_detailed_main": "What on earth was I thinking when I willingly purchased a ticket for this abysmal attempt at a prequel? I know that prequels/sequels generally never live up to the expectations of the original, but I feel I must applaud Troy Miller on setting a new benchmark that sequels must stay well clear of.\n\nThe movie starts off by showing us a little bit of Harry's (Derek Richardson) childhood and a 'hilarious' experience with his imaginary friend. And take it from me folks, it gets worse. What follows is 90 minutes of pure cinematic dung. From the distasteful (a scene in which Harry appears to smear faeces on a bathroom wall) to the downright confusing (a not so funny `your it' sequence in a convenience store).\n\nMy view after watching the 1994 original was that Lloyd and Harry were just two buddies that were caught up a world that was just moving too fast for them. However, in this movie, Miller puts them across as being mentally disabled and so incompetent that they may not even develop into the people they are in the 1994.\n\nThe film takes every single hilarious scene from the original and milks it relentlessly, so much so that you may find yourself cringing when a line from the first is said. Don't get me wrong, I LOVED the original, it is one of my favourite comedies but this shoddy knock-off has the ability to discourage a person from watching the original.\n\nThe cast list looks attractive on paper. Eugene Levy, Luis Guzman, Mimi Rogers and Cheri Oteri have all starred in fine comedies over the past few years but this movie is one I think that would be better left off the résumé. Eric-Christian Olsen on the other hand may be one of the lucky ones, and this may actually benefit his career. His perfect take-off of Jim Carrey is flawless in both mannerisms and accent. He even managed to get a chuckle out of me in a scene involving him using a floor buffer on a sidewalk.\n\nAll in all, this movie is a complete waste of time and money for the cinema patron. If you want a laugh, rent the original. Its jokes are still as funny as they were in 1994, however, I can't see us looking back in 2012 in reminisce this movie.\n\n1 out of 10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Chances911",
        "review_rating": "",
        "review_title": "Not good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "SeanDoof",
        "review_rating": "2",
        "review_title": "Dissapointing",
        "review_detailed_main": "This was one of the most disappointing movies I have seen in a long time. Dumb and Dumber was such a classic movie that I expected nothing less from this one. However, I knew it wouldn't be up to par because it wasn't directed by the Farrelly brothers and the two previous stars Jim Carrey and Jeff Daniels weren't in it. Also, the movie used the same jokes as in the first one only they weren't as funny the second time (especially since I've seen the first one about a hundred times). All in all, this movie was nowhere near as funny as the original and I was thoroughly disappointed."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "filmfreak-5",
        "review_rating": "1",
        "review_title": "A total rip-off",
        "review_detailed_main": "Oh man, all this talk about sequels never being able to live up to the first movie really rings as true as ever in this case.\n\nThis film is nothing but a pure rip-off, disappointment of the year, a complete waste of time, and even if you loved the first Dumb&Dumber movie, you'll even hate the original after watching this sequel (or rather, prequel).\n\nI have to say though, that the actor - unknown as he is and probably will remain - who plays the Lloyd character does a pretty good Jim Carrey-copy - but then again, what's the point when the film is as bad as this. No fun, just poop jokes - and although Harry's toilet visit in the original film was hilarious, thier attempt to copy it is disasterous..\n\nNo madder if you like the first film or not; do not waste your time with this garbage, that's just free advice!!!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "atomic-2",
        "review_rating": "3",
        "review_title": "Please, believe me.",
        "review_detailed_main": "Do not, under any circumstances, give your money to the clods that filmed this attrocity.\n\nThis is one of the worst movies I've ever seen. There is nothing redeeming. The plot is horrible and the movie consists of nothing but predictable gags between ripoffs of the first movie - from the fire at the gas station to the bathroom scene - it's all been ripped off and performed so horribly that it will detract from the wonderful experience you had watching the original.\n\nPlease, do yourself a favor, go watch the original again and don't EVER watch this. You will regret it."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "bouwege",
        "review_rating": "1",
        "review_title": "Me, an intellectual?",
        "review_detailed_main": "The Belgian promotional material for this movie clearly stated that it was 'not for intellectuals'. Now, I never considered myself an intellectual (at all), and I do like this type of film (I loved the first one anyway), but this sequel (or prequel, whatever), is really a piece of rubbish. I've seen lots crap movies lately, but this one really beats them all. Ignore some of the other user comments, this movie is NOT 'funny as hell'! Avoid it at all cost!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "FlashCallahan",
        "review_rating": "3",
        "review_title": "Dumb is being nice to this film....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "rebelroe",
        "review_rating": "5",
        "review_title": "Credit where credits due.",
        "review_detailed_main": "Although this movie fails in many aspects, a major one being it's initial existence, I still must say Eric Olson delivered a much better impression than Jim Carrey did in man on the moon."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "ryanf-75484",
        "review_rating": "3",
        "review_title": "Hey! Wanna see the most annoying movie in the world?",
        "review_detailed_main": "Some prequels are pretty good. Some prequels are awful and then there's Dumb and Dumberer!! I understand some people didn't like it. I thought it was just eh!! Some parts are better than others."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mattheos",
        "review_rating": "10",
        "review_title": "why people don't like this movie",
        "review_detailed_main": "i think the reason people don't like this movie is that first, they expected or wanted to see jim and jeff reprising their roles. second, they viewed it and compared it to the dumb and dumber original. i went into the movie with no expectations and i found it to be hilarious. i think as long as you don't think of the original, which probably is hard to do, then you'll enjoy this movie. in its own way, its goofy, fun, and enjoyable. me and my friends use a lot of the quotes from this movie and the first and we just laugh our a**es off."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Jack-182",
        "review_rating": "1",
        "review_title": "Why ruin a good thing?",
        "review_detailed_main": "The original Dumb and Dumber, to me, was a classic. A film that will forever remain in my private collection of DVDs. It wasn't only the subtle humor in the first film, but also the scenic locations they used. From RI to Aspen, we were along for the trip, amused with each scene building upon the last. But, what humor can be found from this film? What story-line are we exposed to? The answer is none. I was particularly impressed with the portrayal of Jim Carrey and Jeff Daniels that these two new actors gave, but this was the only impressive part of the film. I know I cannot expect a \"high-class\" comedy with a film like this, but none of the jokes worked in this film. None of the blatant puns or overused \"one-liners\" even remotely gave the impact of the first film. Although, I will concede that the scene with Bob Saget and the Hersey's Bar was enough to crack a smile, but this still does not justify spending 8 bucks. This felt more like watching a film written by and staring Rob Schneider. Dirp. 1/10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "gpatter3",
        "review_rating": "",
        "review_title": "WORSE THAN I THOUGHT !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Hyena_",
        "review_rating": "1",
        "review_title": "Blah",
        "review_detailed_main": "I went into this movie *expecting* the worst. That's right. I knew it was going to be terrible and I saw it anyway. I had this whole plan of how I was going to ruin it for everyone by laughing way too hard at jokes that were really unfunny, just to make everyone turn and look at me and think \"what's wrong with you\", and repeat back lines that weren't witty at all, adding \"that's so funny\" and etc. Well, my little game got boring fast. After about 5 minutes, no one was responding at all to my little outbursts, so I just stopped and watched the movie. After twenty minutes of the movie, I was so annoyed and bored with the movie that I walked out.\n\nThis movie is the first movie I have ever walked out of. I'm quite the masochistic movie-watcher. I'll watch anything. This movie couldn't even maintain *my* interest. I laughed at the one scene where Lloyd wrote a message for his father in gigantic ketchup letters, but it wasn't a sustained laugh, and it was the only real one.\n\n1/10, definitely. I've probably seen worse movies, but none come to mind right now."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "drewjames-44217",
        "review_rating": "5",
        "review_title": "If you ignore the main characters it's ok.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "lerrom",
        "review_rating": "5",
        "review_title": "What does this series and Star Wars have in common? Prequels are not its forte.",
        "review_detailed_main": "It's just kinda uninteresting. Yeah, we get an introduction to the character, and all these other characters as well, but it really doesn't have much of an impact since we know we're never gonna see them again."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "BFinkel333",
        "review_rating": "1",
        "review_title": "A Fitting Name For A Movie",
        "review_detailed_main": "Never, in the history of cinematography, has a movie had such a fitting title. No, I'm not referring to the intelligence of the two \"stars\" of the movie, but instead of the movie itself. Dumb and Dumberer was simply that. It started off dumb, and just got plain dumberer. Never in my entire life have I been so bored and unentertained that in those 82 minutes. The movie is pointless! A crooked high school principal tries starting up a phony special needs class so he can receive a $100,000 grant from the school board, so he and his girlfriend (the school lunchlady) can run off together to Waikiki. I really do feel bad though for Eric Christian Olsen and Derek Richardson who looked and acted EXACTLY like their famous counterparts, but were shorted with a cheap script, no jokes, and even worse, predictablity and THE SAME LINES from the original movie. I gave this movie a 1 out of 10 on the imdb scale, which is GENEROUS considering there are no 0's on there. This was by far the worst sequel and arguably the worst movie of all time. America and the World, if you see this movie, you can't be any dumberer."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "honey_ekr",
        "review_rating": "2",
        "review_title": "Plotless movies lead to very short summaries, much like this one...",
        "review_detailed_main": "I didn't like the first movie, but I went to see this one with a friend because she really, REALLY wanted to go.\n\nThis movie is 82 minutes long. When I left the theater, however, I felt like I had been there for hours and hours. I laughed a few times, but mostly the movie was incredibly uncomfortable and embarrassing to watch. The jokes were shallow, predictable, and weren't even funny. Not even Eugene Levy or Shia LaBeouf were laugh-worthy. Sadly enough, only Bob Saget should get any credit for laughs here. However, \"Harry\" and \"Lloyd\" actually captured their older counterparts quite well.\n\nAnother major problem I had with this movie was the anachronisms. No matter how stupid or amateurish the movie may be, if it's supposed to be 1986, at least put in some other than dressing everyone up like it's a bad 80s dance party.\n\nIn short, don't even bother seeing this movie unless you really enjoyed the first one, or you're too young to drive yourself there and you plan to entertain yourself by farting the entire night and kicking the back of everyone's seat in front of you, because that's what the 3 incredibly immature kids behind me did, which made the movie even worse."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "MTinTX",
        "review_rating": "1",
        "review_title": "the Title says it all......",
        "review_detailed_main": "I saw a special screening last night. WOW! What a let down. I usually like those kinds of movies (Dumb and Dumber, Tommy Boy, etc.), but his one was awful. Not that there should be a great plot in these types of movies, but this one went nowhere.\n\nIt seemed that the producers just put this out to make a buck. This movie really had a lot of potential, but just didn't utilize it; like it was just thrown together over the weekend. There were only two scenes that were funny, the rest was just infantile filler to make it 90 minutes long. You could definitely tell that the Farrelly Brothers had nothing to do with it.\n\nIn short, worse than Weekend at Bernie's II (1993)."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "sauravjoshi85",
        "review_rating": "4",
        "review_title": "A wasted effort!!",
        "review_detailed_main": "Dumb and Dumberer: When Harry Met Lloyd is a buddy comedy film directed by Troy Miller. The film stars Derek Richardson and Eric Christian Olsen\n\nIt is the second installment in the Dumb and Dumber franchise and a prequel to the 1994 film Dumb and Dumber.\n\nHarry Dunne and Lloyd Christmas meet in high school and become best friends. They decide to help Principal Collins set up a special needs class, but rise in revolt on discovering his true intentions.\n\nThe film certainly has some really funny and hilarious comedy scenes but the major drawback of the film is probably the lead characters were desperately trying to copy Jim Carrey and Jeff Daniels hence never came up with something of their own.\n\nThe screenplay of the film is decent and the film surely has some honest funny moments. The acting in the film is probably the biggest disappointment with most of the supporting characters either underused or wasted.\n\nOverall a decent but a wasted effort."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "crazyskater2093",
        "review_rating": "10",
        "review_title": "A great movie!!!",
        "review_detailed_main": "This movie is not as awful as everyone says it is. This was a great movie. It is a stupid movie, but it is supposed to be,hence the name dumb and dumber. Everyone says that it would have been better with Jim Carey and Jeff Daniel's, but I disagree. The two actors who played their role were amazing to me. The plot was stupid, but i thought it was funny anyway. I don't care how many stars this movie has or how much money it made in the box-office. This was one of the funniest movies have ever seen and one of the best. It is not the dumb movie everyone says it is. I loved this movie and i recommend it to anyone who loves comedy. This movie is awesome!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "kelli2582",
        "review_rating": "6",
        "review_title": "It's Pretty Funny and 10x Funnier than the Newest Sequal",
        "review_detailed_main": "It's goofy fun. 1st time I watched it I was like this is so dumb OMG. Then I saw it one night with a group of friends crashing on my couch and we busted up the whole time. It's light, it's funny, and the actors reaaaallly put themselves out there. It's not amazing, it's not the best thing at all but it is entertaining. I think people like to hate because parts of it are cringe and weird which is what they were aiming for. The plot is dumb, the characters are charicatures, it's lots of physical humor. It's funny because this was Even Steven's Era and Shia LeBouf was the straight mammon this. I remember it throwing me off he was a goofball, just a nerd. It's how Harry and Floyd met, whay did you expect?"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "zep42",
        "review_rating": "8",
        "review_title": "An underappreciated gem",
        "review_detailed_main": "It's funny how life goes full circle sometimes.\n\nPeople rating a movie about morons, and are being morons about it.\n\nThis movie is awesome! It filled a gap while we missed and wanted more Harry and Lloyd. It did an awesome job! Bravo!!\n\nIt had Eugene Levy and Shia LaBeouf + a hottie named Rachel Nichols. What more could you possibly want?\n\nSo, if you rated this movie and gave it a hard time, know this: YOU are the ignorant moron that makes the characters seem smart in comparison! Shame on you for not appreciating the gifts that life delivers!\n\nMovies like this deserve a better audience. Some people should just stop watching movies."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "ihateeverymovieisee",
        "review_rating": "",
        "review_title": "Should Have Never Been Thought Of",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mgarland",
        "review_rating": "8",
        "review_title": "Pretty good (for a prequel)",
        "review_detailed_main": "First, I absolutely cannot stand prequels. Hate 'em with a passion. But I rented this one because I liked the first movie so much, and I actually liked this one just as much. Those guys really put in a serious effort to be enough like the original Harry & Lloyd (Carrey and Bridges), but not so much like them that it went over like a movie full of impressions. Face it: we don't watch a movie called \"Dumb and Dumber(er)\" for the intellectual conversation; it's silly, stupid comedy and it works very well. Don't knock these guys or this movie until you've seen it, then make a decision."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "sparsh36",
        "review_rating": "",
        "review_title": "Warning:Watching this movie can be injurious to ur health",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "buccola13",
        "review_rating": "9",
        "review_title": "The Bad Reviews Are Ridiculous",
        "review_detailed_main": "This movie took established characters, fleshed out a backstory, and added to the mythos. Everyone in the movie gives %100 and is fully onboard with the craziness. Is Olsen Jim Carrey? Of course not. But he delivers a phenomenal performance. The cast is enormous, and again. they are all in. This movie did what it set out to do."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Piedreau",
        "review_rating": "",
        "review_title": "It's just not funny...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "kurt7825",
        "review_rating": "10",
        "review_title": "Funniest movie I've seen in years",
        "review_detailed_main": "These guys are crazy. There's also a couple more movies in this series starring Jim Carey. I'm going to watch those also"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "tangeriness",
        "review_rating": "",
        "review_title": "why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "laprej",
        "review_rating": "8",
        "review_title": "The first was better",
        "review_detailed_main": "I thought it was funny over all, but could have been better. I think if the actors had just been themselves instead of trying to imitate Carrey and Daniels, it would have been a better film. You just can't imitate the two of them and pull it off."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "wareagle8507",
        "review_rating": "",
        "review_title": "An unbelievably poor attempt to follow a classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "brandonnodnarb2003",
        "review_rating": "10",
        "review_title": "One of the funniest movies ever made!",
        "review_detailed_main": "Besides Kung Pow:Enter The Fist Dumb and Dumberer: When Harry Met Lloyd has to be one of the funniest movies ever made.From the beginning all the way to the end credits the film has nothing but gross outrageous humor and Eric Olsen plays the part better than Jim Carrey.For those who liked this one but still have yet to see the original don't cause it sucks.Dumb and Dumberer made up for the waste of the original.It's funny and actually has a point.If you like movies like Kung Pow and Jackass:The Movie(which I happen to love both of them)then this is the film for you.Some people can't appreciate funny movies but I am not one of those people.This movie is a must see and beats those crappy flicks like The Mask and the original Dumb and Dumber just to name a few.I recommend buying it!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Garyp59024",
        "review_rating": "",
        "review_title": "Is This Movie A Joke?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "hoffmabc",
        "review_rating": "10",
        "review_title": "Great Movie!",
        "review_detailed_main": "I thought this movie was great. Although the second half was lagging a bit and I found myself missing Jim Carrey and Jeff Daniels. It's not a horrible film but you will find yourself wondering why you're still laughing. And remember that Wednesday is Southwest day in the cafeteria."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "masoumi1984",
        "review_rating": "",
        "review_title": "Doesn't capture the same effect as the first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "robertfalzmann",
        "review_rating": "10",
        "review_title": "An enjoyable comedy!",
        "review_detailed_main": "Just as hilarious as the original Dumb & Dumber. This movie sticks to comedy, not drama. It gets to the point, moves along well. A well-thought out movie that is not stupid. I give it a 10 out of 10 because I thoroughly enjoyed it. Good acting, good characters, good performances, good story. The movie is actually quite sincere. It's not pretentious.\n\nWhy the low ratings and bad reviews by others? I came to this movie with no expectations or preconceived notions about anything or anyone. If they made this movie any better it would simply have been different, not better. Highly recommended. I also recommend \"The 'Burbs\" (1989) starring Tom Hanks."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "concad44",
        "review_rating": "",
        "review_title": "This movie should be used in torture camps",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "HaroldandMaude",
        "review_rating": "10",
        "review_title": "In the words of Bill and Ted this is film is EXCELLENT!! (riff)",
        "review_detailed_main": "God's honest truth this film is very very good, its written by the Farey Brothers the guys who wrote the original Dumb and Dumber, and you can tell, ok its not Jeff Daniels and Jim Carrey but it is a close as you could possible get. This film has been slagged off by every film critic, but when have has a film critic ever been right? The film starts off with the meeting off Harry and Lloyd, and their relationship develops, they have to put together a \"Special\" class, this \"Special\" class allows the school to get a $100,000 grant which the head master plans to run off with, with the help of jessica, Harry and Lloyd foil his plot infront of the whole school. A very funny film in the TRUE sense of dumb and dumder."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "tj_director",
        "review_rating": "",
        "review_title": "Bottom 100... deserving!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Akimbo_Slice",
        "review_rating": "9",
        "review_title": "Why Does Everyone Hate This So Much?",
        "review_detailed_main": "Before the events in Dumb & Dumber, before they move on, before they grow up (very slowly)...there was high school.\n\nBasically it's Eric Christian Olsen taking over for Jim Carrey and Derek Richardson taking over for Jeff Daniels. It wasn't as long as Dumb & Dumber, but that can be overlooked, especially knowing that comedy movies are all spanned around 75-90 minutes with about 30 exceptions every year.\n\nI can't understand why everyone hates this so much. Is it because Jim Carrey and Jeff Daniels weren't in it? If that's so, then let me ask you this. Since they've aged 9 years since Dumb & Dumber, do you really think they'd be perfect teenagers? Jim Carrey reached his 40th birthday in 2002! Overall, Dumb & Dumberer was 85 minutes of pure fun."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "susan_mj",
        "review_rating": "10",
        "review_title": "Wonderful Casting",
        "review_detailed_main": "Compared to the first movie this movie is NOT a disappointing sequel, (err, rather, prequel?). The casting was right on target, nobody else could have pulled off Harry and Lloyd as teenagers and done it such a brilliant manner.\n\nEverything about Dumb and Dumberer fits right along with the second movie, which seems to be a major feat in Hollywood. Never once was I left thinking \"Oh Harry (or Lloyd) would never have said or done THAT!\".\n\nNot quite as humorous as first movie, but still pretty darn hilarious and wacky.\n\nIf you liked Dumb and Dumber, you'll definitely love this movie."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Logan-22",
        "review_rating": "8",
        "review_title": "Better than the original!!!",
        "review_detailed_main": "I actually liked this better than the original! I expected it to be awful, but found myself laughing hysterically throughout most of it once it got going. The whole cast was great, especially Mimi Rogers as Harry's mom, though the subplot with Lloyd falling in love with her never went anywhere, and Mimi herself disappears from the film early on, never to return.\n\nDon't believe all the bad reviews; Dumb And Dumberer is a fun film that delivers exactly what it promises: plenty of crude toilet humor and slapstick silliness!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "maq27",
        "review_rating": "9",
        "review_title": "i knew this movie was going to be good, but i wasn't expecting this!",
        "review_detailed_main": "i did not think this movie was going to be as good as it was! this movie was hilarious! and to think \"good morning america\" rated this movie an F. an F?!?! i don't know WHAT they were on that day, but they said the acting sucked, the plot sucked, and there were no laughs. i think they sucked. if you are a big dumb and dumber fan, rush out and see this movie! it kicks ass! 9/10\n\nderek, good job. it was your first time being in any type of showbiz. what a great introduction"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "deborah22",
        "review_rating": "8",
        "review_title": "Eric Olsen",
        "review_detailed_main": "Eric Olsen did an amazing job playing a character that was already established by such a highly regarded actor. I normally don't consider movies such as these as humorous, but the role was played so exquisitely that I was enraptured by Olsen's performance throughout the entire movie."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Tman112284",
        "review_rating": "10",
        "review_title": "Perfect Movie",
        "review_detailed_main": "Dumb and Dumberer is a great movie. The casting of the characters harry and Lloyd were done very well. If you watch dumb and Dumberer first then watch dumb and dumber it would look like to some one who has not seen them in the correct order that Jim Carrey and Jeff Daniels are mimicking Olsen and Richardson. These two pulled the characters off great. The silly antics that these two go through are hilarious and I wouldn't suspect anything less from them. They are the perfect people for stupidity. I loved the movie, thought that it accented dumb and dumber very well. Everyone should see this movie. It gets a 10 from me. It was the funniest movie I have seen in years."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Bsbgirl7",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": "This is by far one of the funniest movies I have ever seen in my entire life. It is so funny and there are little parts that if you pay attention you will laugh so hard. Especially look at the body language. That is one of the funniest parts of this movie. I recommend it."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Bsbgirl7",
        "review_rating": "10",
        "review_title": "I adore this movie!",
        "review_detailed_main": "This is my all time favorite movie! I can't see how it can be in the bottom one-hundred. I guess you have to have a little thing called sarcasm to understand and enjoy it. Dumb and Dumberer is funny on so many levels. Not only can it make a sad person laugh, but it has sarcasm and wit as well as potty humour. I pity people who do not like this movie. If you have not seen this movie you MUST go see it as soon as you can. Call the local BlockBuster or whatever you go to rent your movies and ask them if they have it in stock. You must rent it. Dumb and Dumberer is one piece of work I must say. If you don't like it you have NO sense of humour."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "batzo",
        "review_rating": "10",
        "review_title": "Surprisingly über movie",
        "review_detailed_main": "I had low expectations of this movie, kinda because the low rating on IMDB, but to my surprise this movie was really really funny... I gave it a 10, cuz it was never a dull moment, so dont let the low rating make you to miss this movie..."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mizzelijah",
        "review_rating": "10",
        "review_title": "Funny",
        "review_detailed_main": "I think that people that hated this movie should reconsider and actually watch the movie. people think that all because it is a remake, its going to be awful and tell the whole world that. this movie was a great movie and showed what happened to harry and lloyd in highschool and how they met. this movie was very funny, and cute. im not just saying this because i am a huge fan of eric christian olsen, im saying this to prove that this movie is an excellent movie and not to listen to what other people have to say about it and watch the movie for yourself to see what a cute and hillarious movie it really is."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "josh-ostro",
        "review_rating": "8",
        "review_title": "It was an okay movie",
        "review_detailed_main": "This movie was pretty much an okay flick. It was funny at some parts, although I think I liked Dumb and Dumber better (The first one) When I heard it was coming out, I was really excited because the first one was awesome. When I went to go see it in theaters with my friend, we found it to be really funny.\n\nThe only bad thing about it is it doesn't have Jim Carrey and Jeff Daniels. The first one was hilarious, I found it to be really silly. But this one doesn't meet up to it, but it's still a good movie.\n\nI would put it on a must watch list, you might really enjoy it.\n\n8 stars out of 10"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "stephenchase-63504",
        "review_rating": "10",
        "review_title": "The greatest prequel ever!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "MLDinTN",
        "review_rating": "",
        "review_title": "The title says it all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "scottpiper",
        "review_rating": "8",
        "review_title": "Exactly what I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "otisfirefly2001",
        "review_rating": "",
        "review_title": "ridiculous! But has it's moments",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jack_horner01",
        "review_rating": "9",
        "review_title": "Stupid, Funny, and Better than most recent comedies.",
        "review_detailed_main": "I saw the trailer for this, and was quite excited. A few of my friends were not interested in seeing the film, as they stupidly believed that it is not possible to make a good second installment to a film without any of the original cast or crew. So i dragged my brother to see it. Within moments we were in tears of laughter.\n\nFrom the word go the film hits you with some of the silliest jokes you could imagine, and they work. From Lloyd thinking Harry's mum is the tooth fairy, to discovering that Lloyd's dad is in fact a latino school janitor (wonderfully played by the very charismatic Luis Guzman). Granted, most of the characters in the film are quite dumb, but that is what makes the film work. If, like in the 1st film, everyone except Harry and Lloyd were smart, the comedy would not work. You begin to understand why Harry and Lloyd are so incrediblly stupid. I also believe that if everything was the same as the 1st film, then people would just be saying \"it is the same movie, nothing new\".\n\nTroy Miller has definately proved that he can make a good comedy. He is on par with the Zuker brothers and Jim Abrahams. I would love to see a Troy Miller movie starring Will Farrell, Chris Kattan, and Leslie Neilson. With cameos by Adam Sandler, Ben Stiller, Owen Wilson and Rbin Williams. Obviously, by looking at my choice of comedians, you will begin to understand my sense of humour. So if you do not find these guys funny, then i recommend you give this film a miss. Stick to the more 'straight comedies' such as Legally Blonde (ZZZZZZZ!!).\n\nDerek Richardson has manged to mimic Jeff Daniels perfectly. It is very believeable to think he is a younger Daniels. Eric Christian Olsen brings something of his own to Lloyd. The voice is similar, but Olsen has obviously realised that mimicing Carrey will get him slated by critics and audiences, so Lloyd belongs to Olsen in this film.\n\nI loved this film. On DVD release, it will definately find it's way into my collection.\n\nI give it 4 out of 5."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dusticle",
        "review_rating": "",
        "review_title": "good prequel, but has major flaws. read below",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "rakell_15",
        "review_rating": "8",
        "review_title": "hilarious!",
        "review_detailed_main": "it's such an hilarious movie! really, I've watched it several times and I always laugh as a maniac! I confess that the first time I saw it I was a little scared 'cause the first one with Jim Carrie was awesome, and I was afraid that this prequel could turn out to be, well, weaker. but no! great interpretations! great actors! great reveals! Eric, Derek, Shia! oh god, Shia is amazing! With all that hair... and those interviews that appear on the DVD, with Shia and his mum...such a nice guy. and such a great actor, with a great future! I really enjoyed this movie. simple but so funny... The characters are so perfect! those hairs... and I adore those scenes with that guy (sorry, don't know is name...) who is mad about football... awesome! definitely excellent!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "Very funny, but doesn't quite match original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "hollywoodgirl333",
        "review_rating": "8",
        "review_title": "A good laugh",
        "review_detailed_main": "I found this movie quite entertaining, and it definitely gave my room mate and I some great laughs. Of course it was ridiculous, it is supposed to be! Anyway I give props to the actors too, they did a great job, over all a cute entertaining movie."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "FilmFlaneur",
        "review_rating": "",
        "review_title": "Dumberer and stupider",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "LiamGazza",
        "review_rating": "9",
        "review_title": "Just a bit of fun...",
        "review_detailed_main": "Dumb and Dumberer is just FUN! I really like it, Great film, I think Eugene Levy is great in every film he is in and this one is the same. Stop slagging this film of, Its just light hearted fun! Buy the DVD or video! If you like it of course!"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "horsegoggles",
        "review_rating": "",
        "review_title": "No pretense!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "leedavidodea",
        "review_rating": "8",
        "review_title": "This film is great.",
        "review_detailed_main": "I was shocked to come across the fact this is a bottom-rated movie. It is sweet, the 2 leads are likeable and funny, and it has one of the most laugh-out-loud 2-hit jokes of my 35 years as a film fan. I'm 40. The cast is great, if you're actually a film fan who's like a walking iMDB for actors, some still visible, some not. It's better than Dumb and Dumber To, overall. Eric Christian Olsen as Lloyd is hiwawious. Watch it, and ffs grow up. Not every film has to be Scorsese. It's funny, has Stifler's Dad (Eugene Levy) as a villain, has Bob Sagat screaming, twice, a total babe as a supporting character (Rachel Nicholls)... I could go on. Don't listen to the haters."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "thagza95",
        "review_rating": "9",
        "review_title": "I can smell your stinky finooter from here",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "britalicious16",
        "review_rating": "8",
        "review_title": "Dumb & Dumberer",
        "review_detailed_main": "Most would watch this movie, expecting humor to jump right out and captivate them... however, this is the type of movie you have to watch expecting lame humor. If you're a fan of the \"Scary Movie\" trio filled with lame humor, or better yet, Old School, Anchorman (the original or the 2nd version), or any movies of the sort, then Dumb & Dumberer is for you.\n\nI, personally, enjoyed this movie... my favorite part being the beginning (the dancing scene is probably one of the best ever, aside from Napoleon Dynamite's dancing attempt and the dance scene from 2005's \"Hitch\").\n\n8/10 on this movie, most definitely."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Im_anonymous_or_trying_to_be",
        "review_rating": "10",
        "review_title": "An apt title; makes the original look like a masterpiece.",
        "review_detailed_main": "In the original Dumb and Dumber review, I said that it was a \"reason to see comedies\". For me, the original had a special place in my childhood, I've seen in many times since, and I still consider it to be the Farrelly Brothers' best work to date. Now here is a prequel (the execs probably thought, hey Lucas can do it, how hard can it be) and I think that, if anything else, it is an extremely pale reread/imitation of the original material. I'm not saying the movie is entirely laughless, in fact there were a few moments when I had a chuckle or two or some grins at the reckless ingenuity of the characters' stupidity (there's even one laugh out loud moment inside the \"Special-Needs\" classroom involving a quiet jock when he gets riled up by the other students). The problem lies in that any of the \"original\" jokes or gags have been done in so many other movies it can only be amusing after a while to the most slight of minds...which means that it will at least earn back a little of the money it took to make it. In other words, Dumb and Dumberer: When Harry Met Lloyd is precisely for it's target group, and it doesn't aim for anything more or audacious like the original, and there's only a minor curiosity to see these two knuckleheads portray younger versions of Carrey and Lloyd. I didn't hate it, but when I left I wanted at least half of a refund. c-."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "sabalo",
        "review_rating": "10",
        "review_title": "don't knock it till you tried it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "blatony",
        "review_rating": "9",
        "review_title": "the bathroom scene is enough to get this movie a good rating",
        "review_detailed_main": "I just watched this movie within the last week or so even though MOST people I asked told me it wasn't THAT good (bottom 100 on IMDb) and I couldn't believe I was watching the same movie. This movie was FUNNY, REALLY FUNNY, way better than i expected. There are at LEAST 10 or more laugh out loud moments. All I can say is that most people must have been in bad moods when they saw this movie, (or was I in a really good mood) or they just wanted to see jeff danials and jim carry again. No friken way this movie is one of the worst movies EVER. This comment is mostly for anyone who can vote on this site to tell them to get this movie off the bottom 100. Anyone who wants to see this movie but have heard bad things about it, give it a chance."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Movietajm",
        "review_rating": "8",
        "review_title": "Cool",
        "review_detailed_main": "First I must say that Lloyd in this movie looks VERY much as Jim Carrey. Even though much happend in this movie there wasn´t much of a story (nothing happend, just school)... A funny guy in the movie is the clerk with the long hair who gets REALLY annoyed buy Harry and Lloyds sick jokes and games.. =) But even though all this the movie is really good. I laughed several times to when I saw this movie.."
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Bethwagstaff",
        "review_rating": "10",
        "review_title": "Funny",
        "review_detailed_main": "I saw this movie today, and i must say it is funny. Lloyd is at Harry's house he asks, \"can i have top bunk?\" Harry says \"Only if i can have bottom.\" HA HA HA!!!! Not as good as the first one but the actors are great. well worth seeing if your a dumber fan.\n\n7/10\n\n(I'm not on drugs. Its true.)"
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mlugo-17421",
        "review_rating": "10",
        "review_title": "So Dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "martin-rea",
        "review_rating": "",
        "review_title": "GREAT AND GREATERER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "D. Vader-2",
        "review_rating": "",
        "review_title": "\"Theres S**t all over the place!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Beetlechick",
        "review_rating": "",
        "review_title": "Almost delivers, but not quite",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Bacardi_Breezer",
        "review_rating": "",
        "review_title": "Daniels and Richardson - a chilling combination",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "goatlve",
        "review_rating": "",
        "review_title": "I have never seen a worse movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "aj84",
        "review_rating": "",
        "review_title": "Not as good as first, but funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "fmikeb",
        "review_rating": "",
        "review_title": "The Problems With This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "aj84",
        "review_rating": "",
        "review_title": "Go easy there now",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "ebayguy999",
        "review_rating": "",
        "review_title": "People actually thought this was funny???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Rirath_com",
        "review_rating": "",
        "review_title": "Might be a sleeper hit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "michiganbooman",
        "review_rating": "",
        "review_title": "A funny movie (contains spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "rock5668",
        "review_rating": "",
        "review_title": "shockingly better than i thought it would be......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "mrchaos33",
        "review_rating": "",
        "review_title": "Magnificent comedic journey... not!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "charlie22",
        "review_rating": "",
        "review_title": "Who do I see to get a refund?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "E_Kurz1",
        "review_rating": "",
        "review_title": "HORRIBLE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Sarah-Embry",
        "review_rating": "",
        "review_title": "I liked it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "poeticstickman",
        "review_rating": "",
        "review_title": "Olsen twins couldn't have saved it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "",
        "review_title": "American Public School:That's the way not to be dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "harlin00",
        "review_rating": "",
        "review_title": "You have got to be kidding me!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "peachmango18",
        "review_rating": "",
        "review_title": "Goofy and dumb, but has a certain charm over it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "csweetleaf2",
        "review_rating": "",
        "review_title": "Give this movie a chance will you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "E_Kurz1",
        "review_rating": "",
        "review_title": "HORRIBLE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "movie_rater",
        "review_rating": "",
        "review_title": "this is the funniest movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "yamsrus",
        "review_rating": "",
        "review_title": "I think I laughed once",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Weak and Weaker.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Hurley9002",
        "review_rating": "",
        "review_title": "This sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "MrOvletine",
        "review_rating": "",
        "review_title": "Oh yeah, I forgot.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "magzimillian",
        "review_rating": "",
        "review_title": "Funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "the_insainiak",
        "review_rating": "",
        "review_title": "It didn't kill me!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "sherwet",
        "review_rating": "",
        "review_title": "really???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "freestlz",
        "review_rating": "",
        "review_title": "Very Dumb Jokes!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Calfry89",
        "review_rating": "",
        "review_title": "Not as great as the first, but I enjoyed it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "uds3",
        "review_rating": "",
        "review_title": "Witless, cretinous embarrassment of a film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "tharrison1311",
        "review_rating": "",
        "review_title": "What a dumb movie.....seriously",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "GeneralDisarray",
        "review_rating": "",
        "review_title": "i might get jumped for saying this....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "XxEmilyJoxX",
        "review_rating": "",
        "review_title": "Defiantly worth the asking price.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "dire69",
        "review_rating": "",
        "review_title": "Funny But Original Is Much Better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "jacob_wollner",
        "review_rating": "",
        "review_title": "A great comedy!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "boondocksaint20",
        "review_rating": "",
        "review_title": "Incredibly stupid, horrible plot...but funny as hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Poor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "Freebasedog",
        "review_rating": "",
        "review_title": "Troy Miller, your days are numbered",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0329028",
        "movie_name": "Dumb and Dumberer: When Harry Met Lloyd",
        "movie_rating": "3.5",
        "review_username": "nothingbeast",
        "review_rating": "",
        "review_title": "Of course it's not supposed to be serious!!!",
        "review_detailed_main": ""
    }
]