[
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "vicky-bahl",
        "review_rating": "6",
        "review_title": "Chakravyuh - moves away from the real topic a number of times, too commercial and not as expected from Prakash Jha",
        "review_detailed_main": "Chakravyuh - 6/10\n\nChakravyuh is a good attempt by Prakash Jha to give us something like a Gangaajal and Apharan but what he forgets is that this is far more touchy topic for a majority of Indians than topics discussed in Gangaajal and Apharan. A topic such as kidnapping rackets can be accompanied by masala songs and a great looking police woman, but when you discuss topics such as Naxal Movement, Communist Ideology and show your protagonist (Abhay Deol) reading Marxian literature, I'm sorry but you need to be a lot less commercial.\n\nIn summary, Chakravyuh is a masala movie (as Arjun Rampal agrees in an interview too). It has item songs, a hot policewoman and random jokes. It is an 'entertainer' - for that I might give it 7/10 - but as far as the real message is concerned - to show what Naxal movement is all about and what is the state of our tribes and also the nexus between government, police and the corporate's - I am sorry but it is a disappointment.\n\nPlease watch it for it's entertainment, I wasted my time watching it alone as I was expecting this to be showcasing something that is close to my heart, unfortunately it does not."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Well-Acted & Well-Made Motion-Picture!",
        "review_detailed_main": "Prakash Jha's 'Chakravyuh' is A Well-Acted & Well-Made Motion-Picture! Based on the issues of Naxalites in Modern-India, this under-rated political-thriller offers thrills & well-paced entertainment in a running time over a 150-minutes.\n\n'Chakravyuh' Synopsis: On the request of his friend Kabir, SP Adil Sends him to the Naxal group as an informer. When Kabir finds the truth he becomes one of their gang leader.\n\n'Chakravyuh' begins & ends well. Any hiccups? The second-hour dips considerably. It does gain momentum in the final 15-minutes, but the portions otherwise of the latter hour are bland. Anjum Rajabali & Sagar Pandya's Writing is strong at most parts, but lacks much conflict & meat in the second-hour. Prakash Jha is a pro at handling political-thrillers with ease & over-here, he delivers a worthy performance as a story-teller. Cinematography, Editing & Music are fair. Action-Sequences are extremely raw.\n\nPerformance-Wise: Arjun Rampal is impeccable. The National-Award-Winning Actor sinks his teeth into the part & lives the character with utmost honesty. Abhay Deol is nicely controlled. Manoj Bajpai is, as always, flawless. Bajpai only gets better! Om Puri is significant. Esha Gupta is decent. Anjali Patil is fabulous. Chetan Pandit is in terrific form. Mukesh Tiwari & Murli Sharma are natural to the core. Kabir Bedi is suave in a cameo.\n\nOn the whole, 'Chakravyuh' delivers entertainment & a strong message efficiently."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "rajat_srvstv",
        "review_rating": "7",
        "review_title": "Beautiful amalgamation of serious cinema with entertainment.",
        "review_detailed_main": "Jam packed hall and pin-drop-silence.Jha is a master of his craft,yet another time he beautifully amalgamates serious cinema with entertainment. Story line is gripping n direction apt. Manoj Bajpai is little above average and doesn't get to showcase his talent much,but the dialect and lingo he uses arrest your attention.Arjun Rampal is decent (though at times his hamming surpasses viewer's tolerance)......Abhay Deol is natural on screen.......but its Anjali Patil aka Juhi ,the gold medalist from National School of Drama, who steals the show in her debut. Another treat for the weekend...Kudos to Jha n team."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "dineshprakash",
        "review_rating": "7",
        "review_title": "Enjoyable movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "kumarrajesh196320",
        "review_rating": "7",
        "review_title": "Good but only for serious cinema lovers !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "9",
        "review_title": "Revisiting Namak Haraam in a Naxlite setting",
        "review_detailed_main": "In India, Naxalite movement started as a revolt against the system-generated injustices heaped on the tribals in Naxalbari (West Bengal) four and a half decades back and then spread in various parts of our country. Still known by the same name and carrying the same slogan - Laal Salaam, this movement which is violent to the hilt has given birth to a few Bollywood movies. Prakash Jha's Chakravyuh (the lethal trap difficult to break)is in the same league.\n\nPutting it straight, the story of Chakravyuh is not original. It's a lift from the classic movie of Hrishikesh Mukherjee - Namak Haraam (1973) starring two biggest superstars of Hindi cinema - Rajesh Khanna and Amitabh Bachchan in lead roles. In Namak Haraam, one friend (Rajesh Khanna) infiltrates the workers by posing as one of them for the purpose of helping his industrialist friend (Amitabh Bachchan) and in due course of time, starts sympathizing with them. Here the same story has been given the backdrop of Naxalite movement with Arjun Raampaal being the cop and a part of the system (akin to Amitabh Bachchan in Namak Haraam) and Abhay Deol being his helping friend infiltrating the Naxalites and ultimately switching over to their side (akin to Rajesh Khanna in Namak Haraam). The outcome turns out to be what it had to be - one of these two friends has to die and naturally, it is the one who joins the outlaws.\n\nSince the story is not original, I won't give any credit to the script-writers. However Prakash Jha has directed it very well. After a long long time (since Apharan), I have seen him in full form, presenting an utterly realistic account of the things but in a gripping way without allowing even a second of boredom to the spectator. The complete movie is an edge-of-the-seat thriller. Right from the very beginning to the very end, it keeps the audience engrossed. Just like the stories once written by Salim-Jaaved during the seventies and the early eighties, the story has been presented in such a way that the viewer does not get any chance to think (while the movie is in progress) and keeps on looking at the screen holding his breath. He can think, analyze and assess only during the interval and after the ending.\n\nPrakash Jha has picturized everything in a highly realistic manner with taking minimum number of cinematic liberties. Except the basic story idea, the movie appears nowhere as an imaginary story. The human aspect of the various people involved (on both the sides) and the different facets of the issue have been dealt with finesse and most of the scenes leave their mark on the heart of the viewer. Quite contrary to Red Alert, he has not come out with any solution to the problem but tried to see the things from a much closer point and succeeded. Nobody is correct at every point of time and from every angle of this multi-faceted complex phenomena. From one angle, one is correct and from some other angle, the other is correct. The need of the hour is to have a holistic view of the phenomena and then a proper strategy is to be formulated to break this vicious trap or Chakravyuh. And Prakash Jha has established this fact with the level of proficiency we always expect from him. While referring to the real life incidents, he has adapted the story of Namak Haraam for this movie and presented a taut thriller. A couple of scenes involving Kabir Bedi and his son are the only ones which appeared as somewhat over the top to me, nothing else.\n\nThe movie scores very high on the technical front. All the action and thrill sequences are damn impressive. The art director and the cinematographer have worked in harmony and enlivened the milieu of the story on the screen. The editor has also done his job well. Background score is perfect. Music is in line with the mood of the movie. It's not memorable but fits the bill.\n\nPrakash Jha has extracted outstanding performances from his lead as well as supporting characters. Since Arjun Raampaal and Abhay Deol are the two holding pillars of the story (in fact the two opposite poles of a continuum), they were expected to come out with exemplary performances and they have done it. Both deserve a big hand from the audience. All others including Manoj Bajpayee, Anjali Patil, Om Puri, Chetan Pandit, Murali Sharma, Vinay Apte, Kabir Bedi etc. have also done pretty well. Esha Gupta did not get much scope but she does not disappoint.\n\nI consider this movie as a brilliant effort from one of the most realistic and respected directors of India, Prakash Jha who has though not suggested any solution and left it to the audience to think of a practically feasible solution to this ticklish problem continuing for decades in our country, nevertheless presented the complete status of the things in a highly impressive and thought-provoking manner. I hope, the governments of various affected states will watch this movie carefully and pick up some points to deal with the issue in an effective as well as humanistic way. This CHAKRAVYUH is to be broken and Abhimanyu who is the innocent ones, is to be saved. As Prakash Jha has shown that the real problem is the vested interests which are ever ready to swallow everything that is nice, just and desirable; the people who are desirous of curing this canker have to first sideline them from the decision-making processes.\n\nAnd hats off to Prakash Jha with the whole Chakravyuh team."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "ansusam9",
        "review_rating": "6",
        "review_title": "Watchable in home not in theaters",
        "review_detailed_main": "Good parts:- 1>Naxal part is very good and entertaining. 2> Abhay Deol, Om Puri, Manoj Bajpayee and Anjali Patil really done a superb Job. Début girl Anjali Patil really done a very good job and Since she belongs to NSD and don't forget she's gold medalist so there is no doubt about her acting talent. Bad parts:- 1>Poor story (Shows only one side of a coin which is Naxals are good and politicians are bad).I agree that politicians are not that good but naxals too are not that good what Prakash is trying to show. 2> Not able to touch reality. 3>Police part is worst and boring. 4>All good actors are on Naxal side which makes it more one sided. 5>Dialogue delivery of Arjun Rampal is a kind of funny (Specially how he over acted in that Rum (old monk) part) 6>And there are lots of flaws in that movie. 7>It is depressing to see how good actors like Mukesh Tiwarin (Bacha Yadav of gangajal) are getting ignored these days . 8>I almost forgot to mention the other girls Esha Gupta, I am still thinking why she's there. Altogether movie is not watchable in theaters, you can watch it in your home screens so that you can fast forward the boring parts (like unwanted songs especially that item song). One request to Prakash Jha bring back Ajay Devgn into your movies, if he was in place of Arjun Rampal then the story would be different impact will be different."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "shahhirenmr",
        "review_rating": "9",
        "review_title": "Outstanding",
        "review_detailed_main": "Excellent power packed movie with realistic theme after a long time. As is always expected of Prakash Jha, this one also won't disappoint you.\n\nIt brings out the best performances from all the actors and touches a very sensitive issue in a neutral way, leaving the people to judge about naxalite reality.\n\nAn unbiased version of the naxalite infested India from the government and naxalite/tribal perspective without tilting on either side and bringing tears to the eyes of sensitive people, which is in itself a victory for the movie.\n\nI wish that more and more people become aware and sensitive about this subject which has affected 220 districts of India and this movie does its bit on the subject judiciously.\n\nNeedless to mention all the actors did their best, however novice Anjali Patil steals the show. The cinematography and screenplay was good too, feels like we're sitting in a naxalite infested jungle."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "jay-techie2007",
        "review_rating": "7",
        "review_title": "Good one time watch but Prakash Jha disappoints again...",
        "review_detailed_main": "Prakash Jha once again picks up the right topic enough to generate excitement in masses but disappoints again (to a lesser extent than Aarakshan and Rajneeti). In terms of plot, the film does highlight one of the greatest challenges, the Indian democracy is facing but gives a half-hearted treatment with superficial explanation on the reason behind Naxalist movements. There were many technical mistakes in story set up. The greatest being recruitment of Abhay Deol in the Naxal group without any strong reason. Extremist groups just don't recruit anybody because the person does not have anything else to do. And while a small time actor gets executed within seconds, Abhay Deol gets all the time in the world to explain himself in \"Janta Ki Adaalat\" and eventually pardoned for the same crime committed. In terms of acting, Abhay Deol, Om Puri and Manoj Vajpayee lives up to their reputation. Anjali Patil is the discovery of the movie and definitely stands up in the league of stalwarts, at least for this movie. However, Arjun Rampal spoils the party in every scene, making audience feel the need of Ajay Devgan or at least Emraan Hashmi for the role. All in all, the movie is good enough to be watched for someone who wants to get an idea of what the Naxal movement is about. However, the movie fails to send the message it intends to."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "An unexpectedly weak and filmy take on a serious issue by Prakash Jha.",
        "review_detailed_main": "CHAKYAVYUH exploits the same plot earlier used by Hrishikesh Mukherjee in his NAMAK HARAAM in the year 1973. In fact Hrishi Da's film was also reportedly based on an Oscar winner classic called BECKET released in 1964. Plus later the idea of placing a mole inside the rival group has been used in so many films that it can rarely excite anyone from both the current as well as the grown up generation. So if you were looking for something fresh and new from Prakash Jha in his latest film then as far as the storyline is concerned, it is not there. But that didn't surprise me since I was more interested in watching his execution on the screen as the trailers had already revealed its main plot openly (which should have been avoided).\n\nHence with a prepared mindset about its basic predictable script, I was actually hopeful of getting something exceptional from the veteran director dealing with the important issue of Naxal movement in the country. But unfortunately this time Prakash Jha could deliver HIS kind of cinema in only the initial odd 40 minutes in the film and not beyond that. Further it might be a huge disappointment for many to know that these first 40 impressive minutes of the movie are those in which Abhay Deol is not even there in the frame properly.\n\nTo bring out its positive points first, CHAKRAVYUH starts off well taking you into a different world of the rebellious movement run by the Naxalites in a specific region of our country. It smartly explains their motives in few scenes and one starts feeling the pumping blood with some well directed action sequences depicting their struggle with the government. But the moment, film comes to its actual story plot of sending a spy in the group of Naxalites, it starts walking on a steep downward slope and becomes totally childish or filmy in its execution unlike a Prakash Jha film.\n\nAt regular intervals, the film forces you to think that Is director Prakash Jha also following the same path chosen by Madhur Bhandarkar, of repeatedly making films on a fixed pattern tackling a particular issue of the society and nothing else? The question keeps haunting your mind because the experience of watching CHAKRAVYUH is quite similar to that of seeing the recent HEROINE, wherein the director fails to provide any freshness in his treatment and disappoints hugely. So as its biggest drawback, CHAKRAVYUH can easily be called a film made on the Naxalites, which clearly fails to explain the problem in an appreciable way and in the end just remains a project exploiting the burning issue of the country for its own benefits.\n\nAnd why it remains only a commercial project ruining an important issue?\n\n1. Because it has a hero who can easily slip into the Naxalites without any trouble, can start flirting with their girl leader, becomes one of the Naxalites front-runners in only a few days and still can comfortably phone or even meet his friend who is a senior Police Officer without any major hassles.\n\n2. It has a lady inspector, who simply asks the doctor to insert a chip inside the wound of an injured Naxalite leader, like kids insert a board-pin into their dolls. In addition, since the inspector is a lady too, she is also made to wear a short revealing dress in a meaningless scene as an essential part of a Bollywood film.\n\n3. It is based on a script wherein, when the traitor is a small time actor then they kill him instantly but when the traitor is the hero himself, then they have all the time in the world to first talk and wait for him to be rescued.\n\n4. But most importantly and ridiculously, it has a friend who without giving any second thoughts easily sends his only long time (well educated) buddy into the Naxalite group to be his informer. And when the 'planted friend' starts betraying him, then he simply calls a reporter to his office, reveals his actual identity to the media along with the visual proofs and makes a clear way for his friend's ultimate end by the Naxalites themselves. Honestly, it was indeed a very cruel and silly way to define friendship on the screen by the veteran director.\n\nFollowing his set pattern (not really working in CHAKRAVYUH), Jha also has an deliberately added item song here which is equally weak as the other tracks composed by more than one music directors in its soundtrack. Still Cinematography and Background Score give you some bright moments to praise in the film made on a rotten plot.\n\nOn the performance front too it is going to disappoint many as the film has nothing what was being expected from the three powerful actors namely Om Puri, Manoj Bajpai and Abhay Deol. The deadly trio, though play their respective parts well with the required intensity and depth. Yet their written roles (and length) are not anywhere close to their own respected reputation, which ideally should have been the highlight of this film as projected. Apart from these key names, Arjun Rampal never rises above his weak character and Esha Gupta doesn't add anything significant to the movie in her given role. But surprisingly Anjali Patil is the one who actually scores the best among the entire star-cast full of card-board characters (except Murli Sharma).\n\nIn all, CHAKRAVYUH is a pretty weak (filmy) product from the banner of Prakash Jha, vaguely made around the subject of Naxalite movement in the country. So you can surely watch it if you wish but just for its first 40 minutes and Anjali Patil."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "prakhar-cena",
        "review_rating": "9",
        "review_title": "Chakravyuh - A bitter truth about Indian politics",
        "review_detailed_main": "It's a must watch movie. The movie goes off at a good pace. Right from start till end, one will not get bored anywhere. The role of police, along with the deadly interference from the sick politicians is well depicted. The dialogs delivery and acting by Arjun Rampal and Abhey Deol has been awesome. Though the role of Manoj Bajpai is not too great. The songs are too good and in fact one of them shows the true Indian political play.\n\nThe best part of the movie is its story which shows both the sides – pros and cons of Naxalites and Political leaders. The only part which I felt to be useless is the \"ITEM SONG\" by Sameera Reddy.\n\nIn all, an awesome movie and people should watch it."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "bhaskarkalyan",
        "review_rating": "7",
        "review_title": "Chakravyuh: Promises Lot; Delivers Little",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "arupmandal1983",
        "review_rating": "5",
        "review_title": "Naxal movie over coke or pop-corn ;)..............",
        "review_detailed_main": "Chakravyuh is one naxalite movie which would be so comfortable watching in a mall after shopping with a coke in hand.No qualms at all!!! A very sensitive and important issue of today's India coloured in a Bollywood potboiler palatte.The problem of the common man presented in a larger than life scale.Yet it is better than Jha's earlier attempts like Rajneeti or Arakshan,mainly because of a few noteworthy performances.Anjali Patil is the find of the film and only gain for the long run. Abhay Deol can sleepwalk through this kind of a role and does so.Arjun Rampal is not bad while Manoj Bajpai is good in the 1st half and simply absent in the 2nd. Hrishikesh Mukherjee 's 1973 Namak Haram had two friends fighting for values over worker union problems which transforms to armed rebellion & radicalism in 2012.Though the level of film making has only gone downhill in this transformation, the problem of Indian democracy used in the backdrop has grown out of control and proportion.Thanks to Prakash Jha for daring to make his sympathies known.."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Prakash Jha gets lost in commercialism still a decent work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "sidharth-banerjee25",
        "review_rating": "6",
        "review_title": "A Fair TimePass But Only A Moderately Good Movie...",
        "review_detailed_main": "Prakash Jha's latest attempt to provide a bird's eye view on our nations yet another \"hot\" topic of concern as well as discussion Chakravyuh is a film which if watched without much concentration may please the viewer. But in my case he again fails to deliver. I am not saying it's a bad film but it isn't any magnum opus either.\n\nThe story of revolving around two besties( Arjun Rampal and Abhay Deol) in the background of Naxalism, Chakravyuh is full of stereotypes. Corrupt officials, rich n greedy businessmen, rapist cops, a hottie with a meaningless role etcetera etcetera.\n\nStill it manages to engage the audience with gripping action sequences though the predictability of the storyline is embarrassing.\n\nAnd then the conclusion where we are left wondering why all this happened if nothing had to change at all?\n\nNevertheless, the film does boast of good to exceptional performances from the cast whether its the veteran Om Puri or Manoj Bajpai who never seem out of character to the leads Abhay who tries very hard and Arjun who gives his best considering his restricted range of grunts and expressions. Even Anjali Patil impresses here and there and Esha Gupta looks hot even in a police uniform. The pace is good but the music is just ridiculous especially the Sameera Reddy item song. What a waste!\n\nI fail to understand the basic mindset of Prakash Jha. Because somehow I feel he thinks that just because there are bullets flying everywhere and fumes of smoke and dust rising up in the air with the lead actors running to save their lives the audience can blindly ignore the stupidity the support cast which involves the villagers, extras, etc are doing. The direction doesn't seem to be compact whenever a lot of people are involved which in films like Chakravyuh should be of of paramount importance.\n\nI know I might have been a bit hard on him considering the fact that I just came out watching Sri Devi's English Vinglish an hour before that so I would suggest you to go ahead with it as am sure you wouldn't get bored afterall.\n\nBut seriously Mr. Jha Impress us more!!\n\nMKD Rating- 2.5/5"
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "kilmozee",
        "review_rating": "9",
        "review_title": "Not Everyone's cup of tea.... But loved watching Arjun Rampal and Manoj Bajpai",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "ashdoc53",
        "review_rating": "7",
        "review_title": "Story from the heart of uncharted India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "karan-talwar",
        "review_rating": "10",
        "review_title": "An engaging thought provoking film",
        "review_detailed_main": "Bikas Bhagat, in a review in Zee News, gives the movie four stars out of five and says the movie is balanced in the way it tackles something as complex as Naxalism.\n\nWhile he says that \"the story has nothing much,\" he lauds the actors for \"bringing authenticity by justifying the characters that they have been casted in and by gelling with the theme of the film so well.\"\n\nHe writes that the \"real find of the film is the femme fatale character of Juhi the rebel played by Anjali Patil.\"\n\nMr. Bhagat said he enjoyed the music, which is by Salim-Sulaiman, Aadesh Shrivastava and Shantanu Moitra.\n\n\"They have done a fantastic job of keeping the audience involved with the story. Songs of the film are completely in sync with the mood of the film. 'Mehangaai' stands out,\" he writes.\n\nOverall, he says that it \"would be a big mistake\" to give \"Chakravyuh a miss.\"\n\nA review by Subhash K. Jha on IANS also gives the movie four stars.\n\nHe calls it Mr. Jha's \"most resolutely etched and firmly grounded drama since Mrityudand, and a work way superior to his last two films – Raajneeti and Aarakshan.\"\n\nMr. Jha writes that the director \"is in full command of his wide-angled canvas,\" and culls his research on the red corridor in a \"condensed but brightly illuminated screenplay.\"\n\nHe also praises the closing sequence of the movie: \"Thanks to the brilliantly-written words and the restrain with which the two actors put their viewpoints forward, the sequence scorches the screen.\"\n\nMr. Jha \"only shows us glimpses into his characters' hearts before pulling back ruthlessly to allow them to go about their jobs as professionals who have to travel far beyond their call of duty,\" notes the reviewer. He argues that the movie should have been longer to explore the relationship and emotions between Mr. Deol and Mr. Rampal as well as Ms. Patil.\n\nHe ends by writing that \"the process of social awakening that started with the cinema of V. Shantaram and B.R. Chopra has come a full circle,\" with \"Chakravyuh.\"\n\nIn a review in The Times of India, Meena Iyer gives the movie three-and-a-half stars out of five.\n\nShe praises Mr. Jha for choosing to make a film on Naxalism and \"for sticking his neck out.\"\n\nFor Ms. Iyer, \"the personal and professional equations\" between Mr. Rampal and Mr. Deol \"make for a compelling film with some rock-solid emotions.\"\n\nShe writes that Mr. Jha \"must also be complimented for the scale and performances he has extracted from his lead cast.\" She finds Mr. Bajpai, Mr. Deol and Mr. Rampal \"compelling.\" \"Esha starts on a shrill note but improves later,\" she notes."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "radix_govind",
        "review_rating": "7",
        "review_title": "Typical script on a fresh plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "shaktiswarupblore",
        "review_rating": "4",
        "review_title": "Chakravyuh - A Trap, where you loose Money and Time!",
        "review_detailed_main": "We all have seen many wonderful presentations from Prakash Jha Banner, but you will be disappointed thinking why I came to theatre to see such a worthless and nonsense movie. Me and my friends went inside the movie hall with a smile (High expectation) and left scratching head.\n\nStory line – Boring. Unnecessarily stretched out a lot, to maintain and accommodate the timing of normal Hindi movie (Average timing of a Hindi movie is 150 min).\n\nActing Skills – All were OK except Arjun Rampal, whose dialogues failed to leave strong impression (Poor).\n\nQ: Worth watching in Theatre? A: NO.\n\nOverall Rating: 4/10"
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "nlany",
        "review_rating": "9",
        "review_title": "Beautiful India",
        "review_detailed_main": "For the first time, I feel the great poetic spirit in India Songs & Dances, with revolutionary romanticism theme set in this movie.\n\nVery beautiful-- all scenes, local peoples, guerrillas and the story of fighting for justice.\n\nAnd also, it based on realistic social problem of India or any other developing countries which still have \"enclosure movement\" - local poor villagers are swept from their land by polices or mercenary forces supported by rich people/big companies.\n\nStrongly Suggest!\n\nLal Salam! This movie leave us a question: How can democracy be both fair and peaceful? By people armed by Maoism political party & army?"
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "rahulturbo",
        "review_rating": "6",
        "review_title": "You can skip it",
        "review_detailed_main": "Chakravyuh- Jha fails to provide it a deserving end yet again, looks like it's related to issues he addresses.....unable to take sides. Abhay Deol could've done better in certain scenes- his casual approach sometimes was too casual for this film; everyone knows Rampal has limitations when it comes to acting...he was tried to be stretched. Anjali Patil is good through the end, Manoj Bajpai and Om Puri were excellent as usual but there roles were clipped, looks like they were underused if not wasted Kabir Bedi was same as always Cinematography will keep you bound to the seat Direction was good in most situations, issues addressed are genuine and handling is good too All in all worth a watch but don't expect to be blown away or s**t......some serious movie, with expected storyline"
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "sayakboral-1",
        "review_rating": "1",
        "review_title": "I'm sorry I'm not convinced - this is a fake, anti-national film that needs to be boycotted and the movie-makers should be tried for treason",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "sunny-jindl2",
        "review_rating": "6",
        "review_title": "Its too long with oft repeated plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "vishalkanaujia",
        "review_rating": "6",
        "review_title": "A half baked cookie",
        "review_detailed_main": "Prakash Jha is known for touching the nerves of contemporary problems of Indian society. Chakravyuh lacks the depth and breadth to analyze a complicated problem: Naxalism. The plot is good but it lacks good script and movie appear incoherent. The flow of story makes no sense many a times. Violence scenes are unnecessary, less brutal. Battles are too shallow, dark and fake. Paan Singh Tomar showed them better. Many lead actors(Mano Bajpai, Om Puri) are left unused and their roles are unjustified, too short to make an impact. Casting could had been better especially Arjun Rampal. Abhay Deol is too soft for playing as a bad guy.\n\nThe only beauty of the movie is that it helps you understand both sides of the war; and you will be perplexed for which side to support! It shows that the system and people are not the same as preached by a democracy. It also highlights that politics is in the driver seat."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "roshanp-61776",
        "review_rating": "10",
        "review_title": "Awesome Social Awareness",
        "review_detailed_main": "Fantabulas Work done All the stars. I think this movie also has effects of Nepotism. I loved the Movie a lot. This is the first time I am rating any movie. Only after Sushant's Death I have realised the responsibilities of an audience."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "sujal-sheth",
        "review_rating": "9",
        "review_title": "A more realistic movie by story",
        "review_detailed_main": "Movies tries to focus on Naxalvadi movement and government action against them. But as story evolve it demonstrate more insight into issue which is real message of movie. Good story, nice plot but direction can be improved for plots where Arujan Rampla faces Naxalvadi on front without none of them can shoot with their gun but he can .. ;) ..\n\nIn summary, i can say, it's worth watching movie. People who likes off-bit/story-based/real story based, will like this movie a lot. People who are looking for commercial or entertainment movie shouldn't see this.\n\nI can see more people have given less rating due to direction or some plot issue but I can say as far as main message of movie perfectly delivered, they shouldn't complain.\n\nI can say it is far worth watching movie than any other junk commercial/entertainment movies."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "festrel",
        "review_rating": "1",
        "review_title": "Powerful Subject , peppy caste , something Horribly went wrong !",
        "review_detailed_main": "Alright much awaited prakashjha movie on NAxal movement hit the screens this week. I have to admit that the trailers did create quite a stir and made it much awaited flick post dushera. However , something went horribly wrong with the movie and prakash jha. What the hell is a Item number doing in an INTENSE movie ?? Poorly written dialogues waste competent actors like abhay, manoj and Arjun efforts to give some substance to the film. It could have been another feather in prakash jha's cap but i think he overdid it. I am highly disappointed with prakashs direction this time .watch the 1st half and sleep through the second you will still be able to get your penny counted for."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "subhankarkantapahari",
        "review_rating": "10",
        "review_title": "Best movie about society",
        "review_detailed_main": "Everything is realistic.... Ministers, political leaders and the rich businessmen are the main villain of our society.... The police just obey what they're ordered. And people become Maoists only for the political leaders and ministers who don't think about people but only for businessmen.... It's one of the best and realistic movie I've ever watched.... If there are the minimum facilities which every Indian should get from Govt.then there would be no Maoist.... Education,Health, Communication and other necessary facilities should be available in Each and every area..... They should think about every citizen,not only for the Urban area."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "rainmaster-phd",
        "review_rating": "3",
        "review_title": "Even a laptop watch may NOT be worth it!",
        "review_detailed_main": "To sum it in one word - its way below average. Definitely not worth watching on the big screen. Even on a laptop or so, I would think twice if I'd have not gone early to watch the film and did some prior research before deciding whether to watch the film or not.\n\nThe director picks up an important issue, that of Maoists, but fails to deliver on the plot. The issue itself has immense potential and a plot that explores its finer details or even a simpler one focusing on few of its dimensions imo could easily have been built. However, the plot..as it turns out..fails on any of the above aspects. The film greatly disappoints. It may lack depth which chalo is okay, but what is not okay is that it greatly lacks details even in terms of execution around the plot which the director has chosen - (without disclosing much) this revolves around typical love-story drama surrounding the chosen issue which I assume may to please the Indian audience (which the film may not!). Such a film requires performances and one, not one of the performances is even close to what I may term as 'satisfying' or 'decent'! The only positive thing I see is that someone who has never read about the subject may be introduced to the subject and may find the film a little tolerable (if one ignores the love drama which also isn't executed well !!), but if he/she expects even little depth or details on what is being uncovered on the subject, chances are that he/she too may end up being disappointed.\n\nSumming it up, I would give it a 3/10 - the 3 simply for generating some interest on the issue for an average GK person like me to do some further google search on the issue. Else I'd advise people to give it a skip."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "Sid3960",
        "review_rating": "9",
        "review_title": "Brilliant and unbiased",
        "review_detailed_main": "Prakash Jha has delivered a brilliant movie and deftly handled a very complex issue facing the nation. The movie is extremely gripping and from the very first frame the movie maintain a brisk pace and viewer is effortlessly drawn into the ground reality of the spread of Maoism in India. Jha has done full justice to a very difficult and challenging theme and it requires tremendous courage to deal with a much misunderstood issue. The storyline, direction, acting, cinematography and music create a wonderful movie experience rarely seen in Hindi cinema. Jha must be congratulated for doing 100 percent justice to the story and creating a masterpiece. A powerful movie indeed."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "sharmaas",
        "review_rating": "1",
        "review_title": "Naxsal communist prapaganda",
        "review_detailed_main": "This movie support and spread naxal prapitamah Far from reality it shows how goverment and amry is against poor people And naxsals and good people how are fighting for them Pathetic"
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "ppg2358",
        "review_rating": "1",
        "review_title": "Mao ze Dong was a tyrant. And ccp will be eradicated.",
        "review_detailed_main": "A vile ccp attempt to demonize India. Aaaccckk thooo. Never seen such a disgusting movie. Absolutely horrible representation. This movie should be banned.\n\nA poor Indian can not afford a meal, but can procure a firearm to fight against a government. What a logic. This movie represents the utter false image that ccp wants to free oppressed people. Whereas no one talks about Tiananmen square massacre...?????Yes xingpingpong banned Winnie the Pooh, but can't control internal corruption.\n\nThis movie is just rouse to disrupt India's peaceful harmony. Nothing is true about this movie. The producers are funded by ccp to malign the name of India. Which is a fiercest competition for ccp for global dominance."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "sdinesh123",
        "review_rating": "2",
        "review_title": "pathetic Desi low budget remake of Avataar.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "kapilkamboj-45088",
        "review_rating": "1",
        "review_title": "Justifying the naxalites",
        "review_detailed_main": "Worst movies, but it os expected from Bollywood what else they can show. Makin fun of army and police probing them wrong and making terrorist and naxalites heros."
    },
    {
        "movie_id": "tt2292625",
        "movie_name": "Chakravyuh",
        "movie_rating": "6.8",
        "review_username": "chillupunter",
        "review_rating": "4",
        "review_title": "The beginning 15 mins are enough for me!",
        "review_detailed_main": "The movie lost my interest as soon as I saw the scene where the naxals are spraying their guns nonstop. There it gives away that it's not going to be an undergroundish movie."
    }
]