[
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "shortc-85671",
        "review_rating": "3",
        "review_title": "I feel numb.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "ajgalang-81565",
        "review_rating": "3",
        "review_title": "Eh",
        "review_detailed_main": "Not a strong parody movie. Some of the jokes are just awful and it's a little sad to see some name/recognisable actors in this.\n\nZach (Alan) was reasonably funny and I saw flashes of Ed (Stu) and Bradley (Phil) but there was barely enough in here to elicit a chuckle.\n\nBonus points for Katnip's breasts."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "Not even when hungover would this be a great movie...",
        "review_detailed_main": "\"The Hungover Games\" is one of those type of spoofs that mean well and tries really hard, but ultimately fail to deliver. Now, I am not saying that the movie is bad, it just really wasn't as funny as it was supposed to be. I can honestly say that I didn't laugh a single time throughout the entire movie.\n\nFor a movie of this type, then \"The Hungover Games\" takes on a variety of other movies, such as \"Ted\", \"The Hunger Games\" (obviously), \"Pirates of the Caribean\", \"Avatar\", \"The Hangover\", \"Charlie and the Chocolate Factory\", \"The Human Centipede\", \"The Lone Ranger\", and so forth. It is meant well, I am sure of it, but the comedy just slipped through every crack possible.\n\nThe acting in the movie was adequate, and people were doing fair jobs with their given roles, they just didn't have too much of a script to work with.\n\nI used to love spoofs, such as \"Hot Shots\", \"Scary Movie\" and the like. Whether it is because I outgrew the genre, or because the spoof movies today are lacking what they did back in the 1990's, I do not know.\n\n\"The Hungover Games\" is good enough entertainment if you have absolutely nothing else to watch."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "Platypuschow",
        "review_rating": "2",
        "review_title": "The Hungover Games: Offensively stupid",
        "review_detailed_main": "Plot\n\nA spoof on The Hangover (2009), The Hunger Games (2012) and other movies, TV series etc. 4 men, with hangovers after a bachelor party, find themselves in a future, dystopian, kill or be killed game.\n\nCast\n\nA combination of people who should be ashamed of themselves being involved in something like this and pitiful folks like Tara Reid & Jamie Kennedy who will take any script they're offered. Caitlyn Jenner is also present, for some reason.\n\nVerdict\n\nWe went through a spate of these types of movies, Date Movie, Epic Movie, Disaster Movie, Meet the Spartans etc and let's be honest the one consistent thing about them is that they were all truly unconditionally awful.\n\nThe Hungover Games is the same thing, please allow me to break it down for you. Loosely splice two current popular movies concepts, throw in lots of current pop culture references and characters (All the things currently trending), incorporate humor befitting an 8 year old and boom you have yourself 90 minutes of stupidity off the scale.\n\nThe Hungover Games also slaps us with overwhelming levels of \"T&A\" which returns to the 8 year old mentality.\n\nNever mind Panto, this is where careers go to die.\n\nRants\n\nWho are these films for? I genuinely don't understand it. It's not loaded with easter eggs and neat references people will appreciate, the Avatar character for example is just a naked woman painted blue who contributes nothing and is only on screen briefly. The humor is juvenile but the movie rating is too high for children, adult's will find it infantile, there is no real plot, the cast don't even try, it's just all so truly terrible! Why do films like this exist?\n\nBreakdown\n\nCast phone everything in Offensively unfunny Stupid beyond words Kennedy, Reid and Jenner!"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "lnvicta",
        "review_rating": "2",
        "review_title": "The Hangover: Frat Bros Edition",
        "review_detailed_main": "This movie is dumb. Just look at the name. Yeah, I know it's not supposed to be smart but it is supposed to be funny, and unfortunately this is not. I will say that it is better than abominations like The Starving Games, Vampires Suck, Scary Movie 5 and Disaster Movie, but that's like saying dog p*ss is better than cat sh*t. They're both awful and both leave a bad taste in your mouth.\n\nThis movie gets an extra point for potential. It's refreshing to see a spoof movie that isn't by the two that shall not be named, and some ideas in the movie do work. There's a plot this time: We follow the three Hangover guys (who bare a striking resemblance to their respective actors) on their Hunger Games adventure. I also like how the spoofs are limited to a certain character or group participating in \"The Hungover Games\", such as The Real House Wives, Ted, Thor, and a group of every Johnny Depp character of the past few years. Some of them are funny - I really wanted more of the Johnny Depps - but some just don't work. A team for gratuitous sex? I know it's making fun of the fact that a lot of movies have gratuitous sex for the sake of it but that's exactly what it's doing here, so it's like a spoof that's spoofing itself... and it's not nearly as deep as it sounds.\n\nI smiled a few times in this movie. The main cast was fine (the supporting cast had some horrendous actors though), and I like how the movie actually has a story and an attempt at coherency. But the number one thing I look for in a comedy are laughs, and The Hungover Games did not provide any. If you're smashed and with your friends and want to see a really dumb movie for some cheap laughs for an hour and a half then yeah you might enjoy The Hungover Games, but for anyone else, I implore you, don't watch this movie."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "infogfb",
        "review_rating": "1",
        "review_title": "Terrible, not funny, bad actors, stupid story!",
        "review_detailed_main": "Unbelievable that this can be found on Netflix! Absolute stupid movie! Not funny! Actors completely suck! Story is bad! So sorry I wüssten almost 45 minutes before I complete gave up! Zero star review is appropriate!"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "redbullrex",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "30 minutes in and I couldn't take it anymore. Some people will enjoy this movie, because it's comedy. But in my opinion the comedy was terrible. But if you are somewhat bored give it a go, good luck..."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "JonHolmes123",
        "review_rating": "2",
        "review_title": "No Hangover Cure",
        "review_detailed_main": "The Hungover Games is the latest sluggish addition to the \"Let's parody anything that might be remotely funny\" category of film, lampooning The Hunger Games (duh), Ted, The Hangover series, Carrie, Django Unchained and others.\n\nThis film steals so much from its peers, while at the same time lacking so many of its own original ideas that our main characters are actually taken directly from The Hangover. And for the most part, the storyline, or at least the first fifthteen minutes is also exactly the same as the 2009 Vegas Comedy. Just like in those movies, the fourth friend of the group is misplaced, leaving the first three to try and remember all the terrible things that they did the night before, in an attempt to rediscover him. I know this is a parody, but really? Word-for-word lines from The Hangover have been pilfered as their own. It's astonishing the true lack of any creativity that The Hungover Games possesses, whereas other awful spoof movies such as, say, Scary/Epic Movie seem to have some (very few) of their own ideas, here, \"writers\" Kyle Barnett Anderson et al, make it feel like they've photocopied Todd Philips' screenplay badly and then taken it for themselves.\n\nBut it turns out our three buddies have been transported to Hunger Games Land where they have to fight to the death with all the other favourable movies of the last seven years or so. This takes all those films you may have possibly enjoyed over the past few years and throws them in to one terrible mush: watch as the Ted bear has a penis, Katniss Everdeen has had her name changed to \"Katnip\" (HA!), and Willy Wonka is a homosexual. Add to that pops at race, some Human Centipede \"jokes\", underage sex gags and just a little bit of necrophilia and you experience an hour and a half of pure film diabolica. And for the people who defend the jokes for being jokes, perhaps if they were funny, fine, but otherwise it just comes off as offensive and downright lazy. The brow for this movie is so low that it's scraping along the ground.\n\nI'll end on the only two positives: The people who play the Hangover team are very convincing, and the film itself is shot quite nicely. Otherwise, please, do not go and see this movie. I would rather have been dispatched by a Hunger Games arrow to the face then to have seen this film. Run – sprint, even – away if someone suggests watching this piece of garbage.\n\n@JonnyJonJon1"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "TroelsML",
        "review_rating": "2",
        "review_title": "Yet another spoof movie done poorly",
        "review_detailed_main": "The Hungover Games takes the known and loved characters from The Hangover and places them in a world similar to The Hunger Games. In the process, it attempts to criticize Hollywood for a lack of originality. This is perhaps the only funny joke in the movie, seeing as it is itself completely without original thought.\n\nIt doesn't make fun of the Hungover characters, it just copies them and reenacts their mannerisms in the Hunger Games world. In the process, it also includes various other token characters from pop culture. However, these tertiary characters are fitted with poorly done costumes and for the most part equally poor actors.\n\nI must however admit, that many of the actors in the movie are above average for the genre. The story and whole setup is extremely lazy however. I have a hard time imagining anyone being particularly proud of this movie.\n\nThe movie leaves a lot to be desired, but I suppose it could be watched during a severe case of hangover."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "otley-19698",
        "review_rating": "1",
        "review_title": "Awful just Awful",
        "review_detailed_main": "This will probably be the worst movie I have had the misfortune to watch but thankfully it only took me 30 minutes to gather my senses and switch it off.\n\nAt no level was this funny or interesting and the actors must be biting their bottom lips by agreeing to take part in such an awful production.\n\n1/10 stars is generous and I find the high scores laughable and wondering if it might have been a better watch with my eyes closed.\n\nBIG miss if you can tempt your way to something remotely watchable."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "face-819-933726",
        "review_rating": "9",
        "review_title": "This parody of movies movie is really worth your time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "awesomematthew22",
        "review_rating": "6",
        "review_title": "One of the best parody films in years...",
        "review_detailed_main": "It's really good. The Hungover Games is a fun movie to be sure with many jokes to keep you laughing. Sometimes the film drags on a joke but mostly the jokes are funny. The story consists of 4 guys who go on a stag party and wake up the next day in a dystopia future. In which they have become Tribute for The Hungover Games with people like. Teddy, Scarrie, Django, Thor, The Real Housewives of District 8 and Katnip. It also features references to Jonny Depp being in heaps of films, The Human Centipede sand Avatar.\n\nThe story can be funny and can keep emotional resonance with the characters and also create a mystery reminiscent of Hangover Part II.\n\nWarning: Unlike other parodies made recently this film contains a bit of drug use, lots of nudity, violence and swearing.\n\nIf you like parodies like Airplane and Loaded Weapon 1, this will surely impress."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "mulierositas",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Only thing worth while seeing in this movie is Rita Volk's boobs, the rest is a colossal waste of time! Really I can't even see the need to write more about this movie, but since IMDb is forcing me to, I'll just tell you that if you even consider watching this movie you should just not do it. If you can't bother to write more then one line about the movie and have to go on babbling like a idiot for the rest of the review you know that watching this movie would only be a waste of time. Really I would highly recommend choosing any other movie to see. I only saw this one because of Rita Volk being in it and here's to hoping she will never ever act in anything as bad ever again, so I don't have to see it. To sum up don't watch the movie unless you are brain dead."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "m_lecarre",
        "review_rating": "",
        "review_title": "Much better than its rating would suggest.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "jonathanrobert-06378",
        "review_rating": "1",
        "review_title": "This movie sucked",
        "review_detailed_main": "This was the worst spoof movie I have ever seen I would not watch it ever agian"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "cameronclrodwell",
        "review_rating": "1",
        "review_title": "BOOOOOORINGGGG",
        "review_detailed_main": "Absloute rubbish i did not laugh at a single scence in the film, dull as dishwater turned it off half way through"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "wdrphotographics",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "Why did they make this? Why did I watch it? Don't be asking yourself these questions, do yourself a favour and give it a miss."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "shades4321",
        "review_rating": "1",
        "review_title": "Doesn't work...",
        "review_detailed_main": "Had a couple of good initial concepts, and some of the cast and acting was actually OK, however, the plot / writing was just terrible. Seemed to have very low budget / production values. It even had some decent special effects in places, which they should have just saved the money on and spent it on the writing.\n\nNothing could save this film once the writing and plot went downhill. Lots of hard cuts between, or during unfunny scenes.\n\nMany, many, many very unfunny jokes and scenes. Even the music is strange. It also failed to do much of a parody number on its namesake. Seems to think it's Family Guy with all the pop-culture references that will date immediately.\n\nI tried hard to come up with other nice things to say, but I can't. I could not sit through it.\n\nCannot recommend."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "graham-87959",
        "review_rating": "1",
        "review_title": "Just STOP!!! Dear lord please!!",
        "review_detailed_main": "It's simple, if your names are David Zucker, Jim Abrahams or Jerry Zucker, you shouldn't be making slapstick comedies. This is just another pathetic effort. Maybe you just need to be super high to muster a laugh. Avoid this crap, it's 1 hours whatever of your life you'll never get back. And lying on your death bed years from now wish for just 1 chance, 1 CHANCE !!! To go back to this day and wish you'd listened to me."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "squirtlepenis",
        "review_rating": "2",
        "review_title": "Mediocre rip off",
        "review_detailed_main": "This spoof relies heavily on other movies and shows for plot and content, there is no originality in this movie and while the acting is funny at times most of it is a rip off of The Hangover and the Hunger games, so much so that it lacks its own identity and seems more like a rip off and a waste of time than a solid movie experience.\n\nI wouldn't call this movie much of an experience, it was difficult to enjoy the story and the jokes."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "About what you expect from this sort of 'comedy'....in other words, hardly a laugh in the entire film.",
        "review_detailed_main": "There is only one reason I watched \"The Hungover Games\"....it just appeared on IMDB's infamous Bottom 100 List today. This is a list of the 100 lowest rated major release films....and I am a major glutton for punishment, as I've seen 95 of the 100 movies on the list.\n\nIt's not at all surprising that \"The Hungover Games\" is on the Bottom 100. After all, MANY similar brainless spoofs are on the list, such as \"Disaster Movie\", \"Epic Movie\", \"Date Movie\" and \"The Starving Games\"--and they are more or less the same. This is NOT a compliment. Each tends to have a lot of very crude and juvenile humor and they are anything but subtle or intellectual...or entertaining. And, like these other films, the mashups simply make no sense...such as merging \"The Hangover\" with \"The Hunger Games\", \"Lord of the Rings\", \"Avatar\" and \"Snowpiercer\". The film abounds with sex toys, crude humor that falls flat and...well,...that's about it.\n\nThe biggest problem with this film and other similar stupid parodies is that they are way too broad. First, they are very broadly written--with little subtlety and with an emphasis on crude instear of being funny. Second, they are too broad in their focus and would be MUCH better sticking with ONE film or one style of film instead of parodying EVERYTHING...which is often illogical and frequently mindless.\n\nSo is this one any better than the rest of these Bottom 100 parodies? Well, there is a lot of gratuitous nudity. This isn't necessarily good....but at least it distracts from the 'humor'. In fact ANYTHING that tries to distract from the dopey jokes is a major plus. Heck, having Pauley Shore come out and juggle or read from the Yellow Pages would be a welcome distraction from the 'humor'! In fact, as I watched \"The Hungover Games\", I cannot recall laughing even once and it's no funnier than the other unfunny parodies on the Bottom 100. A worthless film in pretty much every way that was probably written by chipmunks...really, really DUMB chipmunks."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "pilotgav",
        "review_rating": "10",
        "review_title": "Relax people it's a spoof.",
        "review_detailed_main": "One of the best spoof movies ever. It's called irony folks! So good."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "derekobrien1978-712-549551",
        "review_rating": "6",
        "review_title": "Solid 5 or 6 - I really enjoyed it. And it's on Netflix",
        "review_detailed_main": "Its all too easy to give this movie a low rating, but I say ask yourself, is it really that bad or are you just a little dead inside? I admit I didn't expect to actually watch all of this originally, but here I am writing a review about it.\n\nThis movie has some genuine laughs. I laughed out loud a couple of times. All the lead actors do a great job taking off their respective parody. And you'll probably recognise a lot of the other actors ... although you may not remember from where. The production is also good, with the budget for dildos alone likely in the thousands.\n\nThere's boobs? Who doesn't like some boobs?!\n\nThis movie never intended to be an Oscar contender, but you never know..."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "Otte1",
        "review_rating": "2",
        "review_title": "A non-funny parody movie",
        "review_detailed_main": "I can enjoy parody movies, even had a laugh or two at Movie 42 and Disaster Movie. This is not one of those. There is not even a 'slight chuckle'. Take a pass"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "percymoe",
        "review_rating": "",
        "review_title": "Worst of the Drunken Machismo Flunks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "GINOOO85",
        "review_rating": "1",
        "review_title": "STOP WITH PARODY MOVIES",
        "review_detailed_main": "NOT EVEN 1 STAR WORTH AND ITS NOT FUNNY. SCENARIO IS GARBAGE, AND ACTORS DOENST LOOK LIKE THE HUNGER GAMES."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "alejandroafm",
        "review_rating": "1",
        "review_title": "This is a movie found from the garbage landfill.",
        "review_detailed_main": "This is movie that should have never been made to be released to the public because of how AWFUL it is."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "kateseventh",
        "review_rating": "1",
        "review_title": "Couldn't Get Past One Glaring Issue",
        "review_detailed_main": "I couldn't get past they billed Bruce Jenner as Caitlyn Jenner when the film came out in 2014 and Bruce/Caitlyn came out the following year. Because of this one issue I couldn't even watch the rest of the film after Bruce's character arrived on screen."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "JensOgVovhunden",
        "review_rating": "1",
        "review_title": "Happy new year.",
        "review_detailed_main": "I hope this will be the worst thing I wasted twenty minutes on this year. I rated 4421movies og series. This is my 12' \"one star\"."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "thespeeddiledilemma",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "A spoof movie doesn't have to do much to get it right so the fact it failed in every way is kind of an accomplishment. Scary Movie 2 and 3 and Epic Movie had me in fits so I don't think you can argue that I just don't like spoof movies but this one... It was lame.\n\nA spoof film doesn't have to be tasteful or clever. It doesn't need good acting. It doesn't even have to make sense, it just has to be funny. But this is just boring. It felt like everything that COULD have been funny just ended up being stupid in- your-face nudity. Relying on dildos, curse words, pee, poo and breasts to make a scene funny just seems lazy. A lot of people are going \"But dude, it has BOOBS in it!\" Guys...if you think boobs make a movie good, you need to find a way around your parents' Safe Search.\n\nI'd rather go watch Sex in the City. And I HATE Sex in the City."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "blbbg1",
        "review_rating": "4",
        "review_title": "Eh, not as bad as those awful Seltzerberg films, but still kinda lame",
        "review_detailed_main": "I saw this for free on IMDb's Freedrive and it was \"meh\". I did laugh at a few scenes, but that was it. While this film was still a letdown, I will say this; It wasn't insultingly unfunny like, say Epic Movie or Disaster Movie. There was a least some attempts at humor and they actually tried to make an actual parody film that wasn't full of irrelevant pop culture references that weren't funny (well, sorta), but compared to anything Setlzerberg has made, I give this an E for effort. It doesn't help that like Epic Movie, this film also features cameos from Willy Wonka (Johnny Depp version) and Captain Jack Sparrow and those were even still dated, back when Epic Movie was in theaters, back in early 2007. If want to watch this on Freedrive, I'd say go ahead, just don't expect anything like Airplane or Scary Movie."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "xMartyMcFlyx",
        "review_rating": "1",
        "review_title": "Couldn't even finish it",
        "review_detailed_main": "I got about 20 minutes before I pulled the plug. There are funny spoof movies out there, like Scary Movie, Naked Gun... and then there's this movie. While it is aesthetically done well, the jokes are lame. There is no real LOL moment. The Hangover was a great comedy. This is just riding on the success of the movie it's spoofing."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "guynvistaca",
        "review_rating": "8",
        "review_title": "A laff riot unless you are a stuffy shirt!",
        "review_detailed_main": "I love this spoof of The Hangover movies, Hunger Games, Thor etc...so frigging funny. I can see, however, that this is not everyone's cup of tea. Very creative writing with dialogue and bits that made me laugh. Its cheesy but hey life isn't always Grade A movies. I also like the actors the actors are portraying. The mannerisms and attitudes are spot on especially the hangover guys. And using the real names of the actors that the actors are spoofing is fun.\n\nIf you are not looking for something to change the world and just want to have fun why not. Of course if you don't enjoy spoofs don't bother watching. Those of you that do will have a blast. Have I used my 10 lines yet?"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "Floated2",
        "review_rating": "6",
        "review_title": "Some Decent Comedy Sequence",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "wilhelmdanielg",
        "review_rating": "3",
        "review_title": "I've seen worse",
        "review_detailed_main": "Going into any parody movie you really shouldn't expect anything. With the bar set low, it's a little less bad.\n\nI laughed a handful of times but definitely lost interest before the movie ended. A few good gags but they're lost in an underwhelming parody. If you're really bored and out of things to watch I guess it might be okay? Wouldn't watch it again."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "nunchaku_nc",
        "review_rating": "",
        "review_title": "Actually Funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "kosmasp",
        "review_rating": "3",
        "review_title": "Tit-le",
        "review_detailed_main": "Very funny I know - almost as funny as the movie ... maybe a bit funnier. Kidding aside and boy you will have to search hard to find kidding here, the best thing about this, is the title. I watched the unrated version, so no idea what the other version looks like, but I got the whole package, all the swear words, all the nudity and whatnot.\n\nNow this is combining Hangover and the Hunger Games, but it has many other characters from other movies. Be it Carrie, Ted, every other character portrayed by Johnny Depp and so much more. Now if that alone leaves you chuckling ... well you will have fun with it. Whatever the case and a Jamie Kennedy that is annoying multiple times (as in more than one character portrayed), if you watch it, endure the end credits and get a bonus scene that will either infuriate you or make you laugh out loud. It depends on your ... humor I would like to say, rather than anything else ..."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "churchofsunshine",
        "review_rating": "2",
        "review_title": "10/10 for effort but 0/10 for overall result",
        "review_detailed_main": "I'm sat here writing this review and trying to work out which is the better spoof movie - \"The Starving Games\" or \"The Hungover Games\". It's a difficult choice. It's kind of like offering me the choice of taking a bullet to the brain or a bullet to the heart. Neither film will ever be classed as a cinematic masterpiece.\n\nI do get the feeling though that the makers of \"The Hungover Games\" are actually trying. They've tried to write a good script, they've tried to give it decent production values and even the actors seem to be trying. It's a little more than can be said of the stuff that Freidberg & Seltzer keep pumping out. It's perhaps a little disappointing then that none of the jokes in the film really seem to deliver and it all seems to land off-target. I didn't laugh once.\n\nI was sober when I watched this. Maybe to enjoy it the most you do actually need to be hungover! That's the only time I'd probably find some of this movie actually funny. A-plus for effort but C-minus for execution. Not great."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "rjsf96",
        "review_rating": "2",
        "review_title": "Entering The Hunger Games Would Be More Enjoyable",
        "review_detailed_main": "Spoof films are extremely hard to pull off. The key is to be subtle, yet not so much so otherwise the audience will not understand the joke. It is imperative though to not make the gags brash and obvious. This is where the alleged comedy 'The Hungover Games' fails.\n\nThis parody stars lookalikes of The Hangover series and is supposed to be a follow on from 'The Hangover Part II'. The creators of The Hangover series had no part in this spoof and if they did, there would at the very least be something to laugh about. All you can find funny here is the incompetence of the Director and writers.\n\nIn the film the Wolf Pack or the lookalikes of them get drunk again the night before Doug's wedding. Unfortunately for themselves they are entered into the Hungover Games and must fight to the death against other celebrities and film characters to survive.\n\nThe only positive for 'The Hungover Games' is that in the opening text it informs us that this deathly tradition came about because of \"Hollywood's lack of creativity\". Now that I can agree with. Yet why mock the lack of creativity when the film you have possesses the same quality? It makes no logical sense but perhaps that is the point. As the film has no logic to call its own.\n\nThe many negatives for 'The Hungover Games' can be collated into a list, thus outlined below. Pop culture references are only funny if done in a tasteful manner or with some notable skill. I know it's exceedingly odd to compare this film to a Disney one and yet Hercules knew how to handle pop culture references and still achieve the key for a comedy – laughs.\n\nOther jokes are either scatological, racist, homophobic, sexist or all of the above. 'The Hungover Games' never knows when to stop in terms of the excessive nature of the gags and its relatively short run time still manages to feel far too stretched for its own good.\n\nIt's especially bothersome to watch when this comedy has less jokes than 2012's 'The Hunger Games'. I'm not sure how this was managed but its an impressive achievement none the less.\n\nEven the shots in the film are sickening to look at, filmed poorly and cheaply. People who took issue with the presence of shaky camera in the first Hunger Games film had better close their eyes promptly as well as covering their ears.\n\nI could go on and on about this films problems but I really do not wish to. In fact I would rather go and watch a comedy that makes me laugh to my heart's content. With every film I see, I feel that every single one deserves a chance. With Stolberg's 'The Hungover Games' I plead you to steer clear and not give it the benefit of the doubt. Film making this shallow does not deserve to be viewed by anyone of any age."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "NeopolitanDreams",
        "review_rating": "5",
        "review_title": "Just about the average parody movie",
        "review_detailed_main": "Honestly, it's not the worst movie ever seen, or even the worst of it's genre. Though it is still pretty bad.\n\nI was nodding off for a while, that is until I saw Sophie Dee (Kirsty Hill). Her inclusion (along with Kayden Cross's) helped get this it's five-star rating from me. 4 boobs = 4 stars.\n\nThe other star was because there were a few times that I actually laughed at a few of the jokes and usually NEVER find anything to laugh at in these awful parody movies.\n\nI'd say give it a watch if you're truly bored (or are a person of culture who appreciates Sophie Dee, like me)."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "Go_For_The_Jugular",
        "review_rating": "1",
        "review_title": "Jesus wept!",
        "review_detailed_main": "I could only watch 20 minutes and had to concede defeat.\n\nAbsolutely NOTHING to like about this film to keep me interested...horrible characters, horrible acting, horrible cinematography...just cringe in every area.\n\nI have no problem with spoof movies...some are brilliant. Scary Movie 1, 2 and 3 for example.\n\nThis is just the type of film that tries way too hard...and fails as a result.\n\nAll involved should be ashamed."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "emryse",
        "review_rating": "2",
        "review_title": "Laughed Twice, Stopped Midway",
        "review_detailed_main": "Boring, half-baked, stupid, these are just a few words that come to mind when thinking of this film. I don't know if the people behind this thought they were making some clever satirical look at the Hollywood blockbuster movie industry but what they end up making feels like a 2012 YouTube sketch. I watched a bit of this film, about half, and I did laugh a couple times but in the end I was just bored and uninterested, I highly doubt there is an audience for this kind of film but who know maybe someone out there will enjoy it."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "premierleaguefoda",
        "review_rating": "1",
        "review_title": "I couldn't finish watching",
        "review_detailed_main": "A parody intention is to make us laugh, I didn't laugh."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "tailsofthewind",
        "review_rating": "10",
        "review_title": "This is off-the-hook hilarious, and I am not one for spoofs!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "Shopaholic35",
        "review_rating": "6",
        "review_title": "It's pretty funny.",
        "review_detailed_main": "The cast do a pretty good job at ripping off the original hangover boys, it's almost too good but it starts to get a little weird when the hunger games cast are introduced. Bruce Jenner and Hank Baskett's appearance is possibility the most awkward thing of the whole movie. They are super creepy and are the worst so-called actors I have ever seen. The rest of the cast are fine, not great but they generate some laughs.\n\nOverall the movie really is pretty funny. It's a solid parody and it's nice to see something that isn't too vulgar and obscene; that was left till the credits. I understand that this movie is not everybody's cup of tea but it deserves a higher rating than it currently has. Just don't take it too seriously."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "s_abdulhafeez",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "A failed attempt to bring parody to a box office hit."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "sadi-22747",
        "review_rating": "1",
        "review_title": "Can it get worse than this?",
        "review_detailed_main": "The worst caee of bad movie. Any further comments are futile."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "furryfrenzi",
        "review_rating": "5",
        "review_title": "Look alikes",
        "review_detailed_main": "It's weird that the cast of the movie look a lot like the original cast of The Hangover. Uuuuggghh... why though?"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "jacobkongsted",
        "review_rating": "5",
        "review_title": "Kinda Lane but alright",
        "review_detailed_main": "The humor is kinda Lane, but its still somehow entertaining. The actors are also alright but tbh this movie has a deserved rating at 3.5."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "vincewyldeshow",
        "review_rating": "5",
        "review_title": "Makes You Chuckle",
        "review_detailed_main": "This movie has a \"I'd buy it if it were in the Walmart dump bin\" buyability to it. It's a halfway decent satire, but certainly not on the level of Blazing Saddles or Space Balls. But then again, you couldn't do either of those movies in today's world which might be why we get such sad offerings.\n\nThey did a fair job of lampooning Hunger Games. There were some decent laugh out loud moments, and the cast was likable. Except Curt Cobain guy that drank a lot. He was forgettable.\n\nI'd add this to my collection if I found it for 5 bucks. Or in a movie 4-Pack for 10 bucks. But that's the extent of my spending on this title."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "vegetagoku",
        "review_rating": "2",
        "review_title": "My favourite steaming pile of garbage",
        "review_detailed_main": "It is awful. Terrible. One of the worst parody movies ever made. The acting is atrocious, the jokes are as flat as a glass window and I lose braincells just thinking about it.\n\nFor me, it's so terrible than it's funny. The amount of effort put into this is in the negatives. Who thought it was a good idea to greenlight this? Why was this even made? Was there a script at all?\n\nI just giggle thinking how they had to do this crap with a straight face. I become more disabled listening to these people talk with the enthusiasm of a funeral.\n\nIt provides the same intellectual entertainment as TV static.\n\nDespite all of that, it's my favourite. It is so unbelievably stupid that I find amusement that somebody was desperate enough for peanuts to \"act\" in this."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "ashfordofficial",
        "review_rating": "2",
        "review_title": "As expected from a parody",
        "review_detailed_main": "I'm obsessed with these silly Hollywood parodies. Such a shame they stopped making this type of movies nowadays. This film took some genuine efforts into parodying its source materials/films and I respect that.\n\nI'm obsessed with these silly Hollywood parodies. Such a shame they stopped making this type of movies nowadays. This film took some genuine efforts into parodying its source materials/films and I respect that.\n\nI'm obsessed with these silly Hollywood parodies. Such a shame they stopped making this type of movies nowadays. This film took some genuine efforts into parodying its source materials/films and I respect that."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "msblackonline",
        "review_rating": "5",
        "review_title": "The Crossover of Movie Genres - Better Than I Expected",
        "review_detailed_main": "The guy who plays Alan from The Hangover did a bang-on impression! I actually thought he was the original castmate. In fact, the guys that played the cast from The Hangover performed their roles very much like the original cast, which means they can act! Adding well known characters like Carrie and Catnip (Katniss from Hunger Games), gave viewers more reasons to keep watching. I thought their costumes and performance were also like the original actors and well done. Ted the bear was a nuisance as well as Tonto and weren't needed add-ins. The way spoofs flaunt raunchy sexual content, the 'lines' always seem to get blurred. Come up with something new Hollywood writers and directors!"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "JayPatton88",
        "review_rating": "9",
        "review_title": "The hunger / hungover games",
        "review_detailed_main": "I think this movie combined two movies into one, and it was better than the two movies it combined! Condensed and saved time, watch this instead of The Hunger games and the Hangover to save time! ;)"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "GAME SET MATCH",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "mjjmolina",
        "review_rating": "5",
        "review_title": "Better than the original.",
        "review_detailed_main": "The Hangover was great. But, let's be real here, The Hunger Games was absolute trash. This movie redeems it somewhat by parodying it. This movie asks the question of what if you took the Hangover and the Hunger Games and smooshed them together. I cannot imagine why they picked those two movies to spoof, but I'll give them credit for at least melding them together the way they did. The gags are sophomoric and there's more toilet humor going on than you'd find at a plumber's convention, but at least it tries to entertain you with a story that makes sense and isn't full of nonsense, unlike the Hunger Games."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "Eric266",
        "review_rating": "3",
        "review_title": "OMG Its Bad",
        "review_detailed_main": "I generally try to find the best in just about any movie. However, there is nothing to see here. This is what happens when you take the decayed corpse of a franchise (the Freidberg/Seltzer spoof movies) and then run a few jolts of electricity through it. The movie tries, but boy, is it bad. The aforementioned joke I made about reviving a corpse is appropriate since Jonathan Silverman somehow got dragged into this movie and his main claim to game are the Weekend at Bernie movies.\n\nThey tried to combine the Hunger Games with the Hangover, and then throw in just about every pop culture character from the time (circa 2014), you get this mishmash of ideas and its completely a waste. If you took the scripts from the two movies its spoofing, shredded them, threw them in the air and then taped together what you could catch, you'd have something funnier than this nonsense. The end credits alone are like outtakes from rejected Jackass episodes.\n\nHow does something like this even get made?"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "backup-50362",
        "review_rating": "10",
        "review_title": "Dumb and funny parody movie like the good old days",
        "review_detailed_main": "I remember Meet The Spartans, Scary Movie and all the other parody movies of the early 2000s and this feels like a good one of those from more recent years. Because it is.\n\nGotta admit, the first time I saw this I hadn't seen The Hunger Games so I was lost, but if you're someone who's in touch with pop culture and popular movies and you have a sense of humor, and most importantly - you know that this is a PARODY movie and nothing more or less - you can have a good time.\n\nI really hope parody movies don't die. Everything is cringey \"dark\" cancer and rehashes nowadays, taking itself way too seriously. At least parody movies like this is honest about rehashing things, and does a good job at being funny and easy to watch. Just have a beer."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "robin-overbeek",
        "review_rating": "7",
        "review_title": "Underrated movie.",
        "review_detailed_main": "Laughed multiple times. If you both like the hangover and the hunger game movies u should definitely watch it."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "eon-slate",
        "review_rating": "8",
        "review_title": "A good laugh, but predictable if you watched the Hunger games",
        "review_detailed_main": "They really tried hard in this movie to create a spoof as close to the hunger games as possible. Some unexpected surprises are found, but that's to be expected from spoofs. I chuckled a few times, although the execution of some of the ideas in this movie just wasn't flawless (I overlooked that and rather tried to enjoy the gags)\n\nThe theme of being hung over didn't stick because through most of the movie, the lead actors acted... sober. The movie is also not recommended for children as there are plenty of nude scenes, adult toys, drugs, alcohol, under-age relationships forming (though also ending, thank heavens) and plenty of cursing and harassment. This movie is perfect for young and immature adults (like me)"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "lpewoltermann",
        "review_rating": "7",
        "review_title": "Student perfection :)",
        "review_detailed_main": "No reason to go into details. These are all students at the start or end of there student time. And they made it work :) I laughed my ass off even while noticing how crappy some shots and things are. They put a lot of effort in it and I am amazed I can find this movie @ Netflix. This should be a drinking game for fraturn- and sororities :) Love it! Cheers to everyone trying their best here :)"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "kennethclaes",
        "review_rating": "8",
        "review_title": "Finally a movie comparable to scary movie",
        "review_detailed_main": "Finally a movie with the same kind of humor as scarier movie... looking forward to a new chapter"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "GiraffeDoor",
        "review_rating": "6",
        "review_title": "Butt-le Royale! Do you get it?!",
        "review_detailed_main": "I do not think this deserves to be considered among the 100 worst movies ever.\n\nI'm the first to admit that these parody movies can be terrible. I actually love the idea of them, they're just lazily made.\n\nThis is no masterpiece and a lot of the time I'm watching this and thinking \"I could have come up with a better line for that moment\", but it's better than a lot of the worst ones like Epic Movie or Meet the Spartans though it's not quite the quality of Date Movie or Scary Movie 5.\n\nIt's sort of like the Parody movie's parody movie, the subgenre finally holding its hands up and finally laughing at its own shortcomings.\n\nWe actually have a pretty cool and solid plot where the many factions of modern popular culture battle to the death and the whole develops in a fairly interesting, linear fashion with some fun gags (\"this is a bad pillow\" had me laugh out loud) and we get a fairly satisfying conclusion even if it doesn't quite make sense.\n\nWhat did annoy me is how prudish they are about human sexuality. 17 is legal in the Majority of US states people! And this is after the ostensibly satirical \"gratuitous nudity\".\n\nIt ticks the box for something fun and crass that you won't need to think too hard through."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "steviefellows94",
        "review_rating": "9",
        "review_title": "brilliant!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "Moviedude90",
        "review_rating": "7",
        "review_title": "Think of Scary Movie. It's a farce people",
        "review_detailed_main": "Meant to make fun of itself, and it does the trick. Definitely not meant to be a hangover sequel, calm down people"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "paul-51829",
        "review_rating": "10",
        "review_title": "Better than expected",
        "review_detailed_main": "This movie is straight up awesome. Before you watch it, remember, this is a SPOOF movie. ALL spoof movies are supposed to be dumb. That is the fun part. You don't have to worry about plot holes, continuity, etc. Just take it at face value and have fun. That being said, this movie DID keep all the above together. Love how the main characters had the names of the real actors and looked like them to a degree (especially Zach G.). I laughed harder at this movie than any I have seen in a while."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "waynekhalifa",
        "review_rating": "6",
        "review_title": "An Epic Movie!",
        "review_detailed_main": "I quite enjoy movies like Scary Movies, Eoic Movie and this ones added to the list, it's quite funny if you've got the humor."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "assimaniou",
        "review_rating": "9",
        "review_title": "A very pleasant film, I'd watch it again.",
        "review_detailed_main": "That's a nice parody. I was particularly impressed by the resemblance, I cannot believe how some reviewers would complain about that. Like, if you hate spoof movies so much why bother and even review the thing. Back to the movie, there were moments that I was actually taken in by the action (seriously, I wouldn't pause to check my phone), it looked pleasant and not at all cheap, apart from some of the supporting characters wigs. The plot was pretty much coherent and there were some nice twists..and laughs! Raw, authenitically silly humor. Even when they weren't making a joke I kept being amused by the combination of characters, the romances and who beats up whom during the games. This for me was the best part, where the alternate realities meet. It is being offered on streaming services right now, so don't miss it!"
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "trentongauthier",
        "review_rating": "7",
        "review_title": "Delivers the goods",
        "review_detailed_main": "Self-aware trash that maxes out its R-rating. Almost wholesome in its debauchery."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "nzqfnmymy",
        "review_rating": "10",
        "review_title": "BEST MOVIE EVER!!!!!",
        "review_detailed_main": "I don't think I've ever seen a better movie they did a perfect job of combining the best parts of both the hangover and the hunger games the cast is way better than the cast in the hangover and I would recommend this for all ages."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "gruehlgm101010",
        "review_rating": "7",
        "review_title": "Hilarious!",
        "review_detailed_main": "I give it a solid 7! We laughed and laughed and when I see Jaime Kennedy and Bruce Jenner I lost it! The acting is subpar and really it's the actors impressions of the of the actors from the source material which at times is just hilarious. Lot's of boobs and Jaime Kennedy. Watch it once for sure, with friends and fun! It's satire! Without giving anything away, I can say that the premise is silly and doesn't deserve a lot of criticism as this satire should be views in a manner more attune to the meta comedy of the fourth wall breaking in your face antics and Ferris Bueller and The Lizard guys who did Slammin Salmon."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "damiannagasaka",
        "review_rating": "10",
        "review_title": "I didn't eat any corn? I did.",
        "review_detailed_main": "Another Cole Swier review:\n\nIt's rare air when a sequel, let alone a parody completely eclipses the original but here stands the exception to the rule. I love me a good comedy, but I haven't laughed this hard since Larry the Cable Guy movie. The subtlety of the jokes were on point where I found some I had to explain to my roommate as they just went over his head.\n\nI thought Tenet would be the highest I would ever rate a movie, but The Hungover games has officially taken over the top spot. I personally guarantee you will bust a gut and come back for more. So grab your snacks (chicken amirite?) and get a cool drink, kick up your feet and get ready for an hour and a half of non-stop laughter."
    },
    {
        "movie_id": "tt3138104",
        "movie_name": "The Hungover Games",
        "movie_rating": "3.5",
        "review_username": "mpopy1",
        "review_rating": "6",
        "review_title": "A great spoof",
        "review_detailed_main": "This movie is good. I had some good laughs watching it. The writing and jokes were good. It's my favorite spoof until now. I recommend watching the Hangover and The Hunger games movies beforehand and enjoy every part of this movie."
    }
]