[
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "jeraden",
        "review_rating": "1",
        "review_title": "Worst. Movie. Ever.",
        "review_detailed_main": "I saw this movie about 5 years ago, and the memory of it still haunts me to this day. I was fully aware at how awful it was supposed to be going into it, so I have only myself to blame. But like most, I didn't believe all the negativity. Being a Sandler fan, it just seemed inconceivable one of his movies could really be that bad. I figured it was just Sandler haters. I couldn't have been more wrong.\n\nWhat we have here is a comedy that does not contain even 1 second of anything funny. That is actually quite an accomplish. You'd think in a 90 minute comedy, they might have accidentally stumbled upon something even remotely amusing. But no, it's just horrible. It's not \"so bad it's good\", its just bad. You cannot laugh at how bad it is, you can only cry. You wait patiently for a joke that will at least make you chuckle, but they never come.\n\nHave you seen the movie The Ring? Where the people watch a video tape and die 7 days later? If this movie was on the video tape, people would die instantly, by their own hand, and there would be smile on their face as they realize their agony has ended, and that would be the first smile since they pressed play.\n\nYou might be inclined to watch it just to see how bad it is, unable to curb your curiosity. Don't. Please don't. Trust me, I'm doing you a favor. There are 2 types of people in the world, those that think Going Overboard is the worst movie ever made, and those that have not yet seen it."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dmj_incorporated-1",
        "review_rating": "1",
        "review_title": "I wanted to punch the TV",
        "review_detailed_main": "I wanted to punch the TV. Watching it was torture. I hated it. Never watch this movie. The terrorists are annoying. Adam Sandler is annoying. I normally like him but not in this one. I wanted to break the DVD. This is the most irritating film in the world. The comedian he's jealous of is obnoxious. The only remotely funny part is the rocker with the black teeth getting all the girls. It was so irritating I wanted to punch the TV. DO NOT BUY THIS MOVIE UNLESS YOU WANT TO ANNOY SOMEONE. If you even like Adam Sandler a little bit, Don't buy it. It will just make you hate him. Do yourself a favor, if you see it in the store, hide it to put everyone out of danger of buying it. Its a waste of the $1.99 I paid for it."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "loz-1",
        "review_rating": "2",
        "review_title": "Yes it really IS that bad!",
        "review_detailed_main": "Having decided some time ago to collect the films of Billy Bob Thornton (on the strength of class movies like \"Sling Blade\", \"A Simple Plan\" and \"The Man Who Wasn't There\" amongst others), it was inevitable that there would be the odd turkey in there. What I didn't realise however, was that there could be one THIS bad. I'll give you an idea how incredibly poor this film is - the funniest dialogue in it goes like this: \"Knock Knock\", \"Who's there?\", \"The big stinking man\", \"The big stinking man who?\", \"The big stinking man - is YOU!\". Yes folks, it really is that bad. Billy Bob is only in it for about two minutes (I guess he needed the work at that time in his career), and the rest of the movie is painful. For some reason though, although it's undeniably awful, I don't hate it. That's probably because I save my ire for any high budget, special effects laden junk like \"The Fast and the Furious\" and not a \"no-budget\" flick like this one. 2/10 at a push."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "longlox",
        "review_rating": "1",
        "review_title": "Couldn't possibly be any worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "adidasraver",
        "review_rating": "1",
        "review_title": "Wow! This was really bad!",
        "review_detailed_main": "I will start this off by saying I couldn't get all the way through it. I picked it up on a rainy day from WalMart like the rest of the reviewers on this site. I figured there wasn't any way I would regret my purchase. Was I wrong or what? Seriously now, who approved this project? They need to be forced to watch this movie over and over until the end of eternity. That's the only fitting punishment I can think of for releasing something this bad. The shooting reminds me of the movies I used to make for class projects on a big old VHS cam. The acting isnt much better. I think the only difference is that there are a few cool cameos. Yay, who cares... Shecky Moskowitz is unfunny, and the ships comedian is an even bigger loser. That's about as much of the plot as I understood.\n\nOverall it's the worst movie I've ever seen. I own it on DVD and have given it to many co-workers to watch. Each comes back and laughs and says \"Wow I didnt think I'd ever say I shut off an Adam Sandler movie 15 minutes in....\"\n\nMy response is always \"Well now you can\""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "kfo9494",
        "review_rating": "1",
        "review_title": "Paid 10 cents for this movie at a yard sale----I want my money back!",
        "review_detailed_main": "I was unaware of this movie when I came across this in VHS format at a yard sale in my area. I saw the young face of Adam Sandler and thought that this my be a lost gem from his early days. In fact it was more like a rock than a gem.\n\nThis is a story of gibberish that was so boring that you could not keep up with what was happening on the screen. The situation was utterly ridiculous and the lines were so unfunny I actually felt sad for the actors. Perhaps it was my VCR that made the picture of the film look sloppy but it seemed like it was filmed as a high school project rather than by professional adults.\n\nI was glad when I saw the review of others that I was not alone in panning this film. And with all that said, I still feel cheated out of 10 cents."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mattymatt4ever",
        "review_rating": "3",
        "review_title": "If you hate Adam Sandler, you'll hate this movie. If you love Adam Sandler...you'll still hate this movie.",
        "review_detailed_main": "Even if you're a huge Sandler fan, please don't bother with this extremely disappointing comedy! I bought this movie for $7.99, assuming it has to be at least halfway decent since my man Sandler is in it and because I assumed some women would get naked (judging by the R-rating and scantily-clad women on the cover). Well, there are quite a few scantily-clad women, but none get naked. I'm not sure what point this was in Sandler's career, but I'm guessing it was even before his SNL days. I can be wrong. This is like watching one of his home movies. He might look back at a cheesy movie like this and reminisce about the good ol' times...but we (the audience) are left to dry. This is hardly a \"movie\"! Sandler does a lot of talking to the camera, and even admits at one point that this is \"no-budget\" movie (that's right, not a low-budget movie, a NO-budget movie). So our job is pretty much to laugh AT the quirky characters. There is no steady plot, it's like an extended sketch comedy show--but a crude and badly written one. That guy who played the nasty comedian was completely annoying and it was implausible in the first place that he would receive such a mass audience. And Sandler finds his comic inspiration by saying the one classic Henny Youngman line \"Take my wife, please\" and the audience is on the floor? I'm not even going to TRY to make any logic here. Sure, Sandler's current and recent movies are not known for making a lot of sense (the penguin in \"Billy Madison,\" the midget in \"Happy Gilmore's\" Happy Place) but the comedy works. This is a strictly amateurish work, and even if you're curious about Adam's early days in film--you still won't be interested. You're better off checking out his start on SNL or maybe his underrated role in \"Mixed Nuts.\" Of course, the Sandman is not the only actor wasted in this thankless vehicle. Billy Bob Thornton also makes a short appearance, Billy Zane (\"Titanic\") has a supporting role and the great Burt Young (from the \"Rocky\" movies) has a significant role.\n\nThis awful comedy will most probably be collecting dust on the 99-cent rental section of your local video store--and rightfully so.\n\nMy score: 3 (out of 10)"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "k2thab",
        "review_rating": "1",
        "review_title": "Distributing this film should be a bootable offence...",
        "review_detailed_main": "I can say without a shadow of a doubt that Going Overboard is the single worst film i have ever seen, and yes, I have seen Cujo. Adam Sandler is an abomination as Schecky Moskowitz, a wannabe comedian working on a cruise liner. That's the plot.\n\nThat's it! Nothing else in the film makes sense, it's all over the place like a mad man's breakfast, and not in a wacky naked gun kind of way, but more of a frustrating, 'throw both shoes at the t.v' kind of way. even General Noriega makes an appearance, for no reason i can comprehend (it certainly wasn't for humour). Add to the mix Miss Australia, who has the worst Australian Accent i've ever heared, and you have something which i won't call the worst film ever made, because Going overboard doesn't even fit the basic definition of a film. I highly recomend seeing this film, as it will elevate the standing of every bad film you ever see. I guarantee the first thing you'll say after seeing a bad film will be \"at least it wasn't as bad as Going Overboard\"."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "A no budget and unfunny film that looks horrible.",
        "review_detailed_main": "With Adam Sandler.\n\nThis is without a doubt one of the most idiotic films ever made. It's about cruise ship waiter Shecky (Sandler) wanting to be a comedian on the cruise ship. First off, there is not one funny or clever line in the entire movie honestly. It is so unfunny it's pathetic. There is surprisingly not much crude or sexual humor, but the f-word is plentiful. The budget is really low, and that also ruins the film. It takes place on a cruise ship, but it seems they only had money to rent out a small boat and only had money for 10 ship extras, one of which is Billy Bob Thornton. The opening credits are animated reeeeeaally cheaply, and it is just pathetic. I hate this movie and everyone else that sees this will hate it too.\n\n86 mins. rated R for Language."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "HarlenPepper",
        "review_rating": "",
        "review_title": "One of the biggest disaster's of the 80's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "TartarBat",
        "review_rating": "1",
        "review_title": "A parallel of Sandler's early comedic style",
        "review_detailed_main": "This early Adam Sandler film could be compared to his life as a comic during the same period in 1989. His character's constant acknowledgement of his hidden comic genius and frustration regarding humorous material seems to come more from Sandler than the script. The film is nothing compared to his blockbuster feature films, such as Big Daddy or even the corny Billy Maddison. Unfortunately, Sandler had not yet found a way to express himself in a consistent, successful and funny manner when this film was made, much like his character. The majority of the film's \"jokes\" come from Sandler having conversations with himself, usually over his unrecognised comic talent and beating himself up because he's too ugly and can't get women. The film is hard to watch too because it doesn't treat itself like a real film. Sandler talks to the camera and the viewers throughout the film, often referring to the film's low budget or questionable content. The film is ultimately awkward and embarrassing to watch. I immediately wanted to forget I even saw this film after it was over, for fear that if more found out about it, it would ruin Sandler's career. Pass this one up at the video store, I rented it for free and it was still a waste of time."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "justin_trevor_lawrence",
        "review_rating": "10",
        "review_title": "Hideous. I loved it.",
        "review_detailed_main": "I remember when I was younger, I could go to the movies, sit down, and say to myself afterward, how in the world did they screw that movie up so badly? That was part of the fun. It takes imagination to seriously destroy a movie. Now everything is a multi-million dollar production, actions stars have learned how to fly, and the line between animation and film has blurred to the point of non-existence. I really wish I could go to the movies and watch ones like this. My children will probably never understand the thrill of low budget cinema. And as far as low budget films go, this one has Adam Sandler, Billy Zane, and Billy Bob Thorton. And they are funny."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "willman85",
        "review_rating": "7",
        "review_title": "I'm not saying this as an Adam Sandler fan, because I'm not.",
        "review_detailed_main": "I know I'm in the minority here, but I didn't hate this movie. It's by no means a great movie, but it's watchable. I didn't find it tedious and a bore to get through. It was dumb and unfunny but I felt intrigued enough by the setting and story and characters to want to see it through to the end. I don't disagree with many of the criticisms this film gets - but I don't think it's as bad and devoid of merit as it's caricatured and regarded to be. The setting of a cruise ship is always alluring and glamorous and seductive and pleasing to the eye - as are the girls. True, more (i.e. something) could have been done with the Miss Universe beauty pageant sideplot; not least because Adam Sandler as an aspiring comedian isn't very interesting ... or even convincing. As a protagonist he doesn't win my sympathy at all (he's just as unfunny and undeserving of stage time as the antagonist comic he replaces). Nonetheless, at least the movie HAS a plot, as stupid and uninspired and bare-bones as it is."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Asp333",
        "review_rating": "1",
        "review_title": "This movie just plain sucked ass...",
        "review_detailed_main": "I am a HUGE Adam Sandler fan, and one day I was looking at the Cast&Crew selection on one of his DVD's and saw 'Going Overboard' and decided to go out and rent it. So I went out with a few buddies of mine and rented it. We put it on and we were shocked to see an Adam Sandler that didn't hit puberty yet, he looks as if he was 12 when this movie came out. I couldn't even watch 30 minutes of this crap, I didn't laugh, chuckle, or even smirk at this movie, actually the only time I smirked was when I saw how horrid this movie was. I could not believe how hard he tried to make the viewers laugh in this movie...and it didn't work once. Although from seeing the horribly awful camera angles and hearing the disgusting script I realized why I had never heard of this movie,...because it sucks more than anything has ever sucked before. This movie, in my opinion, was the WORST movie EVER made,....EVER!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "pastanley",
        "review_rating": "1",
        "review_title": "Going bored",
        "review_detailed_main": "This movie was so bad I couldn't sit through it without doing something else. There was no plot and no point. I was thoroughly bored and for a film about a stand up comedian, I couldn't recall one joke or funny line worthy of the description. Politicians with no charisma speaking technical jargon could not be less entertaining.\n\nSo how was this made? Is there no quality control in film? Watching the girls in bikinis was the only distraction during this horrible experience.\n\nIt's hard to imagine that Adam Sandler who has become popular and has appeared in fine comedies was able to survive after this kind of exposure. He was not funny in the least in this movie so it proves that the writing is so vital in effective comedy."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "valisk",
        "review_rating": "1",
        "review_title": "We use this film to test the resolve of our staff",
        "review_detailed_main": "Shecky, is a god damned legend, make no mistake. Until recently I worked for a UK HiFi & Video retail chain, running their testing department. We would go through many new starters, they would be expected to to learn how to fault find the various detritus that returns as non functional in one way or another from the stores. Now to tortu^^^^^ test the resolve of these new staff members, we would issue them with a copy of Going Overboard. We had hundreds of copies of this film because whenever someone who had bought a particular model of Goodmans DVD player that had this film as a free gift, got round to sending their DVD player back, they never failed to send Shecky back also. Our new staff would be forced to use only Going Overboard to test these machines for faults until they had found a disc or two of their own to test with.\n\nNow, as to why this film is so bad, where do I begin?\n\nAdam Sandler, who can be so, so very funny, as in Happy Gilmore, or the Wedding Singer, must have been having one hell of an off day. The rest of the crew stank, and what is it with Billy Zane? His name crops up in several of the worst movies of all time, and he is a decent actor. Crazy. The production quality is absolute zero.\n\nI would have been inclined to give this a zero if I could, because they didn't even have the guts to call it by it's full name 'The Unsinkable Shecky Moskowitz' on release. Even so it is worth a watch so you can see just how far Sandler has come, and just how low he can go."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Wow...this is painfully unfunny and tedious.",
        "review_detailed_main": "Considering that Adam Sandler was young and inexperienced, I guess you can't fault him too much for appearing in this terrible film. The amazing thing, however, is that this didn't kill his career once and for all! Why is this film so bad? Well, the biggest problem is that it's supposed to be a comedy but it's amazingly unfunny. The story is about a guy who wants to be a stand-up comedian and features a supposedly professional comic in the film as well--yet there wasn't a single funny line in the film. It was as if they'd asked Mr. Spock or a robot to write the jokes. Additionally, the rest of the film is written so very poorly that there really isn't anything to recommend the story...nothing.\n\nThe film is set on a somewhat dilapidated cruise ship. Adam Sandler is a lowly waiter and puts up with lots of abuse from everyone. Frankly, no one is this mistreated on any job and it's hard to find anyone who is a bigger loser than this character. He's just so pathetic that it makes you cringe. At the same time, he looks up to a comic on board the ship that has less charisma and charm than any undertaker! The guy is so obnoxious and untalented that you are left wondering if this guy could get a real job on this planet or only in bad films like this. The answer is actually pretty obvious. I was surprised at this character, actually, as I don't think I've ever heard a character from the 1980s that curses and much or as colorfully as this guy...and yet we are expected to believe he actually gets paid to talk?! As for the rest of the cast, it's mostly a bunch of beauty pageant contestants, though you wonder WHAT sort of pageant this is. That's because some sport sashes that have the names of states or cities and some have sashes with names of countries--but often the women have no accent and look like they can't even spell the names of the countries, let alone having come from there. The best example is the blonde lady who has a typical American accent...and she's Miss Jamaica!? Additionally, the ladies have no charisma or personalities--they are just eye candy--just bodies to jiggle past the screen.\n\nSo, we have semi-sexy beauty queens and comedians who are about as funny as hemorrhoids--this is NOT a recipe for a good film! About the only thing even halfway likable is Sandler. He's unfunny but seems like a nice young man...a horribly stereotypically Jewish young man saddled with the awful name \"Shecky Moskowitz\". Wow, that was subtle!! The only other positive thing I can say about this film is that it makes you forget some of Sandler's other bombs, such as LITTLE NICKY. Oh, and if you are wondering, I did really enjoy many of his films (such as REIGN ON ME, WATERBOY and THE WEDDING SINGER). I just marvel, however, at how indiscriminate he is in his choices of film projects.\n\nGiving a film a 1, for me, is reserved for films such as those of Hershell Gordon Lewis, Ed Wood, Al Adamson, Ted Mikels and the like. I don't give this score out routinely but I do think this film also deserves this score, as it is unlikable, cheap and stupid from start to finish and it's obvious why this film is currently ranked within the 100 worst films of all time on IMDb."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "rsimmerm",
        "review_rating": "1",
        "review_title": "Not worth it.",
        "review_detailed_main": "I stole this movie when I was a freshmen in college. I've tried to watch it three times, the second two because friends wanted to see it. \"Sweet, Adam Sandler, I've never heard of this movie, but since he's so funny its gotta be funny.\" Wrong! I can't make myself watch this pile of crap after the dream boxing match/insult war, where burning the guy with a good zinger causes your opponent physical pain. You would think that terrible comedy hurting you is ridiculous, but after watching this you'll know its true. This movie isn't worth the price I paid for it. I've watched a ton of Steven segal movies, and I've even watched Crossroads twice... but I still couldn't watch this."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "rancidswan",
        "review_rating": "",
        "review_title": "Please no, no, no, no, no, no",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "shellemk",
        "review_rating": "1",
        "review_title": "Truly, TRULY, AWFUL",
        "review_detailed_main": "I really wish I'd read all these comments before buying this film, but it was a spur of the moment choice. My husband and I enjoy Adam Sandler films so I thought (erroneously) that I couldn't go far wrong with this one, especially as it included Billy Zane and Billy Bob Thornton. I didn't pay much, but it was still too much. We cringed almost all the way through it, all the time thinking \"this HAS to get better\". It didn't and we'll never get that time back. Please, if you manage to read most of these user comments before buying, do not waste your money or your time on this poor excuse for a film."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "limbic69",
        "review_rating": "1",
        "review_title": "A particularly bad comment about a bad movie",
        "review_detailed_main": "Well, It is a very rare night that I do not finish watching a movie that I set out to watch. This movie is so bad that I could not bring myself to watch all of it. No sane person or more importantly any movie watcher with any taste will even remotely find this movie either likable or watchable. I like many others think Adam Sandler is a great actor at times but inspiration for this movie must have come from deep down in a his bowels rather than his brain. Everything about this movie is bad, from the moment that the viewer sets eyes on it to the moment 30 minutes later that a person is pleading with another family member to put them out of their misery!! If you even think of getting this movie out do the world a favour and donate the cost of the rental to the red cross as you would be going the movie world a true injustice should you support this movie in any form what so ever, o how I wish I had been warned earlier."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "heckchri",
        "review_rating": "1",
        "review_title": "Why can't I put a rating of 0...",
        "review_detailed_main": "Worst mistake of my life.\n\nI picked this movie up at Target for $5 because I figured, \"Hey, it's Sandler I can get some cheap laughs\". I was wrong, completely wrong. Mid-way through the film all three of my friends were asleep and I was still suffering. Worst plot, Worst script, Worst movie I have ever seen. I wanted to hit my head up against a wall for an hour, then I'd stop, and you know why? Because it felt damn good. Upon bashing my head in i stuck that damn movie in the microwave and watched it burn....and that felt better than anything else I've ever done. It took American Psycho, Army of Darkness, and Kill Bill just to get over that crap. I HATE YOU SANDLER FOR ACTUALLY GOING THROUGH WITH THIS AND RUINING A WHOLE DAY OF MY LIFE!!!!!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mruffino-1",
        "review_rating": "10",
        "review_title": "great flick",
        "review_detailed_main": "I joined IMDb, solely to comment on this movie, I was sick of reading reviews that bad mouthed this classic. After seeing this movie once, OK, I can see why some people might think its bad. But take it for what it is, they know they have 'no budget' and treat it as such. cameos are excellent dicky diamond is awesome as an obnoxious and perverted comic, sheckys co worker is also hilarious. not to mention spots from burt young and billy zane, the guy who plays the grimy rock star kills it in his role. so many one liners . this is far and away sandlers best film hopefully in the future , this film will receive the credit it deserves and establish itself amongst other cult classics."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mellywoodsmansion",
        "review_rating": "6",
        "review_title": "Adam Sandler is a cruise ship waiter fishing for laughs sadly he didn't catch any",
        "review_detailed_main": "Do you want to comedy telling you all about 1989 and going overboard of the movie for you I think I like this movie it's so weird nonsensical and off the walls that it's strangely kind of works It's not not terrible It isn't as bad as people say it's the really bad I don't know why anyone would give this a positive review the only good part of this movie is the weird guy dressed up as Poseidon overall it's not a bad movie but definitely not a good movie is it just meh."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Derekwhite9999",
        "review_rating": "1",
        "review_title": "Couldn't Make It Through 15 Minutes",
        "review_detailed_main": "This HAS to be the worst movie I've ever attempted to watch. In the first 15 minutes, there wasn't anything to keep my interest in this movie. I was on vacation at the time, and had plenty of time to devote to a just-for-the-fun-of-it movie. The condo we were staying in had this movie in stock -- they must have got it from the $1 store or something.\n\nIf you like Adam Sandler, this is nothing like any other movie he's made. This started with a bad premise and then just got worse. There's nothing even remotely funny in it.\n\nI've watched a lot of movies, including some I didn't care for. But if you decide to waste your time on this movie, don't say I didn't warn you."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "manofaction",
        "review_rating": "",
        "review_title": "About as funny as a pencil in your eye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "TiggerPromfit",
        "review_rating": "1",
        "review_title": "Going overboard? Going out your mind!",
        "review_detailed_main": "Obviously this film only got onto DVD so Hollywood DVD Ltd and other investors can basically steal money from Adam Sandler fans, getting you to buy it because it stars Adam Sandler. Another scam these people are using is, putting on the DVD \"Staring Adam Sandler Billy Zane and Billy BoB Thornton\" even though they're in the film for around 10 seconds. I wonder why they didn't put on this DVD \"Staring Adam Sandler Ricky Paull Goldin and Warren Selko?\" About the film: Adam Sandler tries to tell jokes on a cruise ship and he just plain sucks. I've seen jokes from crackers better than his. Then the guy from rocky (pauly) sings an awful sad song then some terrorists come on board, and that's about the whole film. Oh and someone gets locked in a room somewhere.\n\nI was crawling up the walls and ripping my eyes out by the time this film finished. It's the worse film I've ever seen. After using the DVD as a Frisbee for my dog. My mate wanted to see it and he made me watch it with him again.\n\nI'd rather be tortured by a blowtorch than even look at Adam Sandlers stupid big fat ugly head on the cover of \"Going Overboard\" again."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Words fail me...",
        "review_detailed_main": "Coming from a non-Adam Sandler fan, but liking his performances in Punch-Drunk Love, Reign Over Me, The Wedding Singer, Spanglish and Happy Gilmore, Going Overboard is down there with Jack and Jill and Little Nicky as the worst movie that he ever did, it really is that bad.\n\nIt is difficult to pin point the worst thing about it, seeing as Going Overboard has no redeeming values whatsoever. Was it the camera angles, and I have to say this film had some of the most awkward and cheaply placed camera angles I've seen in any film?\n\nWas it the immature and painfully unfunny humour, down to the juvenile dialogue and jokes that make you cringe so much your face is aching still after watching the film? Was it the broken and predictable structure of the story?\n\nOr was it Adam Sandler's truly irritating performance, that makes his performances in Jack and Jill, Little Nicky and You Don't Mess With the Zohan seem award-worthy in comparison? Or the wasted, and I mean wasted, talents of Billy Bob Thornton? Or even the single most unlikeable and obnoxious characters of any film to have Sandler starring in it?\n\nHard to decide, seeing as everything was as bad as the other. All in all, I had heard Going Overboard was bad, but I wasn't expecting it to be THIS bad! 0/10 Bethany Cox"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dont_mess_with_raz",
        "review_rating": "1",
        "review_title": "bad",
        "review_detailed_main": "I picked up this movie for $5 dollars at a discount book store, Adam Sandler is a awesome actor and i figured it would be a good movie, well, it wasn't. There was absolutely no story line at all, bad jokes, and the other comedian said \"The F-Word\" every other word he said,cursing usually dosen't bother me but this was over the top. And even worse than the lack of story line was the parts when Sandler would just begin talking into the camera at random parts in the movie, it reminded me of Dora the Explorer when they turn and look at the screen and ask you questions. And last of all is when they would randomly put in Bikini shots of girls at random times in the movie. In my opinion, Don't buy this movie, its a waste of money"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "zlast",
        "review_rating": "1",
        "review_title": "Sooooooooooo Bad",
        "review_detailed_main": "Too bad there isn't a negative rating...only movie EVER that I have walked out on...thats right mind numbing boredom is better... nothing else to say....avoid like the plague....give it to you enemies, sort of a Trojan horse...if I had to sum it up..remembering that I only actually saw half the movie and still have nightmares....only movie that may be WORSE than jennifer lopez and ben affleck in GIGLI...you need to watch this movie like you need a hole in the head...the USA should be dropping these on IRAQ...perhaps in Betamax or VHS cause I am not sure if they have DVDs...if the \"insurgents\" survive that then the cause is pretty much hopeless..."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Going Nowhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "ian959",
        "review_rating": "1",
        "review_title": "Avoid - at all costs avoid",
        "review_detailed_main": "What more needs to be said? No plot, no acting, no comedy, no budget. In fact this film has absolutely nothing at all worthwhile worrying about. Not even an Adam Sandler fan could find anything redeeming about this putrid waste of celluloid. It is not often a film can make Speed 2 look like like Citizen Kane, but this does. Do not even be tempted to pick this up for rental. And to contemplate buying this film would be clinching proof of insanity."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "babylove-3",
        "review_rating": "1",
        "review_title": "Please Don't Waste Your Time",
        "review_detailed_main": "I'm begging you, please, don't waste your life on this movie. Don't let curiosity provoke you into watching it \"just to see how bad it is\"! Just take my word for it. Go outside, plant a tree, enjoy life! Just please, please, please don't watch this film. All copies should be burned and never seen again! I should probably point out that I really enjoy the vast majority of Adam Sandler movies but this was truly AWFUL! Is there anything else I can say to stop you from seeing this movie? Just please, do something better with your life, even if that just means watching 'Happy Gilmore'."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mike_prince_74",
        "review_rating": "9",
        "review_title": "Well I thought it was hilarious.",
        "review_detailed_main": "If you are going for an...uncut gem...dont watch this movie. But if you like dumb, watch this movie."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "tjorgensenrn",
        "review_rating": "6",
        "review_title": "What did you expect?",
        "review_detailed_main": "Lots of star cameos, was a low-budget movie, probably a great experience for everyone involved because it is mindless viewing, but it's great to see Adam so young watch the process unfold. Of course the acting was mediocre, even with Billy Zane and Billy Bob, but that's what you expect from this and these actors in their early stage, so watch this from the eyes of someone getting to see these actor/comedians in their youth. It is still classic Adam Sandler, and you can see some of his facial expressions coming to life for future movies. There are a lot of slo-mo bikini shots, classic 80's, but again, what did you expect?"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "michaelsebold",
        "review_rating": "1",
        "review_title": "Adam Sandler Must Go",
        "review_detailed_main": "Watching this stinker constitutes cruel and unusal punishment at the hands of Sandler. Truly a slow and painful death.\n\n'Bought the DVD in the $5.88 bin at Wal Mart. But the thought that keeps echoing in my head is, \"How can I get my money back?\"\n\nThe most unforgivable thing about the movie is that the boat JUST DOES NOT SINK!\n\nBest constructive suggestion: Mystery Comedy Theatre. You know that show on the SciFi Channel in which some guy and his muppet-machines spoof the most unwatchable horror flicks (Mystery Science Theatre). IMMEDIATELY, spin off a comedy program and feature this flick. Without a good humorous spoof of this train wreck, I fear that viewers may actually begin following Sandler with ice picks and chainsaws."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mikejohnston",
        "review_rating": "1",
        "review_title": "Dont ever watch this film",
        "review_detailed_main": "I am a huge Adam Sandler fan - have seen all his films and watched (and still like)Happy and Billy over 20 times each. I would be the first to admit that his humour and therefore his films are not to everyones tastes but I find him very funny.\n\nI found it hard to imagine that a film he did could offer nothing in terms of humour and it was this that made me watch Going Overboard even though I was well aware it had been roundly criticised.\n\nHaving watched this film I found it did offer nothing - no real plot (not a huge surprise for an AS film), terrible acting and almost no laughs (i think i smirked twice).\n\nIt focuses on the aspirations of Sandlers character (currently a waiter) to become a stand-up comic on the cruise ship he is working aboard. What follows is a bizarre 'story' including beauty queens, General Noriega, two inept killers who want to be comedians and Billy Zane as Neptune God of The Sea!\n\nThis is a terrible piece of cinema that should never have seen the light of day and has no glimpses of the great comedy that Sandler went on to produce.\n\nNo matter how big a Sandler fan this film is simply not funny. Do not make the same mistake I did and assume that everyone must have got it wrong and it must be funny as it is Sandler. It has nothing to offer - Don't ever watch this film."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "michle53",
        "review_rating": "1",
        "review_title": "Poo Poo",
        "review_detailed_main": "I had to stop watching this after the Adam Sandler character gave a short introduction and then did a \"funny walk\" up a long gangplank accompanied by a sprightly pizzicato soundtrack.\n\nI thought about it for a little while. Whose idea was that -- the jaunty waving arm, the goofy smile? Was it the director's idea? Did the director's Uncle Morty, who used to be in vaudeville, visit the set at the onset of shooting and say, \"What you need is a boffo comic walk to liven things up a little?\" Was the director too intimidated by Uncle Morty's show-biz provenance to refuse? Or did young Adam Sandler himself concoct that shtick?\n\nWho knows if the rest of the movie was any good. I had to stop right there because that scene made me spiritually and physically ill."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "jem77",
        "review_rating": "1",
        "review_title": "what???",
        "review_detailed_main": "First of all, I am a BIG Adam Sandler fan, that's why i jumped when I saw this video available to buy.\n\nBut boy, when I put it in.. I almost cried. I have never fast-forwarded through a movie like I did for Going Overboard. The writing sucks, the plot is loose, and the humor couldn't be more lacking. About the only redeeming qualities are seeing a pre-Titanic Billy Zane and a pre-\"Late For Dinner\" Peter Berg. Do not rent or buy this movie. If you do, please buy it from me, so I can improve the quality of my collection, which is sadly compromised by this tape."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "JonPaula",
        "review_rating": "1",
        "review_title": "Terrible. Not even enjoyable ironically.",
        "review_detailed_main": "Released in May of 1989, this $200,000 comedy farce is really only notable for being the first feature film to star future A-list funny man, Adam Sandler. But before he matured, or was even cast as a player in Saturday Night Live, he starred as a struggling comic onboard a cruise. After his recent string of uninspired, unfunny cash-grabs, it's easy to forget Sandler was once a hilarious comic with some truly great material... sadly however, we get almost none of that in this sorry excuse for a film. Instead, he puts on stupid voices, mugs for the camera, and generally acts like an incompetent goof for the majority of the 97 minute film. The supporting cast includes Tom Hodges, Scott LaRose, Billy Zane, and Billy Bob Thorton - none of whom are the slightest bit memorable. The story plods along to the incessant sounds of a steal drum calypso, bland jazz, and cheap Muzak, also the actual presentation style is curious and inconsistent.\n\nSandler himself breaks the fourth wall to introduce us to the story, immediately apologizing for its \"no budget\", and then he's shelping the viewer around boat like we're watching his personal vlog. But other sequences are conventionally shot, and edited for some reason - I hesitate to guess what director Valerie Breiman was possibly thinking. The lethargic and pointless narrative is worsened by constantly cutting away to Miss Universal confessionals, ridiculous dream sequences, and Burt Young as General Noriega who is actually watching the film itself on VHS, who defends his honor by shouting at the TV, \"We'll see who gets the last laugh, you left over worthless kangaroo vomit!\" Besides being awfully paced, the R-rated movie is really quite uncomfortable and awkward... every scene plays out three times longer than it needs to, almost as if they were deliberately padded so the picture could qualify for \"feature length\". With unrealistic dialogue, and empty characters - this film is devoid of conflict and tension, making it at true struggle to actually sit through. It's no surprise this film presently sits in IMDb's bottom-10 rated movies of all time... it is just so painfully boring, I regretted watching literally every scene. \"Going Overboard\" is a \"Terrible. Not even enjoyable ironically.\" With no redeeming qualities and nary a single laugh whatsoever, it's a wonder Sandler actually managed to have a successful career after piece of GARBAGE."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dixonbainbridgeisaledge",
        "review_rating": "1",
        "review_title": "This is the worst, and the least funny, film I have ever seen! Seriously!",
        "review_detailed_main": "This is a horror film to anyone that likes good films.\n\nThis film is simply awful. You really should check it out just purely to SEE HOW BAD A FILM CAN BE before complaining about the next one. The comedy is so painful and ridiculous, the story is either non-existent or ludicrous. It's jokes are less funny than you losing the winning lottery ticket, or running over your own grandmother.\n\nThis film would make a good torture tool. I don't know many people who could sit through it without cracking (and I don't mean laughing, no danger of that!)\n\nThere was warning from the very start with the absurd and unfunny animated face-pulling. It all went tragically downhill from there.\n\nYou might think, as I did before I saw it, that if its THIS BAD it would be funny. This movie is even worse than this. If that were the case then it would be fine, but it's not. As I say, watch as much of it as you can anyway!\n\nLuckily I didn't spend any money on it, it came in one of those massive free packs of DVDs with about 50 rubbish films in, this being the worst of them all.\n\nI would rather eat my own faeses washed down with a nice tall glass of urine than to watch another second of this DVD again!\n\nIs there a stronger word than abysmal?"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "1",
        "review_title": "\"Going Overboard\"... Portrait of a Viewer's Descent into Madness...",
        "review_detailed_main": "I am going to offer a statement up front as a prologue for this review- I like Adam Sandler. I am a fan of his work, both comedic and dramatic. I always make an effort to see his films. In addition to supplying me with laughs, he also offers the occasional deep and moving performance in his serious work. So I am not coming into this review as a hater by any means. I just wanted to say that.\n\nAdam Sandler's first film, \"Going Overboard\", was a 1989 release, directed by Valerie Breiman. It follows the lead, Shecky Moskowitz (Sandler), a struggling comedian working on a cruise ship. It is notable for its quiet release, and the fact that a whole lot of people don't know about its existence. It is also notable for it's exceptionally poor quality (being on IMDb's Bottom 100 list), and at times painfully unfunny jokes. I tried to watch this film twice before today. Once by myself- in an effort that ended after less than 10 minutes. And a second time yesterday with two friends, this time making it 15 minutes in.\n\nAnd today, while writing this review, I forced myself to watch even more of this flick, in an attempt to make it at least one third of the way through, so I can be more fair and just with my analysis.\n\nThe film is sloppily put together. For some reason, Shecky almost constantly breaks the fourth wall, and speaks to the audience. Now, this is a technique that can work if utilized properly, but here, it seems forced and contrived, and it never really adds to the proceedings. In fact, it makes almost no sense whatsoever. They attempt to expand this idea, with other characters (such as his best friend) noticing the \"camera\", or having other passengers (notably beauty queens on the ship) appear randomly to talk to the camera, but it doesn't feel natural.\n\nThe comedy is extremely unfunny. An opening scene featuring Burt Young (how they got him in the movie is beyond me) makes an unfunny attempt at using porno-titles etched on the sides of video tapes for cheap laughs in a gag that is DOA. A barely animated opening title sequence tries to solicit laughs using a caricature of Sandler, but it fails miserably. Much of the humor is too drawn out, or too brief. And many of the gags fall flat as a pancake. An example that pops into my mind is a scene where we, for no reason, see the \"villainous\" character dancing on the deck in front of some sunbathing women for about a full minute while snazzy music plays in the background. It made no sense, yet looked like it was trying to play for laughs. I didn't laugh once. The most creative gag was Shecky giving a Bloody Mary to a patron which had been soiled by a seagull's excrement... and it wasn't even funny, just gross.\n\nThe acting is uniformly abysmal, with Sandler alternating between trying way too hard in one scene, to looking bored and just reading his lines in the next. His rival, \"Dickie Diamond\" is portrayed as a lewd and vulgar comedian, and he's meant to come across as a bully that you hate, but the performance doesn't work, and makes you pity him and feel as though he may be handicapped in some way.\n\nThe direction is unsuitable, and the film can't even muster the quality of a 70's television commercial in terms of visual aesthetics. (I have read that due to an error, the film had to be shot without vital lens and filter packs, which the crew had forgot, hence it's flat and cheap look.) There is no discernible story by any stretch of the imagination- reading a synopsis elsewhere, it is suggested that terrorists, thugs and other assorted villains will raid the ship later on in the film, but I can't see how or why. Literally nothing happened in the half hour or so I saw. The film has no guidance. The editing is also bad all around, and despite moving very quickly, it drags and drags... it's jarring yet also boring... It feels like snippets of a few dozen different skits strung together, with all of the punchlines removed. There's no flow, and nothing seems to make any sense, or contribute to any real effort at a story.\n\nReally, as much as it pains me to say this... this is the first movie I've encountered that I have been unable to sit through. It's literally painful to watch.\n\nI have to give this a 1 out of 10, and that's coming from a Sandler fan. It isn't the worst movie ever made... but it's up (or rather, down) there.\n\nEDIT: (June 8th) I have watched another half hour of the film. My review still stands as is."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Steveo1986",
        "review_rating": "2",
        "review_title": "Semi-classic novelty trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "cbarry39",
        "review_rating": "",
        "review_title": "Worse than you can ever imagine.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "jeremyblaker",
        "review_rating": "10",
        "review_title": "Not even listed",
        "review_detailed_main": "alright, i saw this at blockbuster, and i was like 'whoa, an adam sandler movie i haven't heard of' so i rented it, i watched it and, in the first 5 minutes you have adam telling you that its going to be a loosely thrown together movie with no budget at all. well, he's not lying. but the movie isn't that bad. i mean, it is adam's first movie, but i still find him enjoyable to watch, the 2 cuban terrorists are hilarious, and you even have Allen Covert as the bartender. . . . i mean allen and adam have apparently known each other for a LONG time.\n\nanyway, the chase scene during the end will show you that. . . .well lets just say adams shirt changes from green to red, red to green. . . .back and forth during the chase scenes. Still, there's nothing wrong with that, i was expecting him to make a joke about it.\n\nSo if nothing else, watch this for adam, and the 2 cuban guys. No one else in the movie can act, and i think they did it that way on purpose.\n\nI don't hate this movie at all, in fact, i own it, and i watched it again last night.\n\nBilly Bob Thorton even makes an appearance, along with billy zane and as i said before, allen covert, who was probably unknown then.\n\nbut i do love allen covert. and adam. . .and seeing adam in his eaaaaarly days is refreshing.\n\nSo see this, at least once. Don't watch it expecting a very enjoyable sandler film. watch it expecting to see what you hear adam tell you your gonna see in the first 5 minutes.\n\nto all those people who think this is just a HORRIBLE movie. . .well duh, it was MENT to be. adam tells you its gonna be.\n\nSadly, this move is NOT listed on adam sandler's websight. guess he's ashamed of it or something, i dunno why he would be, maybe cause of his shorts. . ..\n\nanyway, be sure to check this out, but don't watch it in a serious fashion, be light hearted. . ."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "jmcgee-1",
        "review_rating": "6",
        "review_title": "An early Adam Sandler",
        "review_detailed_main": "Now don't get me wrong,I love Adam Sandler.Punch Drunk Love is one of the best films I ever seen.But get ready for a more less funny and more stupid Adam than ever before.\n\nGoing Overboard is about a man who has the weirdness name I ever heard.Anyways,he wants to be the ship's comic,but can't because they already have one.So when everybody thinks the comedian's dead.It's Adam's time to shine.The only problem is that he dosen't have any jokes.\n\nNow this film does have some funny moments,most of them are by the comedian when he's not telling jokes and by a rock star and he's promoter.Adam has a little comedy in it,but not the one you think.He's more goofy and you can tell it's his first film ever made.Looking at this first before Adam did Happy Gilmore,Billy Madison,The Waterboy,Little Nicky,Punch Drunk Love,etc.Will not make yu won't to be his fan or see these movies.So looking for a few laughs then rent.But I tell ya you will be disapponited."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mark.waltz",
        "review_rating": "1",
        "review_title": "This ship would have made the iceberg turn around and float away.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "coreyruth",
        "review_rating": "1",
        "review_title": "Adam Sandler's First, and Worst",
        "review_detailed_main": "I'm a huge fan of Adam Sandler's movies, I think he's hilarious and love his style of humour in general. I hadn't heard of this movie until I saw it on the shelf at a movie rental store with a friend and thought \"hey, it's Adam Sandler, should be great!\"... but WOW were we mistaken! Even awful movies I usually watch until the end, but we had to stop it a little over halfway through because it was just THAT BAD. Especially when Adam Sandler was the star, that hurts to say, but not as much as this movie hurt our brains. It seemed completely amateur, had no artistic value whatsoever, and the humour was so bad as to be nonexistent. Do yourself a favour and do NOT buy or even rent this movie---it's a waste of your time."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "D_Burke",
        "review_rating": "2",
        "review_title": "\"Going Overboard\" Sinks Like A Dead Weight",
        "review_detailed_main": "\"Going Overboard\" is a comedy that is part campy, part raunchy, a tad bit exploitative, and completely unfunny. It has the distinction of being Adam Sandler's first film ever, not just his first film where he had the leading role. Unfortunately, it is also Sandler's worst film.\n\nThe only reason you would probably know about this movie is because it received a very wide video release in the mid 1990's, after Sandler had become a breakout star of \"Saturday Night Live\". Today, even though his current movies haven't received the greatest of reviews, he's still a bona-fide movie star, and among the most successful former SNL stars in the show's history. This movie shows, however, that at the age of 22, he still had some work to do.\n\nIf there's any reason to sit through this 97-minute movie that feels a hell of a lot longer, it's to see how Sandler started out as a young, struggling comedian. He obviously took his prior experiences in bombing in clubs, and made his character, Schecky Moskowitz, who is probably not all that different from Sandler himself, a bit more poignant.\n\nHowever, the rest of the film is draggy, uneven, and really unfunny. The story is scattered and one-dimensional, the subplots feel contrived and out of place, and almost everyone in this movie seems as though they try way too hard for a laugh, including Sandler. In fact, it makes no sense that Sandler's character, as a cruise ship waiter, envies the cruise's comedian, Dickie Diamond (Scott LaRose), when he isn't really all that funny.\n\nThe only really good scene is when Sandler, struggling to make his cruise audience laugh, spontaneously meets Milton Berle, who plays himself. I also liked the addition of a laughing track when Berle told his jokes. Ironically enough, it seemed as though the movie did not try as hard to make you laugh when the laughing track played.\n\nThe only other big star the movie managed to get at the time was Burt Young, who plays General Noriega from a country in central America despite not looking Hispanic at all. It's also obvious that his scenes were shot long after the filming on a cruise ship was complete.\n\nThere are also some appearances in this movie from then-unknown actors who made it big later, such as Peter Berg, Billy Zane, and (perhaps most surprising) Billy Bob Thornton. Fortunately, they would go on to do bigger and better movies.\n\nIf there is only one reason to see \"Going Overboard\", it's to show that when it comes to show business, especially comedy, you have to start somewhere. Sandler still had a long way to go in finding his comedic persona. Fortunately, he still comes off as likable in this movie. It's just too bad that the rest of the film could not quite catch up.\n\nSo \"Going Overboard\" is a big miss. Its story and its comedy needed some major work. It being a \"no-budget\" movie, as Sandler puts it in the beginning when he breaks the fourth wall, is no excuse."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "djrobbyrob1126",
        "review_rating": "1",
        "review_title": "wow...",
        "review_detailed_main": "After watching this movie a few thoughts came to my mind. 1) Why the hell did I watch this movie? 2)Who did I buy this movie from so I can return it tomorrow. and 3) Why is Adam Sandler allowed to act after this movie? I honestly think that if you made a movie starring Jaleel White, Chris Klein and Jose Canseco, and have it written by a blind man who has lost his hearing, you'd still get 5 stars above this movie. I can honestly say that I have never seen a movie as bad as this one. Terrible acting, terrible taste, no plot, no storyline, just ewww...I just can't believe this was approved. I really think I'd rather fly across the country to go see the 3 Ninjas Film Festival then watch this movie in the comfort of my own home. I apologize for being so negative, but this movie is an absolute disgrace."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "bfp06-1",
        "review_rating": "1",
        "review_title": "I feel sorry for Sandler...",
        "review_detailed_main": "Im a huge Adam Sandler fan, billy Madison is one of my favourite films ever because of its stupid humour and great lines, but things didn't start well for Sandler. This is just crap, absolute crap so crap that its past funny. I did laugh ... yes, when i was thinking about what they were going through when filming this bilge and billy Zane's role as 'Captain Neptune', what the hell is that all about anyway. None the less there are parts of this film you will be thinking what on earth were they thinking and begin to chuckle. The worst part of it is the comedian on the boat, he spends most of times swearing and people laugh because they think its funny, i laugh because he is trying so hard to be funny that he just makes a fool out of himself (same goes for the rock star guy). i only paid 1 pound for this, i wasn't expecting much as id already read some reviews on here beforehand. Its not good and its not the worst film ever (herc in new york), so if you want to see what Adam Sander had to do to make a few bucks before he made it big then check this out."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "RealCritic78",
        "review_rating": "1",
        "review_title": "Perspective on just how bad this movie is.",
        "review_detailed_main": "So I will start by saying I saw this movie and then bought it. Yes I said I bought it after seeing it. There is no way there has ever been a worse movie made save a 10 year old with a camcorder. But something that has made it to DVD etc, there is no way there is a worse movie. I watch multiple movies a day, I love film, and I cannot call my DVD collection complete if I only have the best, I must own the worst. The only reason this movie isn't the #1 worst film on IMDb is because the people that voted for the others haven't seen this movie.\n\nThis movie was so terrible I literally bought it so I could lend it out to everyone that wants to see it. I have never and will never watch it again however. I don't think you can even pick those yellow stars unless you have seen this movie. People need to understand what the worst is to guage the best...lol. It always comes up in movie conversations and I love reading the reviews on this movie. So I implore everyone that loves film to try to sit through this so when they talk about their top 5, worst 5 etc...they have the facts...lol\n\nTop 2 worst movies Going overboard Sugar and Spice"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "glasscase-25919",
        "review_rating": "1",
        "review_title": "Hideously unfunny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "bongee",
        "review_rating": "1",
        "review_title": "\"Im unfunny\" Adam Sandler",
        "review_detailed_main": "First off, the acting is horrible. I mean the worst I can even imagine. Its like high school actors; yelping and grumbling but smiling. Cause well I guess they were on camera for the first and last time. The direction is ungodly. Yet again like a high schooler. The writing though is the worst of all. I like to think this movie almost ruined Sandlers career. Unfortantly it didn't. OK, the guy mad three funny comedies; but, good god I would have given them up not to see this movie.\n\nFor years I've been saying that Adam Sandler has gone down hill, but Im wronge. Its his writers that have gone down hill. If you want to see how unfunny Adam really is watch this movie. This is Adam raw and not directed. This is worse then the longest yard but a long yard.\n\nOh, and there is one believable scene of acting. When Adam said \"I can't think of a funny thing. I'm unfunny!\" Enough said"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "arwynbayley",
        "review_rating": "",
        "review_title": "Kill me now, please",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Sarah-Embry",
        "review_rating": "10",
        "review_title": "Great film.",
        "review_detailed_main": "I seem to be in the minority here, but I enjoyed this movie. Some really good lines, the plot wasn't too bad, and of course, seeing people like Billy Zane in such roles is just brilliant.\n\nThe moment where Adam Sandler's character explains that it's a \"no-budget film\" is hilarious. People really need to lighten up on this movie, I can definitely think of others that deserve bottom 100 a lot more *coughPEARLHARBORcough*"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Bob_Dang_Dole",
        "review_rating": "7",
        "review_title": "Cheeseball movie with hot 80's babes.",
        "review_detailed_main": "First off, check the google reviews on this movie; it's currently at 52%. If this movie was as bad as some people say it is it wouldn't have 52% of people liking it.\n\nSecondly, a woman wrote this. I'm guessing that most people would assume that this was written by an immature-dbag-male chauvinist pig... but nope, it was written by a woman!\n\nLastly, this is a goofy movie that doesn't take itself seriously; they tell you from the start it's low budget movie, so your expectations should be low. As for the plot you shouldn't try to follow along. It's a cheesy 80's flick with some funny moments, nice eye candy and cool cameos.\n\nThis movie is actually pretty funny. However, nowadays a lot of people don't find anything humorous any more; most people find everything offensive.\n\nThis is a good movie to put on in the background when you're doing something else since it doesn't demand your full attention."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "tmprocyk",
        "review_rating": "1",
        "review_title": "Unfunny, unimaginative, unwatchable!",
        "review_detailed_main": "Being an avid Adam Sandler fan, I bought this movie for a whopping $4! After watching it, I felt I had wasted what little money I spent. The plot seemed promising. Adam Sandler is a waiter on a cruise ship trying to become the ship's stand-up comedian. But Adam Sandler is not funny. Nor is the current ship's comedian. Nor is anything else about the movie. I was waiting to laugh for about a half hour. Then, the plot goes off on some wild tailspin and Adam Sandler is suddenly getting chased by some evil leader of a third world country all over the ship. I got lost from there on, and the film ended with me wondering what I could tape over it."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "chaosmind",
        "review_rating": "1",
        "review_title": "Astonishingly bad",
        "review_detailed_main": "The most astonishingly bad motion picture it has ever been my misfortune to watch.\n\nSave for a moderately-amusing forty-five second shtick by Billy Zane, this film is completely bereft of humor.\n\nAvoid, avoid, avoid."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "genesplice2000",
        "review_rating": "1",
        "review_title": "perhaps the worst movie ever made",
        "review_detailed_main": "there is not a single good thing about this movie.......I rented this movie(as many probably did) thinking that it was Adam Sandler and therefore funny. That is not at all the case. I recommend that all copies of this film get rented and destroyed so as to save people from watching it."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "ca_dale",
        "review_rating": "2",
        "review_title": "Painful to watch",
        "review_detailed_main": "Basically this film revolves around a wannabe comic (Sandler) trying to catch his big break as a stand up on a cruise ship. But his efforts are hampered by the obnoxious jerk currently providing the laughs, terrorists working for General Noriega, some Australian bimbo, evil flashbacks of his mother, and a whole lot of other bizarre happenings. How can this be bad?\n\nAdam Sandler is a great comedian and he would eventually hit his stride with films like Billy Madison and Happy Gilmore, but what we have here is a disjointed mess of potentially good gags and characters ruined by horrible acting and an even worse script. Sandler trademarks such as the numerous flat characters which contribute many of the best lines in his latter films and the silly dream sequences and non-sequesters abound, but they just don't mesh together in any sort of funny or cohesive way.\n\nGoing Overboard was Adam Sandler's first foray into feature length film and an absolutely dismal attempt at that. This movie is so mind numbingly bad its not even funny because of it, its just plain sad to deal with and even die hard Sandler fans will struggle to last the full run time. What a waste."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "localbum24",
        "review_rating": "1",
        "review_title": "I guess he had to start somewhere.",
        "review_detailed_main": "This movie truly sucks. Me and a bunch of buddies rented it a few years ago in hope that it would be something like Billy Madison or Happy Gilmore. But its not, it's just garbage. You can't fault Sandler for it because everybody's gotta do their first starring role somewhere right? The only reason worth watching this harendous flick is to see Billy Zane make a fool of himself playing the god of the sea. Other than that, dont waste your money."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "bellino-angelo2014",
        "review_rating": "1",
        "review_title": "My nomination for the most tiresome and boring comedy ever made!",
        "review_detailed_main": "I always wanted to watch this movie because it's considered by many one of the worst movies of all time, it always sat in the Bottom 100 (the list of the 100 worst movies of all time) and it's also known as Adam Sandler's debut (and I personally liked most of Sandler's movies). And sometimes I like to watch a terrible movie just for laughing at his inanity. But unfortunately, this was NOT the case. This movie really bored me to the point that I wanted to left it, but since it's not fair to dish a movie entirely after leaving it, I stuck with it.\n\nThe movie is set on a cruise ship. Adam Sandler plays a lowly waiter and is badly treated by almost everyone. This already makes the viewer sad and it makes you wonder if there are any other characters that suffer this type of abuses (even in real life). At the same time he is envious of a comedian that works on the ship that is painfully unfunny (and I am not joking, he looks even WORSE than Larry the Cable Guy) and it makes you wonder if the guy was crass and obnoxious just on purpose. As for the other members of the cast, we have Burt Young as a general that watches the movie on his TV, Billy Zane as King Neptune, a pointless bit role by a then-unknown Billy Bob Thornton and various beauty pageants with the same amount of personality of a door-knob!\n\nSo, the movie consists of comedians so unfunny that you'll rather hear dogs barking Jingle Bells for a year straight, paper-thin plot, and semi-naked ladies that pass on the screen from time to time. This makes it for one of the dullest movies of all time. But at least this proves that debuting with a God-awful movie doesn't necessarily destroy your career. Adam Sandler debuted with this and he managed to star in good movies such as 50 FIRST DATES, BIG DADDY and CLICK; tho he has also other bombs in his career such as JACK AND JILL (now in the Bottom 100), GROWN UPS 2 and THE RIDICOLOUS SIX.\n\nHowever, I knew that GOING OVERBOARD was bad, but I wasn't expecting THIS level of awfulness! This movie truly deserves all the hate since is cheaply made (with camera work so shoddy that it can give you a migraine), boring, badly acted and unfunny. It's no surprise that this movie has a score of 1,8 and it's among the lowest rated movies on IMDB."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "skillet300",
        "review_rating": "1",
        "review_title": "absolutely sucks",
        "review_detailed_main": "this movie is a total waste of space and time. at no point during the movie is it interesting or funny, just painful to watch. it is hard to believe a funny comic like adam sandler could make such a horrible movie. i guess he and jim carrey (rubberface) both started off with a bad movie."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "nynemout42",
        "review_rating": "3",
        "review_title": "Yikes!",
        "review_detailed_main": "Saw this movie several years ago on DVD. It's Adam Sandler's real break into the movies. It's absolutely nothing like his movies today. This movie goes way beyond the term \"cheesy\"! It's terrible acting and low budget. A few things were slapstick funny, but overall, this movie is better off left on the shelf! I'm almost willing to bet that Adam Sandler wishes he could buy up all the copies so no one else could watch it! Kind of like making a home comedy movie when you were 10...and then watching it when you're 30...only it's not as cute cause you weren't the one making the movie!! I don't live in my mom's basement and I don't sit around all day critiquing movies. I promise, it's an hour and a half of your life you'll never get back!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "UMiamiFilm",
        "review_rating": "",
        "review_title": "hahaha",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "lorandgyorgy-96671",
        "review_rating": "10",
        "review_title": "Adam Sandler",
        "review_detailed_main": "His first movie and he's already funny. I laughed so much during this movie."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "thug_passion-1",
        "review_rating": "7",
        "review_title": "It was okay",
        "review_detailed_main": "I thought the movie was pretty okay.. sure it wasn't great, but thats what I expected when I heard it was a NO-Budget movie. Adam Sandler is 23 years old in this movie and it was 2 years before his SNL time. So I think with the material he had, and everything, that its pretty nice work :) You don't want to expect too much from this movie, cause than you probably wont like it, but by my personal thoughts I think its exactly what I expected of it :) Not everything goes in a straight line but that doesn't always have to be like that. It was funny in his own weird way, But funny though :P So when your going to watch it, don't pay to much attention to the background and acting skills of some people. Just sit back relax and watch laugh and watch more :P"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "karl-booth",
        "review_rating": "1",
        "review_title": "Abysmal doesn't suffice",
        "review_detailed_main": "Until this moment in time I thought Hard To Kill was the worst movie I had ever seen. Boy, was I wrong.\n\nI knew I was in for a stinker when colleagues in my office DARED me to watch the film. Still I sat and tried to pick out good points in the film\u0085 It ended. That's about all I can say.\n\nThe plotline follows some average Joe who fancies himself as the ships comedian. From there its blah blah this and blah blah that. Nothing of interest happens other than a thankfully brief appearance by Billy Zane.\n\nIt's a right of passage film. It's a yardstick by which all other films can be measured. It's a stinker!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "neo666-1",
        "review_rating": "",
        "review_title": "even adam sandler fans will not laugh at this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Warteen",
        "review_rating": "1",
        "review_title": "Seriously the worst movie of all time",
        "review_detailed_main": "I've seen many movies in my day, and this one was literally the most painful to watch. Worse than \"Jeepers Creepers\"... worse than \"Glass House\"... worse than ANYTHING. If you have to choose between this and any other movie - I don't care what it is - watch the other movie. In fact, run screaming away from \"Going Overboard\". This will be the best advice you ever get."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Angel-Shadow",
        "review_rating": "2",
        "review_title": "Complete and utter Rubbish, the films me and my friend make surpass this garbage",
        "review_detailed_main": "I remember when my father bought our new panasonic DVD player around 2 years back, being 14 at the time I thought that this could be an interesting laugh, .......... ITS unwatchable and only funny to laugh at, at best. I wont ramble on for too long about this complete and utter waste of money but i recommend if you see this film in your collection hide it or chuck it out honestly i found this film that bad. I'm glad to see Adam sandler has made far better films than this since such as Big Daddy, thankfully they didn't follow this. On IMDb I'm usually quite generous to films upping their scores to what i think is more than deserved in many cases. 1 is all this film deserves. Adam sandler contributes a truly horrible performance and i really find it remarkable 140 people have given this a 10 ????????? each to there own but the only thing i can say is my 22 year old bro recently broke his leg and started to watch this, after 10 minutes he was watching The day after tomorrow, all that needs to be said."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "pubsky",
        "review_rating": "1",
        "review_title": "painfully bad",
        "review_detailed_main": "I randomly bought this at a Media Play on VHS in a local mall for $1 in a bargain bin. I thought to myself, \"Hey, its an adam sandler movie that I have never heard of, it has to be worth at least $1, that is cheaper than renting it!\" I have never been more wrong in my life. I have recently written a letter to Mr. Sandler demanding my dollar back as well as another $10 in compensation for the hour of my life he took from me as well as pain and suffering.\n\nAnybody who wants to say that this movie is so bad that it is good, is out of their mind. This movie has entrenched itself very firmly in the traditional bad category. Production value sucked, Adam Sandler apparently had not figured out how to be funny yet.\n\nThis film is a train wreck comparable to watching a 12 year old on a webcam trying to recite Shakespeare monologues, but not being able to pronounce or even clearly read the lines, much less act them out. Even worse, You would have to sit through an hour of that kid doing this. Maybe you could laugh it off for the first 5 minutes, but for the next 55 minutes there is nothing left except the pain your eyes and ears must endure."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "joel_shultz",
        "review_rating": "1",
        "review_title": "This movie made me sick.",
        "review_detailed_main": "Since my freshman year of high school, I have been one of the world's biggest fans of Adam Sandler and his work. I heard his first CD and from then on, I was hooked. So naturally, when I heard for the first time that he was starring in his own movie (Billy Madison), I got all my high school friends together, and we all went to the theater to see it. I loved it and was forever hooked on everything Adam. I collected every film I had ever seen him in for years to come; First on videotape, then later, on DVD. Then I found a website called IMDb.com where I copied a list of every motion picture he had been involved in (Producer, Actor, even Cameos), and proceeded to complete my collection. This brought me across a movie entitled Going Overboard. After purchasing the movie at a 2nd hand video store, I sat down and was subjected to the smelliest piece of cinematic excrement since Rubberface, to which I think this movie holds more than one similarity. The movie assaults the viewer with dull comedy which is apparently supposed to be funny because it is so bad. In my opinion, a good comedy needs no plot, or maybe more accurately if your situations and characters are funny enough, it doesn't matter what your plot is. (For an example check out Harold and Kumar go to White Castle or \"Dude, Where's My Car?\".) This movie's plot would have done just fine had the comedy been there to back it up. However, as it is, the ridiculous plot is actually dragged further into the abyss by the awful one liners delivered by the finest comedian of our generation. In my opinion, it is a shame that Sandler didn't have the sense to pass on this opportunity. In his defense however, if you had a chance to star in a full length motion picture, no matter how crappy the script, could you pass it up?"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "linsleyholmes",
        "review_rating": "1",
        "review_title": "This film needs throwing Overboard",
        "review_detailed_main": "Found this in the supermarket for £2 along side films like Bedazzled and Vanhelsing so thought this Adam Sandler offering would be worth a watch.\n\nThe back of the box said it was hilarious, more like tedious is you ask me. I can't understand how Adam Sandler ever appeared in any more films let alone become the comic he is now.\n\nNothing about the film was funny, the acting was terrible and the script was dire.\n\nIf you see this in a bargain basket near you please don't make the same make I did, you'll live to regret it.\n\nEven if the film was given to me for free it would still be too expensive.\n\nMy hubby say its only redeeming feature was the content of the beauty queens bikinis, even if most of there faces looked like drag acts."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "pompano321",
        "review_rating": "1",
        "review_title": "Adam Sadlers Diarrhea",
        "review_detailed_main": "It's not even good enough to be called crap. I think that this was the worse movie I ever saw. There was no Humor anywhere in it. And the Panamanians looked like a bunch of Meth Addicts off the street. After I found this DVD for $3.99 at Wal-Mart I figured it was a Piece of Sh*t but after me and my friend watched it. we had no choice but to dowse it in Gasoline and throw hot cigarette butts on it till it was nothing but a puddle of plastic on my drive way. Adam Sadler should have not even thought of Making this movie until he spent some time on Saturday Night Live! If he saw this movie he actually played in he would probably slit his wrist."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "a-twetman",
        "review_rating": "1",
        "review_title": "Unfunny and extremely annoying",
        "review_detailed_main": "This is one of the most unfunny, uninspired pieces of garbage I have ever seen. Stand up comedy is rarely funny unless the comedian really knows what he is doing. This film contains two of them, and they definitely o not know what they are doing. One is unfunny and offensive and the other (Adam Sandler) is just plain unfunny.\n\nExcept for the worthless stand up comedy, Sandler also spends quite a lot of time talking directly to the camera, whining about this and that, which I guess is supposed to be some kind of fourth wall joke, but it is extremely annoying.\n\nOh, and don't forget the bikini girls with 80's hair who are there as some kind of filler material when there is nothing unfunny or annoying to see. I like pretty girls in bikinis just as much as the next guy, but I really dislike it when they are put in a film without having any sort of purpose. Fill your film with worthwhile substance and let me look at bikini girls in my own time thank you very much."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "lnelsonart",
        "review_rating": "10",
        "review_title": "Better than Avatar!!!",
        "review_detailed_main": "Let me start by saying that I have seen some amazing films in my day. I have witnessed everything from Avatar to Gone With the Wind. I have also had the pleasure of viewing some of Adam Sandler's most popular films. And I can honestly say (and I'm getting very emotional as I type this) that Going Overboard is perhaps the best film I've seen and probably will see. I've heard so many bad reviews on this film. Most of which were incredibly harsh and cruel. How can a complete MORON hate one single scene in this magnificent film? I dare...no..I CHALLENGE you to find another film that comes even CLOSE to the wonder that is Going Overboard. Keep in mind that I've seen just about every other Adam Sandler movie and this one is far superior to Happy Gilmore. In fact, it makes all of his other films look like crap! Heck, it even makes Avatar look like crap!!! I challenge James Cameron to even ATTEMPT to match this movie. I wouldn't even try if I were him because it would just be hopeless. Overall, I was honored to have seen this film. It was every bit as funny and as clever as Caddyshack or any other comedy. Why it wasn't nominated for any awards is beyond me. It deserved way more awards than The Dark Knight I can tell you that much. You, as a human being, owe it to yourself to view/own this movie. I PROMISE YOU it will be worth your time and money. God bless the director, actors, and everyone involved in this film. You all hold a special place in my heart.\n\nPS: If you believed any of this review then you have severe brain damage. This is quite possibly the worst film ever made and I beg you to stay away from it."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "makiprettywoman3",
        "review_rating": "6",
        "review_title": "Movie was actually pretty funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dpoole7781-895-236207",
        "review_rating": "2",
        "review_title": "If only this movie had started like Titanic ended...",
        "review_detailed_main": "I found this in the bargain bin at Wal-Mart for $5. 'What a steal!' I thought. I had seen almost all of Adam Sandler's movies, and found them all to be pretty enjoyable, but I'd never even heard of this one, so it must be a hidden gem, right? Wrong. The 97 minutes that I spent watching this movie were torturous. Turns out that this was Sandler's first starring role in a film, and after having seen it, I'm more than a little shocked that he was ever given another opportunity. I mean sure, I only spent five bucks on it, but I couldn't help but think of all the better things I could have used that fiver on. Maybe a foot-long sandwich at Subway. Perhaps I could have given it to the bell-ringing Santa that had been standing in front of the entrance, even though his breath smelled like a combination of beer and Cheetos. In retrospect I think the five-spot would have even been better used as a Kleenex instead of using it on this movie. Avoid it at all costs. This movie earns its title as the worst movie I have ever seen in my life. Consider yourself warned."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Colto",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "This was absolutely pathetic! The acting was terrible and Adam Sandler how could he have been put in such a bad movie. The love boat was never quite like this because it knew how to be good!\n\nIn fact giving it a rating would be Going Overboard!!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "edrpz",
        "review_rating": "1",
        "review_title": "A Bad Movie On A Boat.",
        "review_detailed_main": "This movie is not as band as Adam Sandler's Jack and Jill, but it's very close. This was his first movie and some say that it should have been his last. The movie was bad all the way around. Nothing redeeming to even give something good to say about it. Its a typical late 80's bad movie. This one should have never been released on DVD."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "jdganner",
        "review_rating": "1",
        "review_title": "You Hear This A lot About This Movie. \"What The Hell Did i Just Watch!?!?!\"",
        "review_detailed_main": "This movie came out of a bargain bin for 1.49 which still makes it way overpriced. Where can i begin when talking about how bad this movie is, i guess i can start with saying its in my top 10 worst movies of all time. I only decided to watch it because Adam Sandler was the leading role, how his career not only survived, but actually developed after this movie, only god knows. I must confess i did like the opening scene where he described how low budget the movie was going to be so we could prepare ourselves, but i honestly didn't expect how cheap it was going to be even after he told us. Did anyone even watch it through to see the end?, because there's a strong chance that nobody ever has.\n\ni gave this a 1/10 simply because i'm unable to rate it any lower, good job to Adam on the comeback from Going Overboard though, he deserves it!."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "fortdj33",
        "review_rating": "1",
        "review_title": "Worst film Adam Sandler ever made",
        "review_detailed_main": "This, in my opinion, is a terrible film, and I am an Adam Sandler fan! I rented this to see if it was something I would want to buy, since I am trying to collect all of his movies, and I'm glad I only rented this movie! I couldn't even watch it all the way through, it was so badly acted, and it had very little plot. One has to wonder if the producers at Saturday Night Live saw this before they hired him, since it was done before he starred on that show. If you're looking for a funny Adam Sandler movie, this isn't it."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "tristanveronie",
        "review_rating": "1",
        "review_title": "The worst movie I have ever seen in my entire life",
        "review_detailed_main": "I'd rather die than ever watch this movie ever again. It gave me a migraine. I'll never laugh at anything Adam Sandler ever says again for the rest of my life. I couldn't even finish watching this atrocious movie because I literally felt ill. I am not kidding.\n\nDo not ever watch this movie under any circumstances. If you're looking for a \"so bad it's good\" movie, look somewhere else. There are no redeeming factors about it at all.\n\nThis movie saps the energy from you, to the point where you can't even muster up the motivation to cringe. Do not watch it. I'm begging you.\n\nAlthough, if you do happen to locate a copy of the film (if you can even call it one. I'm pretty sure the only thing that ran through the camera to record this monstrosity was a roll of toilet paper), be sure to purchase it and get rid of it, so that no one will ever have to view it ever again."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mikeokun-163-881408",
        "review_rating": "1",
        "review_title": "You think it's bad... nope, it's worse.",
        "review_detailed_main": "There's no nice way to put this... this has got to be the worst waste of a human's time ever created. It's so bad that you will literally want to gouge your eyes out. There's nothing funny. It's not even corny, it's just bad. Bad Bad Bad. It's so bad, that Adam Sandler doesn't list it in his filmography on his website. You know it's bad when the \"star\" is ashamed of ever doing this."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "sarcasm101",
        "review_rating": "",
        "review_title": "Whatever you do- don't see",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Oh Adam!!!!",
        "review_detailed_main": "A solid hard hitting drama. Not as many extreme long range golf shots than I would have liked but I guess it is on a cruise ship."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mail-81",
        "review_rating": "6",
        "review_title": "quite entertaining",
        "review_detailed_main": "despite my preconceptions of this film i actually enjoyed it. i am more a fan of sandlers recent films, the wedding singer, bulletproof and big daddy rather than the likes of billy madison and little nickey, so i honestly saw this film expecting not to like it. however, although i didn't burst out laughing i did find it quite amusing, in a ridiculous sort-of-way. it's the kinda film you should watch when you're having a really boring day and have nothing else to do."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "johnq93",
        "review_rating": "1",
        "review_title": "Why Lord Why?",
        "review_detailed_main": "While at my local video store recently, this title caught my eye from the bargain bin. I thought \"Wow, maybe i've stumbled across some hidden Sandler gem\" how wrong i was.\n\nThis Movie is garbage, i can't begin to describe how bad it is. I mean, Adam Sandler is just all wrong in this role. The direction is poor and half-assed and looks as though it was rushed. The script probably started off pretty good but the director ruined it by focusing too much on the comedy and one liners but not the story line.\n\nThank god Adam Sandler moved on to bigger and better Things.\n\nJohn"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "treakle_1978",
        "review_rating": "1",
        "review_title": "What a dumpster Fire.",
        "review_detailed_main": "This is by far the worst movie I've seen from Adam Sandler. I never laughed once and everything about this movie is bad. Budget or no budget this should've never been released.\n\nTim Treakle"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "annelise_rose",
        "review_rating": "1",
        "review_title": "oh my god",
        "review_detailed_main": "I plead with anyone who sits here like i do thinking i like this actor what other films have they been in, and that actor is Adam Sandler and this comes up...NEVER EVER WATCH IT. We bought it for 50p in a used DVD shop thinking oh sweet bargain, yeah it was crap so bad in fact my bf who has a rule about not switching a film off once its started turned it off after 10 minutes. We have tried a few times to watch it to see if it gets better and i think we have made it as far as 17 minutes in. So in case you haven't got the drift of this post please never ever watch this movie you'll thank me for this advice someday. I swear it really is unfunny, I mean I can see it was his first film etc but there is no excuse for this abomination."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "wes-connors",
        "review_rating": "2",
        "review_title": "When the Ship Hits the Fan",
        "review_detailed_main": "Stand-up comic Adam Sandler (as Schecky Moskowitz) gets a job as a cruise ship waiter. His cross-dressing California friend Tom Hodges (as Bob) thinks Mr. Sandler is funny. With movies like this, it's good to have friends like that. Sandler would like to replace snickering Scott LaRose (as Dickie Diamond), the boat's official stand-up comedian. Also on bored (sic) is mellow \"Yellow Teeth\" rock star Adam Rifkin (as Croaker), a bunch of beauty contestants in skimpy bathing suits, and a gang of card-carrying members of the SAG. Sandler also gets help from legendary comedian and joke thief Milton Berle, who cleverly unloads a few of his worst acquisitions on the unsuspecting upstart...\n\n** Going Overboard (3/89) Valerie Breiman ~ Adam Sandler, Tom Hodges, Scott LaRose, Adam Rifkin"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Floated2",
        "review_rating": "1",
        "review_title": "As bad as advertised",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "ExeGol",
        "review_rating": "1",
        "review_title": "This movie is so bad, I think I'm going overboard!",
        "review_detailed_main": "I chose this movie, because I wanted to see a movie that is in the IMDb bottom 100. I'm not a big Adam Sandler fan, but nevertheless I was hoping that it couldn't be that bad as the 1.9 rating it's receiving.\n\nBoy, was I wrong. I think even 1.9 is too much. It was so bad, that I couldn't watch the whole movie in one piece. I saw it in two pieces, and still found it difficult to keep watching.\n\nThe only reason I gave this movie 1 star is because there is a rock song in the movie that wasn't so bad (although very bad play-backed), otherwise there is no reason to give this movie a star at all.\n\nIf you want to see a movie from the IMDb bottom 100, have a try, but otherwise please stay away from it. Otherwise you will end up thinking like me: I think I'm going overboard!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "JoeD1979",
        "review_rating": "4",
        "review_title": "What's with the celebrity cameos?",
        "review_detailed_main": "First off, they had to be going for a bad movie here. Nobody in their right mind could of thought this movie would of been good to begin with. That's why I didn't hate this movie as many of you. I actually laughed out loud a few times believe it or not. They key word there is \"few.\" So with that I ask, what is with all the stars? What I mean is, I understand Adam Sandler in his first movie, okay I get that. But what about Peter Berg, Billy Zane, Milton Berle, and last but not least a cameo by Billy Bob Thorton?? Strange but true...I don't get it. Also, what is with Rocky's manager as Manuel Noriega?? This whole casting process, and plot were just off. There was also the guy that is in all of Adam Sandler's movies as the bartender as well. Someone must have either a extremely strange sense of humor, or just plain crazy."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "SleeperVB",
        "review_rating": "1",
        "review_title": "Feel bad for Adam and his Boys",
        "review_detailed_main": "This was a $5 flick picked up by my buddy and unfortunately I sat down and watched it. The movie must have been aimed at an audience of college kids who had been out partying before hand. All in all it was horrific to watch and I now feel like I wasted 2 hours of my life. Good Day"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "CharlieHearse",
        "review_rating": "",
        "review_title": "Pitch this idea to a production company...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "surfs_up_55",
        "review_rating": "10",
        "review_title": "So bad its awesome",
        "review_detailed_main": "Yes folks, this is one of those movies! Its soooooo bad, but so good. This movie just stinks. It may actually be worse than The Room. The only way this can be viewed is with friends. There is no way you can watch it on your own (please don't try, you'll thank me). The acting is bad, the production is bad, the 4th wall breaks are bad, and the jokes are bad. But all that just adds to its hilarity. I watched it with some buddies and we didn't stop laughing and quoting it for ages. Highly recommended. Surprisingly there are also lost of cameos from some solid actors/directors which makes this movie all the more baffling. 10/10 would watch again... With friends..."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "gibson6962",
        "review_rating": "2",
        "review_title": "Really Bad",
        "review_detailed_main": "i am a huge Sandler fan. in fact i own all of the movies that he has ever been in, but this movie was horrible. No humor in it at all. I fell aslep watching it the first time i tried. Avoid this movie it is a waste of your time. i give it a 2"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Jackpollins",
        "review_rating": "1",
        "review_title": "As much fun as continuously being stabbed in the eyes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "cbleek12",
        "review_rating": "1",
        "review_title": "Seriously????",
        "review_detailed_main": "In terms of slapstick comedy, there are only 3 people I can name off the top of my head who actually are funny. Adam Sandler is not one of them. I don't care for his serious stuff, but there are times he appeals to my dork nature. I loved him in Airheads, Billy Madison, and Anger Management. But if actors want to improve their craft based on constructive criticism: stop doing the stupid voices. It isn't funny. How studios back some movies, one can only guess. This movie is one of five that I just stopped watching because it was just that bad. Sadly, this is the only \"comedy\" I have turned off 15 minutes in (I waited 20 minutes for Date Movie). The timing was off,the plot was stupid, and I still want my 3 dollars back."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Tucker2007",
        "review_rating": "1",
        "review_title": "I can't believe I watched the whole thing...",
        "review_detailed_main": "Give yourself a pat on the back if you've ever finished this movie. It has got to be the worst bad movie I've ever seen. What I mean by that is that it doesn't possess that so-bad-it's-good quality. It's just bad. This isn't Battlefield Earth. This is like watching a feature length movie that your 10 year old nephew made. I seriously have no idea how they can get away with charging money for this.\n\nThere's not much else to say about it really.. The jokes aren't funny and nothing interesting happens. The guy that played Paulie in the Rocky series plays general Noriega for no reason. That's sort of interesting."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "danterockstar",
        "review_rating": "1",
        "review_title": "Painful To Watch...",
        "review_detailed_main": "I truly was wondering why this film was going for just £1 in my local Blockbuster. Now I know why. Man, this film was just so painful to watch. The only thing that made me want to watch it right to the end was the fact that Adam Sandler was in it, and he was simply awful in it. Don't get me wrong, I absolutely love Adam Sandler but it's hard to believe he became such a success today when his early career was like this. It really is not his fault though, it's just simply down to bad writing. Stupid, horrible, delusional writing. This movie could probably be seen as 'The Young Ones on a Cruise' but even the Young Ones were funnier than this. This really is not a comedy. A Comedy makes you laugh or maybe even smirk. This film is more of a.... torture device. The Characters were bland, the story didn't make sense, the directing was absolutely shocking and the person who wrote this should be assassinated. Just stay away from this damn movie."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "bocephusbuddy-1",
        "review_rating": "1",
        "review_title": "Helen Keller turned this movie off and hit me!!!!!",
        "review_detailed_main": "I just finished watching Going Overboard. I have to say that we should send every copy of this film to Iraq and make them watch. I even tried to get a blind women to watch this and she turned it off in like 20 min. Adam Sandler could not find a better project than this? As for the writing, if thats what you want to call it, those responsible should be forced to watch this movie forever in Hell!! I believe that somewhere I read that the budget for this film was $10,000 and they were way under. Did Wallmart get a good deal on this? Every store has a big huge bin of this crap sitting on the sales floor. The only good thing about this movie is you can use the DVD as a coaster, or trade it to a friend, but then they might not be your friend anymore!!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Imrahil",
        "review_rating": "1",
        "review_title": "I no longer fear Hell...for I have seen this movie.",
        "review_detailed_main": "...okay, maybe not all of it. Lured by the false promise of bikini-clad women on the movie's cover...but the HORROR...THE HORROR... ...whatever you do, do NOT watch this movie. Gouge out your eyes, repeatedly bash your skull in...do what it takes. Never again--never forget!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "b-dynamite",
        "review_rating": "1",
        "review_title": "Absolute Waste Of Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mystic80",
        "review_rating": "",
        "review_title": "Betcha we'll never see that Sandler guy again!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Are-you-having-your-period",
        "review_rating": "8",
        "review_title": "Not nearly as bad as people say it is!",
        "review_detailed_main": "I waited ages before seeing this as all the reviews I read of this said it was horrible! i rented it expecting the worst, and while it is hardly the best sandler film out there, there are much worse! Sandler frequently talks to the camera and the film does not take itself seriously, but that is all part of the fun! A great way to waste an afternoon, and you might even find yourself laughing once a twice! A good film, well worth renting!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mrjamiereeves",
        "review_rating": "1",
        "review_title": "Even worse than The Room!",
        "review_detailed_main": "This is the worst film I have ever seen! Everyone involved in this film should be highly ashamed of themselves!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Aardsy",
        "review_rating": "1",
        "review_title": "Oh, why can't I be blind?",
        "review_detailed_main": "Mere thoughts of \"Going Overboard\" (aka \"Babes Ahoy\") make me want to weep. Throwing yourself out a window would be better than watching this movie. It's not even a supposed \"so bad it's good\" movie. I would spend money to buy copies of this movie and burn them so that people can't see it. Oh the pain, the pain..."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "jacleepin",
        "review_rating": "2",
        "review_title": "adam's worst",
        "review_detailed_main": "This is definitely the worst movie Adam's ever done but at this point in his life, he was just happy to have a movie. There are 3 or 4 laughs in it but I used the fast forward button through some of it. Don't waste your time. I only saw it because I wanted to see all of his movies, but it sucked."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Shane29",
        "review_rating": "",
        "review_title": "Like a fine wine...but at the grapes stage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "samuelLjackass",
        "review_rating": "2",
        "review_title": "Sad",
        "review_detailed_main": "Not the worst movie I have ever seen(Zombie Nation) but still very very bad. I am not the hugest Sandler fan to begin with, but that is not to say I don't enjoy the movies that he is in (thanks to the rest of the cast and crew). This movie is an example of what Adam Sandler BEFORE his notoriety, BEFORE his friends could carry him and BEFORE he started doing his \"voices\" which all sound the same... anyways the end result was godawful. I'm under the impression that they didn't even have a script and that they just made the movie up as they went along. I know a lot of people will see this movie anyways because they believe Adam Sandler will make up for its low budget, unfortunately a low budget wasn't the only problem by any means... it's just sad"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "evansj-78324",
        "review_rating": "1",
        "review_title": "Don't even try",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "The-Plague",
        "review_rating": "2",
        "review_title": "A wannabe comedian takes a job on a cruise ship hoping he will one day be able to perform.",
        "review_detailed_main": "You know that one movie that your favorite actors made that is just kind of\u0085well\u0085so bad it makes you want to cut onions just to cover up the fact that you are crying? This is that movie for Adam Sandler fans. I do not know if it would be easier to talk about what is wrong with this movie or what they did right, but since I am a negative guy to begin with, let's get started.\n\nAdam Sandler's acting is borderline horrendous, and I don't mind bad acting, but for some reason it just annoys me with this movie. He keeps talking directly to the camera, turning it into one of those (The main character knows this is a movie, movies), which I think is an ineffective comedy tactic. The terrorists in the movie were equally annoying and disappointing, and the rushed plot comes to an abrupt ending with no real storyline in the middle or conclusion. It is like opening a beer, then cutting to someone throwing a bottle away. What happened to all of the good stuff in the middle?"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dangermanuk",
        "review_rating": "1",
        "review_title": "It's terminal I'm afraid",
        "review_detailed_main": "Yes absolutely this is a load of rubbish.\n\nI got it 'cos it was the only Adam Sandler film I've not seen. It's a film, sort of, and in that sense it's the only good thing I can say about it. I've sure that, like a school play or project, family members or close friends of those involved will say \"Wow, what a great movie\", but in all honesty, for people like me and you, no. It's a no.\n\nIt's all a little too Pugwall for me. Sandler addresses the camera in a soliloquy far too often. This does not bode well for any modern silver screen production.\n\nHowever, to end on a positive note, you could enjoy your evening a little better by going outside and shooting yourself through the head."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "user-854-151630",
        "review_rating": "10",
        "review_title": "Sandler does it again!",
        "review_detailed_main": "As an avid Sandler fan, (qualification requires an IQ of 72), I thought this was bloody brilliant. Sandler's face on the box sorted it for me.\n\n2 minutes into the film I was riveted to my seat by the appearance of JAWS jumping through the air and catching an aeroplane. (Or was that Giant Octopus vs. Megashark?) I can't remember since they are both such incredible films.\n\nSandler's comic genius comes alive and is yet again second to none, barring Michael Gambon (Dumbledore) - Love Ali G <3. Adam's friendly and warm tone of voice takes you away like ecstasy, you can feel the laughter bubble up from you testicles before it implodes inside your mouth in fits of laughter.\n\nI implore you to watch this film, it is as moving as Gladiator, as epic as Lord of the Rings and as horny as 50 Shades of Grey."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "riley2236",
        "review_rating": "1",
        "review_title": "it sucked",
        "review_detailed_main": "this was one of the worst movies i've ever seen. adam sandler is my favorite actor and i've liked all his movies until i saw this one. it was painful to watch. i was excited when i saw this movie on the shelf and when i watched i really wanted to like it. i tried to make myself laugh at the corny and terribly unfunny jokes but i couldn't even stay awake the whole time.i started to watch this movie with 3 other huge sandler fans and when i woke up every one else was asleep. so in conclusoin i found this movie depressing and i wish sandler would never have made it."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dulifan",
        "review_rating": "",
        "review_title": "Awesome in its awfulness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "terryleeander",
        "review_rating": "1",
        "review_title": "Horrendous.",
        "review_detailed_main": "Quite possibly the worse movie I have ever seen. My brother rented this about ten years ago and I still haven't forgiven him. How did it get made and after making this horrendous film, who thought it was a good idea to actually release it. I wish I had a picture of the face I was making as a sat through this entire film, so I could at least laugh at that memory. Why the hell was Blockbuster even renting it out! Every copy should be burned!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "magicmanmb",
        "review_rating": "1",
        "review_title": "Sandler should have bought all the copies & set fire to them",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "swaron",
        "review_rating": "1",
        "review_title": "Going Overboard helped kick start Sandler's career?...Not Exactly",
        "review_detailed_main": "I am still kicking myself for spending bargain price for this movie. I can't give it away. I thought, as probably did most that ended up suffering through this movie, that it would be funny to see Adam Sandler's beginning. Unfortunately the movie really tries too hard to be funny and with real bad humor at that. I am a fan of Sandler, but as much as I looked I could not find anything good about this movie, and I am usually very fair. Basic plot is: He knows he's in a low budget film, he wants to headline the ship's stand up act and he hangs out with some very strange folks. Billy Zane makes a short appearance (why?) in a very bad costume and Sandler's buddy Allen Covert makes his required appearence as well."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mutchin",
        "review_rating": "1",
        "review_title": "The worst film in the world ever.",
        "review_detailed_main": "It is a shame there is no 0 to select for rating.\n\nThis is without a doubt THE worst film I have ever had the misfortune to watch. I cant think of anyone who would enjoy it.\n\nI bought it under the same pretence as everyone who has bought it, cheap, Sandler, funny! Well it is cheap, it is Sandler, and it is NOT funny.\n\nI cant think of a way of putting across how bad this is.\n\nDo not waste your time with it.\n\nThis is not a rating on Sandler, but the film, this film aside, Adam Sandler is amazing :D"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "tmosest",
        "review_rating": "2",
        "review_title": "Makes you want to go overboard",
        "review_detailed_main": "One of the worse movies I have ever had the pleasure of watching. The jokes are bad. The acting is bad. The plot is terrible. But I'm not disappointed that I watched it. It was a \"no-budget\" movie and it was good to see a fresh young Adam Sandler. Everyone has to start somewhere and it's interesting to see how he's improved."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mram16",
        "review_rating": "3",
        "review_title": "Novelty Value Only",
        "review_detailed_main": "Only worth seeing if you're a fan of Adam Sandler and want to see his first movie; other than that, there's not much incentive to watch it. There are a number of scenes that don't quite fit, such as the Noriega/terrorist storyline that makes no sense. Other scenes that are out of place include a surreal dream sequence with Schecky and Dickie Diamond, a scene where Schecky and Bob break into song for no good reason, and Billy Zane's appearance as King Neptune.\n\nIf there are any bright spots, they'd be the willingness of the movie to poke fun at itself at times, Scott LaRose's vulgar turn as Dickie Diamond, a foul-mouthed comedian with a taste for incest jokes, and a cameo by Milton Berle.\n\nPay attention or you might miss them: Allen Covert as a bartender and Billy Bob Thornton as \"Dave\" , a rude audience member.\n\nOverall: A not so funny comedy. If you're interested in seeing Sandler's early work, watch it. If you're looking for laughs, this movie probably isn't for you."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "aliceklincheva",
        "review_rating": "2",
        "review_title": "Only for true Adam Sandler's fans",
        "review_detailed_main": "You know, for the first Adam Sandler's role it's not that bad. I mean, the movie is awful but the budget wasn't fascinating neither. From the beginning Adam says that movie will not win an Oscar. You can't take seriously a movie where NO A SINGLE JOKE. That film is nothing but parody of a comedy. Actor's play - worthless and sometimes I had an impression that a camera guy had a freaking tremor disease. That movie is just for Adam Sandler's fans who want to go through every single film he were in."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "chrisdykes-1",
        "review_rating": "10",
        "review_title": "almost Adam's worst film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Redpunkboy",
        "review_rating": "1",
        "review_title": "For Sandlers First Time Who Can Blame Him",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "gionk",
        "review_rating": "",
        "review_title": "Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "vasoxfan",
        "review_rating": "1",
        "review_title": "Worst movie... EVER!?!?",
        "review_detailed_main": "How can a movie with Adam Sandler be so unfunny? This movie was horrible and amazingly painful to watch. It was also way too long. Admittedly, there were a few rather attractive women (with 80's hairstyles) but there was no nudity, if that's what your hoping for. Can't believe a movie with Adam Sandler, Billy Zane and Billy Bob Thornton could be so horrible!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "JonathanDWestbay",
        "review_rating": "1",
        "review_title": "The first rule of Going Overboard...",
        "review_detailed_main": "The first rule of Going Overboard...\n\nYou do NOT talk about Going Overboard.\n\nThis is easily one of the worst movies I've ever seen. The acting is terrible. The swearing is excessive and not funny. The pacing is painfully slow. The girls aren't particularly stunning. I wanted to ignore the negative reviews. But they are certainly true. I watched about 15 minutes and then chaptered through. That was all I could take. Incinerate all copies you find."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "superscuba",
        "review_rating": "1",
        "review_title": "Painfully disappointing",
        "review_detailed_main": "I expected better from Adam Sandler. Sandler plays a cruise ship cocktail waiter who wants to be the ship's comedian but the ship's current comedian won't give him a chance. Throw in a couple of terrorists who are supposed to kill a girl on the ship but decide they too want to be comedians, a visibly low budget and a whole bunch of corny, disgusting and dull jokes and you've got the recipe used for Going Overboard, which should really just be thrown overboard."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "filmbuff1974",
        "review_rating": "4",
        "review_title": "Do Not Waste Your Time With This Movie!",
        "review_detailed_main": "Adam Sandler is actually a talented actor as we all saw in that movie \"Reign Over Me\". For some strange reason, most of his film projects are just bad films. This one is just the worse. In fact, it's actually abusive in it's awfulness.The fact that Going Overboard actually secured a distributor and was released into movie theaters is an astonishment. Think about it, people actually paid hard earned money going to see this movie and be entertained and instead found themselves watching this. It's almost a criminal offense it's so very, very bad! And make no mistake, I do not mean so bad that it's actually good. I mean this film is just not an engaging entertainment.\n\nDO NOT WASTE YOUR TIME WITH THIS MOVIE!!!There, I have warned you! By the way,I don't know why Adam Sandler is now a multi millionaire making film after film and that are all so lukewarm."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "brianberta",
        "review_rating": "2",
        "review_title": "A strong contender for the worst film I've ever seen.",
        "review_detailed_main": "I might as well briefly explain what I enjoyed about the film to get it out of the way. For one, I enjoyed the two terrorists who were sent to board the ship as they seemed to be having a lot of fun. Also, I'm generally a sucker for dreams, hallucinations, and other scenes which occur in a character's head and, while those scenes weren't great per se, I enjoyed a couple shots in them, like the overhead shot of Sandler in a straight jacket and the darkness surrounding the boxing ring. Finally, I suppose it was cool how the frame narrative was occurring at the same time as the seemingly present day cruise ship scenes. That's about all I can say about this film though as I disliked just about everything else. Bad comedy films usually have a few jokes here and there which I find clever, but virtually every single joke in this film missed the mark for me and made little to no sense. The few jokes which did make sense weren't particularly clever and were below average or competent at best. Given the opening scene, the film is clearly aware that it's a bad comedy film, but this scene actually does the film more harm than good. We're clearly asked to root for Shecky, but since his jokes are just as bad as Dickie's, it makes it hard to care about his outcome. In addition, virtually every single actor in this film (Adam Sandler, included) lacked charisma, minus the aforementioned two terrorists. I would've been fine if everyone gave hammy, over-the-top performances as this might've gotten a few laughs out of me, but virtually everyone here didn't seem to be having any fun, nor did they appear to be into the film. Finally, with the exception of a few shots I mentioned up above, the camerawork wasn't that good either. The (unintentional?) Dutch angles looked godawful, some of the camera angles were so poor it was difficult to follow scenes of characters simply moving around, and the chase scene at the end was overlong and humdrum (Sandler changing his shirt in the middle of it was nice though). So yeah, just a really awful movie which is a strong contender for the worst film I've ever seen."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "lperri-21383",
        "review_rating": "1",
        "review_title": "I can't believe I sat through all of this",
        "review_detailed_main": "I'm a big adam sandler fan so much I found out about this movie & decided to continue in watching every Sandler comedy. Well this wasn't a comedy & DONT waste your time"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "mindgem",
        "review_rating": "1",
        "review_title": "This movie is a tell on how Sandler works. He's the WORST",
        "review_detailed_main": "So..obiously everything about this movie sucks but in the beginning of the movie Adam says something along the lines of \"Ok so we decided to make this movie because we're here and get a free cruise and the models in the movie are not hired actresses but random ppl we included\"\n\nWell..that is how ALL his recent movies works right. He gets all his old buddies and make a movie based on a stupid 1 page plot or a bought 60s script for cheap, then he set the movie where he planned to spend his next vacation..a waterpark in Hawaii or something, then he gets all the sponsors he can muster so the movie becomes a 90min long commercial. There's no joy, no jokes, no story, no plot, no one can act. It's all a big joke yet there are plenty of dummies that enjoy his movies. Strange."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "robtaylor88",
        "review_rating": "10",
        "review_title": "Sandler's biggest fan here",
        "review_detailed_main": "Yes i can see that the film could be very poor to some people... but it's so silly and stupid that's it funny!!!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "miaaacameron",
        "review_rating": "3",
        "review_title": "It's cringey but cute",
        "review_detailed_main": "Young Adam Sandler is cute enough to watch this movie. You can tell that they were just fooling around, and in some way that makes it endearing to me. Yes, the jokes are bad. Yes, a majority of the movie is cringe worthy - but, there are some funny moments. And it's interesting to see Sandler in the beginning of his career"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "edward-network",
        "review_rating": "",
        "review_title": "Oh god",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "cousinmatt",
        "review_rating": "1",
        "review_title": "man this was bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Ryan_McLelland",
        "review_rating": "5",
        "review_title": "Not That Bad! Really!!!",
        "review_detailed_main": "I'm not really sure how I ended up on the Going Overboard page here on IMDb - but I decided to read all the comments after I saw it was on the Bottom 100 films. I had remembered hearing this film was AWFUL but after reading comment after comment about this being the worst film EVER - well - I just HAD to see it. Luckily Netflix has it on Instant Queue...time to see how awful it is!!!!!! Of course this is EARLY Sandler - early around is his time on the awesome Ken Ober show Remote Control on MTV. And from the git you know the film has NO budget - they are making a film based on what they have with no real script to speak of. For some odd reason - while I think the film does move kinda slow - I do find parts of it quite funny.\n\nThere's a great cast - as most people mention. I'm not sure how they got Burt Young or Milton Burle. Of course the rest are very young in the film: Billy Bob Thornton had just moved to L.A. a couple years before and was taking any roles he could get. Billy Zane and Peter Berg get to join the fun - as does frequent Sandler collaborators Allan Covert & Steven Brill. I found it GREAT that Sandler's best friend on the boat was Tiny from Revenge of the Nerds 2. God bless you Tom Hodges! Anywho Sandler is a very young guy working on a bad cruise line. He's very awkward, not happy with his job as a waiter, and dreams of being a comedian. The comedian onboard is a hairy, loud guy who Sandler abhors. He mopes around the ship trying to raise his confidence by talking with his friends.\n\nNOW - I've been on cruises - I think the creepiest part of this film is Sandler moping around looking at couples as they kiss. Of course the character is 'sad' - but if I was on a cruise ship and saw this mopey waiter lurking around eyeballing the guests I would report him. That's just me - but then again I'm trying to analyze Going Overboard as most others have - which is probably the downfall.\n\nIs the movie bad? Sure. But as someone who has watched LEGIONS of bad movies I really think this isn't too bad. It's great to see this early collab of Sandler, Covert, and Brill - and fun to see other Hollywood greats like Thornton and Berg so young. If you go in expecting Billy Madison or any Sandler past 1994 you will surely be disappointed. Actually...if you are MOST people you'll be disappointed. For me? It's no Mr. T in The Toughest Man in the World - but then again what is???"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Brad Acker",
        "review_rating": "2",
        "review_title": "A classic bad movie.",
        "review_detailed_main": "If you've ever seen this movie, you'd know that it! If you haven't, and want to see a classic BAD movie, I suggest you see this movie, because it ranks right down with the worst. So, if you're REALLY bored, go rent it. If you want to know what it's like, here's my little summary: Adam Sandler is hired to work on a giant cruise ship with some Ms Universe models and five other people. Adam doesn't like how one passenger is getting all the babes, and he tries to take over with the cheezy jokes. BUT WAIT! It only gets worse! You'll have to rent the movie yourself to see how bad it truly is."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "jacksbackintheunion",
        "review_rating": "4",
        "review_title": "Good points and Bad points",
        "review_detailed_main": "My friend and I were walking through TESCO down the DVD isle, we came across to notice and new column where they sell very cheap DVD's for no more than one pound. We saw a film called 'Going Overboard' we saw a picture of Adam Sandler and we thought this film cant be to good if its on sale for one pound, but never the less we bought it.\n\nJust before we watched it when we got home we read some reviews on 'IMDB' and looked at the rating\u0085 'And boy we were excited!' It was rated 1.8! So we thought this will be quite funny to watch.\n\nThe film is about Schecky Moskowitz (Adam Sandler) who wants to be a stand up comedian, but he can't become one because he works on a boat and nobody! will give him a chance on stage.\n\nThe film shows Schecky Moskowitz trying to write jokes and become a successful comedian\u0085.on a boat. I'm not going to lie this film isn't amazing but, I do recommend to go to TESCO and buy it for one pound, or rent it if you want to see a young Adam Sandler doing his first film and you may as well see it if you are an Adam Sandler fan. We rated the film a 4 because we did get an odd laugh now and then, which is the odd thing because it's mostly the hidden jokes which gave us the laughs."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Deimos-remus",
        "review_rating": "1",
        "review_title": "An eerie foreshadowing of Sandler's future career",
        "review_detailed_main": "This is without a doubt the worst film I've ever had the displeasure of watching, and I have to admit that I have no idea what possessed me to do so.\n\nThe only retroactively funny (more like pathetic) thing about this \"comedy\" is how Sandler's lame character Schecky complains about the dropping standards of comedy being reduced to fart jokes, fat people jokes, jokes at the expense of women; standards he himself picks up in the story. The irony is that not only is it the routine that Schecky himself picks up as a comic within this \"film\", but also exactly what Sandler's routine has turned into in real life and in the rest of his meritless filmography. The overuse of the same jokes with no payoffs and its eerie similarities to the other films in Sandler's career (despite him not being a producer/director on this) is just a testament to his consistent mediocrity. He has not progressed as an actor or comedian in any way since this disaster, and anything that he's in that happens to be good is because of the director or its premise (Punch Drunk Love for example makes a mockery/parody of Sandler's personality in a satirical way that totally works).\n\nHow Sandler's career picked up after this is a total mystery. The guy is talentless. Utterly and pathetically talentless."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "thebishop2",
        "review_rating": "1",
        "review_title": "Horrifying.....",
        "review_detailed_main": "I'm glad that I saw this film after Mr.Sandler became famous.\n\nIt is bad....bad,bad,bad. There is no plot. It's like watching a painfully dull home movie.\n\nI really enjoy his other films......but if you're a fan like me....stay away from this one. It may change your thoughts on Adam. You may never recover from the horror that is this film....I've had a better time watching old folks play scrabble in a home......."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "richardbutch69",
        "review_rating": "4",
        "review_title": "Adam Sandler on a cruise ship",
        "review_detailed_main": "This one of the best and well acted comedies I have ever seen. The plot is clever, the camera work exhausting , the soundtrack incredible and the acting superb. The movies budget must have been in the millions of millions. Adam Sandler must have spent months and months on the script to get it just right. Billy Zane must have begged his manager to get such a juicy part. Billy Bob Thorton must have the same manager as Billy Zane to get such a movie part. After watching this movie I sat on my couch for 30 minutes just trying to comprehend on what I had just seen. I was completely and I do mean completely speechless. I can not believe that this movie did not get an Oscar.........................................Just kidding it sucks !!!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "properbo666",
        "review_rating": "8",
        "review_title": "my own opinion of going overboard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "reckery",
        "review_rating": "5",
        "review_title": "Wait, Paddington gets a 7.2 and this gets a 1.8?",
        "review_detailed_main": "It's bad, but it's good bad at times. However, there are so many worse films rated above 7. Something's wrong."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "moviefreak350",
        "review_rating": "",
        "review_title": "A man who wants to be the lead comedic act on a cruise ship.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dirtydan1",
        "review_rating": "3",
        "review_title": "Adam Sandler has potential to be the funniest man in hollywood",
        "review_detailed_main": "I'll admit, this movie is very cheap and isn't the funniest movie ever. The acting isn't very good, the effects were bad, but it was amusing. When I saw this movie, I didn't expect much, but I what I saw, I liked. The main charactor is played by Adam Sandler. I loved him in all his other movies, and this was no exception. Iknow it was a low-budget film, but that is what I liked about it. Adam Sandler even made fun of it, stating that it wasn't a low-budget film, but that it was a no-budget film. When I watched this movie, I could tell that he was in for some big stuff in the future."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "focusakker",
        "review_rating": "1",
        "review_title": "Adam Sandler gets digitized in this film!",
        "review_detailed_main": "Hello. I am Paul Raddick, a.k.a. Panic Attack of WTAF, Channel 29 in Philadelphia. Let me tell you about this god awful movie that powered on Adam Sandler's film career but was digitized after a short time.\n\nGoing Overboard is about an aspiring comedian played by Sandler who gets a job on a cruise ship and fails...or so I thought. Sandler encounters babes that like History of the World Part 1 and Rebound. The babes were supposed to be engaged, but, actually, they get executed by Sawtooth, the meanest cannibal the world has ever known. Adam Sandler fared bad in Going Overboard, but fared better in Big Daddy, Billy Madison, and Jen Leone's favorite, 50 First Dates. Man, Drew Barrymore was one hot chick. Spanglish is red hot, Going Overboard ain't Dooley squat! End of file."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "dobbin-4",
        "review_rating": "5",
        "review_title": "Going Overboard; not great but not bad either.",
        "review_detailed_main": "Now, I personally do not think this movie is that bad and I certainly do not think that it deserves the bottom 100, I mean High School Musical is not in there and that is the biggest load of S@#& I have ever seen and I am not joking. Now, the film is about Stanley Marokitzadana or something and him trying to become a famous comedian on a cruise. The movie is particularly funny every noun and then and the jokes that are not hilarious are just funny and sadly some were not funny at all but it does not matter cause their funny jokes are more often. I think Adam Sandler did a very good job as the waiter and the bit where the plot gets so out of hand is just so damn funny ( last 5 minutes) and the bit where he is explaining how the earthquake cost them no money was also in the good jokes section. Also the terrorists are funny as well but sadly do not play a huge part in this funny, funny film. Overall fans of Adam Sandler will enjoy this film as it is first movie and you can really see how he became as funny as he is. I rate this film 54% for keeping me amused while being pretty hit and miss. So grab some mates and grab some beers and just watch a good movie starring Adam Sandler as his good old self. GO ADAM SANDLER AND THE WHOLE CREW IN THIS GREAT FILM YOU GUYS ROCK. Also to those out there who do not like this movie I think it is because you were expecting too much out of Adam Sandler's first movie cause in my opinion it is not as good as his other stuff but is definitely better then a lot of other comedy's out there and I even think it is funnier then Click ( not really but probably 3 quarters there. Thats my 2 cents from LacTheBod. I do not know maybe one day this will be respected as it is meant to be, as a comedy just made to introduce Adam Sandler to it's expecting audience. If you did not like this you have to high a standards as it is better then some new movies out there."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "HeyimShibby",
        "review_rating": "1",
        "review_title": "Tiw going insane",
        "review_detailed_main": "Today I attempted to rewatch going overboard\n\nThis is, without exaggeration, the worst film I've ever watched. The problem is that this movie is SUPPOSED to be funny, so when you're trying to funny and you fail stupendously... well you get this monstrosity. This movie is almost impossible to finish. I watched it with a friend a while back and then tried to rewatch it with a different friend this time\n\nHe said please shut it off in the saddest tone I've ever heard about 10 minutes in\n\nI have finished this movie before but this movie is worse than anything I have ever, it is vile, it is not funny, it is torture\n\n0/10."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "morgankobayashi",
        "review_rating": "1",
        "review_title": "Best movie",
        "review_detailed_main": "Going overboard, is a unique transitory movie that revolutionized the production mode for comedies. With intense meta-industry commentary, Adam Sandler really changed the movie industry forever. Witty dialogue, and a consecrated narrative structure, going overboard is the most important and best film of the 21st century."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "daviesesq",
        "review_rating": "10",
        "review_title": "11/10",
        "review_detailed_main": "A truly great film. We've all had a movie that we wished would never end, this is mine. And looking at all the other reviews, it's fantastic to see that I'm not alone! Thanks everyone. And to anyone reading this that (astoundingly) hasn't checked this gem out ..... do it. Do it as soon as you possibly can. You'll thank me. One day."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "I_Ailurophile",
        "review_rating": "1",
        "review_title": "Desperately, astonishingly unfunny; unquestionably one of the worst films ever made",
        "review_detailed_main": "We know that Adam Sandler can genuinely act when he wants to. We know, despite abundant evidence to the contrary, that he can be funny when he wants to be. Yet how his career ever survived this movie is a great mystery. If I were a less generous person I'd have shut the movie off before the opening credits finished rolling, and it was only a masochistic sense of commitment that allowed me to continue watching with each subsequent and very frequent urge to give up. Rare, fleeting, infinitesimal fragments of cleverness are far outnumbered and overwhelmed, and forgotten as quickly as they come and go, in the midst of unending, unfunny, tiresome crassness, boorishness, anatomical and gross-out jokes, sex jokes, toilet humor, sexism and male gaze (women in this are nothing but meat for male consumption), and the insistent choice of breaking the fourth wall. Every now and again a line or gag comes close to earning a smile, but the good feeling fades so swiftly that one is forced to wonder if it was ever there to begin with, and this is to say nothing of jokes that punch down, that haven't aged well, and which were never appropriate in the first place, or bits that are drawn out for far too long. Frankly, I thought I was aware of what I was getting into when I sat to watch 'Going overboard,' and still I'm astounded by just how incredibly, peerlessly dull and obnoxious it is.\n\nThere is no entertainment to be had here. Absolutely none, zero, zilch, nada. There might have been one or two points where it was so awful that it almost inspired mocking laughter, but that was the nearest it came to inspiring anything that could be described as positive feelings. I've never previously come across the name of writer and director Valerie Breiman, and after this I'll make a point to avoid anything else she's been involved with; likewise for credited co-writer Scott Larose. (There's no need to make extra effort to avoid Sandler's films, I pretty much gave up on his \"comedy\" years ago.) Any compliments that might have been reserved for the cast, or for the contributions of those operating behind the scenes, are obliterated in the face of what Breiman and Sandler would purport to give us. For all those pictures that are referred to as among \"the worst ever made,\" I often find myself incredulous, for they are nowhere near the bottom of the barrel that I've witnessed time and again. In this case, I'm shocked beyond belief that the same label hasn't been more commonly appended to 'Going overboard,' because this is desperately, atrociously tasteless, witless, simple-minded, low, shallow, uninteresting, and downright vacuous. I don't know if I should feel bad for those who got roped into this, or despise them for agreeing to participate. I do feel bad for the kitten that shows up for a few seconds though - they deserved more time on-screen, in any other movie.\n\nIt doesn't matter who you are, or what your preferences are. I have to assume that even those who are diehard fans of Sandler, who find to be riotous those later features of his that are otherwise routinely lambasted, would be appalled at just how feeble and wearisome this is. Even if you're a fan of someone on hand, there is no reason whatsoever to watch this. I say this in full awareness that I, too, got sucked into watching out of ill-advised curiosity. Well, let me speak plainly: I can confirm without a doubt that all the worst things you could possibly read about this 1989 title are absolutely, 100% true. It's garbage even by the standards of other garbage's garbage; it's the rubbish that the Junk Lady in 'Labyrinth' would cast way without a second thought. If there is any good to come of my viewing experience, please let it be that at least one person attains the wisdom to avoid 'Going overboard.' I beg of you - do not let my misery be in vain."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Oskado",
        "review_rating": "",
        "review_title": "Absolutely hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "pylesj-94770",
        "review_rating": "2",
        "review_title": "Boring,Unfunny. The only thing I like is that it is summer about.",
        "review_detailed_main": "I watched going overboard to get ready for the summer and let me tell ya. It sucked balls. Yes you did hear me right BALLS. Well ther is one thing I liked about it. I like that it takes place on a ship and was tropical and it WILL get me ready for the summer. But the rest is boring and very cringe and unfunny but not as bad as skibiti toilet. If it wasn't about ships and summer it would almost be as bad as that horrible skibiti toilet thing. I didn't think it was a good investment EVEN FOR FREE. By the way it was free. I watched it for free on Tubi. But I am still a Adam Sandler fan beacause it's his first movie and the other movies are good."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "JS614",
        "review_rating": "1",
        "review_title": "Worst movie I can remember watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "nuhc",
        "review_rating": "1",
        "review_title": "Hard to watch craptastic movie",
        "review_detailed_main": "Found this movie on a streaming service, so as a fan of bad movies thought I needed to watch it. It was just about totally unbearable. I knew from the first moment Adam Sandler broke the fourth wall, it was going to be even worse than I thought.\n\nThe trivia says that this movie was written in 3 days. Cast in one day, and shot in 6 days. From concept to completion was 3 months. The quality of this movie really reflects it. Adam Sandler was asked to be in this movie about a week and a half before it was shot, before it was even written. That doesn't surprise me one bit. Everything about this movie appears rushed, ultra-low budget, and apparently used all first takes of each scene. I do understand that this movie was made in the 80's when B movies were popular, but there's no reason this movie should have been made."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "MrPaull0324",
        "review_rating": "2",
        "review_title": "A bad start for Adam Sandler",
        "review_detailed_main": "Don't watch this movie. Seriously, just DON'T! I don't care if your a die-hard Adam Sandler fan. After debuting in something this appalling, it's nothing short of miraculous that he even had a career at all. Even moreso than Arnold Schwarzenegger after starting off in \"Hercules in New York\".\n\nSandler stars as an aspiring stand-up comedian named Shecky Moskowitz who works as a waiter aboard a cruise ship named \"Ocean Spirit\". On board, he completes with the ships comedian Dickie Diamond (Scott LaRose). After Dicky accidentally locks himself in a bathroom and is presumed dead, Shecky takes his place and inexplicably succeeds as a comedian. Later, in an unnecessary sub-plot, the main villain named General Noriega (Burt Young) seeks to kill one of the models, Miss Australia, for insulting him and sends two of his men crew to hijack the ship, forcing Shecky to save the day with the power of laughter.\n\nFirst of all, the film runs on a shoestring budget that Shecky himself informs the audience via breaking the fourth wall. All the effects are amateur at best or pathetic at worst, especially the camera work. A group of high-school film class students could have done better than this.\n\nThe characters are boring or obnoxious. Dickie, despite being the alleged better comedian, is as much an annoying, talentless, jerk as Shecky. In fact, the lack of real humor from either so-called comedian is only worsened by a few moments of gross-out humor, such as seagulls defecating in obnoxious people's drinks, Shecky's low brow urinate joke, and a rock star with a serious case of meth mouth. Yuck!\n\nThe only remotely good part of this flick, besides all of the beauty queens providing eye candy, was the song \"Girlie Girlie\" by Sophia George being played several times, even though it was wasted on this mess. There's also a few notable cameos, such as a heckler named Dave (Billy Bob Thornton) who rightfully tells Shecky he has no talent as a comedian, and King Neptune (Billy Zane) who gives Shecky a pep talk. Those are the only reasons I gave this a 2 instead of a 1.\n\nIn the end, the film is nothing more than a pathetic mix of foul language, annoying characters, gross out/toilet humor, and unfunny jokes that'll leave you feeling disgusted and angry at having wasted your time watching this. I certainly did, even though I couldn't bear to even watch the entire thing."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "nicorocks",
        "review_rating": "10",
        "review_title": "Quite abysmal",
        "review_detailed_main": "I only gave the movie 10 because I feel that Adam Sandlers movies are underrated. Going overboard was a waste of money. All his other films such as 50 first dates,billy madison,the waterboy,anger management,big daddy,happy gilmore and others were on the whole very good. Although a lot of critics would disagree with me.\n\nGoing Overboard has no proper plot lines apart from a underprivileged steward (adam sandler) trying to be funny. He is actually funny but not in this movie which is no budget which he did clearly state at the beginning of the movie. He recognised that it was a crap movie which it is. But that was before he got funny."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Shikinharamitsudaikomyo",
        "review_rating": "",
        "review_title": "Best. Movie. Ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "MartinJeff411",
        "review_rating": "8",
        "review_title": "Why so serious?",
        "review_detailed_main": "So many angry reviews are cracking me up. It's Adam Sandler's feature debut and I admit it's extremely dumb and pointless but that's what made comedies fun back then. Comedies today compete to be big blockbuster hits and honestly most of them just suck so bad. A Night at the Roxbury was dumb as hell too but no one cared because it's just something goofy and fun to put on. I just paid 95 cents for Overboard and it's not gonna ruin my life. I enjoyed it for what it is. Guess you had to grow up in the 90s to really understand."
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Adam Sandler is so funny!",
        "review_detailed_main": "Howdy! I just want to take the time and tell you about a guy named Adam Sandler. He's a funny guy. He has done many things; including fighting with \"The Price Is Right\" host Bob Barker.\n\nNow, let us go back in time - way, way, way back in time! His first movie, \"Going Overboard,\" may appear to be bad to the average Joe person. But not for die-hard Adam Sandler fans! This is one of those \"So Bad It's Good\" movies that keeps every movie person glued to the television set! Also, who (refering to us guys) doesn't like the ladies, huh? So the next time you're at that store where you're greeted by an old person in a blue vest, and you need your laundry stuff, cheap clothes, Doritos and Coca-Cola, and a cheap boom box, don't forget to dig into that $5 bin and find this movie! It'll make you prepared for more of his movies, like \"Billy Madison\" and \"Happy Gilmore\" (or should I say \"Happy Madison?\")"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "A Member Of The Society Of Massachusettes",
        "review_rating": "",
        "review_title": "BRILLIANT!!!A MASTERPIECE better then baywatch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "ben_tos",
        "review_rating": "8",
        "review_title": "Funny movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "JeffWheeler",
        "review_rating": "",
        "review_title": "Not 2 Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "kilotilecollege",
        "review_rating": "10",
        "review_title": "This is actually a demo to casting for future movies he would do!",
        "review_detailed_main": "I gotta admit, it was so stupid but so good! When he did that dance walking up the stairs, holy man, I couldn't stop laughing.\n\nThat was his first feature film, gotta give him credit for that though. I heard that this movie is a demo to casting for future films he would star in. I give it a 10 out of 10. He did mention in the movie it's a no budget movie haha.\n\nNeither or less, Adam, in my opinion, did great! I don't care what anyone says, when I see this movie, he's billy Madison all grown up. I always think its like 10 years later haha\n\nHe was great in this one! So happy that I got to watch this!"
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "edarcel",
        "review_rating": "",
        "review_title": "I actually liked it....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "Pokester",
        "review_rating": "",
        "review_title": "Weird, vulgar, stupid, but fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0096870",
        "movie_name": "Going Overboard",
        "movie_rating": "1.8",
        "review_username": "TheNick2",
        "review_rating": "",
        "review_title": "Just not very funny",
        "review_detailed_main": ""
    }
]