[
    {
        "movie_id": "tt0254683",
        "movie_name": "Phool Aur Kaante",
        "movie_rating": "6.0",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Ajay's debut",
        "review_detailed_main": "Ajay Devgan was the dark horse of Bollywood His debut was a low key one and that too pitted against Amitabh's AKAYLA and Anil Kapoor's LAMHE which both flopped and PAK became a hit\n\nThe film has a done to death plot but the direction is good and the film manages to keep you engrossed\n\nThe film starts off as a routine 1990's college romance which many Hindi films those days started with The first half goes on and on, romance, songs.etc Amrish Puri's entrance gives the film an edge and then the film focuses on the eniemity between father and son which ends in a predictable manner yet the film is well handled There is lot of melodrama and clichés but that is forgiven in Hindi films\n\nDirection by Kuku Kohli is good Music is good\n\nAjay Devgan lacked the good looks, he had a dull presence yet his eyes were effective and he does a satisfactory job in his debut he is better in the second half Also his stunt over the bike caught everyone by surprise and is still considered popular Madhoo is average Amrish Puri excels in his role, he has played a don many times but here he gets a well written role and he justifies it to the T Raza Murad annoys Satyen Kapuu is adequate Jagdeep and Aruna provide some laughs"
    },
    {
        "movie_id": "tt0254683",
        "movie_name": "Phool Aur Kaante",
        "movie_rating": "6.0",
        "review_username": "npdeo18",
        "review_rating": "5",
        "review_title": "An average debut for Ajay Devgn",
        "review_detailed_main": "The two horse/car stunt that we saw in Golmaal & Son of Sardaar was inspired from Ajay Devgn's debut film Phool Aur Kaante. He made a mark at the box office right from his first film after it grossed more than its rival Lamhe (directed by veteran late Yash Chopra) which was released on the same day despite the latter being a better film.\n\nThe first half of the film is set as a love story with the second half turning into a family action drama which involves who's who of the city's underworld. In terms of performance it is Amrish Puri who steals the show as a underworld don who tries to mend relationship with his son (i.e. Ajay Devgn) & goes up to any extend in doing it. Ajay Devgn impresses with his action sequences but there was nothing to note about his performance in terms of acting, the trend of acting in such films continued for the actor till mid/late 90s as many of his movies were of similar nature. Madhoo has a mediocre role as Ajay Devgn's lover/wife and has nothing to boast off (later on in 1992,the actress gains critical acclaim by starring in Roja). Raza Murad, Suresh Chatwal & Satyen Kappu enact their respective roles in usual manner as villains & supporting role.\n\nOn the whole it is an average film and a strict one time with Amrish Puri being the highlight of the film."
    },
    {
        "movie_id": "tt0254683",
        "movie_name": "Phool Aur Kaante",
        "movie_rating": "6.0",
        "review_username": "nadkarnisumeet",
        "review_rating": "7",
        "review_title": "Invincible Devgan.",
        "review_detailed_main": "Phool Aur Kaante review :\n\nWhen Ajay Devgan made his big Bollywood debut standing atop two running bikes, the audience went crazy in the theatres cheering and clapping their newfound hero. Phool Aur Kaante was the best debut any actor could dream of - it had soulful music, pulsating action and baap beta emotional angle - everything to steer it to box office success.\n\nNadeem Shravan's songs were chartbusters and ensured repeat audience in theatres. The film enjoyed a golden jubilee run across India and Ajay became an overnight star.\n\nInterestingly, Phool Aur Kaante clashed with Yash Chopra's Lamhe (1991) and actor Anil Kapoor was invited for one of its trial show by Ajay's dad veteran fight master Veeru Devgan. Apparently, Anil didnt like the movie and he exited the show in ten minutes flat advising Veeru not to clash a small movie like Phool Aur Kaante with his Lamhe. Veeru Devgan and team didn't budge and their film released on the same day with Lamhe. While the biggie Lamhe failed miserably, Phool Aur Kaante became an instant hit. The same story repeated next year in 1992 with Ajay Devgan's next release Jigar releasing on Diwali day with Feroz Khan's magnum opus Yalgaar. Jigar became a super hit while Yalgaar remained underwhelming at the ticket counters.\n\nComing to Phool Aur Kaante, my favourite scene is the mens cloakroom fight where Ajay takes on Dan Dhanoa and his goons. Its a brilliantly executed sequence and deserves a dekho even today!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt0254683",
        "movie_name": "Phool Aur Kaante",
        "movie_rating": "6.0",
        "review_username": "vaijayanthi",
        "review_rating": "8",
        "review_title": "Ajay's joyful boyish innocence & high energy exuberance!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0254683",
        "movie_name": "Phool Aur Kaante",
        "movie_rating": "6.0",
        "review_username": "king5238",
        "review_rating": "10",
        "review_title": "Super Hit movie of the time and introduced a star in Indian Movie Industry",
        "review_detailed_main": "Music was super hit. People were eager to see this movie and movie was super hit during that time. People were impressed with Ajay's stunts. Ajay, Madhu and Amrish Puri acting was very good."
    }
]