[
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "OttoVonB",
        "review_rating": "1",
        "review_title": "Your eyes and ears will BLEED!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "eoinsmith001",
        "review_rating": "1",
        "review_title": "If nothing else, then at least you'll learn that nothing else could ever be this bad...",
        "review_detailed_main": "I watched Manos last night.\n\nOh, I was the cocky one, intrigued by all the attention Manos receives, even though it is, after all, 40 years old. Sure, I thought, it'll be a laugh to investigate the claim that this might be the worst film ever made. Why, if its that bad, there must at least be comedy value in its awfulness? And in consolation, it is only an hour long.\n\nNo, the warnings are true and serious, this is bloody terrible.\n\nAfter twenty minutes, I had stopped sniggering at the unimaginable ineptitude. I only realised that twenty minutes had passed when i flicked on the timer on the DVD; I honestly thought it was closer to forty-five.\n\nAfter forty minutes I was shifting uncomfortably in my chair and I wanted to cry.\n\nAfter an hour, I was submerged in despairing, pointless anger. I was angry with everyone involved in the film, angry with my cup of tea, my flat, the world, even God Himself (or Herself).\n\nYou will lose faith in humanity watching this film.\n\nImagine any conceivable measure for any possible aspect of film-making, and Manos still gets zero out of whatever. This \"film\" fails so utterly in every way, you'll wonder if anyone involved in its creation had ever seen or even heard of films or television. No, more than that, you'll wonder if they'd ever even spent a day on this planet. There isn't one single moment that you forget that these people are standing in front of a camera, ineptly executing one of the most awful scripts ever imagined.\n\nI've never been so insulted by any form of \"entertainment\". I lost count of the number of times I was beaten over the head with a totally obvious point. I lost count of the number of times completely random stuff just *happened* with no genesis or consequence. I certainly didn't lose count of the number of locations used, or the number of musical cues, you could count those on one hand, after a circular saw accident. It baffled me that they never realised that you can't shoot film at night without some form of lighting. And the music itself... oh God.\n\nI don't need to warn you about spoilers, there's plenty to complain about without resorting to inconsequential detail. Like the way that every time it cuts to the family, they're just standing, for no reason, in the same spot, waiting to talk to the camera. Like the absolutely shocking and disgraceful editing. People jump from awake to asleep and back, from one spot to another, from happy to sad, instantaneously. The awful acting... I don't know, its like everyone was given a piece of paper with some emoticons for happy, sad, scared and angry, and told to learn them off. The dialogue... well, technically it *is* dialogue, in the same way that McDonalds is food. Well, some people might enjoy McDonalds. See, I can't think of a parallel awfulness; \"Manos\" is to \"bad\" as... you can't finish that sentence.\n\nGood Lord, I could go on, and on, and on, but I won't. This film cannot warrant anything but a 1/10 on IMDb. I haven't seen any of the other bottom 100 as of today, but i'm willing to bet that they are at least a rough approximation to what we call a \"film\". This is not.\n\nSeriously, you really, really need to be in a masochistic kinda mood to see this out. I had to leave the screen timer on after 45 minutes just so I could keep reminding myself that, second by second, it *would* end. Because Hell itself might just be never-ending Manos."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "mst-2",
        "review_rating": "1",
        "review_title": "Amazingly Awful!",
        "review_detailed_main": "The leading man is a Frank Zappa lookalike with only a fraction of the talent Zappa (being dead) has.\n\nHowever, the real star of the film, Torgo (a goat-man), performed in some of the best walking-from-one-end-of-the-set-to-another scenes I have seen since 1950s Corman films.\n\nFinally, the fights (or are they orgies?) between Manos' wives, which we are asked to believe to be deadly, are utterly hilarious.\n\nThe MST3K version of this incredibly dreadful bit of late 60s trashola is one of Joel and the Bots' best, but even their antics fail to make this movie wholly tolerable.\n\nRated: For Insomniacs Only."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "divaclv",
        "review_rating": "",
        "review_title": "Look no further--this is the worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "mstomaso",
        "review_rating": "2",
        "review_title": "A $300 refrigerator , and I am still waiting for the sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Mike Sh.",
        "review_rating": "1",
        "review_title": "AAAAHHHH!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "myavalon",
        "review_rating": "1",
        "review_title": "Oh, the Humanity",
        "review_detailed_main": "I should note here that I sort of like bad movies. If it's amusing and campy, I'll cut it a break.\n\nBut Manos is different.\n\nMy god. What can I say about a movie so bad that it makes Plan 9 From Outer Space look like Casablanca? What can I say about a movie that has endless looped scenes of driving, the worst evil henchman in movie history, the lamest dialouge this side of my first grade hebrew school play, a movie that seems to have put together by people with utter contempt for the audience's intelligence? All I can say is this: it seems The Master's prayers to Satan have been answered. This movie is pure hell."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "XIOMANGER",
        "review_rating": "1",
        "review_title": "Keep Manos at #1 (of the bottom heap, of course)!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "PlutonicLove",
        "review_rating": "1",
        "review_title": "One of the finest examples of great auteur filmmaking",
        "review_detailed_main": "Equaled in clarity of vision and flawless execution only by the greater works of Orson Welles and Alfred Hitchcock, brilliant independent film auteur Hal Warren's \u0091Manos: The Hands of Fate' transcends its genre to do everything that it should and even more. Not only is it riveting edge of your seat entertainment, it also boasts a psychological depth unequaled by any other horror movie, achieved mostly through John Reynold's Oscar-worthy, divinely subtle performance as the tormented, tragically misshapen caretaker Torgo. Part Quasimodo, part Hamlet, this gentle soul's noble end, in which he is massaged to death by a group of terrifying succubae in luscious robes, is unarguable one of the most poignant in motion picture history \u0096 it is both a tragedy and a triumph of the human spirit. Oh, was I alone with a tear in the eye at the end!\n\nIndeed, Hal Warren's masterpiece achieves the perfect balance between the heartrendingly sad, the refreshingly sardonic, and the chillingly satanic. The Master and his hellbeast are as much evil personified as Margaret is the embodiment of goodness and chastity. In a way, this is the definitive modern-day equivalent of Goethe's Faust, though even more sublime in the simple poetry of its dialogue. When Torgo describes his master as being `not dead the way you know it' and `with us always' he is speaking for all of us, how we truly live on through the memory of our words and deeds in the minds of those who follow us, be they righteous or malevolent.\n\nHal Warran not only changed the face of the Texan film industry by encapsulating such a grand story in less than 75 minutes, it also helped usher in a whole new perspective of looking at film, discovering different forms which never would have been conceived. Also, it's obviously a very personal film for Warren, who allows us to share his love and devotion to the project, and it is a truly moving, cathartic experience.\n\nIt will make you laugh, it will make you cry, and maybe \u0096 just maybe \u0096 you'll learn a little bit about yourself."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "lemon_magic",
        "review_rating": "2",
        "review_title": "Believe it or not, this *was* made by actual human beings",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "FlaviusAetius",
        "review_rating": "1",
        "review_title": "The antithesis to good movies.",
        "review_detailed_main": "This isn't a movie. This isn't even a home video. It's a home video that aspired to be a movie but crashed somewhere in-between, and plummeted through the abyss to depths unimaginable by the mainstream. Coherence is the film's greatest foe: bizarrity and incompetence its watchwords. This is it, bad movie buffs. This is Manos: Hands of Fate.\n\nYears ago, in the dusty desert outside El Paso, an unknown fertilizer salesman decided to craft a horror film with the assistance of friends throughout the El Paso area, and a legend was born. Armed with $19,000 dollars, a cheap 16mm camera, and absolutely no knowledge of the art of film-making whatsoever, Hal P. Warren set out upon his masterpiece.\n\nThere is absolutely no redeeming quality about Manos. There is no directing, the editing appears as if it was done by a blind member of some mud-crawling insect species, the artwork is a stain upon the name of art, the script is a poorly cluttered and illogical joke masking the director's fantasies, the dialog will have you tear out your eardrums with your fingernails, and the acting is so atrocious you will feel as if the movie has violated you. It isn't as bad as Monster-a-Go-Go, but it almost manages to snatch the sorry laurels of worst movie ever made from that Lovecraftian abomination.\n\nManos must have put good directors like Kubrick or Capra in convulsions during its production: so powerful is the elemental force of badness flowing from every stinking pore of its perverse form. It is the polar opposite to the good movie, the parameters of its illogicity and non-acting existing to defy the borders of taste, and ultimately, sanity. Every grainy, scratchy, blurry frame of the muddy color palette and every sound byte of the poorly synchronized and terribly dubbed dialog offers an entrancing glance into a deeper, darker world of madness that is Manos the Hands of Fate. It is not of this earth. It is not of our dimension. Surely Hal P. Warren was some malfeasant alien god from a realm far removed from our own, hurtling across the icy chasms of space with a vile mission in store for the unsuspecting members of the cinematic world.\n\nIts legacy, however, lives on in the form of Mystery Science Theater. The acid-tipped barbs flew fast and furiously, striking the venerable beast in its countless weak points, crafting from the chaos a comedic gem that approaches cinematic perfection stamped into the world of movies in its own stinking ichor. This is Manos: Hands of Fate. This is the purifying baptism of fire that scourges the detestable vestiges of mediocrity and normalcy from the mainstream viewer and forever makes them a member of the cult world, the world of bad movies and weirdness that cannot be imagined. It is the cornerstone, the figurehead, the mighty totem representing everything that Mystery Science Theater and the legions of bad movie sites across the Web hold dear to their hearts.\n\nRejoice, connoisseurs of bad movies! Fall upon the dark altar of Manos to pay homage to Torgo and the Master, and forever remember the twisted legacy they wrought from the tangled celluoid! Imitate Torgo's stumbling walk and high-brained drawl, until it fuses with the very core of your being!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "isawmanosthehandsoffate",
        "review_rating": "10",
        "review_title": "Manos: The Hands of Fate..... Perhaps too misunderstood my many",
        "review_detailed_main": "...... I was age 16 back in 1966 attending Andress High School in El Paso, Texas and heard about the WORLD PREMIERE of the movie \"Manos: The Hands of Fate\" .... there were write-ups about it in the two major papers and coverage on the local TV stations. I did not attend the WORLD PREMIERE, but I checked the newspaper listings and went on a Saturday afternoon.... I thought it was going to be a scary movie, and after about ten minutes or so I started to giggle a little. I noticed others at the downtown El Paso theater were laughing a little too. Well, I can't recall what the exact scene was, but suddenly it was so funny I had tears rolling down my face! The movie was worth the ticket price (probably a Dollar) but I thought I was going to see a scary movie and it turned out to be a comedy. Long before the media called it the worst movie, I knew it was the worst for me even before the movie was over! People were laughing and smiling as they left the movie; and, I and they did not know that years later it would be famous -- but not in a way the cast and crew would have ever envisioned. Perhaps the movie was too misunderstood my many. God Bless all of those -- living and dead -- who were involved with the movie \"Manos: The Hands of Fate\" back in 1966....."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "anthonylawrence-11254",
        "review_rating": "6",
        "review_title": "The best bad movie of all time",
        "review_detailed_main": "I don't want to spoil this fantastic movie's amazing... I don't even know what to call it. It's certainly not a plot. There's memorable characters such as making out couple, dead dog, demon child and the most beloved Torgo. There is a wife brawl consisting of 6 wives that goes on for way longer than you'd expect.\n\nThere's constant Ed, Edd and Eddy music, the best being Torgo's themes. Torgo's them is almost 1 full measure of doots played on loop. I'm not joking there's no better way to describe the looped measure of music played 3 different times. It's not beeps or honks, it's doots.\n\nI highly encourage anyone who doesn't mind 10 minutes of total nonsense as an intro to watch this epic."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "michapringle",
        "review_rating": "1",
        "review_title": "Not as bad as I hoped...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "harricklomax",
        "review_rating": "",
        "review_title": "\"Mike I'm scared.\" \"Of WHAT?\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Total ineptitude in every way possible",
        "review_detailed_main": "If it wasn't for MST3K, I wouldn't have seen Manos: The Hands of Fate. I knew I had to see it to see if it really was that bad. The negative criticisms and those slamming it as the worst movie ever do not lie, Manos: The Hands of Fate is as bad as all that. There is such thing as a terrible movie that has novelty comic value, but there is also such thing as a movie that is too inept to take that into consideration. Some will disagree, but I consider Manos: The Hands of Fate as a good example of the latter. To call the way the movie is made amateurish is being too kind, the camera work and editing are all over the place and makes anything that happens incomprehensible. The visual effects are dated and make everything even more artificial than it already is, while the bizarre and often out of sync sound effects and a score that is shrill and monotonous are enough to make your ears bleed. And even when your poor ears are suffering enough, they are assaulted even more by dialogue that is stilted, insultingly cheesy and too talky and some of the worst and annoying acting ever in film history. The villain is quite possibly the most laughable and underwhelming villain ever and you'd be hard pressed to find one that is worse-acted than here. Torga is the best thing about Manos: The Hands of Fate, but that's saying nothing as he's still irritating. The direction is so flat that you have to look hard to find evidence of any direction at all, while the story is incredibly thin and is so plodding that you're dying of boredom. In conclusion, hopelessly inept. 0/10 Bethany Cox"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "BA_Harrison",
        "review_rating": "1",
        "review_title": "I Survived Manos: The Hands of Fate.",
        "review_detailed_main": "Manos: The Hands of Fate, currently ranked #5 on IMDb's Bottom 100, is a rite of passage for serious fans of trashy horror movies, marking the transition from 'merely bad' to 'completely and utterly inept in every way imaginable. It's a test of fortitude that sees many fall by the wayside; however, those who do manage to go the distance can wear their achievement as a badge of pride, knowing that they have taken the very worst that z-grade horror can throw at them and survived the ordeal (albeit with possible mental scarring).\n\nThe one-and-only film from Harold P. Warren, who obviously realised thereafter that film directing wasn't his forté, Manos opens with a family driving through the desert on their way to Valley Lodge for a vacation. Unfortunately, father Michael (Harold P. Warren, proving that acting wasn't his forté either), his wife Margaret (Diane Adelson), and daughter Debbie (Jackey Neyman) soon find themselves lost, eventually pulling up to a strange desert hostel where they are greeted by twitchy manservant Torgo (John Reynolds), who looks like he stores bags of popcorn or cotton wool down his trousers.\n\nTorgo warns that his master (Tom Neyman) won't be happy if they stay the night, but they won't take no for an answer; their stubborn insistence puts them in serious peril, for the master is the head of a Satanic cult and he wants to add Margaret to his collection of brides.\n\nTo list everything that is wrong with this film would take longer than it took me to watch it (including the times where I fell asleep and had to rewind), suffice to say that there are fewer examples of poor editing, dreary pacing, atrocious direction, woeful acting, and diabolical dubbing. Quite how Warren and company managed to mess up in all departments is one of the great mysteries of cinema, ranking right up there with the inexplicable popularity of Seth Rogen, but it has ensured the film a notoriety that means it will never be forgotten."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "aesgaard41",
        "review_rating": "1",
        "review_title": "Bad Movie Makes Good MST3K",
        "review_detailed_main": "This movie should serve as warning to anyone who tries to make up a movie as you go along. An overused concept (family gets lost) meets a cliche (wierd guy who talks of a master)and then degrades into one big mess. The couple's little girl vanishes during filming or seems to be and a wierdo shows off his girl collection; they may or not be vampires or zombies, you never know. The story is missing, the flow is ambigous and it moves like words in an alphabet soup. Nonsense and confusion are the result. Thank you, but no thank you, Doctor Forrester."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Spurfan15171921",
        "review_rating": "1",
        "review_title": "Hands down the worst movie ever",
        "review_detailed_main": "\"I take care of the place while the master is away\" That line will forever burned in my mind as the worst line in cinema history. I'll just go over this step by step.\n\n1- Story Manos: The Hands of Fate is the worst story ever. Its absolutely ridiculous, yet somehow it is probably one of the better parts of the movie.\n\n2-Directing The directing is probably the worst part of the movie, I don't know how any person could put so much filler and actionless situations in a movie.\n\n3-Editing Wow. That is the only word to describe the editing or lack thereof. People will be standing one moment, and sitting the next. They didn't even bother making clips look similar, the movie is not smooth at all. I couldn't tell if the actors were purposely repeating this over and over, or if the editing was just so bad they forgot to take out the second line.\n\n4-Acting The acting is one of a kind. In this case, that is not a good thing. The acting is extremely forced, especially in the case of Torgo. All of the actors are incredibly phony. Torgo's repetition of his lines, the delayed reactions, and Torgo's drunk motions are simply awful. I swear at times I thought the actors were mentally retarded.\n\nWhen you put all of these together, and add a master with a weird cape and a black dog, you get the worst movie of all time. Its so bad you really must see it to appreciate it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "ninja_superstar-1",
        "review_rating": "1",
        "review_title": "Hell is \"Manos: The Hands of Fate\" on an eternal loop",
        "review_detailed_main": "Directing: The direction in this \"film\" reminds me of one of those people who simply cannot, for the life of them, hang a picture straight on a wall. The problem is not that the person is too close to the picture, and therefore cannot see the mistakes he's making. The problem is also not an inability to make necessary adjustments after stepping back to look at one's work. The problem with this film's direction is much deeper. Do not be fooled into thinking that this film was bad \"on purpose,\" because if there is a God, this cannot be true. In the history of the world, no manure salesman has decided to make a crappy (pun intended) movie for the purpose of defining \"the crappiest movie.\" No. The problem here is about the complete and utter failure of humanity. The word \"never\" had not yet been defined until this movie was \"made.\" In the end, there's no reason to consider that this movie had a director.\n\nEditing: When you were a child, you probably tried to shove two mismatched puzzle pieces together -- I admit, I've even tried this -- but you and I eventually learned that this is wrong. The editor of this film did not learn this valuable life lesson. The credits at the end of the film are the centerpieces of the editing. I only now understand that, quite possibly, editing did not occur in the production of this film.\n\nWriting: This movie despises its writer, hates him in fact. In truth, there is no reason to think that this movie was actually written. I babysat an autistic child once. Even HE couldn't have written this tripe.\n\nActing: I understand that some people don't really get what it means to be in front of a camera. This is not the problem here. Although they have human faces and voices (all dubbed, of course), these \"actors\" are unable to even imagine themselves as being in a film. The uniqueness of their ineptitude is overwhelming at times.\n\nThis is a horror flick. The actual film isn't the horror; the horror isn't even filmed in fact. The true horror is this movie's sweeping destruction of the elements of film -- direction, editing, writing, acting, etc. Even the title, which translates to \"Hands: The Hands of Fate,\" would baffle the Sphinx. I know that Duran Duran named themselves twice, but this title is something else entirely. It is a sucker punch to everything linguistic and meaningful.\n\nWhy this movie took 2 and a half months to film is beyond me. This movie is 74 minutes long. There is no reason to believe that this movie took more than 74 minutes to film. After all, without a director, editor, writer, or actors, it's truly difficult for me to say that this is a film. There are those who want to find genius in such a deconstructive expression. Make no mistake, this movie is not smart, is not clever. The deepest meaning one can glean from manure is to never again step in it. If you value anything even remotely artful, you will keep yourself oblivious to this \"movie.\" This movie will scar you and shape the rest of your life, I guarantee it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "technexx",
        "review_rating": "1",
        "review_title": "Oh, man...",
        "review_detailed_main": "It's just...breathtaking, almost. See it just to know that there are movies of this caliber in existence! Please, though, watch the via MST3K, as the commentary will keep your mood uplifted enough to get through it and laugh. Torgo is absolutely, fantastically bad as lackey to \"The Master,\" and the latter's wives seem like they're cold reading from the script. The um, \"quarrel\" scenes between the wives redefines choreography as a practice, and the transitions between scenes...er, doesn't really exist. The movie, though scarcely 70 minutes long, seems willing to devote 15 of those to POV countryside watching, random make-out scenes, and cops who harass the love birds without any seeming relevance to the plot.\n\nI will always remember Torgo, though. I think he steals the show, if only because he's the only thing that may end up embedded in your mind when all is done."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "gaylord_small",
        "review_rating": "1",
        "review_title": "Manos is Manless",
        "review_detailed_main": "The sad story of a philandering master and his spurned male companion...\n\nTall, dark and handsome Manos is the satanic version of Hugh Hefner complete with the ever-present robe and scantily-clad harem of interchangeable women of low morals... he flaunts his cheap, gullible trophy wives in the face of his lovable sidekick.\n\nHe is a cruel and unfit master; abusive! Belittling!\n\nWhy does Manos continue to court susceptible ingenues when he has a perfectly good ManSlave at home?\n\nOne cannot help but feel sympathy and a freakish attraction to the exotic yet subtle Torgo. The big knees, the stuttering voice, the floppy hat, and the utter eroticism of his manservant status...\n\nWhen I found out he was actually supposed to be a SATYR (insert squeal of delight here!), I wept at the yummy thought of brushing his furry goat-like legs, polishing his hooves, trimming his beard, even flea-dipping him if necessary...\n\nBut instead, our godly goat is led like a lamb to the slaughter :(\n\nCurse you Manos Hnds of Fate for robbing me of this fantasy!\n\nWHY, MANOS? WHY?"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Bloodwank",
        "review_rating": "8",
        "review_title": "Underrated little oddball gem",
        "review_detailed_main": "I've long been fond of horror delving into America's weird interior. The spectacle of city-folk burrowing unknowing into uncharted realms where all their order, their civility means nought, where even sanity has made little purchase, these journeys fascinate me. So it is the case with Manos, a notorious film and one of the stranger examples of its genre. It tells of a happy family, Michael, Margaret and daughter Debbie on their way to a countryside lodge, one which may not even exist. They lose their way and end up at a mysterious domicile run by the anxious, strange walking, staff bearing Torgo, and as their tale unfolds they come to know the nature of the place and regret ever stopping there. Manos wields a strange power, and I think it comes from the way in which the fearful foundations of the plotting find their oddity echoed in the construction of the piece. The film dwells on primal fears of the unknown, of dislocation from ones usual milieu and ultimately of the break from ones one control. Whilst other films might array a number of editing tricks and a spot of meaningful dialogue to convey such fearful atmosphere Manos relies on guileless amateurism and succeeds precisely because of its lack of control. The audience knows anything can happen, that the film lacks reason and control, so the perfect conditions are established for the films effect. Which is not to say that there aren't some legitimate qualities at work here. The score mixes simple but menacing riffs with good looser moments, piano that sometimes ripples and sometimes spikes and some tensely thudding percussion, it has quite a potent presence. There are interesting images too, Torgo approaching with his staff penetrating the frame from bottom left, Torgo holding his master at bay, his staff playing back and forth in front of the Master's face, wives bound to pillars like living statues and so on. Best of all comes when the wives arise, their depiction has a playful art to it, they are something like an insane Greek chorus. Performances are decent too, Hal Warren has a perfect stolid and dull presence as Michael, Diane Mahree appropriately perturbed as Margaret, while Tom Neyman is wondrously campy yet menacing as The Master. Best of all though is John Reynolds as Torgo, his pained and fretful weirdness exerts a powerfully strange hold. Production design is simple yet weird, and the dark cinematography works well in creating a bleak, unsettled atmosphere. I guess this one has put a lot of people off since it currently holds the no. 2 spot in IMDb's bottom 100 but to me it was a real treat. It might best be called anti-art since it was made by a fertiliser salesman for a bet, but whatever its genesis I think its something of an off the wall gem with only a few moments of blatant ineptitude (like a visible clapper-board) to spoil the fun. Not for everyone, but a happy 8/10 from me."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "aku_rouhiainen",
        "review_rating": "7",
        "review_title": "Manos, The Hands of the Fate",
        "review_detailed_main": "First I saw this movie, I thought this would be the worst movie has ever been made. Reason I gave 7* on this was : Low budject movie, Good actors, Horrible (but good) background music. I really enjoyed watching this movie, sadly Harold P. Warren killed himself after the movie had been done. Tom Neyman acted very well on this movie, even he looked bit strange.\n\nSeriously, watch this movie closely and try feel the magic of it! I'm wondering how so good movie can be on bottom list #26 (11.1.2009).\n\nPlease, don't understand me wrong. Watch the movie again and try feel it!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "ptreasure1181",
        "review_rating": "1",
        "review_title": "Are you masochistic? This movie is for you!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Alienator",
        "review_rating": "",
        "review_title": "'Manos': An Enigma of Celluloid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "super_lopez",
        "review_rating": "1",
        "review_title": "Manos: a work of staggering genius",
        "review_detailed_main": "Hal like any other great artist is misunderstood by feeble-minded contemporaries. My prediction is that in 50 or so years when celluloid has gone the way of the dodo, Manos will be recognized for the bold (and reckless) artistic triumph that it was. Hal, a true visionary (some say he hallucinated from fertilizer fumes), has set a trend for modern cinema. The shocking orgiastic violence and the horrifying screen presence of Torgo, the master's minion, have yet to be topped by today's unassuming and bland filmmakers.\n\nI have watched Manos several times and each time I see another facet of sparkling genius in this diamond of a movie. I cannot recommend it enough. To anyone with a modicum of self respect, by all means watch Manos and prepare for the ride of your life.\n\nYou might wonder why I only gave it one star. I have been observing the Manos forum for some time now with no small amount of disgust. Manos is #1 on the worst films of all time for IMDb. I, super lopez, am not one to displace Manos from this worthy if ignoble position. Manos deserves to be number one in at least one area."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "dinobrya",
        "review_rating": "1",
        "review_title": "More deserving of a Zero rating if they had one available",
        "review_detailed_main": "There are not words that can describe how bad that movie was. Luckily we watched the MST 3000 version. I honestly do not know if I could survived it otherwise. That was without question the movie I have ever seen. The plot was horrendously constructed. Without the possible exception of the family, the writer poorly conceived his characters. I think many people gave it a 10 for its vintage quality. For some including myself, bad movies (particularly during the sixties and seventies)have more aesthetic quality than many good movies. Make no bones about it, however, anything more than a 1 is too much and is quite deceiving. Having said that, Please watch it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Angeneer",
        "review_rating": "1",
        "review_title": "Has secured its place in cinematic history",
        "review_detailed_main": "It is of no small magnitude to have your work distinguished in a sea of hundreds of thousands of movies.\n\nHal Warren made what others can only dream of. He made a movie that will be mentioned and even quoted for years and years by cinema fans, a movie that has earned a place in history books. His achievement cannot be understated.\n\nLet me offer my explanation on why so many people love Manos: By watching this film you become part of a psychological experiment in hypnosis.\n\nThe countless landscape scenes serve as the passage to the hypnotic state one needs to be to appreciate this movie. It is only after entering this trance you will feel strangely attracted by the incoherence of the plot, the vapidness of the acting, the emptiness of the dialog, the amateurishness of the visual effects and the shallowness of the characters.\n\nAnd then, the large question mark after the end credits is the snap of the finger.\n\nYou wake up, and only then you realize that what you have experienced brilliantly merges into creating, quite simply, the worst movie ever made."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "ColtSeavers",
        "review_rating": "1",
        "review_title": "Impossible",
        "review_detailed_main": "Reading all the fantastic comments about this abysmal movie gave me some of the biggest laughs I have had in my LIFE. Thank you all for being such great soulmates when it comes to terrible cinema.\n\nAfter reading those comments, I had to watch \"Manos\" myself. And so I did. Two days ago. I was determined to be strong, to prevail, to sit through the whole thing whatever was to come. But, alas, \"Manos\" was stronger than I.\n\nI have endured a thing or two in my life: Plan 9 from outer space. Hercules against the moon men. Godzilla versus Megalon. German musical comedies from the early sixties. However, THIS was too much for me. About one hour or so into the movie, I quit.\n\nI went to bed with an empty gaze, shaking my head in disbelief for about 15 minutes. Every now and then, I could hear myself chuckle like an idiot."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "em0babe",
        "review_rating": "1",
        "review_title": "What kind of movie is this!?!??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "jamesrupert2014",
        "review_rating": "1",
        "review_title": "I was warned but I watched anyway",
        "review_detailed_main": "Lost in the desert, a couple, their young daughter and doomed poodle Peppy take shelter in a mysterious house that is watched over by Torgo (John Reynolds), a deformed (and possibly satyric) handyman who ominously (and frequently) refers to the \"Master\". Soon the malignant master (Tom Neyman), with his evil hell-hound, manifests, intending to add the terrified family to his cult of murderous followers (or something to that effect). The femto-budgeted, near-amateur production dominates the top of the bottom of the charts of 'bad movies' as it massages incompetent direction, inept filming and editing, an incoherent plot, insipid acting, soporific pacing, and cretinous script into a preposterous film known only for its awfulness. Lacking the goofy charm of typical 'bad movies', 'Manos' is watchable only as a curiosity or a 'how-not-to' instructional video for aspiring film-makers and, like most of its bottom-of-the-barrel ilk, a lot has been written about the film's provenance, myriad continuity errors, and production flaws. The movie's only redeeming factors are The Master's striking red and black hand-themed cape, shambling minion Torgo's intriguing walking stick, and the ultimate dark fate of the innocent family (in other circumstances, the final scene could have been genuinely creepy)."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "dancingtubas",
        "review_rating": "1",
        "review_title": "I survived it, but you shouldn't have to.",
        "review_detailed_main": "I have actually watched this entire film, without the Mystery Science Theater riffing to ease the pain. If you can help it, don't do what I did. It was very, very difficult to sit through, and it used up pretty much all the resolve I had. I'm not an expert, and I have not seen every movie there is to see, so I can't definitively tell you that this is the worst movie of all time, but it is, without question, the worst movie I've ever seen.\n\nThere is something to be said for movies that are \"so bad they're good\". But this film goes beyond the realm of \"so bad it's good\" straight into confusion, dullness, and straight-up unpleasantness. It's so bad, it's just painful. I know probably every other person who's written a review of this has said this almost word for word, but it's so true, it's impossible not to say it.\n\n\"Plan 9 From Outer Space\", often considered the worst movie of all time, is a magnum opus by comparison. Yes, \"Plan 9\" is nonsensical, unintentionally funny, and not a good movie by any stretch of the imagination, but at least it counts as a film. It is a heartfelt, genuine attempt at filmmaking, and it was evident that Ed Wood really believed in it and gave it his effort. I would even go so far as to say it's entertaining. Much of it is, anyway.\n\nI really don't know that \"Manos\" qualifies as a film. There is something passing for a story in it, but it is so poorly told, acted, and directed that I really don't know that it counts. And even if you could follow the plot, you wouldn't really want to. It's certainly not entertainment. What story there is is buried in the complete lack of pacing. The long driving sequence at the beginning is painfully boring to sit through, and it never really gets more interesting than that. May as well just go for a drive yourself. You'll have a lot more fun.\n\nIt was made on a budget of about $19,000. And it shows. Even if you know nothing about how movies are made, you can't help but see how unfinished and unedited \"Manos\" is. The clapboard is blatantly left in one of the shots. There's a young teen couple who make out in their car, and they appear a few times, yet are completely unnecessary to the plot. There's no reason for them to be there. The jazz soundtrack, while I don't entirely hate it, is completely unfitting and just adds further to the unpleasantness. Just awful.\n\nThe one thing about the movie that held my interest at all was the character of Torgo. Even though he really has no back story (there's no such thing as back story in a movie this awful), he does have a bizarre presence that is somewhat compelling to watch, and he even has his own musical theme, as MST3K pointed out.\n\nDon't get me wrong, he's not a pleasant character. His dialogue is just as stilted and awkward as anything else in the movie. But honestly, with what he obviously had to work with, he really wasn't that bad, I guess. Maybe it's just that the rest of the film was so incompetent that he looks really good by comparison, but he was the best thing about \"Manos\" by far. At least he left an impression. John Reynolds, the actor who played Torgo, shot himself a month before the film premiered. Apparently his suicide was not related to the film, but I can't help but feel sorry for the guy. This was his only film role, the only legacy he got to leave behind. This is totally hypothetical, and maybe not even true, but he just might have gone on to something decent, if he'd survived. Even if he only did b-movies, anything would have been better than this.\n\nThe only reason I might recommend watching this movie is if you want to know just how bad a movie could be. Before I saw this, I really had no idea movies could be this bad. But if you absolutely must see this film, please, do yourself a favor and watch Mystery Science Theater's riff of it. Even they have a hard time making it funny, but it helps a little, because this film is just...well, I've said it all. I've also heard the guys from MST3K (who now do RiffTrax) are doing a completely different riff of this movie that might be worth checking out. But please, don't watch it without their comedic assistance."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "brad-wells-1",
        "review_rating": "10",
        "review_title": "Excellect movie, if taken in context",
        "review_detailed_main": "This movie should be included in film school textbooks under \"how to make a bad movie\". I own 2 copies of this classic (the MST3k DVD, and the normal movie) and enjoy both of them. It's not exactly gone with the wind, but the \"sucks so bad it's good\" factor of this film will give Ed Wood's best a run for it's money. Wild cuts, horrible voice overs, bad acting, and a 6 minute intro that's nothing but someone driving with background music are just a few of the wonderful moments you have to look forward to. Bottom line if you don't want to watch a bad movie , then stay away from this film. If however, you're morbidly curious enough to seek to answer the question \"Just how bad can a movie be\" then give it a try."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "michael_the_nermal",
        "review_rating": "7",
        "review_title": "Classic Comedy",
        "review_detailed_main": "One does not need to watch the \"Mystery Science Theater 3000\" version of this movie to appreciate its colossal ineptitude and unintentional comedic moments...but it helps. The film in and of itself is a comical treasure trove for those who love \"so-bad-its-good\" Z-grade movies. First of all, this film has no budget, shot as it was on a cheap film camera WITH NO SOUND! The editing was choppy, and there were some pretty funny snafus along the way (notice the constantly fluttering moths, which even MST 3000 did not make fun of). Best of all were the excellent villains: The Master and his manservant, Torgo (a really cool monster name, by the way!). I loved The Master's strange gesticulations and his long, droopy \"fingered\" cape. Torgo is the man! How can you not laugh at his clumsy groping and hilarious lechery, not to mention his gigantic, goofy prosthetic thighs? Let us not also forget the long, gratuitous \"girl fight\" scene between The Master's wives, all in their see-through nightgowns. This film has \"camp\" written all over it. Watch it! You'll find it funny with or without the MST 3000 commentary."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Fella_shibby",
        "review_rating": "2",
        "review_title": "Count the number of slaps the wife gets by the pagan Master....",
        "review_detailed_main": "Come on, one star is a bit harsh. At least 2 stars for being an unintentional comedy n the effort by a fertilizer salesman.\n\nThe story is about a family who lose their way on a road trip and after a long drive in the desert, they arrive at a lodge maintained by a pagan cult. The film is bad but it was a brave attempt considering the budget. Viewers may find it illogical, boring with awful editing n acting but may be amused seeing Torgo's abnormal gait, the Master's ceremonial robe, the awful soundtrack, the wife telling the husband that it's getting dark while we observe that its bright midday, the Master repeatedly slapping the wife, the wives jus rubbing their hands on Torgo's face, etc.\n\nI first saw this in the late 90s on a vhs. Revisited it recently."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "markagudsnuk",
        "review_rating": "",
        "review_title": "Manos as experimental film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Phoenix_279700",
        "review_rating": "1",
        "review_title": "This CLASSIC el-smello film is a must-see for bad film fans!",
        "review_detailed_main": "Boy oh boy, you bad film fans really struck gold this time. Does this wonderfully entertaining movie STINK, or what???\n\nYe lovers of famous el-smello cult flicks, thou wilt enter horse-manure heaven this very evening! Fans can get more belly laughs from this ridiculous film, which stars the magnificently frightening Torgo (most sensational movie monster since Hamlet), and features luscious, red-hot female nightgown wrestlers, than from almost any IMDb mainstream comedy.\n\nGross insults aside, the Gourmet wrote this review to make a specific point. Many of IMDb's wonderfully entertaining Manos writers say, \"Even Joel and the Bots couldn't save this\". We respect their opinion on that, but in the special case of Manos, it doesn't really matter. If you have a taste for BAD movies, if you like to sample IMDb's bottom 100 list, if you enjoy watching MST3K and other hosted bad-film shows, then you MUST see this episode. Love it or hate it, MST3K's Manos is a landmark in entertainment, one of the bad-film shows by which all others are measured.\n\nHowever, for goodness sakes do NOT watch Manos without Joel and the Bots - even the Kaa-Kaa Gourmet would end up screaming in the loony-bin !"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "chazzarb",
        "review_rating": "3",
        "review_title": "One of the greatest bad films",
        "review_detailed_main": "Amazingly inept in ever category of film making and composition. Awful acting, nonsensical plot, diabolical dialogue and dubbing combine to make a spectacularly incompetent film. This film is so bad it really needs to be seen to be believed and that is why it is great. For those that enjoy laughing at bad films 'Manos the Hands of Fate' is a masterclass in dreadful cinema. As a result of this, the film is either a 1/10 or a 10/10 depending on whether you enjoy bad films."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "servo-10",
        "review_rating": "1",
        "review_title": "This is truly a painful movie to watch",
        "review_detailed_main": "The only 2 redeeming qualities: 1- Torgo 2- this movie will cure insomnia\n\nOther than that, nothining but pain can ever come from watching this movie. And how come no one in the cast ever mentions Torgo's knees in the movie? Not even behind torgo's back! That little girl should have been staring and pointing at those knees until either given an answer or told to ignore it, which of course is impossible, they're HUGE!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Red-Barracuda",
        "review_rating": "4",
        "review_title": "There really isn't another film like Manos",
        "review_detailed_main": "For many people Manos: The Hands of Fate is the worst cinematic atrocity to ever have been unleashed upon the world. For the average film-goer this is entirely understandable. Manos uniquely fails badly in almost all cinematic criteria. It's badly paced, terribly photographed, edited abysmally, acted appallingly, it has extremely limited sets, bizarrely inappropriate music and it doesn't make an awful lot of sense. It's basically a textbook example of a bad movie. And yet, it has a certain something. Despite, or perhaps because of, all the faults listed Manos remains a very strange film. Its very oddness is what makes it fascinating to watch in my opinion. The Master, and especially Torgo, are interesting characters. The latter is played by John Reynolds in a very strange performance where he constantly jitters in a most unusual way. Torgo is supposedly a satyr, except that you would be forgiven for not realizing this seeing as his goat legs are never actually shown. Only in a film as strange as Manos would this happen. Also only in a film like Manos would all actors be dubbed by only three people – two men and a woman – and this leads to some very inappropriate voices, such as the one given to the little girl. It only adds to the overall whole.\n\nManos isn't even close to the worst film I have ever seen. Sit through the likes of The Boys in Blue, Psyched by the 4D Witch or Car 54, Where Are You? and tell me honestly do you think Manos rots the brain like those? It may be technically and artistically awful but it works as a sort of half-remembered fever dream. Terrible but quite compellingly so. Probably a film that every film fan should see, just so they can make up their own mind."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Writer/director/producer/actor Harold P. Warren was a fertilizer salesman before this film---'nuff said!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "rancidswan",
        "review_rating": "1",
        "review_title": "I drowned in a pool of my own disbelief (spoilers within!)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "poopy",
        "review_rating": "1",
        "review_title": "Possibly the most unpleasant movie ever made",
        "review_detailed_main": "I just saw this again recently, and I can't believe that it's voted as high as it is. This movie has the rare distinction of being both creepy and dull at the same time. This movie is so unpleasant to sit through, you almost feel a malignant hate for you on the part of the crew."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "lcastrillo",
        "review_rating": "10",
        "review_title": "One of my favorite all time bad movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "CinematicThylacine",
        "review_rating": "6",
        "review_title": "So Insanely Bad It Is Good!",
        "review_detailed_main": "This film is one of those rare films that is so over the top bad that it's actually good! Being filmed on a bunch of dismal sets out in the dessert with hardly any good lighting, the actors seem to stumble around blindly while trying their best to act. Special mention goes to the creepy Torgo character who talks as though he got his tongue burned on hot soup and stumbles around with oversized watermelons in his pant legs. From what I hear, the entire production was one disaster after another and they eventually had to have someone redub all the lines of the actors and actresses. I don't want to give too much away on the plot but this movie is definitely a Holy Grail of bad films, I highly recommend you give it a try."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "captainpass",
        "review_rating": "5",
        "review_title": "Not Nearly as Bad as the IMDb Rating Suggests",
        "review_detailed_main": "Yes, the camera work is a mess (think: out of focus shots, or lingering shots for no particular reason). Yes, there is much standing around doing nothing in place of dialogue. And what dialogue there is in MTHOF is often insipid. And, no, Mr. Warren cannot act. Oh, and the voice substitution for the young girl almost beggars belief.\n\nThat said, if you think of this as an amateur play, it kinda works. There is a story. The movie is mercifully short. And the actors are at least handsome/pretty and/or memorable.\n\nOver the years, I have seen plenty of big budget movies that I hated far more than this excursion."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Matt-294",
        "review_rating": "",
        "review_title": "C'mon, you loved it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Sheol1812",
        "review_rating": "3",
        "review_title": "I'm conflicted",
        "review_detailed_main": "Manos . . . Is something else entirely. On the one hand it is an objectively bad film, but on the other hand it knows it is an objectively bad film.\n\nSo how do you approach something that knows it is one of the worst things to ever exist? The only way to make sense of Manos is to judge whether it accomplished what it was meant to be.\n\nAnd it did.\n\nWhich is why the film cannot be given 1 star. The whole legend behind the film alone elevates the rating.\n\nI still don't know how to feel about this one."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "The_Invisible_Dog",
        "review_rating": "1",
        "review_title": "Surprisingly, wonderfully bad. I loved it.",
        "review_detailed_main": "It's quite rare to see anything as roughly-assembled and ridiculous as this. I mean, I love trash films/tv but this is gold standard as far as that kind of guilty pleasure is concerned. It's not just 'bad' - this movie has a real character to it.\n\nYes, there are some waaay over-long scenes (as is common with most 'so bad it's good' movies) but here, even they helped to amplify the insane feeling of this movie.\n\nAs the first ten minutes unfolded, I became slowly overtaken by a giggling fit as I began to realise just how off-piste and bad this film really was. I had to double check that it wasn't a parody. I'm so glad it isn't. It's a raw delight.\n\nSo many unexpectedly awful and silly moments to remember. Can't wait to see it all again.\n\n1/10 movie that's 8/10 for entertainment value."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "leoxatzian",
        "review_rating": "1",
        "review_title": "If you are looking for the worst of the worst, look no further.",
        "review_detailed_main": "When it comes to how bad a movie can be, there are movies that are made by inexperienced and untalented people who don't know the first thing about film-making ... and then there is \"Manos : the hands of fate\". Even if it has become a cult classic that provides a unique viewing experience, the movie is still so unbelievably terrible that no existing words could even come close to discribing it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Nightman85",
        "review_rating": "1",
        "review_title": "words do it no justice - see it's badness!!",
        "review_detailed_main": "Family driving through rural Texas stops at an isolated lodge where a cult of weirdos live.\n\nLegendary, bad B movie made by Texan fertilizer salesman Hal Warren was brought back into the light when it appeared on a 1994 episode of Mystery Science Theater 3000. It's not hard to see why so many find it to be the worst movie all of time either. The whole cast is dubbed terribly, the editing and direction are completely shabby, and there's not a sign of tension or fright to be found here! It's silly schlock that's just too cheap to afford a cheesy rubber monster, so they throw in some semi-creepy looking Texans. Although you do have to give it up for that haunting Torgo theme!\n\nFor those seeking the worst movie ever made, this cheap little number is a fine candidate!\n\nBOMB out of ****"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "BandSAboutMovies",
        "review_rating": "5",
        "review_title": "I love this movie and will defend it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Ladyperfectmind",
        "review_rating": "1",
        "review_title": "\"Manos\"...the hands of fate",
        "review_detailed_main": "First I'd like to thank the guys at MST3K who made watching this movie possible...really, THANKS, couldn't have done it without you.\n\n\"Plot\" summary: A family is driving (and driving...and driving...and driving...) through the countryside and (beleive it or not) gets lost. They wind up at a spooky lodge. There they meet Torgo, the guy who takes care of the place while the Master is away. Eventually the Master shows up. He has a fetching cape with the \"Hands of Fate\" (registered Trademark of \"MANOS\"...) logo printed on it. He worships \"Manos\", an evil deity of primal darkness, who dwells in the depth of the universe and the black chasms of night and is essentially very very bad. So after a lot of talking an less of doing, the movie ends...?\n\n\"Manos\" the Hand of Fate is a horror movie through and through. The plot, the acting, the MUSIC...HORROR. It is quite remarkable though how the crew (yes, they had a crew) managed to put in so much sexuality in a movie of the 60s...hmm.\n\nI have seen a lot of bad movies in my life, but none of them came even close to the HORROR that is \"Manos\" th Hands of Fate. Was it fate or just the hands of a very untalented director that lead to the making (and release) of this movie? Perhaps we shall never now...\n\nIn conclusion (did I mention how horrifying this movie is?) this IS the absolute WORST movie ever!!! I can only imagine they spent the entire budget on renting the cabin,so there was no money left for acting lessons, or directing lessons for that matter...\n\nIf you are one of those people who gets a kick out of sharpening pencils, suffer from schizophrenia, personality disorder or have had HALF OF YOUR BRAIN REMOVED, I highly recommend you watch \"Manos\" the Hands of Fate. If not, watch the MST3K version...it's a blast."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Halsdaughter",
        "review_rating": "1",
        "review_title": "clearing it up",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Alien_I_Creator",
        "review_rating": "10",
        "review_title": "A Cult Curiosity",
        "review_detailed_main": "Often called \"the worst movie ever made\", Manos: the Hands of Fate is a surreal excursion through the depths of underground cult cinema. Filmed on a less-than-shoestring budget in my hometown of El Paso, Texas, I've had more than one run-in with this picture and I even finally acquired it on DVD. Over the years, this has been a piece that I go back to as a foundation for low-budget film anomalies.\n\nShot in what looks like my grandfather's super 8 camera, Manos is the story of a family of three lost in a desert maze in search of a vacationing area. They end up shacking down for the night with a strange cult that worships hands or \"manos\". Memorable characters include Torgo, a spastic underling of \"the Master\"(the ashen, mustached leader of the cult), Michael,the father/husband of the family who may well be the worst actor in history aside from being the director of the film. Some highlights include a dead dog, a fight amongst chicks in togas, a crazy 1960's bebop jazz soundtrack, and a strange but smart ending.\n\nMost people who regard this movie at all have only experienced it on Mystery Science Theatre 3000. However, I find that it is also very fun to watch on it's own. Fans of extremely cheesy cinema (ala' Ed Wood) should not miss out on this cult curiosity."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "crunkassjunk",
        "review_rating": "6",
        "review_title": "This movie is terrible? Has anyone been to the theater lately?",
        "review_detailed_main": "From reading everyone's comments on this movie, I was expecting this movie to be one of the worst movies of all times. However after watching the original movie (not the MST3K version), even though it was pretty cheesy, overall I was pretty impressed. With a budget of just $20,000 and with no real actors, Hal Warren was able to produce a movie which had a better plot and more realistic acting than most big budget movies that I see today. In my opinion, the disdain which people direct toward this movie would be better used on movies such as Stealth, Poseidon, Date Movie, and every other sorry piece of slime that finds its way out of Hollywood these days."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Chromium_5",
        "review_rating": "2",
        "review_title": "\"Manos\" could have been good...",
        "review_detailed_main": "I recently watched the MST3K version of this movie, and believe it or not, it made me want to watch the original. Joel and his robots were very entertaining, of course, but I got the feeling while watching it that if they weren't there bashing it to pieces, it wouldn't be nearly as bad as everyone makes it out to be. And since there's probably about five people in the world who have actually seen the original film, I doubt anyone can really argue with that.\n\nFirst of all, bad editing aside, the movie has an eerie, surreal atmosphere that makes it seem more like a long dream sequence than an actual movie. It's as if we're watching someone's nightmare played out on a movie screen. Whether Hal Warren intended it to be like that or not, I think it works.\n\nI also think the concept is pretty good. A family gets lost and has to stay at an insane cult leader's house, who wants to brainwash the woman and take her for one of his many wives. The ending is one of the creepiest endings to a horror movie ever (there is even a sick little hint of pedophilia). I honestly believe that with a MUCH bigger budget and better actors, this could be remade into a really good movie.\n\nNow, with that said, I must admit that \"Manos\" has one extremely funny element that is the downfall of the entire movie, and that is Torgo. What Hal Warren lacks in film-making talent he makes up for in imagination, because he has dreamed up one of the funniest characters to ever appear on film. Torgo is a stuttering, wobbling, neurotic troll of a man with an out of control sex drive. His expression when he looks in the window and watches the woman undress is classic. It also doesn't help that the way he talks is uncannily similar to Milton from \"Office Space.\" I suppose Torgo could have been scary if he was a little more aggressive, but he is such a complete loser, it is just too funny. His tragic end of being slapped to death by a bunch of women is a classic movie scene. I think if Warren had written this as a comedy, it could have won an Oscar.\n\nSo all in all we have a movie that tries really, really hard, but is ruined by terrible editing and the funniest villain in history. If this had been made right, it could have been excellent, but unfortunately it has become known as the official worst movie ever. Personally, I am giving it 3 stars out of 10 for pure effort.\n\nIf you watch it, watch it for Torgo."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "zainahmad",
        "review_rating": "1",
        "review_title": "The most inept film ever made terrible film, horrible.",
        "review_detailed_main": "Manos, it truly one of the greatest Terrible films ever made. And you would need to be hypnotised or drug-ed to ever watch this film.\n\nMy Uncle made me watch this film for a bet and it was truly torture. I cannot believe how poor the acting was and there was no storyline what so ever. I can endure any low budget film or any poorly shot horror flick.\n\nManos is truly seriously one of the most rubbish films made. It so bad that it's actually funny. If you ever want to test your stamina then i dare you to watch the entire film Manos.\n\nOnly the brave would be able to endure such torture.\n\n1-10"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Faneos83",
        "review_rating": "1",
        "review_title": "Manos..The Sh*t of God",
        "review_detailed_main": "First of all God please sincerely forgive me that i offend your divine shits comparing them with Manos.Secondly i owe a big APOLOGY to all you people who reviewed it i have no excuse you warn us but my poor mind thought you were too critical with this plus add the curiosity which is one of the fatal human characteristics so i decided to challenge myself unable to imagine what would follow.\n\nTo begin with Manos means hand,if rephrase the title we have Hand:The Hands Of Faith? lol is a masterpiece of a unique terrible film which cannot compared to anything else you have ever seen I GURUANTEED.Please don't say the low budget as an excuse NO..NO..NO we have seen many worth telliing lowest budget films even amateurs but the problem here is my 12 years old daughter has more technical knowledge and artistic view in her films and are flawless compare to this even the simplest shots THE SIMPLEST god damn shots are technically wrong the acting is unimaginably bad not even in an pre amateur level the audio and editing are really really PHENOMENON beyond any imagination.It is impossible for someone make such a abnormality of a film without a purpose,in my opinion the sadistic director intentionally made it so desperately bad and ironic to last to the ages as the worst film ever made just like the Parthenon was one of the most ever lasting beautiful structures.Also look the Master's bathrobe has two open hands point to the viewer(to fool us)to laugh with us to pleasure himself with our physical and mental pain as we experience this film.I will say nothing more YOU MUST EXPERIENCE it yourself and yes personally i recommend to see this understand evil in it pure form and test yourself how far can you go physically and mentally ill.\n\nPainfully remember i was so anxious after the first 20 minutes but i was keep talk to myself terrified how worst can this be oh..sweet Christ i didn't knew.The end of this terrible experience was the icing on the cake,after 74 MINUTES strain i had a terrible low being feeling etched into me,physical and mental pain.I FLED TO THE NEAREST ALCOHOL SHOP to bought a bottle of a strong whiskey.I remember i wanted so f@cking desperately to get badly drunk.\n\nI admire Actor John Raynolds who played the half-man half-goat character a satyr named Torgo who after this film completed has the balls and the DIGNITY to suicide.What about the others how they lived with this weight on their consciousness specially the cunning director harold warren.\n\nFinally i want to WARN YOU people do not watch it with use on any kind of recreational drugs or alcohol you may remove your own eyes,have panic attacks,a strong feeling of pessimism or even a permanent brain cell damage.This film is used by the CIA as a method of torture,from Navy Seals Instructors in Hellweek to keep students awake or even the Prince Of Darkness in Hell in a new DTS 7.1 Remastered Edition because as it is well known physical pain can be tolerated this film SERIOUSLY NOT.\n\nΥ.Γ I wonder what experimental drugs have given to the Mystery Science Theater 3000 guys to withstand re-edit this until the end without suicide and feel wretched pity about being editors."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "zombieoutbreak-74199",
        "review_rating": "4",
        "review_title": "This is not the worst movie ever made.",
        "review_detailed_main": "I don't know what all the hype is about. If people think this is the absolute worst film in exist then they have not seen Things (1989)."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Sandcooler",
        "review_rating": "3",
        "review_title": "Most intriguing piece of crap ever made",
        "review_detailed_main": "The problem you encounter when you write about a movie like \"Manos: The Hands Of Fate\" is not figuring out what you're going to say about it, but rather what you're going to say about it first. This awful movie has generated such a dazzling amount of weird anecdotes and goofs, and in that way it's actually far more entertaining than the average film. One of my personal favorite bits is the one where the cop gets out of his car to investigate, takes two steps, and then just walks back because producer/director/writer/lead Hal Warren couldn't afford more than one light. And who doesn't love the highly threatening daytime stock footage snake in a nighttime scene, or the little girl that has her lines dubbed over by an adult with a hilariously forced high-pitched voice? Or the moths, who steal most of the scenes because they can't stay away from the lighting? Or the part where Warren clearly mouths \"CUT\" to the cameraman? Or the endless night gown wrestling matches? And Torgo of course. It's a huge accomplishment to stand out as bizarre in this movie, but Torgo manages with no effort whatsoever. What a hero. This movie has its dull bits (the driving scenes are almost in real time), but it makes up for that with its ridiculously awesome bits. It's an enriching experience you'll never forget, and it even comes with a twist that's genuinely pretty clever. Recommended, and with good reason."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "voldee10",
        "review_rating": "1",
        "review_title": "who doesn't like \"MANOS\"",
        "review_detailed_main": "Here is a \"movie\" that you should see because its so god awful. But I think you should only watch this film if it has MST3K commentary otherwise you brain will melt and your head will explode during the first 10 minutes. It begins with a man named mike ,who needs anger management, driving along the road with his family on vacation. Eventually they stop and ask for directions from a lovable gout victim named Torgo. they end up staying in Torgo's house which is inconveniently the mouth of hell. Mike and his family must band together and stop a man in a Pancho from killing them. I'm not going to tell you much about \"MANOS\" because there really isn't much to tell other than good luck I hope you head does't explode"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "tdiet",
        "review_rating": "1",
        "review_title": "Good lord, what was that",
        "review_detailed_main": "First of all, I watched the original movie, not the MST3K version, which makes it only worse. Actually, I did not want to watch this movie at all, but due to a lost bet, I had to do it =/ The very first few minutes give you an overall impression about how bad this movie actually is. You see, first of all, I could not believe when people told me that it was THAT bad, I was like \"oh come on, no movie can be absolutely disastrous, that's just not possible\". But Manos - The Hands Of Fate proved me wrong. It was very disturbing, the first ten minutes when they are driving through the desert is awful. Disastrous plot. Disastrous acting. Disastrous dialogues. Very disastrous soundtrack (seriously!!). Nothing makes sense.\n\nThis movie seems to be pretty short, a bit more than an hour, but be warned. I thought it was about four hours after I finished watching it. It really hurts, sometimes, you hope that your TV will explode so that you do not have to finish watching this piece of crap.\n\nTo put it in a nutshell, the rumors are true. It is REALLY a very bad movie, and I would even agree that it's the worst (YES, I have watched Gigli yet). There's much better stuff you can do with your time, but after all, I am not too angry that I watched this one because it's a pretty good chance to see how NOT to make movies.\n\nThis is a crime to cinema, it really deserves a 0/10, but I must give it a 1."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "BaronBl00d",
        "review_rating": "2",
        "review_title": "\"Manos Loves Women\"",
        "review_detailed_main": "Well, I have something in common with Manos too; however, the best part of this film is easily the title. I love that title. MANOS: THE HANDS OF FATE! Once that is removed I fear there is not much to say in favor of this film. Obviously it is bad. Currently 627 reviews on here. Wow! What do I have to add? Not much. First of all, I have seen far worse films and ones which are almost unwatchable(The Beast of Yucca Flats comes to my mind readily). I dig the music. The girls are appealing...all seven. The film is such a bad film that it made me laugh. None of these folks can act. The guy playing Torgo is so atrocious that he is mesmerizing. The gimpy leg, the curled lips, the \"master will not approve,\" and his quest to get him his own woman. Funny stuff. How about the family? Daddy, Margaret, and Debbie. MIchael(played by director/producer/writer Harold P. Warren looks like he just left a rotary meeting. He has no conviction in his lines, lines like, \"Get back in the house dammit!\" The dialog is abominable. The camera-work is horrific. I could go on and on. It is easy prey, so again I like the title, Torgo, the girls, and the groovy soundtrack. The film is garbage but has a following after all these years. We remember the best and the worst. Mediocrity is oblivious in nature."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "leelumpkin",
        "review_rating": "10",
        "review_title": "Best Worst movie EVER",
        "review_detailed_main": "This beats The Room, Birdemic, Troll 2, Plan 9 From Outer Space, and even Santa Claus and the Ice Cream Bunny (which is another worst film many people have never heard of). I can't give it a 1, because I was entertained so wonderfully from beginning to end. For what it is, it is a 10. The reason this is truly the best worst movie ever is that there is not one shred of competence in the entire movie. The sound, the cinematography, the \"plot\", the acting, the dubbed voices, just everything. If you enjoy watching the worst movies and have NOT seen this one, you are in for such a treat."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "bat-5",
        "review_rating": "",
        "review_title": "Pure pain.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Xomby",
        "review_rating": "7",
        "review_title": "ThE mAsTeR wOuLd NoT aPpRoVe Of ThIs CoMmEnT!!!",
        "review_detailed_main": "I love this movie...everything about it is really sleazy...the music, the actors, everything! The \"hero\", played by the director on a bad ego trip, is one of the most arrogant jerks I've ever seen. The \"villain\", The Master, is laughable in his role. Torgo is the only reason to watch this. He is one of the greatest characters to ever come out of cinema...his role is legendary! If it werent for him this would be a lot worse and thats saying something; It would be completley unwatchable. Hats off to Torgo, the big kneed quasimodo that we all have a place for in our hearts..."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "prestocito",
        "review_rating": "1",
        "review_title": "Horrificaly bad",
        "review_detailed_main": "Have you ever played 2k and your players keep missing even though they are wide open and there name is Steph Curry, and your body boils with rage because you know that not in a million years they would miss that shot? And so you are extremely annoyed and angry? That is exactly what this movie makes me feel.\n\nEven if you don't play 2k, you probably understand exactly what I am saying. This movie makes me angry. Here are my reasons why: 1. The soundtrack. It is the worst. Sounds like elevator music but 100 times worse.\n\n2. The dialogue. They take forever to say their lines you wonder if they forget their lines and someone is trying to whisper them their lines because they totally forgot what they said, so it takes them like 6 seconds to remember their lines. Also their voices are annoying and just old.\n\n3. Plot is just stupid and boring Even though I know this is from the 60's I cant help but hate this movie. Avoid at all costs. It is not one of those so awful its good like sharknado. It is so bad it is torturing to the soul and body. If MrBeast did another solitary confinement and they made him watch this, he would quit in 30 minutes."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "xuehuabingyu",
        "review_rating": "1",
        "review_title": "It's indeed the worst film of all time.",
        "review_detailed_main": "Manos: The Hands of Fate is known as the worst film of all time. I knew about it from How I Met Your Mother where Ted mentioned about it. Ever since, I always wanted to watch this one to know how bad it is. But I couldn't have a chance. Today, I had one and so, I watched it.\n\nAs I've stated in above, I already knew this film is really a bad one. But I wanted to find out by myself. That's why I watched even I know this is a bad film.\n\nAfter I watched this film, I was like yeah, it's totally the worst film of all time like they said. The performances of the actors and actresses are very bad, the directing is really bad, the editing, the original score, the script and all, everything in this film is terribly bad. No wonder this film has become the worst film of all time. How could the director make this kind of terribly bad film? I have no idea.\n\nAnyway, this film is terrible, so, if only you want to taste what the worst film of all time is, you should watch it. Otherwise, I recommend you to skip it.\n\nP.S: I forgot to mention one more thing. The genre says \"horror\". Because of it, I was feeling afraid to watch before. I always consider the genre horror is those kind of films that make audience(s) feel afraid. But when I watched it, I found that it's not a scary film. I even feel like the genre horror doesn't have anything to do with this film. The film is just a normal thing and doesn't have anything scary. So, why they put this film into horror category?"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "TheMagpie",
        "review_rating": "1",
        "review_title": "Half Decent Plot - Awful Execution",
        "review_detailed_main": "Have you ever seen a movie that you thought \"if they put this plot in the hands of someone who knows what they're doing, it would be a pretty good movie\"? This is one of those movies.\n\nThe basic premise, a family in a remote town happening upon a house which is run by a maniac, is fodder for heaps of horror movies through the ages. In the hands of a better writer, better director, better producer, better editors and better actors, this might have been a 5-7/10.\n\nHowever, the actors not knowing that the camera was on them at the start of a shot, the poorly written dialogue, the extremely sloppy editing make this move unwatchable. The acting is terrible, overly hammy.\n\nAvoid watching this movie, it will be 90 minutes of your life that won't be wasted."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Tlordagama",
        "review_rating": "1",
        "review_title": "A #1 runner for Turkey of the Millennium",
        "review_detailed_main": "Saw this movie in DVD last night; it looked like teenagers, with a an old Super 8 camera, were 'day -tripping', which they might have been doing since it was released in 1966.\n\nEven the commentary by the MS people couldn't save it from what it was shoddy editing. (\"the camera could only take 30 seconds of film at a time\", what kind of camera ever did that?) It had $1.98 written all over it!\n\nI read that 4 cast members committed suicide after this picture was released. Sounds like they didn't like it either!\n\nMakes 'Plan 9 from Outer Space' look like Oscar material. Watch it if you must but if you run screaming from the room remember you were warned!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "bjones-427-639714",
        "review_rating": "1",
        "review_title": "Only two things are infinite...",
        "review_detailed_main": "Einstein once said, \"only two things are infinite, the universe and human stupidity. And I'm not so sure about the universe.\" \"Manos\" is the celluloid evidence that proves Einstein correct. This film is human stupidity taken to infinity. In a century of film making, there have been some wretched pieces of work, but Manos is the undisputed heavy weight champion of ineptitude. When we discuss the merits (or lack thereof) of a film, elements such as script, screen play, directing, casting, acting, cinematography, composition, continuity, visual effects, sound, lighting, set design, editing, post-production and numerous other aspects must be considered. As several other reviewers have stated, Manos is a total train wreck in every conceivable category. It was filmed with a single hand-held, spring-wound 16mm camera that could only shoot for 32 seconds at a time. And in order to save film (and money) H. Warren (Director) did almost no retakes. So, as you can imagine, the camera movement is closer in technical proficiency to a backyard birthday party video than a professional feature film. The film was also shot with no audio. All of the dialogue and other sounds were dubbed after shooting, with predictably dire results. From a purely technical perspective, this film would be 70 minutes of blinding pain, were it not for the fact that, much like the visual quality, the sound transcends the realm of bad to the point of being comical. What about the acting? Hold on a minute. I'm still searching for a word that might begin to describe the shear debacle of the performances. I can't seem to find just one word, so I'll give you two. John Reynolds. His portrayal of the character Torgo has gone beyond legendary and reached mythical status among the movie-going public. And for good reason. Please read some of the other Manos reviews for the particulars about Torgo, there are just too many to go into, and I really wouldn't even know where to start (although the ridiculous \"goat legs\" would probably be the logical starting point). One would think that given the numerous technical and artistic elements involved in a feature film, something, just one thing could be done at a mediocre level, even under the direction of a snow-white amateur like Harold Warren. And therein lays the reason for our fascination with Manos. That is to say bar none, absolutely every possible mistake imaginable was made in this movie. Viewing Manos is much like gawking at a horrible traffic accident, you just can't seem to look away even though you know you should."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "glphil",
        "review_rating": "1",
        "review_title": "Made on a bet.",
        "review_detailed_main": "There is a good excuse for this movie being so bad. I had read that the guy who made this film had a $10,000 bar bet. He bet someone he could make a horror movie that would show in the theaters. As you can see, he won the bet.\n\nNow in my book, that's a fine excuse for a horrible movie!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "EarthwormZim",
        "review_rating": "1",
        "review_title": "Failure Caught on Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "KOknockout920",
        "review_rating": "1",
        "review_title": "Movie to kill yourself over,literally",
        "review_detailed_main": "I have the MST3K version of this movie and let me tell ya.This movie is the stupidest,cheapest, and most disturbing movie I have ever seen.\"Manos\" was created by fertilizer salesman Hal P. Warren of Texas.As the result of a bet, the movies budget was only $19,000.Anyway,this movie begins with an absurdly long driving sequence with an annoying soundtrack.Then, they end up lost and found a hotel owned by Torgo, a man who is oppositely\"taking care of the place while the master was away\".Then the family wants to leave the hotel but cant because its dark and the car wont start.When Debbie(the daughter)is found after she was lost, she shows her parents the \"tomb\" where the master and the wives are sleeping.When they learn the hotel is owned by a pagan cult,the family tries to escape.But then they are captured by the master.At the end, the family end up as members of the cult.It is just a movie that makes you kill yourself over,literally.. After its release in 1966, it became almost unheard of because of its obscurity for 23 years.That is until the fateful day of January 30,1993 when it premiered on the show Mystery Science Theater 3000. After that day,\"Manos\" became more popular than ever before. In 2004, the documentary \"Hotel Torgo\" was released.It was then considered the Worst movie ever according to the June 10,2005 issue of Entertainment Weekly.It also was shown in an article of the El Paso Times.And as of August 16,2005 it was # 1 on the 100 bottom list on IMDb.\"Manos\" the MST3K version is available where videos and DVDs are shown.I recommend that.But I'm not going to tell where the uncut version is because some of you freaks up there will get it and end up on the news because you killed yourself because of the movie. So this is my review of \"Manos\" the hands of fate."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "a-moss",
        "review_rating": "10",
        "review_title": "Wooohaa.. what a trip....",
        "review_detailed_main": "Well, I can actually understand why some would actually think of this as the worst movie ever. But you know, in a mad world.. this is a wacko masterpiece. I happened to love it. The amount of errors in this movie was actually enjoyable. The bad editing, the frequently inaccurate dubbing, the lazy underacting and the stereotyped acting... it actually sets a mood that is fascinating .. It was so weird in many ways, but you can't grasp if its supposed to be like that or not. I just fell in love with this movie...\n\nThe ending I'm not sure about though. It kind of has this twist, that is OK in a way, but it is not as unique as the rest of the movie.\n\nI especially love it when the husband tells his wife to go into the house THREE times after another because of bad cutting(and she's about to enter the house in all of them). And Torque.. what a guy. He makes love to women by stroking their shoulder.... You have to watch it yourself to believe it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "LesWaste",
        "review_rating": "",
        "review_title": "Torgos Torgos everywhere, and not a drop to drink",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "johnwaller56",
        "review_rating": "7",
        "review_title": "Not As Bad As You Think",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "SnoopyStyle",
        "review_rating": "2",
        "review_title": "terrible with a few chuckles",
        "review_detailed_main": "Michael, his wife Margaret, their daughter Debbie, and their dog Peppy are on a road trip vacation. They take a wrong turn onto a dirt road and get lost in a maze of dead end paths. They find an isolated home and its caretaker Torgo. They decide to stay. Torgo keeps mentioning The Master. Peppy disappears and Debbie finds The Master's dog. The Master and his bickering wives awaken.\n\nThis is horrible filmmaking. Filmmaker Harold P. Warren is also the star playing Michael. He's not an actual filmmaker but rather a fertilizer salesman. Supposedly, he made this on a bet. Warren is impossibly incompetent in his filmmaking. The list is too long. The acting is bad but it's made infinitely worst with terrible voice dubbing. It's something one has to see to believe. All of it is horrible. The worst and possibly the best is John Reynolds who plays Torgo. Again seeing is believing although he is also rumored to be constantly on acid. The whole thing is a mess but some of it is so unbelievably bad that it's actually funny. The catfighting wives is so stupid that I cannot stop shaking my head in disbelief and I hope they kept that handy cape. After its disastrous release, it quickly fell into anonymity until Mystery Science Theater 3000 did a show on it. This is one for the record books."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "animaldrew22",
        "review_rating": "1",
        "review_title": "Delightfully tacky, yet unrefined.",
        "review_detailed_main": "This movie set the standard for awesomely bad movies. I have actually yet to see it without the genius commentary of the Mystery Science Theater 3000 crew and I am not sure if I would be able to handle sitting through the duration of the film without it. The acting is horrendous and to make it even worse, the dialogue, however bad it may be, is actually dubbed over itself making the movie appear even more low budget. This is the kind of movie you show to people when they say \"I just saw the worst movie ever!\" just to prove them wrong. To the movie's credit, however, after seeing this little flick, it will be forever etched into the permanent portion of your memory, whether you want it to be there or not."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "13Funbags",
        "review_rating": "1",
        "review_title": "So bad it's good?",
        "review_detailed_main": "This movie is just like one of those old movie parodies SNL would do with all the bad editing and worse acting.The editing is so bad it actually goes backwards in conversations.So a family gets lost and they just stumble upon some random place.The guy standing outside looks and acts like he has been hit by lightning and he says \"I am Torgo, I take care of the place while Master is away\".Which clearly means go away,fast.Then Torgo says Master wouldn't want the child to stay there, although no one has mentioned staying there.So the dad insists on staying there!It's not even a hotel or anything, just some random house.Then he makes the gimp carry their luggage!There's a scene where they talk about how safe their daughter is while she gets up and wanders away!This is one of the rare times that I would say a movie is so bad that you have to see it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Saltyskid",
        "review_rating": "1",
        "review_title": "0/10 movie",
        "review_detailed_main": "Effect 100 You will have to guess what is happening in every single frame Even bad movie can't do worse than this Jazz music just poped out of nowhere."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "udongexmyon",
        "review_rating": "1",
        "review_title": "The worst movie ever made",
        "review_detailed_main": "There are many ways in which you can approach the question of the worst movie ever made. There are conceptually bad films that should never have made it out of the meeting room (Emoji Movie, Jack and Jill). Those with ridiculously bad effects and painful visuals (Birdemic, Foodfight). Obvious ripoffs seemingly made for tax avoidance schemes (Little Panda Fighter, Ratatoing). Films that have manipulative and destructive messages, those with legal controversies around its production... the list goes on.\n\nEach of the films above and more are as deserving of the crown as Manos in their own rights. However, if one has to make the decision on one definitive \"worst movie of all time\", I will confidently name Manos: The Hands of Fate.\n\nThe fact that Manos is none of those things is what makes the difference. It's not a conceptually bad film as the premise itself is just a standard horror film. While the production design is awful, it's not at the point of being as actively painful as the films listed above. Manos is not a ripoff of anything, doesn't promote a particularly bad message or have a major controversy around its production (though there were definitely issues with it).\n\nManos is not bad due to any reason aside from the fact that it is simply bad. Bad in every single way. It undermines all of conventional filmmaking by ignoring plot, structure, continuity, development, plausibility, verisimilitude and countless other similarly insignificant details. Even Jack and Jill and the Room has very rudimentary levels of such basic film fundamentals. Only the Neil Breen films could compete with their incoherence and incompetence.\n\nOf course, one could always name a worse film if one delves into the most obscure, low budget productions. The Neil Breen films mentioned above are definitely on a comparable level after all. But notoriety is a significant contributor of being the worst film, for if nobody had seen and suffered through it, does it really matter at all? All in all, Manos: The Hands of Fate has a perfect balance of painful incompetence and cult reputation, earning it the crown of the worst film ever made."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "yellow_rose_of_texas",
        "review_rating": "1",
        "review_title": "A Bad Movie All Around",
        "review_detailed_main": "How would I sum up Manos? To start off, bad cinematography, no plot, bad acting and (obviously) a low budget.\n\nA family is going on vacation to the Valley Lodge, but gets lost on the way. When they stop to ask for directions, they encounter Torgo (the caretaker) a half goat/half man, but with the bad prosthetics, it just looks like he has footballs shoved in his pants so you can't tell that he is actually a satyr. Although Torgo is reluctant, he lets the family stay for the night, knowing that his 'Master' will get mad for letting a man and young girl stay at the house (all he wants is a new wife).\n\nThe voices of the characters were dubbed (mostly) by Hal Warren and Diane Mahree, but it isn't exactly in sync. The soundtrack (if that is what you want to call it) is very bad jazz and doesn't seem to flow with the film. The first scene when the family gets lost, seems to take forever because they forgot to put the credits in the beginning, so there is no talking, just driving.\n\nThis movie is for a tough audience and is also physically draining, so if you watch it, make sure to get the MST3k version and/or lots of caffeine."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "HorrorEnjoyer",
        "review_rating": "3",
        "review_title": "Not the worst.",
        "review_detailed_main": "This movie is not the worst movie ever made, don't believe what some may say, because for one it has an actual plot, music is not too bad for it's time and Targos character is actually pretty entertaining. Yes, it's boring, stupid, has incredible bad acting and fails as a horror movie, but it has somewhat entertaining in it, what you couldn't say about f.e. Disaster movie - that movie will hurt you physically, this one will give you some cheap laughs and for the most part just bore you to sleep - it's not bad, when you compare, I've even found first ~ 20 minutes of Manos somewhat entertaining and well built, if they had scary villain and maybe some monster to back it up I would've actually enjoyed it. I would say - give it a try, or - give Targos a try, that guy really nails the role and for someone like me, who's into bad movies, that's enough to find some fun in this underrated flick."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "kaczorowskibartlomiej",
        "review_rating": "1",
        "review_title": "Even after so many years, it's still one of the worst movies ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Casey-52",
        "review_rating": "10",
        "review_title": "How many people have even seen this movie?",
        "review_detailed_main": "From reading the reviews for this movie (which is right now #12 on the bottom 150 films), I can tell that less than 1% of the people who reviewed this have even seen the complete un-MST'd \"Manos the Hands of Fate\". Well, I may stick out like a sore thumb, but I liked this movie. Not enough to watch it over and over and over again, but I think that the fact that its low budget helped it be a little creepy. It has a documentary-like quality that makes it look eerily like a snuff film. The bizarre music, the bad lighting, the average acting, Torgo's sickening costume, and the strange dubbing help make it one of the more intriguing low-budget films of the 60s. That's right, I liked this movie, it didn't bore me very much, and I would watch it again. You can watch the MST3K version of \"Manos\", but you'll lose a great deal of the movie and its atmosphere. Give it a try without MST3K (who also ruined \"The Brain That Wouldn't Die\", \"Revenge of the Creature\", \"Squirm\", and several other underrated classics), you just might be surprised. Given that I have actually SEEN the original \"Manos\", I think I deserve a bit more credibility than those who have relied on MST3K's judgment, not their own."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "hexar_le_saipe",
        "review_rating": "",
        "review_title": "Ecch!! One of the WORST movies ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "bmalakwa",
        "review_rating": "6",
        "review_title": "Hard to compare a movie that cost $20,000 to make with one that cost $200 million.",
        "review_detailed_main": "The movie is far from being the worst movie ever made in consideration of the cost to make it and comparison to the 100 to 200 million dollar farces the studios are putting out today. Ignoring all its shortcomings it is interesting enough to watch to the end and ask yourself what the £@#$ was that. This is another movie where the background story on how the movie was made is more interesting than the movie itself."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "xnirvanax5706",
        "review_rating": "1",
        "review_title": "Its either hilarious or numbingly painful",
        "review_detailed_main": "There is only one way to watch this bad excuse for movie, MST 3K style! It's hilarious when you watch it that way.\n\nON THE OTHER HAND This movie has a emaciated plot, terrible sound/acting/lighting/story progression/camera. It should not be in existence! The opening of the film alone bores you to the point where you want to perform the \"Eye splinter scene\" from Lucio Fulci's Zombie on yourself, just because you had to watch this movie. The opening scene is more than 10 solid minutes of driving in a car and doing nothing! AHHHH! Do not watch this movie, under any circumstances. I would rather disembowel myself and cannibalize my intestines that have to watch it again. (Without the Mystery Science Theater 3000 of course)"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Horror Fan",
        "review_rating": "1",
        "review_title": "Don't watch this without the bots, the master would not approve",
        "review_detailed_main": "I love weird bizarre movies, especially Japanese ones. I've sat clapping to Ifukube's wonderful score in Chikyu Boeigun, Daikaiju Baran, and Uchu dai Senso. I sat shocked and shivering to Mondo Cane, Denso Nigen, Kyuketsuki Gokemidoro, and especially Tetsuo. I've sat laughing in Frankenshutain tai Baragon, Uchu Kaiju Guilala, Gamera tai Uchu Kaiju Bairasu, and Gamera tai Daikuju Guiron. And I've sat just loving it in Matango, Daimajin, Kaidan, and every Saturday morning on Teletubbies. However, when it comes to watching this movie it's like this, it's like taking a needle. I would have truly spontaneously combusted if the bots and Joel weren't there, tearing the movie to shreds on MST3K. The plot contians a family who has to stay at a creepy manor owned by a guy named Torgo who has the fattest thighs I've ever seen and who talks in a bizarre voice when their car breaks down. This leads to the resurrection of a satan like character named the master and his hounds of hell. This just has horrific dialogue and sound quality, grainy blury color photography, and an annoying song that accompanies the beginning and end credits, how bad does this get! Eeeeeeeeeeeeeeeeeeeeeee!!!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Spacetree",
        "review_rating": "1",
        "review_title": "Don't even entertain the thought of seeing the non-MST3K version of this.",
        "review_detailed_main": "After reading all the negative hoopla surrounding the \"worst film ever\", I decided to rent \"Manos: Hands of Fate\" to see if it was really as bad as everyone says it is.\n\nAnd they were right. This film is absolutely atrocious. Bad films usually have a habit of having one aspect of film-making that's done horribly while all the other aspects are sub-par. Manos did everything horribly and made sure they drove the point across.\n\nBut if any one aspect was more horrendous than the others in Manos, it would definitely be the cinematography/editing (if you could even call it that after \"Manos's\" creators butchered it). Hack-job isn't the word to describe it. \"Rape and torture\"-job is the word for the filming and editing. There are moments in the film where the camera would be firmly planted at some obscure place (such as the back of someone's head or not even at the actors speaking) or switch abruptly to some badly-framed object. Editing was equally horrendous, as transitions would either be completely black screens or annoying white flashes, and actors/objects/animals in the last frame would change position or pop in at the next frame.\n\nScenes in \"Manos\" have an odd habit of having no relevance whatsoever. One re-occurring scene in particular (a viscous five-minute lip-locking session involving 2 twenty-somethings and a bottle of cough syrup...err I mean whiskey) served no purpose whatsoever except to add more characters to a story which already had too many characters with 4 mains. Add to this ten minutes of driving through non-descriptive fields with soft jazz (bad jazz at that) in background, another five minutes of women in translucent nightgowns wrestling, three minutes of one of the women groping and nuzzling the Husband, 2 minutes of Torgo (the huge-kneed, mysteriously twitching servant to the \"Master\") nuzzling a sleeping women, and some more scenes where the characters stand in absolute silence waiting for the next cue, and you've got a movie with at least 50 minutes of filler.\n\nWriting is well... nonexistent. The writer seemed to take cliché lines, then copy and past them on every other line. Seriously, a good 60% of the film's dialogue is one corny phrase repeated after another.\n\nAnd there is no plot. To say that the plot is cliché is incorrect; the plot cannot be cliché because the plot does not exist. In place of even a poorly scripted plot, there is a assortment of random events, each more logically absurd than the next. Plot-lines also have a tendency to pop-out of nowhere and leave just as quickly (which is surprising, given that a five year old could comprehend the basic premise of such a simple story). The characters that make up this jumble are less than cardboard cut-outs (To be cardboard cut-outs is a phrase that suggests that characters are cliché and fit into a nice niche completely lacking originality or complexity); No characters exist. People are merely there quoting atrocious writing (acting isn't even the proper word; more than once I caught the wife attempting with every fiber of her being not to look directly into the camera). The only exception to this is the misshapen, Parkinson's Disease-afflicted Torgo, which comfortably plops into the monstrous-servant roll (I mean, come on, they might have well given him a humpback and put him in a castle with a mad scientist).\n\nThe sound in \"Manos\" is terrible at best. The background music sounds like the creators took the tracks they play at supermarkets and mixed it with every other horrid B-Movie of the 1950s-60s. Sound effects and dialogue had to dubbed in later as the camera the creators filmed with could not record sound, and as a result almost every piece of noise or sound in the film is about a second and a half late.\n\nSo, in short, if you decide to take the plunge, at least do it with the MST3K crew by your side and laughing all the way (even then you might not make it to the end of \"Manos\", I didn't).\n\nTechnically, in everyway, this is the Worst Movie Ever. Are there or have there been worse? Probably. Have any of them made it to distribution in theaters? Probably not. And yet, there have been movies I've seen that I've disliked much more than this. Don't see \"Manos\" looking for... well anything. You won't find it. Just expect to laugh until your gut hurts or your mind melts from the sheer crappiness."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "kpbutler",
        "review_rating": "1",
        "review_title": "A thorough crock of crap",
        "review_detailed_main": "This movie, if you want to call it that, is a completely horrible waste of film, lights, and other equipment. I saw this with my friends on the MST3K version, and even then, it was difficult to sit through all the garbage. The film features the unforgettable character of Torgo, who watches over the house while the master was away. We were trying to figure out why his legs were twice the size they should have been, and only thru IMDb were we able to discover that he was supposed to be a half goat/half man. I don't know what the point of the story was, nor do I care. The person who made the movie was a fertilizer salesman, which is fitting, cause it's a pile of manure."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "tomimt",
        "review_rating": "1",
        "review_title": "Hilariously bad",
        "review_detailed_main": "Manos: The Hands of Fate is one those movies, which you watch and think \"what the hell am I watching anyway?\".\n\nIt is widely known, that Manos is among the worst movies ever produced and even that is a bit of an understatement. Bascically what we have here, is a home movie, in which nothing works like you'd expect it to work. The narrative is jarring and odd, the actors are amateurish at best and the dubbed voice work is just hilariously awful.\n\nTo top things of, Manos is lazed with a bizarre fusion jazz sound track, which knock the movie in an entirely different ball park among bad movies.\n\nFor people, who like bad movies Manos is a must watch event. Everything that can be done wrong in a movie has been made wrong in it. And even then some."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "JRGBUCS",
        "review_rating": "1",
        "review_title": "You know, this movie has a few flaws...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Ashman711711",
        "review_rating": "1",
        "review_title": "Truly Worst Movie EVER!!!!",
        "review_detailed_main": "This is in case you've read all other reviews and are still thinking about watching the horror that is Manos the Hand of Fate, the first thing that should warn you is the title. Manos means hands!!!! it's Hands: the hands of Fate! Oh still don't believe me?\n\nBad sound, the scenery so droll, a main character making stupid decisions, a \"menacing\" painting more shots of the droll scenery, too much focus on the dog and painting, an annoying little kid. Manos himself for some reason looked like what the pringles logo mustache guy would look like if he came to life and was an evil porn star.\n\nThe only redeeming quality of this flick is Torgo, oh my god where do we even start? the character playing him was rumored to be blitzed out to Pluto on acid while shooting and man does it show. I warn you, if you've little patience for really really really bad movies, you may want to skip this, or at the least watch the MST3K version. I has to suffer through the undiluted pure evil which is Manos I think those of us who've watched it should get a T shirt reading: I watched Manos: the Hand of Fate and all I got was this T shirt."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "NachoDaddie",
        "review_rating": "",
        "review_title": "High Cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "matt-n-ay",
        "review_rating": "1",
        "review_title": "Visual Torture",
        "review_detailed_main": "Many reviews have made this point, but this movie ranks as perhaps the worst movie ever made in the history of the universe. Many buffs rank Ed Wood's \"Plan 9 From Outer Space\" as the \"worst of all time\". Not even close. \"Plan 9\" is \"Citizen Kane\" compared to \"Manos\". It's \"Casablanca\" and \"Wizard of Oz\" rolled into one next to \"Manos\". But therein lies the wonder and the rub: Manos is so colossally awful that it transcends the notion of \"movie\" and takes on some sort of \"Platonic Perfect Form\" that defines \"bad movie\". Bless the actors and anyone else who collaborated on this abysmal piece of celluloid garbage, because it has provided us with MST3K's riff-rich snark that's as entertaining as the movie is horrible."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "crazyrabbits",
        "review_rating": "10",
        "review_title": "I take care of the place while the Master is away...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "films-22537",
        "review_rating": "6",
        "review_title": "Get your hands on this one 👇🏿",
        "review_detailed_main": "I've seen this movie 3 times and laughed hard each time I did. The first was on MST3K and the other times with rifftrax. With that said I can't image what it must be like to watch this inept film without a commentary track pointing out how ridiculous it is from a technical and content standpoint. An 8 with MST3K, a 10 with rifftrax and a 0 on its own for an overall 6."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Leofwine_draca",
        "review_rating": "2",
        "review_title": "Just dull",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "VanSnak",
        "review_rating": "1",
        "review_title": "Oh man, what a terrible movie....",
        "review_detailed_main": "I was first introduced to \"Manos\" as many of you were, thru MST3K and to this day my sister and I make jokes about the absolute wretchedness of this movie. The best part of the movie is the Torgo theme, brings tears to my eyes...that and Torgo's monstrously-sized knees...that's great....okay, so, Torgo. Torgo is incredible, give Torgo an Oscar...Yeah."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Cuth_jn",
        "review_rating": "1",
        "review_title": "BAD",
        "review_detailed_main": "This film is awful, i cant understand why people think it is good or defend it. I have only seen the mystery science version but I've seen enough. First off me and my friend thought it would be funny to watch this as it was in the IMDb bottom 10.\n\nWe watched it.\n\nIts is not funny, it is just so bad, I've seen some funny bad films, cyber tracker because they are bad but this is impossible to watch as it just makes you depressed.\n\nThroughout the film i was just so down and thinking why am i torturing myself by watching this.\n\nThe acting is utter crap, fair enough since none were even proper actors, there is no plot and none of the characters know why they are there or if a camera is pointing on them.\n\nI know the facts behind this film but i fail to understand how the hell anyone on the film thought it had the possibility to be good. Did they even read the script. Then again there probably wasn't one.\n\nAlso i fail to understand where and what the hell $19000 was spent on. Acting classes, location, more than 3 voices, a becamera that shoots for more than half a minute? After watching it i can assure you its none of them.\n\nBecause this movie is so bad one of the actors, the only one with a bit of talent (torgo) killed himself afterwards because its so bad.\n\nPlease understand that someone committing suicide because they are in a film tells you something.\n\nThis is film is BAD BAD BAD so spare yourselfs as it does not need to be watched and is Certainly NOT FUNNY.\n\nRIP Torgo"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "ofpsmith",
        "review_rating": "1",
        "review_title": "The absolute worst film in existence!",
        "review_detailed_main": "This is filth. Thank the Lord that none of the people involved in this, were ever involved in any other film. It's not just bad, it's horrific, it's a disgrace. You are probably reading this thinking i'm trying to be funny, but i'm serious. It's that bad. What is so bad about it? It's incredibly boring for one thing. When it's not it's just wasting time badly developing characters that are weird, stupid, naive, ignorant, useless, creepy, and boring. I'm not even sure I get it. This is my first review without spoilers because this completely fails in telling a story correctly. It also makes no sense; it never explains anything! And there are also shots that go on for way longer than they need to. It would have been more enjoyable if the movie was just a bunch of random pictures thrown together. But instead it's just boring nonsense. I felt like the film was so dumb that I got dumber watching this. Avoid this film at all costs!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "The Buried Life",
        "review_rating": "1",
        "review_title": "Torgo!",
        "review_detailed_main": "I just bought the MST3K tape of this episode, and I must say, it lives up to its reputation. While it may not be the worst movie ever, there probably isn't many seated much higher...\n\nIt's production is bad, but the dubbing is just horendous. Torgo sounds like he talks through a broken Speak-and-Spell! Also, the wildly meandering plot is deadly. It's one thing to have some subtlety to a movie, but hen a movie resorts to the actors just starring at each other for long periods of time, that's just too much...."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Bobbynyc",
        "review_rating": "1",
        "review_title": "Oh My god",
        "review_detailed_main": "I first saw this film very late (3 am) on some cable channel (sans the bots)I flicked onto it about 1/2 way - when the Wives start to fight. It was awful, it was a train wreck I couldn't turn away. I never caught the name of the film (they never said I'm not sure why) but I knew, down to my bones, that I was watching one of the worst things I had ever seen (and even then that was saying something). By the end of the movie, it was all I could do to drag myself to bed. Had I read The heart of darkness then I would have been saying \"the horror, the horror\" years passed and MST3K arrived. In all innocence I picked up the VHS of Manos since they said it was the worst film they ever did - popped it in the player and then realized Oh my god it's THAT FILM! The horror, the horror."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "azderoth",
        "review_rating": "1",
        "review_title": "The Weird, Static, Horror Movie As Comedy",
        "review_detailed_main": "I feel a little conflicted here. Manos is utter trash. It is ineptly made, badly acted, horribly scripted (scripted ?). If I could I'd give the movie two ratings, one--1--from what my logic and better sense tells me (it's crap), and another rating--say around 6 or 7--simply because I was entertained, I would.\n\nThere are things I find frustrating, yet humorous about Manos: How all the actors seem to wait a full minute or two before saying their lines, as if waiting for some cue; the odd repetition of dialog like something out of the nightmares of Samuel Beckett (but done unintentionally, it seems); the sheer lack of anything resembling narrative consistency or internal logic.\n\nMake no mistake, this is a bad, bad, movie. But some movie masochists out there may find this entertaining. Hell, at least it's more creative than Bloodrayne."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "bellino-angelo2014",
        "review_rating": "1",
        "review_title": "Even the words atrocious and painful can't describe it",
        "review_detailed_main": "Before you think of me that I am a masochist I'll explain what bought me to this movie. It's on the top of IMDB's Bottom 100, many name it as ''the worst movie of all time'', and it was even riffed on MST3K by Joel and the Bots. And yes, it's horrible as everyone said. And not in the sense ''so bad it's so funny''. NO!!! This movie is so poorly made that is a chore to watch it until the end.\n\nThe plot, if anyone cares, is about a family that gets lost in the desert and end in a home that at night becomes a underground devil-worshiping cult, led by the Master and the caretaker Torgo. And horrid things start; Torgo likes the woman of the family, the Master's wives start bickering, and Torgo gets killed just by burnign his hand (!!!)\n\n''Manos The Hands of Fate'' is a movie that caused me pain watching it. The other time I felt ill watching a movie and it was fault of the movie was when I watched the FRED movies with Lucas Cruickshank. And everything in the movie is very hideous: the filming is sloppy and some scenes seemed lasting an eternity! The music... ughh. It was very creepy, monotonous, badly made and disturbing. And the acting is the worst I ever saw in a B-movie, I mean, worst than the other movies featured on MST3K. Hey, they look like Oscar-worthy movies compared to this! And the script was written in a room full of mandrills.\n\nSo, inept and horrid in every way you look at it. I recommend this movie to NOBODY. Neither humans, dogs, pigeons, baboons or parrots - NOBODY! Even them would find the movie very painful to watch."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "rgutier2",
        "review_rating": "10",
        "review_title": "Yes, I'm from \"El Paso\"",
        "review_detailed_main": "Browsing through IMDB.com's worst movies and not sure exactly how fate put me in line with this gem. Interestingly enough, I was telling a good musician friend of mine about the movie, which came out the year I was born. I asked him if he knew anything about it. He sheepishly bowed his head and answered \"I'm the one playing guitar in the soundtrack\"\n\nI couldn't stop laughing. It's a shame, if not obvious, that none of the cast did anything even remotely notable after this hit the market. I do want to say at least mostly all the musicians involved are now successful professionals playing all over the country and professors in universities. I promised not to name any names. To them my deep felt sympathies for being involved in this project, and also look on the bright side-at least it wasn't a porn loop you'd rather forget."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "ahodde",
        "review_rating": "1",
        "review_title": "Astounding, for all the wrong reasons !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "xavierr",
        "review_rating": "1",
        "review_title": "I underestimated this film, whens IMDB going to put 0 as a choice?",
        "review_detailed_main": "Amazing, this truly is terrible. Sort of one of those movies that you just have to see to believe. Absolutely awful, however I would rate Escape from LA, Batman and Robin and any of the two Shaq movies worse because they actually had a budget higher than 50 dollars."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Sarteshi",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Oh, bad. Terrible. It was . . . bad, just . . . no words to say . . . bad. So bad. So bad I can't even . . . so bad . . . can't form sentences . . . bad . . . It's just that . . . there's nothing . . . a void . . . a bad, bad void"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "TheBrigadier",
        "review_rating": "3",
        "review_title": "Could be good if redone without the unrivaled low production",
        "review_detailed_main": "Not the worst movie ever made but almost certainly a contender for worst production value. I can complain about how bad the film is but that seems fairly pointless since about 1000 people have already beaten me to it and while many of their gripes are unreasonable Manos doesn't deserve to be dubbed the worst film ever. Manos actually had a decent horror story to it and I think would have made a very good horror film but it suffered from an exceedingly low budget and abysmal production. The movie was an editing nightmare with such bad camera cuts it left me asking the question, what were they thinking? There were many other examples of what to avoid in film-making. There were long, tedious shots where virtually nothing occurred; superfluous panning of the open Texas range or simply watching characters stand silent for extended intervals as Torgo (very interesting character) hobbled around. But before I deal out unreserved criticism of this film, I make note of the fact that the technical aspect of its production was doomed to disarray due to the camera.\n\nAccording to IMDb, Manos was \"Filmed entirely with a hand-held camera that could only record thirty-two seconds of film at a time. The film was shot without sound.\" No wonder they had such a hard time editing it. It is for this reason that the film is an editing disaster. It would be nearly impossible to produce anything remotely well with such a technical handicap. From a more conceptual perspective, Manos is an interesting idea and the film had a spooky quality to it.\n\nLike another user stated, awarding only one star to a film should be reserved for only the most inane of cinema, the kind of film that leaves the viewer angry at the sheer stupidity of the project. If you want examples, modern film-making has generously provided them. Films devoid of intelligence; movies made on large budgets, solely for monetary gain, generally just to capitalize off of some pop singer or pop culture icon (Paris Hilton for example) truly deserve the ridicule . Mano isn't a terrible concept, just an example of how technical barriers can cripple production."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "innocuous",
        "review_rating": "1",
        "review_title": "Many people apparently don't understand what BAD is.",
        "review_detailed_main": "I've watched MTHOF both with and without the comments of Joel and the MST3K crew. It was agonizing both times. When I look at the IMDb list of the worst movies, I simply cannot explain how ANY movies could be rated worse than MTHOF, especially movies like \"Justin and Kelly\" which, though an abominable movie starring two nonentities, actually had production values, a budget, and some sort of direction. It's obvious that some of the reviewers are picking on certain movies because the plot was ludicrous, or the direction was incompetent, or they hate the stars.\n\nMTHOF, on the other hand, is the clear winner (loser?) by virtue of being awful in every possible category. This isn't a movie that failed to live up to its potential, or cast the wrong actors. No, this is a movie that shows what happens when absolutely no talent is available at any level.\n\nIt is a chore to force yourself to watch this movie, but I think that all those reviewers who were apparently horrified by \"Justin and Kelly\" need to take the time to see what a really bad movie is. But, do yourselves a favor and watch the MST3K version...at least you won't be as tempted to just give up partway through the movie."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "aubreysparrow",
        "review_rating": "1",
        "review_title": "Without a doubt, poison to the art of a motion picture",
        "review_detailed_main": "Now, i'm not gonna go off and give this movie a cold review. I'm gonna go through all the motion picture arts, and see how \"Manos\" - The Hands of Fate adds up Acting -- Horrible. The best actor in this movie is probably Torgo, and thats not saying much. IT sounds like their yelling at you. Their unnatural, emotional depiction, looks, everything dreadful. To give you an example of how bad it is, take Tom Hanks, Johnny Depp, Russell Crowe, and Jack Nicholson, and think the COMPLETE opposite.\n\nArt Direction -- Not much to say here. They used an existing house, and the stayed in basically two rooms the whole time, so there isn't enough room to talk about how bad it was.\n\nCinematography -- Ghastly. The angles in the ten minute car ride, showing the Masters picture 5 times in 30 seconds, while the picture is at the other end of the screen, it really makes me wonder how it can be that bad.\n\nDirecting -- Hollow. Maybe the reason was because the director really was tied to a tree the whole time Editing -- I can't decide whether it was done with cut and paste, or a hammer and chisel Music (Score) -- They used the wrong music at the wrong time Music (Song) -- \"Row Row Row Your Boat.\" Very bad singing Sound Editing -- Most of the duologue was dubbed. They did a very bad job at it. Their lips would start moving and two seconds later you would hear them talk. Mixing that with the music, it was very poorly done.\n\nWriting -- Not bad. When I heard of the plot, I was attracted to it, so I bought the movie. If all of the above would of been changed, this script would of made a good movie.\n\nOverall picture quality, just bad. I guess i this is the movie to see if you have ever been sitting around at home, and your wondering what kind of film a fertilizer salesman from El Paso, Texas would make. I thought i could put up with it, but I starting clawing at my face when the movie was finished, only taking breaks to kick myself in the head.\n\nI can say with true confidence that this is the worst movie ever made"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Quinoa1984",
        "review_rating": "1",
        "review_title": "If you don't watch the film with the Mystery Science Theater 3000 commentary, you'll end up making your own...",
        "review_detailed_main": "'Manos' The Hands of Fate attempted something very few filmmakers have ever done before, and un-intentionally no less- this film goes below expectations, but not just any ordinary expectations. I knew right from the get go this would be a bad movie from the reputation it's garnered here on IMDb. However this takes the cake. It ends up being more embarrassing, more horrendous, and more offensive than anything cooked up from the Ed Wood school of low-budget, horror movie-making. On top of every performance (even John Reynolds' Torgo, who does pull off that insane servant look, despite no voice to match) stinking to high heaven, every single bit of craftsmanship takes everything that was set up in the cinema world right out the window.\n\nThe good news for people who wish to see it out of sheer curiosity is that it's now available from the Mystery Science Theater 3000 people (as it has been for ten years, one of it's most infamous specials). Their commentary is a plus, and just when you think it can't get any worse, it gets funny by way of them. It's hard to heckle a film. This is the prime exception. All the music, the camera shots (though, giving the benefit of the doubt, it's all shot with one camera getting 30 seconds at a time with no sound attached on location), the atmosphere, the flimsier-than-ripped-flip-flops storyline, it sets a standard that few movies can go to. Maybe that's its most impressive feat, that it takes itself so seriously as a legitimate, circa mid 60's B horror film, that it's fun just to watch and experience the depths it goes to. F+"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "ForTommy2Lookie",
        "review_rating": "3",
        "review_title": "It's impossible to credit Manos as the worst movie ever",
        "review_detailed_main": "And here's why. YES, this movie was horribly acted. YES, the quality, editing, directing, writing, storying line, meaningless subplots were terrible.\n\nBut understand. This was a small group of no name people with a cheap camera who took a stab at a film with a very limited budget. If anything, (even though the film sucks) I applaud them.\n\nON THE OTHER HAND (no pun intended), take a movie like Battlefield Earth. There's others, but this one get's my vote for worst film ever. There's a fine difference between Manos and Battlefield Earth. Think of the concept behind this. FIRST, some nit-wit (we know who) wrote Battlefield Earth. THEN it had to be pitched to an agent. Agents takes the project on, THEN it needed to be pitched to a producer(s), THEN the producer needed to package it with big name actors and take it to the studio. THEN the studio has to green-light the damn thing. Then a bunch of Hollywood idiots invested MILLIONS with the anticipation that the film will be a success. Hal Warren and his little Manos film shouldn't even be ranked in a worst category, simply because it didn't take much of a budget and no one was destroyed (except maybe Warren's ego.) But I do agree, this movie was bad. It reminded me of a bunch of barn animals running around just bumping into each other."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "huemannus",
        "review_rating": "9",
        "review_title": "Manos vs Torgo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "raindeerbear",
        "review_rating": "1",
        "review_title": "Watching this movie made my brain bleed.",
        "review_detailed_main": "There is not real way to describe how much this movie inflicts physical pain.\n\nI first saw Manos on Mystery Science Theater 3000. After forcing myself to finish it, wondering if\n\nthis was for real, I realized something very important.\n\nMy brain had stopped working.\n\nIn all honesty, however, I was bothered for weeks afterward. Wondering how someone could create something so atrocious.\n\nEither way, if you wish to see your brain fall from your skull whilst screaming in pain, this is the movie for you.\n\nIn all other cases, stay away if you value your LIFE!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "dougdoepke",
        "review_rating": "",
        "review_title": "Brain Dead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "slokes",
        "review_rating": "1",
        "review_title": "If There's A Worse Film, I Don't Wanna Know",
        "review_detailed_main": "\"'Manos': The Hands Of Fate\" is bad, bad, bad. This is perhaps the ugliest film of the 1960s, and I'm counting Zapruder. The only way you can truly appreciate the badness of \"Manos\" is by seeing it, but that's like my recommending you go and get scarred for life.\n\nI guess there are those who will object I really didn't see \"Manos.\" I saw the Mystery Science Theater version with some bits cut out. But that's like saying I really didn't see \"Sideways\" because I went out at one point and got popcorn. It's hard to ignore that what's on the screen is bad, not because there's silhouettes of a guy and a couple of robots making fun of it but because of the sheer, relentless amateurishness of the film. Out-of-focus shots, long pointless silent scenes, women wrestling in togas, moths bumping into the lighting, and a stupid two-set horror play with a depressing ending. What's wrong with having someone talk over that? Would you deny morphine to a gunshot victim?\n\nThe only things I thought okay were the music, which was pretty fair dinner jazz, and the actress playing the young wife, who couldn't act but was beautiful to look at. Also, there's a bit where the Master's half-dozen wives awake from their ageless slumber and start to talking all at once. The camera cuts to the Master, and I'll give the director the benefit of the doubt and assume that look of put-upon henpeckitude on his face was intentional comedy. But there is nothing else worth discussing here.\n\nA lot of times, bad films are fun to watch because they are so supremely silly and full-of-themselves they become perversely entertaining. \"Manos\" is just harsh and ugly. Joel Hodgson, the MST3K ringleader, says at one point: \"Every frame looks like the last known photograph,\" and it's true. What's on screen are talentless people who are obviously miserable about what they are doing. Poor Torgo went and killed himself shortly after completing his role, and he may not have been the only one according to the info on this site. It's painfully to watch films like this and feel like you are a party to someone's endless torment.\n\nSo I maintain watching this with MST3K is not only preferable but necessary. As the little girl in this movie said later to interviewer Richard Brandt, \"without their commentary, it would be painful to watch.\" Well, hold up there, sweetiepie. Let's just say \"more painful.\""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "zpadovani",
        "review_rating": "1",
        "review_title": "Honestly, the worst movie ever made.",
        "review_detailed_main": "I've seen the vast majority of the bottom 100 movies, as well as many other horrible flicks that were not on the list and I can honestly say that this is the worst. Horrendous production qualities, terrible repetitive dialog, at times completely incoherent, and 90% of the film serving no purpose to the primary plot... it was really a labor to sit through. There were times I actually cried from the pain of watching it and others I considered hanging myself because I could not possibly bare the thought of living in a world where this film existed. I would have trouble forcing even my most hated enemy to watch this movie. It is really, really, really bad.\n\nDid I mention they dubbed over the entire thing? Well, apparently the camera they used had no audio, so some of the worst dubbing I have ever heard was employed with a bland repetitive soundtrack commensurate with Chinese water torture.\n\nBasically, if someone says \"Hey, let's watch Manos, the Hands of Fate\" think of it as them saying \"Hey, let's go castrate ourselves with a piece of steel wool and some elbow grease.\""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "deacon_blues-88632",
        "review_rating": "1",
        "review_title": "Amazingly bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Antithesys",
        "review_rating": "1",
        "review_title": "Failure",
        "review_detailed_main": "The worst, worst, worst, worst, worst movie ever made. Absolutely appalling. It's excruciatingly painful to watch. I've seen quite a few MST episodes, and many more stinkers besides that. Manos leaves them all in the dust. What a piece of dung. Plan 9 would win an Oscar compared to this trash. It really has to be seen to be believed, but you must do so at your own risk, and be sure to use Joel and the 'bots as a shield...I pity the poor souls that have been subjected to Manos in its full glory. MST can't even make it funny, it's beyond laughable. It's disturbingly awful. I wish I knew some more disparaging terms, I feel I'm letting it off easy. In case you haven't noticed, I did not like Manos, the Hands of Fate."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "xredgarnetx",
        "review_rating": "1",
        "review_title": "The absolute worst",
        "review_detailed_main": "MANOS is without a doubt the worst movie I have ever seen, and I've seen them all -- AXE 'EM, PLAN 9, THE ITEM, etc. In fact, MANOS makes a so-called film like AXE 'EM look like a Shakespearean masterpiece. This goes beyond the worst drive-in fodder imaginable. For a lot of the running time, a gimpy-looking weasel with a droopy mustache stands around in a black cape with red hands painted on it. I was hoping he was trying to conjure up the Ghoulies, but no such luck. There isn't a monster or special effect to be had. I tried desperately to stay awake, but ended up dozing on and off throughout. When six slave babes in floor-length nightgowns finally got down to a hair-pulling cat fight in a sand box, I was hoping to see some T&A. Unfortunately, they were wearing giant bras and even larger, old-lady panties under their nightgowns. Steer clear of this one, even in the MST3K version. No amount of joking at the expense of this waste of celluloid helps."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "shane-knights",
        "review_rating": "1",
        "review_title": "THE HORROR!!!! THE HORROR!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "iotravel",
        "review_rating": "1",
        "review_title": "This film made me feel bored, physically sick and uneasy all at once",
        "review_detailed_main": "It's not scary at all, it's just weird and oh so dull, dull, dull, and goes on forever. The music is awful, the dubbing atrocious, the editing is the worst. Even watching it with the Rifftrax soundtrack, I gave up half way through because I felt sick watching it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "mediocrates",
        "review_rating": "10",
        "review_title": "Not the worst movie ever made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Tweetienator",
        "review_rating": "1",
        "review_title": "Nerve Munching Beast",
        "review_detailed_main": "A fine candidate if you - like me - sometimes reserve a special weekend where the only rule is that everything on the screen must be of superb badness only. It hardens your soul and makes your nerves stronger, sometimes you will even get a third eye, and if you look hard enough and are not stupefied by Manos: The Hands of Fate you will find even some dimly glowing moments of entertainment."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "dtb",
        "review_rating": "",
        "review_title": "Only MST3K Makes It Watchable!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "One of the worst movies ever made.",
        "review_detailed_main": "In the pantheon of bad movies there have always been two that have been vying for the title of the \"Worst Movie Ever Made\". Those two are \"Troll 2\" and \"Manos: The Hands of Fate\". Well I'm here to tell you that whole \"Troll 2\" is bad in every sense of the word it is at least enjoyably bad. The same thing can't be said for this travesty. Sure you can get together with a group of friends and riff the hell out of it, but you can't really say that you enjoyed watching it.\n\nThis movie was the brainchild of a fertilizer salesman who made the film on a bet. He used a wind up camera that could only record 32 seconds of film at a time meaning that no scene lasts longer than that. There were also no microphones meaning that everything had to be recorded in post. Add to that nobody involved in the entire process knew anything about acting or film production. The result was a hot mess of a movie that honestly doesn't make any sense.\n\nA family is driving in the desert on vacation and wind up at a compound where the father decides this is the hotel they've booked at. Why? It's the only thing around for miles so it must be the place. There, to greet them, is Torgo. He's a strange little man with huge knees who seems to have trouble walking. Torgo takes a liking to the mother. Stuff happens which is mostly forgettable and we find out the owner of the place is this weird dude with a harem of mind controlled women and he wants the mother and her young daughter to join his harem. There's some badly choreographed fights, one of the women in the harem dies from a light slap and like in the song \"Hotel California\", the family never leaves.\n\nThe only actor to get anything out of it was the young girl that played the daughter. She got a bicycle out of it. The rest were supposed to get a share of the profits. But since it was shown in only one theater and people hated it, nobody got anything. The actor playing Torgo died before the movie came out from a drug overdose. Some say that it was partially due to the leg prothetics he wore. he was supposed to be a satyr but either the devices they designed for him didn't work or he wore them wrong and they caused him extreme pain.\n\nThis really only should be watched out of sheer curiosity or masochism because there is no way to enjoy it. Even if you say you like bad movies, this is honestly too bad even for that."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "MethodSilk",
        "review_rating": "1",
        "review_title": "Horrid piece of trash.",
        "review_detailed_main": "This wasn't as much a movie as a documentary on how to not to make a movie. Of course like all forms of art it is open to personal opinion. Well here's mine without any fancy movie critic terms. No breakdown of scene analysis, no comments on inspiration. This movie sucks so hard, bowling balls through garden hoses would be no problem. This is the kind of movie a \"sedated\" mind couldn't enjoy. MST3K couldn't save this movie so don't even bother with that version. The bots seemed as dumbfounded as I was, neither of us said much as we seemingly \"survived\" this movie."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Speechless",
        "review_rating": "1",
        "review_title": "So bad it achieves a kind of grandeur...",
        "review_detailed_main": "As I write this, there are already 143 previously existing comments for this film, and nearly every one of them mentions MST3K at some point. That's the irony of MST3K-- if not for Crow and Servo and Joel and Mike, no one would ever see or even hear of movies like Manos. It isn't lovable garbage, like the often-referenced Plan 9 from Outer Space, that you can watch with friends and laugh until your face hurts. It's painful garbage, the kind of movie where you chuckle a little towards the beginning but after a while it stops being funny. Is it the worst movie ever made, as is often claimed? I personally don't think so. It probably was the worst film that MST3K managed to obtain (and that episode, which actually makes something good out of this film, is some kind of comic masterpiece), but MST3K was by no means comprehensive. Remember, they weren't allowed to show anything with any real level of violence or sexual content, so there are lots of sneaky movies out there ruining lives because they don't have the reputation that MST3K grants. And I guess calling something \"the worst movie ever made\" is just a matter of personal sensibilities-- Manos is really boring, but there are movies that go far enough beyond the limits of bad taste to make me feel sad and angry and hopeless, like Necronomicon: Book of the Dead, Sword for Truth, Eaten Alive, Igor and the Lunatics, Knightriders, and even the illogically popular and overrated Dawn of the Dead. Manos is a complete waste of time, but there are movies out there that are bad enough, in terms of both craft and content, to make you want to kill them. And I personally don't think Manos goes that far. You can make up your own mind, though, if you're ever unfortunate enough to see it."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Boba_Fett1138",
        "review_rating": "1",
        "review_title": "What was that?",
        "review_detailed_main": "Never has a movie been so dumb, silly, bad, ugly, awful at the same time. Is \"Manos, the Hands of Fate\" really that bad as everyone says it is? Yes, it is and maybe even worse.\n\nWhat makes \"Manos, the Hands of Fate\" a bad movie is that it was made with no talent or imagination, quite sad to watch really. I don't know what is the worst; The acting, the script, the sets, the editing. The most likely answer is that it's all just simply plain bad. Especially the editing is the worst I have ever seen. Some scene's seem to be endless while nothing is shown at it at all and most of the time they don't even have anything to do with the movie. The movie is full with this long endless shots that are really about nothing, very boring to say the least.\n\nThe story is just laughable bad, if you asked me what it is about I think I can not even explain it. It's just about nothing and lot's of it makes no sense at all. It feels like someone is poking you in the brains with a stick. The movie is full with silly moments that makes you think; What the **** is that?\n\nThe actors are by far some of the worst ever. They show absolutely no talent or what so ever.\n\nThen we come to the only good thing about the movie: Torgo. Oh boy what a character! I doubt it was intentional but this guy is absolutely hilarious with his strange ticks and movements. He alone makes this movie still watchable. He is a real classic.\n\nI also must admit that I liked the ending a lot. I even found it surprising and shocking but a good ending can't save a bad movie.\n\nCongratulations Hal Warren, you created one of the very worst movies of all time, you make an Ed Wood movie seem like a masterpiece.\n\nA must see for bad movie lovers.\n\n1/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Z-GradeGuy",
        "review_rating": "1",
        "review_title": "Potentially the worst movie I've ever seen",
        "review_detailed_main": "Even with the commentary from the Mystery Science Theater 3000 episode going for it, the true awfulness of this movie seeps out the edges. I believe I may very well die if I watch it alone, as it is, without Joel and the 'bots keeping me company. this stupid, insanely low-budget and zero-scare movie is one big excuse for a scene in which scantily-clad women fight each other."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "theblooms1",
        "review_rating": "1",
        "review_title": "One word sums up this movie...",
        "review_detailed_main": "Painful. Period. This movie is so bad it is painful to watch. If the MST3K guys weren't cracking on it, I would have turned it off after the first \"scene.\" Just Painful."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "lee_eisenberg",
        "review_rating": "1",
        "review_title": "hands of fate, brains of idiocy",
        "review_detailed_main": "\"'Manos' the Hands of Fate\" is another grade-Z litany of worthlessness. A family is on vacation and drives up to what looks like an abandoned hotel run by semi-hunchback Torgo, who can't stop talking about his \"master\". When we finally meet the master, he turns out to be the Devil's servant, and he's got evil plans for the family. How many times have we seen this kind of story?! Fortunately, \"MST3K\" saved the movie. Mike, Servo and Crow really liked the scene where the master's scantily clad wives were having a fistfight (there weren't really any other memorable scenes in the movie). On it's own, \"MTHOF\" is a total zero, but the \"MST3K\" version is a 10/10."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "MaskedMarauder",
        "review_rating": "10",
        "review_title": "There are few pleasures like it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "sol1218",
        "review_rating": "3",
        "review_title": "Had to struggle to stay awake watching this movie",
        "review_detailed_main": "****SPOILERS**** Embarrassingly bad movie about a lost couple, Michael & Margaret, and their little girl Debbie ending up in this creepy house with an even creepier care-taker Torgo. Torgo to his credit told the couple to stay away from the house because his Master don't want anyone there. But Michael and Margaret just ignored him and made themselves at home and even had Torgo help them move in.\n\nTorgo looked like he was recovering from a really bad LSD trip and when you saw him walk he would sway from side to side with his legs looking like they were suffering from a very severe case of elephantiasis. The Master, who has a striking resemblance to Frank Zappa, was at the time asleep, in a zombie-like trance, in his tomb with his six wives located somewhere outside the house.\n\nTorgo was very angry at the Master for having six wives while he had none and had his eye on the nice looking Margaret for his future mate. We see Torgo later trying to grope Margaret but his actions are so weird that it really looks like he just wanted to hold on to her in order for him not to lose his balance and fall on his face ending up breaking his head.\n\nWhen the Master finally awakes he finds Torgo out cold as if he were a corpse and after bringing him back to life he berates him for letting the strangers into his home. The Master also accuses Torgo of fooling around with his wives while he, as well as they, was asleep in the tomb.\n\nLater that night the Master gets the whole crazy crew together and the wives become enraged over Torgo letting Michael and the two women, Margaret and her little daughter Debbie into the house and want to have them all killed. But the Master's first wife only wants to have Michael killed and have the women, especially little Debbie, left alive. A fight breaks out between the wives over who should live and who should die of the three strangers but the Master settles to only kill Torgo for letting them in the house in the first place.\n\nHaving Torgo tied down the Master then orders his wives to beat him to death. But it looks more like they were giving Torgo a total body massages instead of beating him and Torgo looked like he was really enjoying all of it. The Master then has Torgo's left hand blown off by touching some magic staff that he has and we then see Torgo, minus his left hand, running into the darkness never to be seen again in the movie.\n\nHaving his #1 wife tied to a poll for talking back to him the Master then proceeds to beat her to death. But the beating, like the one that Torgo got from the Master's wives,looked so harmless and phony that his wife must have died from laughing herself to death instead of the beating that the Master gave her.\n\nMeanwhile back at the house Michael and Margaret and little Debbie make a run for freedom in he dark desert but are caught by the Master and his wives before they get too far away. The movie ends with Michael replacing Torgo as the Master's care-taker and both Margaret and Debbie becoming his two new wives replacing wife #1; Or let's just say two for the price of one if thats what it all meant?\n\nWhat can be said about this movie that hasn't been said already. The two things I can add of what I noticed about \"Manos the hands of fate\" is that it was shot in color which was rare for a super low-budget, $20,000.00, film like it was back in 1966. As for the syrupy soundtrack it sounded like a music for a romantic or love story type film not the horrible horror movie that \"Manos\" was and is."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "CSM126-1",
        "review_rating": "1",
        "review_title": "\"Manos\" The Hands of Fate: \"There is no escape!\"",
        "review_detailed_main": "There is no denying it: '\"Manos\" The Hands of Fate' is a terrible, terrible film. With, seemingly no plot, and some of the worst acting ever caught on film, '\"Manos\"' is an incomprehensible mess. It doesn't help that it was filmed on a silent-film camera and that the voices were dubbed in by a team of only three voice actors. Add the inept direction of Hal P. Warren, and '\"Manos\"' hits excruciating levels of awfulness. But I'll be damned if I couldn't take my eyes off it for a single second.\n\nStarring Torgo, a strange grounds keeper, '\"Manos\"' is supposed to be a horror film about a satanic cult. Hal Warren lets us know Torgo is evil by giving him a near-crippling knee deformity. OOOOHHH...SCARY. Torgo mumbles and stutters incoherently about his master, who wouldn't like having guests at their one-room motel. Mike, Maggie, and their daughter Debbie wind up said motel and then...basically nothing happens for the rest of the film. The plot moves so slowly and laboriously that it's better to just sit back and watch without thinking. At all. By doing this, I managed to make it through this awful movie and find out the \"mysterious\" ending, which I genuinely can not understand. Maybe it's better that way.\n\nThe problems with '\"Manos\"' are numerous. Warren couldn't frame a shot to save his life, the actors couldn't act if you put a gun to their head, and the sets are cheap and poorly made. The film begins with an endless driving sequence, which was supposed to be the opening credit sequence. However they forgot to add the credits, so we're left with ten minutes of nothing. The two policemen in the film spend all their time hunting down a teenage couple who like to make out on the side of the road, and when the cops do investigate Torgo's motel, they do so by walking two steps in each direction. The dubbing is off. WAY off. And I do believe this is the film that originated \"Hey! I can see the zipper on his back!\"\n\n'\"Manos\"' has gained a cult following thanks to a spectacular episode of Mystery Science Theater 3000. Joel, Crow, and Servo provide their trademark witty remarks throughout, and also take time to remind us that we are indeed watching '\"Manos\" The Hands of Fate'. They can't believe they have to watch this, of all films, and neither can their tormentors, Frank and Dr. Forrester (and they picked the damn thing!). It's amazing that such a terrible film could turn out what some consider the greatest episode of MST3K.\n\nSo, why did I give '\"Manos\"' a point? Because it's fascinatingly bad, and provides an important lesson in how not to make a film. This movie is so bad, that it warrants serious studying, just to find out why it wound up so bad. The documentary \"Hotel Torgo\" should provide some answers, and I hope to get the chance to see it.\n\nShould you see '\"Manos\"'? Yes, but only the MST3K version.\n\nThe Master commands you!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "blackmage6502",
        "review_rating": "1",
        "review_title": "SUCK-O-RAMA",
        "review_detailed_main": "This thing is just absurd. When I first read Encyclopedia Obscura's review of this movie, I couldn't believe it was real; it was the DUMBEST plot I've ever heard of! Not the general evil-cult type thing; that could've worked. But when we get to the part about a satyr with a nerve disorder and the film showing you a portrait three times over just to make sure you figure it out, when you're watching IL' Torgo go scampering off on fire and not making a sound, you realize: The director was lacking basic brain function. A camera with no sound I can handle. That's basically what happens with animated movies, after all. But a movie where they have three people total on the voice-acting cast? A movie with no music at all? A movie with novice actors AND no post-production to remove their blunders? SUCKO, man. There's this one bit of the movie that I love: the bit when the family first enters the house where the wife is looking around, focuses her attention on the camera, rolls her eyes as she realizes she's not supposed to, then hurriedly looks away. Hehehe. This movie had on the floor for weeks. It's quite possibly the worst thing to come out of the movie industry. I'm not surprised four actors did themselves in after this; it's the cinematic equivalent of Hiroshima."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "cbrownjc",
        "review_rating": "1",
        "review_title": "\"Every frame looks like someone's last known photo . . .\"",
        "review_detailed_main": "Without a doubt, MANOS, THE HANDS OF FATE has to be the one movie that really enforces the credo of \"must be seen to be believed.\" You can *not* really describe this move, for words alone can not do it justice. MANOS is like a 200 car pile up on I95 that, no matter how hard you try, you simply can *not* turn away from. \"You can not even begin to conceptualize the horror\" that *is* MANOS unless it is watched . . . and yet, this is one movie that should not be watched by *anyone*! And anyone who watches this vile, sickening, inept, insipid, stomach-turning, bile-inducing piece of garbage WITHOUT the aid of MST3K is either a sadist, or deserves a Purple Heart. If you do, then my only advice would be to hunker down, and pray for daylight!\n\nThe plot? Well, um a family made up of incompetent dad, mom and little kid drive off for a vacation. They drive . . . and drive. And, did I mention that they drive? Well, they do. When they're done, (after the harrowing \"getting pulled over for a busted taillight\" scene), they proceed to keep driving. After about 20 minutes, they finally happen upon a run down shack in the middle of the desert, and a chap named Torgo, who \"takes care of the place while the master is away.\"\n\nAfter about another 30 minutes of nothing, the Frank Zappa/Bill Buckner \"Master\" guy wakes up, intent on . . . doing something . . . bad to them. His shear-nightie dressed wives begin to wrestle in the dirt for his affection. Poor sap Torgo is slapped around, had his hand burnt off, and then just sort of wanders away . . . right out of the movie.\n\nWill the family escape the horrors of this place? Will the wives decide to help the family or harm them? What about Peppy? (\"You never had a dog! I want you to stop this foolishness about a dog!\") And, really, more importantly, does anyone really care? I know I didn't.\n\nIf only Hal Warren had been as plucky, and prolific as Ed D. Wood and made more than one movie in his short, brief career. Compaired to this, PLANET 9 FROM OUTER SPACE looks like 2001: A SPACE ODYSSEY.\n\nAnd who knows what depths of wretchedness MANOS PART II: TORGO'S REVENGE might have sunk to?"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "jamesckelly1993",
        "review_rating": "1",
        "review_title": "Greatest comedy of all time!",
        "review_detailed_main": "IMDb and other movie websites have messed up, the genre of this movie is comedy, isn't it? Seriously, you can't expect me to believe that this is a horror movie.This really is a funny movie that everyone should check out. The parody in this movie is really great and clever. But honestly, why is this movie getting such low marks?! People don't understand the greatness of this movie, just really really funny. IF you're bored just try to find this movie classic. It's on Amazon and in 100 great horror Classics, why I don't know. But this is a seriously great comedy, everyone should see it. But I can't help but wonder, why is this movie posed as a horror movie? I mean that can't be serious, can it. There's no way that this is a horror movie, it's got to be a comedy. No way it can be a horror movie, can it?"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "ronevickers",
        "review_rating": "1",
        "review_title": "The absolute PITS!",
        "review_detailed_main": "Forget the rest of the contenders for the worst movie of all time - Manos: Hands of Fate wins hands down! To anyone who hasn't witnessed this abomination of a movie, you just don't know what you've missed until you actually experience it. If you can think of the worst film you've ever encountered, and then double, triple and quadruple the shock horror of that experience, then you are on the right track for this sad, sad effort. It really does have to be seen to be believed. Little wonder that none of the actors (using the term loosely) ever appeared in anything else on screen - they must have abandoned the thought of pursuing any acting career when they saw the finished article. However, following this enterprise, the only way they could have gone was upwards! To adequately describe the actual content of the film is virtually impossible, as it is simply an all-over horrendous experience. Had a group of pre-school children been handed a movie camera and a half hour of play, they'd produce something better than this! Avoid like the plague!!!!!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "frolixo",
        "review_rating": "1",
        "review_title": "The Curse of Manos The Hands Of Fate",
        "review_detailed_main": "Hal must have angered the Gods when making this tripe. The same year this was made, the actor who played Torgo committed suicide. Not convinced? The actress that played Marget also took her own life right after. Was it mere shame, or the Curse of Manos?"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Aaron1375",
        "review_rating": "1",
        "review_title": "Why was this movie made!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Internationalfilmandcinemacritic",
        "review_rating": "10",
        "review_title": "Cinema's most famous one hit wonder is a truly moving epic",
        "review_detailed_main": "Hal Warren's early departure from the film industry was perhaps the greatest loss of talent the world had ever seen. Manos: The Hands Of Fate quickly led him to fame, hailed as the equal of Kubrick and Tarkovsky by most critics. And yet, after his single film, he never again directed; instead focusing on his career in fertilizer sales. The film still stands up to modern scrutiny due to its brilliant plot and truly moving performances by all of its actors, especially Reynolds in his role as the tragic character of Torgo. One of the most significant influences on virtually all subsequent films, one can only imagine what masterpieces Warren could have created if he had only remained in the field."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "adaptor",
        "review_rating": "2",
        "review_title": "A turd in the rough?",
        "review_detailed_main": "What is a terrible turd of a movie is also a beautiful diamond when given the appropriate treatment by MST3K."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Manos: The Hands of Fate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "wbswetnam",
        "review_rating": "1",
        "review_title": "Traumatizingly bad",
        "review_detailed_main": "Never before have I given a rating of one star to a movie, until now. I'd give it a negative rating if I could. Never in my life have I seen such an awful movie, and I like to watch B movies on purpose. I thought Eegah and Monster-A-Go-Go were the worst, until this evening when I watched Manos the Hands of Fate.\n\nBasically, a family gets lost driving out in the desert Southwest and inadvertently happens across a group of devil worshipers. The twitchy Torgo greets them at the door and at first tries to discourage them from staying there, but the brainless husband overrules his wife's common sense and decides that they will stay.\n\nWhat is the worst aspect of this train wreck of a movie? Is it the improbable storyline? Is it the constantly jumping screen from incredibly bad editing? Is it the more-nerve-wracking-than-a-dentist's-drill musical accompaniment? Is it the horrible acting? Never, never in my life have I ever seen such cinematic sludge. This movie will kill more of your brain cells than a week-long binge on crack cocaine..."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "silentcheesedude",
        "review_rating": "1",
        "review_title": "So bad... you have to see it with your Hands!",
        "review_detailed_main": "After years of reading that Manos: The Hands of Fate is one of the worst movies that was destined to go to the very bottom of the annals of bad cinema, I finally rented it to catch the experience myself. How else was I to know how bad movies would get without watching what is called the ultimate in cheesiness? Well, Manos sure didn't disappoint. Or should I say, boy, it disappointed. I've seen many an Ed Wood movie, and I can say that even Mr. Wood himself seems like a master film maker next to the diseases that this movie is. Don't get me wrong, I mean that in a good way, really I do. There is nothing better then popping in the Mystery Science Theater version of this movie and hearing them poke fun at this movie. I laughed hard, and it made me think, what if? What if this movie was burned and never found... we would have lost a treasure! Watching the movie is a test in patience. It also ruins your intelligence and makes you feel that rather then watching a movie, you are watching a bunch o' hippies that are high and/or drunk sort of flow through an imaginary script. They should show this movie at a stress test, perhaps give you a passing grade, or a degree or something that states you've accomplished a feat that only a few can do.\n\nI can't even begin to tell you what scene would be the worst! Was it the loooong drive in the beginning, where nothing happens except driving set to some jazz music? The \"teens\" making out for days? The fact that the father is an idiot and led his family to all the craziness, amid the danger? The laughable audio that was dubbed in? The cat fights? Even the title of the movie, Manos, which means \"hands\" in Spanish, effectively makes this movie title \"Hands: The Hands of Fate\".\n\nWhat I can tell you is the best part of the movie: watching the \"Master\" come out with his robe and show off the big red hands stitched into it. That amused for about 4 seconds. All downhill from there. Actually, the whole movie was a downhill that kept going into the ground and never stops, winding up in some inner core lava.\n\nOne gets the feeling that perhaps some of the actors, like maybe Tom Neyman or John Reynolds would have better served their art with a better script. One also gets the feeling that each and every person associated with this that saw the script, or met the director, or even smelled the manure on him should be drawn and quartered. It seems, though, that the cast DID indeed see how bad this movie was going to be by making fun of it, as they started calling it \"Mangos: The Cans of Fruit\".\n\nSo, should you watch this movie? Oh yes, you must! ONLY if you rent the MST3000 version (I heard that an unedited version is now available, now THAT must be eye-gouging torture). It's good to see how bad a movie can get and still laugh at it. I give the movie a rating of 1, and the MST3000 version a 9!\n\nI was interested enough to try to find out as much information about this movie as I could when I found that a documentary called Hotel Torgo (2004) exists. There, they interview one of the last surviving members of the cast (I don't think they found any others that may still be alive) and even bring him to the location of the set, an old run down house in the middle of nowhere. It's worth a watch.\n\nA review of another film within a review? It can only happen with Manos: The Hands of Fate!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "igorhiller",
        "review_rating": "1",
        "review_title": "It's....well....you've gotta watch it to understand",
        "review_detailed_main": "I don't think there's much that I can say about this film that hasn't yet been said, but really it's just a fun waste of and hour or two. But make sure not to watch it alone, because your head might explode. Get the MST3K version (buy the essentials) and get some friends together and get ready to have a good time. I laughed until it hurt.\n\nA quick introduction to the movie if you haven't heard anything of it: A father, mother, and daughter (with their trusty poodle) are en route to some sort of lodge for vacation, when they are lost. They find a shack in the middle of nowhere, where a crazy guy named Torgo lets them stay but warns them of the master. I don't want to give any more away because something has to keep you going. Good Luck!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "jimgoebel1",
        "review_rating": "1",
        "review_title": "Bad, but I kinda enjoy it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "brianfitz-28481",
        "review_rating": "1",
        "review_title": "The worst movie i've ever seen",
        "review_detailed_main": "It was so bad, even Mystery Science Theater 3000 couldn't help it. I still talk about it. The only part I found memorable was an *extended* helicopter shot of the car driving past cornfields, and Crow (from MST3000) narrating, \"We drove on for what seemed like minutes.\" There, now you don't have to watch it!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "athies",
        "review_rating": "1",
        "review_title": "Unbelievable!",
        "review_detailed_main": "It is unbelievable that this movie has a higher rating than Hobgoblins. This movie apparently does not believe in jumping right into the action as the first twenty minutes is nothing more than voice lessons for the MST3K crew, as they can say nothing but \"Manos: Hands of Fate\". The first part of the film could have been made into a short entitled \"Stock Footage: How Far Can You Go\". There is a truly unique film technique used as one scene fades away to the exact same scene. The best scene is a pathetic mass fight scene between Manos's wives. And how could you comment on this movie without mentioning the king of husky sized pants, Torgo. I consider my life a failure for having seen this movie."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Amy_Ing",
        "review_rating": "2",
        "review_title": "2/10",
        "review_detailed_main": "With the help of MST3K, this is a pretty funny movie, funny enough to be rather enjoyable. Without MST3K, the production value of this movie is so bad that it's close to unwatchable."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "mrwelles",
        "review_rating": "10",
        "review_title": "Horribly wonderful",
        "review_detailed_main": "This film might very well be the worst film ever made, and is one of the all-time great entertainments. Not to be missed by any true film buff."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "lgkkpt",
        "review_rating": "1",
        "review_title": "Why this isn't #1 on the bottom 100 is beyond me.",
        "review_detailed_main": "I watched the MST3K version just to see how bad the worst movie ever could be. Could it really be that bad? Simply put, yes it is. Every aspect of this movie is horrible. Any present day filmmaker (professional or amateur) would have to work awfully hard to deliberately make a worse movie. The acting, dialog, sound, cinematography, plot, subplot, action, and music are all the worst I've ever seen. I'm a screen writing major and amateur filmmaker myself, so I've sat through a lot of movies. I was laughing hysterically (mostly at the MST3K's jokes) at how bad and horrendously this movie was put together.\n\nFor anyone out there making a movie of your own, and tormented with feelings of inadequacy or doubt at your own talents, I would advise you to watch this (the MST3K version first). Nothing you make could possibly be this bad. FYI: The regular version is available on DVD. I bought it cheap online to see if I can stand to view it.\n\nAnd as the movie's stupid, insulting ending finally faded out, I got up with an uneasy feeling in my body, knowing I'd never sit through a movie that bad as long as I shall live. I think I've made my point."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "jerrytubb",
        "review_rating": "2",
        "review_title": "so bad & ridiculous that it's a must see!",
        "review_detailed_main": "So bad & ridiculous that it's a must see! one of those \"we got lost in Texas\" films. in some ways precursor to Texas Chainsaw Massacre. One wonders if Toby Hooper had seen this film. The bright red hands robe costume it is actually pretty effective. the music is really strange as well. might've been fun to see at a drive in theater back in the day."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "GuyCC",
        "review_rating": "1",
        "review_title": "Wow. I mean... wow.",
        "review_detailed_main": "I saw this movie (as most people probably did) as a Mystery Science Theater 3000 show. The constant rips into the film by the Satellite of Love crew is the only way I would have been able to sit through this steaming pile of wonderment. The camera work, acing, pacing, ah, who am I kidding? The drive to the doomed hotel is torture alone.\n\nEverything was bad is this film. I think the people who made this movie were clinically dead creatively. While I support low-budget film, there is not one single clever, original or memorable moment in this film. At best the film borderlines on gratuitous exploitation.\n\nWait, I take that back.\n\nRedemption comes via the infamous \"Torgo theme\" with its monotonous 4-note theme is still a popular in-joke between my friends and I. I still wonder to this day why they never made a soundtrack to this movie.\n\nHate someone you know? Send them this movie. Only MST3K made this movie bearable enough to watch (I enjoyed the \"Manos\" reference in the MST3K movie. Classic)."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "parhat",
        "review_rating": "1",
        "review_title": "See it to Believe it",
        "review_detailed_main": "Many people told me Manos is the worse movie they have ever seen. I couldn't believe, so I had a chance to watch the movie. Well it is extremely bad. The movie isn't that long, but it feels like it lasts 3 hours. It feels that nearly 50% of the movie involves watching the mountains and trees along the road. The other part of the movie is the couple that seems to be in a kissing marathon for three straight days and had nothing to do with the movie except being pulled over by the police on several occasions. Now the women wrestling don't even look as believable and the story line and plot? What story line. How about the acting. Well their acting is a as perfect as a three year old reciting poetry in front of the class. It is that perfect. The entire cast of actors have a true talent of appearing to be a three year old acting ability. The most ridiculous part of the movie are that unusual fat legs that walks wobbly. Funny why this guy with a leg problem cares to help carry the luggage, he can't even walk! If you dare to watch the real Manos the Hands of Fate, you will fall dead. Please watch the MST3K version. Be warned, you will go into comatose."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "3_Beekman_Place",
        "review_rating": "1",
        "review_title": "I Have All The ANSWERS!!!",
        "review_detailed_main": "Well... not all the answers. I read in Entertainment Weekly last week all about this movie. Seems it started as a bet. Hal Warren thought directing a movie was easy. Anyone could do it. Hal Warren was given some money and the rest is history. Most of the people working on the film knew something was up. They all agreed to do it in return for shares of the profits. But in Producers fashion, the shares added up to 300%! In the end, the only casts members to be \"paid\" were the little girl (a bicycle) and the dog (50 lb bag of dog food). They knew they were in trouble, but were assured all the mistakes could be fixed in some magic editing room. Which ceased to be an option when the money started running out. There was a premiere which the casts went to.. all but Torgo, who committed suicide a few weeks earlier (not resulting from being in the movie). It was at the premiere the cast found out their voices were all dubbed! There was silence for about 15 minutes.. then some chuckles.. which evolved into out and out laughter! The producer and director didn't stay, and went to a bar. The place where it was filmed is still around and somewhat of a cult tourist attraction. The little girl remembers the guy who played Torgo as being the nicest, but others thought he was on acid the whole time!. The girl remembered the director as someone who yelled all the time and wasn't very nice. Say what you will about this movie.. it certainly has it's place in history, but people need to stop calling it \"genius\" or \"classic\". It's also wrong to compare it this to Ed Wood Jr. At least he had passion about what he was doing.. he thought he was making classics.. Manos: The Hands Of Fate was made on a bet!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "feodoric",
        "review_rating": "2",
        "review_title": "The artistic value of Manos...",
        "review_detailed_main": "I'm not kidding: watching this thing, if you can endure it without injuries (I did it the easiest way: I watched the Mystery Science Theatre 3000 version of it...), teaches you quite a few things. Ergo, it has \"value\", albeit in a very broad sense. More like a function, really. First, one can use it to calibrate one's rating scale. This is as close as a standard 1 as you'll ever get. I won't repeat all the previous comments about the movie: every reasonable or even average-minded person will agree on the absolute nullity of this full nadir in the history of cinema: so, it is very useful to set your scale to zero (that is, 1 by definition at IMDb). As a corollary, which may be construed as its second function, \"Manos...\" is thus the perfect universal ground zero on which every other movie suddenly takes a contour and perspective, including famous \"worst ever-s\" that abound in opinions that cluster around titles such as the inevitable \"Plan 9 from Outer Space\", which, thanks to Manos, gives a novel elegance to the Art of Ed Wood. Such an important role for Manos cannot be overestimated: force every IMDb under 18 to watch Manos (there are ways to check if they did their homework!!! 😂) and I'm sure we won't read reviews with that dreaded condemnation: this is the worst movie EVER! Anymore because everybody knows it's Manos.\n\nIn summary, we must thank Harold P. Warren for rallying all the critics around his Bizarro world masterpiece, where antiactors play antiroles with an antiscript and move along through a hostile environment of floating antimatter, risking dramatic annihilation at every antimoment until the very end, where they finally dissolve in a cosmic explosion when all that antimatter hits true matter, and the viewer reads the word DNE EHT on the last frame of Manos.\n\nWhat a great experience it was!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "sadrec1",
        "review_rating": "1",
        "review_title": "Manos, thou of primal darkness, mud-wrestling, and drug-addled easy listening jazz.",
        "review_detailed_main": "Behold, children, if you dare, Manos the Hands of Fate. The literal brainchild of star, director, writer, producer and crap-salesman Harold P. Warren, this is the Necronomicon of modern film; as you view it, your sanity is slowly nibbled away. It would seem given the experience of the crew, one shouldn't bash this film so badly. Wrong. A 10 year old could make a marginally better film than this stillborn brainchild of a fertilizer salesman. The characters and settings are so clichéd one of the only original things about this movie is it features a mini documentary of various bean fields and hills hosted by an Alto who sounds as if she's in extreme pain. Tor-goat seems like a bum they pulled out of the streets and slapped prosthetics onto. The \"wonderful\" subplot of him being a Satyr is killed by a deadly team of bad camera-work and sloppy writing. To those not in the know, he's just a creepy beard-man in serious need of more comfortable kneepads. He and the master's \"eerie\" presence is denoted by \"eerie-er\" free-style jazz that sounds like something Charlie parker threw up, Tito Puente cooked and Kenny G garnished and ate. No, that applies to the rest of the movie. It's just so mind-bogglingly bad that it's impossible to watch without heckling it. Probably the best way to watch this is with the help of Joel Hogsdon, Kevin Murphy, and Trace Beaulieu in the MST3K version."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "SlabBulkhead",
        "review_rating": "1",
        "review_title": "We have a loser!",
        "review_detailed_main": "I recently picked up a copy of MST3K's \"Manos: The Hands of Fate\" and have watched it twice (so I could see if it was really as bad as I thought it was the first time).\n\nIt was WORSE.\n\nThe ONLY credit I will give to this film is that the underlying (more like buried) concept is actually somewhat scary when you think about it (for those that have seen it, of course).\n\nThing is, they did NOTHING right in this movie.\n\nThe acting was so awful that it was mind-boggling. The plot was almost non-existent. The cinematography was hideous. The design was shoddy. Half the scenes had no relevance to whatever minor flow the movie had to begin with. It was, however, another one of MST3K's shining moments (but even they were often in awe of how miserable this flick is!)\n\nTo date, this is the worst movie I have ever seen. Though not by much, it's worse than \"Space Mutiny\" (and that's saying A LOT). I REALLY don't want to imagine this movie without Joel and the robots."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "rrandcoyote",
        "review_rating": "10",
        "review_title": "One-Off, The Best of the Worst",
        "review_detailed_main": "Once in a lifetime, a film comes along that is such an affront to all that is good, right and sane that it removes paint and varnish from most surfaces. That film is \"Manos\" The Hands of Fate, which has been deftly recycled for your bad movie enjoyment by MST3K.\n\nIn 10 years and countless searches, MST3K never did find another character/performance to equal the nadir of John Reynolds' `Torgo'. He hems, haws and generally looks uncomfortable, even as an inebriate--he is quite obviously smashed throughout the film. The `big knees' were his idea, as he was going for the Satyr look that was all the craze in Texas in the drug soaked '60's. He really did think about this.\n\nWarren never did another film. So many of the greats have only one work to their name, as if the pinnacle of their achievement was their only purpose for passing through this misty vale that we call `life'. The shining star that shined so bright for this director perhaps burned his `manos' right off, as if the gods themselves were affronted by his attempt to touch the eternal truths. Or maybe there was just more money in other steaming piles of manure. Depends who ya ask.\n\nI will leave you with this MST3K quip: `Every frame of this film looks like somebody's last known photograph.' Woah! That's so true, dude!"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "niaboC-tdruK",
        "review_rating": "1",
        "review_title": "Absolutely horrible",
        "review_detailed_main": "This movie is one of the WORST movies ever. There's alot that is wrong but the things that makes me the most mad are the following.\n\nLong pauses: I get if things move fast, you might forget whats happening. But here, the pauses makes you forget since nothing happens for literally 20 seconds.\n\nPlot: The plot is nothing new, it's a common plot that has been done before. But, since the movie is from the 60s, I guess the topic was new/trendy?\n\nMusic: The probaby worst thing about this movie. At first I liked it, but it soon gets boring since its repeated during the whole movie. The most \"original\" song is in the beginning, where somebody sang some \"opera\" but when one of the characters say something you barely hear anything from them, due to the \"opera\" Other than that, expect some maniac playing the piano and somebody blowing their lungs out on a saxophone.\n\nThe only \"good\" thing is the camera angles. Most of them are bad, but some are really good. Many scenes are done in one take though.\n\n1/10 Would give zero if possible."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "griffin84",
        "review_rating": "",
        "review_title": "TURN IT OFF!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "trixon51",
        "review_rating": "1",
        "review_title": "Well, um, I uh, um, like, what the....i don't know ha ha?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "Eboreg",
        "review_rating": "1",
        "review_title": "An extraordinary turkey experience from the wastelands of space",
        "review_detailed_main": "(The first thing that must be said, is that I think MST3k is totally pointless. I love watching cheesy old oddball B-movies, but not with a bunch of silly robots ruining the experience. I treated \"Manos\" as it should be treated -- I let it speak for itself.)\n\nThere's not much to be said that's already been said about this movie's lack of... just about everything. I saw it for the first time just now, and I'm still baffled. This is not a case of \"so bad, it's good\". It's not even a case of \"so bad, I want to spew my run screaming into the woods, using my own hand for a torch\".\n\nThis movie reaches beyond \"bad\", and comes out on the other side. It's set entirely in a parallel universe, where time and logic are twisted beyond recognition for mortals. What looks like Texas is actually the other end of a worm hole, where the fabric of space has turned itself inside-out.\n\nIt HAS TO be this way. How else could a movie be so indescribably... not \"bad\", that word is to simple and two-dimensional... mesmerising, but yet so extraordinary painful and genuinely creepy... you feel the movie slowly pressing a pole into your blackened heart, and you make sure to keep the remote control near in case you should feel a psychosis coming... but still you're always on the verge of laughing your head off... and at the end, you can almost feel your brain suppressing the whole experience, and you will never, never be sure what actually happened during these 80 minutes.\n\nTHIS MOVIE IS EVIL. If you're looking for a great turkey experience, something out of this world, that leaves you with a smile on your face and a somewhat altered way of relating to movies in general, I suggest \"Glen or Glenda\".\n\nI guess I will never look upon more ordinary B-movies the same way again. The thought isn't pleasant, but I still don't regret watching \"Manos\" for a second. It had to be done."
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "classicsoncall",
        "review_rating": "2",
        "review_title": "\"Well, where did this place come from? It wasn't here before.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "djsmanzgeier",
        "review_rating": "2",
        "review_title": "BAD",
        "review_detailed_main": "This movie is so bad. I didn't care for any of the characters or any of the plot. But there's a good movie in here somewhere. But i didn't like it it could have been a episode of a tv show like the twilight zone. It's bad and very boring. But I think everyone should watch this. It is so bad but I thought it is hilarious with a line like \"vacations are good but this one should be great \". Or \"but master you have six wives\". It's just so bad it's somewhat good. It's no mourbius but it's still something I mean like it doesn't have a mettacrittic score if it did it's probably 5 or something. But go watch it and laugh. F-"
    },
    {
        "movie_id": "tt0060666",
        "movie_name": "Manos: The Hands of Fate",
        "movie_rating": "1.7",
        "review_username": "spoofguy",
        "review_rating": "1",
        "review_title": "A movie doesn't get voted the worst of all time without reason...",
        "review_detailed_main": "I'm not using my real name so that I'm not associated with this film in any way, shape or form.\n\nThis movie was the ultimate in bad. Bad acting, bad script, generally annoying. The plot was erratic and stupid. It was a horror picture, all right, in the sense that it's hard to imagine more horrible a movie. The music was good, but that's like saying \"at least the incinerator I was burned alive in was clean\"! It was bad! Awful! I couldn't even think of a worse torture! There were only a few characters that were even remotely good (i.e., the robots), but once again I refer to my previous incinerator metaphor!\n\nThis movie really stinks. However, I only thought about shutting it off once - from the moment it began until it ended! The best part was when it was finally over!\n\nOnce again, bad, bad, awful movie. If you want to rent it, don't say I didn't warn you about being scarred for life by the sheer monstrosity of this production.\n\nDon't let any of your pets see this movie or they'll have to be put down."
    }
]