[
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mentalcritic",
        "review_rating": "1",
        "review_title": "As bad as they say, and then some",
        "review_detailed_main": "In my perverse desire to see every film in the bottom 100, I thought I could not go far wrong with a rental of this classic POS. Mariah Carey's first and so far only feature film is an example of how the combined MPAA and RIAA attempts to shovel garbage at us are starting to backfire. Sales of Mariah's recordings, once one of the highlights of an otherwise dreary RIAA mainstream catalogue, have slumped. It's all because of this film. Don't let the blind Mariah fans fool you - it is just as bad as critics say, and deserving of its bottom 100 status.\n\nWhere to begin when pulling apart this cinematic abortion? For me, the first major problem was the cinematography. If the viewer is not clued in on the fact that Vondie Curtis-Hall has only directed television before this film as it starts, the flat, Days-Of-Our-Lives-style shots will soon make it clear enough. Directors who put one or two actors, three tops, in a 2.35:1 frame are a dime a dozen. On the other hand, directors who cannot even differentiate these actors' spacing from the camera truly stand out, and not in a good way.\n\nThe story has been described as being syrupy enough to kill anyone who suffers from diabetes (or doesn't), and I am not going to contest that. It's a variation upon the classic rags to riches theme, specifically tailored towards Mariah. Mariah essentially plays herself in the guise of a young vocalist who starts singing backup for a considerably less talented vocalist. As she crosses the paths of more people, eventually said people twig to the fact that she can vocalise with the best of them. One DJ eventually picks her up, manages her through a record deal, and promises her that one day she *will* play in Madison Square Garden, or something along those lines.\n\nThis kind of story has been done before, with such real-life examples as the Jacksons providing source material for one excellent miniseries of the theme. The problem here is that we've heard this story a million times before. Another significant problem is that while Mariah has a voice many would kill for, there is absolutely nothing that stands out, even slightly about her material. As an old girlfriend of mine once said, the longer it takes the RIAA to twig to the fact that being female doesn't mandate wanting to hear this formulaic ballad crap, the more business they are going to lose to independents who support bands like Opera IX. I think the fact that Mariah's last album disappeared without trace in spite of having millions of dollars spent on its promotion proves her right.\n\nMariah's story is also incredibly bland, to say the least. So her junkie mother gave her up when she was young. Oh boo hoo. It happens, and you're probably better off for it, get over it already. The previously-mentioned Jacksons could run rings around the likes of Mariah Carey for sob stories, and their reluctance to deal with the media at large is a telling thing. So in the end, we are simply left with another example of the mainstream trying to seem alternative, and failing.\n\nI gave Glitter a one out of ten. I don't think I am being too harsh. I think it is so amazingly bad that it becomes comedic, at least on the first viewing. I suspect that repeated viewings will simply become boring."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jcorpuz@ucsd.edu",
        "review_rating": "1",
        "review_title": "Worse than you've heard",
        "review_detailed_main": "I don't know how many of you have ACTUALLY seen this movie but I recently rented it out of morbid curiousty and a sadistic love of BAD cinema (and of course making fun of it)... and I did give it an honest chance. I really did, and no less than 3 minutes into the movie I was convinced it was going to be a bomb... there's too much to complain about here, from the faux artistic shots and film techniques meant to give the film some false \"class\", to the insane gaping void of chemistry between the main lovebirds, to the comic relief that is not funny and is unnecesary since there was no drama or romance, to the numerous long, long shots of things that either didn't matter or didn't need to be shown for the 700th time... I kid you not this is a really awful movie... only the most inept movie fan or an insanely die hard Mariah Carey fan could ignore the gaping holes in plot, directions, style, and acting that Glitter presents. However if you enjoy watching movies and going all MST3K on them, then by all means rip on this one. It deserves all the insults you can muster."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "It's no wonder that even Carey herself considers 'Glitter' her biggest regret",
        "review_detailed_main": "Seeing 'Glitter' with an open mind, despite its notoriously awful reputation, it is not quite as horrendous to be down there with the worst films of all time, but the problems 'Glitter' has are plentiful and are significant enough to consider it a very bad film still.\n\nThe good news is that Mariah Carey does sound absolutely incredible, always have loved her voice with its beautiful tone, emotional connection and uniquely wide range. Also Terrence Howard is quite good and steals scenes.\n\nHowever, Carey's enviable skills as a singer does not translate in her skills as an actress, it was really strange that an artist with such a huge vocal range (five octaves!) is the complete antithesis in her very one-note and often expressionless acting here, which is devoid of any joy, surprise, sincerity or emotion. The ability to connect emotionally with her songs also doesn't translate in the acting, she looks stiff and bored throughout here.\n\nUnfortunately, the songs here do nothing for her vocal talents either. She sings them very well indeed, but there are far more memorable and emotionally powerful songs from her out there that also display her unique vocal gifts much more. They're not awful, just bland. The rest of the acting is also poor, with Max Beesley being equally lousy and not sounding sure what accent to pull off, while with the characters Carey's is shallow, one-dimensional and very difficult to relate to (which is a huge dividend considering the type of story it is) and the rest are annoying caricatures, a couple even irrelevant to the story.\n\nEven for a film set in the 80s, 'Glitter' does much less than glitter and looks firmly stuck in the 80s. It looks gaudy and too much of the camera work is too gimmicky and amateurish. The structurally wafer-thin script, with clumsy attempts at being hip, embarrassingly unfunny humour and \"poignant\" moments that come over as emotionally manipulative, sounds even older than that and like an awkwardly written soap-opera rejected at first draft (and should have stayed there).\n\n'Glitter' has very little story, it's very thin and aimless, and padded by the bland and uninspiredly choreographed songs shot like a series of out of date music videos and subplots that come out of nowhere and go very little further than that (i.e. the reappearance of the cat or the reunion with her mother). It starts tedious and loses even more drive as it plods on, and throughout like Carey's performance there's no joy, no emotion and no substance. The direction is decidedly inept.\n\nOverall, not that horrendous but it is no wonder that Carey herself regrets being involved in this. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ccarhart",
        "review_rating": "5",
        "review_title": "A 40 Million Dollar High School Play",
        "review_detailed_main": "So bad it's fabulous. This movie bombed big-time when it opened, I saw it in the theater with an audience of 5 other people and have watched it several times since. So much bad press at the time! There was a rumor that it was originally supposed to be set in the 80's, but that part was cut out, only the wacky costumes remained. That would explain the presence of Ann Magnusona as a press agent for the record company. Mariah is sincerely likable and sings beautifully. The same cannot be said for poor Padma Lakshima. Sort of an R&B version of \"A Star Is Born\", you will find yourself laughing in all the wrong places. Every cliché in the book and then some. There is a fashion photo shoot with silver body paint, and an evening dress that goes from stage to farm in one day. A classic rags to riches tale that seems to have been written by a teenager.\n\nCC"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mcrodas",
        "review_rating": "4",
        "review_title": "not so bad",
        "review_detailed_main": "True, this is no cinematic marvel, but this movie does not deserve to be number 13 of the bottom 100 movies as commented on by IMDB audience. Not even in the bottom 100 at all. I'm a guy, and no big Mariah Carey fan, but this movie is not so bad, ok for any Mariah Carey fan."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "moonspinner55",
        "review_rating": "4",
        "review_title": "De-fanged \"A Star is Born\"",
        "review_detailed_main": "\"Glitter\" might have been a camp classic if the story wasn't so dull and downbeat. It's yet another rewrite of \"A Star Is Born\", here turned into a vehicle for pop star Mariah Carey and apparently patterned after her own rise to the top (audiences weren't fooled, however, by the updated, late-night-movie clichés). Carey's funky/erotic music is driving (and her performance as blazing new talent Billie Frank is adequate), but the script for \"Glitter\" seems left over from the 1950s. Didn't the writers realize that times have changed and that Billie didn't have to be such a diva-doormat? Actresses of a lot higher caliber than Mariah Carey have fallen into this trap--they just don't want to see themselves on the screen acting bitchy and tough, so they end up playing the simp. \"Glitter\" features some rich cinematography (nice shots of the Big Apple), but it is too soft to make an impression--even as an unintended comedy. *1/2 from ****"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "GroovyDoom",
        "review_rating": "2",
        "review_title": "Scary star vehicle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "claudemercure",
        "review_rating": "1",
        "review_title": "so bad it goes past good and comes back to bad again",
        "review_detailed_main": "I rented Glitter because I'd read it was destined to become a 'so bad it's good' classic, but I was disappointed. This is no Showgirls. What makes Glitter a bad movie is that it's a bland, soulless procession of clichés, exactly like Mariah Carey's songs. And that just makes it boring-bad instead of spectacularly bad. And though Mariah is plenty vacuous in the starring role, she doesn't reach the heights of strenuously bad acting that Elizabeth Berkeley does in Showgirls. The only element of this movie that satisfies my so-bad-it's-good criteria is the character of Mariah's boyfriend. Here you have the whitest man on Earth, saying 'hip' things like \"I'm a'ight\" and \"when you got no food in yo crib\". If only the movie had contained more cringe-worthy gems like those!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Tony-Kiss-Castillo",
        "review_rating": "2",
        "review_title": "To Be Honest: This is a Review of the 1st 1/2-Couldn't Bear Another Minute!",
        "review_detailed_main": "CURIUOSITY! ...Said to Myself Mariah Carey!?!?!? Hmmmm ..... I wonder if she can act???\n\nSo ...Can You GUESS??? Probably pretty easy to imagine...HUH!?!? O. K.... Now, take Your Imagination DOWN a few notches... And just MAYBE You have guessed it more or less for what it is! ...Or in this case.... What it is NOT!\n\nProbably MY BAD! Usually, I avoid bad movies like the PLAGUE! Well... The EXCEPTION PROVES the RULE! The very BEST I can say about this FILM?????? Well.... Some of the MUSICAL NUMBERS were.... NOT SO BAD! And ...as is the Case with almost EVERY rather bloated Budget Hollywood production... ALL Those standard PRODUCTION VALUES.... You know... Cimemaphotography, editing, sets, costumes, recording and sound engineering etc..... as expected... were all.... Well.... ACCEPTABLE!\n\nThe storyline, however, was utterly inane. Deciding not to submit myself to anymore CRUEL + UNUSUAL Punishment... I just had to pull the plug about 1/2 way thru! SORRY!\n\nNeed I say anymore??? O. K.... I thought You would agree!\n\nFYI... This REVIEW has like 700 or 800 Characters! Much more than 150 MINIMUM.... RIGHT!?!?!?"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Meat_Trademark",
        "review_rating": "1",
        "review_title": "Are you sure there's no way to vote ZERO?",
        "review_detailed_main": "Okay, without swear words...\n\nThis movies bites everything bad really hard.\n\nDon't get me wrong. Even if a movie is BAD, I can still often get a kick out of it. Some bad films are so bad they're fun: Roadhouse, Kingdom of the Spiders (\"starring\" William Shatner), Orgy of the Dead, Cool as Ice, Battlefield Earth... This one's just plain bad. I'm not sure if I can EVER forgive myself for having watched it. I swear, my eyes and ears began bleeding about twenty minutes into it. Still, I waited for something so bad it was funny. It didn't happen. Just plain bad. No, not \"just plain bad,\" but really bad. Really, really bad. I truly can't say how bad it was on this post without resorting to, and making up new, swear words.\n\nThat said, I was unfortunate enough to stumble upon some show on MTV about celebrities' homes during a segment about Pariah Careless herself. Let's just say that I used to think she was the Devil. Now I know that there are worse, more pretentious, and just all-around truly more terrible and terrifying things than the Devil. She's straight out of H P Lovecraft's Cthulhu mythos. A slimy many-tentacled thing waiting to devour humankind's happiness to further its own demented, sickening Ends.\n\nAnd if you think I'm being flippant or sarcastic, let me set the record straight: I am not religious, but I fear I may be in mortal danger for having exposed her as the the Evil Lurking Thing that she is. I pray to unknown benevolent gods that I never hear the wet, poison tentacle-claws scratching their way in through my door. I hope my death will be quick and painless when the Mariah-thing comes to reap my soul.\n\nBy the way, I really didn't like this movie at all."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "paulandreas-221-358928",
        "review_rating": "10",
        "review_title": "Here for it in 2020",
        "review_detailed_main": "Glitter must surely be at cult classic status any day now. The bad rep it got at the time doesn't stand the test of time. Re-watch and you'll see what I mean. Mariah is good in this and so is the soundtrack."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "franklinajohnson",
        "review_rating": "6",
        "review_title": "flawed....but let's be honest, there are MUCH WORSE FILMS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "CTS-1",
        "review_rating": "1",
        "review_title": "Mariah Carey cannot be excused from this wreckage....",
        "review_detailed_main": "...because, as her vanity project, she undoubtedly had the final yea or nay on what went into this mess. The inexplicable glitter strip (note: watch for continuity errors in its location)? The longest-lived cat ever? Telepathic songwriting? The most unsympathetic cast of characters since \"A Clockwork Orange?\" Ms. Carey knew, or should have known.\n\nMariah's acting is, well.... zombified. Her screen presence would actually be explained by her being under the influence of some medication designed to help with her later well known breakdown. Ms. Carey proves, beyond a shadow of a doubt, that bad over-acting makes for more entertaining badfilm than bad under-acting, which just leaves the viewer wondering why the movie was made. I couldn't tell for sure whether the rest of the cast's tepid-to-annoying performances were due to their own bad acting or from trying to perform across from the lifeless Ms. Carey; after 45 minutes, I couldn't care either. A well-deserved 1."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "dave13-1",
        "review_rating": "2",
        "review_title": "Not so bad it's good, just bad.",
        "review_detailed_main": "Some bad movies, such as Showgirls or Mommie Dearest, become camp classics over time as people come to forgive their shortcomings, and just groove on their excesses. That a movie as famously bad as Glitter has not entered this realm of camp, even after fifteen years, is telling. It tells us that Glitter commits a higher sin than being bad. It is boring. And derivative. And staggeringly incompetent. It was assembled by c-list writers and a TV director, none of whom had much idea how to gain a viewer's attention, and less idea how to hold it. Scene composition is flat and dull, evoking memories of bad holiday TV movies, while failing to establish intimacy with the characters or goings on, even in close up. Early scenes feature a hazy or gauzy look, no doubt to recall Hollywood's golden age, but that simply succeeds in making the movie look trite and derivative, rather than classic. It also makes it look as if the set decorator forgot to dust. The club scenes feature a color palette straight out of Blade Runner, just not as cheery. Every creative element in Glitter has the look of something borrowed from another (better) movie. And the less said about the bizarre, almost random editing choices the better. Every scene transition is another wtf moment.\n\nStory and script construction are uniformly terrible. Scenes begin, stuff happens, scenes end... and NOTHING carries over. There is no continuing thread here of any kind - no overall character arc, no central theme, no ongoing visual motifs outside of the movie's hilariously inaccurate 80's fashion sense. Everything that happens seems utterly pointless, just a string of clichés recycled from old movies in which the chorus girl gets her big break. Glitter's brain-dead script gives none of its performers, not even once by accident, anything original or clever to say, nor any awareness of the storyline's utter inanity, making it increasingly difficult for the viewer to connect with the drama. And then we come to the Razzie-winning central 'performance'. La Carey could have been replaced by a Miss Piggy doll and the central role would have had more animation. Mariah's singular expression of vague incomprehension never changes, not even when gangster Terrence Howard grabs her face! To be fair she is not Glitter's only zombie marionette. Outside of Ann Magnusson's over-the-top pr woman, no actor in Glitter's 100 minute running time seems committed to being in any way memorable. A cynical person might suggest that they did this so that they could keep Glitter off their resumes without fear of contradiction. The result is a movie that defies any viewer to keep paying attention to it. You find yourself wanting to make a salad or do your taxes while the movie is playing, anything so that the time spent watching it is not a total waste.\n\nThis brings us to the music. Hollywood seems to have forgotten that the most important element in any musical is music, despite the fact that the word is right there in the name of the genre. Grease turns into a pretty bad movie whenever the singing stops and The Bodyguard is only marginally better. Both were huge hits however, and the fact that their soundtracks went multi-platinum was not a coincidence. Purple Rain features some downright cringe inducing 'acting' by Prince and Appolonia, but redeems itself time and time again with great musical performances. Viewers will put up with so-so filler in a musical as long as the songs entertain and remain in the mind after the credits roll. Glitter, unfortunately, features Mariah's worst ever (and worst selling) album at its core. Not only are the musical sequences not entertaining on their own, but they also make it hard for the viewer to swallow the idea that fictional Mariah would become a superstar on the strength of them, since actual established star Mariah could not manage to peddle them in real life. Thus, the fictional Mariah fails to engage as a performer, the actual Mariah fails to cross over into Hollywood despite having great singing talent and only having to play a person with singing talent, and even the spectacle of these failures fails to entertain on the basic level of a train wreck.\n\nGlitter simply cannot provide an adequate reason to exist. Mariah's musical ability has already been showcased in a long succession of music videos, to better effect, and so we don't need Glitter for that. Rags to riches musical biographies have been done to death, so we hardly need another. The Girl in the Gold Boots told substantially the same story to drive-in goers fifty years ago! Heck, 42nd Street wore out this clichéd genre in 1933. If Glitter's only purpose was to act as a 100 minute commercial for its own soundtrack, as the Pokemon cartoons are simply ads for Pokemon toys, it fails there too, since it makes these crummy songs even less palatable in context than they would be standing on their own. So why does Glitter still exist? Was it financed by someone with a grudge against Mariah Carey, and she never caught on that she was being pranked until after its release? As a practical joke played on a gullible and vain pop diva, Glitter is pure malevolent genius. If, however, we were meant to have taken it seriously, then it's just a really, thoroughly worthless movie.\n\nPoll question: Which pop diva embarrassed herself worst? JLo in Gigli, Jessica in The Dukes of Hazzard, Britney in Crossroads, Clarkson in From Justin to Kelly or Mariah in this piece of drek? I vote Mariah in a close race."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "shsoh",
        "review_rating": "1",
        "review_title": "More Like \"Litter\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Piling on...",
        "review_detailed_main": "There is an American Football term called \"Piling on\". It's a penalty where the opposing team stops the runner and after the play is blown dead, opposing players keep jumping on the guy with ball--a definite no-no. Well, to me, this film conjures up this term, as when the film came out, reviewers seemed to come out of the woodwork to say how terrible the film was. In fact, they took great delight in talking about how bad the film was--shortly after release it was already legendary--perhaps made more so by Mariah Carey's nervous breakdown. Many speculated that this film led to this. Well, while I'd never say this is a good film, it certainly wasn't as bad as they said and it seemed that people were just piling on poor Mariah. Now I am NOT a fan of her music--up until this film, I barely ever heard any of it, but I felt bad for her because of all the hubbub.\n\nAs I said, the film isn't good but it isn't terrible. The biggest problems were with the script--which was essentially A STAR IS BORN. The film had already been made too many times by the time Barbra Streisand did it a few decades ago--now, the story is so old and has been done so many times that it just seemed like a giant cliché. In many ways, also, Mariah's character seemed a bit like a battered woman and it felt frustrating that she kept holding on to a guy who was an obvious jerk--making her character seem a bit pathetic. Additionally, the film suffered, at least for me, with a severe case of \"music video-itis\". In other words, there were so many musical numbers, at times it seemed more like a bunch of music videos strung together with a bare plot--not a real film. Of course, there have been much worse examples of this type of film--such as Paul McCartney's GIVE MY REGARDS TO BROAD STREET--which had significantly less plot than GLITTER (yes, it is possible).\n\nBut, on the positive side, Ms. Carey sure can sing and was absolutely beautiful--in fact, stunning. Also, her acting (which took a lot of abuse) wasn't that bad, either. In fact, had this film gone over a bit better, I could have seen her going on to other acting projects and improving her craft. Now, however, I don't think there's a chance in a billion! So, my overall verdict is that this is an okay film at best. However, it did not deserve all the attention the Razzies gave it--it's not really a movie that is enjoyably bad...just a bit dull and very predictable. However, if you adore her music, you could do a lot worse than see this film.\n\nPoor Mariah. After this film tanked, all she had was her immense fortune and jet-set life."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "TYANDSAHONA",
        "review_rating": "",
        "review_title": "Was it that bad? Really?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "claudio_carvalho",
        "review_rating": "4",
        "review_title": "A Typical Film to Promote Mariah Carey as an Actress",
        "review_detailed_main": "A simple girl Billie Frank (Mariah Carey), abandoned by her alcoholic mother, meets a DJ, falls in love with him and becomes a star. Certainly there will be a superficial turning plot and a happy end. Actually it is a shallow and ridiculous plot, only to promote Mariah Carey as an actress. Her performance is something that deserves to be commented. In the past, Mariah Carey had a beautiful face. Get the VHS 'The First Vision', and you will see a gorgeous woman with brunet curled hair, natural eyebrows, nose and cheeks. Now, this female version of Michael Jackson is pathetic, with blond straight hair, thin nose and eyebrows and cheeks with silicone. Her acting is ridiculous, blinking all the time. When she is happy, she blinks. When she is sad, she blinks. When she is in love, she blinks. The number of times she blinks along this flick could be a reason for a funny game: 'Guess how many times she will blink in such a period of the movie?' And even singing, she exaggerates with her 'uhs... uhs..' (as usual). The DJ Julian Dice (Max Beesley) looks like a clone of Mark Wahlberg. Maybe fans of Mariah Carey may like this movie, but I am not his fan. My vote is four.\n\nTitle (Brazil): \"Glitter, o Brilho de uma Estrela\" (\"Glitter, the Bright of a Star\")"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "LeonardKniffel",
        "review_rating": "3",
        "review_title": "Not As Bad As All That",
        "review_detailed_main": "Essentially a bizarre makeover of \"A Star Is Born,\" this star vehicle for vocally gifted Mariah Carey is one most panned films of the 21st century. For 13 years I avoided it for that reason, but when I finally watched it, I was surprised to find myself in the very small camp that found the movie entertaining, although certainly not wonderful. The script is rather dull, and it keeps interfering with the songs. I found myself saying out loud to the director, \"Will you let her finish a song before you cut to more insipid dialog!\" There is some really nice music going on during the movie--not just Carey, but Stevie Wonder and Luther Vandross and others thrown in for good measure. And Terrence Howard steals every scene he is in as the villain."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "dirk nowitzki",
        "review_rating": "1",
        "review_title": "A Disgrace.",
        "review_detailed_main": "This movie is truly awful. Mariah Carey is the worst \"actress\" ever to appear in a movie since time began and should be banned from the film industry for all-time. In addition, the rest of the so-called \"cast\" is equally as deserving of that honor, in particular \"Dice\" and Billie's two sidekicks who shall remain nameless in their utter shame at having appeared in this garbarge. \"Glitter\" is pointless. Having set through the entire thing, I am only left to wonder what the people responsible for this film hoped to accomplish, and if they succeeded, how low the movie industry has come. I am a worse person for having seen this movie. From the vapid emotional range of Ms. Carey to the one-dimensional paper cut-outs that served as the supporting cast, \"Glitter\" is a train wreck from beginning to end. I beg you not to watch this movie, unless your sole purpose in doing so is to relentlessly mock it, as was mine. Thank you."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tsw004",
        "review_rating": "1",
        "review_title": "Quite simply the worst film I have ever seen bar none!!",
        "review_detailed_main": "I have to first explain I only saw this film as I happened to be in when my best friends' girlfriend (a devout Carey fan) decided to rent this film out. To say this film is bad doesn't do it justice, this film is a criminal waste of time and money when you think of all the great scripts and creative writers out there who can't get a break. How anyone had the audacity to commission this crock of pap is beyond me. Carey simply can't act, she is truly awful in this film as are most of the rest of the cast. The 'story' is a semi autobiographical account of the leading lady's life, which is always a sign of a weak plot but this just takes the biscuit! After forty-five minutes I started reading the newspaper, after fifty I couldn't care less if the video chewed itself up! My best friends' girlfriend a confirmed Carey fanatic confessed that even she thought this film was utterly dire and I can't repeat what she said about it for fear of inducing and multi-million pound libel case! Anyone who says this film is even vaguely watchable is either a blind Carey fanatic or just plain stupid. 0 out of 10, and believe me if I could give a minus rating I would."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "khat-datty",
        "review_rating": "8",
        "review_title": "A VERY UNDERRATED FILM.",
        "review_detailed_main": "I personally feel that Ms Carey took a bad rap for this film. \"Glitter\" really isn't as bad as the critic's wrote in their reviews. Sure this movie was not of the caliber of an Oscar nominated film, but it was fairly well acted, and entertaining. I honestly feel had Jennifer Lopez been in the starring role as opposed to Mariah Carey, no one would have had a problem with the film. I gives kudos to the cast and crew of this film. A grossly underrated film.\n\nK-DIDDY 2002"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "I_Ailurophile",
        "review_rating": "6",
        "review_title": "Flawed, but nowhere near \"that bad.\" I actually like it!",
        "review_detailed_main": "Sometimes it's not enough to read about cinematic infamy, and you just have to see it for yourself. Take for example 'Ishtar,' 'North,' 2019's 'Cats' - or 2001's 'Glitter.' It's been well established that this came at a bad time in Mariah Carey's life, and she has rather distanced herself from it. The feature and the accompanying soundtrack album were also released at an unfortunate moment that all but ensured it would go unseen and unheard by just about anyone; did this ever really have a chance? Could it really be that bad? After all, the premise quite recalls any of a long, long list of other films about young protagonists trying to make it big in one region of show business or another; what happened here to earn such significant derision? Now that I've watched this for myself, I'm not sure I can rightly say. I think the picture struggles with various issues over the course of these 105 minutes, matters that distinctly hold it back. I'm also genuinely surprised, however, to find myself thinking that the reevaluation it's had in recent years is actually much closer to the full truth than the common description in the past 22 years as \"one of the worst movies ever made.\" It is not, after all, \"that bad.\"\n\nThe opening sequence is a little heavy-handed as it tugs on the heartstrings with exposition, but I can forgive this; mind you, I could forgive it more easily if that heavy-handedness weren't echoed later on. More concerning are early embellishments of unnecessary visual effects, and snappy editing, that quickly raise a skeptical eyebrow. The pacing of scenes and plot development is just ever so slightly too zesty (by, let's say, fifteen percent), coming across as peculiarly unnatural - rendering no few and possibly too many moments with a sense of inauthenticity, not least of all the first solidification of the romantic element at about the one-third mark. Sometimes it feels as though this is trying too hard to be extra \"hip\" and \"street,\" especially when it comes to select instances of costume design and Vondie Curtis Hall's direction; this is especially strange since, in the more mindful examples that grow more prominent as the length draws on, it all looks fantastic (and likewise for the lovely hair and makeup). This feeds into another, larger problem: the feature actually has plenty of substance, including not just the core premise but also themes of creative control, shady deals, management machinations, the business side of the music industry, mixing business and pleasure, and more. That substance is treated unevenly, ranging from right on target, to so-so, to insufficient, and this goes double for whenever 'Glitter' tries to be flashy and stylish (and excessively so). This is so unfortunate, because I see the beating heart that the project possesses. I just don't always feel it, and sometimes it has a hard time shining through.\n\nI know the acting was a source of considerable disdain upon release, but very honestly, I don't see anything wrong with the cast's contributions; above all, I'm rather inclined to think that Carey actually handles the lead role quite well, with commendable controlled range and poise. Her performance is hardly revelatory, but by no means do I think it's deserving of all the disparagement it's received, and I'd quite like to see more of what she's capable of as an actor. Some of the songs herein are better than others, or used more judiciously than others, but there are some classic songs on the soundtrack, and above all there's no disputing what an incredible voice Carey has. The production design and art direction are swell, and even if I don't agree with all the decisions made in terms of cinematography, direction, or especially editing, I think this is well made from a technical standpoint.\n\nI think what it comes down to is that 'Glitter' has difficulty finding focus, or striking the appropriate tone, as it shifts from one story beat or mood to another. I don't see any singular flaw so critical as to severely dampen the viewing experience; rather, there's a regrettable accumulation of imperfections over time, almost from the start and nearly to the end. It's not Wholly Wrong, but it's also never Quite Right. Among other things, I'm inclined to think that if Kate Lanier had left out one or two elements from the screenplay then the end result would have been tightened, and the drama and weight of the story would have subsequently landed with more success. With all this having been said, no one is more astonished than I am that I earnestly enjoy this. I think it's a good movie. It's a movie with definite faults, and I readily recognize where improvements could have been made, but I also recognize the sincerity and care with which it was crafted. There are other pictures in this same niche genre that are more noteworthy and admirable, but whether you're a big fan of Mariah Carey or someone else involved, or just an avid cinephile, I actually believe this is worth watching.\n\nSometimes popular opinion is exactly on point. 'From Justin to Kelly' is abominable; 'Showgirls' is tawdry and flummoxing; Baz Luhrmann's 'Moulin Rouge!' is spectacular. Sometimes popular opinion is wrong-headed - and I think 'Glitter' is an example of the latter. It's nothing for which one needs to go out of their way, and as a matter of personal preference I won't begrudge anyone who engages honestly and ends up more emphatically critical. But if one has the opportunity to watch this, and to give it a real chance, then I'm glad to say that as far as I'm concerned it is much better than most anyone has given it credit for in the past two decades. Watch with both mindful expectations and an open mind, but do watch."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "scott-anderson-3",
        "review_rating": "1",
        "review_title": "Unspeakably, irredeemably awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "The_Limey",
        "review_rating": "",
        "review_title": "Really is that bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "glory-8",
        "review_rating": "1",
        "review_title": "All that Glitters is stupid...",
        "review_detailed_main": "Having seen Crossroads the week before, a film that was so bad it was good, I rented Glitter with a friend to enjoy another trashy \"diva\" film. However, we didn't bank on the fact that Glitter has no plot, completely anachronistic costuming, and a really terrible lead. The viewer can actually see when Mariah is thinking \"Okay, I have to act sad in this scene\" and so on. I was thoroughly disappointed that although it was supposedly set in the 80s, there was not one single mullet in the entire film - the \"love interest\" had a hair style that was more late 90s than anything - and Mariah is clothed in the most unflattering attire throughout the movie. They kept making her wear her hair in a side pony tail, which gave her a pained expression, and she had this weird silver streak of make up that moved from her left shoulder to her decolletage to her right arm, and even onto her lower back. What's with that? Maybe it's some pop culture reference that I completely missed, I don't know.\n\nBut all these flaws could be forgiven if there was a semblance of a plot. But there wasn't. Even though I'd been watching the clock after the first fifteen minutes, when the film actually ended, it was completely abrupt. I think that the producers (including Mariah herself) thought that if they assembled the cast and crew on the day, then the plot would look after itself.\n\nThe best thing about Glitter was that I rented it free from a friend who works at Blockbuster."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "trackstartrox",
        "review_rating": "4",
        "review_title": "Awful written all over it!!!!!",
        "review_detailed_main": "What was Mariah thinking when she decide to do this film?! This is just one of the worst pictures that I have ever seen. Their was nothing good in the picture except the \"Never Too Far\" concert scene. Other than that it is just awful.\n\nBillie Frank(Mariah Carey) plays a mixed raced women who was doing her own thing with her friends when she was approached by a DJ about having to produce her, her career begins to fly, but the worse thing about this movie is Mariah's performance. OK, maybe she acted \"OK\", but come on, she smiled all the time when she wasn't suppose to, she throws no emotion to her work and when she cries it almost acts like she lost her keys.\n\nOf course, it's not all her fault. The writers, wrote this very awful script. The director apparently didn't know what he was doing. If you want to see this movie, do it at your own risk, but your wasting your time.\n\nI can't wait to see Mariah Carey, try her acting chops again in her new movie \"Tennesse\"\n\n4/10"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "starlasunlight",
        "review_rating": "2",
        "review_title": "Crap Crap Crappity Crap",
        "review_detailed_main": "This film wasn't as bad as I thought but it wasn't good. It was still utter crap on stick. Mariah as many have said is as wooden as the huge horse in Troy and I'm so sorry that someone like Max Beesley has been brought into a film like this.\n\nIf this film had of been done differently E.G. different female lead and as much as I love Mr Beesley replace him too. Then if some Hollywood hotshots are brought in it could be OK once the script is totally replaced.\n\nThen again some apparent Hollywood hotshots can't save a film E.G. Gigli. For the love of god this world's going nuts."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "SchrodingersCat",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "If you want to see a movie that you can make fun of for its unintentional stupidity, this is it. This is a world where buildings that do not exist in the time period are there anyway, and cats appear out of no where, and much more."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Moynahan_M",
        "review_rating": "1",
        "review_title": "What a piece of CRAP!",
        "review_detailed_main": "There is actually more than 400 people who voted 10 for this movie... WHAT?\n\nThis a a total disaster... You have time to lose? DO NOT EVEN WATCH THIS MOVIE!!!\n\nIt has no story, no action, no good actors... NOTHING! Seriously, you want to sleep on a movie? NOT THIS ONE!!! It will make you laugh to death as awful it is!\n\nWant to see a movie that says nothing and will go nowhere? Glitter is for you... Mariah Carey fans, if you don't want to be desesperated by your favorite singer, DO NOT WATCH THIS MOVIE!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Virginia-Ms",
        "review_rating": "4",
        "review_title": "Tough rap",
        "review_detailed_main": "Glitter got a hard rap for not being so good. There are many reasons why a movie doesn't work. Like other things in life, sometimes a movie comes around at the wrong time in the wrong place. Sometimes, with a film project, it's just the wrong mix of talent for that particular project.\n\nI don;t know why this one didn't, but I must say that I did enjoy watching Mariah Carey and watching her sing. She does have a presence. Maybe another movie at another time.\n\nThe movie stars Mariah Carey, Max Beesley, Da Brat, Tia Texada and Ann Magnuson. Director, Vondie Curtis Hall, tried, but again, maybe on another venture. The script by Kate Lanier seems okay.\n\nProducers Laurence Mark and Mariah Carey must have seen what was coming. I mean, talented people were involved here. The score was composed by Terence Blanchard"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "2",
        "review_title": "Wow.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Drxtc",
        "review_rating": "10",
        "review_title": "A Tour-de-Force!!!",
        "review_detailed_main": "Move over, Meryl Streep and Dame Judy Densch...the next wave of young thespian geniuses is storming the screen, and the path is being blazed by stunning Mariah Carey. Given nothing but a bare-boned outline of a plot to work with, Ms. Carey explodes across the screen with a depth and complexity of character unseen since Vivian Leigh's multi-faceted Scarlet O'Hara in \"Gone with the Wind\" back in 1939. Every colour of the rainbow, and some even out of the range of the known colour scheme, are clearly and sharply delineated by Mariah in every frame of this masterpiece; every subtle shade and nuance of Billie Frank is drawn with precision sharpness and crystal clarity. It is said that the ultimate sign of true artistry in film is when one can look at any single frame of a motion picture and instantly know what is going on just from the facial expressions and body language of the actors within. \"Glitter\" certainly exemplifies this theory. At any given moment, one can look at Mariah's Billie Frank and instantly see every idiosyncrasy of the woman inside. The relationships she has with, and her feelings towards, every character she interacts with in the film is beautifully fleshed-out and drawn with a broad brush. Each and every word Mariah speaks in \"Glitter\" was meticulously delivered by her, and obviously carefully studied during perusal of the script.\n\nMariah delivers infinitely more than the one-dimensional Billie other reviews have led us to expect. Her transitions from despondency, to loneliness, to anger, to triumph...all brought forth with a crispness and clarity unknown to this age of the cinematic experience. And the ease with which she presents all these ranges of emotion draws you into the character of Billie, to the point where you hang breathlessly on Mariah's next word. She has such a natural talent, such an incredible comfort in front of the camera, that you instantly forget you are watching an actress playing Billie; you believe she really is Billie.\n\nThis can only be the smallest taste of what is to come from this future screen legend. Mariah has made her mark on the film industry, and now can, and must, move on to deeper, more complex roles...she must rightfully stake her claim as one of the greatest screen presences in cinema history. How marvelous it would be to see her take on some of the great female characters of literary classics, so in vogue today. A \"Jane Eyre\", for example, or Lizzy in \"Pride and Prejudice\". Many of Shakespeare's greatest works have remained uncommitted to celluloid; what greater compliment to the works of the master himself than to have them graced by Mariah Carey?\n\nPlease, do yourself a favour; you must see this movie, and see it with an open mind. Those who scoff are simply those who had already decided that Mariah would be a failure in the cross-over from music to film. They cannot admit they were wrong; for, unlike Barbra Streisand and Madonna before her, embarrassments both, Mariah Carey is a fabulous, fantastic, brilliant actress. Again, look at everything she was able to do with this meagre script!!!\n\nMariah Carey is the most stunningly beautiful, breathtaking, sexy, sensuous, heart-stopping woman ever to appear on the stage or screen. So many times during this movie, I realized that I was so captivated by her beauty that I wasn't even breathing; my heart was pounding so fiercely at the sight of her, I though it would burst.\n\nBelieve me, Mariah...keep acting...keep singing...you will always be remembered as a priceless legend."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "xindi005",
        "review_rating": "7",
        "review_title": "Sometimes even a movie with a fine actress does't always make a good movie",
        "review_detailed_main": "Mariah has done some very impressive things in her 35 years with us and we love most of them. However, four years ago, she made what could have been the best movie of the year........it didn't get that far.\n\nI saw Glitter and was somewhat impressed by it. However, it just wasn't taken far enough. The music was(as always) marvelous-especially the remake of \"I didn't mean 2 turn you on\"....very hot. But the acting could have been better and the pairing of Mariah and that other guy as her love interest was not very good(he stunk).\n\nHer best friends were at the only other good thing about the movie; they were hilarious. Mariah's debut as an actress was okay,but the script and story had too many holes in it....all in not too bad; it had Mariah in it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "marcslope",
        "review_rating": "2",
        "review_title": "Litter",
        "review_detailed_main": "Mariah should have a subtitle under her performance whenever she's on screen: \"Not a Professional Actress.\" She has one and a half expressions, a toothy grin for happy and a pout to indicate... consternation, shock, regret, befuddlement, whatever.\n\nThis is one of those movies where you can practically hear the production team panicking as they view the rushes, saying, \"We have to do something to protect her.\" So they cut away from their star quickly whenever they can; they light her strategically; they have her sing as much as possible (lip-synching to her own voice is not her strong suit, either). None of it helps.\n\nNor is Mariah the only miscreant. The screenplay omits certain key data, such as showing us how she gets to be a star. Once she is a star, she still seems to exist in the same world -- there are no handlers, no bodyguards, and she freely walks the streets of Manhattan with no one asking her for an autograph. Vondie Curtis-Hall's direction is full of silly transitions, and leading man Max Beesley, sporting a fake-beard of a New York accent, has the appeal of a boll weevil. The only fun performance (in the right way) comes from Ann Magnusson, as a voracious talent manager. The role's a cliche, but at least she has energy.\n\nI had a good time giggling at this movie's multitude of ineptitudes, but I won't need to see it again."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "burnadrenaline",
        "review_rating": "",
        "review_title": "This is what an \"Average\" bad movie looks like",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Julian_Lie",
        "review_rating": "1",
        "review_title": "I actually know someone that love this",
        "review_detailed_main": "I saw this movie like a year ago but it will never get out of my head, when I travel I can't never sleep so I'm forced to watch the movies that are on the plain, bus, car, etc... this one was in a bus, and I have to say that it's, tied with an Olsen twins movie, the worst flick I have seen in a vehicle, of course that I can't remember a worst movie in any situation, maybe Jim Carrey's \"Liar, Liar\", but is hard to say.\n\nMariah Carrey and company acting suck, well I think that is obvious that the so called \"singers\" can't act, ask Jessica Simpson, or Britney Spears, but well Hollywood won't change.\n\nDon't watch it, if you're in a vehicle, you can't sleep, and is passing this, protest, brake something, I don't know do something 'cause this is awful."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Agi-Ada",
        "review_rating": "1",
        "review_title": "Worst film I've ever seen!",
        "review_detailed_main": "I knew it was gonna be bad but I still wanted to see it. It's as bad as they said. I couldn't believe the director was the same person who did Gridlock'd!! Maybe his heart wasn't in it and he just did it for the money. The script was awful and Mariah's 'acting' was as bad as I knew it would be. It was blaringly obvious that no-one who worked on this movie had any creative license and 'Mimi' exacted complete control over the entire production. And what Terence Howard is doing in such a poor film, I do not know. Maybe he can't turn down offers from female singers. This film is pure self-indulgence and self-glorification which explains why everything about it was so terrible (except most of the music)."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "DMTOPGUN",
        "review_rating": "1",
        "review_title": "A Star is Not Born...",
        "review_detailed_main": "OK, Don't ask me why but I just witnessed possibly the worst film of not only this year but at least the last decade. That movie is called \"Glitter\". By the looks of the poster, you could tell this movie was only aimed at 11 year old girls, which it succeeded in. I don't even think that die-hard Mariah fans can call this a good film or her a good actress, that is if they're not totally brainwashed. Mariah plays \"Billie\" (basically herself in this story which is supposed to be somewhat autobiographical and rips off \"A Star is Born\". Billie wants to be a singer, so next thing you know it she meets a DJ, sings at a club, and shes a superstar, if only getting into the business was that easy. The sad thing here is not only is is sad to watch Mariah try to \"act\", which she clearly without any question can't, but that she's supposed to be playing HERSELF. i guess that says not only what Mariah is as an actress, but as a human being."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "2",
        "review_title": "Dear Mariah Carey, You Rock! Love, Mariah Carey",
        "review_detailed_main": "OK, I just had to see it, I don't know why, but you know how when you see a movie on the bottom 100, you're just so curious if the movie really is that bad? I remember back in 2001 how Mariah Carey was trying to so hard to be on top of the world, have a record and movie reach number 1 in one year, but everyone knew this was a typical movie where a pop star should just really stick to their day job. I don't know why Mariah thought this was a good idea, it's just so typical. Now granted, I do believe this was a bad movie, but as far as bottom 100 goes... I don't think it was that extremely bad, it's better than most pop star trying to be a movie star movies like In the Cut. Glitter is just poorly written and has bad actors in it, that's what makes it so unbearable to watch and makes Mariah look incredibly desperate for everyone's approval.\n\nBillie Frank was put into a foster home as a child when her mother lost the house to a fire, Billie grows up and becomes a back up singer in a group. But when a local DJ, Dice, hears Billie's voice, he wants to get her to sing his songs and become a power house sensation in the music world. They engage in a romance together and everything seems to go well when she is finally exposed and then gets exploited. But of course it starts to get into the way of her and Dice's relationship and she begins to realize the pain and sacrifices she must make in order to make it big.\n\nGlitter is just a cheesy movie, it doesn't do any harm, that's the reason for the merciful rating I'm giving it. But I'm just really surprised by Terrence Howard who is an incredible actor and he did this crummy movie. But then again we have Al Pacino in Gigli, it's one of those scary stories of life where if the money is good, what the heck, let's get the big star in it. Mariah looked so uncomfortable on camera and did a horrible job of acting. I feel bad because I'm just complaining so much about this movie, but if you're looking for a cheesy movie, I'd recommend Glitter, but it's torture on the brain, it made mine hurt that's for sure when I thought of all the money that was wasted on this box office flop.\n\n2/10"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "drumwolf",
        "review_rating": "2",
        "review_title": "Pointless and forgettable, but not uniquely horrid",
        "review_detailed_main": "I rented this film hoping that it would be as ridiculous, over-the-top, and unintentionally hilarious as Vanilla Ice's \"Cool as Ice,\" the standard that I hold all movie stinkers against.\n\nI came away disappointed. \"Glitter\" is certainly not a GOOD film, but it doesn't plumb the depths of awfulness to the extent I'd hoped for. I was hoping for a movie that would have my jaw dropping in utter disbelief and get me wondering, \"how much drugs did these people take to think this was actually a good idea?\" What I got instead was a banal, unremarkable movie with a trite, clichéd storyline that's been done a zillion times already: poor girl goes through bad childhood, but she's gifted with a beautiful voice that helps her become a big star. Yawn. It had the feel of an after-school special on TV, and as another reviewer already pointed out, it's probably not a coincidence that its director had only done TV shows prior to making this movie.\n\nThe one uniquely bad thing about the movie was the character of Dice. The actor who plays him, Max Beesley, is British, and at times his real accent would slip out underneath his inept attempt to talk like a Noo Yawker.\n\nI'm rating \"Glitter\" a 2 because I only reserve a \"1\" rating for sublimely horrible and unintentionally hilarious films like \"Cool as Ice,\" or utterly incoherent and ineptly done messes like \"Can't Stop the Music.\"\n\nTruly, sublimely bad films are worth your time and money for the perverse entertainment value, the same kind that you get from gawking at freaks on the Jerry Springer show. \"Glitter\" isn't in that category. It's simply tedious and trite, and for that reason it's a waste of time."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "a-twetman",
        "review_rating": "4",
        "review_title": "A mostly boring pop star success story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "madkins",
        "review_rating": "1",
        "review_title": "Burn your money, don't waste it on this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "butterfly23",
        "review_rating": "10",
        "review_title": "Great start for Mariah",
        "review_detailed_main": "This is a great film. I saw it in the theatres when it first came out. While it's not the best film I've ever seen, it certainly is not even close to being the worst. The music is fabulous and Mariah and the cast are great. My problem was with the script. Not very good. I think people are just dissing this movie because it has Mariah Carey in it. That's a stupid reason not to watch a movie and a cruel thing to do to a person. People just like to kick others who are down. Mariah was good in this movie. Room for improvement, but good."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "kenandraf",
        "review_rating": "7",
        "review_title": "Human Mariah!",
        "review_detailed_main": "Below average love/musical/drama about an 80's R&B singer and her life/love journeys.This movie banks solely on Mariah's unique presence.Only for huge Mariah fans,the movie has a good soundtrack and average story but suffers from below average directing and script coupled with bad screenplay.Although the movie does give the fans a good eyeful of THE SONGBIRD and does good in her intention to show a more human side of herself.Her acting at times shows some hidden talent but if it is to improve later on in her future movie efforts we shall see........"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "happipuppi13",
        "review_rating": "2",
        "review_title": "\"Glitter\" : All These Years Later",
        "review_detailed_main": "First, let me start by confessing something I freely admit. I am 100% a fan of Mariah Carey....as a singer. It's almost like what the girls in the '60s probably had when they looked at the Beatles. Whenever she's on TV or I listen to her music,I just naturally feel good.\n\nHowever, when it comes to \"Glitter\", yes I, like most,was really let down. I wont even go into the plot since it's a moot point at this time. Not even 100 years will change or make this film any better. Even though I'm a fan, I'm not so one sided in thought that I'd just accept it.\n\nThis film was a mistake from the beginning. Although the soundtrack is good and it's 2 singles \"Never Too Far\" & \"Loverboy\" were great choices. Whe a movie fails, so goes it's soundtrack.\n\nI heard about this film going into production back in 1998.\n\nNow, when a film this simple, takes nearly 4 years to make, that's the very first warning sign that it's not going to work. Not to mention some publicized production problems I read about.\n\nTo clear up one muisconception by the way, the film's release date was Septemeber 21st, 2001...not 9/11. Althogh some feel that would have been fitting.\n\nMariah herself stated on Oprah that she just wasn't good at saying \"no\" during the dizzying pace of her career in the 90's. I'm sure this was just something she contractually said \"yes\" too and moved on.\n\nThen,as happens with all \"super-stars\" (I hate that term) the low came after 11 years of riding high. There wasn't anything wrong with her music, she'd just been working too hard, too long and that's what led to this embarrassing moment and the one in 2002 on Total Request Live aka TRL.\n\nShe has of course rebounded from all this,her song,\"We Belong Together\" spent 14 weeks at #1 in 2005 and given her 2 otrher hit singles. The CD \"Emancipation of Mimi\", sold millions. She now does what \"she\" wants at her own pace and certainly has the market cornered on Christmas,\n\nAs far as I'm concerned you at least deservea review that isn't filled with venom. Loved you in \"Tennessee\" and \"Precious\" though.\n\nBut ... Keep on singing. (END)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "Good movie, great music, Mariah not a terrible actress",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "donbear09",
        "review_rating": "5",
        "review_title": "Ehh",
        "review_detailed_main": "That pretty much describes the movie. It wasn't as bad as it was made out to be but I wouldn't exactly call it my favorite movie either. It's one of those movies you catch on tv and don't really hate it but it's not going to be your first choice when choosing something to watch. Mariah's acting here isn't going to win her any awards but for someone who wasn't a professionally trained actress she didn't do bad. The movie also gets a bad rep since her career was mess at the time but it's aged better than Crossroads. The timing was just horrible when it came out. I would recommend this movie if you're looking for something to watch in the background or if there's nothing else on tv that interests you."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "michaeledward1212",
        "review_rating": "4",
        "review_title": "In Defense of Glitter",
        "review_detailed_main": "While it does play like a TV movie, I hardly think this is AS bad as it's reputation will lead you to believe. Glitter is very cliched, but Mariah is actually a surprisingly good actress, and her soundtrack for this album is extremely underrated and unique, as it captures an 80s vibe, and stands out from the rest of Mariah's discography. I've seen movies that were way worse that never got taken to task. I can't help but feel that Mariah's breakdown, the untimely release of Glitter near 9/11 and the bad luck of singers turned actresses all played a part in making Glitter one of the most derided movie of all time. I mean, in the bottom 250? No way is it that bad."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "musicalmarvell",
        "review_rating": "2",
        "review_title": "All That Glitters... Is Nothing?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "karatespark",
        "review_rating": "1",
        "review_title": "\"I could eat a can of Kodak and puke a better movie\"",
        "review_detailed_main": "Glitter isn't a bad movie, because Glitter isn't a movie... You don't belive in the characters, you don't care about the characters and their love story but that you can live with. The fact that they take the \"movie\" serious you can't... If you wanne see some movie in this genre, see Rock Star (or even Crossroads). But nothing will ever beat This Is Spinal Tap not even Mariah Carey. (And the quote's from The Mirror Crack'd)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Firebowl",
        "review_rating": "1",
        "review_title": "The star vehicle's final declaration of creative bankruptcy",
        "review_detailed_main": "Spending more than ten seconds of thought on \"Glitter\" is already setting a world record, since you've clearly outdone the producers by then. There were star vehicles before, depending for their drawing power mostly on the big name on the poster. But at least there was something else in them. Anything. \"Glitter\" is hollow on the inside, and on its surface it got nothing but Mariah Carey. Which is next to nothing considering the complete absence of acting skills this amazing singer presents here. Anything in this movie, from plot to script to setting to characters, is the product of one lame session of five-second brainstorming. Picking up every first line that came to their heads, the writers put together dialogue without any depth or meaning whatsoever, leaving some cardboard figures of characters behind even good actors couldn't have done anything with (not that there are any good actors in this one). Blaming \"Glitter\" for its formality is almost an insult to all decently unimaginative movies, whose makers just couldn't think of anything better. With \"Glitter\", no one even bothered to think."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "thebishop2",
        "review_rating": "1",
        "review_title": "Some Glitter doesn't shine",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Mankind-6",
        "review_rating": "1",
        "review_title": "Ouch....",
        "review_detailed_main": "It's hard to find one redeeming quality for this movie, but I'll say this, if you wear earplugs and close your eyes, its almost bearable.\n\nSeriously, dont waste your money, Mariah Carey's acting makes Whitney Houston performance in the Bodyguard Oscar worthy by comparison."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "abb13",
        "review_rating": "10",
        "review_title": "GREAT MOVIE",
        "review_detailed_main": "I enjoyed every minute of this wonderful movie. I was surprised to see how great Mariah was. It wasn't as bad as everyone said. To the people who havn't seen this movie. Go rent it. It is a great movie. Just cause Mariah is in it dosen't make the movie bad. Mariah was really good in this movie! I loved it! 10/10"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "machination04",
        "review_rating": "6",
        "review_title": "Jump off the bandwagon, people",
        "review_detailed_main": "I always get a good laugh off negative reviews of this movie because I know it's just bandwagon thinking: If the star hadn't been going through personal drama at the time it was released, or if it had featured ANYone else, it wouldn't get anywhere near the hate it does. Glitter was no worse than other debut feature films, like Crossroads, The Bodyguard or 8 Mile.\n\nPersonally, I liked the movie. It could have been a lot better, but what movie couldn't stand some editing or revision here and there. It's by no means deserving of any Worst Movie awards, since there are far worse on the shelves at Blockbuster."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tink-1",
        "review_rating": "1",
        "review_title": "A struggling singer realizes her dream of becoming a star with the help of her DJ boyfriend.",
        "review_detailed_main": "I watcheed this film when I was in the hospital recovering from mono and it made me even more depressed and frustrated. Mariah Carey plays Billie, a young girl whos struggling singer mother sends her to a social worker when she can no longer afford to care for her. Billie grows up, moves to NYC and begins to date a hot DJ who cuts her album. The movie sucks. Its a wah wah story with too many story lines: Billie wants to sing, Billie wants to find her mom, her boyfriend picks on her, she owes people money, her friends hate her success blah blah. Its set in the 80s despite not having anything to do with a period. Mariah overacts and underacts and basically looks like a moron on screen. The DP for some reason every once in awhile uses jump cuts which look ridiculous and arent done with true style. He also uses really awful eyeline matches. The music is boring, the costumes were stupid. Maybe someday studios will instead of making one awful multi million dollar picture like Glitter, they will make twenty meaningful student films. Until then boycott Glitter."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "kolchak25",
        "review_rating": "",
        "review_title": "Oh the pain.... Mariah believes she is Streisand in A Star is Born",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "theclash_classicrock",
        "review_rating": "1",
        "review_title": "Oh...my....goodness...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Rockstar1188",
        "review_rating": "1",
        "review_title": "Glitter= So BAD it's funny (but not on purpose)",
        "review_detailed_main": "Seriously if there was a rating in the NEGATIVES I would have put that. In all honesty watch it if you want to laugh at the stupidity and the poor acting. Mariah Carey is NOT cut out for acting. My friend and I decided that it was a good movie if you changed a few things. To make it good you would have to get different actors, a different script, a different plot, and a different director. Then it would have been a good movie. I am not at all recommending that nobody watch this movie. I truly think it is fun to watch and make fun of. I myself have watched it at least 4 times just for a good laugh. You can actually determine the ENTIRE movie's plot by reading the names of the chapters on the DVD which is pretty funny."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Mis_Behavin",
        "review_rating": "1",
        "review_title": "Makes me want to be sick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "edrpz",
        "review_rating": "1",
        "review_title": "Singing And Acting Don't Mix.",
        "review_detailed_main": "What do you get when you take a over hyped singer and put her in a movie? You get Glitter. This is an example of why most singer should stay singers. Acting is not something that Mariah Carey should have not let an agent talk her into. This was suppose to be a romance movie, but if I had been the guy that she was after, I would have stepped in front of a speeding truck just to get out of this travesty of a film. The only good thing about this move are the credits at the end. That way you know that you reache the end of such a bad movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "lia00027",
        "review_rating": "2",
        "review_title": "BAD ACTING from Mariah with BAD STORY",
        "review_detailed_main": "The movie was so bad. Not because the story but because Mariah, she can not acting even just for a little. Her acting was very very bad and she just used her voice, face, and body to be an actress. Did she really think that to be an actress we don't have known about act and just use our body? The man dead in the last part, which I should say \"What the hell movie is that?\""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Ina_no_name",
        "review_rating": "1",
        "review_title": "Dumb and not very convincing.",
        "review_detailed_main": "We all know that Mariah Carey was at her best in the 90s. Starting a movie\"career\" was probably a cry for help and fear to be forgotten. She should never been in this movie or any movies at all. She can sing but she can't act. So I hope she stick to her singing from now on. Doing what she can best. And why do all pop stars have to be in a movie anyway. Isn't it enough to keep with doing one thing? I don't even understand why I take my time to write this. It's a waste. This is just a movie for little girls that are huge fans of Mariah Carey. Nothing more. It's not a movie for ordinary adults for sure. I found it lame and weak. I simply got embarrassed for Mariah's sake. I don't understand why she wanted to do this movie at all. It's OK that she wanted to try something new but I hope she realise that this wasn't for her."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "duffyboy666",
        "review_rating": "1",
        "review_title": "Come gather round, and watch a pop star annihilate her career in one flick of her fingers!",
        "review_detailed_main": "I want to laugh. Really I do. And I want to laugh hard.\n\nI shouldn't really because this movie absolutely slaughtered a woman's music career and landed her in a mental hospital. But I am just desperate to laugh my head off, either that or burst into a fit of tears.\n\nHave I gone insane? Has reviewing so many crap movies finally tipped me off the edge? No. All it is is that Glitter is an absolute turkey. If you whacked it with stuffing and served it with potatoes on Thanksgiving, your Aunt Mildred wouldn't be able to tell the difference.\n\nThis move is as awful as everyone said it would be. I'm surprised that Blockbuster isn't selling it for £0.01p The movie is supposed to take place in 1983 but the plot is so predictable you know what's going to happen after watching the opening credits. Billie Frank abandoned by her mother and sent to a group home is going to grow up and MAKE IT BIG. On this journey down the yellow brick road to the riches her manager \"Dice\", two group home buddies and a cat that replaces Toto. Sadly the cat is smart enough to split halfway through this nightmare of a film and not come back until near the final act. If only I were as lucky as he is.\n\nThe film is a 24 carat vanity project just like Spice World, Crossroads, Gigli and In The Mix etc.... This type vehicle is not for \"actors\" nor discovering \"acting ability\" - its more a stand, pose in an outfit, smile and lip sync your way through the horrible script. It's wrong. It's a crime. And it should be banned.\n\nAnd eventually Mariah Carey ended up not with Glitter in her eyes, but with tears. Thankfully for her she's managed to resurrect her career with that We Belong Together song but the scars are still there.\n\nOverall, \"Glitter\" is a pathetic piece of cinema and a very meaningful failure for Mariah Carey. Shallow, narcissistic, cliché, stupidly dramatic, badly acted, with average directing, \"Glitter\" is, in the purest meaning of the word, a WASTE of time.\n\nDon't watch this film."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "zack-50",
        "review_rating": "10",
        "review_title": "Mariah Carey is a top-notch actress",
        "review_detailed_main": "Personally, I do not understand why this movie has received much bad press. Even though I am a huge Mariah Carey fan, this movie was a very nice tale that had many links back to Carey's own biography, which interested me more.\n\nThe music (soundtrack) was superb and I've watched/listened to the movie countless times. All the characters acting was high quality (except for a couple of cheesy instances) and their lives were interesting.\n\nIt made me laugh and cry, but mainly, it made me smile.\n\nA lot of people are quick to judge a movie simply because it has the \"Mariah Carey\" name on it (whether good or bad). This WAS a good movie and deserves much more than what is given."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "peanut8807",
        "review_rating": "7",
        "review_title": "somewhat out there",
        "review_detailed_main": "i thought this film was okay, it was not great, but not terrible. yes i realize it was cliched, and predictable, but alot of movies are. and yes mariah carey CAN NOT cry! i thought dice was pretty cute actually...overall i give it a C+!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "michaeltrivedi",
        "review_rating": "1",
        "review_title": "Why Isn't There Zero Stars?",
        "review_detailed_main": "I was actually expecting much better. I was let down. Mariah is one ugly singer. She has no business on screen. The movie stinks. Her childhood scenes in the beginning is like a Lifetime documentary about the end of segregation. Don't know what that means, but the feeling it brings is the feeling I got watching it.\n\nTorch this movie immediately\n\n1 star"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "RhondaWeasley",
        "review_rating": "",
        "review_title": "BORING",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "Awful, in every possible sense of the word",
        "review_detailed_main": "Mariah Carey. The woman. The singer. The pop-tart(like the pun? You know, Pop as in pop music, and tart, as in... eh, forget it). Her face is attractive, her body is desirable, her smile is blinding and her voice is annoying, loud and reminds me of sonar, or dog whistles. She's made a name for herself, in music, making plenty of money and gaining popularity. That's fine. As long as she doesn't force the music down our throats(or rather, into our ears), I'm fine with that. Then she had to go and make a movie... now, I'm one who believes very much in tolerating everyone. We all have to be here, and we can't all do or like the same things. But when you make such a bad movie... I'm speechless. Seriously. Whoever thought up the idea for this Mariah Carey-vehicle should be issued a restraining order; stay at least five hundred yards away from movie-making at all times. The director(who's apparently only done forgettable projects in the past, as well) should be fined for putting such a thing on film. The editor, or whoever else was behind the fast \"stylish\" cuts... should be forced to take a film class(which, I suspect, would be the person's first ever). The plot is ridiculous and uninteresting(but, then again, this is based on Mariah Carey's life, so what should one expect?). The pacing is bad. The acting is really, really bad. Carey acts worse than she sings, and anyone who's heard her voice knows exactly what that means. The characters are poorly written and one-dimensional. The dialog is so bad that it's almost painful to listen to... it's almost as bad as Carey's singing. The film is just so poorly done in every thinkable, conceivable way. Only die-hard Mariah Carey fans should spend time and/or money on this mess. Oh, and in case you hadn't noticed or were wondering; yes, I hate Mariah Carey. So I may or may not be biased against this movie... but I hate Ja Rule and Leslie Nielsen as well, and they had semi-big parts in Scary Movie 3, and that I enjoyed immensely. This one just had nothing to offer at all. I recommend it exclusively to big fans of Mariah Carey. Everyone else should avoid this like the plague. 1/10"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "audaxego",
        "review_rating": "5",
        "review_title": "give it a rest",
        "review_detailed_main": "Honestly people... I don't really see what the problem is with this movie! Mariah Carey is not my all-time idol because she has a bit of a slutty dumb blonde-image but she did not do THAT bad in her movie! She sings great and even though the acting wasn't abominable... You have to give her credit just for having the balls to make a movie! The movie got bad critics even before its release, and that's just how it is but you have to give it to her: when she opens her mouth, chills up and down your spine because my God... What a voice! But I must admit: She just wears horrible outfits and the soundtrack of Glitter sucked big time. 1 consolidation:Britney did way worse of a job in her roadway movie!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "butterflyqueen",
        "review_rating": "1",
        "review_title": "Painful",
        "review_detailed_main": "I can honestly say that I would be hard pressed to name a worse movie. Mariah Carey has a beautiful voice, and her music is very nice, but this film ranks right up there with the Spice Girls movie and The Care Bears film.:p"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "fahrmeier",
        "review_rating": "1",
        "review_title": "What the Hell???",
        "review_detailed_main": "Yeah um....this movie was bad. Everyone has said this before but I don't think it can be said enough. Oh my loving God this had to be the most Whorid (spelled that way on purpose) movie on the planet.\n\nDuring every scene Mariah wore something sluttier and sluttier and sluttier, and quite honestly, it wasn't a good thing It was a bad thing\n\nThere is one scene where her boyfriend is showing her his apartment and all his instruments and he walks over to one and says \"yeah this is my favorite\"...Doesn't sound too bad? Oh Whoops! Forgot to mention that it was a Xylophone!!!\n\nToward the end of the movie I flipped on the director's commentary on the DVD. This is an exact quote \"Ummmmmmmmmm *sigh* uhhhhhh I....am, really not sure what were were trying to do here....\"\n\nWhen the director is ashamed of a movie....you know its bad. I give this movie a 1...because thats as low as I can go."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ConfuciusSay",
        "review_rating": "2",
        "review_title": "Why?",
        "review_detailed_main": "When I first rented this film, I was not expecting much. I should not have been expecting anything at all, because that is exactly what I got from this film: nothing (other than extreme confusion).I was well aware that the movie had been panned by every respectable critic on the planet and that it was a rent-at-your-own-risk endeavor. But I thought perhaps the magnitude of its stupidity had been exaggerated, and with the same impulse that leads many people to stop and watch a car crash, I rented this movie. What I found was perhaps the most annoying piece of fluff ever created by the media industry. This film has no solid plot or premise. The holes in the story are big enough to swallow the Grand Canyon. I found myself waiting for some kind of purpose to emerge as the movie progressed. I was monumentally disappointed. The movie is either so complex that I as a normal person cannot grasp the symbolism or so horribly shallow that only the feeblest of minds could see any point to this drivel disguised as a movie. I believe unfortunately it is the latter rather than the former. There are many aspects that make this film weak. Let us be honest. To say Mariah Carey is not the greatest actor in the world would be the understatement of the century, but this film's lack of substance does not solely rest on her slender shoulders. A cast of B-list actors who could not act their way through a wet paper bag also add to this failure. In addition are bad writing and plot. There was not one piece of original, inventive material in the whole movie. The whole film seems to revolve around Mariah Carey's appearance. Every other second she is gyrating around in some skimpy ensemble. The success of the film was largely tied to Mariah Carey's cleavage. This approach might have worked if it were a concert special or if the character weren't so two-dimensional and aggravating. The movie is reminiscent of Elvis films of the 50's and 60's in which the music is based around the charisma of a popular performer, but honestly Mariah Carey is no Elvis. Bad acting, bad writing, bad directing, bad everything. Don't waste a hour and a half of your life on this movie. WARNING! Rent at your own risk! You have been warned. .0000000000000001 of 10 (because you can't vote a zero)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "bell-16",
        "review_rating": "1",
        "review_title": "just awful",
        "review_detailed_main": "took my niece to see it. solidly awful from start to the overdue finish. I don't think much of this diva music in the first place, but that was minor compared to what was undigestable in this movie.\n\nFor anyone who believes this is a GREAT DIVA MOVIE, I would urge they rent The Rose or Lady Sings the Blues, and stop trying to rationalize this waste of time. Mariah Carry didn't have much to do with the failure of this movie, it was dead and buried long before she signed on. There were enormous leaps of inconsistency and a storyline about as interesting econ professor recounting his decision to enter the field. Which is appropriate because it seemed the only purpose to this movie was the use of Carry's name to make a buck. It was a painting by numbers style of movie-making, they may as well have substituted Lance Armstrong and switch the mushy 90's R&B with bicycle racing, or better yet, some child actor like Elizabeth Berkley playing a character motivated by dreams of stripping in Las Vegas - wait, didn't they do that already?"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "wildhippychik",
        "review_rating": "1",
        "review_title": "A cultural atrocity.",
        "review_detailed_main": "The thing is, this movie probably deserves a 3 instead of the one I gave it. The reason is that it's so bad, it gets you thinking. Thinking about the nature of film and music and how morons get the money to make movies etc. Also, imagine if a *good* director was instructed to make a movie this as bad as it is. (I *can* imagine it because this almost looks like a plot to ruin Mariah's career - hey wasn't her husband a bigwig that she dumped?!) I think what would happened most times is the director would see THIS cut and think: \"no, no, I have to make this better, NOBODY is going to believe a movie could unintentionally be this bad.\" You also get a few good laughs just at how obvious and obtuse the whole thing is.\n\nWhy then, did I have it a 1? Well, I consider a big film like this turning out this horrid to be a small crime. One where the wealthy people involved should be fined. Mariah should have given her paycheck to charity - it's the only ethical thing to do given the cultural atrocity this movie represents."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "BigRic1219",
        "review_rating": "10",
        "review_title": "A Great Movie!!",
        "review_detailed_main": "I don't understand why so many people were hating on this movie. This movie was pretty good in my opinion and I'm not even into the romantic kinda movies. I think the reason this movie bombed is because of the release date, I mean c'mon Sept 21st, 2001 was kind of a weird date to expect a movie to be a blockbuster hit. Well that's my oppinion.\n\nPeace, RIC"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "donjaymor",
        "review_rating": "6",
        "review_title": "After all, this film glitters.",
        "review_detailed_main": "Watching this film 20 years later left a refreshing take on my view of the story's plot than it did back in 2001. I understand the story more so now than my first viewing, and can appreciate Mariah's potential as a budding actress at that time. I must say, I didn't realize then how good Da Brat and Max Beesley were in this film. At the end of the day, the film's script and execution could've used more 'beef' but a decent plot and film to showcase Mariah and that voice."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jtcope",
        "review_rating": "1",
        "review_title": "Worst film ever.",
        "review_detailed_main": "Worst. Ever. Worse than Battlefield Earth. Worse than The Muskateer. Worse than any other film that has ever been shot. First year high school AV students make better films than this. Good lord. I cringed the entire time. Worst film ever."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Deafy the Timid Diver",
        "review_rating": "",
        "review_title": "Does CRAP glitter!?!?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "squeezebox",
        "review_rating": "1",
        "review_title": "Not quite as bad as you might think... but still awful.",
        "review_detailed_main": "I wanted so desperately to despise this movie, for Mariah Carey is to me what fingernails on a chalkboard is to others.\n\nBut GLITTER isn't the kind of bad movie that is so godawful that it's something to behold, like PLAN 9 FROM OUTER SPACE or SHOWGIRLS. It just sucks. The movie is a 90 minute yawn. It's like watching a documentary on selling Amway. Dull, pointless, mildly annoying.\n\nThis movie is so devoid of ANYTHING, it isn't the embarrassment to Carey's career so many of us had hoped it would be. It's a paperweight. It's just something sitting there that you step over. At least we can get some satisfaction out of the fact that the movie tanked at the box office.\n\nMariah's seemingly bottomless ego and bewildering appeal have faded somewhat in the years since GLITTER's release. I doubt the movie had too much to do with it. It probably has more to do with people catching onto the fact that, while she can sing, there's nothing whatsoever behind that voice."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "AgentB",
        "review_rating": "1",
        "review_title": "Glitter is so bad they need to invent a new word for it",
        "review_detailed_main": "This movie is horrible from beginning to end. The casting is crap, the costumes are horrible and most of all the writing sucks. No self-respecting movie producer in their right mind will ever cast Mariah Carey as a leading lady(Or anything for that matter) after seeing this garbage. And a hint to all you aspiring actors and actresses: Do not take a part in a movie that has Mariah Carey in it. That movie will bomb without a doubt. Doing porn will hurt your career less.\n\nGlitter is a new word for anything negative in my vocabulary. I truly think that if hell exists, they are making people watch Glitter over and over and over again in there. Or listen to Mariah's music. Which ever is worse, I certainly can't tell."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "AdodiMalik",
        "review_rating": "1",
        "review_title": "One of the worst i've ever seen.",
        "review_detailed_main": "There is one good scene in this movie. The best part about it is that the scene is at the beginning, and you don't have to stick around to watch Mariah Carey come on screen to take it downhill from there. Just take in the incredible Valarie Pettiford singing the opening song and then pop the tape out and take it back to the video store for a refund.\n\nJust awful.\n\nMariah Carey can't act at all, and there's nothing that a so-so supporting cast can do to help strengthen a predictable and uninspired script.\n\nDon't do it to yourself. If you're just a die-hard Mariah fan, get the soundtrack CD and save yourself some pain."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "daniel_pryor",
        "review_rating": "1",
        "review_title": "anyone who liked this movie is either a 13-year-old girl or an idiot or both!",
        "review_detailed_main": "Anyone who liked this movie should have their head examined. I have no doubt in my mind that this will win not only worst picture of the year, but worst picture of the dang decade! I think mariah carey had a mental breakdown because she knew she would be embarrased to release the picture! Please Mariah and do us a favor: stick to your singing, or better yet just go away!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "g_barnette",
        "review_rating": "1",
        "review_title": "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAA !!! it was awful!",
        "review_detailed_main": "I was not having high expectations when I rented this movie.I just thought maybe I would get a good laugh or 2 at a really bad movie !! or see if was a sooo bad it was good kinda cult movie feel to it ..well lemme tell ya it was unwatchable..basically Mariah Carey looks dumbfounded in alot of the scences in the movie and delivers her lines in plain tone of voice (not giving much passion to her performance)..and there absolutely no chemistry between her and her love interest:A DJ who rediscovers and rescues Mariah after she has signed on to a girl group as a back up singer and Mariahs vocals are used for the lead who cannot sing at all (think Vanity 6 or Apollonia 6 only with 4 members instead of 3) most of the movie was set in 1983 and there not true to the fashions and trends of that time there was not even any chemistry between Mariah & 2 best girlfriends in the movie...(of course they were not as attractive as Mariah as well)which is typical in most Hollywood movies starring an attractive actor or actress..."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "full_meddle_jacket",
        "review_rating": "1",
        "review_title": "For Teenage Fans Who Want to See Mariah's Ego",
        "review_detailed_main": "\"Glitter\" is one long, terribly scripted, badly acted, cliche. Based on Mariah Carey's \"struggles\" (yeah right) to acheive stardom, \"Glitter\" is much in the same vein as Britney Spears' \"Crossroads\"--which means, the film is a \"pop-star-worshipped-by-teens-placed-in-front-of-a-camera-for-two-hours-smiling-and-singing-anything-but-acting\" movie. The producers of course knew Carey knew nothing about acting; her previous experience was limited to running up and down guys' legs in her videos. So naturally, they replaced any remnant of a script with her drawn out, ear-piercing \"music.\" Neil Diamond did a better job in \"The Jazz Singer,\" though he was stuck in the same scenario--a pop star praised for his music, crammed in a movie by greedy execs, only leaving an unforgettable ugly stain on his career. Fortunately for Mr.Diamond, his failed movie didn't result in a mental breakdown. \"Glitter\" is only for Carey's teen fans who will automatically praise the film and blame everyone as being \"jealous.\" Well, personally, I sure wouldn't be jealous of being in a disaster like this."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "darby5222",
        "review_rating": "1",
        "review_title": "So bad it's gooooood!",
        "review_detailed_main": "This is what happens when a star is surrounded by \"Yes\" men.\n\n\"Yes Mariah, you can act.\"\n\n\"Yes Mariah, that does sound like a good idea for a movie.\"\n\n\"Yes Mariah, J.Lo did steal your career; go and show her a thing or two.\"\n\nWell, Mariah sure went and showed J.Lo (and the rest of world) something: That her acting should remain confined to a music video! This is unfortunate, as currently stars are \"branding\" themselves into viable crossover businesses like acting, publishing, and clothing. \"Glitter\" is why Mariah has had to settle for less.\n\nNow, it's not that the film is bad - it's terrible. And it's not that Mariah can't act - she's truly inept. It's all the pieces put together that make \"Glitter\" the new millennium's first true camp classic: The poor supporting cast, the clichéd plot devices and the implausibly laughable ending.\n\nAs if this weren't enough, \"Glitter\" is the only film ever made where the star never says more than three words at a time. It's as if the Director got sick of hearing Mariah's attempts to act and just reassigned her dialogue to others throughout filming!\n\nSo if you're a fan of films like 'Mommie Dearest,' do yourself a favor and get some \"Glitter\" today!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "gt500ro",
        "review_rating": "10",
        "review_title": "I really liked this movie!!!",
        "review_detailed_main": "Yes i've read the critics,and i think all who wrote bad things about the movie really didn't understand it.It is a movie that i want to see again and again.Yes, i am a huge Mariah fan but i will analyse this movie in cold blood.Indeed the acting is sometimes bad,and what do you expect, she is a singer after all.Still this doesn't make an obstacle in seeing the movie,that flows like juice in a glass.The movie is relaxing ,the songs are good, and if you love Mariah, you will love to see a part of her life at TV.I understand that she was upset after the movie, it was not the critics that upset her.It was the fact that she put a part of her life in this movie and most of the world didn't appreciate it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Austin_Powers-1",
        "review_rating": "6",
        "review_title": "Mariah Carey: The Movie",
        "review_detailed_main": "First of all I must be honest and tell that I really adore and love Mariah Carey as a musician, her voice is fantastic and she's SO beautiful \u0096 But how does she turn out as an actress? Her acting skills are actually okay comparing to other singers trying to make a screen debut, ex. Michael Jackson in 'Miss Cast Away' or Elvis Prestley in all of his (how many?) films.\n\nBritney Spears did okay in 'Crossroads' and Mariah Carey does a decent job as the hard working girl trying to reach the stars.\n\nI've seen worse movies than 'Glitter', maybe because of all the bad reviews I've read. Though I would not recommend people to watch it, I would not tell them to avoid it either \u0096 But you have to be a Mariah fan to enjoy it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tearabell",
        "review_rating": "1",
        "review_title": "BAD BAD BAD",
        "review_detailed_main": "To say that this movie was BAD is an understatement. I cannot believe that anyone would back this movie being made. I guess when it comes to money anything goes! Man o man, this is definitely on the top ten of pointless horrible movies that \"big headed\" stars made."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "traceyl-1",
        "review_rating": "",
        "review_title": "Not as bad as some say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Quinoa1984",
        "review_rating": "2",
        "review_title": "Do I even have to go into this one?",
        "review_detailed_main": "Glitter, the movie tailor made for Mariah Carey (is that a good or bad sign), has her as a singer with dreams who gets a deal with a DJ (Max Beesley) and goes on her track to stardom with some bumps along the way. The plot, in and of itself, isn't terrible and could've been more credible, but when you hand over the project with someone like Carey, it doesn't work because we think the story is like her life, but it isn't. I didn't like the movie, it had scenes that were present, but they sometimes don't go anywhere. Not much insight, not much to consider good moviemaking, and basically an excuse for Carey to strut her body (not a bad excuse, to be sure, but it's destracting as well). Plus the songs DO sound the same a lot of the time, as it is pointed out at one point in the movie by a character. D-"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "nagyroland-00391",
        "review_rating": "1",
        "review_title": "Another Star is born movie...",
        "review_detailed_main": "But this one is terrible in all the way. Horrible acting, bad plot, cliches in every minute.\n\nAs in her videos, she just acted like she's the biggest popstar in the world. The soundtrack is boring, and poor.\n\nDon't waste your time with this movie, it's a trash."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mizziah74",
        "review_rating": "1",
        "review_title": "The movie of the year has finally arrived!",
        "review_detailed_main": "Wow! Glitter has to be the most enjoyable movie-going experience that I've had in a long time. Of course, the fact that I had quite a few drinks before I watched this stinker made the ride more bearable.\n\nFirst, I'd like to say sorry to all those Mariah Carey fans out there. At least she'll have her recording career to fall back (maybe). Second, I have nothing personal against Mariah. I'm sure she's a great person once you get to know her, but Glitter has got to be the most f**king ridiculous movie I've ever seen.\n\nCome on!!! Who at 20th Century Fox green-lighted this turd? This flick sets new standards for film incompetence. The acting (what little of it there is) falls to capture any genuine emotion, and the script offers us nothing in the way of believable characters or dialogue (not to mention the occasional plot absurdity - you'll know them when you see them) Director Vondie Curtis-Hall tries to give the movie some glossy production value, perhaps to take your mind off the fact that Mariah can't act, but he fails, allowing editor Jeff Freeman to go insane in his use of aerial shots of NY (including a shot of the WTC towers, which will probably be the only thing in this flick that will generate any honest reaction from the audience) and some bizarre editing in certain scenes that I suppose was done to give the movie some \"style\". Oops! That didn't work!\n\nWhat else is there to say about this flick? I knew walking in that this was going to be a bad movie. That's why I got a couple of drinks before the movie to enhance my \"Mariah experience\", but this movie pulled the rug out from under me. It was actually worse than I thought it would be. I actually started feeling sorry for Mariah that she was in this! She's a talented singer, but for God's sake, can somebody please talk some sense into her when, and if, she decides to do another film!\n\nSo, what are you waiting for? Get some friends together, get sloshed, and catch this little \"gem\" while you still can. I'm guessing it won't be around for long!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "alibeydoun",
        "review_rating": "1",
        "review_title": "worse than i could have ever thought!",
        "review_detailed_main": "This film is even worse than what you've heard. i was literally sick in the stomach after watching this rubbish. mariah carey's acting is absolute torture, that by the end of the film, i just wanted to throw something at the screen. The story is predictable and thin, and the acting is bad.\n\nStay Away at all costs!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "joseayarza",
        "review_rating": "1",
        "review_title": "Very boring",
        "review_detailed_main": "Oh my god, this movie was boring. That story couldn´t have been less interesting. I mean, the movie just drags on and on, and like, nothing happens. And when something happens, you don´t even care. Mariah Carey´s acting is terrible, as well as the rest of the cast. 1/10, I'd give it a 0 if possible."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "chrisjd1961",
        "review_rating": "1",
        "review_title": "Oh No!",
        "review_detailed_main": "The movie was on satellite TV. Figured since Mariah has a hot body, this movie cannot be too bad. It started out bad, got worse, and then I was hooked. I just had to finish this thing to see its whole \"brilliance\". Summary - the worst 90 minutes in my life."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "David, Film Freak",
        "review_rating": "10",
        "review_title": "In music she found her dream, her love, herself...",
        "review_detailed_main": "It's incredibly hard to view 'Glitter' objectively given the facts that it was a huge Box Office bomb and that also the leading lady who was supposed to prove she was not only a singer but a an actor too, despite being mentally ill at it's release. Now I'm not saying that this review is completely un-biased, after all, I'd been brought up on a healthy diet of Mariah Carey, but I did rent this movie a few weeks ago (it being not released to cinema) due to pure curiosity.\n\nThe multi-octave song-bird's film vehicle (originally titled 'All That Glitters... a much better name I think) opens with in the early 1960's, in an all-black bar with a woman (Valarie Pettiford) singing a jazz/blues number before introducing her young daughter, Billie Frank (Isobel Gomes), to the semi-interested audience and the two launch into a duet which wows the crowd. Cut to the next few shots where Billie's mother tries to get money from Billie's father, before giving her up to an adoption agency.\n\nFast-foward to the bright and bouncy 1980's where all-grown-up Billie (the aforementioned Carey) is dancing in a club with her two best friends Louise and Roxy (Da Brat and Tia Texada), who are soon offered as back-up singing gig for no-talent, good-looking up-and-comer Sylk. Needing the money, the 3 take the job, and the producer finds Mariah's... er... Billie's voice completely spellbinding - and chooses to use her voice instead of the God-awful voice that the main singer is belting out.\n\nA recording of a song entitled \"All My Life\" is handed to a Club DJ - DJ Dice to be exact (British actor Max Beesley who puts on a 'wigga' accent - sometimes really good, other times really bad) who plays it and instantly falls in love with the vocals. Upon discovering that the vocal used is in fact Billie's he instantly wants to be her producer (of course her beautiful looks have nothing to do with it!). So, makes a deal with her old producer Timothy (Terrence Howard) to take the gorgeous Billie and her back-up singing, loud-mouthed friends and take them under his wing - for the reasonable (!) price of ONLY $100,000! So the Dice & Billie end up becoming good friends and record a song, \"I Didn't Mean To Turn You On\", and it is played for music executives, and before you can change the butt groove in your seat, Billie is signed to a major record label.\n\nOf course, the road to musical superstardom is not an easy one and Billie has several troubles - the video director for her first single \"Loverboy\" wants her to parade around in nothing but a piece of string (Billie minds, Mariah wouldn't) and there's also the little problem of her undeniable attraction to Dice. The two become an item and she even moves into Dice's modern, typically New York apartment. Billie's first single unsurprisingly tops the U.S. chart - for ten weeks, at which point the record company are eager to release her first album which they want full control over - p***ing off both Billie and Dice.\n\nOur star-crossed 80's lovers start fighting as her career begins to blossom. She's invited to all the right parties and invited to guest on all the right talk shows - a dream she's had for many years, but amist all of the amazing goings-on, her two best friends are seeing less and less of her and Dice is becoming a drag - she even has to bail him out of jail before an appearance on a show. The two have a massive fight, leading Billie to move out (and Girl Power-ly slap his face). Her attempts at tracking down her addicted biological mother fail as the adoption agency have lost contact with her. Also during this time, she records a single with pop singer Rafael (Halle Berry's musician hubby Eric Benét). The duet, titled \"Want You\" is another number one for Billie, and her biggest dream is about to come true - she's about to play at Madison Square Garden.\n\nThe day of the concert arrives and Billie returns to Dice's apartment to find him not there. Unfortunately Billie's day won't exactly go as planned - it seems, achieving your dreams sometimes means that you'll lose the ones you love. And with that, I won't go into the final minutes' in detail, but I'll just say that is very emotional.\n\nSo that's the story, but were the performances any good? Well yes and no. Mariah Carey (although despite what you've no doubt heard) is a promising actress. Her acting isn't brilliant (yet) - there are times when you feel she goes overboard (especially in the emotional bits). I've found that her most convincing scenes (and therefore best ones) are where she gets angry. Her stereotypical best friends are good too and add a needed comical element. Beesley as DJ Dice is good, although he sometimes seems very fake. Anyone else worth noticing is probably OK.\n\nThe soundtrack is brilliant. Carey's 9th studio album is a pop/r&b LP with great recordings. From the pumping 80's tracks (Last Night A DJ Saved My Life, Didn't Mean To Turn You On, All My Life) to the gorgeous Mariah-like ballads (Lead The Way, Reflections and especially Never Too Far) plus the Eric duet 'Want You' and the Ja Rule infected 'If We' - it's just as good as her previous efforts.\n\nOverall, 'Glitter' IS a film that the troubled songbird should be proud of. It is a drama, though - and watch that, don't think it'll be laugh-a-minute. It's emotional, passionate and with Carey in the lead - it's one rollercoaster ride you'll like at the time and will leave you wanting more. Recommended definetely... Go Mariah!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "roger.dalsaune",
        "review_rating": "7",
        "review_title": "surprising!",
        "review_detailed_main": "I watched this movie because one critic (that I usually trust) said all the other critics where wrong, and this was a good movie! I wondered what he had been on while watching, but intrigued, I decided to check it out for my self. Surprisingly I now agree with the guy! Glitter is a rather nice little film. Sure it won't win any Oscar or anything. This isn't an instant movie classic, but then it surely ain't as bad as the majority of critics want you to believe either.\n\nOne thing that probably should be mentioned is that Glitter is not a film to watch if you want something so bad you can laugh at it. It just isn't that bad. Instead one should relax and enjoy the film for what it is. A feel-good romantic drama from the 80's music world. Mariah Carey as an actress is believable too. But then she's almost playing herself so why shouldn't she be:-) a 7 out of 10!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jonsplec",
        "review_rating": "1",
        "review_title": "help me i need a doctor",
        "review_detailed_main": "Cos this film is so bad!\n\nI don't know what is worse Mariah Carey's acting or Max Beesley's american accent?!\n\nAvoid at all costs and save yourselves!\n\nSPOLIERS AHEAD\n\nThe storyline is so predictable and self infatuated,Carey is a struggling singer and gets a record contract thanks to Beesley and Beesley gets shot.Oh no!\n\nThis film wouldn't have been so bad but Carey is so bad and Beesley is fighting a losing battle throughout,but remember kids if your gonna\n\nstar in a film make sure you get as much of your own music as possible so its not a totally wasted effort."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "A Star is Killed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "cat_spasms",
        "review_rating": "1",
        "review_title": "An Amazingly Bad Movie!",
        "review_detailed_main": "Wow...just wow.\n\nI saw this a while back when on VH1, and I still have that reaction when anyone mentions the movie. I'd heard how bad it was, and figured to watch it, thinking it couldn't be that bad or that it would still be funny to laugh at...\n\nIT WASN'T!\n\nI don't know if I've seen a worse movie than this before. The movie did not even make sense. It's ending had nothing to do with the rest of the plot...she becomes a superstar, but she only cares about finding her mom in the end?\n\nI don't see how anyone could like this movie, except for people obsessed with Mariah's breasts. It was dull and rather pathetic. I regret seeing it now completely. Don't go rent it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sarahsarah666",
        "review_rating": "1",
        "review_title": "UUUGGHH!",
        "review_detailed_main": "What is it with people who get a little bit of fame and think they can do anything...\"hey Mariah, I bet you can fly. Go jump off that building.\"\n\nI am so upset that this movie was made and I'm even more upset with myself for sitting through it. America should loop 'glitter' and 'From justin to kelly' together and use it as a torture device."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "o_cedar",
        "review_rating": "2",
        "review_title": "Funny to watch while trying to predict the future.... we were good at this game!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Reaper",
        "review_rating": "1",
        "review_title": "Painful",
        "review_detailed_main": "My, oh my. What an atrocity.\n\nIf the insipid script and trite plot don't get you, then the flat acting and stereotyped characters (including Mariah's) will; and if you can stomach both of those, the photography will.\n\nThere is one decent line in the movie: when Mariah first encounters escargots, she says, \"someone went all the way to France for this?\" Not bad, but a single line does not make up for the banal dialogue or the tired \"girl gets everything but loses her soul\" plot line. Even the sex scene looks like something out of a soap opera.\n\nAs to the direction, the less said, the better. I've seen home movies where more care and thought was given to the composition. When artsiness intrudes, it is annoying and distracting (such as in the transitions. Not standard dissolves or fades, but intrusive helicopter shots of Manhattan. Other annoying tricks of cinematography: a few bits of slow motion for key moments; the digital distortion of the background in one shot).\n\nFinally, a bit about the music. Other than the closing credits, I don't think there was one full-length song by Ms Carey. Plenty of snippets, of course, but no actual songs. In other words, you can't even call this a musical."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jessegehrig",
        "review_rating": "1",
        "review_title": "yo yo yo get you some glitter yo",
        "review_detailed_main": "This movie, oh let me tell you, this movie, man like I just read about all the artists Mariah Carey collaborated with on the soundtrack for this movie and I'm thinking they screwed up,big time. What a waste of their time, seriously, Glitter? No way man, no way. I read Mariah was shopping the script around for three years before some crazy fool bought it, my first thought was somebody who had the power to say \"no\" to Mariah Carey obviously wasn't working hard enough, 3 years? 3 years? man,she should still be shopping this script, don't you all know its Mariah Carey? Can't you read that script? Its terrible, its a shameless self-indulgent hollow one hundred and four minutes that you can never get back, no way at all."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "dudleydvon",
        "review_rating": "1",
        "review_title": "This movie sucks",
        "review_detailed_main": "Carey set her hopes to high, she tought it would be good, but too bad she's the only one who liked it. Horrible acting, 0 out of 10 or -100 out of a possible 10. I could post all of the awful scenes but I would be here all day. The good thing about this movie...when the credits came on. Worst movie of all times!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "chamadol",
        "review_rating": "4",
        "review_title": "This should have been a \"made for T.V. movie\"!",
        "review_detailed_main": "It seems everyone either loved or hated this movie. I give it a 5. Had I paid my hard earned money to see this film I wouldn't have been so generous.\n\nMariah makes Madonna look like an Oscar winning actress! She is so wooden! The story is nice but far too predictable. The only thing that \"glitters\" in this film is Mariah's vocals.\n\nGlitter is like a made for T.V. movie. It even has nice little scene changing effects that scream out \"Insert commercial here!\"\n\nDon't pay to see this movie unless you are a big Mariah Carey fan. If you hate Carey, don't even bother seeing it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "onefabbyally",
        "review_rating": "10",
        "review_title": "Glitter great movie",
        "review_detailed_main": "Although I'm not the greatest fan of Mariah, i decided to check this movie out to see if it was as bad as people made it out to be...and was it??? the answer to that is NO.(in my opinion) O.K so its not the greatest thing in the world but its not that bad at all, i instantly fell in love with Roxy and Louise and for some reason Sylk, her character had me in stitches with the terrible singing!!! Quote \"I found it in my heart its you i tre-eee-eesure\"lol\n\nmariah wasn't so bad either but i must say the joke about the snails made me cringe!.\n\ndefinitely check this out don't listen to the bad critics... give it a chance, i know you want to!!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "DarrenLPhilips",
        "review_rating": "7",
        "review_title": "Better Than Crossroads!",
        "review_detailed_main": "Glitter is actually a really entertaining movie. It's been said before, not an award winner - but it has a stronger plot & soundtrack than any of the other crop of female popstar movies. Mariah can act, & does so well in this light weight fun confection of a movie. She has a sharp wit which comes across in her role as Billie - a good way to loose yourself in a rainy afternoon."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "russellc",
        "review_rating": "1",
        "review_title": "Unintentional comedy at its best",
        "review_detailed_main": "Mariah Carey should clear some shelf space for her first Razzie for this vanity project gone awfully wrong. \"Glitter\" has got to be the most pathetic, inept, silly piece of cinematic trash to ever disgrace screens.\n\nIt would be unfair to solely blame Carey for this movie's failure, though. Yes, she's awful, but the rest of the cast doesn't fare much better, direction is perfunctory at best and the script is truly vomit-inducing.\n\nIf you are serious about going to the movies, avoid this one like the plague.\n\nOn the other hand, if you have a twisted sense of humour - in other words, if you thought Elizabeth Berkley and Gina Gershon discussing their breasts in Showgirls was hilarious - you might want to check this one out. Just make sure you take the right people with you.\n\nI especially liked this one scene in which some character asks Carey's character - and I'm paraphrasing here: \"Just because you shriek and shake your butt at the audience do you think it means you are talented?\""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "samoanwmn",
        "review_rating": "",
        "review_title": "I was wishing her the best but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Magzilla",
        "review_rating": "1",
        "review_title": "one word...yikes!",
        "review_detailed_main": "Yikes is the perfect word for this catastrophe of a movie. Bad acting, short sided directing, and a purely moronic stringing together of words which I'm sure the studios termed as pros. I'm very disappointed in the cinema."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "msjeangrey",
        "review_rating": "2",
        "review_title": "Lame... but...",
        "review_detailed_main": "Yes, it was a crappy movie. Oh, come on, we all knew that already!\n\nBut...\n\nMax Beesley is amazing. Yes, his accent faltered a couple of times, but I've never been one to whine too much about something like that. His acting was wonderful, passionate. It isn't his fault he was co-starring with Mariah Carey, who seemed to possess all the charisma of a doorknob. She wasn't as bad as I expected, but it was still rather painful.\n\nHopefully she won't make anymore movies. Hopefully Max will begin to get the recognition he deserves."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "MindFever",
        "review_rating": "1",
        "review_title": "You know it ...",
        "review_detailed_main": "You know its bad when people who gave it something above 5 say \"It's not bad, NO MATTER WHAT EVERYBODY SAYS\"...\n\nWhy then read my review? You truly have it all there.And even both sides agree that this is utter crap.\n\nhow do i think that the FAN based side agrees? Because they confirm it with \"it touched me personally\" which is not valid since they are fans. And when they say \"its not that bad\".\n\nBut what will really rock your boat is hearing her act.Nevermind the film, nevermind the diabetes-factor dialogue.In fact delete the movie from your mind.\n\nDone that? Good. I just saved your life. Cheers."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Big O-7",
        "review_rating": "1",
        "review_title": "TARNISH",
        "review_detailed_main": "Let's face it. There are very few good things about this movie. The song with Busta Rhymes and the ones done by Jimmy Jam are good. Most of Mariah's wardrobe accentuates her curves nicely. Mariah can sing the part, and her acting isn't all bad (though there is probably no reason to start writing any acceptance speeches yet). Everything else is crap. Director Vondie Curtis Hall should get back to acting. He can't even make the club scenes go smooth. Face it, you would probably be better off buying a poster of Ms. Carey (heck, you can probably get that and one of her CDs used for less than the $10 you'd have to plunk down in Manhattan to see this debacle). I give this film 1 star because I feel that Mariah deserves better than this."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "vampybuff",
        "review_rating": "1",
        "review_title": "I love Mariah Carey...just not in a consecutive 2 hour time span",
        "review_detailed_main": "Why did she make this movie??? everyones blessed w/ one talent, acting definatly isn't hers. Having read the reviews, I should have known what to expect, but I guess being a long time fan of Carey, I had a lot of faith in her, and a lot of of doubt in the reviews. Unfortunatly, everything I'd read was true. By the end of the movie I wished I'd never been told not to believe everything you read."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tarasusanne",
        "review_rating": "1",
        "review_title": "Where to start?",
        "review_detailed_main": "Script, direction, acting, editing- can't tell where this went wrong, it was all so bad it's hard to tell. I think Mariah went to the Joey Tribiani School of Acting (e.g. \"smell the fart\"). It's not even good enough to be campy. She's a talented singer, she should just stick with that."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "davegaramond",
        "review_rating": "1",
        "review_title": "Boooring...",
        "review_detailed_main": "I got to see this movie from a friend's DVD. And I'm glad I did so because I can utilize the fast-forward button many times.\n\nThis movie is unbelievably boring. It's not the worst film of 2001, and Mariah's high-pitched voice is not the most annoying human sound, but Glitter has got to be one of the most boring film ever for sure. I think I've only watched for 30 minutes due to the repeated visit to the fast-forward mode. While watching I could not help but think about two things: 1) how many people doze off in the theaters; and 2) how boring Mariah must be as a person (since this movie is supposed to reflect somewhat on her career and life).\n\nGlitter is so bad that I actually made a promise to myself not to watch any future Mariah film, and it's kind of sad because I've heard better things about Wisegirls."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "cnf2004",
        "review_rating": "10",
        "review_title": "Inspirational movie",
        "review_detailed_main": "I have followed the wonderful and inspirational music of Mariah Carey since she first came on the scene in 1990. I was 8 years old and from there on, I kept up with each and every bit of news about her. She turned into my inspiration and it is because of her that I am blessed with the talent to sing and write lyrics, myself. I first viewed \"Glitter\" a few months after it hit the theatre and I must say that it truly lured me in. Mariah played the character Billy Frank who not only wanted to make it big in the music industry, but who also was looking for someone to lean on. She never gave up hope that she would see her mother again, whom she was separated from as a child and she didn't give up hope in her music. If you enjoy inspiration, then you'll love \"Glitter\""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "MadLane_Original",
        "review_rating": "7",
        "review_title": "Unfair rating, good movie or at least decend",
        "review_detailed_main": "Hi, so say what you want but I liked it, it was good, better than the movies we get now (2022) for sure, it's a nice story and told well enough, sure maybe not original, I think a real life story about Mariah might have been more interesting, maybe less dramatic but more realistic.\n\nAnyway I liked it, it's as good as any of the movies of this type like \"coyote ugly\" etc...... , they won't mindblow you but will entertain you enough and personally I like this type of story.\n\nActing could have been better, Mariah wasn't bad, the character Dice was the worst for me, in my opinion, soundtrack was good obviously."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "atomicdonkey",
        "review_rating": "1",
        "review_title": "Not a worthless piece of garbage...",
        "review_detailed_main": "This movie was definitely not a worthless piece of garbage which did not deserve to be made. It was a quality film, and at no point made me want to be sick. I would not prefer suicide as an alternative to viewing this movie. These are all things that I might have said, if this movie was not the biggest chunk of garbage ever made. I'd be willing to be that there are seasoned coroners that cannot help but vomit on sight of this train wreck. The acting was like watching a third grade performance of Hamlet (I'm sorry if I've offended any eight year olds with my review), and the script could have been done better if a blind monkey had been given a crayon and a can of play-doh. I realize that doesn't make much sense, but trust me, it would have ended up being more logical than this \"thing\" they called a movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "A bit muddled, but for Mariah fans, much better than #13 on the bottom 100 list.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "northofcb",
        "review_rating": "3",
        "review_title": "Hum",
        "review_detailed_main": "Okay, it sucked, but it wasn't the worst thing ever. Mariah got a bad wrap, especially because of the \"break-down,\" but her acting showed a tiny bit of promise. But I digress, It sucked, the end.\n\n4/10"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "thehardyboyz2043",
        "review_rating": "1",
        "review_title": "Let me add this...",
        "review_detailed_main": "I've already posted a review on \"Glitter\" and I bashed it to pieces like many people who reviewed it and posted their opinion here. But what I was most surprised by, when I read the comments, was how many people actually liked this film. I have this to ask each and every one of them, \"How in your right mind can you recommend this film on any level?\" To anyone who says Mariah acted so good needs to watch some more movies, because whatever she was doing in \"Glitter\" was not acting. I understand everyone has their own opinion, but this is just one of those films I can't understand anyone enjoying, except to make fun of it. That's all."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sailorcallie",
        "review_rating": "1",
        "review_title": "It's NOT \"The Rose\" at all",
        "review_detailed_main": "Fox's attempt to do a \"remake\" of \"The Rose\" starring the multi-talented Bette Midler made me vomit my entire breakfast after I got out of the theater. Mariah Carey is a terrible actress and not even Eric Benet can save this film the same way Huey Lewis tried to do in last Fall's bomb, \"Duets\" starring Gwyenth Paltrow.\n\nTake my advice: Rent \"The Rose\" instead of wasting your $8.50 on this lame movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Funkypizza2001",
        "review_rating": "1",
        "review_title": "Why was this movie ever released?",
        "review_detailed_main": "Mariah Carey has done a lot over the past years that has been great, but Glitter, both the album and film, was one of the worst things she has ever done. Mariah, please... stick to music. Glitter was so bad, that its is not even funny. It was so bad, it was horrible. I can even believe i saw this film. I think its on the list of the \"Worst Films in the last 5 Years\". It has bad music to go with with a bad movie also. I was really looking forward to seeing this movie, and i went with my friend who happened to be a Mariah Carey fan... and like me, she was so disappointed. I really advise no one to see this film, especially if you've had a bad day, trust me when i say that seeing this \"Glitter,\" will make your horrible day even worse than it already is. Do NOT see this film. It is a waste of time.\n\nSorry Mariah, But I give it NO stars out of ***** stars."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "natascha-vanrennes",
        "review_rating": "1",
        "review_title": "bad, worse, worst....",
        "review_detailed_main": "I don't actually understand why this movie was released in the first place. The story is not interesting and Mariah really needs some more acting lessons. But the worst of all is the so called dramatic ending. I think even die hard Mariahfans find this movie far away from acceptable."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "linguo",
        "review_rating": "1",
        "review_title": "The movie that killed mariah!",
        "review_detailed_main": "This film is what made mariah's record company drop her from her label. And after seeing this film it's not hard to see why. I thought mariah was full of herself before but wow! Easily one of the worst movies released in that year. Her acting skills are worse than hulk hogan if that was possible. The film basically shows how mariah is god and everyone should worship her. Thanks, but no thanks."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "thebupster",
        "review_rating": "1",
        "review_title": "Soundtrack 10. Movie -0",
        "review_detailed_main": "This film is not \"bad\" like Showgirls and Burlesque. I revisit it every few years hoping it will be \"funny\" or \"ironic\" or \"so bad and dumb that it's funny\"....\n\nThis is not one of those films.\n\nNo funny catch phrases. No memorable scenes.\n\nIt's just BAD.\n\nThe only highlight of this film happens to be the soundtrack that is so surprisingly good that it's even MORE confusing why the film is SO BAD!!!!\n\nOf course, doomed to failure, the soundtrack was released on September 11, 2001...... Mariah had no chance to recover a single dollar for this film. Thank GOD she redeemed herself with Precious. 🙃🙃"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ringrob-1",
        "review_rating": "10",
        "review_title": "\"Great minds don't think alike, truly great minds think for themselves!\"",
        "review_detailed_main": "I don't know about anyone else, but I loved glitter. And regardless of what the so-called critics (Hey, I wonder how anyone even becomes a critic???) said about it, I believe Mariah Carey did very good in Glitter. Her acting came across very believable, I mean when you think about it here we have a singer acting in a movie about not just a singer, but one in the time line in which she lived....duhhh???,at least she stuck to what she knew unlike some actors I know. Now maybe parts of the script weren't that great, but then many movies with good actors are not going to be billed that good, and the first ones people want to blame is the actors, because they are the ones who have to carry the vehicle. Anyway I never passed judgement on the movie before I saw it. Great minds don't think alike, truly great minds think for themselves! I never usually pay any attention to critics.....or anybody else for that matter. (Not to say critics are great minds...lol, Not in the least.) And I have to also say DaBrat was also very good in Glitter. She didn't seem phony just natural, I mean not a singer trying to act like a singer, just being herself. I base what I think on how I feel about it personally, not what someone has told me to think. And Max Beesley was great, very sexy, and had me fooled I thought he was from the U.S. and was shocked to find out he was a Brit! None the less I think he is also an up and coming talent here :-) Glitter is a 10 in my book, and hey if you don't like it, to each his own."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "themothman666",
        "review_rating": "7",
        "review_title": "Not as bad as people say.",
        "review_detailed_main": "I rented this movie because I wanted to see why everyone hates this movie so much. Well I started watching and saw that the beginning was good. I waited and waited for it turn turn bad but it never did. I kept wondering why people trash this movie. The acting is just fine. Mariah is very good at playing Billie. Although she is playing a character much like herself. Max Beesley isn't that bad. His accent wasn't good but it wasn't worth bashing. The rest of the characters don't have enough screen time to mention. I still can't understand why people don't like this. I give it 7/10."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "buckleym-1",
        "review_rating": "2",
        "review_title": "Painfully Boring",
        "review_detailed_main": "I have always thought the worst comment a person could ever make about a film is to call it \"boring\". Even if you thought a film was poorly made, disturbing, graphic, horrible, or whatever, then at least the film made you care. \"Glitter\" pours out boredom in lethal doses. Director Vondie Curtis-Hall and cinematographer Geoffrey Simpson pull out a few visual tricks to add some punch to the lackluster affair, but the effort is not enough. The script can easily be seen as a reflection of Mariah Carey and her life. Carey, though, has no range (as an actress) at all. The scenes of romance with co-star Max Beesley fall totally flat. Plus, her moments of anger play like an actress trying to be mad, rather than a person who's actually angry. Carey, if she wanted to act, probably should have either taken a tiny role around veteran actors in another film. She's just not a great actress. The one bright spot though is her voice, which gets some use in a few songs, none of which are all that memorable. Acting problems aside, the film is one painfully boring movie. A 2 out of 10."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Glitter It Doesn't",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "nik_kay",
        "review_rating": "2",
        "review_title": "All that Glitters is not Gold",
        "review_detailed_main": "This film made me quite sad for Mariah. She has quite a lot of talent. I don't think that acting is one of her strongest talents, at least not at the moment. Even some of the best acting skills could not salvage this film. Terrence Howard is an amazing actor (The Best Man, Dead Presidents, et al.), but he seemed to be wasted on a one dimensional thug role.\n\nI think somewhere along the way, Glitter got caught up in its own superstar flashiness. The story was never fully supported from the begining. Billy's black momma gives her up after their home burns down and she loses her job. Oh yeah, and her white father wants nothing to do with either of them. I think that was an interesting storyline that could have been developed further to make Billy a deeper character. I kept asking myself the question what role did her biracial roots, her single-parent home and her socially paranoid father play in making her who she became? Was it just a weak explaination of why Billy wanted her mother's approval or why a very fair pop star can blow like the queens of Soul. I wanted to see some turmoil from Miss Billy Frank, some reserve being romantically involved with a white man after the trauma of being abandoned by her white father (fathers play a huge role in who a woman chooses in a mate), perhaps some lack of acceptance from other black children, etc. I didn't even understand exactly what role her upbringing played upon her desire to become a star. Did she want money? Did she want fame? Did she want her mother's acceptance? It didn't even seem like she thought of her mother except for a few hokey instances and I just could not feel the truth in them. Her romance with Dice seemed equally lukewarm. I did not feel any chemistry between them. In fact for most of the movie (that I could watch without gasping in fits of frustration)I wanted Billy to be a stronger, more proactive character rather than simply being an object to all characters including herself.\n\nI could go on and on, but I digress. I would like to think that Vondie Curtis Hall did the best with what he was given: a weak script. I think that Glitter may have been an interesting concept (without biting off Mahogany). It succeeded in only scratching the surface of the industry and the rise of a pop star. In a sense, Glitter fell prey to the superficiality that the industry is itself notorious for. Ironic? Maybe."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "alibeydoun",
        "review_rating": "1",
        "review_title": "absolutely the worst film of all time",
        "review_detailed_main": "I am still stunned and astonished at how bad this film was. i mean not only was the acting by miss carey appaulling, but the direction was laughable. the plot was extremely simple and is nothing new. Avoid this at all costs!!!\n\nyou have been warned!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "JamesBigBass",
        "review_rating": "1",
        "review_title": "Self-Serving \"Puffery\"? A Big Whale?",
        "review_detailed_main": "Yech! Mariah's \"lambs\" have been led to the slaughter en masse, indeed. Either that, or they just got their wool sheared (isn't that called \"fleeced\"?). Perhaps if the movie didn't have such unskillful \"acting\" -- or was it screenwriter Kate Lanier's lack of character development? -- or was it director Vondie Curtis Hall's clumsy \"directing\"? -- whatever, the \"movie\" was mostly a rather dilettantish affair obviously attempting to bouy Mariah's Titanic-like career in a post-Britney Spears music world. If you really want to spend your valuable time getting truly entertained, you'd get much more of your money's worth by going fishing instead of seeing this boat-anchor of a flick."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "KubrickCRM114",
        "review_rating": "1",
        "review_title": "Wow, man. Wow.",
        "review_detailed_main": "Oh, the horrors that must be endured...I was forced to watch this film because I was in a room full of women that, for some distubing reason, believed that if Mariah Carey was a successful singer, she must be a good actress. Ouch! I hope people who haven't seen this read the reviews so they know better than to see this. In the words of (Monty Python's) King Arthur, \"Run away! Run Away!\""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Marian1st",
        "review_rating": "5",
        "review_title": "Is ok to see once...",
        "review_detailed_main": "This movie is not as bad as some people say. I've seen worse... You'll probably gonna like it more if you're Mariah's fan..\n\nAnyway this is not that kind of movie u would like to see twice. The story is pretty boring but I think that's the actors fault because they can't do better than that. After all what did you expect, Mariah Carey is a singer not an actress.\n\nAs a singer she did well in the movie... the songs are great."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "dirtydan1",
        "review_rating": "1",
        "review_title": "Bad movie with a unoriginal plot.",
        "review_detailed_main": "The movie Glitter, starring Mariah Carey, is getting a bad rep for a good reason. The movie is not good, despite a good acting job by Mariah Carey. The plot is that a girl(Mariah Carey) was a young girl that liked to sing. She took a big break from singing for family reasons. Then she meets a guy that hears her voice and talks her into singing again. Does this plot sound familiar to you? If you ever saw the movie Save The Last Dance, then it should. They took the same plot and just changed dancing to singing. I enjoyed the movie Save The Last Dance, but this movie I did not enjoy."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jiaozi",
        "review_rating": "3",
        "review_title": "bad, but you can get into it",
        "review_detailed_main": "I thought the acting was very bad, but then almost campy. As we were watching it, we wondered- if this is so bad, then why are we emotional involved with the characters? Therefore, it can be used as a weepy movie, but just don't tell anyone you saw it, or heard it from me. The make-up and costume people should be taken out and shot though."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "drhodespr",
        "review_rating": "10",
        "review_title": "great film",
        "review_detailed_main": "this is one of the greatest films of all time. The directing, acting and writing are top notch. The mere fact that Tom Cruise was going to star in this and Wolfgang Peterson was going to direct tickles me with sadness. It would've been a beautiful picture. Mariah Carey is a breath of fresh air and exudes emotional talent as well as a natural ability to capture our attention. She is a true actress and should be cast in a martin scorsese picture with leonardo dicaprio. I love her so much, I even bought all of her cds twice. The scope of this film reminds me of Casablanca and Vertigo. Hitchcock would've been impressed with the texture and subtext of this picture. This film reminds me of Jean-Claude Van Damme's \"Nowhere to Run\" with its talent and beautiful direction."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "shellkay",
        "review_rating": "7",
        "review_title": "I don't think this movie deserved all the criticism it received.",
        "review_detailed_main": "I am a huge Mariah Carey fan, so I went to see Glitter when it first opened. I thoroughly enjoyed the movie, and I was disappointed that so many people seemed so eager to criticize it. I do not believe that \"Glitter\" is deserving of all of the jokes and criticisms thrown at it.\n\nI thought Mariah Carey acted the part of Billie Frank very well -- much better than other singers that I have seen in the movies. Billie's story was multi-layered, the story about her missing mother and the love story meshed together well, and I was surprised by the ending. It wasn't a cliche'd ending and was very well-acted. Beyond that, the musical performances were outstanding. It was like watching a movie length Mariah Carey video with a wonderfully touching story in between the songs."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "lisafordeay",
        "review_rating": "4",
        "review_title": "Mariah Carey The Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "galeweathers82",
        "review_rating": "",
        "review_title": "Please!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ilovelctr",
        "review_rating": "3",
        "review_title": "The movies just sucks like the songs themselves",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "As Annoying as Real Glitter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "memoreyes",
        "review_rating": "4",
        "review_title": "Not as bad as one might think, but not as good as it could have been",
        "review_detailed_main": "After all the bashing and cruelly hilarious remarks about this film, I just had to see it. I figured I'd get at least an hour and a half of laughs at Mariah Carey's expense if nothing else. After actually viewing it, I found it wasn't as funny as I had expected. I have definitely, DEFINITELY seen many worse films than Glitter, but this is surely not a \"good\" movie. Probably the worse thing about it, from an adult point of view,is that it was rather trite. The \"trials and tribulations\" of Billie Frank just ain't much to write (or sing) home about. I suppose it is human nature to want to see suffering and pain, but whatever. There isn't much of it in this movie, and what little there was is portrayed in a very benign and mundane way. Apart from that, the dialog is lame (\"Wow, that is so fresh!\"), the characters are fairly one-dimensional, and the film does a poor job of recreating 1983. I'm not sure why I felt the need to review this movie, but I guess in a way I feel sorry for Mariah Carey. It isn't the worst movie in the world, and it looks like she did the best she could. I don't recommend it, though, unless you are a pre-teen girl or a big fan of Carey's. Yes, Mariah can sing, but if you want to hear that you might as well buy one of her albums. If you want to see a good movie about the life of a singer, try The Rose instead. :)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "xinli1",
        "review_rating": "1",
        "review_title": "Was that acting?",
        "review_detailed_main": "Man..what to say? I am not quite sure. The quality of this movie was so poor, I stand unable to find the words to describe it. This movie is not even worth pirating off the internet. It's not worth 2 cents!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "scarlett-24",
        "review_rating": "1",
        "review_title": "Terrible movie!",
        "review_detailed_main": "This movie sucked. I did not go to see it for a plot that rivalled any Oscar winner; still, I was disappointed. The screenwriters obviously had been hired off the streets and knew nothing about writing a movie that would capture and retain the interest of its audience. The actors were either embarrassed or inept, and no emotional chemistry was made. Even the desperate mother/daughter relationship attempt at heartwarming cheer fell flat. This movie served only to showcase the limp songs. Next time, try releasing just the soundtrack."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "0840",
        "review_rating": "1",
        "review_title": "possibly one of the worst movies ever made",
        "review_detailed_main": "Mariah Carey delivers one of the worst performances ever in one of the worst movies ever. I wish somebody would quit telling these singers that they can act, there are very few singers that come to mind that have been successful as actors or actresses, and there is only one that I can think of that has ever been given any kind of recognition for being a good actor. That was Cher when she did Moonstruck.\n\nI believe that actors should stick to acting, and singers should stick to singing, and they should not crossover, unless their intention is to act by singing in a musical or opera.\n\nBottom line is, Mariah Carey re-enforces my theory that the two worlds should stay separate. But, I don't think she can sing very well either."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "michael_t_r_i_p_p15",
        "review_rating": "1",
        "review_title": "Comedy or Drama",
        "review_detailed_main": "If you class this as a comedy I'd give it a 10 but as a Drama I have to give it a 1. Watching Mariah trying to look sad was hard to watch."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sk8erlamb13",
        "review_rating": "10",
        "review_title": "underrated gripping drama",
        "review_detailed_main": "This movie is very good. i think a lot of people just don't like it because Mariah Carey is in it, and singers who try to act get a bad rep. but the story of \"Glitter\" is actually sad and personal. and the end comes as a big devastating blow. it truly shows how being famous can ruin certain aspects of your life. i thought Mariah did a good job in this. I am one of her biggest fans, but even if i wasn't, i would still enjoy this because it really does have a strong story. Granted, she did a million times better in \"Wisegirls,\" but \"Glitter\" was her first leading role. give mariah a break!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "epppie",
        "review_rating": "6",
        "review_title": "I'm glad people hate this movie.",
        "review_detailed_main": "That means it's probably a good movie. And it is. Yes, the story is a familiar one. That's true for EVERY movie. Yes the cinematography sucks. That's true for a lot of movies. Sure, this is no Hard Day's Night. But it's got one of the best singers of all time singing some nice material. That ALONE makes Glitter worth watching. If you don't understand that, what the hell do you understand about movies? Three quarters of making a good movie is just putting a great performer in front of the camera. If you do that, you already have a watchable film, and Glitter has that, for sure. Mariah Carey's acting is amateurish, but it is genuine and emotional, and that's enough to hold the film's center. Carey's costars are all good, putting in performances that go well beyond perfunctory. They take poor material, in terms of writing, and they breath life into it. In particular, Max Beesley is a fine actor, sortof the poor man's Ewan McGregor, and there is a good chemistry between him and Carey. The themes of this movie are serious and the performers, if not the writers and producers, are serious about them; trying to find yourself and yet not lose yourself in the artistic struggle.\n\nGlitter's sin is that it could have been a much better movie. The production values are cheap and not in a good way. Writing and direction deflect Glitter's focus at key points in the development of characters and of the story. Carey herself has put her finger on the problem: it was apparently decided to shoot for a younger audience, as in a 12 year old audience, and the result was half-baked. It's a shame and a disappointment, but Glitter is still a movie with considerable promise that delivers enough to be worth watching, worth having. The amount of hate this movie gets is just grotesque. I'm sorry, but there are lots and lots of worse movies."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mfelix",
        "review_rating": "1",
        "review_title": "You're OLD, get over it.",
        "review_detailed_main": "Can this get any worse? It's sad to see women getting old and can't deal with it. The acting in this movie is the worse. Feel sorry for the director, he's a good actor to be involved in such a C rated film. And this theme throughout the movie, the glitter or dirt or whatever she had on her face and shoulder? Give me a break."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "nycrules",
        "review_rating": "",
        "review_title": "Sheer Genius",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "thomasgulch",
        "review_rating": "1",
        "review_title": "female Howdy Doody? Puppet mouth?",
        "review_detailed_main": "When Mariah pulls down her upper lip, and especially when she was wearing that skulling hat, she looked amazingly like a chimpanzee. Although the movie is gleefully horrible, I was fascinated by the way she kept pulling down her upper lip, to the point where I had a hard time of not thinking about her resemblance to Howdy Doody. That was probably the most interesting thing in this god-awful movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Dianna222",
        "review_rating": "1",
        "review_title": "This is a terrible movie.",
        "review_detailed_main": "This movie is terrible. Let's start off with the screen play. The script is very unoriginal. It's a story we've seen a thousand times. Let's now go to Mariah. I don't know who told her she could act. She can not. I found myself laughing in places that were supposed to be sad. She has no presence on film. I just couldn't take her pasty facial movements seriously. Happy Mariah, pouty Mariah, that is all you get.\n\nThis is a terrible version of \"A Star is Born\". The characters are uninteresting, the plot is totally predictable, and the lead actress is a charactature of herself.\n\nSave your money. This film isn't worth a dollar."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "dranec",
        "review_rating": "1",
        "review_title": "Film school dropouts could do better",
        "review_detailed_main": "This has to be one of the most unwatchable movies ever made. My wife claims she rented the DVD to have fun watching a 'bad movie'. So, I was up for it and ready to give it a chance, thinking that maybe it got an unfair shake by the critics. Well, there was no fun to be had unless you count laughing at the bad dialogue, lack of characterization, cliche after cliche, comatose flatness of tone, and stylized editing that covers up bad pacing, etc.\n\nBlame the Director, Vondie Curtis-Hall, and whoever edited it. This is a career ending movie.\n\nFor instance, the scene where 'Dice' and the Bad Guy Music Producer get up to go talk about freeing Billie (Mariah) from her contract - Obviously, they had too far to walk to get to a quiet place in the same shot, it took too much time, so they just picked a couple of places during that walk to edit out 3 or 4 steps. Jump jump jump. Nowhere else in the movie is the action stylized in such a way. I laughed out loud! What a poorly planned shot and what an incredibly inept way to cover it up! Pathetically amateurish.\n\nFor an extra treat, you should watch the DVD with the Director's Commentary on. That was some funny funny stuff, all the pseudo-intellectual reasoning behind the grand and poetic statements made at poignant moments in the movie. Ha! Vondie Curtis-Hall should never direct again, he made a fool of himself."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "wolfman77",
        "review_rating": "1",
        "review_title": "Glitter made me bitter!",
        "review_detailed_main": "Well, while I wanted to go see O, my g/f dragged me to Glitter. And after what seemed like an eternity to say the least, I was bitter. Why, do you ask. A)Mariah Carey couldn't act her way through a second grade school play, B) The movie is basically all about her real life, if I wanted that kind of info I would have set my VCR for when there was an A&E biography on her and C)this script is as compelling and interesting as watching the dust grow on my computer screen. If you want to see how to not to make money on a movie well this one is right up your alley. I could go on and on about all the horrible things this movie has to offer, but instead Ill just sum it up by saying after I saw this movie, another one came to mind, 10 Things I Hate About You."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "thehardyboyz2043",
        "review_rating": "1",
        "review_title": "Is this actually a movie or....",
        "review_detailed_main": "a poor attempt at trying to get Mariah Carey into a starring vehicle, without considering that the movie they had in mind might damage her career more than help it? Well, \"Glitter\" is exactly that type of film, it's an utterly pathetic and boring flick that will no doubt become one of the most bashed films of the year.\n\nFirst off, I don't care how much this was based on Carey's real life, the movie wasn't the least bit interesting, the character development, plot and acting is second rate at best, though third rate might be a better description.\n\nI'm not sure what the director and screenwriter were thinking when they decided to make it, but that's probably the problem, they didn't think. They figured that if they put Carey in the film, no matter how bad it was, that fans would go to see it. Well thankfully they didn't, the film only managed to make $2.5 mil. in it's opening weekend, (whoo-hoo), so maybe this will make Carey reconsider her film choices or just avoid films all together, since her acting is very poor and just plain irritating.\n\nThis is just a bad film, nothing good at all. -**** out of 4 stars."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "kelsieph",
        "review_rating": "5",
        "review_title": "Okay Film, Great Music",
        "review_detailed_main": "I don't think this movie is as bad as people let on. I'm not saying this movie isn't flawed. I also really dislike Mariah Carey. However, I think the music is awesome in this movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "forklift14",
        "review_rating": "1",
        "review_title": "AAUUUUGGGHHH!!!!!",
        "review_detailed_main": "If Mystery Science Theatre was still on the air, they'd have a field day with this one. If Mariah got naked, maybe I would have given this one a 2. I'm sure all the good reviews of this piece of garbage have been from Fan Club members. I saw Stevie Wonder at the movie, and he was covering his eyes..."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "plmirage",
        "review_rating": "10",
        "review_title": "Loved it.",
        "review_detailed_main": "...Yes, I sure did.\n\nThere were cheesy moments. There were moments with dull/awkward acting. This is, however, not a very high budget film - with a singer with no acting experience what-so-ever starring. What amateur film doesn't have its bad moments? With its 'meh' plot, and 'meh' director?\n\nSo open up. Loosen up. Be wiser in acceptance. I did. And I thoroughly enjoyed it. The plot was medial; but the film - with its glitters, jokes, few dramatic moments, and excellent music - was quite nice overall. :)\n\nThis is NOT an autobiographical film. Stop assuming and accusing! So many people carry that thought with them, and were automatically disgusted (before they even watched the film) with the so-called 'woah is me' concept they THOUGHT Mariah was trying to present.\n\nMs. Carey definitely has potential to become a greater actress - in the no time she would be much better than most of the actresses in TV series. Don't incorporate your own bias against her, just because she's Mariah. Everyone, once upon a time, had a soft spot for Mariah. I don't know how people can just push their spots aside so quickly since the bad press. C'mon, the lady can only take so much - she's only human. She showed that she was strong. She knew the bad criticism was going to come. She did it anyway. And she did it well. Mariah, you deserve all praises and well wishes."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "esson57",
        "review_rating": "6",
        "review_title": "good love story and beautiful first scene",
        "review_detailed_main": "I loved the movie mostly because of the great song at the first of the movie with the little girl and Valarie Pettiford. I was disappointed to buy the soundtrack and not find it there. If anyone knows where I can get some music by Valarie Pettiford, I would appreciate a tip. I have not been able to find anything.\n\nThe story may have had some faults but there seemed to be chemistry between the two main characters that made for a good love story that I enjoyed watching with my three girls who also loved it. Maybe it wasn't a hit at the box office, but my daughters bought it and have watched it and sung the songs endlessly. Seemed like too many dance scenes for my taste at age 57, but the relationship between Dice and Mariah took me back. No, I'm not black or mixed but loved the story."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "FesterSam",
        "review_rating": "1",
        "review_title": "bad bad bad",
        "review_detailed_main": "don't waste your time. I feel like filing a lawsuit for the time I lost off of my life by watching even 10 minutes of this pure crap, This movie is as bad as the reviews. I think this Carlo guy is high. Please do something else rather than watch this \"film\" clean your raingutters, paint the house, do your dishes and laundry, anything's better than this movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "MoonsofJupiter",
        "review_rating": "",
        "review_title": "What were they thinking??????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "LauGuy",
        "review_rating": "1",
        "review_title": "Oh my God ....",
        "review_detailed_main": "You've got to be kidding me... This isn't real! Oh yeah, I'm not dreaming... Somebody wanted to be in a film, and because that somebody was Mariah Carey, they though it would be a big hit. Well, I can tell you, I've never seen such a bad movie in my entire life... Even a cat in a commercial acts better than Mariah and the story is predictable and boring! \"Girl wants to be a star, she becomes a star, some troubles come up along the way, and a big concert at the end of the film\" seen that done that, boring! And the funny thing is that it costed a hell lot money! I believe the record company issued a profit warning to its shareholders because of this movie... I think that's great... That should teach them not to make movies just because some singer wants to act... I mean, you have seen Mariah's videos: she just can't act!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jaxenross",
        "review_rating": "5",
        "review_title": "Superb!",
        "review_detailed_main": "I never expected to watch the whole movie in its entirety. Carey isn't that bad in this movie as considered by many critics for her acting to be amateur; I think opposite of what critics say. The soundtrack is top-notch and I thought that the movie was powering. If you're a true fan of Carey, I truly would recommend this movie - even if it doesn't meet up all expectations.\n\nThe only problem with this movie and the reason as to why it failed was releasing it after the 9/11 attacks happened (the Twin Towers make an appearance in this movie); they should've stuck with the original release date and the movie could've been a hit.\n\nAll-in-all, not bad."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "azimuth361",
        "review_rating": "1",
        "review_title": "Not Even Tolerable with Rifftrax",
        "review_detailed_main": "Now, I would have absolutely no interest in ever, ever, ever, ever watching this movie. When I saw a photo of Carey teeing off while wearing hot pants and porn-star high heels, I thought, 'This is a girl with not a lepton of virtue or admirability.' Well, okay, she can hit impressively high notes, but that's the only thing. So, when I started a Rifftrax membership and saw that this movie was among those riffed, I thought, 'Well, maybe.' I could only watch the first 20 minutes when I suddenly remembered that the drain in the garage needed mucking and decided that would be more fun and rewarding than watching this piece of schlock.\n\nI'm going to jump genres and compare this movie with 'Rock Star', a film similar in its rags-to-riches theme. At least 'Rock Star' had a comedic slant to it and didn't try to pass itself off as high drama. Those involved in making this film took it so seriously that it becomes a mockery in an attempt at gravity. They go to pains to show that Carey had a drunk mom, when to an orphanage but never expanded on those formative events or years. It may have been interesting to have seen the character pass through her formative years and how she became the person she is, how her values and beliefs were established, how the foundation for her adult life was laid. Nah! That's not important in a pseudo-biographical film. Let's jump right to the bootie-shaking. The songs even draw from a well of sophomoric offerings that Carey has penned.\n\nThis is a long way to a short point. This movie just sucked."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mattymatt4ever",
        "review_rating": "2",
        "review_title": "Is it as bad as they say? Definitely!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Lissie-B1",
        "review_rating": "1",
        "review_title": "Not impressed",
        "review_detailed_main": "I never saw this movie and my friend told me about it. There is nothing much to say except that it was mediocre, I've seen many actors but this actress was terrible. I didn't understand the point about this movie but i'm here because I was told to write a review to complete my activity file. Otherwise, not worth commenting. The movie no good."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jchernesky",
        "review_rating": "1",
        "review_title": "It's hard not to use profanity to explain how horrible this movie is.",
        "review_detailed_main": "There should be laws that prevent the distribution of self-serving \"movies\" (to use the term loosely) such as Glitter.\n\nI laughed, I cried. Both at the wrong moments, and simultaneously when I was carried out of the theater at the end because I was too delirious to walk on my own.\n\nI tried to look past the nightmare that is Mariah Carey in order to focus on the merits of the film, but I couldn't do it. I'm not man enough.\n\nThis film should be used as a teaching tool at all Film Schools in this great country of ours, with regard to what not to do.\n\nInane plot structure, abuse of the most tired cliches in film, marginal acting.\n\nI'm exhausted just thinking about this movie again. I think I'll lie down."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "stuart_stock",
        "review_rating": "4",
        "review_title": "Not quite so bad as I first thought",
        "review_detailed_main": "Okay, so this title was truly panned in 2001. A number of (valid) reasons: (i) woefully underdeveloped characters (not least Mariah's Billie Frank); (ii) Max Beesley (the accent was bleak); (iii) strange glitter bursts at the end of scenes.\n\nHowever watching it back, in light of A Star is Born and now that the 80's (when this film is set) are sufficiently behind us, I can't help but feel it was rather harshly judged.\n\nNot to suggest it's good. It's not. At all. But the film does have some redeeming qualities. In particular the soundtrack has, I find, aged rather well. Mariah Carey is, if not a natural actress, a powerhouse vocalist. The scenes where she just bursts into song (I'm thinking in particular of the backstage scene where her character first meets Max Beesley) remind you that there was a reason this film got funding in the first place.\n\nMy overall feeling, though, is that all involved, not least Mariah, had hoped for a different movie altogether. A more adult movie, with adult themes. But when your fanbase in the 90's included a large number of young girls, that wasn't the movie the studio wanted to make. The result means the movie falls between two stools. One the one hand you're meant to believe in an underground/mob story line, and in the emotionally damaged orphan on her rise to stardom (from the dark clubs of NYC). But everything is portrayed in a pink and fluffy way, with no curse words or actual violence. They really took that 'Glitter' title a bit too seriously.\n\nThere is some talent in the movie though, Padma Lakshmi and Terrance Howard. And even Mariah went on to be excellent in Precious. If Lee Daniels had been in charge of this project - like he was for Precious - it might even have turned out okay!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "anjimomo",
        "review_rating": "10",
        "review_title": "Was good, don't know why it was bashed so much.",
        "review_detailed_main": "Glitter was a good movie. Mariah can actually act. I'm not a big Mariah fan but lets face it the movie wasn't bad. I didn't go to the theater when it was playing because the critics hated it. When I saw it on HBO, I have to say that those critics were too hard on the film. There have been movies with much less artistic merit than glitter. On a scale from 1 to 10 I give it a six."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "cditchman",
        "review_rating": "6",
        "review_title": "A totally over-hated easy target that did just fine.",
        "review_detailed_main": "Seriously this movie is not that bad at all. Good? Well it wasn't going for any Oscars I am sure, but for what it is it did just fine. Cliche...god yes, but so what. This kind of film is supposed to be cliche!\n\nMariah did a much better job than I expected. I've never even been a huge fan or anything, not my type of thing really, but hell after this movie I kinda like her. She was quite gorgeous, much sweeter than expected, and surprisingly easy to take as was the movie overall.\n\nNice sound track, nice look and feel, a little cheesy and sappy in parts, but overall a very easy and enjoyable watch.\n\n(although the ending and her 'big emotional moment' expression was pretty bad)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "madhattar",
        "review_rating": "2",
        "review_title": "It is depressing thinking people actually payed money to make this!",
        "review_detailed_main": "Alright, usually i don't like being negative, thinking some where some how a movie has an audience, well i guess it does, 200 or so people thought it was a 10! but I still think they are destroying whatever film sense this category for girls under 15 used to have. The best way to describe this is that is a slower, more boring more girly version of coyote ugly (if that is how you spell it). BUT for the sake of truth I liked some camera techniques, and they had good edits for movement. Well I used to like Mariah Carey, so I went it with an open, even accepting mind, and i tried to ignore the boredom, but alas, i was thinking of where to go have dinner!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "solcita_arg",
        "review_rating": "",
        "review_title": "Don't waste your time or money in this one...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "NeelyO",
        "review_rating": "2",
        "review_title": "SHOWGIRLS for the new millennium",
        "review_detailed_main": "Every year we get one movie like \"Showgirls\" or \"The Lonely Lady\" or \"Battlefield Earth\" that shines like zircon, and for 2001, it's \"Glitter,\" Mariah Carey's eminently embarrassing star vehicle. Wandering through the film with one expression (eyes wide, mouth slightly agape -- one recalls Kathy Ireland's \"dull surprise\" during the MST3K screening of \"Alien from L.A.\"), Carey has zero screen presence. At times, she looks like a Muppet version of Kathie Lee Gifford, and her performance never indicates that her character is anything more than a straw being carried by the winds of the contrived plot.\n\nThe one bright spot in this tacky mess: Ann Magnuson as a hyped-up record label P.R. person. The movie is ostensibly set in 1983 New York nightclub circles (although there's not a single grain of cocaine in the movie), but the only person who looks like they're in the right decade is Magnuson, whose hair, clunky jewelry, and shoulder pads are absolutely right-on. (As a survivor of that era, she probably dug that stuff out of her own closet.) She's also very funny and a real live wire, and easily walks away with the movie while everyone else is sleepwalking.\n\nCarey's high-pitched musical career will no doubt continue apace (after all, the dreadful \"Sincerely Yours\" didn't sink Liberace's stellar career), but I can only hope that she one day develops a sense of humor about this movie, since camp aficionados will no doubt be hosting midnight screenings of this doozy until the apocalypse. Just look for the drag queens with the inexplicable stripe of silver makeup on their biceps. (See the movie, and you'll know what I mean.)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "brittneycapps",
        "review_rating": "10",
        "review_title": "Good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "dlb_95",
        "review_rating": "7",
        "review_title": "It lacked, but was not as bad as most made it out to be.",
        "review_detailed_main": "I recently viewed the feature \"Glitter\" and I must say that all the bad publicity that it has received is ridiculous. I will admit that it did lack in many areas but is certainly not the worst movie I have seen. Mariah Carey's performance was actually not half bad, while I believe they could have picked more prestigious and more talented supporting actors. I believe that if Ms. Carey makes more films I will go see them I just hope that the next one \"Glitters\" a little more brightly."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "PhilauraJ",
        "review_rating": "10",
        "review_title": "Very Entertaining - I Enjoyed it More than Moulin Rouge",
        "review_detailed_main": "How can a film like Moulin Rouge with mediocre music and no soul get away with all the acalades this year and Glitter take so much abuse. No wonder this poor girl had a break down. I happen to think that Mariah has one of the great voices of our time. She not only uses it well in this film, but has a supporting cast of performers that are musically impressive as well. She gives us lots of eye candy and the story is entertaining enough. The film is well made technically. Her acting skills are not of the same fine tuned precision that her voice is, but she gave it a good go. Heck I can name some academy award winners that were no better. The ending wasn't as powerful as I thought it could have been, but that is really all I can say disappointed me. I was thoroughly entertained. And if you appreciate Mariah's music and her lovely body, then I think you will enjoy how it's packaged in this film. For Pete's sake I was surprised that Nicole Kidman could sing, but she wasn't that great. Her character was cold and hard to love. Mariah projected a sense of a genuine, caring girl that you could feel for. Why is Nicole getting so much praise and Mariah so much flack? Give me a break. Mariah - hang in there, you are incredible. You will stand the test of time."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sistershrew",
        "review_rating": "",
        "review_title": "Can't beat Britney's Crossroads...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ilookgood2",
        "review_rating": "7",
        "review_title": "Not as bad as you'd think, and no, it's not because of Mariah.",
        "review_detailed_main": "I actually own this on DVD, it cost me all of $5. If had been anymore I wouldn't have bought it. But all in all the movie is not that bad. Mariah plays the role well. The problem lies in the faulty script. Someone somewhere should have looked at the script and said \"It needs more everything!\""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "rhinestone_cowgirl",
        "review_rating": "10",
        "review_title": "seriously guys",
        "review_detailed_main": "ok ok, i am aware that some of you have it in for Mariah, and that before this tape even hits the VCR you're screaming \"IT SUCKS!\" , but i believe that you actually have to WATCH the movie before you can hate on it. Sure maybe the plot is a little thin, but it's a helluva lot better than some of the *beep* I've seen lately..namely that Will Smith Martin Lawrence sequel. But back to Glitter, it you aren't a slightly wistful person with even a grain of imagination don't waste your time, but if you truly believe that along with the bad comes the good and that miracles really do happen, watch it, and forget what everyone else said, make up your own mind."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Liron_MCrulz",
        "review_rating": "",
        "review_title": "Surprisingly for some, \"Glitter\" absolutely Glitters!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "wellesorson",
        "review_rating": "10",
        "review_title": "Did you people see the same movie I saw?",
        "review_detailed_main": "This is one of the best films (to call it a \"movie\" wouldn't do it justice) I have ever seen. I don't know why Mariah Carey has spent all of her time in front of a microphone all these years when her true talent lies in front of the camera. The directing is top-notch here, and the stunning cinematography coupled with the breathtaking soundtrack makes this movie one of the all-time greats. The next time AFI puts out a 100 best movies of all time list look for this one to make it on the list."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "epona589",
        "review_rating": "",
        "review_title": "Utter Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "preppy-3",
        "review_rating": "6",
        "review_title": "Not THAT bad",
        "review_detailed_main": "All the critics in the country have torn this film (Mariah Carey's \"acting\" debut) to shreds. I saw it expecting a camp classic. You know what? It's not that bad. Now, it's not a GOOD movie--just an ordinary, totally predictable, but mildly watchable rags-to-riches story.\n\nCarey can sing--too bad her songs suck. And her acting is...to be nice...horrendous. Any time she's called upon to show any emotion other than happiness she fails miserably. Co-star Max Beesley (who plays her boyfriend/producer) is handsome, buff...and a lousy actor. He looks totally miserable all through the film. The story is...well, you've seen it--trust me you have! Still it's undemanding, somewhat pleasant viewing. It has flashy direction, it looks and sounds good. It's not really bad until the ending which (I have to admit) had me laughing out loud. But everything before is pretty OK\n\nSo, it isn't good, but I've seen worse."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "rsmolin",
        "review_rating": "8",
        "review_title": "No Way is This Movie That Bad",
        "review_detailed_main": "I cannot believe the ton of negative reviews about this film. It is far better than what you read on this board, and I cannot understand why it's not getting a better shake. Sure, it's not the best film ever made--far from it--but the story isn't that bad, the acting isn't terrible, and the production quality is just fine. No way is this one of the worst films."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "cutiepie31574",
        "review_rating": "",
        "review_title": "Extra cheesy with a side of cheese",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "delenn7",
        "review_rating": "7",
        "review_title": "Very talented",
        "review_detailed_main": "I would say Glitter is not the best movie, but It has its moments. Mariah Carey sings her beautiful voice in this movie. She also finds a guy to love. She wears beautiful stage clothes as well. But I found that the story wasn't enriched enough. Also, they didn't show enough of the Singer's mother. Overall, I would give this movie 6 and a half out of 10."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "californicationgurl",
        "review_rating": "10",
        "review_title": "Awesome!!!",
        "review_detailed_main": "WOW!!! I can't believe so many people have given this movie bad reviews. This movie was excellent. It was a perfect break through performance for Mariah. She certainly showed off her great talent for acting. Regardless what any close-minded person said, Mariah was EXCELLENT in this movie. END OF STORY"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Monika-5",
        "review_rating": "",
        "review_title": "YAWN",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Brandy-28",
        "review_rating": "7",
        "review_title": "You know what people - shut up already!!!!!!!!",
        "review_detailed_main": "I got to say, this is the second time I say this movie. I watched it last night on TCM. I really enjoyed it. I mean I like Mariah but I'm in total love with Valeria Pettiford, who plays her mother. I mean she's not in the movie a lot, but she's there. I mean come on, this a B movie and everyone knows it. But it doesn't stink like everyone says.\n\nIt tells the story from beginning to end, with a little power struggle in between. It has a start, a middle and an ending. About a little girl who has a horrible childhood, but ends up becoming a star in her own right. It's a lot of little girls dreams.\n\nAnyway, Mariah did this herself, after this movie she went down hill and fast, but look at her now - she's at the top of her game. That's what it's all about.\n\nSee it again, but this time, stop being so damn critical. You people don't go to the movies anymore to just enjoy the picture, your so busy looking at the flaws in the movie. Like Bad lighting or bad character introduction - come on - just watch the ()%&#*(&% film and enjoy it. Stop being critics and start being MOVIE GOERS."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "kzchop",
        "review_rating": "10",
        "review_title": "Mariah GLITTERS in this film!",
        "review_detailed_main": "Make no mistake, I am a Mariah fan. I do not intend to hide that fact when I review her work either. Nor will I hide the fact that I think most people are unfair to her these days, and it is because of this bias from the public (instigated heavily by the media) that I fear she has not been given a fair chance with this film.\n\nAs a movie fan, not as a Mariah fan, I loved this movie. It was cute with a nice storyline, and it tugged at your emotions throughout the film. I think Mariah's acting was quite good, especially for her first major role. It was even better than I expected in fact. She's not the greatest actress in the world, but it was a good effort and I have never been prouder of her.\n\nAlso, I must try to remind everyone, this is not Mariah's life story. There are several parallels that are noticeable, but it is not the same. So please don't think Mariah decided to make a movie about herself. That is not true. And please, go see this film before you judge it. Trust me, it's worth it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Musiq_One",
        "review_rating": "",
        "review_title": "I said Glitter...not litter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "datgurlkayz",
        "review_rating": "6",
        "review_title": "Not a bad movie, there are flaws though",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "vagrantfilms",
        "review_rating": "8",
        "review_title": "The next big thing in Midnight cult movies",
        "review_detailed_main": "I love this movie in all it's horrific, cheesy gloriousness. This will be a movie we squeeze into midnight screenings everywhere. Certainly, to Quote Dennis Miller, Mariah has about as much range as a daisy air rifle, but damn everything about this movie screams cult classic!!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "HereJDwas",
        "review_rating": "",
        "review_title": "Obviously not glittering...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "evk311",
        "review_rating": "9",
        "review_title": "great movie ! i loved it , a true story about an artist becoming a superstar",
        "review_detailed_main": "great movie , i enjoyed it a lot. i was interested in the story how an artist becomes a superstar , and this movies shows it all . it is the perfect example as well , Mariah Carey and her life story. this is how it was in the days,\n\nand this movie shows it exactly how the life was in that time.\n\nit shows how the people were and how they lived.\n\nif the people or the artist seems fake in the movie , it probably has been done like that for a reason, people were fake in that time in that kind of club scene , and they actually still are.\n\nanybody that came up with a negative review here ,probably totally missed the point of this movie. it is not about how great the actors are and how great the cinematography is - actually at that point i thought that was great as well-but it is all about the story . it shows you where an unknown artist got recognized for talent and makes it up all the way to the top. very interesting to see , specially because we all know Mariah Carey. i understand people don't like her guts and quality , but let's be honest , she is an amazing artist like nobody else , she is famous and has millions of fans for a reason . she is beautiful and talented.\n\nthis movie is not so much about Mariah herself , but more about the story in general of an artist who had the chance to climb up in the jungle that is called music business.\n\nif you are interested in such a story , than you will see a jewel of a movie here. but if you are more interested in Oscar winning material with amazing plot and special effects and amazing written stories , OK this is not the movie for you , and you probably will write a review this is the worst movie you ever saw, just like anybody else here. that is so unfair , glitter is a great movie for what it wants to show, very well done . and best of all : very realistic.\n\ni saw Oscar winning movies , and i thought they were complete boring . so it is all a matter of taste\n\nglitter is a great movie in my opinion, i would recommend it to anyone because it shows the real life of how musicians live and their dreams to become recognized and how they reach the top with ups and downs.\n\ni think the movie was not accepted so well , because Mariah played herself , and people were expecting world wonders . but they got just plain reality to see . a true story. if somebody else would have played the main actress roll , it would have been maybe better for the movie .\n\nMariah has such a strong personality , it overwhelms the whole picture, it was no problem for me . i was looking for the story anyway. but my point is , if another actress would have done this job , the movie could have been accepted much better and maybe get an Oscar. not that there is something wrong with Mariah as an actress, but the fact that she is playing actually herself might look a bit self crowning. maybe that is the reason why so much people disliked this movie .\n\nyou are a great singer , and you play yourself in a movie to show how great you are. that was plus and plus and too much plus for yourself , and will end up in negative.\n\nif you are so cool and so great it just looks better if someone else will do that acting roll , instead of when you will do it yourself.\n\nthat didn't matter for me , i loved the story . i will watch it again and enjoy sometime soon. if you love the 80s and the life around that time , this movie is a MUST SEE."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "xmen22",
        "review_rating": "10",
        "review_title": "This is a nice movie for the fans...",
        "review_detailed_main": "This movie isn't all that bad. It could have been allot more if they put allot more effort into it. You could see Mariah trying hard, but she obvious missed direction? Also the script, setting and obvious plot holes didn't help much!\n\nWho was responsible for this film? It surely wasn't Mariah, since she knows quality. Was it her then new record company, maybe? I love Mariah and I feel that she was blinded by the opportunity to star in her own movie, but nobody else really cared about making a good movie. They just had to make one and they did.\n\nThis said, the movie is best described as a standard tv movie. You won't hate it, but you won't remember it either. It's just plain drama with some bits of lovely Mariahs singing thrown in."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "nitehawk-1",
        "review_rating": "10",
        "review_title": "A musical goddess in action",
        "review_detailed_main": "I am a huge fan of Mariah and I really love her music that are featured in this movie.. Her acting skills are not a problem for me just as long as she sings her wonderful songs.... I recommend this movie to all of her fans.. I don´t think she deserved such low points, I gave her a 10 :). I think all the other fans should do the same, she needs our support."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "devairjeffrieslee",
        "review_rating": "8",
        "review_title": "I'm offsetting the bad rating",
        "review_detailed_main": "So this is certainly no Oscar worthy film, or even a great film. It's decent. Though I've been a long-time IMDb user, I was prompted to write this as my first review because I felt like the score is unfair. Glitter certainly doesn't deserve a 2.2 rating as I've seen worse; some of it's \"connection\" films, for example. Truthfully, I'd give it a 5 or 6 out of 10-- my 8 stars above is only in hopes that it will raise the current rating. Mariah Carey gives a consistent performance, especially considering her personal struggles at the time. I'm no super fan either but just thought I'd contribute some positivity here and respectfully disagree with the numerous disparaging comments. If anything, I would blame the writing rather than the acting, but again, I can think of other films that are much more overtly awkward due to a poor script. I typically don't list credentials but for context, I have a PhD (and all former degrees) in Theatre so I can be pretty critical and think myself capable of identifying a horrible movie and this isn't it, in my opinion. It's on par with many other romance movies and dramas about singing careers. If you have realistic expectations, it's a okay film."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "bluemarc23a",
        "review_rating": "10",
        "review_title": "Too much killed!",
        "review_detailed_main": "This is not the greatest musical you'll ever watch. and it's not mariah's fault. as far as her acting, she's really amateurish but somehow it's not that really bad. it's the movie itself. even if you put our greatest actresses around, this movie will still liter. don't blame it all on mariah. afterall, she made a very good soundtrack album. because of the movie, the accompanying soundtrack was also labeled to be bad. but sorry, it isn't.\n\nWhat i can say is that this movie is strictly for fans. people who doesn't like mariah should not watch this!\n\nit's 2 out of 5 stars."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ny2001s",
        "review_rating": "10",
        "review_title": "Great Movie!",
        "review_detailed_main": "i give it 10 out of 10 because i loved every second of it! it's one of the best movies i've seen in years and i can't understand why most people didn't like it. well i love it! mariah is a wonderful actress! i also loved da brat's acting! this is a great movie so go out and rent it right now."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Glittering_Irish_Girl",
        "review_rating": "10",
        "review_title": "The movie was 100% GOLD, but it wasn't given enough time to GLITTER.",
        "review_detailed_main": "This movie got many bad reviews by critics, but they shouldn't blame Mariah Carey for it. The movie was great but most people don't know that because it was not given much publicity.I didn't even see a commercial on the television for it until the day that it went into theatres. Mariah performed much better than I had expected that she would and she has definately given her fans a memento that they will treasure for years to come. Truthfully, there are many good one liners in the movie and the drama that you will go through watching it is also great. It's comedy, romance, and it will have you rolling on the floor laughing or balling. If I had to pick a movie that it makes me think of, I would have to say Beaches, starring Bette Midler. The critics that reviewed this movie must have thought that Mariah was going to come out of this movie like Whitney Houston did in the Bodyguard. However I guess that you can't do it all at the same time. The movie was 100% GOLD, but it wasn't given enough time to GLITTER."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "NevRbeaHater",
        "review_rating": "10",
        "review_title": "A amazing movie that was not credited!",
        "review_detailed_main": "When watching Glitter I had to see it just because the reviews were so harsh that It made me question the reality of the film. I think everyone doesn't realize the plot of the story and that it was taking place in the 80's. The tracks that were used for the movie were incredible. Some of those original songs you cannot find now and days. As far as the story line is concerned the opening was great!(honestly) and the middle was at times a little sidetracked from the reality of what the music industry is really like, but the ending was a success! It gave true meaning and a good positive message. Mariah Carey can obviousley sing and as far as her acting is concerned. Im sure she will grow and become just as good. The film was good and so is the soundtrack. Check it out for yourself."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "glitter__glam",
        "review_rating": "10",
        "review_title": "love it",
        "review_detailed_main": "i love this movie, glitter, i really do not understand all the bad press over it...i mean most of the people that have negativity towards it most likely havent even seen it......its not no oscar award winning movie but it is a good fun movie which..it even had some sad parts in it that made me cry.....so like i said this is a great movie i have watched it so many times and it is definetly my favoritve :)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Who says pop stars can't act, huh?",
        "review_detailed_main": "Who says pop stars can't act, huh? I think they can! I see tons and tons and tons of people vote 1 for \"From Justin to Kelly,\" \"Crossroads,\" \"In The Mix,\" \"You Got Served,\" \"Daniel - Der Zauberer,\" and now this movie? Boy, those opinions about who can act and who can't act, huh? :-( Well, I think different about those movies! Usually the only way you get to know stars are through a radio, a CD player, or an MP3 player. You hardly get to see them! You can see them on an album cover, at a concert, etc. But why do people don't like seeing stars on the silver screen? That answer remains a mystery. I think different with \"Glitter.\" It has all things you can ask for in a biographical movie of a pop star. Enjoy the ride."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "leelee-g",
        "review_rating": "10",
        "review_title": "If you love Mariah...",
        "review_detailed_main": "then you'll enjoy this movie. I don't know why people are so critical of this film - I've seen far worse. For Mariah's first starring role, she does a good job. She has potential - which you can see gets better in her next film, Wisegirls. Just go into watching it with the notion that it's just supposed to be a fun movie. (Da Brat is pretty funny) One thing is for sure - there's no denying that Mariah has an amazing voice. I recommend it to her fans."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mimislillambygirl",
        "review_rating": "10",
        "review_title": "TRUTH: This movie is GREAT!!",
        "review_detailed_main": "I wish Hollywood will stop trying to be 'cool' by saying this film is awful when they know for a FACT that it WAS NOT! Mariah was wonderful in this movie..the acting was great, the plot, and the conclusion. This movie would have racked up Oscars if 9/11 did not occurred... be real who is going to see a movie during such a devastating time?? No one! That's why the movie didn't do to well at the box office! Ugh, and no Im not trying to defend Mariah because I am a fan! But it is true this movie is not awful and you all know it! I thought critics knew how to think--maturely that is...and evidently that is not true! Hollywood has a lot to learn...A LOT to learn. Overall, this movie showcased so much talent, in Mariah that I have never known she had! I give this move 10 stars! It was UNBELIEVABLE!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ahill-1",
        "review_rating": "8",
        "review_title": "This Movie is Worth Watching",
        "review_detailed_main": "I listened to the critics about this movie and passed it by a number of times. I finally watched it on HBO and was very surprised. I THOUGHT THE MOVIE WAS VERY GOOD. The story is about a girl who separates from her mother at a young age and struggles to hang on to her self-esteem and dreams of redeveloping the relationship she lost with her mother. In the process of surviving, she finds stardom. This movie is not based on a dream of stardom but a dream of finding love and maintaining relationships. I felt Mariah Carey did a great job for a novice actor. I think the critics were caught up in her real life problems (which is sad for them) and trashed the movie on those bases. There is some superb acting by Terrence Howard, Da Brat, and Tia Texada. The musical score is excellent and Mariah's voice is superb. This was a movie about young people, their hopes, dreams and their never ending search to find themselves and where they fit into society. Stop looking at this movie as a dramatic episode. That is not what it is. I found it entertaining and realistic for it's intended purpose. I plan to add this movie to my collection. I have already brought the musical score. If you like movies such as: Sparkle, The Body Guard, The Temptations, and the Five Heartbeats you will enjoy this movie. It's worth seeing."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "DunnDeeDaGreat",
        "review_rating": "10",
        "review_title": "I really liked this movie",
        "review_detailed_main": "Glitter believe it or not is acutally a good musical movie. There hasn't been a good urban music movie in a while and this movie more than makes up for it. Mariah Carey does good in her first starring role and the soundtrack is one of the best of the year, courstey of Ms. Carey herself and music legends Jimmy Jam and Terry Lewis. I give this film 5/5, just watch it and enjoy it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "doublerainbow01",
        "review_rating": "10",
        "review_title": "great movie!",
        "review_detailed_main": "I really thought it was a movie worth spending $8.00 on..... it was not a horrible move as all the critics made it out to be...they are just being bias..I knew Mariah was okay, even good at acting but when I saw her in Glitter, she was so unbelievably convincing..I mean I laughed when she laughed , I cried when she cried....SHE DID A AMAZING JOB.....and the cd GLITTER IS GREAT TOO...her voice is so clear and beautiful, she uses all of her voice....some songs sound like ones from her older ablums...its great, pick it up!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "chrisuab",
        "review_rating": "10",
        "review_title": "Would be a good TV Movie",
        "review_detailed_main": "I really enjoyed \"Glitter\" believe it or not. Of course, I also like Mariah's music. However, I do believe the movie is like a TV movie. I also felt the same about Michelle Pfeiffer's \"Deep End of the Ocean,\" which I also liked. Mariah surprised me greatly with her acting. I believed it was very well done, especially for her first time. If you aren't interested in a rags to riches story or if you dont like Mariah's music, then you probably won't like this movie either. But, if you like Lifetime Television for Women Specials, this movie is for you!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "superfly6921",
        "review_rating": "10",
        "review_title": "The critics have no idea what they're talking about",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jrorison",
        "review_rating": "10",
        "review_title": "Didn't deserve all the pans",
        "review_detailed_main": "After hearing all of the negative press for this film, I was scared to watch it. However, I am proud to say that it was an enjoyable piece. I must admit that I do love Mariah, but from an objective point of view, \"Glitter\" is a fun film. The acting isn't stellar, nor is the plot (which, by the way, is VERY loosely based on Mariah's life, not nearly as autobiographical as the public would like to believe), but the music is quite interesting and the whole vibe of the movie is positive and energetic. Da Brat also turns in a nice performance as one of Mariah's back-up singers/dancers. I'd recommend \"Glitter\" to anyone, particularly those interested in the music industry and in Mariah. Hopefully, it will someday achieve the cult classic status that it deserves."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "stop_yodelling",
        "review_rating": "10",
        "review_title": "excellent film",
        "review_detailed_main": "the critics really dont know what they are talking about. this movie is a fantastic feel good story that anybody will enjoy. my friend whose music tastes include eminem and dmx and is totally anti mariah enjoyed this movie immensely, even more than me and i am a major fan of hers. i would recommend this movie to EVERYBODY!!!! luv ya 4eva mariah!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Joey-42",
        "review_rating": "10",
        "review_title": "Better than everyone says!",
        "review_detailed_main": "This movie was nowhere near as bad as people said!! The critics were harsh and unjust in their reviews, as \"Glitter\" is not a horrible film at all. In fact, it is quite good! It's not an Oscar-worthy film, but I seriously doubt Mariah or anyone else involved in the movie thought it would be! As Billie Frank, Mariah is excellent and believable. Max Beesley and Da Brat are great in their supporting roles, especially the talented Beesley, who's Dice is brought to life through him. The story is decent and holds your attention. I seriously can't find any reason why \"Glitter\" got the bad rep it has. It was a wonderful movie, and Mariah more than holds her own. \"Glitter\" definitely does glitter, in my opinion."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "neomalebye",
        "review_rating": "8",
        "review_title": "A TRUE AND HONEST REVIEW ON GLITTER",
        "review_detailed_main": "I am a proud Mariah Carey FAN, I LOVE he soooo MUCH. So out of curiosity I decided the watch this movie since the general things i heard about is what people were saying about the movie such as: \"IT IS THE WORST MOVIE EVER MADE\" \"SHE IS A TERRIBLE ACTRESS\" \"THIS MOVIE ALMOST KILLED HER\", and I was like \"oh is it really the bad\"...The answer is NO.\n\nIn this movie Mariah plays Billie Frank. She is an orphan who grew without a mother and the became a dancer at a club...\"OK cool\".\n\nMariah's act isn't terrible but it's not terrific. The many scenes that to her credit are A+ acting but there are many that need improvement.\n\nIf you don't know why this movie is like this let me tell you.\n\nMariah was leaving her ex-husband Tommy Mattola who was the executive of Sony at the time, he was really made at her. Her still being signed to Sony Mattola decided to mess with her entire career including the movie. Scripts were being changed everyday, the story line was being repeatedly, and the movie went from what was supposed to be a PG 16-18+ movie went to a PG-13 because of Mattola.\n\nThis stress caused Mariah to have a mental breakdown due to how much work and sleepless nights she was enduring but that is all gone into further detail in her book \"The Meaning Of Mariah Carey\" which is an excellent read if you want to know more about this period in her life and other aspect of her life.\n\nSo basically the movie was messed with too much and ended up looking sloppy. This movie is not as bad as people make it out to be. People over-exaggerated the whole thing because they were jealous. Mariah is Beautiful when she is skinny and she is beautiful when she is fat, she can sing, she is smart, and she is funny. People were just preying on her downfall because SHE IS JUST PERFECT.\n\nIn conclusion: The movie is not terrible nor is it the best thing since bread...It is just an average movie that is very watchable and it can be enjoyed. There is a lot more that could have been done with this movie but hey, what can we do.\n\nI tried to factor in all aspects of the movie in and give an honest review and not just one-sided reviews like everyone else.\n\nI hope this helped Thank you :)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "songbird_mc",
        "review_rating": "10",
        "review_title": "The best movie of all time!!!!!!!!!",
        "review_detailed_main": "This movie was so superb. I gave it a perfect 10! If I could have given it a 20 I would have! Mariah is as good at acting as she is at singing! I cried when she cried, I laughed & smiled when she did. I was blown away by this movie. No offense to Julia Roberts because I really like her, but she better move over & make room for Mariah!\n\nI hope we all see more of Mariah on the big screen in the future. I can't even say enough about how much I loved this movie! I would go again & again & again to see it. I can't wait for video. Mariah is so beautiful. Every angle the camera got Mariah at turned out perfect. She truly radiated a glittery glow. I think Mariah is the camera's best friend. She is truly the most photogenic person I've ever seen. Forgive me you guys, I am just Mariah's biggest fan. I think she is as close to perfect as anyone could be. I think Miss Mariah Carey is one of the most underrated artists out there & she deserves some recognition.\n\nI would also like to say that the other actors in this film were great as well. Max Beesley for instance. Great acting & great looking, this guy really had my eye. Where has he been all of our lives? Also Da Brat & Tia Texada did a wonderful job as well. Did I mention I can't wait for the video? Ok, all silliness aside. This movie was full of heart. It makes you happy, makes you sad, makes you laugh, makes you cry. It is full of inspiration & life lessons.Wakes you up a bit. Don't ask me how but they throw in a love story as well. I am amazed that they could give equally to each aspect of the film, but they did. Please see this film & get the soundtrack. You will truly be impressed by both. I love you Mariah!!!!!!\n\n\"Glitter\" GLITTERS & SPARKLES!!!!!!\n\nPEACE! GOD BLESS AMERICA!!!!!!!!!!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "lewistlyer",
        "review_rating": "10",
        "review_title": "Decent movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tonyaaw23",
        "review_rating": "8",
        "review_title": "Shaking Head",
        "review_detailed_main": "I don't know why people hated on this movie so badly. The first time that I saw it I was expecting to see 1.5 hours of trash...I was WRONG.\n\nFrom start to finish I couldn't stop crying because it was such a touching story. Mariah Carey played that girl with so much sympathy that anyone who couldn't feel for her must not have too much heart or compassion. I thought that it was a good acting debut for Mariah and I watch Glitter whenever it's on HBO. It's a very heartfelt story.\n\nBesides Mariah's amazing voice the thing that drew me to this movie was the fact that it seemed to be an autobiography. I was a puddle of mush at the end when she reunited with her mother. The only big flaw in the movie was how she was able to go on after learning that her lovah was killed."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "daugherty_jennifer",
        "review_rating": "10",
        "review_title": "Good!",
        "review_detailed_main": "I love Mariah Carey i am a huge fan and everything and my friends said that it was not a good movie but i saw it and i was so cute. Well my friend said it was probably because i like Mariah Carey. Well there were some parts that reminded me of my life. Like when her and dice get in a fight that reminds me of me and my boyfriend getting in a fight. Well and her getting to see her mom at the end see i don't get to see my mom anymore so um...when i saw that part my mom came to my house and i just started to cry. And Mariah just needs to keep doning more and more movies. And she needs to make more cd's cause all of them are so good. So um...to everybody that reads this this is coming from a huge fan go buy her cd's and go buy Glitter it a cute movie don't go but what anybody say's."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "desires2dream",
        "review_rating": "10",
        "review_title": "Absolutely Amazing",
        "review_detailed_main": "This film is amazing , you have to see it to believe it. it is better than Crossroads, Queen of the Damned , and AWTR. Mariah actually did a good job in this movie, too bad the press didn't give it a chance. she did not promote this movie at all due to her breakdown, she even canceled the film junket for this movie. i am sure this movie would've done very good at the box office if she had promoted it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "guylikeu",
        "review_rating": "8",
        "review_title": "Great if you like fun films like Grease!",
        "review_detailed_main": "This film really isn't very bad at all. In fact, I've watched it almost a dozen times now! If you like cheesy films like Grease and Singing in the Rain, then there's every chance you'll love Glitter! Don't sit down down and watch it expecting a Citizen Kane or you will be disappointed. Expect a fun peice of frothy delight, and you'll be pleased with what you see. Yes, the script is a little weak and the story is just unbelievable, but let yourself get swept away by the magic of the film! Mariah is surprisingly good in the lead role. Alot of the bad reveiws were thinly veiled personal attacks on her, which doesn't tell you much about the film does it now? Give it a chance - you might just love it as much as I do. 8/10."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mcfanatic",
        "review_rating": "10",
        "review_title": "Glitter is one of the best Movies Ever! Sadly it's also the Most underrated Movie Ever!",
        "review_detailed_main": "For the Life of me i'll never understand why people thought this movie is anything but AMAZING!!! This is one of the best Heart-Touching Romantic/inspiring films ever made! if you are a romantic at heart you'll love every second of this wonderful Movie! and in the end you'll even cry...Mariah's acting was Amazing !!! i think criticts dissed her because she was playing...a singer! And also because of Mariah's physical Breakdown in the summer of 2001. This whole thing has rolled into one mess of a deal when people horribly misjudged this movie and Mariah because of shallow reasons...Give this movie a chance! even this website's review of it ended making positive remarks about the Movie and Mariah's acting!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "roos0",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "I am not a Mariah Carey fan but I actually liked this movie. I have read the reviews of this movie and they come in two kinds:\n\n(1) It is an absolute piece of crap (this accounts for 99% of the reviews) and (2) I am a Mariah Carey fan and no matter what you guys say, I love it.\n\nSeems to me that the harsh critics are unfair.\n\nThe storyline is not as incredible as some people might think - in fact, part of it is autobiographic. And there's one thing about the movie that is absolutely 100% authentic: she has an astounding voice and a musical talent that most of her critics can only dream of.\n\nLove the disco music, too, by the way - brings back great memories.\n\nOK, I donned my asbestos suit - now go ahead and flame me. ;-)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "chuck7",
        "review_rating": "9",
        "review_title": "way underrated...",
        "review_detailed_main": "This movie was way too underrated. Mariah Carey is not a bad actress! The Max Beesley guy is good aside from the fact that he wasn't really sure about his accent. It's well-written for a movie entitled 'Glitter'. The poster's a little to 'festive' as Mariah would call it for me because there are some somber moments. Eric Benet's good too. The one problem I have with the music is that she rarely hits a high note. The songs are well-written but still the high notes are why we all like her, right? Also at times, her hair is really weird, which is good because it does supposedly take place in the eighties. I have to admit, as cheesy as it sounds, I cried at the end. I know I'm a dude, but 'never too far' is like my favorite song by her. I wasn't surprised by the fact that Dice you-know-whats (i won't give it away if you haven't seen the movie)in the end cause i had already accidentally read about it. She even finds her mom! All in all, a great movie that was ruined for most by the \"nervous breakdown\". Once again, way underrated.\n\nP.S. You'll get annoyed by Billie's publicist.\n\nP.P.S. Billie, what a masculine name!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "LuvableMamas3",
        "review_rating": "10",
        "review_title": "Great Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "bdphil-85958",
        "review_rating": "10",
        "review_title": "Great movie with a great soundtrack",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "beachbabe005",
        "review_rating": "10",
        "review_title": "Glitter is under-rated!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "deanriam",
        "review_rating": "10",
        "review_title": "Is not bad, despite what everybody says",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "shake_it_off_mariah",
        "review_rating": "10",
        "review_title": "Pulling through hard times",
        "review_detailed_main": "I don't see why this movie has so many negative ratings, most of whom rate this movie really doesn't understand it. This movie really shows how much that you can go through in life, and no matter how bad you think you got it, something can always turn around in your life. This also proves that dreams do come true if you only believe in yourself. Having Mariah Carey play the role of Billie Frank was a wonder idea, because Mariah is a very talented and well known singer, so it kind of fits in with her life, just as Billie frank, comes from a broken down home, and dreams of becoming a wonderful and famous singer, and she finds her fate, and doesn't give up in what she believes in. this is a good role model for kids, to show them that dreams do come true, if you only don't give up"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jadfoley",
        "review_rating": "10",
        "review_title": "Silver Strip Error!? No.",
        "review_detailed_main": "I had to stop reading your \"review\" considering you began with one of the most naive-sounding comments (to those that know what they're talking about).\n\nMariah *intentionally* wore the silver strip (and yes, in different locations) to overly promote aids awareness. Google your facts before commenting on something you think you know about. Still have a problem with the \"silver strip\"? (I can't capitalize the term aids without it being flagged by amazon for 'shouting' which I'm not sure how that has gone without being red flagged in itself)\n\nLiterally, this one of the best campy movies ever made which is why it continues to re-run on hbo along with other media outlets. Do you see 'Gigli' anywhere (at all) on TV? No. Give it a chance. Many of my non-Mariah fans have even agreed it's worth the watch.\n\nMaybe I'll continue this review when I can stomach the rest of yours."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sebita_",
        "review_rating": "10",
        "review_title": "All that glitters...IS gold!!!!",
        "review_detailed_main": "I gotta say, Mariah Carey really sparkles in this movie!! It´s incridble directed and it has a very good cast. One of the best things on the movie is the soundtrack; Mariah is a great artist, and with all the colaborators on the album, it deserves a 10!! And how about the end? It made me cry!! I just looove this movie as I never thought I loved a movie!! This is clearly \"glittering\"!!!!!."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tomarild-87578",
        "review_rating": "10",
        "review_title": "This movie is fire 🔥",
        "review_detailed_main": "Killer soundtrack, killer one liners, killer characters. Mariah came for blood y'all. Billie Frank for lyf."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "edveracardenas",
        "review_rating": "10",
        "review_title": "Better than you think",
        "review_detailed_main": "Mariah Carey makes a pretty decent acting debut in Glitter, the film that nearly ruined her career. Revisiting it on its 20th anniversary, you manage to connect with the emotion and nostalgia of a movie made with sincerity in an adverse context for the singer.\n\nThe refusal that surrounded the film is not enough to overshadow certain aspects that shine like the name of the legendary star. The eighties setting is one of the best achieved highs in Glitter: the wardrobe, the hairstyles and even the vibe transports you directly to one of the most inspiring and revealing decades in the music industry and of our society (Just like Pose did recently).\n\nFilmed before the 9/11 attacks, New York is another of the guest stars that stand out in the film, and seeing the Twin Towers is exciting. Then there's the music, ooh the music. Mariah Carey definitely leaves it all in her role as an aspiring singer on her way to the top. The final scene is one of the most moving and shows a vulnerable diva who they tried to erase, but always finds her way back home.\n\nI just can say #JusticeForGlitter."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "hlbventura",
        "review_rating": "10",
        "review_title": "Similar to a star is born......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "hopelessdramatic01",
        "review_rating": "10",
        "review_title": "Glitter is now one of my favorite movies of all times!",
        "review_detailed_main": "Glitter is destined to become a cult classic. All of Mariah's fans have waited and waited for this movie to finally become a reality. Unfortunately we were not too happy when the movie did not recieve the publicity that it deserved and when it was not realeased into many theaters nationwide. I live in Kentucky and I had to drive all the way to Indianapolis to see the movie. But it was well worth it!! Mariah shines as Billie and this movie is a combination of romance, comedy, and awesome music! I laughed, I cried, I was proud of Mariah. I recommend this movie to anyone that believes in love and knows the true power of music!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "meowgirl823",
        "review_rating": "10",
        "review_title": "I really enjoyed this movie.",
        "review_detailed_main": "As I said, I really enjoyed this movie. But perhaps that is because I went in as unpretentious as I possibly could. And with good reason. This is Mariah's first movie, it's not meant to be an Oscar winner, a serious film that makes you think, but it is fun, she did it for her fans, for herself. Not the critics. Her voice is magnificent in this film, it was a good time, a wonderful distraction from what is happening outside. Don't go in thinking you'll see a film along the lines of \"American Beauty\". Because you won't. Go in with no pre conceived notions and have a good time. That's what it's all about, right?"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "blulyricals",
        "review_rating": "10",
        "review_title": "Classic!!!",
        "review_detailed_main": "Really good movie! Now that I'm an adult I'm going to watch it again lol."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "bbmansoor",
        "review_rating": "8",
        "review_title": "A rewatchable movie",
        "review_detailed_main": "When I need inspiration I watch this movie. Max Beasley does a fantastic job along with Mariah."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "kitleenazero",
        "review_rating": "10",
        "review_title": "Ahead of it's Time",
        "review_detailed_main": "This movie truly was ahead of its time. It's a great movie to watch. It's fun, you get great music(to dance and sing along to), and there's truly some heart and lesson to the whole debacle of what happens in the movie. It's truly fun to watch or even listen in to. It's easy to follow along. You'll cry, be happy, feel sorrow, and so much more emotions. This movie touched the human heart."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "vision-quest",
        "review_rating": "10",
        "review_title": "Surprising",
        "review_detailed_main": "I had no expectations going into this movie.\n\nMariah is beautiful, has a great voice, but simply put, I don't like her music at all.\n\nAnd that's probably why I'm so surprised that I thoroughly enjoyed this movie. No, it won't win an Oscar, but it was entertaining and a definite feel-good movie.\n\nI have a new respect for Mariah."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "zenitsueagatsuman",
        "review_rating": "10",
        "review_title": "A classic.",
        "review_detailed_main": "Read The Meaning of Mariah Carey to understand why the movie turned out what it is."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "hugo_hp93",
        "review_rating": "10",
        "review_title": "That was superb!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mjmarzi",
        "review_rating": "10",
        "review_title": "This movie is the best!",
        "review_detailed_main": "I was so shocked some people didn't like this movie because when I watched it it was amazing. I really loved the music and Mariah looks amazing. Her acting really outshone everyone else."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "x_hong",
        "review_rating": "10",
        "review_title": "It's worth your time and money.",
        "review_detailed_main": "The plot and storyline is quite predictable. Some parts of the movie could be better. But overall, Glitter is not a bad movie to watch. Glitter can make you smile, even laugh at some parts, and it can make you cry either. Mariah surprisingly acts quite good, she only needs a better script. Just forget what people and critics said about her, if you want have a good time, watch it!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "rochellemarievaughn0209",
        "review_rating": "8",
        "review_title": "This Was Inspirational",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Awmoo",
        "review_rating": "10",
        "review_title": "Mariah Glitters!",
        "review_detailed_main": "I just saw Glitter, and I have to say that I'm very impressed by the film!! The script was somewhat weak, but Mariah definitely pulled it off! I was expecting her not to be able to act even a little bit, but she surprised me and I see her having a real future in films. Also, the critics reviews of this movie were just insane. After reading what they had to say I was expecting to be laughing so hard my side would hurt... but instead I was crying at the end. Glitter is definitely 10,000,000 times better than people are saying it is!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "bootyliciousgwennie",
        "review_rating": "10",
        "review_title": "Some ppl must have gotten Glitter in their eye",
        "review_detailed_main": "I don't understand all these bad reviews. Sure this isn't the best film of the year, but I don't think its the worst. Its good in its own special way. I feel so bad for Mariah Carey, she worked so hard on the soundtrack and on the movie, and both of them flopped.\n\nAnyway I saw this film on Tuesday, the day when all proceeds went to the September 11th fund, and watching the movie TOTALLY took my mind off of what was happening in our country at that moment. I have to say my favorite part was when I saw the World Trade Center for a split second, everyone else in the theater cheered. But trust me thats not the only good part, Mariah Carey is surprisingly a very good actress, and the songs in the movie are great. just go see it!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "V-for-Vendetta",
        "review_rating": "9",
        "review_title": "Couldn't take my eyes off her",
        "review_detailed_main": "I really enjoyed this film. Mariah did a great job and shows promise. Mariah was very connected and believable which is more than we can say about some other \"Diva's\" first movies. I couldn't take my eyes off of her. Mariah's deep inner life that we hear in her \"non-released/commercial\" songs shines through on the big screen...intriguing. The story gets a bit slow in the middle...but not by fault of Mariah. If the writing was supposed to be \"stereotypically 80's\" it missed...it seemed just stereotypical at times...amongst other things. The music was awesome and the club scenes a lot of fun...very alive! The styling and costumes were perfect. The actress playing `young Mariah' was a dreamy little doll. Terrence Dashon Howard was excellent as always in his `bad guy' roles. Da Brat was also surprisingly fun to watch. I'm not so sure about some of the other supporting cast...may have been a missed opportunity or two. All and all a very enjoyable film with a lot of glitter, fierce music and dare I say camp! I look forward to seeing more of Mariah on the big screen."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "TJBNYC",
        "review_rating": "",
        "review_title": "Vanity, Thy Name is Mariah",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "babyboy_curtis",
        "review_rating": "10",
        "review_title": "Shutup everyone Glitter was great and I do not care who knows it!",
        "review_detailed_main": "Glitter was a great movie, half of you losers who comment here haven't even seen the dam movie. It was good and anyone who ACTUALLY saw it would know so. I hate how people are a bunch of followers and only bash the movie because everyone else is. People like that are retarded, and now all of a sudden now that Mariah has climbed back on the social ladder with The Emancipation Of Mimi, you guys all want a piece of her and now support that she is going to be in a new movie later on this year. Well be honest and if you haven't really seen the movie and you have commented on it then rent it, buy it or whatever and take the time to actually see it.\n\nCurtis"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sewheele",
        "review_rating": "",
        "review_title": "A Cinematic Triumph",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Godscreation_89",
        "review_rating": "10",
        "review_title": "I was touched",
        "review_detailed_main": "I was touched by the movie.MC is the best and she has been my idol since she first came out. I loved the movie and i cried when the DJ died in the end because MC never got to tell him how she really felt about him and she loved him so much. the other part that i really loved was when she meet her mom for the first time in a long time. i haven't seen my mom in forever and i would give anything to see her again. i bought the movie and i still watch it from time to time. and i think that some people it was a bad movie and some think that it was good but people have their opinions. and my opinion was that i loved it and i will always watch it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "dizzy-12",
        "review_rating": "",
        "review_title": "oh dear!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "trebortrebor",
        "review_rating": "8",
        "review_title": "don't be such snobs",
        "review_detailed_main": "Well, kill me, but I did not think this was such a bad movie. It looks like everyone on this website is such an intellectual snob that this movie is simply beneath their level. I guess people these days watch nothing but genuine works of art. Never mind that film-making \"gems\" such as Terminator, Kill Bill, Indiana Jones and Pirates of the Caribbean make it into the all-time top 250. Now, wouldn't you call that double standards? As regards the movie, it may be a bit cheesy but the acting is not bad, the costumes and the shots of New York are fun and the music is enjoyable. I give it a 10 to counterbalance the prevailing unreasonably low score."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Arenas4812",
        "review_rating": "",
        "review_title": "One of the worst, i've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Catherine_Grace_Zeh",
        "review_rating": "9",
        "review_title": "Touching musical drama that's sure to stick with you",
        "review_detailed_main": "What's with all the negative comments? If you ask me, Mariah Carey gives a dazzling performance in this touching musical drama that's sure to stick with you! You go, girl! If you ask me, Billie (Mariah Carey) could sing very well. When she recorded her first hit, I felt really good. This was because she sounded really good. The performances were smashing, the soundtrack excellent, and the cast perfectly chosen. Even though I like all of the songs in this movie, I would have to say that \"Never Too Far\" is my favorite. It really touched me inside. One of the best musical dramas of all time, I give GLITTER three out of four stars."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "~PL~",
        "review_rating": "",
        "review_title": "Ouch!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Crash_overdrive_2001",
        "review_rating": "10",
        "review_title": "It was THAT bad",
        "review_detailed_main": "Honestly! What did you expect from a movie with a first time actress in the lead role. The plot has been done to death,however it was well directed and Mariah Carey did justice to a part that couldnt be played well because its been done 100 times. Mariah Carey is a very talented Artist and i have been a fan since i was 5. She has a voice, that although isnt what it used to be, is beautiful. Thus she should stick to singing but since it has become the trendy thing to do, She did make a movie and it flopped big whoop! I saw the movie and was saticfied and I didnt eagerly await the critical slams. Seems like everyone just cant wait to see her fail. Mariah I feel sooo sorry for yo right now and i really do appreciate what you do."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "pizzapooch-2",
        "review_rating": "",
        "review_title": "Not as bad as it appears!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mcluverboy",
        "review_rating": "10",
        "review_title": "It's not a bad movie, if you've seen it you would know.",
        "review_detailed_main": "This movie is not a bad movie! If you've seen it you would know. It has got a lot of bad press and because of this people are so quick to judge it. It's has a nice story-line and it is one of those movies that makes all the ladies cry at the end. It's fun and the music is really cool. It's a story of success, love, and sorrow. It's not a bad movie. Give it and Mariah a chance and you will see that this 'Glitter' really does sparkle."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "gazebo",
        "review_rating": "",
        "review_title": "Lovely Mariah, sucky, sucky, movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "fizzyx15",
        "review_rating": "10",
        "review_title": "ok",
        "review_detailed_main": "I think the movie was pretty good, especially for her first try. The soundtrack was even better. I'm sure the movie could have been less predictable but it was still good and anyone that goes to watch movies just to pick them apart and put them down need to start enjoying things and stop being so pessimistic like all the critics. I usualyl like movies that the critics hate and they were wrong again. Go Mariah!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "BlackJack_B",
        "review_rating": "",
        "review_title": "Not the worst film ever made, but a very mediocre vanity project.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "jaxfilms",
        "review_rating": "10",
        "review_title": "Carey delivers heartfelt performance in \"Glitter\"",
        "review_detailed_main": "A wide-eyed caramel skin girl sits quietly on a bar stool watching her mother beautifully sing on stage while her audience are lost in their own lives. To encourage some kind of reaction the mother calls upon her daughter to sing with her. The bashful girl wanders to the stage, takes the mike, and sing. This is the opening to \"Glitter\", a movie that simply sparkles.\n\nFrom a very promising opening scene, you somewhat get the feeling that \"Glitter\" is on its way to becoming a new type of film. The opening scene is tinted, and grim, but still comes off as beautiful and refreshing.\n\n\n\nSinger/songwriter Mariah Carey helms this film and insists that this is not an autobiography. Thank God. The life of Billie Frank is sad and disillusioned. After being abandon by her jazz singer mother (Valerie Pettiford), the adult Billie (Carey) is unsure of herself. Everyone she knows, from her two best friends (Tia Texada and rapper DaBrat) to a pimplike producer (Terrance Howard) knows she can sing, but Bille doesn't really know her true potential.\n\nEnters DJ Julian Dice (Max Beesley) who not only tells Billie that she can sing, but guides her on her path to securing a record deal.\n\nBut the path is unsteady.\n\nBeesley's character is the shakespearian tragic hero with the most problems and most lines. Carey's character seems restraint, as if screenwriter was unsure of Carey's true potential.\n\nCarey is a fine actress, with a remarkable screen presence that sparkles from beginning to end. Her problem is the few lines she is given to spat out that ranges from bland to Hallmarkish (\"You were the only one to believe in me,\" exclaims Billie is one scene). But the cliched script is overshadowed with a great supporting cast and beautiful scenery.\n\nThe movie's best moments involves Carey main talent - her vocal prowless and passionate songwriting amidst a triumphant soundtrack. The opening song (\"Lillian Blue\" sung by Pettiford and newcomer Isabel Gomes who portrays the younger Billie) is simply beautiful and watching Carey unabashedly singing \"Reflections\" in one scene, is truly worth the admission itself.\n\nDirector Vondie Curtis Hall does an admiral job with his direction; some scenes are close to ground breaking, and the shots of the world Trade Center is a somber and poignant reminder of its lost beauty.\n\n\"Glitter\" sparkles with a supporting cast, superb soundtrack, and a star that can now add actress to her ever-growing resume."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "RhondaWeasley",
        "review_rating": "",
        "review_title": "All that Glitters is not Gold. . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "leighabc123",
        "review_rating": "8",
        "review_title": "Why Do People Bash This Movie?",
        "review_detailed_main": "This was not the best movie ever. But it was not the worse movie ever! W e got to listen to Mariah Carey's six octave singing during the movie! Yes, this movie was boring. One of the main reasons why this movie was boring is because they did not give Da Brat enough speaking lines. They also did not let Da Brat sing or rap alone!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "DalKhan",
        "review_rating": "",
        "review_title": "Sour Note",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tootsie4ever12",
        "review_rating": "10",
        "review_title": "Great Movie!",
        "review_detailed_main": "Mariah Carey plays a great role in this movie. She goes to a club where she meets Max Beesley (aka DJ Dice) and eventually they start to go out and he produces her. Comedy/Drama/Romance. Great movie. I recommend it for more mature audiences."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "newkidontheblock",
        "review_rating": "",
        "review_title": "Holy Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "gv8681",
        "review_rating": "10",
        "review_title": "You all are judging her acting when you should blame the poor writing. Mariah is an excellent actress.",
        "review_detailed_main": "Mariah Carey did a great job as a first time leading role actress. You all may not believe it but her movie and cd are one of the best in the year 2001. It's irritating that many are critizing the movie and I bet they haven't even seen the film. Those are usually the people that feel stupid after seeing it the 10th time."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "crazyrabbits",
        "review_rating": "",
        "review_title": "(brain on sleep mode)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "angelo17",
        "review_rating": "10",
        "review_title": "not great, but not bad either!",
        "review_detailed_main": "glitter's main problem is that the storyline is weak. it also tries to put a subplot that doesnt work (the dj vs. producer scenario). however, it isn't as bad as how critics have said. it actually has a good story, only the moviemakers failed in execution. as for the acting, they do relatively well and it cannot be denied that mariah has the charms and an acting skill that can be further developed.\n\npeople are just dissing off this film because mariah, a major music superstar, is starring on it. okay, so mariah wouldn't be reaping any oscar nominations for her performance for glitter, but she delivers. but really, this movie did so not deserve all the flak it got. give her a break! this is only her first movie.\n\n7.5 out of 10"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Zombie9000",
        "review_rating": "",
        "review_title": "Jaw-droppingly bad performance from Mariah Carey.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "whispering_comet",
        "review_rating": "10",
        "review_title": "THE BEST MOVIE EVER!!!!",
        "review_detailed_main": "This is one of the best movies ever made. Mariah looked so beautiful and is so talented. I can't wait to see it again and again and again. She is one of the most talented people in the world!1 Everyone should go see this movie!!!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "neid",
        "review_rating": "",
        "review_title": "Better than the pantomime!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Soul4Lover",
        "review_rating": "8",
        "review_title": "Should have done better at box office",
        "review_detailed_main": "Had all the hoopla and bad karma surrounding this movie not been a factor, this movie should have done better at the box office. Unfortunately people are so easily deceived by the media and the influence of negativity this movie was not even given a chance. This low impact chick flick is mostly appealing to females between the ages of 15 to 25, but the average woman and fans should like it."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Phoenix-107",
        "review_rating": "",
        "review_title": "It Just Doesn't Get Any Worse Than This",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "farguss",
        "review_rating": "9",
        "review_title": "Glitter",
        "review_detailed_main": "This is one of the most underrated film since 2000. OK, Mariah Carey isn't the actress that can win an Oscar, but the story is good, the director is Vondie Curtis-Haal (Gridlock'd is wonderful!)and... ...and in the cinema there are so many films that are awful! Glitter isn't awful at all! it's only so so underrated from the media.\n\nThen, we must even remember the music! The soundtrack it's marvelous! Mariah Carey's fantastic like always...her voice is something special...it's a real pleasure, listen to her voice watching the film!\n\nI've rated at 9 this film, 'cause i think it's already been penalized enough!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "spanky_boz",
        "review_rating": "",
        "review_title": "My Heavens....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tcmtryj",
        "review_rating": "10",
        "review_title": "Love it",
        "review_detailed_main": "Loved it back then and still love it now. It shows how far she has come. If only this movie was more appreciated back then like how all the other movies that got singing in it is appreciated now."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "sat-elite",
        "review_rating": "",
        "review_title": "Ahhhhhhh, my eyes !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "LuckyBoi79",
        "review_rating": "10",
        "review_title": "gotta love her",
        "review_detailed_main": "Mariah Carey shines in this movie. Who else can act under all that pressure as well as she did and have a hot soundtrack to bat. Think of the time era she was tapping into. Of course I love the 80's so its all good. but I've seen way worse movies with even worse soundtracks. At least Mariah pulled a double on this project and got the well deserved rest she needed to come back with her best album ever! The emancipation of Mimi of course. Now if only she can turn some of her songs into another movie and maybe this time she'll get herself an nomination for something other than a Razzie. I'm not going to say her \"acting\" in Glitter was the best I've seen but at least giver her the credit for trying under all that pressure."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "MLDinTN",
        "review_rating": "",
        "review_title": "Mariah needs to stick to singing not acting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "lewissidley",
        "review_rating": "9",
        "review_title": "I will Never Believe the Critics AGAIN!",
        "review_detailed_main": "Perhaps I'm going to say something I shouldnt say, but here goes. This movie reached into my very soul. if I am maligned and ostrecised for giving \"Glitter\" **** 1/2 out of *****, then very well. \"Glitter\" glitters,\n\nAND TIS GOLD 2!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "LadyTombs",
        "review_rating": "",
        "review_title": "Mariah and Company is not all that bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "frankmcgowan-official",
        "review_rating": "10",
        "review_title": "brilliance embodied with heart",
        "review_detailed_main": "This is a truly fantastic film - a more than mediocre storyline (the typical rags to riches done to death saga) but done with stunning cinematography, class, elegance and a more than credible cast coupled with a fantastically memorable soundtrack. For all these reasons I do not understand why this film has been so slated since its release.\n\nThe multi-talented Mariah Carey plays Billie, who as a child watched her alcoholic Mother perform - now as she enters her adulthood she yearns the fame her Mother's addiction stood in the way of. At the bottom of it, she just wants to be loved... and don't we all? Billie finds love with club DJ and music producer Dice, who helps her find her feet on the path to her career goals, but of course there are obstacles. There always are.\n\nAlso a highlight of this film regardless of her limited screen time is Padma Lakshmi's portrayal of Sylk... absolute entertainment, just not a great vocalist (but she does try, oooh how she tries!)\n\nBuy this film... watch this film... rate this film. Its great! (And no, I am not Mariah before any of you go and say it!)"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "robmlavoie",
        "review_rating": "10",
        "review_title": "sweetest movie i've seen in a long time!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "softballchick009230",
        "review_rating": "10",
        "review_title": "hmm..",
        "review_detailed_main": "i love this movie...i rented it wen it came out n then just a few days ago found out that my stepsister had it on DVD...so i watched it again n i still love this movie...call me crazy but i love it...but yea I'm done ha ha..haha i guess i gotta have 10 lines for this thing...so i guess i'll just talk...well i don't exactly know what to say..well the movie i guess...some people absolutely despise it...but i like it...so there...haha...i liked the songs on the soundtrack...there pretty good...although some people didn't like them either...almost ten lines...were almost there and then you don't have to listen to me talk haha yes! ten lines! haha later people Steph"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "rainbow_love20071991",
        "review_rating": "10",
        "review_title": "shut up all of you",
        "review_detailed_main": "mariah carey is one of the best divas and i have seen the movie and i thought it was good but i feel like all you idiots who made it seem stupid are bad so OK it may not have been the Color purple but it was pretty good to me I mean I sat here for like 15 minutes and read the reviews for theses people and no body had anything good to say every one made it seem worst than it was and I also seen someone post something about her mother being a crack head and to get over it boo hoo. I think that was hash and unnecessary. I mean her mom isn't even black her dad is so you don't even know what you are talking about cause the movie was not about her. I think for her first movie she did good and someone said that the songs weren't good but I am a singer my self and those songs were phenomenal if you listen to the words but as usual someone always got something to say just like they did Whitney Houston in the body guard but that was the stuff to."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "princessldybg91",
        "review_rating": "10",
        "review_title": "A Great Movie",
        "review_detailed_main": "I know that some people think that Glitter is a bad movie, but I watched and thought it was a great movie. It's about a biracial girl, Billie Frank (Mariah Carey) who was born to a African-American mother and a white father. Her mom was a singer but she had some kind of drug or alcohol addiction which interfered with her career. Then Billie's life starts to change: her mom carelessly set the apartment on fire nearly endangering the life of her daughter. Then the next scene, Billie is taken away from her mother and into foster care. She meets her friends, Roxanne (Tia Texada) and Louise (rapper Da Brat) who stay with her for the rest of her life. Then we go to 1983 where Billie and her friends are dancers. They then get signed to sing backup to a horrible singer named Sylk and the producer decides to have Sylk lip-sync Billie's part. One night at a nightclub, a DJ by the name of Dice (Max Beesley) finds out that Billie actually sang Sylk's part. He instantly falls for her and wants to produce her. Billie agrees to, she becomes a superstar, but realizes the life of a singer isn't as glamorous as she thought it would be. Dice turns obsessive, her friends hate her fame, and all the drama goes downhill after that. In the end, Dice ends up getting shot before Billie's concert and killed. I loved the last part where Billie meets up with her mom again. It was beautiful.\n\nI think it's a great movie and all Mariah Carey fans should see this movie. And for the other people who hate this movie: If you don't like it, don't watch it! This movie is a million times better than \"Crossroads\" or \"From Justin to Kelly.\"\n\nI give this movie a ten because it's a great movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mariahcarey90",
        "review_rating": "10",
        "review_title": "what a beautiful, personal,artistic masterpiece",
        "review_detailed_main": "I am filmmaker and I've been waiting to get around to commenting on this. I saw this film almost everyday during it's brief 2 week theatrical run in 2001,and multiple times on video/ DVD (i own it ). I just want to say that Mariah Carey and Hall created a beautiful, personal, artistic masterpiece of cinema, a soulful meditation on time, memory, love, and loss. Great artsy camera-work, lighting, and editing framing a deeply personal story. In other words a poetic art-house film. Mariah Carey is excellent in the lead, as is Max Beesley. Great emotionally gripping scenes. Beautiful poetic music. Great visuals. I could never pick one all time favorite film until I saw 'GLITTER\". WOW!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ahughes-10183",
        "review_rating": "10",
        "review_title": "I loved this movie",
        "review_detailed_main": "I loved this movie, I thought it was good. The songs in the movie were also great. I just believe this movie was released during a bad time, and it isn't that horrible like people claimed. There are worse movies that actually deserve a 2 rating. But I guess ratings are in the eye of the beholder."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "john-cheeseman-43446",
        "review_rating": "8",
        "review_title": "Better then I thought it would be with a good soundtrack",
        "review_detailed_main": "Yes it's very predictable but I did enjoy it. Loved the music - I know it's mariah here but she definitely tried a different feel for the beginning of 2000's - positive da brat is actually good in this. Negative- max Beesley not so great"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "yzcypmmh",
        "review_rating": "10",
        "review_title": "Good movie not understanding the bad rating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "frosty-44431",
        "review_rating": "8",
        "review_title": "People Love To Hate",
        "review_detailed_main": "More of a fan favourite. However, it's not a bad film. There is a story line and the music creativity is amazing. A very 80s style. Worth a watch!!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tamaraj-08324",
        "review_rating": "10",
        "review_title": "The inspiration behind Dreamgirls",
        "review_detailed_main": "This movie, loosely based on Mariah's rise to success, is the ultimate late 90s movie that every other similar film, like Dreamgirls, is based on. The musical accuracy brings the 80's back to life, when the movie is set"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "picuco9",
        "review_rating": "10",
        "review_title": "A Good Musical. A Good Mariah.",
        "review_detailed_main": "I went to see this movie for 2 reasons, this movie is the only wide release, and I'm not that much of a Keanu fan. I'm not either a Mariah fan, but I wanted to do something else other than watch the news. So I went to the movies with my friends and saw Glitter, I had heard about the movie because of her breakdown but never saw the trailer. What I can't believe is that I liked this movie, and mariah is good in it, and it's not just a girl makes it big story, it has other interesting plots, and overall it's a feelgood movie, and I needed that. What people forget is that movies are made to entertain you, and this movie does that! B+ Oh! bye the way, the music was great!"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "nicholaspomarico",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "This movie is amazing and it's soundtrack too: mariah did amazing on this. I think that this was a very big career moment for mariah and i think that it is a very underrated film. Is the acting 10/10? No. But you don't need 10/10 acting to enjoy a film... it needs to be entertaining. Which this film exceeds at. It was a fun little watch and is a good film to watch on rainy days or something. I recommend all to watch this movie bc it's just amazing. I truly love the soundtrack as well. I Didn't mean to turn you on is a BOPPPPPP!!!!! And lead the way?? It's so good. The climax is so perfect and amazing."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "julficarhuang",
        "review_rating": "10",
        "review_title": "Justice for glitter",
        "review_detailed_main": "I love this film, i cried for couple times. The soundtrack are amazing."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ericodonovan1",
        "review_rating": "10",
        "review_title": "Mariah Carey is the greatest",
        "review_detailed_main": "She's a queen, love her, best woman ever, great film, best singer and dancer"
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "nalendrapradama-29535",
        "review_rating": "9",
        "review_title": "Not like what people think",
        "review_detailed_main": "I think this movie isn't that bad, at least 5.5. Her acting is ok thou. I don't get why people hate this movie so much, maybe bcs this movie is released at the same time with 9/11? But this movie is Ok. The sountracks are good, the storyline is ok.. i didn't see the \"brutally Bad\" moment in this movie."
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "blueskye6571",
        "review_rating": "",
        "review_title": "ehhh..its ok",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "aussiemiguel",
        "review_rating": "",
        "review_title": "Not an award winner, but I've seen far worse.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ctroy",
        "review_rating": "",
        "review_title": "Better than most reviews here would indicate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "lissababy990",
        "review_rating": "",
        "review_title": "enough of this already.. IT WAS A GOOD MOVIE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "meglizbf",
        "review_rating": "",
        "review_title": "A Trying Performance from Mariah",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "pv71989",
        "review_rating": "",
        "review_title": "Not Bad, but not Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "athomas1",
        "review_rating": "",
        "review_title": "It just didn't feel like the 80's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "irawk",
        "review_rating": "",
        "review_title": "Where to begin....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "elshikh4",
        "review_rating": "",
        "review_title": "Weak remake of A Star is Born meets weak anti-alcohol public service announcement !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Blooeyz2001",
        "review_rating": "",
        "review_title": "Entertaining Fluff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "b_spillman",
        "review_rating": "",
        "review_title": "Well acted, treat for Mariah Carey fans !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "ceyapi",
        "review_rating": "",
        "review_title": "Undeniably horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Filmbuff-55",
        "review_rating": "",
        "review_title": "Marvellous piece of emotional entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "charlie dont surf and i think he should",
        "review_rating": "",
        "review_title": "theres a reason she was voted worse actress",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "HollywoodMich",
        "review_rating": "",
        "review_title": "(SPOILERS) And the Winner of the worst movie ever goes to...Glitter!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "martharay-01256",
        "review_rating": "",
        "review_title": "So bad its unbearable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Diva Marie",
        "review_rating": "",
        "review_title": "Slow starting, but impressive and inspirational ending...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "TheDrizzle77",
        "review_rating": "",
        "review_title": "Warning: Brain Detachment Necessary While Watching This",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "mchugh",
        "review_rating": "",
        "review_title": "Watch it if you like Mariah, otherwise don't bother.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "beginningthewrld",
        "review_rating": "",
        "review_title": "really not that bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "bronty",
        "review_rating": "",
        "review_title": "A Star is (still)Born",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "matthew87",
        "review_rating": "",
        "review_title": "a excellent movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "rlmac",
        "review_rating": "",
        "review_title": "nice, not good, but not terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Chrissy_Snow",
        "review_rating": "",
        "review_title": "Not As Bad As People Say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "famousgir1",
        "review_rating": "",
        "review_title": "Glitter is surprisingly good! Didn't deserve the criticism it received.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "owenowen3",
        "review_rating": "",
        "review_title": "Makes my bottom 10 list",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Victor Field",
        "review_rating": "",
        "review_title": "Mariah Carey: voice of an angel, body of a goddess, flimsiness of a vehicle.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Devotchka",
        "review_rating": "",
        "review_title": "I don't know what to say.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "meliajanssen",
        "review_rating": "",
        "review_title": "OK.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tpwhite2",
        "review_rating": "",
        "review_title": "LOL! One of the best pop-diva movies to date...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "frogman39",
        "review_rating": "",
        "review_title": "Mariah the friendly ghost",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "tmace",
        "review_rating": "",
        "review_title": "Better writing would have helped",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "JVe5462530",
        "review_rating": "",
        "review_title": "Ummm...well?(slight spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0118589",
        "movie_name": "Glitter",
        "movie_rating": "2.4",
        "review_username": "Hugh_Janus",
        "review_rating": "",
        "review_title": "Mariah's Assets",
        "review_detailed_main": ""
    }
]