[
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "AarPrince",
        "review_rating": "1",
        "review_title": "A Trilogy Of Torture",
        "review_detailed_main": "If you are OK with watching an illogical movie where a guy with a gun is running straight at 200-300 other guys with guns, and all these other guys miss each and every one of their shot while the one guy is able to kill them all then go watch it.\n\nI don't know what kind of mental conditions these people are suffering from, who are rating this movie 10/10. I just don't think Tiger Shroff will make any sensible movies in which he just acts good and doesn't just say mindless dialogues."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pandeydh",
        "review_rating": "1",
        "review_title": "JOHN WICK WHO??",
        "review_detailed_main": "Best acting from tiger Shroff... Change my mind @gauravpandey\n\n170r ka ticket ... Usse accha 1 month ka Brazzers premium lo"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rohitbharatsharma",
        "review_rating": "1",
        "review_title": "KILL ME PLS",
        "review_detailed_main": "I am suffering From Brain Haemorrhage after The Movie 😭😭😭 Im A Sci Student but now i lost interest in physics 😭😭"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jatindosi",
        "review_rating": "1",
        "review_title": "Worst movie of 2020 # Bollywood Blunder",
        "review_detailed_main": "Worst story line, worst direction, Bollywood should ban this type of story writer & director, # Kalank again on bollywood"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "manas-95108",
        "review_rating": "1",
        "review_title": "Worst experience",
        "review_detailed_main": "Just one word.. Bakwass Wasted my time and money.. There's no story , no logic . Action sequence are directly copied form Wonder Woman and Spiderman : Far from home . And Tiger Shroff acting was one of the worst acting i had seen ever. Similarly Shraddha Kapoor dialogues are full of abusive words. And also this movie contains some nonsense songs which are too copied. Just get away from this movie or you may have severe injury to your brain cells. Bollywood is getting worst day by day.😐"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vigneshdesmond",
        "review_rating": "1",
        "review_title": "What the actual heck",
        "review_detailed_main": "One on those films which is so awful that even my 3 existing brain cells commited suicide. Yes, Tiger sheroff basically becomes superman and stops time to fight Syrian instigators. Yes there's a stupid love story which is somehow interlinked to US embassy in Syria. Please, for the love of god, don't watch this movie IF you want to live. Also, not dope, no \"realistic VFX\"."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kumaripr",
        "review_rating": "1",
        "review_title": "The worst movie I've ever seen",
        "review_detailed_main": "No logic , worst vfx , worst acting , worst storyline"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "fakram17",
        "review_rating": "2",
        "review_title": "I'M IN SHAMBLES!",
        "review_detailed_main": "Bollywood is Loosing it's Charm Day by Day. Nepotism Sucks. Worst Movie of this Decade. New Decade Same Old Rubbish Bollywood. Just Avoid it at any cost."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dharammann-56882",
        "review_rating": "1",
        "review_title": "I would rate 0 but then there is no zero rating here",
        "review_detailed_main": "Most pathetic movie ever made possible ...extremely bad acting , poor film making , rubbish . Watch a cartoon serial on tv than watching this movie ."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "logical_guy",
        "review_rating": "1",
        "review_title": "Please Avoid This Trash",
        "review_detailed_main": "Just illogical story....they just want to make audience fool by that illogical action scenes.... Don't waste your valuable time and money in these kind waste..movie...it is just mixture of all Hollywood high end action action scene..and same old Bollywood story of saving his brother from..villians..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "charliethehacker",
        "review_rating": "",
        "review_title": "New Entry in Sandaas Movies List",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "naikkartik-61048",
        "review_rating": "10",
        "review_title": "Totally Hilarious",
        "review_detailed_main": "Tiger looks Dashing.. Huge scale of action.. A pure mass entertainer with jaw dropping larger than life action sequence"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "innocentsarmuel",
        "review_rating": "6",
        "review_title": "Beautifully directed movie",
        "review_detailed_main": "Although the movie contains a lot of sensational and mind-blowing fight scenes but it lacks more realistic concepts. I can't imagine a man having enough strength to take on hundreds of humans,even machines. Nice acrobatic display by Tiger Shroff, I hope to see a better performance in future."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "soyab786110",
        "review_rating": "1",
        "review_title": "Can i give minus ratings on this one?",
        "review_detailed_main": "I understand that action movies are good for business. But please put some logic. If you want the hero to jump far. Atleast give him some backgrounff of superhuman stuff. He jump across 30 feet like its another step. Even superman would be scared to show stuff like that. I want refund. If someone is planning to watch this movie. Dont ever go and spend money on this one. I like tiger shroff. But please take some good scripts."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Abdulxoxo",
        "review_rating": "2",
        "review_title": "Too many 1 stars",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hackers-61205",
        "review_rating": "1",
        "review_title": "Never watch this nightmare",
        "review_detailed_main": "Bollywood will never understand that people dont want endless action without any story We want good plot Tiger shroff is always a dissappointment of bollywood I dont how people can even like him. He should be a stuntman not a actor. A movie without plot. Plot must be written by salman khan. If anybody loved this film he must be having critical condition he must be needed some mental checkup or he has never seen a good movie in his life or he must be an alien. I request everybody please dont promote creators to make these types of films, bollywood needs a too much improvement. If you will promote these films it will never improve from actors like salman khan, tiger shroff."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "giteshjain-07286",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Pathetic, no logic , no acting, only illogical action"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ray_rampage",
        "review_rating": "1",
        "review_title": "This movie don't deserve to be rated",
        "review_detailed_main": "A shame on all the movies ever created. This is the new rock bottom."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "satishmeghani",
        "review_rating": "1",
        "review_title": "Tiger's version of \"Kalank\". A \"Kalank\" of 2020",
        "review_detailed_main": "Baaghi 3 has neither a storyline nor a good plot. Except some VFX added action packed scenes the movie has nothing new to offer. It's good if you avoid this trash and save your time and money. Totally avoidable 🙏💐🙏"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "LemmeEatYou",
        "review_rating": "1",
        "review_title": "Another idiotic movie by Tiger shroff",
        "review_detailed_main": "Action is amazing there is no doubt but acting there is none, Tiger should be a stunt directer rather an actor."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rajkhuranaabcd",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "In Baaghi 3-No story, No screenplay. Tiger shroff's action was good but acting 🤣.,Shradhha kapoor did over Acting, Ritesh Deshmukh wasted. So Ahmed Khan if you can't focus on story please don't makes movies. Don't waste our money and time. All songs are remakes why? Baaghi>>Baaghi 2>>>> Baaghi 3"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Rollters",
        "review_rating": "",
        "review_title": "Do not watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rish2006",
        "review_rating": "8",
        "review_title": "Dope",
        "review_detailed_main": "This is film is a must watch if you're fond of action movies. All the action scenes have been taken to the next level with high realistic VFX. Just minus 2 stars for the film being slow in the starting."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "madanmarwah",
        "review_rating": "6",
        "review_title": "Tiger lands in Syria to rescue brother and action follows",
        "review_detailed_main": "So we have our desi Rambo ( Tiger Shroff ) taking on half of the fighting strength of Syria as he goes about rescuing his brother Ritesh Deshmukh ( Indian police officer ) who is kept hostage. To help him in this mission he has Shraddha Kapoor. The film is full of action with fights and explosions galore every minute. It is\" \"maar dhad unlimited\". Most of it is highly exaggerated with no considerations for the laws of physics. A few sequences are downright ridiculous. There are many sequences of Tiger running towards camera with full blown explosions in the background. The film is targeted towards diehard fans of Tiger Shroff, and they will not be disappointed. Others like me will find Tiger lacking in the acting department. Other members of audience may find it difficult to sit through this overdose of mindless violence, and a wafer thin script. In one action scene there is countdown of 45 seconds on display as Tiger bashes up the goons ! Of course Tiger wins hand down. Director Ahmed Khan unabashedly gives you an upfront overdose of unadulterated action . He has definitely put in huge amount of effort and the logistics seem to be quite complex. Some good cinematography and special effects are seen. The narrative is confusing made worse with banal dialogue. However the film provides full on entertainment provided you don't ask questions."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abhishek-90405",
        "review_rating": "1",
        "review_title": "Tatti movie",
        "review_detailed_main": "Only one thing comes to your mind if you watch this movie i.e. \"Kya bawasir bana diye\". It is seriously unbearable."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "satyamagarwal100",
        "review_rating": "1",
        "review_title": "Worst movie of the year.",
        "review_detailed_main": "No story. No direction. Just ignore and skip this movie like an ad. Not worth a watch."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "xabc-36494",
        "review_rating": "1",
        "review_title": "Cringe x 100",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "SinhaSomesh",
        "review_rating": "2",
        "review_title": "RUBBISH",
        "review_detailed_main": "#FinalVerdict\n\nThe biggest problem with Baaghi 3 is that there's hardly any storyline in the film. Sajid Nadiadwala's adaptation is lame and it rests on a wafer-thin plot. What could've been an exhilarating thriller, with pulse-pounding moments, ends up being a run of the mill saga, courtesy a half-baked screenplay (Farhad Samji). Since Baaghi 3 goes beyond the shores of India, director Ahmed Khan and his team of writers (Sparsh Khetarpal, Tasha Bhambra, Madhur Sharma) could've used their imagination and packed the film with moments that would've made your jaws fall on your knees. Baaghi 3 is a big film in all respects - big stars, big canvas, big expenditure on VFX, big expectations. Sadly, it's a big, big, big letdown as well.\n\nThe experience with Baaghi 3 is like, you enter a posh restaurant, waiting for a sumptuous meal to be served, but what's served on your plate is vada-pau. Baaghi 3 takes you back to the 1970s Bollywood, when illogical situations, blood and gore, for no rhyme or reason, were the main ingredients that made the junta break into taalis. Sorry, the formula doesn't work anymore! Seriously, what were director Ahmed Khan, Sajid Nadiadwala (story adaptation) and Farhad Samji (screenplay & dialogues) thinking when they went ahead with this apology of a script? It's perfectly okay to pay homage to the masala films of yore, but the new interpretation has to make some sense at least. The one thing that you realize after watching Baaghi 3 is, no amount of gloss, glam and top-notch stars can ever substitute for a riveting script. Great stars, great styling and great visuals work as long as the script is great.\n\nFarhad Samji's screenplay is a complete mess. In fact, if at all there would be Razzies in Bollywood, Farhad Samji should be nominated proto for coming up with a slipshod, brainless and witless screenplay. What saddens your heart is the fact that Sajid Nadiadwala and Fox Star Studios, the producers of Baaghi 3, have spared no efforts in giving the film a spectacular look. The vision is perfect, but how about narrating an absorbing and attention-grabbing story? You remember Baaghi 3 for its striking visuals, not storyline. It's like embellishing priceless and precious jewels on a mannequin. The fight becomes too Bollywoodish as the hero eliminates an entire army of terrorists, is difficult to gulp! Perhaps, director Ahmed Khan's intentions are right, to make a hard-hitting film that marries realism and fiction beautifully, but the writing indulges in too many cinematic liberties and that's precisely why Baaghi 3 goes off target.\n\nHowever, lovers of action fares are in for a treat, since the stunts, action and chase sequences in Baaghi 3 are truly captivating. Sure, a few sequences aren't for the faint-hearted, but you can't help but put your hands together for these sequences and the man behind those death-defying stunts. Coupled with top-notch cinematography (Santhana Krishnan Ravichandran) and stylish action (Ram Chella-Laxman Chella, Kecha Khamphakdee) the film begins to grow as reel after reel unspools. But, alas, the film goes for a toss in the second hour. Things actually stagnate as the hero turns into super-hero and combats an army of villains on land, sea and air. Director Ahmed Khan and his team of writers seem to have substituted action for content and that's the most glaring flaw. In fact, you feel that the director and screenplay writers must've decided to go on a vacation in the second hour, entrusting the responsibility on the stunt directors to conclude the second hour.\n\nBaaghi 3 is soaked in high-voltage drama and action, with a consistent undercurrent of tension. As a matter of fact, there's an overdose of action in the film, though, I must admit, a few action pieces are deftly executed. But the absence of a riveting and absorbing screenplay looms large in the post-interval portions. Sure, some sequences do hit you hard, but the writing tilts heavily towards been-there-seen-that kind of situations persistently, promising little or no surprise as the plot unravels. The background score (Julius Packiam) enhances the impact, while the dialogue (Farhad Samji) are power-packed at times, but plain mediocre at places. The film's music is awful but thankfully, there aren't too many songs.\n\nDirector Ahmed Khan tries to camouflage the defect (lacklustre screenplay) with stylish execution, hair-raising stunts, eye-filling visuals, but let's not forget that the moviegoer wants to listen to a captivating story at the end of the day. Everything else is secondary! The film goes on and on and on with unwanted scenes galore (editing: Rameshwar S. Bhagat), the outdated love angle and the lenggggggthy fight sequences. Director Ahmed Khan seems to have taken the audience for granted. He has concentrated more on giving the film a slick look than narrating a gripping story and this fact reverberates at several points in the film. There's no denying that Baaghi 3 bears the stamp of an upmarket product all through, but how one wishes the director and the writers would've ensured that the film has a power-packed screenplay to offer as well.\n\nBaaghi 3 belongs to Tiger Shroff completely. No two opinions on that. Take Tiger out of this film and the movie is a big zero. He's the lifeline of this project and his performance will be loved by the masses. Shraddha Kapoor looks gorgeous and acts very well. Riteish Deshmukh is relegated to the backseat. What did Riteish see in this role? Ankita Lokhande's character lacks meat. Jackie Shroff and Vijay Varma are alright. Jaideep Ahlawat and Jameel Khoury evoke terror that one would associate with their characters. They are fantastic.\n\nTo sum up, Baaghi 3 is regressive cinema with a capital R. The film has some engrossing moments in the first half, that's about it. The post-interval portions are an absolute downer. The plot is formulaic, while the screenplay is riddled with cinematic liberties. Fans of Tiger Shroff might patronize the movie; however, the aam junta might not take a liking to it. At the box-office, the film will embark on a strong start, but it doesn't have the merits to sustain after the initial curiosity subsides. Baaghi 3 fails as a film."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "zeekzetak",
        "review_rating": "1",
        "review_title": "The Theory of Defamation !",
        "review_detailed_main": "Make movie with wonted story scripts in sequels until you flop ! Fate of Heropanti 2 is due !"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "justinsir",
        "review_rating": "1",
        "review_title": "Kalank of 2020",
        "review_detailed_main": "A proper waste of 2 hour 23 minutes. This movie is UNBEARABLE"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abdullahaabbas-67064",
        "review_rating": "1",
        "review_title": "Defies logic, common sense, & physics",
        "review_detailed_main": "This movie defied everything, logic, science, & common sense. Why India keeps needing to portray Muslims as terrorists, I don't know. One man fighting 50 guys at a time, taking bullets with a shield from one direction only. I just hope this is the end of these baaghi movies."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "apatil4",
        "review_rating": "1",
        "review_title": "Ugh",
        "review_detailed_main": "Why is this chilkha still getting movies. Pack up and go home and get a degree"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mksudip",
        "review_rating": "",
        "review_title": "Terrifying",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shcoleman",
        "review_rating": "10",
        "review_title": "Action packed",
        "review_detailed_main": "Not sure why the rating is what it is right now. Now sure what people were expecting. But if you want some Tiger action packed explosion scenes, then you'll love this movie. Loved it!! Crazy production value this go around!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "NitinSisode",
        "review_rating": "7",
        "review_title": "Baaghi 3 Movie Review by Nitin Sisode - Action packed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vikas-ray1",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": "My subject of this review well define this movie. Tattiiiiiii"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "f_u_r_y_a_n",
        "review_rating": "1",
        "review_title": "Ohh Bhai Maro Mujhe Maaro😞😂",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sumanmahato-85667",
        "review_rating": "2",
        "review_title": "Bakwas",
        "review_detailed_main": "Not good story. Only action. Money wasted movie. And only one time watched movie with boring"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "khokhardarshaan",
        "review_rating": "1",
        "review_title": "Worst movie of this year....disaster",
        "review_detailed_main": "No story...no screenplay...no humor....no emotion....no acting...only action"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dhole-shubham",
        "review_rating": "1",
        "review_title": "Low budget CGI . No Good VFX and 0% Story .",
        "review_detailed_main": "Very Bad Direction . Movie Seemed Streched. Shradha Is Cute In Movie . Tiger Is Bad , Ritesh Is Ok .but Logic Is Worst. India Should Stop Making Movies Like This. Go Watch \"Kaamayaab\" . Skip this save your money and eat something good"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "krupalkardune",
        "review_rating": "1",
        "review_title": "no sense",
        "review_detailed_main": "Such kind of people responsible for bollywood quality downfall"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "yashusingh-30389",
        "review_rating": "1",
        "review_title": "Gandu Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "raipuria",
        "review_rating": "2",
        "review_title": "Worse direction & cinematograph..",
        "review_detailed_main": "Vijay verma and Jaydeep ahlawat acted well. Stunts are outstanding. But, just because of poor direction & cinematography ruined this film. Bollywood should cancel Ahmed Khan's license. The last 20 minutes editor loose the track. If direction and cinematography were better, this film could be one of the best action movie. Tiger shouldn't make any further film with Ahmed khan."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "anirbaanlnt",
        "review_rating": "",
        "review_title": "Worst worst worst movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pj-87532",
        "review_rating": "10",
        "review_title": "Great action",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "suneelsharad",
        "review_rating": "7",
        "review_title": "Full entertainment, action thriller.",
        "review_detailed_main": "I m surprised by low rating of this movie.Other than a few exaggerated action scenes, this movie is just awasome.Full of comedy, action and drama.Hats off to Ritesh, Tiger and Shradha.Must watch.I loved it."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rjvip-13493",
        "review_rating": "1",
        "review_title": "Don't watch!",
        "review_detailed_main": "15 minutes into the movie and I stopped watching it! Nothing new to offer! Songs are same, acting is same, story is same! Baaghi 1 was amazing, Baaghi 2 was average and Baaghi 3 is disastrous! After I watched the trailer of Baaghi 3, I had low expectations but decided to still watch it, which was a huge mistake! This movie is more deadly than Coronavirus!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "paularpan-95279",
        "review_rating": "1",
        "review_title": "Only 1 word '' DISASTER MOVIE''",
        "review_detailed_main": "One of the worst illogical movies where all the action scenes are copied from wonder women, and worst direction ever!!!!! Director's license should get cancelled!!!!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "chipsarecrispy",
        "review_rating": "1",
        "review_title": "Was waiting to avenge this since 2yrs",
        "review_detailed_main": "Couldn't bear Baaghi 2 n wanted my refund for watching d crap. I wonder how director Ahmed Khan views this movie..probably like some masterpiece. But it was a torture. Everything running n jumping but the script never had any life. Wonder if actually watch these type of movies or some paid news shows d collection crossing 100 crores easily"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "KuldipJasani",
        "review_rating": "1",
        "review_title": "Worst movie ever watched",
        "review_detailed_main": "Fight seen and action seen worst ever and nothing like sence in movie and story."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "KuldipJasani",
        "review_rating": "1",
        "review_title": "Worst movie ever.",
        "review_detailed_main": "I writing this review in time of watching I think worst movie ever as watched."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dihankiriwaththuduwa",
        "review_rating": "1",
        "review_title": "The BEST FAIRY TALE!",
        "review_detailed_main": "I don't have to say anything. I think Disney should learn from them how to make a better fairy tale. . . . Good job guys! You're doing well!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "chayandutta-12499",
        "review_rating": "1",
        "review_title": "Ye to tatti hai",
        "review_detailed_main": "Giving 1 star 🌟 bcz no option for 0 star. Ekdam ghatiya\n\n\n\n\n\n\n\nTatti"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sumit-72567",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "If you love yourself a bit, keep away from it. It is deadlier than Corona. Hamshakal and Himmatwala are masterpiece to the comparison of this. Save money, time and most importantly Brain."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sagarasupul",
        "review_rating": "",
        "review_title": "No,No,No",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "tomarprashant-07399",
        "review_rating": "10",
        "review_title": "Best of 2k20",
        "review_detailed_main": "Mst h bhai log...... must watch with family..huge fan of tiger shroff"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jfh_dragonfly",
        "review_rating": "6",
        "review_title": "WHY THE HATE?",
        "review_detailed_main": "This was no more unrealistic than any other \"action\" flick. It's become a meme that no Imperial Storm Trooper ever hot anyone, for example. The direction and photography were up to par, and the story is very sweet. It's an action/comedy for heaven's sake!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sachindhimanthis",
        "review_rating": "1",
        "review_title": "Wasted",
        "review_detailed_main": "Can we just move on from these kind of movies, we have already seen enough of ek tha tiger ,phantom and baaghi series,\n\nIt's high time .\n\nPlease humble request"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "gymaholicabhi",
        "review_rating": "1",
        "review_title": "I will pay you more for not making this type of movies... Pathetic",
        "review_detailed_main": "Not worth wasting 5% battery of your smartphone let alone buy a ticket..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kit-segal",
        "review_rating": "1",
        "review_title": "Hilarious if you're stoned",
        "review_detailed_main": "Do not watch this movie sober. You'll kill yourself. And to avoid killing someone else please watch it alone 🤣"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hrithiknikalje",
        "review_rating": "1",
        "review_title": "Worst in the baaghi series",
        "review_detailed_main": "This is the worst movie in the baaghi franchise. Worst acting ever of tiger, shraddha kapoor character is also very over the top. Worst songs worst actions. Action in first two films are very good But in this one I was very dissapointed with it I actually like the action scenes in baaghi and in baaghi 2 last action scene was over the top but I liked it watching now they should stop this series it's a request 🙏"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "IPyaarCinema",
        "review_rating": "1",
        "review_title": "Bhaagi 3",
        "review_detailed_main": "Review By Kamal K\n\nFar distanced from reality, the delusional world of Baaghi 3 travels from Agra to Syria, with a rather frail story. An overly protective younger brother, Ronnie (Tiger Shroff) constantly rescues Vikram (Riteish Deshmukh), who, despite lacking essential qualities like bravado, and much to the surprise of the other characters, becomes a police official. That he becomes one after the demise of their cop-father Jackie Shroff hopes to add some credibility to this turn of events.\n\nVikram is sent on a mission to Syria to catch hold of a dreadful terrorist, Abu Jalal. But this plot too falls flat on its face after Ronnie must travel to Syria to save his brother from unforeseen circumstances. What happens in Syria is an entirely different story, one that's devoid of logic. But we had expected that, anyway!\n\nWhile the plot isn't intriguing, Shroff's high-octane action sequences may hold your attention. There's no doubt that like he does in every other film, he has pulled off the stunts with as much sincerity as he has finesse. A helicopter sequence deserving a special mention for its visual appeal.\n\nIf the wafer-thin plot is a disappointment, the cast doesn't particularly shine during emotional scenes either. Many, in fact, reduce viewers to laughs.\n\nShraddha Kapoor is merely there to add comic relief, but the script fails to even validate her presence. Ankita Lokhande too has little to play with, here. A special highlight, though, is the single scene that sees father-son - both on and off screen - Jackie and Tiger, feature in one frame.\n\nAhmed Khan has employed formulaic trinkets - good songs, and larger-than-life action - to make this 150-minute film a commercial entertainer."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rashesh-kumar",
        "review_rating": "1",
        "review_title": "Mind Blasting Movie. Amazing Acting. Superb Direction. NOT.",
        "review_detailed_main": "It's difficult to make a film. It's very difficult to make a good film. It's impossible to make a movie that can stand anywhere near this film. I am thankful for the law makers who don't allow you to keep a gun with you. Else, my parents would have lost their son tonight. Whenever Tiger Shroff and Shraddha Kapoor shared frame, it was magical. It was like watching Meryl Streep and Daniel Day-Lewis share screen. The action - Tiger killed atleast a 1000 guys and injured some 30-40000 others. You would lose the count after a while. The dialogues, specially the comedy sequences - all I can say is the writers must be proud of their work. The direction - the likes of Nolan, Tarantino and Scorsese should hide in shame or learn from Ahmed Khan. Only in a 1000 years comes a movie experience like this. I am simply sad that I wouldn't live long enough to experience a piece of art like this again. Unless, ofcourse if Bella does me a favour and bites me. To sum up, Baaghi 3 has set a new standard for cinema. One that would remain untouched for generations to come."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "srikant-97486",
        "review_rating": "2",
        "review_title": "Baaghi series is becoming as the remake movies series, most importantly remaking good South Indian Movies into a bad Bollywood movie.",
        "review_detailed_main": "Baaghi 2 was a remake of a simple and good south indian movie. Ruined the movie by adding some unwanted elements in the original story. Baaghi 3 the same thing happened. It's just a story of a hero fighting with a local gangster for his brother but they made it as hero fighting against the international terrorist group on the remake just to show the heroism of the hero. And totally illogical fights. Helicopter' s doors has a window made of glass which can be easily broken by multiple bullets from a machine gun from a close range even though if it's bullet proof. The door can cover till the hero's knee but nobody shoots below the knee? Last but not least.. After villain captured heroine and hero's brother, why they don't use the guns and finishes the hero and family? After all they are terrorists... Please grow up Mr. Director."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "omkarsalvi-98509",
        "review_rating": "1",
        "review_title": "APALLING UNREALISTIC AND STUPID",
        "review_detailed_main": "The director of this movie recently said that \"I dont understand the concept for the movie Thappad\" And he wants the indian audience to accept and comprehend the concept for his stupid movies like Baaghi 2 and Baaghi 3. The action scenes are way too unrealistic and the movie is quite predictable. All Tiger Shroff can do is show off his muscular body because that's what he's meant to do in a movie. It's sad to see that actresses like shraddha Kapoor settle for such mediocre and irrelevant roles."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rdas-05733",
        "review_rating": "",
        "review_title": "Simply sit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pushpendrameena-89339",
        "review_rating": "10",
        "review_title": "Action packed",
        "review_detailed_main": "Gud movie 👌👌 Tiger steal the show alone Watch it for 🐅 tiger"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "akshatb-63035",
        "review_rating": "6",
        "review_title": "#best action",
        "review_detailed_main": "Movie has great action andhave potential to cross over 250crores. This is a must watch movie because it is first time in Bollywood a movie with unbelievable action scenes"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ndyearee",
        "review_rating": "1",
        "review_title": "LogicLess bollywood movie as always",
        "review_detailed_main": "This movie is full of some baseless logic first of all in Syria there's hardly people get 2G net connection and in that region these people are using 5G net with Ultra HD Video calling."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jayantkumar-26330",
        "review_rating": "1",
        "review_title": "nonsense action make yr mind unstable",
        "review_detailed_main": "Pathatic story line with non humorous joks in first half..and 2nd half tiger fight against whole country with sirdard action..it is for those who blind fan of tiger awfull acting ...if y are fan of good acting and storline ...then make faar far far distance from baagi 3...."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "joinrajesh",
        "review_rating": "1",
        "review_title": "No Story! No Logic! Totally Bakwaas!!",
        "review_detailed_main": "Wastage of Time & Money!! Don't understand why Bollywood make such movies like this."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "tarekabualela",
        "review_rating": "1",
        "review_title": "why people are flying from a single hit",
        "review_detailed_main": "India should stop these illogical action scenes - If you are sarcastic ,you will find \"action\" in this movie funny If you are a series man , you will say how this is possible and give this movie lowest rate Tiger really the capability of doing real action and drama without exaggerating"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jainloud",
        "review_rating": "1",
        "review_title": "Dont waste your time!",
        "review_detailed_main": "Its the most pathetic movie ive seen this year! It makes no sense. And is ridiculously unbelievable. Killed the baaghi franchisee."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rkunwar-63025",
        "review_rating": "1",
        "review_title": "LET ME BREATHE AND OPEN MY EYES FOR A SEC !!",
        "review_detailed_main": "From the title i've kept its clear, i think how my experience was with this so called \" blockbuster \" Like lord, I knew from the trailer itself its nothing just waste if time, but why did I change my mind and think it could be anything near impressive? Like, why???????"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "libu-44972",
        "review_rating": "1",
        "review_title": "REMAKE OF TAMIL FILM VETTAI",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "faisal-hussain-570-991074",
        "review_rating": "1",
        "review_title": "absolute pants",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abishekabishek-49370",
        "review_rating": "",
        "review_title": "What??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dranirbanmds",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sahildubey-30069",
        "review_rating": "7",
        "review_title": "Tiger's Baaghi 3 can't stick the landing",
        "review_detailed_main": "Tiger's acting 10/10 everything else pretty dull and boring. The songs are ok, the action is good,but sometimes illogical. The direction is ok,but it could be better. The story is to simple and not interesting. Overall, it's fun to watch and is entertaining,but the writing and direction just dosen;'t work. 7/10"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "justinsir",
        "review_rating": "1",
        "review_title": "What the heck ?",
        "review_detailed_main": "I would have actually rated 0. Just a senseless movie. There is no plot . A proper waste of 2 hour 23 minutes. This movie is UNBEARABLE. Worst storyline, Worst acting, Worst Direction. Kalank of 2020 . Baaghi 3 is the worst movie I have ever watched."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "digantadev",
        "review_rating": "1",
        "review_title": "Poor direction and screen play",
        "review_detailed_main": "I felt like committing suicide while watching the movie. Disgusting movie. Even the plays enacted by nursery kids will be better than this. Nothing is good about this movie. Ahmed Khan as a director has completely failed in this movie, he completely failed to use such a good star cast. Such a poor direction and screen play."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "beastonride",
        "review_rating": "1",
        "review_title": "Please don't encourage such movies by watching them.",
        "review_detailed_main": "It's one the worst movie of this year. Poor story and plot. I don't know why they make such movies. Instead of watching this movie take Netflix subscription."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "William_Singh",
        "review_rating": "1",
        "review_title": "All of Baaghi movies won't do, even the 3rd one.",
        "review_detailed_main": "Just like the Cats 2019 film, this one is also the worst one as well or now even worst then the 2019 Cats film.\n\nThink twice before watching this film. My custom rating: negative 10/10.\n\nEDIT on 23rd April: Actually this franchise of Baaghi should be the blacked out from any cinemas, DVDs, online streaming apps etc.\n\nHow come the trailer of Baaghi 3 has over 2 million likes and over 50 million views and later on the movie came tumbling down."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Jagneill069",
        "review_rating": "1",
        "review_title": "Worst movie !!!!!",
        "review_detailed_main": "I don't understand why people cast tiger shroff and that ugly disha Patni and that shardhaa Kapoor who can't act What is the purpose of taking these actors and ruining the money If you have too much money and don't know what to do ! Please donate that money to a good cause ! Instead of making such a rubbish movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "BornAndBred",
        "review_rating": "1",
        "review_title": "Who even watches films like this anymore?",
        "review_detailed_main": "Thank God I didn't waste any money watching this at the cinema. Got to the hour mark and couldn't watch anymore. After seeing Tiger Shroff's horrendous entry, I thought maybe it could be one of those \"so-bad-it's-good\" movies. It's not. It's just bad. Very bad."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "itzakkunwarak",
        "review_rating": "1",
        "review_title": "Donate your brain before watching this movie",
        "review_detailed_main": "Senseless, mindless, crap words are not just enought to describe this epic movie .. Donate your mind before planning to watch this movie 🙏"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shaileshllb",
        "review_rating": "1",
        "review_title": "Ahmed Khan Deserves a Tight Slap",
        "review_detailed_main": "If there was ever a competition of who can make the worst movie by utilising maximum budget, This one will certainly qualify? I am so disgusted after watching this movie that i don't think it deserves even a one star. People talk about Tiger Shroff being the bad actor, people need to watch this to realise that they are more actors who can do worse than Tiger... Shraddha amd Riteish are 2 most notable disasters...Ahmed khan is so pathetic with his filmmaking that people like him should be banned from films altogether.... I have one question to the makers, Can you yourself watch this torture yourselves? I like and see tiger as a good human but he should start choosing better scripts or his physique won't take him too far....AAA THOOOOOO on the face to all the stakeholders of this movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "anirudhagupta01",
        "review_rating": "",
        "review_title": "Nepotism is killing bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "muhammadsuel",
        "review_rating": "9",
        "review_title": "Tiger Shroff on fire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hackerscommunities",
        "review_rating": "7",
        "review_title": "Mja Nhi Aaya",
        "review_detailed_main": "Iss Se Accha Ullu Ka Subscription le leta. Bkwaas Movie Hai Bilkul Hai."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hXz0r3",
        "review_rating": "1",
        "review_title": "Seriously ? This is BollyWood Standard ?",
        "review_detailed_main": "I think all the action heros should stop making movies after watching this junk piece, its super-fiction, way beyond fictions of a human being. All action heros need to learn, not to make this ASS mistakes.. Tiger Shroff off the list of being a good actor now !!\n\nHow could he vouch, just for making black losses baking into white monetary gains ?"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mymailbhanu-37887",
        "review_rating": "2",
        "review_title": "Remake of telugu movie \"Tadakha\"",
        "review_detailed_main": "There is nothing special in the story line except for the fights in the movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nadiahowie",
        "review_rating": "1",
        "review_title": "I cant",
        "review_detailed_main": "I have no words. Utterly terrible. Disturbing. Rubbish. Absolute hate."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "krishna-20426",
        "review_rating": "1",
        "review_title": "Worst movie ever I watch",
        "review_detailed_main": "Totally tatty movie. Tiger should retired from Bollywood n also ritesh. Totally waste of time.plz Bollywood stop nepotism."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "babubaiju",
        "review_rating": "1",
        "review_title": "0 level movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nimeshdx",
        "review_rating": "1",
        "review_title": "Shoud band this type movies",
        "review_detailed_main": "Tiger must stop is acting. He cant act but he can do jimnstic. Hindi worest film i ever seen all acting sound all very poor."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nelsonferns",
        "review_rating": "1",
        "review_title": "Have mercy on our souls",
        "review_detailed_main": "Can't believe in 2020 bollywood makes such garbage movies"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "amrutpate-04348",
        "review_rating": "1",
        "review_title": "C grade director",
        "review_detailed_main": "Cast could not act No story nothing comic Body banane se acting nahi aati\n\nBeyonce ke video copy kiye fir bhi expression less item girl could not generate fire.\n\nTiger can't act."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "purimechanical",
        "review_rating": "",
        "review_title": "Sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hardiksenjalia",
        "review_rating": "9",
        "review_title": "entertainer!",
        "review_detailed_main": "Bollywood is raising bars! loved the movie and amazed by the fact 85% of action sequences are live action!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "akramin",
        "review_rating": "6",
        "review_title": "Only first half is good second half is total mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "srishifrah",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "Ahmed Khan should spare audience with his pathetic direction. First time got irritated with Shraddha's performance. Simply a rubbish movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ameyjedhe",
        "review_rating": "1",
        "review_title": "Pathetic in all aspects..",
        "review_detailed_main": "Well this movie is totally worthless to watch. You can only witness the action throughout movie (often unnecessarily),songs are very poor. The storyline is very pathetic and again overwhelming action sequences which makes no sense at all.\n\nIf u have not watched it, please don't make an attempt to watch."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Rajgupta25",
        "review_rating": "1",
        "review_title": "This movie didn't deserve even 0/10",
        "review_detailed_main": "I dont want to say anything about this movie Every bad word you can add to this movie but irony of our indian audience is that this movie earn 100 crores . This hurt me a lot"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sammangla",
        "review_rating": "1",
        "review_title": "Suicide Mission",
        "review_detailed_main": "If your brain's in right place, you'll feel like killing yourself while watching this movie. It's a pathetic, disgusting and shameless attempt by Ahmed Khan. That's what happens when a choreographer directs a movie. Also, TIGER SHROFF CAN'T ACT."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "deepmukherjee-45341",
        "review_rating": "1",
        "review_title": "Dhinchak pooja is better than Tiger shroff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "satnamkhaira345",
        "review_rating": "1",
        "review_title": "W T F",
        "review_detailed_main": "Dumbest movie ever, worst movie I have seen in 23 years of being on this earth, was a fan of bollywood not anymore..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "puneeeetjain",
        "review_rating": "1",
        "review_title": "Why -1 Star option is not available?",
        "review_detailed_main": "One of the worst movie I have ever seen.\n\nAction: -1/10 I read somewhere about the good action scenes but sorry. They are not. You cannot term jumping, throwing legs and arms here and there, anywhere and everywhere as action. That too in slow motion. All of them.\n\nDialogue: 0/10 There is not enough talking in this film. And wherever it is, is disgusting.\n\nMusic/Soundtrack: -1/10 Just loud noise.\n\nDance: 0/10 No words for it.\n\nStory: 0/10 Could have been good but is not.\n\nActing: -1/10 Nops. You cant find it in this film.\n\nOverall: -1/10 Sorry guys. Wasted my precious hours watching it on hotstar today. And once started, I had the urge to find out how much worse it can be and believe me, just skip it."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "harshvardhans-78730",
        "review_rating": "1",
        "review_title": "Worst film of all time,copy paste film",
        "review_detailed_main": "Worst of all movies illogical fighting scenes and the worst story ever no sense of making the movie or watching it at all Shraddha Kapoor was great and hot as always"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rikapatel",
        "review_rating": "8",
        "review_title": "When it comes to family, there is no boundary!",
        "review_detailed_main": "When it comes to family there is no boundary! action at it's best, best thing it is fast paced! must watch."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abhishekabrahamabhishek",
        "review_rating": "7",
        "review_title": "Brainless Action Flick",
        "review_detailed_main": "Worth a Watch. Good shots. Fast paced screenplay and cinematography also good. Movie could have been Directed and written well."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "samj-59967",
        "review_rating": "1",
        "review_title": "Non Sense",
        "review_detailed_main": "Never In My Life I thought I would watch Something as Bad Horrible Writing Nonsensical Action I didn't even expect it To make Any Sense Though But at least a decent enough plot would have sufficed but this is an examplnary film about how not to make a film"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sripadhamuralidar",
        "review_rating": "1",
        "review_title": "Unable to select 0 rating",
        "review_detailed_main": "My 6 yrs old son asked me to put this movie. This movie caused headache , vomiting and almost influenced me to commit suicide."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "tdevout",
        "review_rating": "1",
        "review_title": "Jhantu movie",
        "review_detailed_main": "Jhantu movie, shouldn't watch this at all. I strongly ain't recommending this."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jwalastha",
        "review_rating": "1",
        "review_title": "Pain in eye.",
        "review_detailed_main": "The worst baaghi. Ahmed khan please do only choreography."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "karparth",
        "review_rating": "1",
        "review_title": "And they are planning a remake of RAMBO .. LOL!!!!",
        "review_detailed_main": "It's sad that still Bollywood is making such crappy movies. Where has Hollywood reached and where is Bollywood still !! I think our mom dad enjoyed the best version of Bollywood during 80's. These days Bollywood movies doesn't have good contents , shamelessly re-making or re-editing old songs, pathetic stunts .. the only thing Bollywood is now about is --- Glamour !!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "viveksinghchaudhary",
        "review_rating": "1",
        "review_title": "B.A.D",
        "review_detailed_main": "Not even worth watching..... seriously guys, at least make movies that involve logic dont just for for the Mindless action.."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "danish-rocks",
        "review_rating": "1",
        "review_title": "Disgusting, tragic mess..",
        "review_detailed_main": "It wasn't the actors that made this movie an absolute eyesore. It was the director, the direction, absolutely NO PLOT and the movie is BEYOND unrealistic. It gets to a point where it seems like the filmmakers think we're stupid or dumb to buy the bull crap they are selling. I hated every minute of it, the action is extremely over the top garbage. Please don't waste your money.. don't blame the actor, blame the horrible director."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Adityaprakash7",
        "review_rating": "1",
        "review_title": "Don't watch this pice of $hit",
        "review_detailed_main": "Don't watch this pice of $hit Don't watch this pice of $hit Don't watch this pice of $hit Don't watch this pice of $hit"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "srinivasranjan",
        "review_rating": "10",
        "review_title": "Action and thrill",
        "review_detailed_main": "This movie is good for thrill lover. Movie is Full of action, few scenes u will feel over action but movie runs on entertainment #onetimewatch #mustwatch"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "umangmanu",
        "review_rating": "1",
        "review_title": "KILLER MOVIE",
        "review_detailed_main": "If someone gives me two options, to get a bullet in the chest or the was any Baaghi movie. I would probably choose to get a bullet in the chest, because the movie is soo soo trash that i could explain it"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "chavanprathamesh-22904",
        "review_rating": "1",
        "review_title": "Total crap!!!!!!",
        "review_detailed_main": "There's literally nothing in this movie other than boring lame action scenes"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ayush-20790",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Insane_Man",
        "review_rating": "1",
        "review_title": "Garbage at it's best",
        "review_detailed_main": "I am confused, which is better, this one or hamshakals, or joker, or himmatwala? Full of nonsense. Director at its worst, that is Ahmed Khan. Tiger only knows stunts, no acting. He has only body, no acting. He knows only dancing, no acting. Ritesh is great even in this bad movie. Don't waste your time."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "miyushsharma",
        "review_rating": "1",
        "review_title": "Worst film",
        "review_detailed_main": "Worst film I have ever seen after race 3,how can the bollywood make such crap"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "lingamanenijaswanth",
        "review_rating": "2",
        "review_title": "Science of Stupid",
        "review_detailed_main": "Physics committed suicide after watching this. Even Tom and Jerry has way better logic than this 🤣. He's not a one man army, he's a one man planet. He destroys fighter copters, tankers all alone. In between he swivels hanging from a chain which he draws it from a open sky. He's not a man, he's baap of Superman. Still thinking 🤔 how big his brother shouts. When his brother shouts 'Roonie' for first time in movie in the theatre, he still hears it sitting inside a closed cinema hall. This is perfect meaning of senseless movie. Nevermind, bollywood have loads of such scenes.\n\nI wanted to give it 1 ⭐ but gave 2 because those 1 man illogical, anti-physics fight scenes made my day 😄"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shubhamkat-ever",
        "review_rating": "1",
        "review_title": "a knife to your brain",
        "review_detailed_main": "So much money given to some junkies. what can you expect.. utter mind numbing and surprisingly annoying at parts, this is the worst action movie to ever exist."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "yashpalsurya",
        "review_rating": "1",
        "review_title": "Only tiger",
        "review_detailed_main": "This movie made to show how tiger pull audience in theatre"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Dhruba-Jyoti-Deka",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "When you watch action movie, do not expect classic style here.\n\nAll low reviewers are fake."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "aashisha-99036",
        "review_rating": "1",
        "review_title": "Unbearable",
        "review_detailed_main": "Baaghi franchise must be stopped,this is gonna be worst movie of 2020...no logic,bad direction,sasta CGI, acting n Tiger Shroff (what's that)....many scenes are copied from other movies..that shouting part of Ritesh Deshmukh ohh god stop that...these things were good in 90's."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "beevenkat",
        "review_rating": "2",
        "review_title": "another bad masala movie",
        "review_detailed_main": "#Baaghi3 is another bad masala movie starring tiger shroff - its the story of two brothers who r inseparable - elder bro is a weakling but he becomes a cop - dont ask how - younger bro is a tapori who loves to dance n fight - elder bro is packed off to syria for some routine paperwork where he almost gets killed - so younger bro goes there to rescue him - theres no story, no rationale but theres plenty of action - music is bad - running time needs to be reduced by 40 minutes - rating 1/5."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "redfieldkiller",
        "review_rating": "1",
        "review_title": "Funny",
        "review_detailed_main": "Very funny movie.A must watch for memers."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mrsurajbhojwani",
        "review_rating": "1",
        "review_title": "Illogical",
        "review_detailed_main": "Lacks story and potential content. Just a muscular guy running shirtless and killing people with over the top action. Please dont waste money on this and stop watching such movies so that it gives a message to the makers"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Zenpaki",
        "review_rating": "1",
        "review_title": "Not This",
        "review_detailed_main": "Can they do worse than this? i don't understand why writer is writing this kind of script, first he wrote housefull 4 and now this."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dialvishal1",
        "review_rating": "1",
        "review_title": "First ever review on imdb",
        "review_detailed_main": "Super Low grade copy of too many movies, at least copy in some good sense."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "safayetas-03130",
        "review_rating": "1",
        "review_title": "Garbage movie",
        "review_detailed_main": "Total Garbage. What is this? This is look like 3d class movie. Garbage movie at Baaghi series."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "patelkundan-86883",
        "review_rating": "1",
        "review_title": "Overacting and too much show off.",
        "review_detailed_main": "Please don't watch this movie. Too much action and stunts no story or plot. Just, tiger shroff's stunts."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hashmisarim",
        "review_rating": "10",
        "review_title": "BEST",
        "review_detailed_main": "Tiger shroff did amazing job, full action pack movie, good story action direction in short a must watch movie baaghi franchise never dissapoints"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nittizsumeet",
        "review_rating": "1",
        "review_title": "What a way to begin a new decade",
        "review_detailed_main": "Soley banking on tiger's body will not save the movie. Now the saving grace of the makers when they will try to release this movie in China"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "warderp",
        "review_rating": "1",
        "review_title": "Cursed film",
        "review_detailed_main": "One of the worst film you will ever see. No logic no research stereotypical. No creativity and they spoiled Dus bahane"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nairtejas",
        "review_rating": "4",
        "review_title": "One-Line Review: Baaghi 3 / Energetic Action in the Usual Illogical Setting / 4 Stars",
        "review_detailed_main": "For what it's worth, Baaghi 3 (Rebel) does give some form of entertainment with its ultra-high-octane action that is based on an illogical and borderline slapstick story line and setting that is perhaps the hallmark of the trilogy if you manage to ignore the obvious issues that were apparent even before you began to consider watching it. TN."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rehmankhilji",
        "review_rating": "1",
        "review_title": "Worst Cinema",
        "review_detailed_main": "Too much of anything is never good and this movie is having all the recipes of being boring, predictable, overdone, meaningless and pathetic. Tiger Shroff, being the new action kid on the block has clearly missed out on reading the script. Question one should have been, if i am having John Wick powers whats the past behind it. And the answers is nothing and he be a super hero just like that. I even fail to wonder that if a chopper bombs from behind and you fall / fly ahead due to the impact, how the bloody hell you end up on the helicopter? A very big mystery. Watch the movie to see such and many more blunders. Wait, dont watch the movie and save yourself from such useless piece of cinema. So the director Ahmed Khan should really stick to choreography as movie direction is not his cup of tea by all means. In the end he made a remix of a song and even destroyed it every possible way. Shraddha Kapoor, a question, two guys were running, tanks behind, two guys disappear in next scene, you all of sudden hug the hero, who no one knows where he came from and then he pushed you away from the circle of tanks. Was the hug the necessary? And do you really have to wear the pathetic clothes in the end song? where was your common sense."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shoaibmirza-00818",
        "review_rating": "1",
        "review_title": "👎👎👎👎",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "imranib-18009",
        "review_rating": "1",
        "review_title": "Stupidity at its level best",
        "review_detailed_main": "I m speechless after watching this movie.sajid sir I request you please don't think about making baaghi 4."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "yashcyclist",
        "review_rating": "1",
        "review_title": "worst movie of the year",
        "review_detailed_main": "Fully waste of money and time. 100% stupid movie. I have never seen such a dull movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ridhimakhanna_sancheti",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Starts with good note but goes down after a while...illogical second half..no story..illogical stunts fighting on 3 choppers clueless how?? Emotional family scenes tried to create but dint felt emotions.."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nisshan-52861",
        "review_rating": "10",
        "review_title": "The Best",
        "review_detailed_main": "The Best Of the Baaghi Trilogy. Tiger Shroff's action is just another level. Full of masses."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "lediscipledessocrates",
        "review_rating": "1",
        "review_title": "Bizarrely Dumb",
        "review_detailed_main": "I truly have underestimated the acumen of the producers of this franchise. While reviewing Baaghi-2, I could not have imagined that that was only the tip of the iceberg, speaking proverbially.\n\nThere is no point in saying anything about how ridiculous the story is or how bad the acting. It would be a very tedious exercise.\n\nHowever, I would conclude this short \"review\" by saying that if indeed the \"bad\" guys of the world were as incompetent and stupid as they are in this movie, the world would be a safer place. Provided the \"good\" guys are not as idiotic as they are in the film."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "avengerkumar",
        "review_rating": "1",
        "review_title": "Super flop movie...",
        "review_detailed_main": "Hopeless movie..super utter flop movie...no story no acting only gravity less action...everybody is flying... nonsense movie...RIP MARVEL AND DC SUPERHEROES...BHAAD MEH GAYE SUPERHEROES...RONNIE THE SUPER BAAHGI MAN...tatti movie...ful tatti movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sahil_shah-53365",
        "review_rating": "1",
        "review_title": "Mahaghatiya",
        "review_detailed_main": "Torture, every scene is full of stupidity and torture."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "singhx-18020",
        "review_rating": "1",
        "review_title": "Absolute preposterous",
        "review_detailed_main": "Absolute ridicoulous experience ever. I highly regret watching this junk but had no choice as I was forced to with my friends. This type of content is a joke in this day and age where movies are supposed to delivering new content not same old cliches and remake songs. Acting in this movie is intolerent and can give you a severe headache. Seriously, stay away from this garbage or watch at your own risk!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "garvjoshi-54714",
        "review_rating": "1",
        "review_title": "Another piece of crap",
        "review_detailed_main": "I am amazed at the quality of Bollywood movies. It looks like that entire Bollywood Should file for creativity bankruptcy as they can't think anything except for picking up some random movie and copying it blatantly. Look at how they have even stopped creating new songs now, and are only focused on releasing these craps immediately. Shroff lad need to really look at his acting skills, his scripts- he looks like a clown now who is always doing same things again and again. Even his jumping look old and stale. And why is he always shirtless?? We all know kid has abs, but who cares to watch his abs all the time. But then why would bwood people care about making good movies when we have stupid audience who will go and watch this piece of crap regardless. To be honest Bollywood has no sense of making sequels and are busy in serving these below average movies week after week. Please guys stop watching these senseless movies."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rathodjay240101",
        "review_rating": "1",
        "review_title": "Not worthy enough for 1 Star",
        "review_detailed_main": "For first half was quite funny and comedy scenes from Ritesh Deshmukh so first half having 3 out of 10 star for 2 or 3 funny scenes.\n\nFor second half :- Completely disgusting . 0 out of 10 star.\n\nI got that baaghi 3 would not have any story line from its trailer but I thought that it may have good fight scenes. But I am totally disappointed from its action sequences. Total worthless fight scenes with out 0 percentage logic such as helicopter scenes and tank scenes such a crap. Direction - 0/10 Tiger - 3/10 Ritesh - 4/10 Shraddha - 2/10\n\nDon't waste your time even on TV"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rsaikamesh",
        "review_rating": "1",
        "review_title": "The Worst",
        "review_detailed_main": "This movie is the worst movie in 2020 so far. Screen play : Worst Emotions portrayal : worst Direction : Worst (can't even handle a remake story) Muisc : Worst Acting : worst Logic : Well I have no words to describe it.\n\nJust don't watch the the movie and save yourself from a day of headache"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "divikshrivastava",
        "review_rating": "2",
        "review_title": "Don't waste money on this bakwaas",
        "review_detailed_main": "Poor remake filled with mindless Hollywood copied action sequences, definitely a waste of time and money"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kknkn-20823",
        "review_rating": "10",
        "review_title": "Awesome action film",
        "review_detailed_main": "Bollywood always neglect action films they always best than other industry in India..by this they proved again...tiger always gives best actions.. shrada looks stunning as always.. unbelievable story ..gud cast must watch film.. definitely best action film"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rahulnathanp45",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Trash, garbage what ever u say it.its like crap after spending 150 rs and have to watch crap like this"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "harinjani",
        "review_rating": "1",
        "review_title": "At Viewers' Risk",
        "review_detailed_main": "This movie is one which can truly compete with Housefull 4. If you do not expect anything of consequence to gain from watching a movie, I would still warn you under considering \"Baaghi 3\". Though I strongly urge Salman Khan Fans to go and watch the film. Bollywood has finally found a potential candidate to continue his legacy.\n\nThe movie has crossed all realms of illogical creation possible. It has no arms or legs and I found myself laughing, not our of humour but out of horror throughout the movie; whether such an exaggerated representation was even possible. It clearly shows the lack of effort made in writing, directing and acting.\n\nThe music and acting is especially substandard. The character of Ankita Lokhande was probably the single believable character throughout the film. I do not understand whether the leader of one of the most powerful organisation does not have a single marksman or is so powerless that he has to hide in the garbage dump. A complete farrago of cringy jokes, histrionic dialogues, overacting and illogical storyline."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "firoz-borle02",
        "review_rating": "1",
        "review_title": "Zero digusting",
        "review_detailed_main": "IMDb please provide the option of zero or negative rating .this is such an imbecile script .absoutley shameful that such movies are made"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shantanu-14774",
        "review_rating": "1",
        "review_title": "Grass",
        "review_detailed_main": "It's a complete grass. Thankfully by friend sponsored my ticket and now he is cursing his judgement :)"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "siddiqzubair",
        "review_rating": "1",
        "review_title": "Failed attempt to.copy hollywood",
        "review_detailed_main": "DONT WATCH...Save your precious time. Film has no sense. Useless action and script"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "tarangpt",
        "review_rating": "1",
        "review_title": "Stay away from this trash",
        "review_detailed_main": "I don't why I went to see this disaster, Tiger is a good kid but he really needs acting lessons. Talented actor like RD was wasted in the movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "bhardwajbeastdb",
        "review_rating": "1",
        "review_title": "Such a idiotic movie They have made",
        "review_detailed_main": "I don't why are they make sequels of one movie name and the story is worst. Please come with good concept and give some chance to some new directors and try to make less budget movie.. because we want entertainment plus story in movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rohitsharmabhd",
        "review_rating": "1",
        "review_title": "Worst movie in the history of actions movies.",
        "review_detailed_main": "First of all, there is no story in the movie. Younger brother who saves his elder brother cross the border just to save and fight with terrorist with bare hands. Also, destroys helicopter with his legs and kill the leader of the terriost group that too in Syria. Worst movie in the history of actions movies, full action with 8 pack abs but without any story."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Shekhar2014",
        "review_rating": "10",
        "review_title": "#Unbiased",
        "review_detailed_main": "MUST WATCH. Well plotted .. TS (Tiger Shrof ) is a groming star... Movie is outstanding . And TS did a excellent Job .."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "gadgetlifegl",
        "review_rating": "1",
        "review_title": "Why can't i put - Rating",
        "review_detailed_main": "This movie is so bad it's cute. Dear IMDB please enable minus rating."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vjrockindia",
        "review_rating": "1",
        "review_title": "Worst movie in the world ever",
        "review_detailed_main": "Without any storyline movie E cause you with headache to brain hemorrhage"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "subeer2009",
        "review_rating": "1",
        "review_title": "We are not stupid",
        "review_detailed_main": "They think we are stupid one after on other stupid movies are coming without any scripts and logic Don't try to be Stallone for comparison u can't be sorry And one more thing IMDB doing real good job to save our money .."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sushantji",
        "review_rating": "3",
        "review_title": "The 3 in Baaghi 3 stands for 3rd Class",
        "review_detailed_main": "The movie is a total failure on all accounts. Bad acting, pathetic characters and stupid action scenes that make absolutely no sense (we all want to see the hero outrun helicopters and tanks, but there has to be an element of intelligence to it!). On top of that, the sound and dubbing are horrible too.\n\nEven with the low expectations that I went into the movie, it still was an extraordinary disappointment. I am being generous giving it 3 stars - just because Tiger Shroff gave it his best in the action scenes."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jos-dsouza",
        "review_rating": "1",
        "review_title": "Absolute crap",
        "review_detailed_main": "Two words: rubbish and crap. Story- None. No emotions, no drama, no comedy. So what's there: nothing. Action- Horrible. It's all messed up and overdone. When 100 men with guns, tanks and helicopters cannot shoot one unarmed person, you know that it is a pathetic movie. It's a three year old kids fantasy dream. Acting- A stone will act better than the hero and the heroine. You can see the products of nepotism. They give you a headache. Direction: Was there any? It's lost from the word go.\n\nDoes not even deserve a negative hundred"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shunyaaakash",
        "review_rating": "1",
        "review_title": "Worst of the Baaghi Series.",
        "review_detailed_main": "Ahmad Khan and Remo D'souza are good friends that's why they make movies of same calibre."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pearks4994",
        "review_rating": "1",
        "review_title": "Not Even If Someone Pay to Watch",
        "review_detailed_main": "Disaster Movie...No Digestive Concept Rubbish Silly Story.."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kabilsivam",
        "review_rating": "3",
        "review_title": "Waste",
        "review_detailed_main": "Picking up south Indian films and making into a trash that's what baaghi series is varsham,kshanam,vettai these are movies storyline was the flim series baaghi better write the own for next film it makes the film series worth to watch"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "yoginderhooda",
        "review_rating": "10",
        "review_title": "People are biased",
        "review_detailed_main": "First of all i want to say these days movies are not really rated on the basis of how the film is. This film is a 4 or 5 star movie but people are going extreme, they are either rating it as 10 which is not true or they rating it as 1 which is also not true I mean even after saying 2-3 good thing about the movie they rated it as 1 star movie..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "aquibzawwadsiyam",
        "review_rating": "1",
        "review_title": "Worst movie ever i watched after race 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "akshaygautam5",
        "review_rating": "1",
        "review_title": "WORST MOVIE OF LIFE",
        "review_detailed_main": "I regret when i decided to give it chance that maybe there will be at least something that i will like about this movie... but trust me there is nothing ..There is only Worst acting by tiger and shradha Worst action sequences with so much slow motion which is so irritating Story is good but it could have been shown in a much better way\n\nEverything about this movie is worst. This movie is headache\n\nAhmed khan please forgive us and don't ever try to direct a movie again...."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jineshcp",
        "review_rating": "2",
        "review_title": "Bhaago",
        "review_detailed_main": "The worst film among the Baaghi series. Action sequences were supposed to be the highlight of this movie, but it was not. Not worth your time."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "feetakhilesh",
        "review_rating": "1",
        "review_title": "Bakwaas movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kaulanand",
        "review_rating": "1",
        "review_title": "Messenger of God",
        "review_detailed_main": "It is just like \"Messenger of God\" with better looking actors.\n\nBahut bakwaas hai No story at all"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "siyam_hossen",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Tiger's acting was very bad in this movie. and this is only for child not for mature people."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sureshrajachar",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "Half naked women dancing in club in war torn Syria . Can only happen in Bollywood. Pathetic thinking and pathetic direction."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "4",
        "review_title": "A GENUINE ATTEMPT TO BRING DOWN AND FINISH THE STANDARD OF BAAGHI FRANCHISE !",
        "review_detailed_main": "BAAGHI 3 REVIEW :-\n\nBaaghi in 2016, Baaghi 2 in 2018 and Baaghi 3 in 2020 this series of events took a very short time to run. Baaghi was a Hit where we saw Tiger Shroff and Shraddha Kapoor doing some excellent stunts and then came Baaghi 2 which took the action level much higher than previous. In result, Baaghi 2 emerged a Blockbuster and since then expectations for Baaghi 3 started building up. This time, Ronnie is back in action again but he is not against any single person but againt a nation. You can imagine how big they're going with this franchise. Baaghi 3 falls down under this pressure and how deep? You just can't bear it.\n\nFrom the trailer we got pretty much idea of film's story. Ronnie (Tiger Shroff) and Vikram (Riteish Deshmukh) are brothers who share an unbreakable bond. Since childhood, Ronnie always comes to the rescue whenever Vikram falls in any trouble. Their journey begins when a certain turn in events, leads Vikram turned a Police officer to travel in Syria to complete some work. On this trip, Vikram gets kidnapped by people who are not to be messed with but as Ronnie witnesses his brother getting beaten and kidnapped by ISIS, he knows that he will do whatever it takes to destroy anyone and anything that stands in the way of Vikram's safety. Ronnie goes on a rampage of destruction to see his brother safe again, even if it means that he independently has to take on villain Abu Jindal or so called an entire country.\n\nWhen it comes to action films, Tiger Shroff seems like an unstoppable force. I loved him in Heropanti, Baaghi, Baaghi 2, War and now Baaghi 3 all these films have surely made him a darling of masses. He is the only action superstar among young brigade in Bollywood. What i didn't like about him is he fel less in acting everytime. His dialogue delivery in this film is at least tolerable but his expressions are totally dull. Shraddha Kapoor looks cute and but unbearably funny. there is lot of dubbing made on her dialogues and that made her look like a b grade actress. I remember watching her performance and stunts in Baaghi and i absolutely loved her but this time it is completely opposite. Riteish Deshmukh as Vikram is innocent from the start but you have a special surprise at the end, watch out for that (if you can't predict muvh like a movie buff). His wife Ruchi is played by gorgeous Ankita Lokhande and she is hardly decent. Rest of the cast is okay with thier particular cameos and supporting roles.\n\nBollywood has a massive fanbase for Action films. If there's any film seen, which shows you something bigger, larger in action genre then people would love it. In Baaghi 3 you get to see Ronnie alone smashing entire team of terrorism gang, this is something big but what about the content? Baaghi 3 falters in linear equation of storytelling. There are so many loopholes and loo breaks while setting a plot. Once you start hating them ypu just wanna go home leaving the film unfinished. Dialogues are massy flavoured, comically taunted. Music viz there are couple of songs that will keep you engaged but you know more of Tiger's dancing would have been more pleasing.\n\nAhmed Khan comes tries to make an entertainer set in emotional liberty supported by explosive action. But sadly Action director does a better job than him. It's quite irregular from his style of films and i don't know why he chose to go such kiddish way when he could have easily made a good entertainer like it's predecessor. He tries to focus more on emotions than hardcore drama where he wins couple of times but fails on more occasions. Overall, Baaghi 3 doesn't live upto the mark at all, i instead it degrades the standard of action franchise set by previous two films. I can blame director for the failure as he has totally destroyed this emerging franchise. If you love action then watch it, if you have seen enough action in trailer then better skip it.\n\nRATING- 4/10*"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "armankumar-62199",
        "review_rating": "10",
        "review_title": "Cool",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rishikantkala",
        "review_rating": "2",
        "review_title": "Trailer was so much better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shubhamj51",
        "review_rating": "1",
        "review_title": "Total wastage of time. Too Bad Movie",
        "review_detailed_main": "How can you make such a bad movie, bad storyline. How can one person win from terrorist loaded with weapons, tanks and chopper. Nonsense movie, pure rubbish."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "arslanjafri",
        "review_rating": "1",
        "review_title": "ARMY WHO ??",
        "review_detailed_main": "Bancho Army Ko Chutti Do Or Thoray Paisay Day Kay Issi Ko Rakh Lo Jang Kay Liyey , He Wont Need Any Of The Equipments Too , Just Aik Awaz Lagana Ronni !"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "tyagitoshi",
        "review_rating": "1",
        "review_title": "I feel like I am SERIOUSLY done from Bollywood",
        "review_detailed_main": "Worst experience\n\nMy eyes are seriously paining\n\nRIP acting!!\n\nRIP logic!!\n\nRIP fight scenes!!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hlalwani",
        "review_rating": "1",
        "review_title": "Complete waste",
        "review_detailed_main": "100% waste of money & time. Don't even think about it."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ashah-03087",
        "review_rating": "1",
        "review_title": "The audience is in my prayers",
        "review_detailed_main": "I am praying for the poor souls that took the brave choice to watch this. There aren't many folks out there that can gather the courage and patience to watch such a movie. It's tough but if you are able to walk out of the theater with all your brain cells intact, then mission accomplished.\n\nPlease go with a partner or group of friends as you will need someone to prevent you from committing suicide. Good luck to all that will watch this.\n\nAmen"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "gajendervermaverma",
        "review_rating": "3",
        "review_title": "I tried, seriously i tried out of respect for the other 2 parts",
        "review_detailed_main": "I tried hard to give this movie a good rating, i see 1.8 rating but I couldn't believe it until i see it for myself and i hoped so hard the movie will be good - but as the movie reaches end - it ends in disappointment. It is sad very sad. He is a good actor but over action , physics defying stunts, thinking Syria is a joke and fighting terrorists is just a video game? For god Sake have some respect for the maturity of Indian public. Sometime more realistic looking action with good story us more than enough to get movie into 6 plus rating - which is all that lacks in this movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "adityamk51",
        "review_rating": "1",
        "review_title": "They should really stop",
        "review_detailed_main": "The actors have once again outdone themselves. Never have they acted this bad before. Keep up the consistency."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "maycry-60586",
        "review_rating": "10",
        "review_title": "Its a great Action Movie",
        "review_detailed_main": "Its a really awesome movie. Worth value. Dont Listen to Critic's. Action Was Great And Also CGI."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abdulmajid-09471",
        "review_rating": "1",
        "review_title": "Tiger Shroff should look for another profession.",
        "review_detailed_main": "Don't even get me started. Tiger Shroff cannot act, period! Just because you have a good physique does not make up for your bad acting. I had to leave the theatre in middle of the movie. I should sue you for a refund! Do us all a favor and leave Bollywood for good."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "bilalbasit20",
        "review_rating": "2",
        "review_title": "Couldn't finish the movie",
        "review_detailed_main": "I had to leave the movie before the last 30 minutes. Still giving it 2 stars which is above the average rating...it is a sympathy rating because they have spent 850 million inr on this garbage. The beginning was bearable but after that all i could see was Overacting, nonsensical action and ridiculous screenplay. Childish stuff basically. I had high expectations from it."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pankajpandit-12113",
        "review_rating": "1",
        "review_title": "Made me puke",
        "review_detailed_main": "The words senseless and stupid can be correctly attributed to the Direction, screenplay and editing of this disaster of a movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "masudhawladar",
        "review_rating": "1",
        "review_title": "I think this is the worst movie in the entire world.",
        "review_detailed_main": "If there is any option to rate it zero(0) star i would select that. waste of time nothing else."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "uzmanzahid",
        "review_rating": "1",
        "review_title": "Specially signed up IMDb to rate this movie",
        "review_detailed_main": "Begger scene of Abu Jalal was stolen from Money heist... Overall one the the worst movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "anielbhatti",
        "review_rating": "2",
        "review_title": "Repeat scenes, again and again.",
        "review_detailed_main": "Rubbish directions. Getting fed up of seeing Tiger do same scenes, same action in every movie. Predictable movie from beginning. Disha helps movie with special appearance song."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "akkirusty",
        "review_rating": "1",
        "review_title": "Wasted 2 hours",
        "review_detailed_main": "The Director should be banned for making another movie. Why can't someone who has real talent and think out of the box direct a movie. These movies are curse for Bollywood and unfair to people who had faith in Indian Cinema. Just for the sake of making a movie you cannot produce some non sense content. We should learn a bit from foreign movies. I feel disgusted after wasting several hours for this movie.writing a review also feels like wasting time here."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "royelbis",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Worst movie ever... Neither the movie has the story nor the action is relevant."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "amitshrestha",
        "review_rating": "10",
        "review_title": "Sherkhan baaghi bangaya..",
        "review_detailed_main": "This is the best movie of 2020. I cannot explain how much I enjoyed this movie. I wouls be suprised if it doesnt sweep all the awards this year. Wsiting for Baaghi 4."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "johncharter",
        "review_rating": "1",
        "review_title": "If there was zero in IMDB rating",
        "review_detailed_main": "Never seen movie that got straight 1.9 rating on IMDb worst movie ever"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "suyatrasinha",
        "review_rating": "1",
        "review_title": "Ronnnnnyyyyyyyyy",
        "review_detailed_main": "Imdb should introduce a rating from 0. This movie is baseless, crap, time waste. I really believe that after watching the movie people will truly understand the true value of time. Please, DONT WATCH IT. Took me another 30mins to find words to comment on this. Lost my 3hrs."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "DryIceProductionS",
        "review_rating": "1",
        "review_title": "Story about a chocolate boy who kills enemy in Slow-Mo.",
        "review_detailed_main": "If you think people can't go dumber any more you are wrong, there is no limit to dumbness. This movie is nothing but just embarrassment to Indian movies and more than that it just insults you in every frame. Just avoid it even in current lockdown. Rating: _n"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mahmudbah-39602",
        "review_rating": "1",
        "review_title": "RIP LOGIC!!!",
        "review_detailed_main": "Before watching baaghi 3 you should remove your brain and lock it some where"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "adilk-31232",
        "review_rating": "1",
        "review_title": "My eyes are burning",
        "review_detailed_main": "My brain is hurting. Bollywood plz quit making movies"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sameer-khatri",
        "review_rating": "1",
        "review_title": "The makers were 'high' while making this movie?",
        "review_detailed_main": "Cannot believe that such movie can exist. Waste of time..makers were high on some cheap local drugs."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "fkhussain",
        "review_rating": "1",
        "review_title": "Most idiotic film of 2020",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "adigupta-29978",
        "review_rating": "1",
        "review_title": "What useless yaar",
        "review_detailed_main": "0 star movie\n\nAction is good\n\nMeaningless movie. Totally"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "its-me6611",
        "review_rating": "8",
        "review_title": "Superb action film",
        "review_detailed_main": "8/10\n\nTiger Shroff's biggest rebellion yet. This time he rebels against a nation. 'Log rishto mein hadein paar karte hain, mera ek aisa rishta tha, jiske liye maine sarhadein paar kardi (People cross limits for their relationships, I had one such relationship for which I crossed borders)' this line was enough for me to get interested in the movie. I watched it with my family and we had a great time.\n\nRiteish and Tiger are brothers. Whenever Riteish gets in trouble Tiger always helps him. After Riteish becomes a police officer Tiger helps him to clean up the criminals while Riteish gets the credit. This attention from both media and other officers brings the brothers face to face with a Terrorist.\n\nJackie Shroff had little screen time, he did an excellent job with those odd few minutes. The supporting cast did an excellent job. Tiger has done his best acting yet on this one. He showed bigger screen presence and seemed more comfortable in his role. He has come a long way in terms of acting. I liked the chemistry between Tiger and Riteish. They looked very cute and loveable.\n\nThe dialogues are surprisingly catchy. Songs are catchy as well. I loved the get ready to fight reloaded. This is the best version of get ready to fight yet.\n\nThe Action is the biggest positive of Baaghi 3. I loved Baaghi 2 for the action scenes but my god they took it to the next level in Baaghi 3. The first fight outside a Cineplex was superb and they topped it in the next fight at IPL's lair. Very few movies this year from Bollywood can compete with Baaghi 3 in terms of action. The fist fights in the first half was out of this world. The last fight scene does drag but even that had its moments.\n\nThere is not much in terms of story but the action scenes make up for that. I loved the first half. Thanks to excellent cinematography Baaghi 3 is very pleasing to the eye. Recommended if you liked Baaghi 2."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "chiragpatel-41882",
        "review_rating": "1",
        "review_title": "Look Like South Movie",
        "review_detailed_main": "Make Action Scene which look realistic no matter you use VFX.... if hero jump from hight its clearly seen that he tie with rope and jump. Too much over acting. Make action which is digestible if its action movie only."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ajayprasad-25778",
        "review_rating": "1",
        "review_title": "Newton and Einstein you are lucky as they left before watching this movie !",
        "review_detailed_main": "I admit my fault to spare some time from doing nothing and watch bollywood movies ... What I have now regret , guilt and headache :("
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "faran08",
        "review_rating": "1",
        "review_title": "Haha",
        "review_detailed_main": "When the movie is so bad that the makers have to fake rate it themselves so that rating may jump few fractions of a point. I'm sorry I don't stand to fake rate. 1 is the rating it deserves and same shall I give."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ksymecha",
        "review_rating": "1",
        "review_title": "Deadliest than coronavirus.",
        "review_detailed_main": "What a movie.lost my last two brain cells.now I am admitted to hospital."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "yogeshsahir",
        "review_rating": "3",
        "review_title": "Illogical movie with good story",
        "review_detailed_main": "Story is worthable but action sequences are illogical. Worst screenplay. All are waste Except tiger shroff peroformance. Big budget film but in box office one of he biggest disaster in 2020 If ur a fan of tiger shroff. One time u will able to see Otherwise nothing is there in movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nahid-32706",
        "review_rating": "1",
        "review_title": "If I could give this a 0 star, I would love to do that.",
        "review_detailed_main": "Nonsense! Nonsense! Nonsense! What waste of time. No story, no plot. 3rd class class acting from all of the actors."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "moosaquadri",
        "review_rating": "2",
        "review_title": "Tiger shroff deserves much better",
        "review_detailed_main": "I follow tiger shroff a lot due to his physique and stunts but this movie is a shame, very bad direction, illogical movie and tiger shroffs acting was not good, there are other movies in bollywood who deserve a better box office collection. Baaghi 3 does not deserve 137cr, movies like commando 3 deserve bigger numbers, I dont know why vidyut jamwal is being unseen by people, his acting is great his movie was great but he has ended up with 45cr for commando 3. This is a total shame, I would be surprised if they made baaghi 4 or even if they do I hope they bring a new director and better script writer. I am only giving 2 star for tiger shroffs stunts and because the songs were okay."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "crazymania-83623",
        "review_rating": "1",
        "review_title": "Mein Baag-hi gaya theatre se...",
        "review_detailed_main": "Such a bad movie. You don't see anything else but senseless action. It's waste of time and money and resources. Please we deserve better."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Magow-Intermean",
        "review_rating": "10",
        "review_title": "Baaghi 3 Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sfoysol",
        "review_rating": "1",
        "review_title": "WTF??",
        "review_detailed_main": "WTF!! Why another conventional Anti-Ethnical film without any logic, strong story & supernaturalism?? One man is destroying an army base. Really..?? Poor VFX, worst storyline, poor acting, worst theme.\n\nReplace Abu Jalal with RAW. Being Tiger Shroff, we will come...."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "HeartbreakKid7",
        "review_rating": "1",
        "review_title": "ONE OF THE WORST MOVIE OF ALL TIME",
        "review_detailed_main": "Not Even Action is Worth Watching in the Movie. Only 1-2 minute scenes of Ritesh Deshmukh has some punchlines and Expressions, even Shraddha Kapoor's Dialogues is like from some other language, You can't even guess. Most Illogical Movie Ever, Action Wise as well as Story Wise. Good Luck With Next Movie of the Franchise if in Making. The Standard of the Series just hit the bottom. Doesn't even deserve 1*"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "subarnajung-231-678914",
        "review_rating": "1",
        "review_title": "Disaster Movie.",
        "review_detailed_main": "I have never seen such a crap movie like this...totally waste of time."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "himzhemel",
        "review_rating": "1",
        "review_title": "If you liked it , you nailed it !",
        "review_detailed_main": "Senseless movie. No stories , no plot nothing. Just dhakama.Tiger you beauty! Absolutely pointless movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ddon-58074",
        "review_rating": "1",
        "review_title": "Tatti 3",
        "review_detailed_main": "When a Pakistani lahori is speaking in an Indian Hyderabadi accent you know the movie won't have any logic. Leave you're brain at home they say. They made sure to leave their brains at home while writing the script."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rohanbhanushali",
        "review_rating": "1",
        "review_title": "Worst pathetic movie ever",
        "review_detailed_main": "Worst Bollywood movie ever ever made Never ever seen this bad movie in my life.\n\nTiger shroff will take 2000 years to come somewhere a action star.\n\nWorst pathetic torture movie.\n\nFirst review of my life be because never ever seen sooo bad story and direction.\n\nWorst director in the planet"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rahularorabenny",
        "review_rating": "1",
        "review_title": "Quarantine Torture!!!",
        "review_detailed_main": "This movie isn't about saving his brother from being Kidnapped but it was to torture everyone who watches it. I have an advice for the director Ahmed Khan - people should always focus on the things they are good at and shouldn't try to achieve what they cannot achieve. This movie is a perfect example of this, even the action scenes aren't synchronised properly. I have given one star for Tiger's acting apart from it I will give negative ratings. Ahmed Khan please work in choreography if you want to be in this industry and stop wasting our time along with yours."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "apurvapatel-99511",
        "review_rating": "1",
        "review_title": "O bhai... Maro mujhe maro. Yeah kya majak chal raha hai",
        "review_detailed_main": "So basically physics don't apply here and really bad acting. Yeah and one more thing, ye movie nahi torture hai torture."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "prashantmohan56",
        "review_rating": "9",
        "review_title": "Whats wrong with people",
        "review_detailed_main": "I liked the movie, its a pure action film with some excelent acting.. dont understand such low rating... its a must watch movie if you are a action movie fan"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vijayadhikari-29796",
        "review_rating": "1",
        "review_title": "Save the Tiger",
        "review_detailed_main": "Tiger need to know the difference between being physically fit and acting. You don't need to jump and throw your legs everywhere, its called over acting. Couldn't even watch for more than 20 mins. Who give good luck yogurt in front of the police station. I hope someday you choose a good script and director."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vinodkris",
        "review_rating": "1",
        "review_title": "Absolutely ridiculous piece of crap!!!",
        "review_detailed_main": "If you ever think that you have seen it all and worst of Indian cinema is behind you, go watch Baaghi 3. It is a great example of the atrocities that these so called film producers, directors and actors put the Indian audience thru every year, year after year and yet we refuse to learn!!!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mukeshjangidit",
        "review_rating": "1",
        "review_title": "Totally Rubbish",
        "review_detailed_main": "There is no story in movie, totally disappointment. Actions are okay. I think 1 rating is enough for this movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "coolamitu-25375",
        "review_rating": "1",
        "review_title": "Nonsense",
        "review_detailed_main": "Doesn't make sense at all. Ridiculous script. A common citizen helping police solve cases that too in India, this is too much to handle"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "AdityaShankar0901",
        "review_rating": "1",
        "review_title": "Baaghi dekh ke theatre se ghar bhaag gaya main!",
        "review_detailed_main": "What kind of kink do these Bollywood filmmakers have towards a girl who swears all the time?! What fun do you guys get by seeing some cheap girl/guy swearing all day in half-Hindi half-Marathi style?!\n\nLeave that, coming to the film, only actions (which are also copied) are good. Maybe songs. Nothing else.\n\n(The story of all Baaghi series is the same. There's Ronnie. Someone close to him is kidnapped by some large organization. Tiger Shroff (Ronnie) destroys the whole organization/mafia, with a mix of his gymnastic and karate skills, and an expressionless face that probably means anger)\n\nSorry, Tiger - You deserve better films, not SoTY2 or Baaghi series; These are ruining your career."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "amritpal-79906",
        "review_rating": "1",
        "review_title": "Waste 2 hour",
        "review_detailed_main": "Last two movies are awesome, this time i Never see worst action movie in my life, never expected"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "goswami-sandeepan",
        "review_rating": "1",
        "review_title": "Heights of pathetic movie making",
        "review_detailed_main": "This movie is a training module for creating a pathetic movie. No script, lack of acting skills. Unjustified action."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shecksmanreal",
        "review_rating": "1",
        "review_title": "Unrealistic",
        "review_detailed_main": "The movie is unrealistic with many foolish and worst acting to my liking"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "khaledshaik",
        "review_rating": "9",
        "review_title": "OK type movie",
        "review_detailed_main": "Story was average!! But the action sequence was great!! Sharddha and Tiger was good with their acting parts!!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jtiindersingh",
        "review_rating": "1",
        "review_title": "Worst movies of bollywood",
        "review_detailed_main": "Never expected such a BAKWAAS movie from bollywood"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "amarmakhija",
        "review_rating": "1",
        "review_title": "Don't watch!",
        "review_detailed_main": "Just don't watch it, Rather save your money and buy a N-95 mask and stay safe from corona virus :)"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "amanali-96932",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "Waste of time and money over action story copy from South movies"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Aditya_Bhattacharyya",
        "review_rating": "1",
        "review_title": "Mindless movie",
        "review_detailed_main": "Childish story, clueless direction, mindless acting, illogical action sequence....if these are the things that you would like to enjoy, then be my guest and watch the movie... with a handful of aspirin."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mitulbinwal07",
        "review_rating": "1",
        "review_title": "Bakawas",
        "review_detailed_main": "Bakwas....please someone teach him acting and him understand jumping won't help to success what a disappointment"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "bhaveshpotdar",
        "review_rating": "1",
        "review_title": "One of the worst movie",
        "review_detailed_main": "An actor like him choose this type of movie only to show off his physical body, According to me, Tiger shroff is the wasted son of one of the finest actor in India."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kalrachetan",
        "review_rating": "1",
        "review_title": "Worst Movie 2020",
        "review_detailed_main": "Full of overacting and non sense Full of overacting and non sense Full of overacting and non sense Full of overacting and non sense"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "badboyslife-61700",
        "review_rating": "1",
        "review_title": "Pathetic over acting. Full franchise ki maa behan kardiya",
        "review_detailed_main": "Hopeless director. Why can't they make a sensible movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shibashismandal-60874",
        "review_rating": "10",
        "review_title": "Best movie in the world",
        "review_detailed_main": "First , this is the best action film ever for tiger shroff fan, no bad reviews for this movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ashutosh252",
        "review_rating": "1",
        "review_title": "Worst/Wahiyat",
        "review_detailed_main": "I am not able to find words describing this movie. Ahmed khan is the worst director. He doesn't have basic sense of making a movie. He must be banned from working in entertainment industry. These people doesn't even thought of making original music. Fox star studios should file case against them for wasting money"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "crazymania-83623",
        "review_rating": "1",
        "review_title": "Not just Syria , the world is destroyed",
        "review_detailed_main": "Horrible. There is nothing in this film but action. The direction is flawed the storyline is flawed. Please stop making film with no great storyline. It's waste of time, resources and a waste for my brain cells to understand."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "arunavhazarika",
        "review_rating": "1",
        "review_title": "Epic Disaster",
        "review_detailed_main": "Honestly speaking i became fan of Shraddha Kapoor and Tiger Shroff when i i first watch Baaghi in 2016. I was literally waiting to watch both of them together again. Then there came 2018 Baaghi 2 little bit of dissapointment when i get to know that shradha Kapoor has been replaced by Disha Patani. But the movie was good allover. But when I get back to know that shradha kapoor is again coming back in the Baaghi 3 and even Riteish Deshmukh, i was eagerly waiting for it to come. And now i just watched the movie in Disney Hotstar.\n\nCan't believe they can make such movie in this era. The story line is overdramatic, far from the reality, we can't even say it a fictional, its far from fictional. It is one of the worst film the industry have ever made. Only Riteish Deshmukh and Jackie Shroff was good. I have a better storyline than this movie....seriously speaking. And why the hell Grandson is recruiting Ahmed Khan for direction. We have seen his direction. He can't be in comparision to Sabbir Khan. The first part was made by Sabbir Khan and he have done it very well.\n\nA single movie destroyed the whole franchisee. Tiger Shroff had been shown not less than a superhuman. After watching this, definitely Nick Fury is going to call him for MARVEL PHASE 5. I can't give you here the complete details but you must get understand till now how much good this movie is.....Seriously i am still in shocked and honestly speaking i have never seen such type of movie ever in my life. The Bollywood industry must work on their storywriting and must not give direction to the hands of any choreographer or else it will be soon on the hands of a doom.....\n\n\n\nA message to The Grandson, please take as much time as you want but dont ruin the Kick franchisee as Baaghi and please bring Sabbir Khan with a nice storyline for Baaghi 4. We are waiting for it......"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ankushsharma-76272",
        "review_rating": "1",
        "review_title": "Two star for Tiger's hard work",
        "review_detailed_main": "If you are a gym freak and wish to watch Tiger Shroff's physique for 2.5 hrs.. Go for it.."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ankitjoshi90",
        "review_rating": "1",
        "review_title": "Just don't....please don't",
        "review_detailed_main": "Don't watch this movie because this is serious assault on our senses and reality. Whatever shown can be true on some remote alien planet but is impossible on mother earth. Plus you will be bored to death and will find yourself gasping for air. Your feet will rise and move rapidly on the dark path inside the theater till they find you on the real planet earth too late to recognise you have already lost your 300 bucks"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "laharyung",
        "review_rating": "1",
        "review_title": "No Logic in any Scene",
        "review_detailed_main": "The worst Movie ever.... No Logic towards the end Scene.... Looks like not Natural scene"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "CinephileDreamer",
        "review_rating": "1",
        "review_title": "A Complete Disaster",
        "review_detailed_main": "Worst Acting..Worst Story And Disastrous VFX.Tiger Shroff carrying same facial expression like he had got something stuck in his back."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "activesumit",
        "review_rating": "1",
        "review_title": "More Hazardous than Corona",
        "review_detailed_main": "Cine Lovers be Like : Eee ka bawasir bna diye ho..!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "DixitAseem",
        "review_rating": "10",
        "review_title": "Brilliant is what it is!",
        "review_detailed_main": "This is an awesomely entertaining movie. It has all the ingredients of a thoroughly entertaining Hindi film . I'm so glad that Hindi films are still made the way they should be. The audience has to remember they are watching a Hindi film NOT a Hollywood movie . Please dint compare Hindi films to Hollywood. I live in NYC and wait for movies like these , movies that are entertaining on all counts. I'm not interested in psuedo Hindi movies where only the language is Hindi but the acting , direction and treatment of the film is a \"wannabe \" Hollywood. This movie is great on all counts. The acting is just fine for the genre, the script is pretty tight , direction is seamless , there are no slow or boring moments in the movie. And what do I say about the Action! It is just WOW! Tiger Shroff is something else! Right now there is nobody like him in any film industry anywhere. Thanks to Netflix and Prime, I watch movies of different languages nearly every night and I can tell you there is nobody like Tiger, anywhere. I'm so proud we have an action hero like him. There were 3 songs and all three were really good. This is an audio visual treat for your senses. I took my 2 boys for the movie and all of us thoroughly enjoyed the movie. I dont know why people are so negative towards these movies. If you dont like something maybe it's your taste , the product doesnt become bad. I being an Indian hate mangoes, doesnt mean mangoes are bad. A Hollywood movie of the same caliber would get such great praises but if we do it and do it better , we will be torn to shreds with analysis FOR PEOPLE WHO LOVE ACTION, YOU CANT MISS THIS ONE!!!!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "manish_bangia",
        "review_rating": "1",
        "review_title": "Worst movie, should not be watched",
        "review_detailed_main": "This is such a worst movie that is going to blow your mind after seeing it. Action hero is shown in such a style and tashan which is hard to digest. One must understand showing some sort of logic in action scenes, this is way too far away from that."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "zilayhaider",
        "review_rating": "1",
        "review_title": "One of the Pathetic movie",
        "review_detailed_main": "It is a real disappointment, there are certain people from Bollywood who should be banned now for filmmaking, Sajid Nad, Rohit Shetty and David Dhavan. I mean especially in this movie they used such a pathetic 3rd class comedy. You know, Lollywood used to make movies with such nonsense (pathetic jokes, unreasonable action, and weird attitude of hero) and these things destroyed Lollywood. I mean there are 2 helicopter and one war craft and not a single bullet they shot. What are you doing with six tanks, if they aren't gonna shot a single bullet or missile? Ban these filmmakers now for making such absurd content as they are out of content now and loosing their real image. Pathetic"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rockiesonn",
        "review_rating": "1",
        "review_title": "Tatti movie",
        "review_detailed_main": "Bc Inn logo me creativity hi nahi h. Bhaagi 2 b bakwas thi aur 3 bhi. Bc these heros are so dumb. Everything matters is \"creativity\""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hfaa-97179",
        "review_rating": "1",
        "review_title": "Not worth your time",
        "review_detailed_main": "No proper story + overacting = Bad movie\n\nSome dialogues were forcefully added.\n\nThe hero needs to work on the acting skills (action is really good)."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "BhonkieLaal",
        "review_rating": "1",
        "review_title": "1/1000 should be the actual rating..",
        "review_detailed_main": "Are we really not going to say that this is just some money-laundering scheme... Or do we believe that the whole cast/director/producer thought this would be superb jarr, I want my 7 minutes back of my life (6min movie/ 1min review writing). Time is too precious sisters and brothers..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "callmeshaun",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "I think pathetic will be an understatement if I have to rate this movie. I am sure Baaghi 4 will come too. Bollywood infect rewards failures because it is actually taking advantage of the Indian over population. It's like \"Koi na koi to dekhega\"....Thanks we have OTT these days otherwise sheer waste of money"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "bableerajaryal",
        "review_rating": "1",
        "review_title": "Get ready to be bored.",
        "review_detailed_main": "I wish i could give zero rating. Story, action, acting, logic, dialogues and songs. Everything is lame. This movie is a waste of time."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shabk-09916",
        "review_rating": "1",
        "review_title": "No can beat race 3 except baaghi 3",
        "review_detailed_main": "Worst Action, Worst Story, Worst from every angle."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "chirantanbanerjee",
        "review_rating": "8",
        "review_title": "Average movie",
        "review_detailed_main": "Some scenes where illogical specially the last scene.But the fights were thrilling.A one time watch great movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "bsrawat-89274",
        "review_rating": "1",
        "review_title": "Wrost movie",
        "review_detailed_main": "Macho movie baaghi 3 India's most boring movie baaghi 3 India's most faku director (##"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mrarulz-88215",
        "review_rating": "1",
        "review_title": "Superb Comedy",
        "review_detailed_main": "I would give me this movie a 10 for comedy because it's a complete joke. From that 10 I'll take the 9 out and give it to the reviews because the reviews were funnier than the movie. I never written or read a review for any movie in my life but I had to see the audience reaction for this movie and it made me burst of laughter. CAUTION! WATCH THIS MOVIE AT YOUR OWN RISK AT IT WILL LEAVE YOUR BRAIN DEAD!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vamera",
        "review_rating": "1",
        "review_title": "Pretty useless",
        "review_detailed_main": "It was like a body building show featuring tiger Shroff."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "aniksarkaras",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Hmza92-525-524018",
        "review_rating": "1",
        "review_title": "This movie was a torture",
        "review_detailed_main": "Terrible acting, poor storyline, no thriller or entertainment, just a guy taking down an army, tanks, choppers with a single punch without getting shot. What on earth were the directors thinking, who does this bland action movie appeal to? Certainly not me. I'd give it 0 stars if that was an option."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "anudeepk-93896",
        "review_rating": "1",
        "review_title": "DO NOT WATCH THIS MOVIE PLSSS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "superfunkyevilkiller",
        "review_rating": "1",
        "review_title": "Pure comedy",
        "review_detailed_main": "If you want a good laugh at absolute nonsense and cringe-worthy acting then go ahead and watch this. I watched the trailer after seeing the low reviews and it is just pure 100% crap."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rohanaranawade",
        "review_rating": "1",
        "review_title": "What is this ?",
        "review_detailed_main": "Just one word \" Pathetic \" It's the most pathetic and illogical movie ever . What were the Producers and Director thinking ? Writers must be high on something to write something so illogical and Direction is mind blowing as to get the same illogical things from paper to screen . I just don't understand that there are so many good scripts and stories being made on low budget and movies such as Baaghi getting budget is again something illogical. After watching this movie and the posters of Heropanti 2 coming out I am again scared that logic is gonna die again ."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kunal140",
        "review_rating": "8",
        "review_title": "Indian Arnold is here finally",
        "review_detailed_main": "If you like movies like Commando, Rambo then this is perfect for you. This movie is about the brotherly love between Riteish and Tiger and how they fight off the goons not only in India but also in Syria.\n\nLike Harry Potter, Ronnie aka Tiger is the one who can never be killed, no matter how much evil guys like Voldemort try to kill him - like shooting him with riffles or a tank.\n\nThe story is very unique where the younger sibling takes care of the elder one or is it.\n\nThis one is not to be missed and eagerly waiting for the 4th movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "justinsir",
        "review_rating": "1",
        "review_title": "I WANT REFUND.",
        "review_detailed_main": "If You are planning to watch Baaghi 3. I Suggest you to Drop The Idea. I want to know Where The hell is Bollywood heading. There is no storyline, worst direction, worst acting. BAAGHI 3 is a TORTURE Of 2h 23min."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "justinsir",
        "review_rating": "1",
        "review_title": "WASTE OF MONEY.",
        "review_detailed_main": "Where The Hell Is Bollywood heading. Absolutely There is No sense Of Movie. Seriously If You want To TORCHER Yourself Then You can Watch BAAGHI 3. There is NO STORYLINE. WORST ACTING, WORST DIRECTION. Kalank Of 2020. WORST Movie I have Ever Watched In My Life. Overall Baaghi 3 is a WASTE OF MONEY AND TIME."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "subaanm",
        "review_rating": "1",
        "review_title": "They Mixed Up The Spiderman, The Hulk And Chota Bheem",
        "review_detailed_main": "After watching the movie, I am trying to come into my real senses. What was it i just saw, was it chota bheem? Was it the hulk? Was it the spiderman?\n\n1. Somebody wanted to make a movie and he did without a story. 2. Somebody wanted to defy each and every law of physics and he did."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "chonku",
        "review_rating": "1",
        "review_title": "ABSOLUTELY DISASTROUS",
        "review_detailed_main": "1 star for effort in making the movie. Its terrible and disastrous movie. The stunts were really bad. I don't think the actors in this movie would like to watch their work too. At one point it looked like a comedy movie because anything could happen. Not sure which world is this shot in."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mynameisashish-71379",
        "review_rating": "1",
        "review_title": "Waste of talent",
        "review_detailed_main": "Dont watch it ! That all i wanna say to you. And the action squences in the end are cringe to watch. I mean how can you make a man like flying in the air without any superpowers. One word for this movie : DISGUSTING"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "srinihari",
        "review_rating": "1",
        "review_title": "Baaghi 3 nahi Baaghi 3rd class hai",
        "review_detailed_main": "Chutiya movie.. Kuch logic nahi kuch nahi. Sirf tatti action... Selmon Bhai ka tatti movies ko bahut takkar dega yeh movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "praneetj-96611",
        "review_rating": "1",
        "review_title": "Copy - Paste",
        "review_detailed_main": "Again bollywood is back with a remake and nonsense logic to the stage. Tiger Shroff scenes are complete bodyshow(s) with no logic and plot whatsoever. This is the 3rd film in Baaghi franchise which again has same subject \"Kidnapped\" I mean WTF!??"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "heymanathan",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Describe the movie in one word : WORST So many illogical and unnecessary scenes. Worst vfx, worst screenplay, worst cinematography.Even half of this movie is a remake of another movie called vettai.Vettai movie is way more better than baaghi 3.I dont know how some people still love this kind of worst movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mohammedajasma",
        "review_rating": "9",
        "review_title": "Illogical movie?? Naaa this movie is next level",
        "review_detailed_main": "I don't know why people saying this movie as illogical. Really this movie, we can match with Hollywood action movies (fast and furious, expendables etc...) If this kind of actions happens in Hollywood movies our people will cheer.. if its Bollywood they will say illogical movie or action\n\nYou need consider one thing how much hard worked for this movie.\n\nIf this movie is illogical the all fast and furious movies are also illogical.\n\nFor me this movie is extraordinary one"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "jewelbosu",
        "review_rating": "2",
        "review_title": "Copycat",
        "review_detailed_main": "Worst copy of Telegu film Tadakha (2013). Total waste of time."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sudhirrl",
        "review_rating": "1",
        "review_title": "Template for remaking and ruining excellent Tamil script",
        "review_detailed_main": "The original Tamil movie was excellent movie starring Madhavan and Arya and this movie is example of ruining a excellent masala movie into ...... Why they couldn't just go with the original script, rather than trying to make it big and rubbish"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "arvindsingh-cs",
        "review_rating": "1",
        "review_title": "don't deserve a single star",
        "review_detailed_main": "Waste movie. over-reacting and waste of money. Doesn't even deserve a elaborate review. my fingers are crying when writing this review but want to save people from tragedy"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kaluakalua-62916",
        "review_rating": "1",
        "review_title": "It's not a movie it's sh¡t",
        "review_detailed_main": "Only the Mor0n director wanted to show tigers Six pack @ss and Muscles. Story is sh¡t. If you really like logic and senseful action movies. Then you head Up to NOBODY (STARRING BOB ODENKIRK). I really hate over Acting. Shradhdha is such a moron!c actress."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sachinwad",
        "review_rating": "1",
        "review_title": "Worst movie of the decade",
        "review_detailed_main": "Useless plot, unrealistic fights and third class acting."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "princeparindey",
        "review_rating": "1",
        "review_title": "Waste of time!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "anirudhmukhundan",
        "review_rating": "3",
        "review_title": "A copy...",
        "review_detailed_main": "An utter copy of the Tamil movie Settai... 'Unbelievable Action' Terrible Storyline and Direction Tried to get the KGF feel but failed horribly..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "acgug",
        "review_rating": "1",
        "review_title": "If you can watch this movie fully, then you can practice social distancing with no problem",
        "review_detailed_main": "I have seen horrible movies, but this one takes the cake ,,,,\n\nI thought marjavan was the worst recent movie, this one makes that one seem like a 5 star\n\nGod save us , both movies were hit\n\nI surely believe the makers of this movie were hired by terrorists to make Indians look so backwards and stupid\n\nWarning:: If you leave your brain behind to watch it, you won't find it again so proceed with caution\n\nYou can notice from my review I have probably lost a lot of brain cells thanks to this ....."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "manibentogadiya",
        "review_rating": "9",
        "review_title": "a must watch, action movie",
        "review_detailed_main": "Action, story, music, all at it's best..entertaining!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vishalvyas-92157",
        "review_rating": "1",
        "review_title": "Pathetic😠😡",
        "review_detailed_main": "Please take your family out for dinner or park or zoo than throwing your money on this garbage and if you single than do same.. Tiger is truly ranks in one of the best action heroes in Bollywood but has to choose is script were wisely as he lacks tiny of acting skills but he has long way to go and I'm sure and wish him Well to create his of name in industry from his dad my childhood hero Sir Jai Kishen Bhai aka JackieBhai Kya Bidhu"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "chutiyatiger",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "One of the worse than worst films I've ever seen no doubt... Skip it✌🏻First things first Tiger shroff is one of the worst actors in bollywood & he doesn't look like a hero either (he's ugly)... He needs to work on his constipated expressions too... Wahiyat film. Kaun dekhta hai ye sab chutiyappa,ugly actor,bad plot, remake ghatiya music... Even shraddha did overacting in this..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "meNirmalsharma",
        "review_rating": "1",
        "review_title": "Where is Bollywood going. It was just ridiculous.",
        "review_detailed_main": "The concept and the storyline is very bad. senseless action sequence , why do you need 5 tanks to kill a guy running without any weapons. Poorly made movie . Really unrealistic Senseless script with copied action sequences Really poor dialogues of lead actors. Indian film industry has been a big time copycat of Hollywood, but still there's no match."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "omiyoshanto",
        "review_rating": "1",
        "review_title": "Worst movie you can watch!",
        "review_detailed_main": "I have never seen such logicless and clueless movie. It was utter disgrace. This Tiger guy should learn how to act before signing a film. Shraddha Kapoor was another disappointment. Total waste of time."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "deepakk-86717",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Please don't make another sequel..nepotism at the peak.. Tiger should stop acting and take martial arts classes for kids.."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rajibsa",
        "review_rating": "1",
        "review_title": "Wasted",
        "review_detailed_main": "What a story...what a movie....wasted of my time.... tiger shorff is using captain America shield. Bullet are just passing by...Helicopter shoot was very illogical"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "gihankaduwelausa",
        "review_rating": "1",
        "review_title": "Worst Hindi Movie in 2020.",
        "review_detailed_main": "Worst movie in 2020. It is not worth to watch at all. Rubbish story line."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "raghuuk",
        "review_rating": "1",
        "review_title": "This is not a movie. Is a weapon.",
        "review_detailed_main": "If you want someone to be dead, but don't want to murder them, then tie them to a chair and play this movie. Even the strongest ones can watch only two times. But the rest will succumb as soon the movie starts playing second time."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "neerajtesting",
        "review_rating": "10",
        "review_title": "Awesome action and emotional movie",
        "review_detailed_main": "The one who love family and like seeing some action so go for this movie. The film is according to Hollywood standard that is why in india film is not that successful. This actor one day will be also working in Hollywood movies because he has that standard in him."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "btuhin-85878",
        "review_rating": "1",
        "review_title": "Waste of money,total tatti",
        "review_detailed_main": "Totally garbage,worst VFX,brainless acting,full of overacting,no story"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "fariday-00490",
        "review_rating": "1",
        "review_title": "Ye tatti kisne ki hain?",
        "review_detailed_main": "100% tatti hain yeh. No storyline; no plot ; nothing"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vijintmtm",
        "review_rating": "3",
        "review_title": "Bad movie",
        "review_detailed_main": "The concept is same as before movies, where the hero fights many persons to someone. But in this movie it fails a lot to present the proper believable scenes, in less words the direction was a failure."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "m-asyari88",
        "review_rating": "1",
        "review_title": "Trash movie",
        "review_detailed_main": "Stupid plot, stupid act except for shrada and disha patani. Tiger shroff is trash. He is even don't know how to act. Bollywood must stop used this guy as main actor. Just look at his movie history, all trash. And always flop. He must be the most plop actor at Bollywood."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ashishborah-01407",
        "review_rating": "1",
        "review_title": "Absolute utter nonsense",
        "review_detailed_main": "If i had an option i would have given -10 . -5 for the storyline and -5 for the acting."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vaibzey",
        "review_rating": "1",
        "review_title": "I watched it and i went to self quarantine for next 2 years",
        "review_detailed_main": "Some movies are so bad that watching them becomes good experience. but not this movie. This movie is plain BAD."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rohittupate",
        "review_rating": "2",
        "review_title": "It's a comedy action",
        "review_detailed_main": "They tried so hard to make fool of us but they made fool of themselves... Just don't go... The one thing I like is they didn't add much songs .. But action make you laugh so hard that your Physics get Strong... It's actually all the things that Physics or any other subjects don't agree...So want to learn go for it."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "kdeeghayu",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie that bollywood made in 2020. The director could not able to take out Tiger's real talent. As a student of science I am still thinking how tiger even took his actions as the character. What a waste."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "goldberglegend",
        "review_rating": "10",
        "review_title": "Film with action, comedy & emotional scenes",
        "review_detailed_main": "See everyone is mainly talking about logic I will clear all your doubts first of all ok this movie is logicless and what about films like fast and furious,avengers these are very logic films na wahhh re what a bitch audience India have 👏👏👏means anything in foreign logic and in India it is logicless talking about the story it is very well shown and better than both the previous parts Comedy is nice emotional scenes are their tiger shroff 's acting is improving after every film the only negative point was VFX which was bad rest everything is gud ."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "maulik-38729",
        "review_rating": "1",
        "review_title": "Very bad",
        "review_detailed_main": "In this movie Physics is like joke. Don't watch this movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mandaluditnarayan",
        "review_rating": "1",
        "review_title": "Yeh kya babasir bana diye ho!",
        "review_detailed_main": "Just dhamnamor ekta limit thake. No logic, no acting, nothing. It's like a boy just dreaming that he is hero."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pranayg-11963",
        "review_rating": "1",
        "review_title": "Best direction! Pun intended!",
        "review_detailed_main": "To just sum up the brilliant direction. There is a blast by the helicopter following the protagonist who is in front. As soon as the bomb drops on his leg, the protagonist somehow turns 360 degree and gets on the helicopter!\n\nAhmed khan should stay to choreography for our sake."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "spatel-10318",
        "review_rating": "1",
        "review_title": "Why does this Movie even Exist?!",
        "review_detailed_main": "Please give us an option for a 0 rating for such movie. I was never more tempted to create an account just to right a movie review about how bad is this movie. No Story, Action is so fake, No character building, and Terrible Transitions. I kept waiting and waiting for this movie to get better 1 hour and 3 mins of my life that i will never get back. Please DON'T EVEN TRY to watch this movie. I don't understand what was the director thinking when directing this piece of garbage of a movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "bappiboro",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I can't believe in one scene hero is fighting with two men over a flying chopper,no effects of rockets,bombs,bullets,tanks all were worthless and copy of wonder woman scene was hilarious, holding helicopter's door instead of a shield."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ronanraj",
        "review_rating": "1",
        "review_title": "Total Waste",
        "review_detailed_main": "One of the most illogical action sequence, highly worst acting, producer wasted his money on nothing!!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "wabrar",
        "review_rating": "1",
        "review_title": "Worst Movie of Worst Movie",
        "review_detailed_main": "The director must be high on cocaine to make this garbage movie....after WAR the people started to see tiger as decent action hero..but thia film undone all the good deeds and impression created by his earlier films..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "s-uppal",
        "review_rating": "2",
        "review_title": "Zzzzzzzzzzz",
        "review_detailed_main": "All that needs to be said is WTF were they thinking!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pramodranpariya",
        "review_rating": "10",
        "review_title": "Outstanding, Only see hard work of movie maker and Direction.",
        "review_detailed_main": "Well, Public are open to give review anything but I am happy with this movie. It is power pack movie what a fight, action, Looks of Tiger. I was thinking this worst movie but seriously don't see movie story anything. If you are action lover then go and watch. Tiger Scroff is looking next level up in indiam cinema but nobody understand. If you watch moive like james bond or mission impossible you never say it is worst movie because they are hollywood. Please don't compare bollywood to any wood. Improving and making best level.\n\nMovie should be superhit but unfortunetely Janta is everything. Perosnally I liked this movie even story casting and screensplay little difficult to understand why who chosen character.\n\nSome things are copy of tollywood and hollywood but it is not matter you will enjoy movie overall.."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nilesh-sharma-17",
        "review_rating": "1",
        "review_title": "ITS THE CORONA OF BOLLYWOOD",
        "review_detailed_main": "Saw it on Hotstar so thank god didn't waste my money over it. Worst movie ever !!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "someshkrishnani",
        "review_rating": "1",
        "review_title": "Makers need to sit, think and get a life!",
        "review_detailed_main": "Totally illogical, without any story, any acting, worst possible screenplay. I wish there was any possible way to rate it below 1."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "avipinjarkar",
        "review_rating": "1",
        "review_title": "Bawasir",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "parthtiwari-32401",
        "review_rating": "1",
        "review_title": "Nothing good",
        "review_detailed_main": "Faltu picture no logic no good VFX no story nothing"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "pvp-85243",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "One of the worst remake film i watched ever they spoiled the movie with their illogical works"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rishavthakur-85167",
        "review_rating": "1",
        "review_title": "COPIED SCRIPT .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abhinandanroy",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "sudhindramohan",
        "review_rating": "1",
        "review_title": "Illogical movie to ever make.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ritikpaswan-17960",
        "review_rating": "10",
        "review_title": "Heart touching movie",
        "review_detailed_main": "Really nice movie i like the movie very much Very emotional plus funny and heartouching those who say baaghi 3 is movie is bad that's means they had not seen movie or they don't have heart also movie give social message Movie easily cross 200cr"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "ujjwalsahayofficial",
        "review_rating": "1",
        "review_title": "FINALLY WE HAVE SOMEONE TO FINISH WORLD WAR 3",
        "review_detailed_main": "Tiger Shroff, What a movie man... big fan.\n\nWell just FYI there is gym trainer opening nearby... why don't you try instead."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vijaymohite-45264",
        "review_rating": "1",
        "review_title": "Worstt......",
        "review_detailed_main": "I never wrote review...... But one word total bakwaaas Specifically 🐯"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rijik-83713",
        "review_rating": "1",
        "review_title": "Why on earth are these even made!",
        "review_detailed_main": "Can't digest this utter crap movie earning 100-200 crores. It doesn't deserve even a single star. In Bollywood Action movies we can be considerate about logic because their main focus is not there. But even for decent actions there must be atleast a palatable storyline. Signing these crap films clearly reflects that Tiger is far from being an Actor. All his movies are these craps which he carries on his shoulders by Action and Action only. Don't know what on earth is Shraddha doing in the film. She was trying hard to be funny using some cuss words but everything looked irritating after a point. She went with Ronnie to Syria to dance, run and do some action exactly what and when Ronnie is doing the same. Disha Patani's item song in a Syrian Bar is a filth but gives us a little comfort from the mindless action going around. A Bomb blasts near Ronnie's legs but nothing happens to him, infact he gets thrust to jump upto the helicopter. Ritesh Deshmukh is a police officer with no characteristics of the same. Direction, Storyline, Songs, Humor nothing is convincing at all. Only a Single star for Tiger trying to do his level best and carry the film all by himself. I would rather request the audience to go and watch SHUBH MANGAL ZYADA SAAVDHAN Again or THAPPAD this Weekend if you want to go to movies. Avoid this Baaghi 3 crap. Please."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dy38493",
        "review_rating": "2",
        "review_title": "Good movie for action fans",
        "review_detailed_main": "Good movie to watch for the action scenes beside action scenes nothing new is in the movie storyline is not interesting but actions are great."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "mujtabasaif786",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie that I have ever seen, I don't know what happened to director and also actors, have they lost their minds. The movie is pathetic and there is no good story, all they shown is illogical action, it doesn't make any sense and they also done many goofs in the movie like the cars scene which people lying on the cars before they were lying in the ground after the actor hit them. I had a headache after watching the movie and I wanted the movie to end soon while watching the movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abubakeryousufay",
        "review_rating": "1",
        "review_title": "10000x worst movie",
        "review_detailed_main": "I don't know who watch these movies... Why are they making these movies.. no logic no storyline..."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "Ankit-Kumar-Gami",
        "review_rating": "1",
        "review_title": "A Trilogy of Bad Remakes",
        "review_detailed_main": "Baaghi was a remake of Varsham. Baaghi 2 was a remake of Kshanam. This movies is again a remake of a Tamil blockbuster movie Vettai.\n\nWhy Baaghi 3 neither worth your money nor your time - 1.Senseless Dialogue 2.Copied Story with Mindless changes 3.Copied and Mindless Action Sequence 4.Bad Acting(except Ritesh) 5.Cheap looking VFX action sequence 7. Disastrous Direction 8. First half is bad but second half is worst. Why don't choreographers stick to what they are good in. We don't want this franchise to go on. Indian Audience don't deserve these type of torcher movies. Please stop this type movies."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dhruvvermadv",
        "review_rating": "1",
        "review_title": "Painful watch",
        "review_detailed_main": "Want a refund of ticket price movie was silly illogical and not at all entertaining"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nageshphaniraj",
        "review_rating": "10",
        "review_title": "Amazing action thriller, loved it",
        "review_detailed_main": "It is my pleasure to inform every this may very well be the single most amazing movie I have seen. Not because it is technically sound, but because it absolutely captivating in every aspect of the word. The pure emotion and entertainment felt throughout is indescribable, it's an experience I believe should partake in at least once in their life. Ronnie is a Bollywood equivalent to a fusion of Dwayne the Rock Johnson chuck norris Tarzan and goku. Bravo, I've never seen the first two but this has definitely inspired me to go and watch in hopes that they will at least have a tenth of the entertainment value this cinematic master piece has had. If they do I will be more than pleased. 10/10 would recommend."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "saifalikhan-47526",
        "review_rating": "1",
        "review_title": "Overacting!",
        "review_detailed_main": "Over action sucked me! This movie could be good but what is going on in amjad mind.i dont understand."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "aniruddhawaghmare",
        "review_rating": "1",
        "review_title": "0/0",
        "review_detailed_main": "This movie does not deserves a review hated it to the core tiger please just don't do acting please you are the worst actor in the whole world"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "iSatchit",
        "review_rating": "1",
        "review_title": "There was no zero",
        "review_detailed_main": "There was no zero so I had to rate this movie to 1. I don't know what was the writer and director were upto, there is nothing good in this movie."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "abdurrahman_emdad",
        "review_rating": "4",
        "review_title": "Don't waste your money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "adityavora-20055",
        "review_rating": "1",
        "review_title": "REALLY",
        "review_detailed_main": "Paise ke liye insan kitna gir sakta yeh ab pata chal gaya\n\nWah wah . Kya movie banayi hai\n\nEvery actor must have bought a duplex after this movie\n\nJago ghrahak jago\n\nStop giving your money to Bollywood\n\nThis industry is fooling everyone\n\nI hope the director , story writer and all the top head honchos in this move shoot themselves\n\nPlease before dying slap your self\n\nTiger sheriff. Seriously dude wtf\n\nJ."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "J0RWAL",
        "review_rating": "1",
        "review_title": "Absolute horrible",
        "review_detailed_main": "Acting was very poor, Tiger Shroff comes from a privileged family and everytime I see his acting, it's terrible.\n\nPlease stop promoting these wealthy kids at the expense of someone better qualified for the role.\n\nDon't waste your money or time with this one!"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "hrishikeshcpande",
        "review_rating": "1",
        "review_title": "Paid Torture",
        "review_detailed_main": "These are certain moments of life, where u start questioning your existence. Why was I born. Why did I come here.\n\nI suddenly felt good for people out there enjoying their life. It was so bad, people in the theatre actually started laughing together even on sad scenes.\n\nZero logic.\n\nSorry can't say more. It wil be like experiencing this horific movie again. This movie should be taken down to save humanity."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "dadakalanderd",
        "review_rating": "1",
        "review_title": "Not entertain-able",
        "review_detailed_main": "Worst I have ever seen just time waste , no good story illogical movie"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vibodhah",
        "review_rating": "10",
        "review_title": "Tiger Shroff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "rajeshisnepali",
        "review_rating": "1",
        "review_title": "Total WASTE",
        "review_detailed_main": "Total Waste of Time. All COPIED and bad direction."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "bdking-78181",
        "review_rating": "1",
        "review_title": "A total package of crap",
        "review_detailed_main": "Where is story? where is acting? a total illogical movie. what happen to bollywood. Bakwas"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "vishnuvijayan-58026",
        "review_rating": "1",
        "review_title": "It is terrible when compared to previous movie",
        "review_detailed_main": "There is hardly any story nor there is any chase between the hero and the villain . Yes when we think of Baaghi we think of a fight but there is no importance given to the story line.. As quickly as the search begins it ends and the hero has a location"
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "shibendradas",
        "review_rating": "1",
        "review_title": "Targeting HINDU religion and showing muslims terrorist iNNOCENT",
        "review_detailed_main": "Showing HinduPHOBIA wearing dharamik tilak as terrorist , and muslims character as innocent.\n\nDirector is muslim(ahmed khan) and he has done good work in showing that his religion islam which is considered as terrorism in world is good and degrading names of hindus.\n\nAhmed khan is doing his JIHAD which he learnt from some madrasa."
    },
    {
        "movie_id": "tt8366590",
        "movie_name": "Baaghi 3",
        "movie_rating": "2.2",
        "review_username": "nebinjohns",
        "review_rating": "4",
        "review_title": "Below average",
        "review_detailed_main": "Tiger did well. But the name of the movie doesn't match to the plot of the story. If you make Tiger's Ronie as a super hero,the movie will hit the bull's eye. Action sequences are good. But the unfaithful scenes are the drawback of this movie. If you love Tiger's action & dance, don't miss this flick. Otherwise baagi 3 is an avoidable flick."
    }
]