[
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "karl_consiglio",
        "review_rating": "5",
        "review_title": "Childhood memories",
        "review_detailed_main": "I remember my Dad taking me to watch this film as a Christmas treet. This film was made here in Malta and we are very proud of it, the set still stands today as a tourist attraction in Anchor bay. i remember loving this film. Robbin Williams was only known for the series of \"Mork and Mindy', he still had a very long way to go but you can see that he was more than a promising star in the entertainment business. I learnt that at the time he was having serious troubles with cocaine and a cheating wife. This film was really cool and should they re-attempt it(not that Popeye is so much in vogue this days....although he should be) I can't imagine anyone but Robin Williams himself for the part."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "brchthethird",
        "review_rating": "6",
        "review_title": "Robin Williams IS Popeye in his first feature film starring role",
        "review_detailed_main": "POPEYE was Robin Williams' first starring role in a feature film, and he inhabits the character perfectly. This movie, more than any other that I can remember, is the best example of a live action cartoon, in the best sense of the term. Watching it was like a cartoon come to life. It was truly wonderful and extremely funny to watch characters behaving as if they were in one, from their movement to the way they spoke. And none exemplify this better than Robin Williams in the title role, who channels his unbridled comic talent into a completely dedicated performance which is equally hilarious and touching. The story is fairly simple, though. Popeye rows into the town of Sweethaven looking for his 'Pap.' While there, he (and the audience) find out about how messed up that town really is. They have an absurd amount of taxes, and everyone is kept in fear of a mysterious Commodore and Captain Bluto, who run the town. He also meets Olive Oyl, played (at times screechingly) by Shelley Duvall (who also fits her role perfectly). This film is also a musical, and there several catchy numbers which have the capacity to stick in your head if you aren't careful. If I have any complaints, it's that Shelley Duvall isn't as good a singer as she is an actress, but nothing she does really ruins the picture. The biggest flaw in the film is direction the narrative takes about two thirds of the way through. I also thought that Bluto wasn't really given his due as a character. Still, for Robin Williams fans this will be essential viewing. It's a wacky, manic experience that demands to be seen."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "I thought it was decent, but I also thought it could have been better",
        "review_detailed_main": "Just for the record, I love musicals, and some of my favourite movies(West Side Story, Wizard of Oz, My Fair Lady) are musicals. Popeye I wasn't sure whether I wanted to see due to its dubious reputation, but I saw it anyway because of the cast.\n\nI actually thought Popeye was decent. However I do think it could have been better, and while I personally don't think it is as bad as its reputation I can understand some of the criticisms made. Popeye is far from the best movie musical, I do not think it is as bad as Xanadu, Can't Stop the Music, Mame or Grease 2.\n\nAnd while it is one of Altman's weakest efforts of what I've seen it is as far as disappointing movie musicals from great directors go it is not as bad as Lumet's The Wiz or Attenborough's A Chorus Line(I am in the minority who loves Huston's Annie, despite its maligning).\n\nFor my thoughts on the movie, Altman's directing is not as efficient as it was with Gosford Park, MASH, Nashville or Macabe and Mrs Miller, but while it lacks buoyancy he does do what he can and while some scenes are better directed than others, it is not as heavy handed or as lethargic as the directing jobs of The Wiz and A Chorus Line.\n\nPopeye does have its flaws. Some of the editing is a little scrappy, not always but some scenes don't always flow from one scene to another as seamlessly as it could've done. The story benefits from a great idea once you get over the idea of Popeye hating spinach(people say that it is a contradiction to the timeless cartoons and I am sorry to say they're right), but is bogged down sometimes by some pacing that comes across as a little too manic and the fact its execution is a tad too over-simplistic.\n\nThe dialogue is often silly, some of the slapstick didn't work for me such as the destruction of Popeye's room, and I think incomprehensible too, I understand they were trying to recreate the spirit of the spirits with the mumbling but with it happening a vast majority of the times here I think they went a little overboard though I credit them for effort. There were however some lines I chuckled at such as the Baby Oyl one and was touched by.\n\nMy feelings on the songs were mixed. Some are great, I enjoyed Popeye the Sailor Man and also He Needs Me, SweetHaven and I'm Mean. Others suffer from forgettable melodies that lyrics that either don't make sense or don't have much of a structure. The incidental score however especially in the end credits is fantastic.\n\nI was also mixed on the effects. Most of them are not too bad actually. One however looked cheap and in a very distracting sense as well, and that was the octopus puppet.\n\nFlaws aside, the film aside from some scrappy editing looks fantastic. Sweethaven is beautifully designed here, the costumes show some effort to stick to the cartoon/comic's spirit, the camera angles are good and the atmosphere is evoked very well.\n\nThe choreography is not the most sprightly I've seen nor the most inept. In general it was decent, and fitting with the tone of the song. The characters are one-dimensional, but pretty likable.\n\nThe casting aside from how the film looks is the best asset of the movie. Robin Williams is pitch perfect as Popeye and Shelley Duvall was born for a more seductive Olive-Oyl. Paul L.Smith is great as Bluto, and Ray Walston and Paul Dooley are solid. Wesley Ivan Hurt is an adorable Swee'pea.\n\nOverall, not bad, not good, just decent in my eyes. 6/10 Bethany Cox"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "One Eye Wide Shut",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "MogwaiMovieReviews",
        "review_rating": "5",
        "review_title": "A Musical Filled With Songs It's Impossible To Sing Along With",
        "review_detailed_main": "Working my way through Robert Altman's back catalogue, I decided to risk another look at his chaotic and largely unintelligible Popeye, which I'd not seen for many years, though I'd once somehow ended up owning the soundtrack album (exclusively for Van Dyke Parks' contributions).\n\nI keep on hearing it's worth a reappraisal, and in some ways it is, since it's such an oddity, and so well made in a number of secondary areas: the photography and sets are amazing, successfully bringing to life the fantasy seaside town of Millhaven. The fight scenes are also great fun, recreating the kind of far-fetched, physically impossible comedy violence of the cartoons well. Every corner you peek at is filled with loving detail.\n\nWhat goes wrong, really, is the story, the songs, and most of all the dialogue. Robin Williams looks the part, but his entire role is incomprehensible and overdubbed so close to the microphone he sounds in every scene as though his drunken, muttering head is resting upon your shoulder. Since none of the other characters sound this way (or at least not this bad), it creates an uncomfortable, frustrating and disorientating atmosphere that continually breaks the spell throughout.\n\nThe rest of the cast look fine, too, especially Shelley Duvall, who physically was born to play Olive Oyl, but that's about as far as it goes. If there IS some good dialogue, it's lost through the rambling delivery and haphazard structure. And practically none of it is funny. It strikes me it would actually have been much better as a silent film.\n\nThe sloppiness of Altman's style, with everyone talking over each other, and the camera lurching around, turns out to be an absolute catastrophe when it comes to the tight precision and coordination necessary to carry off a Hollywood musical, and Popeye is a musical filled with songs it's impossible to sing along with. The first Robin Williams tune, \"Blow Me Down\" is so mumbled and meandering that it's impossible to even follow, let alone hum. The only one which really works and remains memorable is Olive Oyl singing \"He Needs Me\", since it has a shape and a simplicity and a repeated melody that enables it to stick in the mind. The rest of them, like the rest of the film, need subtitles just to be able to grasp most of what is being said at all, even though there's nothing all that much *wrong* with the songs themselves, just the delivery.\n\nOne gets the feeling that, with such an amazing setting, cast and detailed craftsmanship, all this film needed was a tighter, more professional and less self-indulgent direction to pull off something as loveable and entertaining as, say, the first Pirates of The Caribbean.\n\nAnd so the responsibility has to lie squarely on Altman's shoulders that it was the enormous failure it turned out to be, and it now seems entirely understandable why the studios didn't want to throw money at him anymore for awhile."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "preppy-3",
        "review_rating": "1",
        "review_title": "Pretty horrendous",
        "review_detailed_main": "Popeye (Robin Williams) travels to Sweethaven. There he meets and falls in love with Olive Oyl (Shelley Duvall). Unfortunately she's to be married to Bluto (Paul L. Smith) who has a nasty temper. Also Popeye adopts an abandoned baby (Wesley Ivan Hunt).\n\nHow anybody thought this could work is beyond me. It was directed by Robert Altman. He was easily one of the best directors around but he made his mark in low budget adult movies like \"Nashville\" or \"MASH\". Giving him a big budget cartoon movie AND musical (yes--it's a musical too) to direct was just stupid. Altman obviously didn't know how to direct musical numbers--the staging on them seemed off. It doesn't help that the songs and lyrics themselves are unmemorable. As for the dialogue--a mess. Popeye's mumblings in the old cartoons were actually pretty funny. Here we have Altman's trademark overlapping dialogue drowning out most anything Popeye says. There are a few cute lines (\"Olive Oyl? Sounds like a lubricator.\") but not enough. Also Popeye HATES spinach here! Huh???? Who came up with that idea? How did he got those muscular arms to begin with? That's just stupid. This also contains some of the most painfully unfunny slapstick I've ever seen in a movie. Watch the scene where Duvall accidentally and \"hilarously\" destroys Popeye's room. Casting helps somewhat. Williams and Duvall and Smith look exactly like their cartoon characters and their acting isn't bad. Also Hurt (Altman's real life grandson) is just adorable. But bad songs, incomprehensible dialogue, a stupid plot and lousy comedy sink this one. Supposedly it DID make a tiny profit but Altman later said this almost ended his career. It was two solid years before he did another theatrical film. Boring, stupid and a real mess. A 1."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Tiger_Mark",
        "review_rating": "1",
        "review_title": "I know why it bombed!",
        "review_detailed_main": "It sucked! Right? Seriously, this is a nightmare of a picture. You have the horrible dubbed in voices that make Robin Williams' Popeye character sound like he was reading his lines over the phone. You have the endless musical numbers that lack anything remotely close to something you could tap your foot to. You have Shelly Duval repeating the same irritating lines, over and over and over and over. Part of me wanted to like this film as I am a huge fan of the cartoon and character. However, this film is just so boring and so tiring. I often wondered if it was the longest movie ever filmed, it seemed like it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "richspenc",
        "review_rating": "7",
        "review_title": "Not too bad, Popeye Williams",
        "review_detailed_main": "I didn't see Popeye the movie for the first time until it came out on video. But I remember how my dad told me he saw it in the movie theater. He told me afterwards \"Popeye hads its moments, sos I, halfway throughs the movie, I wents out to me car to gets me cigarettes, hads me a puffs or two, then wents back inside to wartch the rest of me movie, geh geh geh geh geh.\" A couple of years later, we rented Popeye on video and I saw it, and I'd seen it several times since. Its not too bad. Robin Williams is fairly convincing as Pop-eye. Paul Smith as Bluto, looking large and menacing like his cartoon version. Paul Dooley isn't too bad as Wimpy. And Ray Waltson as Poopdeck pappy. And Shelly Devaul as Olive fits her role pretty good. She does sort of seem like Olive Ole come to life, with the looks and mannerisms. However, the late Zasu Pitts who starred in several different 1930s films such as \"Meet the baron\" and \"Dames\" would've been an even better Olive with her looks and the very Olive Ole like way she went \"oh my\" in her films. I read somewhere that they took some of Zasu's mannerisms and appearance when creating Olive's character when the Popeye cartoon was first made. I always watched Popeye as a kid growing up even before seeing this movie. I liked the neat special effects, too such as steam really coming from Bluto's ears when he got mad, just like the cartoon. They also had Popeye's (Robin's) forearms really bulging out and him doing the squint with his eye just the right way, and his pipe. They made the seaport town Sweethaven look quite convincing. It always had an English seaside town feel. Anyways, this movie overall had some good, funny, and interesting moments. A few other moments were a little less below par. And I personally don't think the songs in the film were that good, or necessary. Popeye the cartoon was not a musical. Overall though, this is always a pretty good film for a mom or dad to watch with their kids.\n\nNote; I wrote this review about a year and a half ago, and no one has clicked on either 'useful' or 'not useful' yet. Can someone reading this please click on one? I won't be offended either way on which you click on, I'm just curious on what others may think of this review. Thanks"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "babytoes",
        "review_rating": "4",
        "review_title": "did i like it or not?",
        "review_detailed_main": "this movie is like a car wreck: so bad, you can't watch it, but so fascinating you can't make yourself turn away. shelley duvall was born to play olive oyl and robin williams, as always, adds his own special touches to the title role. however, even the two of them can't overcome a weak script, and probably the most dreadful score ever to appear on the screen. and yet, i have seen this movie about 20 times. why? i can't quite explain it, but there's something that implores me to watch it again and again (something subliminal, perhaps?)"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Sylviastel",
        "review_rating": "7",
        "review_title": "For the die-hard Popeye fans only!",
        "review_detailed_main": "I am not ashamed to admit it but I love Popeye, the cartoon and the movie starring the amazing Robin Williams as Popeye. He is almost unrecognizable in the role but completely believable. I love Shelley Duvall as Olive Oyl because she really does a superb job living up to and beyond my expectations as the ultra-skinny love interest to muscular Popeye. It's like watching old friends. \"I'll pay Tuesday for a Hamburger today\" was a common statement. Of course, Popeye and Olive Oyl have Brutus as an obstacle to their happiness and almost the loss of Sweet Pea. It's a kind a family film too. It has music and dancing. Okay, it's not the greatest musical film ever made but it's always worth watching again. It reminds me of being 7 years old and seeing this film at the movie theater."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "MovieBuffMarine",
        "review_rating": "5",
        "review_title": "The actors/actresses did well, but...",
        "review_detailed_main": "Robin Williams the great comedian he was and impressionist excellently brought Popeye to life in this live action take.\n\nShelley Duvall nailed the Olive Oyl role.\n\nBulky Paul L. Smith showed real well what a live action Bluto would be like.\n\nOthers like Ray Walston and Paul Dooley both portrayed Pappy and Wimpy respectively rounded out the other characters from the comic strip and cartoon very well.\n\nBut the story could have been much better. Seeing the rest of Olive Oyl's family (created for the movie) wasn't bad. The movie seemed more dramatic than the comicstrip and cartoon it was derived from. Yes, animated to live action is a challenge, but it didn't really work for this one.\n\nAnd the musical numbers; they were horrible! Did we really need them? They really didn't add to the story to entertain or otherwise.\n\nI think Popeye is one of those that should have been left alone and not adapted for live action. Again, the players did the live action adaptations well, but the weak story line and horrible songs killed it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "joeshannongabe",
        "review_rating": "10",
        "review_title": "Masterpiece. You heard me right. MASTERPIECE!",
        "review_detailed_main": "I see that lots of people hate this movie. I guess I can see why. It's so idiosyncratic, so loose, so out there, so...Altman. But this is truly one of the sweetest, gentlest, and most tender movies I have ever seen. This movie can be enjoyed if for no other reason than for its total lack of irony. Like Popeye, it is what it is. And I believe it to be a masterpiece.\n\nThis was Robin Williams first serious movie role (2 full years before Garp) and he is a brilliant Popeye. He brings so much humanity and pathos to this character that it is easy to see the great movies in his future. Shelly Duval was born to play Olive Oyl and she does not squander the role of a lifetime. And in a smaller role, a standout performance is turned in Bill Irwin as Ham, Olive's bumbling, stumbling, clown of an ex-boyfriend.\n\nThe real star of the show, however, is the atmosphere that Altman conjures up, bringing the 2d comic strip vividly to life and setting you down in this magical little island town of Sweet Haven. Harry Nilssons score is pitch perfect and his songs help to sketch out the characters motives and emotions (\"He Needs Me\", sung by Duvall, is currently being revived thanks to it's being prominently featured in PT Anderson's \"Punch Drunk Love\").\n\nOne more thing about this movie- I can watch it with my three year old son and we sing the songs and both enjoy it immensely. There are so few movies that can do that. Like I said, a masterpiece!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "SinginDetective",
        "review_rating": "7",
        "review_title": "The worst masterpiece ever made",
        "review_detailed_main": "Wow, again \"the worst movie ever made\". At least when you go by those self proclaimed internet-movie-critics on IMDb who never bother to bestow upon the heavily bored public their highly imaginative musings like \"Two hours of my life I will never get back\", without even having one (a life that is) in the first place. Fact is: Every movie in this database is \"the worst ever made\" ... for someone ... then scroll up or down a bit and suddenly the same movie will become a \"never fully appreciated masterpiece\". What does this teach us? The truth, like always, lies somewhere in between and is highly subjective. Go and see it for yourself. Don't be interested in what I have to say. Well, if you still are: I quite liked it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "irishm",
        "review_rating": "1",
        "review_title": "Atrocious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "davidtholl1",
        "review_rating": "",
        "review_title": "AN UNDERAPPRECIATED GEM",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "MissSimonetta",
        "review_rating": "3",
        "review_title": "Only barely qualifies as a musical, or a movie for that matter",
        "review_detailed_main": "I'm not sure if you ever could have made a good picture out of the Popeye cartoon or comic. The characters and general schtick of the thing work well for half an hour at most. Still, what these filmmakers gave us in the end is worse than could ever be imagined: this is a nightmarish piece of cinema, one of the worst major Hollywood productions I have ever seen.\n\nIt's almost miraculous how wrong everything went, because the casting is perfect. The sets and costumes are perfect. Such a shame the screenplay is terrible, meandering from plot point to plot point, vaguely connected and with the most ear bleeding-ly horrible \"musical numbers\" in between. Every piece of dialogue is mere noise, a cacophony of mumbling and screeching and pratfalls. I almost wished I were dead watching it.\n\nHow anyone could ever procure joy from this will be the eternal mystery for me. To call it unpleasant would be an understatement."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "wadesrmail",
        "review_rating": "1",
        "review_title": "superb",
        "review_detailed_main": "Superb example of taking a cartoon character and doing absolutely nothing with it....absolutely no story , unsustainable noise that the producers try to pass off as music. \"he needs me he needs me he needs me\" ---What? You can't write another line of verse and find a word that rhymes with \"me\"? And, I didn't realize for the first few unending minutes that Poopdeck Pappy was supposed to be \"singing\" during the long, boring boat chase. Annoying background noise with him complaining about children or some such meaningless banter. The original Popeye The Sailorman song, performed at the end of this horrific mess, was the only thing even remotely true to the cartoon. Williams mumbles throughout the film and Duvall is just plain annoying. She's almost as annoying as in The Shining. This attempt at movie-making was written as they went along. terrible. I can only hope that the special town set they built for this tragedy went to the homeless locals in (Malta, was it?). Someone should benefit from the building of this fictitious town. Certainly moviegoers did not benefit. I was 27 in 1980. I remember walking out of the theater and thinking \" what the heck!!!\" It's on a movie channel right now and I am laughing very hard, both because of some of the reviews I've just read and am torturing myself (AGAIN)while watching a movie that is so ridiculously bad. Robin Williams...please donate your fee you got for this mess to some worthy charity, Maltan refugees."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "strong-122-478885",
        "review_rating": "1",
        "review_title": "That's All I Can Stands... I Can't Stands No More!",
        "review_detailed_main": "This 1980, live-action, feature film called \"Popeye\" is absolute T-R-A-S-H! Absolutely!! Absolutely!! ABSOLUTELY!!!\n\nI guarantee you that there's not a single, solitary funny, or even slightly amusing, moment in this movie's entirety. There isn't. Popeye has got to be one of the ultimate fiasco movies of all time. It wouldn't (and it couldn't) even amuse a 5-year-old child.\n\nFor all the extensive time, effort, and cost that was obviously put into the design and building of the elaborate and goofy \"Looney-Tune\" sets for Popeye, and, not to mention, Robin Williams' special Popeye make-up effects, I'd have thought there'd be, at least, some worthwhile and humorous entertainment value to this flick. But, nope, there wasn't. Popeye was pure G-A-R-B-A-G-E!!.... There's no if's....and's...or, but's, about it.\n\nThe Popeye cartoon character is, without a doubt, one of my all-time favourite, animated heroes. He's such a dynamic and complex sailor-dude. Popeye ranks right up there with Superman in my books.\n\nAnd, yet, in this flick Robin Williams almost single-handedly succeeded in destroying Popeye's wonderful charm and winning character with his cringe-worthy portrayal. Williams was absolutely pathetic as Popeye. He, literally, rendered Popeye contemptible. I loathed the way he tried to emulate Popeye's gestures and imitate Popeye's unique speech pattern and distinctive chuckle.....Blah!\n\nAll anybody, in their right mind, has to do is simply watch any one of Popeye's amazing animated shorts from the 1930's or 40's.\n\nIt doesn't take a genius to immediately realize that there's no comparison here between one of these classic cartoon episodes and this crummy, little excuse of a movie. A simple, short, 7-minute Popeye cartoon from 1938 surpasses this inferior flick by literal miles when it comes to likable characters, genuine humour, and real, honest-to-goodness imagination."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "7",
        "review_title": "Popeye is the guy",
        "review_detailed_main": "I saw this movie as a kid and I loved it, I saw it again just the other day and I loved it even more. I try my best to watch older movies and view them as if I was still in that era. Robin Williams does a phenomenal job as Popeye as does Shelley Duvall as Olive Oyl. Everyone was so animated and comical that you couldn't help but laugh, if not chuckle. There aren't many feuds better than that between Popeye and Bluto. It was great the way they went at it. I liked the acrobatic stunts, the vibrancy of the characters, and the wholesomeness of the movie. It is a movie the entire family can enjoy. I would give it a better score except the singing was so awful. I give it a 7/10."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "moonspinner55",
        "review_rating": "1",
        "review_title": "Blow this one down...",
        "review_detailed_main": "E.C. Segar's comic strip characters Popeye the Sailor Man, his sweetheart Olive Oyl, her dejected fiancé Bluto, the hamburger-eating Wimpy, and the townspeople of Sweethaven fail to emerge in this muddled live-action adaptation, directed by Robert Altman as if he were still doing \"McCabe and Mrs. Miller\". Altman, who doesn't appear to have seen any of the wildly popular Fleischer Studios cartoons which extended the comic strip, doesn't have the buoyancy for a musical-comedy, and the songs by Harry Nilsson are a leaden lot. As Popeye, Robin Williams squints and mutters disgustedly to himself, but he simply doesn't have the material to kick this thing into high gear; Shelley Duvall fares a bit better, yet both performances are ruined by the gloppy cinematography and the scrappy editing. Simply dreadful. NO STARS from ****"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "movifan",
        "review_rating": "6",
        "review_title": "Fun, light, good-natured. A good vehicle for Williams' debut.",
        "review_detailed_main": "This movie marked the debut of Williams, in a role suited to his skills at the time as an actor. He looks the part and has fun with the silliness, making the title character likable. Shelley Duvall matches his ability to make her role as Olive Oil likable and she gets some well-deserved laughs in some scenes. It's just good, clean fun."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Rectangular_businessman",
        "review_rating": "3",
        "review_title": "A fiasco",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "xlut8da02",
        "review_rating": "9",
        "review_title": "An Outstanding Film!",
        "review_detailed_main": "What's with all the bashing? I never get tired of watching this warm, visceral musical that pulls me in with its myriad textures, striking colors, and unpredictable pacing and dialogue which never seems contrived or scripted (and of course was often expertly improvised). It is the unfettered antithesis to all the shiny, over-produced media of our age. No pretty faces. No product placements. No feel of a commercialized film crafted to be anything other than a comedy musical adaptation of one of my favorite comic strips. It adapts the world of E.C. Daily's style, before King Features \"cleaned it up\" for animation. Disjointed, rambling...borderline insane, just like the comic! And the music is bonus all the way through. Quirky, playful, simple numbers that perfectly reflect the feel of the old comic. But then again, I liked Hudson Hawk and the Forbidden Zone, so you probably don't want to listen to me. I'm not holding my breath for a commentary-loaded SE DVD."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "DJJOEINC",
        "review_rating": "7",
        "review_title": "A Cinematic Can of Sweet Spinach",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "manitou-full-moon",
        "review_rating": "5",
        "review_title": "Weird, but oddly entertaining in places",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "dedhead74",
        "review_rating": "",
        "review_title": "Yes, it's different--but so much fun!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "jkanuch",
        "review_rating": "1",
        "review_title": "One of the least entertaining movies, ever.",
        "review_detailed_main": "Rarely does one have the chance to see so much talent and effort being thrown away on such a lost cause....You would think that a movie with such a strong cast and such a renowned director would be at least watchable, but Altman's _Popeye_ is based on such an AWFUL concept that it probably never had a chance. The mumbling cartoon sailor (with a taste for spinich) of the 40's and 50's SINGING in a MUSICAL must rival the storied \"Springtime for Hitler\" in all time bad concepts. Robin Williams is so constrained by his terrible role that even he isn't entertaining, which is a shame considering his comedic skills. This is a horrible, horrible movie."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "bluemeanie-1",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Simply put, the worst movie ever made. It also has the \"honor\" of being the only movie I've ever fallen asleep in. Not that it didn't try: The sets are great, Robin Williams does an admirable job, even if you can't understand a thing he says. One wonders if this were part of his performance, or if they simply forgot to write the script."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "biff-19",
        "review_rating": "1",
        "review_title": "failure",
        "review_detailed_main": "Robert Altman's documentary, catch-as-catch-can, ten-cameras-and-eighteen-microphones approach worked great for M*A*SH, but it was the wrong way to film a live cartoon, which requires more precision -- see Buster Keaton."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "CanDoArtist",
        "review_rating": "7",
        "review_title": "Subtitles make all the difference!",
        "review_detailed_main": "Let me start by saying this is a very strange movie. It tries to respect the original cartoon, wants to sorta be a musical, and overall has a stage play feel.\n\nThe biggest problem is the audio is all but inaudible. Not only does Popeye mumble (as expected), but so does everyone else and characters are constantly talking off screen, which doesn't help. As another reviewer pointed out, turning on the subtitles makes a world of difference. I've seen this movie several times over the years including a screening shortly before it's original release. Until I turned on the subtitles, I never realized Popeye has so many great one liners!\n\nWhich brings us to the highlights, Robin Williams absolutely nailed the role. The sets are gorgeous, and the characters (for the most part) are great.\n\nThe story is pretty good. As good as you'd expect, turning a group of short cartoons into a feature length film.\n\nAt the end of the day it's enjoyable for a lazy afternoon movie. If only the audio was done better, this might even be an 8 or 9 in my book."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "beresfordjd",
        "review_rating": "2",
        "review_title": "hugely disappointing from first frame",
        "review_detailed_main": "What a disappointment! I really want to love this movie but I just cannot. Casting was inspired- Williams is an almost perfect Popeye, Duvall was born to play Olive. Paul Dooley is a great Wimpy but this film does not work for me. I often love Altmans movies-Mash, Gosford Park are wonderful films but the whole tone of this is wrong. The opening sequence is dark and forbidding with a troubled sea and it seems to set the tone. I hate the songs, which are instantly forgettable, and I feel that it would have worked better without the musical element.Every time this appears on TV I attempt to watch it but never get more than 10 minutes or so into it before I lose interest and switch off. Many years ago I saw a section of the middle and that too lost my interest. How people can love Popeye is beyond me. I always loved the original cartoons and they still make me laugh and wonder at the surreal stories and actions. I know the movie as it was made then could never be like that (it could be done now) and I think I understand what Altman was trying to do but I feel it was a disaster artistically as well as commercially. Wrong director for this subject."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "JohnHawk68",
        "review_rating": "7",
        "review_title": "\"Cause the good always win's over the bad\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "terminator-3",
        "review_rating": "1",
        "review_title": "Not a film that does justice to the cartoon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "wickman",
        "review_rating": "10",
        "review_title": "A tragically underrated film, Popeye is actually quite brilliant!",
        "review_detailed_main": "I remember when Altman released Popeye and it was slammed by most critics and ignored by the public. It deserves much better than that though!\n\nFantastic set design, great acting, high production values, strangely off kilter tunes, and just general all around weirdness make Popeye one of my favorites. Brilliantly twisted and twistedly brilliant.\n\nDisagree? Oh well, whatever.....\"I yam what I yam and I likes what I likes!\""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ericstevenson",
        "review_rating": "7",
        "review_title": "This started it all more or less",
        "review_detailed_main": "There appear to be an infinite number of live-action movies based on cartoons and 90% of them are just plain bad. You could probably rank them next to movies based on video games as the worst kind of film genre out there. This was none other than the first ever live-action movie based on a cartoon. As such, is it a case of first installment wins? I mean, I've seen so many downright awful live-action adaptations that are nothing like the source material and are just plain stupid. But really, this film holds up way better than most of those other movies. Again, I'm going to admit some bias with this because it stars Robin Williams. It's great to see him in one of his youngest roles.\n\nWhat I really do love about this movie is how faithful it is to the cartoon. I mean, if you seriously compare the clothes and appearances that it had, you really will find out this movie is pretty spot on. Obviously, it's hard to adapt a cartoon, but they really do want to do it faithfully. It seems like most of these films make the mistake of not being cartoonish enough or being too cartoonish. This really did seem to go pretty well in the middle. For all the slow parts, there were some really good goofy sound effects and cartoon like slapstick. It actually does feel like you're watching the original cartoon. It does hold the distinction of being the highest ranked live-action adaptation on RottenTomatoes.\n\nAnd yeah, it does have faults. It probably could have been trimmed by a half hour as the story seems to get a bit too complicated at times. It's still great to see characters like Wimpy and Lil' Swee Pea represented so well. I really do like the atmosphere of the movie. I especially like the scenes in the diner where they're tossing these cartoonish looking burgers around. It just has a nice quaint feeling to it. It gets best near the end where it really starts to feel like a standard Popeye cartoon. It actually works pretty well as an origin story. You see Popeye meeting the other characters and discovering spinach. I would not go so far as to recommend this, at least not to people who aren't Popeye fans. Of course, in an age of horrendous films like \"Jem And The Holograms\", it's worth watching over and over. ***"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "screenwriter-972-149612",
        "review_rating": "1",
        "review_title": "A Mess",
        "review_detailed_main": "Kids hate it. Adults don't understand it. Comic book and cartoon fans are confused by it. Robin Williams mostly inaudible mumblings don't help but it's not his incomprehensible utterances that kill this film, it's the complete lack of any structure that would tie anything together. It's hard to believe that Robert Altman could have overseen this mess. A terrible film."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Bill-308",
        "review_rating": "",
        "review_title": "The most unfairly maligned film ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "buiger",
        "review_rating": "1",
        "review_title": "Oh my God, this was bad...",
        "review_detailed_main": "I totally disagree with the majority of the critics on this one (oddly enough, this time the majority of the public seems to agree with me...) Altman has always been a Director whose movies to me where at extreme opposites; either very good or very bad. Well, this one definitely falls into the latter category.\n\nThis must be another one of those films I am too stupid to understand. Another \"enlightened piece of art\". On the contrary, I found it to be boring, ridiculous, and to put it short, a complete waste of time and money. I cannot even imagine such a film could appeal to a 3-year old, let alone an adult...There is absolutely nothing that can be salvaged from this movie, not the music, cinematography, costumes, simply nothing."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "isenberg-e",
        "review_rating": "1",
        "review_title": "Quite possibly the worst film of the modern era",
        "review_detailed_main": "Let's put it this way: it is hard to critique a film when you can't understand a word the lead character says! Four of us saw this in a movie theatre and three of us walked out after 45 minutes and waited in the lobby (I have to be honest: the 4th person thought it was hysterical). I have never walked out of a movie before or since, but this one really was awful. They should pay people to see it rather than charge for tickets. No, on second thought, they couldn't pay people enough!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "SalamanderGirl",
        "review_rating": "1",
        "review_title": "I almost laughed once",
        "review_detailed_main": "What went wrong? Robin Wiliams was born to play Popeye, and his comic genius should have blended perfectly into the role. Shelly Duvall actually looks like Olive Oyl. Others were well-cast, including the always excellent Ray Walston. The sets were imaginative, the songs were okay, if not all that memorable. So what happened, that every single moment in this movie became an unbearable eye-sore?\n\nPopeye was doomed the moment Robert Altman stepped onto the set. I cannot understand the loyal following some filmmakers have, blind to the garbage they keep putting out. In my humble opinion, Altman is one of said filmmakers, who's every movie I have seen, again, in my opinion, was garbage. Quintet, M*A*S*H, Nashville and so fourth just sat on the screen like stagnant snails, doing nothing for hours on end. McCabe & Mrs. Miller is the single worst western in film history, and should be a bigger embarrassment to Warren Beatty's career than Ishtar. The Player was nothing more than a self-indulgent parade of celebrity cameos. Short Cuts might have been an okay movie, if perhaps someone had bothered to find an editor and write an ending. Ready to Wear sums up Altman's film career to a tea. Nothing happens for a long time, then someone steps in dog poop... lots more nothing, then someone else steps in dog poop... nothing, poop, nothing, poop.\n\nBut somehow, Altman has this Emperor's New Clothes thing going for him. No matter how bad his movies are, critics praise them, as do his peers. I've personally not met one person, not one, who has any of Altman's movies on video or DVD. Go into any house with a movie enthusiast and you'll likely find films by Spielberg, Coppola, Soderbergh, DeMille, John Huston, Victor Fleming, William Friedkin, Orson Welles and so on. But I've never known anybody with one movie Altman ever directed, and I know quite a few people. Not that his loyal fans don't in fact collect his movies, but I'm happy not to know any of them.\n\nAt least Popeye was just nothing. No poop, just lots of nothing. Pure Altman."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "cynthia-baldon",
        "review_rating": "7",
        "review_title": "It's for kids",
        "review_detailed_main": "This movie was made for children and is for those of us who feel the nostalgia of watching it as children. Reading adult reviews is like listening to the literary merits of Hop on Pop vs The Great Gatsby. It's entertaining. It has cute songs and, except for a few fighting scenes, is appropriate for people of all ages."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "2",
        "review_title": "Popeye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "MichaelMRamey",
        "review_rating": "7",
        "review_title": "Fun Filled Musical",
        "review_detailed_main": "First off let me say that when I first put this on I didn't realize it was a musical. However I enjoyed it. The singing was odd, especially Shelley Duvall's songs, but the oddness of her voice added such an intriguing aspect to the music that you can't help but get caught up in it. You'd think Robin Williams would forever be a character actor after playing Mork and now Popeye, but he sure proved everyone wrong. This is just a fun watch for the whole family and I myself had fun watching."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ShadowWalkingSchemer",
        "review_rating": "2",
        "review_title": "Boring story makes the movie feel like it lasts an eternity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Ryan N.",
        "review_rating": "10",
        "review_title": "\"I ain't no physicist, but I knows what matters.\"",
        "review_detailed_main": "There are two movies I have seen in which every line is good and that I can watch dozens of times without becoming the slightest bit bored. Those are The Big Lebowski and Popeye. I just saw Popeye recently for the first time in about twelve years and I can still recite it line for line from when I was a kid. I must have watched it fifty times (It was my babysitter). After I recently watched it, it was on again later that night and I watched it all the way through again. It's a fantastic movie and I'm blown away that the user rating is so low."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "happipuppi13",
        "review_rating": "7",
        "review_title": "Good but Needed A Little More \"Spinach\" To It",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "M0n0_bogdan",
        "review_rating": "5",
        "review_title": "Popeye",
        "review_detailed_main": "I think the biggest issue with this movie, a movie that never convinced me as a kid neither, it that it doesn't translate the loose semi-improvised dialogue from the cartoon to film. It feels like an afterthought. It does indeed bring back the vibe from the cartoon but it feels out of place here and weird.\n\nAnd what's with the musical numbers? Just bad and as low effort as possible. The casting is indeed great, Robin Williams as Popeye is a slam-dunk and Shelly Duvall as Olive is perfection. But so what? When you have such a meandering mess with the weirdest pace, nothing helps, not even the comedic timing of Williams."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "navin j.",
        "review_rating": "",
        "review_title": "a total trip",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "jnscogan",
        "review_rating": "1",
        "review_title": "easily the worst movie I've actually watched the whole way through",
        "review_detailed_main": "What can be better than 90 minutes of Robin Williams muttering under his breath? How about random, incoherent songs sung by a horrible cast? How about a plot with holes large enough to sail a ship through? Cast you votes now, let's get this one into the IMDB worst 100. There are much better films than this on there!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "rolandhollis",
        "review_rating": "1",
        "review_title": "Poop eye",
        "review_detailed_main": "Well blow me down, this movie is terrible!\n\nFamous for it's awfulness. Popeye is clearly one of the worst movies of all time. There are bad movies which are so terrible that they become amusing. This movie is not one of them. Ten minutes into the film, you'll want to take a power drill to your skill to relieve you of your misery.\n\nThank God for the off switch.\n\nI will gladly pay you Tuesday for the two hours of my life I wasted on this pile of dog excrement.\n\nIt's as funny as canned spinach."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "classldy",
        "review_rating": "2",
        "review_title": "Second to worst movie I ever saw.",
        "review_detailed_main": "This has to be ranked as the second worst movie I ever saw. Robin Williams mumbling through the movie. No semblance of a script no wonder Jules Feffer takes writing blame for this so called script. Harry Nielson should be ashamed of himself for writing the music for this movie. Only redeemable part of this film was Ray Walston he made the movie a little more tolerable"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "PWNYCNY",
        "review_rating": "6",
        "review_title": "Not that bad of a movie.",
        "review_detailed_main": "I liked this movie. I'll say it again: I liked this movie. I'll say it a third time: I LIKED THIS MOVIE!!!! Hey, it's Popeye the Sailor played by Robin Williams, not Macbeth played by Orson Welles or Hamlet played by Laurence Olivier. So lighten up! Okay!!! Don't be so critical!! What did you expect? Robin Williams gives an excellent portrayal of a cartoon character who has to act like he's in a cartoon. Kudos for Mr. Williams and for Paul Smith as Bluto. What makes this movie particularly unique is that the characters actually resemble their cartoon persona WITHOUT the special effects. Now that is impressive. If you like the Popeye the Sailor cartoons you have to like this movie because this movie stays true to the cartoon characters. like Olive Oyl, Wimpy, Sweet Pea and all the other characters. So stop ragging the movie because it doesn't deserve it. The movie is neither pompous nor pretentious and provides what a movie should provide - entertainment."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "satam",
        "review_rating": "1",
        "review_title": "the worst movie of all time",
        "review_detailed_main": "I can remember settling down to watch this with the kids expecting an entertaining couple of hours and then being subjected to a film with no redeeming features whatever. The kids drifted off to do more exciting things like homework after 10 minutes and I was left aghast at the expensive mess unfolding before my eyes. The whole tone of the film was wrong and you wonder why anyone at the time the idea was pitched thought that it could be done successfully.How about a plot?The Popeye cartoons weren't funny to start with so why would live action make them any better?If you are going to do a musical then at least have decent songs or don't bother. I would vote this 0/10 if it were possible and would remind people that life is too short to waste a single minute watching this garbage."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "inkblot11",
        "review_rating": "7",
        "review_title": "A unique movie, not for everyone, one supposes, but quirky fun for film fans",
        "review_detailed_main": "Popeye (Robin Williams) lands in Sweet Haven by the Sea, looking for his longlost papa. But, oh, this town is not friendly. There's a tax for almost everything, including setting foot in the village limits. Nevertheless, Popeye stays and gets a room in a boarding house run by Mrs. Oyl. The room is nothing to write home about yet there is an added attraction. Mrs. O has a daughter, Olive (Shelly Duvall) who is a skinny lass but pleasing to Popeye. Yet, horrors, she is to marry the town's bully, er, commissioner, Bluto. The only thing positive that Olive can sing about Bluto is he is large. Before long, Popeye wins her over, especially when they rescue a baby in a basket, Sweet Pea, and try to stay out of Bluto's way. At this point, Popeye REFUSES SPINACH so, despite his large arms, he can't best Bluto. After finding his wayfaring papa (Ray Walston) he learns some secrets that may help win Olive for himself. Even if there are octopuses circling in the waters! This unique movie may not be for all but its quirky delights and rapid-fire lines will entertain those who like it original. Watch Popeye mutter Au reservoir and you can double over with laughs. Yes, Williams is great and captures Popeye's essence well. Duvall is even better, she was made to play Olive and her voice resemblance to the cartoon character is uncanny. Walston, Paul Dooley and all the rest are fine support. Then, too, the scenery, which was captured on Malta, is wonderfully offbeat while costumes, songs from Niellson, a clever script by Jules Ffiefer and a one-of-a-kind direction by Robert Altman add up to something wacky and fun. If you want to walk to a different beat for a couple of hours, this one is for you."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "CCsito",
        "review_rating": "4",
        "review_title": "One of my childhood cartoon character favorites",
        "review_detailed_main": "The Popeye cartoon character was one of my favorite during my childhood. It made me want to eat spinach during dinner. This version of Popeye is a visual feast - excellent set decorations. Robin Williams plays a credible Popeye character. However, the movie doesn't seem coherent at all and appears like a series of random action sequences. Many of the spoken words cannot be heard distinctly and you needed subtitles in order to know what was said. The movie can be praised for how detailed the sets and costumes that were used to portray the characters and locations from the cartoon series. But, it fails to deliver in plot coherence and spoken script. I could easily understand the cartoon episodes as a child, but I was baffled by the movie version as an adult. I know that making the cartoon transition to the big screen can often times be difficult, but I think they tried to make the movie version too much of a replication of the cartoon episodes and they left out the plot development. If you never saw a Popeye cartoon before and seen the characters for the first time in this movie, you would have a hard time figuring out the personalities and eccentricities of each character."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Fig-6",
        "review_rating": "10",
        "review_title": "A fascinating plunge into an the imaginary universe of \"Popeye\"",
        "review_detailed_main": "Robert Altman's \"Popeye\" is a film to be lauded for its production design and performances. Altman took obvious care in bringing the town of Sweethaven and its residents to life . . . notice the bustling activity, the individual characterizations, and even the big, cartoony special effects (e.g. - Bluto blowing smoke from his ears) that both pay homage to the original \"Popeye\" and separate it as a new direction for the story.\n\nThis well-known story is brought to life by the actors in it, most notably Robin Williams as Popeye and Shelley Duvall as Olive Oyl. Robin Williams, complete with immense forearms and squinting eyes, gruffly plows through his adventures with the same tough sensitivity we've come to love from the character over the years. And Shelley Duvall . . . is simply astounding. She BECOMES Olive Oyl. Her gestures, her speech patterns, her gliding walk . . . it has to be seen! Duvall literally transforms herself into a living cartoon, one we care about more and more as the picture runs its course.\n\n\"Popeye\" is a great conversion, from the comic strip to cartoon to film. With added depth and atmosphere, it remains an underrated classic appropriate for those willing to be transported by art to a fantasy land far , far away."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "fester-5",
        "review_rating": "7",
        "review_title": "Like Popeye cartoons of old.",
        "review_detailed_main": "As many faults as this film had, it still captured the feel of the old strips and original cartoons. It has that slightly surreal wonky feel of a world that is true onto itself. I only wished they could fit the Sea Hag and Alice the Goon into the story. I found the casting was great( loved Ray Walston as Poopdeck Pappy) and the visuals inviting. I felt I wanted to take a vacation in that little village."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "evan-152",
        "review_rating": "3",
        "review_title": "eerily bad",
        "review_detailed_main": "Everything that could possibly be bad about a movie culminates in this mesmerizingly horrid stream of unconsciousness. Williams and Duvall are clearly the best choice for the time, yet the whole thing plays like an amateur high school production. The background characters fight for the most unnecessary mug to pull attention, the music is atrocious, the sound track is strangely quiet and confusing, and too much of the dialogue is left in the hands of the improvisationally challenged. Every frame is a triumph of awkwardness.\n\nThis movie is the perfect example of bad directing. Every recognizable actor in this movie has done well in other roles, in other films. Yet here, they all seem to be acting in their own personal void, like a room of cats asked to perform choreography; no rhythm, no synthesis, no unified purpose. Only Robert Altman can produce such an attractive travesty of cinema. Seems like a lot of thought went into camera setups, scenery, costumes and color, and the actors were ignored. Like the high school play, the audience wants it to be good and memorable, but ends up cringing as each opportunity for praise is squashed by the performance. Every serious filmmaker should see this movie at least once, to feel what it's like to moan at a screen for 90 minutes."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "spectre316-1",
        "review_rating": "",
        "review_title": "weird",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "derbycityusa",
        "review_rating": "1",
        "review_title": "Beauty may be in the eye of the beholder, but some of these critics are definitely blind!",
        "review_detailed_main": "The old adage is true...the pen is mightier than the sword! Living proof of that is found here, amongst the reviews several people have written as it pertains to the movie, POPEYE. Why do I say that? because these reviews are killing me! No, really, it actually amuses me to see some of the people reviewing this film claiming it's a masterpiece! It reminds me of a joke that was played on art critics in Paris back in the early 70's, whereby they had monkeys create \"abstract\" paintings and than had several renowned art critics review the work. Most of the critics lauded over it! When confronted with the truth, most even attempted to defend their opinions. The movie POPEYE? It was just like the \"abstract\" paintings the monkeys created. It was crap! Nothing more, but maybe something less!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Wuchakk",
        "review_rating": "4",
        "review_title": "It needed a more compelling story",
        "review_detailed_main": "Robert Altman's \"Popeye\" (1980) features Robin Williams in the titular role, Shelley Duvall as Olive Oyl, Ray Walston as Pappy and others as Bluto, Wimpy and so on. These actors are outstanding as these characters, particularly Williams and Duvall. Unfortunately, I found the story boring and the excellent seaside Malta set too confining and therefore increasingly dull. If Altman would have included a more compelling story it would've worked better for adults. As it is, its appeal is limited to small kids, hardcore Popeye fans and devotees of Williams.\n\nThe reason 1994's The Flintstones\" and even the 2000 sequel worked so well (for me anyway) was because they both had interesting and entertaining stories. \"Popeye\" is dull by comparison, although somewhat amusing. If my wife -- who loves the movie -- wasn't with me I would've never gotten through it.\n\nThe film runs 114 minutes (too long).\n\nGRADE: C-"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "evanston_dad",
        "review_rating": "2",
        "review_title": "\"Quintet,\" I Apologize -- THIS Is the Worst Altman Film Ever Made",
        "review_detailed_main": "Oh, Robert Altman, I love you and may you rest in peace, but DAMN did you make some bad movies.\n\nI've been re-watching Altman's entire oeuvre on DVD lately (or at least the movies available) and have had to seriously reconsider my ranking system. I had thought that \"Quintet\" was the nadir of his 1970s film career, but I had forgotten just how atrocious \"A Wedding\" is. But then I re-watched \"Popeye\" and think that there's a new serious contender. It's almost like after making \"Nashville,\" Altman set out to one-up himself in bad movies, and see just how much worse each could be than the one before it. (Though I have to exclude \"3 Women\" from this -- a remarkable film).\n\n\"Popeye\" is an example of what happens when Altman's rambling style goes completely wrong. The film is a shambling mess, with not much discernible plot, and it's almost the exact opposite of the cartoons on which it's based. Those were little jewels of narrative economy -- even a movie made for kids needs to be well written. Robin Williams is a riot as Popeye, and his constant muttering is easily the best thing about the movie. It's also worth watching to see Shelley Duvall in the role she was born to play, and she does it almost too well, making Olive Oyl just as annoying in human form as she was as a cartoon. The Harry Nilsson songs are terrible, and they're not really even songs. Characters occasionally walk around sing/talking, but the songs, like the film, have no structure and just sort of end. Ray Walston, as Popeye's pappy, infuses the film with some verve, but he enters the picture too late to save it. The set looks like the leftover remnants from \"McCabe and Mrs. Miller\" (look for a blink-and-you'll-miss-it reference to that film in a whorehouse), and I think many of them were resurrected for \"Waterworld.\"\n\nThe thing with Altman's bad movies, though, is that they're so confidently and spectacularly bad that they almost become entertaining. The ending of \"Popeye\" is a disaster, but it's so fascinatingly disastrous that you can't look away. That's almost more of a testament to Altman's skill as a director than any of the brilliant classics he made.\n\nGrade: D-"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "redryan64",
        "review_rating": "6",
        "review_title": "Sorry! There's No POPEYE Cartoon time here; except for the opening credits, right Schultz?",
        "review_detailed_main": "OVER the years there have been many a sleeper character introduced to a continuing action storyline who overshadows the original, intended series star; claiming at least a share of the featured spotlight for himself. This is a universally true experience, being whatever media. We've good examples in printed media (both prose and visual forms), cinema, radio or television.\n\nHENCE, we've had the rise to preeminence by characters in Radio-TV Broadcasting world such as George \"Kingfish\" Stevens in AMOS 'n ANDY, \"the Fonz\" in the HAPPY DAYS TV Series, as well as Erkel in the latter day FAMILY MATTERS Sitcom; also on the Tube.\n\nIN each case, the character in question rose to a higher status via his popularity with the public. Hence, we saw the storyline on the older AMOS 'N ANDY Radio Show go from the interplay between the two title characters, in which the character of Andy went from being the wise guy who was constantly out to cheat his partner, a very gullible and trusting Amos to a perennial storyline in which Andy most usually played the patsy to the super conniving Kingfish. Meanwhile, Amos evolved to a level headed, family man complete with wife, Ruby and Daughter, Arabella, This is the format that we're most accustomed to; as it was the stage of development that the series was in when it made the leap to the Television Tube.\n\nBOTH the character of Arthur Fonzarelli (Fonzie) on HAPPY DAYS and Ron Erkel on FAMILY MATTERS just rode the crest of the wave of fan popularity from supporting characters to the status of near co-star.\n\nSO it was on in the realm of the printed page; with the development of the Daily and Sunday Newspaper, continued story comic strips. There were occasional characters that rose high above the popularity of the original \"Stars\" to the position of numero uno. As an example, BARNEY GOOGLE first gave co-star billing to before being virtually run out of his own Comic Strip by his Hillbilly buddy, SNUFFY SMITH.\n\nTHAT brings us to today's subject, the live action movie of POPEYE (Walt Disney Productions/Paramount Pictures Corporation, 1980).\n\nWE'RE all familiar with the Sailor Man's legendary feats; but we may be a trifle foggy on his origin. (Do those of you still reading get that sneaking suspicion that you're gonna git a reminder? Well, you are!) Hearkening back to the post World War I days of 1919, a staff cartoonist for Hearst Publications' Chicago American, a young cartoonist from Downstate Chester, Illinois, Elzie C. Seegar, began a daily comic strip which featured the adventures of one Castor Oyl, his sister, Olive Oyl, her beau, Hamm Gravy and others. Entitled THIMBLE THEATER, it soon caught notice of the main editorial office of Hearst's King Features Syndicate and was run in Hearst Papers throughout the land; as well as being offered for the u$ual fee$ to other papers.\n\nIT was ten years later, in the early days of 1929, that a walk-on character, a funny lookin, bow-legged, squint-eyed, balding, red-headed sailor, \"came on board\" (so to speak). It wasn't very long before POPEYE was the dominating force and Star of the Strip (although it retained the title of \"THIMBLE THEATER\", it added \"Starring Popeye the Sailor Man\".\n\nPOPEYE was such an instantaneous hit that he was soon starring in his own Max and Dave Fleischer Studios-Paramount Pictures Cartoon Series. Radio, Comic Books, Television and a whole sh*t house full of merchandising toys, puzzles, vibrators, etc., etc.\n\nTHE day finally arrived and the time seemed ripe for a live action go round at a POPEYE Movie Musical. So they did it.\n\nAS a mutual collaboration between Walt Disney Studios and Popeye's old Big Studio, Paramount Pictures Corporation., we were treated to POPEYE. It stars Robin Williams as Popeye and what must be considered to be a most remarkable cast. The supporting players and their parts were: Olive Oyl (Shelley Duvall) Poopdeck Pappy (Ray Walston), Wimpy (Paul Dooley), Bluto (Paul L. Smith), Castor Oyl (Donovan Scott), Rough House (Allan F. Nicholls), Swee'pea (Wesley Ivan Hurt), Hamm Gravy (Bill Irwin) and many others too numerous to bore you any further.*\n\nWHEN mounted, put together and staged for the camera, it has the look of a Broadway Musical. In a way it appears to resemble the filmed version of L'IL ABNER (Triad Prod./Paramount Pictures,1959).\n\nWE must confess that upon the completion of our first viewing, back some 28 years ago, we didn't care much for it. We found it a little l-o-n-g and d-r-a-w-n out. None of the songs seemed to resonate in our memories. We sort of panned it then; or at least would have if we were writing these reviews then.\n\nHOWEVER, just like the NFL, we now say; \"\u0085..upon further review\u0085..\" We recently watched it on the tube on a rather old VHS copy. Well, we aren't sure if we've matured some since those bygone days at that Matinée at the Evergreen Plaza's Cinema, with our young 'uns or perhaps this time I ain't so tired from having worked the graveyard shift; but it seemed much more enjoyable!\n\nIT could also be that we now sort of understand just what this 'FILM', with the services of Robert Altman as Director and screenplay penned by the old Master himself, Jules Feiffer, was an attempt to salute both Popeye and Mr. Seegar with its ascension to the highest level of art that was possible for a wee, humble little THIMBLE THEATRE of a Comic Strip.\n\nNOTE: * If you're so interested, just read the credits like me and Schultz always do, It's always worthwhile and occasionally it provides one with some little morsel of info heretofore unknown to yourself.\n\nPOODLE SCHNITZ!!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mohnomachado",
        "review_rating": "4",
        "review_title": "Take a Hit 🌳 and it Will Make More Sense",
        "review_detailed_main": "Altman goes Disney and I have to say it's quite the mess. Robin Williams tried his best to bring Popeye to life, but I just don't think the character translates well to film because he is a literal cartoon. That means showing some of the outlandish things that cartoon characters can do can look off-putting on film. In this specific one, Popeyes arms are massive just like in the cartoon, but it comes of the screen as fake and obscure. Shelly Duvall is reduced to a Mary Sue type role which I guess is cartoon accurate, but again, this does not translate well to film and hasn't aged well at all.\n\nI have to admit that I liked some of the set design and the levity of the picture, but I couldn't take this seriously while watching it for the first time at the tender age of 23. Maybe this was not targeted for my age group and that's why I had a tough time with it. Pass on this unless you want to experience an 80s children's movie. If you're sober though, I wish you luck on your adventure because this picture is whacky."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "deenparast",
        "review_rating": "7",
        "review_title": "Great Musing at end",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "tylerrosin",
        "review_rating": "2",
        "review_title": "A very weird and nonsensical movie with no substance",
        "review_detailed_main": "I powered through this mess of a movie. It's very interesting to see that there are a lot of people that loved this movie for whatever reason. I forced myself to watch the horrible songs, terrible dubbing and dull and boring plot with god awful acting. The real only positive I saw was the costumes and set design as the town they built was very pretty and looked great and the characters were larger then life. For the majority of the film nothing happened and people just rambled on and acting like idiots. I always try to find something good about a movie but this one I was stretching. Robin Williams tried but this movie could have been way better."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ccthemovieman-1",
        "review_rating": "8",
        "review_title": "Glad I Finally Got Around To Viewing This",
        "review_detailed_main": "I never saw this movie until last week. \"Better late than never,\" I guess, because I liked it. I thought it was good and....in a very different way. I had known of this film for a long time but did not realize it was a musical. That didn't excite me, but I wound up enjoying most of the music because it was only done in short segments and the songs were decent. None were excellent, but none were awful, either.\n\nPopeye was fun to hear. Robin Williams had Popeye's mumbling down to a tee. I suggest you watch this with the English subtitles on so you can get all of what Popeye says, or you'll miss a lot of funny lines because of his mumbling. The same can almost be said of Shelly Duvall's impersonation of \"Olive Oyl,\" although you can understand her better. She, too, was fun to watch. I read somewhere that she was very depressed over her performance in this film, but she shouldn't have been. She was perfect for the role.\n\nI didn't think the supporting characters were much, such as Bluto or Wimpy, but Popeye's dad, \"Poopdeck Pappy,\" (Ray Walston) who appears late in the film is a real hoot, and little baby \"Swee Pea\" is cute. \"Pappy\" adds a lot of spark and energy to the film, just when it was really needed. My only concern was that it was a really clean movie up to then and Walston changes that, although not with anything really harsh but a number of \"let's haul ass\" statements and the like.\n\nHowever, overall, it's a nice, pleasing type of film. It's no award-winner, but it's a lot better than what you might have read from national critics. If you like Popeye's cartoons and comics, you should like this film, too. I would gladly watch this again."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "pmtelefon",
        "review_rating": "7",
        "review_title": "Altman gets an E for effort.",
        "review_detailed_main": "I've been enjoying \"Popeye\" more and more over the last few years. It's a near miss for me. At times, I think it is overproduced. Other times, I think Robert Altman was the wrong director. But tonight, I thought it was a pretty funny, well acted, beautiful looking movie. Tonight, for the first time ever, I liked watching \"Popeye\". Honorable mention: Shelly Duval."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "bennett_graeme",
        "review_rating": "3",
        "review_title": "A disgrace to the original cartoon strips.",
        "review_detailed_main": "Popeye is without doubt a total waste of space. What on earth Robert Altman was thinking of, is beyond me. Popeye will forever, as far as I am concerned, be best as a cartoon strip. This attempt to mix live-action with cartoon capers, at best jars your nerves, and at worst sends you screaming for your psychiatrist. It just does not work on any level. Even the usual reliable Robin Williams is a fish out of water who seems to be dying a horrible death. Which is just what this film should have done, back in 1980."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "SanDiego",
        "review_rating": "",
        "review_title": "Newspaper comic strip makes for outdated but charming film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "This dull and listless film COULD have killed Robin Williams' career",
        "review_detailed_main": "This movie is an incredible reproduction of an old Max Fleischer Popeye cartoon...combined with the original characters from the original \"Thimble Theater\" cartoon by Segar. Every last painstaking detail is there and the movie looks like you have fallen into a color version of one of these short cartoons. And with this, we come to the heart of the problem. The Popeye cartoons were a bit bland to begin with but they only lasted about 8 minutes but this flick lasts nearly 2 hours!!! To base one movie on ONE joke (and not a funny one at that) is to create an endurance contest for the viewer. I couldn't stand how bored I became and ultimately turned off the video. So, in all fairness, the last 20 minutes COULD have elevated this movie to a 2 or 3-star rating but based on the tediousness I witnessed, this is extremely unlikely. Watch this only if you are an insomniac or are an absolutely die-hard Popeye fan. Don't say I didn't warn you!\n\nUPDATE: A friend of mine, Angelo, loves this movie and insisted I give it another try. Well, I did and still found it incredibly slow...too slow to recommend it. However, I do think my original score of 1 was unfair and I've changed it to 3 simply because although I didn't like the film, the costuming and sets were incredible. I still can't see why they made such a film in the first place and I am sorry, Angelo, but the film did not win my heart....even after a second viewing.\n\nBy the way, I noticed this time that Robin Williams' version of Popeye seems to have a massive infusion of Leo Gorcey as well. This isn't so much a complaint...just noticed a lot of Gorcey's malapropisms (i.e., substituting the wrong word for common similar sounding words in his speech)."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "linysd",
        "review_rating": "1",
        "review_title": "Exaggerated Dumb Body Movement",
        "review_detailed_main": "All the characters repeatedly bounced off each other in exaggerated stupid nonsense movements that don't exist in real life. Bouncing off doors, ripping doors off walls, falling, jumping out windows, squishing, grunting, spinning, twirling, tripping, it's all so stupid, especially when Olive Oil spins in circles on the dock with Popeye. This movie sucks. The lack of storyline and dialogue makes it suck even worse."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "TheOldGuyFromHalloween3",
        "review_rating": "1",
        "review_title": "Perfectly cast yet still lousy",
        "review_detailed_main": "Williams and Duvall are the perfect choices for their roles but this movie is still awful. Maybe because Altman is totally miscast as director.\n\nA bunch of old-timey weirdos fall down, stumble, knock things over and act like fools for 2 hours. Their antics make the 3 Stooges look like Shakespeare. But fortunately everyone talks at the same time or mumbles so you can't hear the awful dialogue. Unfortunately the musical numbers are able to be heard."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "hollandvillage",
        "review_rating": "7",
        "review_title": "Movie rendition stays true to the Original Popeye Cartoon Series & that just pretty much that",
        "review_detailed_main": "Born in the 70s & growing up in a time period where the Popeye cartoons was so popular back in those days on the mainstream TV, I am definitely familiar & in love with the cartoon series. The movie rendition has definitely stayed true to the cartoon series, from the movie sets to the characters' portrayal of their individual characters. Even the little nuance to the movements and sounds made by the actors were closely resembled to their cartoon characters. It was definitely refreshing & interesting, having an opportunity to see the cartoon series, being brought alive on the movie screen (or TV screen in this case). This movie also brought back a lot of memories for me, when I owned the Nintendo \"Game & Watch\" Popeye version of the game in 1982. Back then, as a child, I was so crazy over the games, playing it at home & in school, whenever I had some free time.\n\nHowever that being said, I soon find myself losing interest after 30mins or so. I actually find it quite torturing to sit through the entirety of the movie, which runs for about 2 hours. I do appreciate the fact that the entire movie is actually made up of a few story lines being linked up together to form the entire movie. It will make sense as the normal cartoon series is usually about 30 mins or so per episode.\n\nAlso, I finally has the chance to watch this movie in the year 2020, forty years after when the movie was first made. It soon become clear why Popeye has lost it relevancy in today's modern society. All the characters are pretty one dimensional. You get the Popeye (i.e. the good guy), Bruno (i.e. the bad guy) & Olive is just the whining & pretty much useless & somewhat irritating girlfriend (or wife, which I am still unsure of up till now), that is constantly waiting for Popeye to save the day. There is no layers to the story line or character development whatsoever.\n\nAs I am writing this movie review, I am pretty much halfway through the movie. Not even sure whether I would like to sit through & finish the entire movie. Hmmmm......"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "elicopperman",
        "review_rating": "3",
        "review_title": "What a Disgustipated Embarrasinkment",
        "review_detailed_main": "Although many people love and cherish Popeye the Sailor from his animated classics, most people tend to forget that the lovable deformed buff sailor man was a comic strip character first. So in the case of this movie, Paramount chose to be a little more faithful to the comics than the animated cartoons. With Robert Altman as the director, Jules Feiffer as the screenwriter, Harry Nilsson as the song writer, and an all-star ensemble like Robin Williams as the iconic sailor, this would almost seem like a sure fire hit....and yet, when watching the movie, one wonders how they could have screwed everything up so embarrassingly.\n\nThe film follows Popeye looking for his lost pappy in the port town of Sweethaven, falling head over heels for Olive Oyl who is engaged to the mean roughhouse Bluto, and raising an abandoned baby named Swee'Pea. It isn't until Bluto kidnaps Olive and the child when Popeye takes action to save the ones he loves. Seems like a strangely simple premise for a feature length film, but believe it or not, the movie makes a bigger deal out of the runtime than you'd think. This results in the biggest problem with this Popeye movie: it's too drawn out for its own good. Many key character moments are slogged out by a snail's pace or some of the worst musical numbers ever made for any film. What feels like it could've been a quickly paced thrill ride of fun and mishap takes itself too seriously for its own good, so whenever the film attempts to be cartoony through slapstick and fighting, it usually falls flat and not even all the goofy sound effects in the world can save them. Not going to lie, you could trim the nearly 2 hour runtime to just 80 or 90 minutes, and little would be amiss.\n\nGiven that this film is based more on the E.C. Segar comic strips, it is neat that the film brings people like the Oyls, Poopdeck Pappy and Ham Gravy to life on the big screen, and yet they barely do much of anything to warrant any intrigue from the audience. Whenever anything comes up that allows them to shine, it either has nothing to do with the plot, or just insinuates ennui instead of humor. One wonders if Jules Feiffer's episodic screenplay could have worked with more momentum, because it takes until the latter half for anything suspenseful to happen, which even then isn't worth riding home about. As for the aforementioned songs by Harry Nilsson, they fall into the trap that no musical should ever do: pad out the runtime instead of being in lieu of character exposition. It's hard to even remember them since they go by like some tired middle school act, especially with the repetitive lyrics and uninspired choreography. If this movie is meant to be a wacky upbeat musical comedy, then it feels like someone sucked the fun right out of it, because upbeat is the last word to describe this borefest.\n\nIf there's anything to give the movie credit, at least the production design looks well crafted and the cast did the best with the trite material. The real star of the show is Robin Williams who really brings Popeye to life through a charming aggression and stingy mannerisms, like how we know the robusk sailor to be. In addition, Shelly Duvall is pleasantly annoying as Olive Oyl, Paul L. Smith is appropriately rough as Bluto, Paul Dooley did seem to have fun as Wimpy, and the baby who played Swee'Pea has enough adorable facial expressions to warrant chuckles. The sets built for the town of Sweethaven are very impressive, as it does feel a lot like a coastal community where each building serves its own purpose, be it a motel, a restaurant or even a gambling parlor. Unfortunately, that's where the positives end, as even through the lush environments and charming actor eccentricities (Williams did a lot of ad-libbing for Popeye), the third-rate treatment almost wastes the incredible talents due to how little there is to gain out of this sinking ship of a movie.\n\nShort summary of the movie, in the words of the beloved sailor himself, \"that's all I can stands, and I can't stands no more!\" While made with good intentions and some talent shining through, the 1980 Popeye movie remains an embarrassing failure to bring the iconic character to live-action cinema due to an uneven script, tedious pacing, insipid comedic action and barely existent songs. I can somewhat understand the cult following the movie has nowadays, but I'm more on the side of the critics and audiences back when the movie originally came out. I guess not everything can be strong to the finach in terms of success."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "elo-equipamentos",
        "review_rating": "6",
        "review_title": "Not despicable flesh and bone version of beloved sailor Popeye!!!",
        "review_detailed_main": "Who doesn't remember the cartoonish character Popeye in those comic strips and later in cartoon on TV, the successful squint eye, big arms, spinach hater-stereotyped character is fully embodied by Robin Williams and his opposite Olive Oyl by the skinny Shelley Duvall, it was hard beaten by the critics at release time, instead in box-office the great majority of the audience went massively at theatres to see the flesh and bone version of beloved sailor.\n\nAccording some source a huge budge of 20.000 millions dollars were spent to make those lavish set of SweetHaven seashore village, also interiors at Paramount studio, average make up on Popeye's beefy arm, outstanding special effects on spinning pipe and other characters as well, Robin Williams played an eligible sailor hero, despite some criticism by some bitters, all those outlying supporting cast as Bluto (Paul L. Smith) and a missing Pappy (Ray Walston) were great as the remainder supporting casting.\n\nPopeye I'd watched in late 1991, at last it sailing here in Brazil fully restored on widescreen format with the classic dubbed version (of course) for the same guy on cartoon, it sounds a reliable effort to bring it on Big Screen this unforgettable hero from our childhood.\n\nThanks for reading.\n\nResume:\n\nFirst watch: 1991 / How many: 2 / Source: TV-DVD / Rating: 6.5."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Keester",
        "review_rating": "4",
        "review_title": "The set and props",
        "review_detailed_main": "The real star is the set and props. Those who designed and built them are masters of their trade. Worth watching just for that as the script and actors leave a lot to be desired."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "hes3",
        "review_rating": "8",
        "review_title": "This movie may have been poorly received because it was misunderstood.",
        "review_detailed_main": "The first time I saw \"Popeye,\" I though it cluttered visually and audially, not believable, and downright silly. When I later realized it was meant to be viewed as a \"living cartoon,\" I did a 180 on it.\n\nThe visual clutter I began to see instead as the delightful and detailed set that was Sweethaven - \"early demolition,\" indeed! That, combined with a rich selection of both staple Popeye secondary characters like Wimpy and new ones like The Taxman formed a fitting backdrop against which the interaction of the main characters takes place. Some of the audial clutter was simply Robin Williams duplicating with uncanny accuracy the verbal ramblings and running \"dialog\" that Popeye always had going on in the cartoon shorts (can't imagine anyone other than him in the role).\n\nAnd, bits\" too numerous to mention, pulled right from the cartoons, add to the fun. Bluto \"seeing red\" is just an example.\n\nA sadly under-appreciated movie, to be sure. If you loved the cartoon shorts, you'll get what should prove to be a satisfying dose of live action duplication with \"Popeye.\""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "IonicBreezeMachine",
        "review_rating": "7",
        "review_title": "A flawed but very sincere adaptation that exudes love for the source material thanks to solid directions and great performances",
        "review_detailed_main": "Popeye arrives in the relaxed town of Seahaven which is under the harsh thumb of the enigmatic Commodore with the intention of finding his long lost father. Along the way Popeye becomes involved in a series of misadventures, including a love triangle between Olive Oyl and the bullish Bluto, adopts an abandoned baby named Sweetpea with a knack for picking winning horses, sunken treasure, and various other situations.\n\nOne of two joint productions between Paramount and Disney during the 80s as a way for Disney to dip their toes in more ambitious live action content that didn't fit their company identity(the other being Dragonslayer), Popeye is a likable and heartfelt musical comedy that is sometimes unfairly maligned due to its much slower and relaxed pace that's more in line with the Popeye comic books than with the much more well known Fleisher Cartoon shorts. While the movie is uneven and very episodic without much of a main plot thread moving the film along, the movie is also a very pleasant sit thanks to the sure handed direction of Robert Altman and the irresistable chemistry and comic timing of Robin Williams and Shelley Duvall as Popeye and Olive Oyl repspectively.\n\nThe movie came about after Paramount lost a bidding war with Columbia for a film adaptation of the musical Annie, so the decision was made to produce an original musical based on Popeye since Paramount owned theatrical rights from the distribution of the Fleisher shorts. In my own opinion, Paramount losing the bidding war was a blessing in disguise as the films songs by Harry Nilsson while not exactly earworms, still make for pleasant listening and fit the relaxed episodic approach well in contrast to the rather shrill and high pitched score of Annie.\n\nRobin Williams is absolutely fantastic as Popeye and makes a good impression in his first theatrical headline after making himself known in the respectably successful Happy Days spin-off Mork & Mindy. Ironically despite playing a character known for energized cartoons Williams(wisely in my opinion) plays the character much more subdued than his Mork character but does a good job of emulating Popeye's trademark mumble speak to great effect. Shelley Duvall is equally good as Olive Oyl, as she effortlessly mimics the smooth and rubbery movements the character is known for while still making the character her own with her character doing non stop talking in a high pitch that maintains the delicate balance needed to keep the character from becoming grating and maintaining likability.\n\nPopeye will not be a movie for everyone as its slow pace and episodic structure may prove a challenge for some viewers, but for those who don't mind a more relaxed pace Popeye offers a vibrant living world filled with colorful characters, nice songs, and a genuine sense of heart that makes the movie hard to dislike."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "powercap2000",
        "review_rating": "1",
        "review_title": "John Lennon in a cameo?",
        "review_detailed_main": "Did I see a guy who looked like John Lennon in this movie in a cameo? During the boxing scene? This movie was released in 1980, but I don't know when. I'm sure it was filming before he was killed. Maybe I was just a little too spaced when I watched it, but it kind of looked like him. And the fact the Harry Nilsson did the \"music\" and was Lennon's friend is kind of a coincidence perhaps. I never saw this when it came out, although I remember it being hyped crazy. Horrible flick, really, too stupid to be surrealistic. But some pretty good casting. I do love Robin's Popeye mumbling smart-a_ss remarks. And Shelly Duval as O.O; well God couldn't make a casting choice any more perfect."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "FilmWiz",
        "review_rating": "",
        "review_title": "I'm Popeye The Sailor Man! I'm Popeye The Say-lor Man! I'm Strong To Dee Finnish \u0091Cause I Eat Me Spinach I'm Popeye The Sailor Man!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "gridoon2025",
        "review_rating": "4",
        "review_title": "Will give you a headache",
        "review_detailed_main": "A live-action version of Popeye was probably a bad idea to begin with, but Robert Altman's cluttered, strangely claustrophobic (despite some outdoors location work) approach certainly does not help matters. The film is too adult for kids, too kiddie for adults. The off-key, nonsense-lyrics songs are fun - for a while. Shelley Duvall is wonderful as Olive Oyl and Paul Smith is also perfectly cast as Bluto, but Robin Williams was a questionable choice for the title role, and his dialect is irritating. You can watch several old Popeye cartoons in the time it would take you to watch this film, and that would probably be a better use of your time. *1/2 out of 4."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ashleyburgia-78344",
        "review_rating": "2",
        "review_title": "I only got 5 minutes in and then I had to turn it off",
        "review_detailed_main": "I don't know who thought it's be a brilliant idea to resurrect Popeye 40 years after he premiered, but this was so bad I couldn't watch more than the opening. It was pretty dull slapstick, and the audio quality was bad - it looks like it was recorded secondhand in a studio and dubbed over."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "artdonovandesign",
        "review_rating": "2",
        "review_title": "An absolute messs of a film....",
        "review_detailed_main": "I was truly stunned by some of the 10 Star reviews, some going so far as to call it a \"masterpiece\". I personally found it to be a cinematic mess in every respect.\n\nThe opening scene inexplicably began with a song from the cast members- and a really bad song at that, as well are all of the tunes in this misbegotten feature film.\n\nAbout my review, I really don't know where to start. I guess I'll begin with the lighting designer. Each scene was drenched with a dull, overall light that was absolutely witless. It made each scene almost intolerable to watch. Combine that with the most moronic of plots and we're already off to a really bad start.\n\nI grew up with the original Popeye cartoons and they were brilliant! With art by Tom Johnson and directed to comedic perfection, the thought of producing a live action film remake is already heresy in my eyes.\n\nOh, what the heck. Let me simply finish by saying watching \"Popeye\" was a truly painful experience and I'll just leave it at that."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "kluhyarg",
        "review_rating": "6",
        "review_title": "Good, but not great",
        "review_detailed_main": "This movie has its charms, but some flaws too. The casting is excellent with some great performances specially Robin Williams, but the script needed some fixes, mostly in the last third.\n\nSome of the songs are good, others OK, but none is bad. The side characters (the ones that are not in the cartoon) like the Olive family didn't add much to the movie. At the end there was too much characters and I didn't see why they were still there... In my opinion it would be better if they had less screen time.\n\nGood movie, not a masterpiece as some says, neither awful as others says. It's worth a watch,"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "prosebank",
        "review_rating": "2",
        "review_title": "The first movie I ever walked out of.",
        "review_detailed_main": "When this movie came out, I was 10. I loved the B&W Fleischer \"Popeye\" cartoons; I loved Robin Williams at \"Mork\", and I loved musicals and comedy, so I figured it would be great.\n\nWRONG!\n\nTen minutes in, I experienced something new: the realization that I was watching a movie that just didn't work. I didn't know why it didn't work; I just knew that it didn't. I gave it a fair chance, but after about 45 minutes, I just wanted to leave. My dad & my little brother felt the same way.\n\nI'd never walked out of a movie before, and I've only ever walked out of about 3 movies since then.\n\nI've tried watching \"Popeye\", when it's been on TV, but it still just doesn't work for me. But now, I have the knowledge and experience to know why: It's a mess of styles & concepts; it tries way too hard, and the characters are all far too freakish to fit into a live-action world...but too human to fit into a cartoon world.\n\nCharacters in a cartoon are meant to be freakish, because the world of an animated cartoon is, by its very nature, completely different from the real world. That's why any attempt to adapt an animated cartoon into a live-action movie is doomed to failure---even now, with all the CGI capabilities that didn't exist for \"Popeye\".\n\nI like Altman's films. His final one (\"A Prairie Home Companion\") is one of my favourite films. But \"Popeye\" was his most spectacular mistake."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ray53208",
        "review_rating": "7",
        "review_title": "Timing is Essential",
        "review_detailed_main": "Perhaps this movie was ahead of its time. A precursor to today's more interpretive and humanizing comic book movie. The characters cannot be interpreted using the paradigm of the source material. Instead see that if the audience is to participate in the hero's journey and suspend disbelief in order to come away with something, the characters must be more than caricature. Idioms and quirks intact of course, but also a heart and soul that is authentic. Otherwise it descends into mere parody.\n\nWilliams' performance is if anything authentic and soulful. Incredibly faithful to the character of Popeye and yet three-dimensional. Setting the tone for Williams' commitment to character that was to become a benchmark in comedic acting.\n\nThe film is Altmanesque in its bold exposure of the beauty in human frailty. In being ridiculous in order to achieve an honest reflection of the human condition."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ignatz928",
        "review_rating": "5",
        "review_title": "Robert Altman's Popeye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "aicram",
        "review_rating": "10",
        "review_title": "wonderful!",
        "review_detailed_main": "This is one of my all time favorites. It is both over the top and subtle. There is so much going on...that you can watch it many times and see something new each time. The acting, the sets, the costumes and most of all Harry Nielsen's music, give so many layers to this underrated movie. Shelley Duval's song, He's Large, is such a gem. She can say nothing positive about her beau...much as she tries and wants to impress her friends...except that...he is large!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "CatSpringer",
        "review_rating": "6",
        "review_title": "I Yam What I Yam, just don' ask me to do any singink, ugugugugug!",
        "review_detailed_main": "One thing right off the bat: This has the worst songs of *any* movie musical, period. Harry Nilsson, shame. On the other hand, what casting! Shelley Duvall is an inspiration, and provides the ultimate in definitive interpretations as Olive Oyl. But Robert Altman (\"M*A*S*H\", \"Nashville\") as director? More, Jules Feiffer (\"Carnal Knowledge\") as screenwriter? Aren't these guys known for their cynical, alienated take on humanity? Still and all, this is a sweet-natured adaptation with Altman's characteristic \"let the lunatics run the asylum\" directing style allowing top drawer character actors to run rampant over otherwise drab sets. The movie yam what it yam. It yam fun."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "gridoon",
        "review_rating": "4",
        "review_title": "Strangely mixed...",
        "review_detailed_main": "\"Erratic\" is the most appropriate word I can think of to describe this truly bizarre, mostly unsuccessful attempt to \"musicalize\" the (apparently initial) adventures of the famous title cartoon character. The typecasting is excellent and the \"live versions\" of Popeye, Olive Oyl and Bluto are very close to our imaginary ones.. But Robert Altman doesn't seem to be able to decide what audience he wants to aim his film at; there is an excessive amount of unpleasantness and not enough fun for \"Popeye\" to be enjoyable for small children, but the adults, too, will probably be interested only sporadically in such silly material. \"Popeye\" is neither cartoonish enough, nor mature enough. One thing is clear, however; you'll have to search hard to find another musical with such dreadful songs! (**)"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "driker2",
        "review_rating": "",
        "review_title": "I never liked the popeye cartoons but this movie is a treasure!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "daisukereds",
        "review_rating": "3",
        "review_title": "It tries to be silly and cartoon-ish, but ends up being simply weird",
        "review_detailed_main": "The Popeye movie is a sight.. I couldn't have imagined what I was about to watch. Sure, there's a great amount of details and homage to the original strips.. but in the end, it doesn't translate well when converted to \"reality\". A better movie could have been achieved with a tighter script. More organized and straightforward interactions and lines, but still with over the top actions and events. Scott Pilgrim is a great example. You can follow along, instead of being yanked in weird directions.\n\nStill, the sets are amazingly beautiful (even for a dying port town) and a few scenes are memorable and new (even for 2020). But it isn't cohesive or well structured or well told. It somehow feels like a theater/play at times.. Others as a fever dream.\n\nWatch it if you are curious, but it is certainly a mess."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Spacerpg",
        "review_rating": "2",
        "review_title": "This is NOT an underrated classic.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "DKosty123",
        "review_rating": "2",
        "review_title": "When A Great Idea Falls Short",
        "review_detailed_main": "Robin Williams would seem like great casting as Popeye. Somehow this great idea is much worse on film than the concept was. Shelley Duval is dreadful as Olice Owyl. The music sound track stinks. The plot is totally mindless. The special effects reek.\n\nYet this movie got made, somehow, I think if it weren't for Robin Williams, this film would have been shelved. Williams was red hot as a young star on TV's Mork & Mindy when this was made. I think that is the only reason this sold any tickets.\n\nThe film tries to do clever things. Problem is that everything is done pretty badly. Even Ray Walston in support can't save this. It is like, take a good idea & do everything you can to screw it up & then film it. Unless your a big Robin Williams fan, skip this film & eat your spinach."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "6",
        "review_title": "Cult classic isn't for everyone but for what it is, its a classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "SanGorgonio",
        "review_rating": "1",
        "review_title": "Painful to Watch",
        "review_detailed_main": "I saw this movie as a kid for a birthday party, and enjoyed it. However, a great measure of a children's work is its ability engage adults as well. I saw part of \"Popeye\" while I was in college, and was quickly disenchanted.\n\nEverything missed the mark in this movie. The sets tried for a charming seediness, but were just plain scummy. The characters were built up as well as any player in a 3-minute cartoon. The music was flat and unimaginative, ranging from commotion to flat-out tedium. And the movie was way too long.\n\nInstead of a feature-length film, it would have worked much better as a 20-minute short, maybe even a short TV special. A faster pace would have overcome a lot of the film's weaknesses.\n\nDefinitely not \"The Wizard of Oz\" or \"Chitty Chitty Bang Bang\"."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Hey_Sweden",
        "review_rating": "7",
        "review_title": "I'm not a doctors but I knows when I lose my patience.",
        "review_detailed_main": "Robin Williams received his first starring role as the gruff, tough, mumbling sailor man in this belated feature film adaptation of the beloved cartoon characters' adventures. Popeye arrives in the seaside town of Sweethaven to look for his pappy, and in doing so falls in love with the gangly Olive Oyl (Shelley Duvall) and creates a stir with his presence. Of course, Popeye automatically earns an enemy in the equally tough Bluto (Paul L. Smith), an enormous goon who loves to throw his weight around. Popeye and Olive also become surrogate parents to an adorable \"infink\" (Wesley Ivan Hurt) whom Popeye dubs Swee'Pea.\n\nDirected with some panache by Robert Altman, \"Popeye\" the movie suffers a bit from the Jules Feiffer screenplay, which isn't that hot. Sometimes it's more frantic than funny. This viewer also didn't think that most of the Harry Nilsson songs were all that great (with a few exceptions). But the extremely well-chosen cast make the most of the situation. Williams is priceless as the strutting hero, often at his brightest when making Popeye's off-the-cuff, under-his-breath wisecracks. His tendency to mangle the English language IS good for a large number of laughs. Duvall, Smith, and Paul Dooley as hamburger-loving Wimpy were clearly born to play their respective roles; also providing solid support are Ray Walston as \"Poopdeck Pappy\", Richard Libertini as \"Geezil\", Donald Moffat as the ever-annoying Taxman who taxes everybody for everything, MacIntyre Dixon and Roberta Maxwell as Olives' parents, and physical comedy specialist Bill Irwin as Olives' bumbling ex-boyfriend. Look for Linda Hunt (in her film debut) and Dennis Franz in small roles.\n\nOverall, the movie is too likeable and goofy to be just written off by people, even if it does go on too long for its own good. Even though the script itself isn't that funny, the cast still manage to make everything work. Excellent production design (by Wolf Kroeger) is a major asset; the town of Sweethaven is a marvel. And the location shooting in Malta further helps to make this town something of a character itself.\n\nAn energetic finish (including a hilariously cartoonish octopus) brings things to an appealing close certain to put smiles on faces. When the cast do a rendition of the famous \"I'm Popeye, the Sailor Man\", it's an irresistible moment.\n\nSeven out of 10."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "rparham",
        "review_rating": "4",
        "review_title": "This Popeye didn't eat his spinach",
        "review_detailed_main": "Some ideas for a film should just be better left alone. One example of this notion is the film Popeye. An adaptation of the comic strip character famous for his spinach-eating antics, Popeye has been loved by millions over the years in his cartoon form. However, as a live-action musical comedy, Popeye proves to be far less enchanting, an exercise in tedium, near-pointlessness and bad songwriting, all rolled up into a two-hour package that will have you wondering if you have been sitting still for much longer.\n\nTo recite the plot of Popeye (what there is of one) seems to be an almost complete waste of time, but the duty must be performed: Popeye (Robin Williams) arrives in the small seaside hamlet of Sweethaven in search of his long lost \"Poppa,\" who abandoned him as a child. He takes up temporary residence with the Oyl clan, including the headstrong Olive (Shelley Duvall) who is engaged to Captain Bluto (Paul Smith), who more or less runs the town for the mysteriously unseen Commodore. Popeye meets up with several characters, including Wimpy (Paul Dooley), who loves hamburgers, and the Taxman (Donald Moffat) who hits you up for money for almost every minor item you can think of.\n\nPopeye proves to be a somewhat unwelcome soul in Sweethaven, ridiculed for his speech patterns and his quest for his father. When he happens upon Olive trying to get out of her engagement, the two stumble upon an abandoned baby, named Swee' Pea (Wesley Ivan Hurt), and they agree to take care of him together, quickly discovering that he has a knack for predicting the future, an ability that makes him desirable to Bluto, who kidnaps Swee' Pea with the intention of using him to find missing treasure.\n\nPopeye was obviously produced with the intention of being a live-action comic strip in every way, full of the kind of outrageous things that can usually only be accomplished on the page with a pen. The characters all have exaggerated mannerisms and speech patterns, mimicking their illustrated alter-egos, and in certain scenes, such as when Popeye is hit by Bluto, for example, he rolls down some stairs in the shape of a hoop, mimicking a visual device a comic artist might use for humor.\n\nHowever, what screenwriter Jules Feiffer and director Robert Altman apparently failed to consider is whether the decision to bring this material to \"real-life\" would prove to be a good one. Based on the final results, it is not. The film that unfolds is stultifying boring and lacking in any real purpose. Popeye's characters quickly prove to be wearying, running through the same schtick over and over again, with no depth to their actions. They aren't characters so much as just voices and faces, eliciting dialogue that is either indecipherable (as in the case of many of Popeye's lines) or completely lacking in consequence. There is no depth to these people, it's all just surface. Sure, Popeye was originally a harmless cartoon character, and traditionally had thin plots and limited character development, but those were cartoon shorts or a few panels in a newspaper, but when you jump mediums, you have to adapt to the new medium. Film needs characters and story. Two hours of comic strip antics with no solid character base is a recipe for boredom, and Popeye delivers in spades.\n\nIt doesn't help that for a film identified as a comedy, it's not funny. I didn't laugh one time in the entire running length of the film. The dialogue is attempting to be funny, but fails miserably. The sight gags are interesting in the sense that you say to yourself \"Hey, that's a comic strip like gag\" and you are momentarily interested to the extent Feiffer and Altman went to realize a live-action comic strip, but you still don't laugh. The film was also intended to be a musical (producer Robert Evans wanted the screen rights to Annie, but failed to land them, so he decided to turn Popeye into a musical. Thanks, Robert), but the majority of the songs, aside from the famous \"Popeye the Sailor Man\" ditty, are terrible. They are barely songs, with limp music and questionable rhyming, but worst of all, the performers deliver them badly. I am not aware of any of the cast being trained singers, and it shows. Shelley Duval is especially bad in her delivery of one ballad to Popeye, and Robin Williams isn't much better in his numbers.\n\nAs far as performance, Robin Williams does his best to mimic the Popeye voice, but it makes much of his dialogue difficult to make out (you can tell many of his scenes were redubbed) and Shelley Duval is just annoying as Olive Oyl. This is more the character's fault than the actors, but still, after only a few minutes on screen, you keep hoping Bluto will kidnap Olive, and when he finally does, he doesn't gag her, leaving us to continue to listen to the character's droning voice. The lack of characterization and annoying performance also ensures that there isn't the slightest hint of chemistry to the \"romance\" of these characters, they might as well be wooden dolls for all the audience cares. The rest of the cast just fills in the scenery, there are no people for us to remotely care about or be interested in.\n\nYes, Wolf Kroeger's production design is imaginative and many of the actors do resemble their comic counterparts, but is this enough to justify sitting through Popeye? Absolutely not. This is flash over depth, and Popeye proves a thin as tissue paper. If you want to see some Popeye adventures, check out the old cartoons and leave this one on the shelf."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "natatorium",
        "review_rating": "10",
        "review_title": "Perfectly captures the pre-militarized Popeye",
        "review_detailed_main": "Robert Altman was just the right director to bring \"Popeye\" to live action. His use of naturalistic, overlapping and mumbled speech patterns, used to such good effect in \"M*A*S*H,\" is the perfect fit for the residents of the shanty town of Sweethaven. Along with his production crew, he expertly reconstructs the environs and reanimates the zany spirit of the early black and white Popeye cartoons, the ones before Popeye was cleaned up and turned into a tool of U.S. war propaganda. Robin Williams carries off the title role with expert skill in a performance that he, especially he, very easily could have gone over the top with. Shelley Duvall as Olive Oyl and the kid who played Swee'Pea are likewise letter perfect for their roles.\n\nOne of the things I always liked about this movie is the music. Harry Nilsson, a greatly underappreciated talent, came up with a delightful batch of songs that are that are as rich in character as the atmosphere of Sweethaven is full of sodium. Altman's \"Popeye,\" along with Warren Beatty's \"Dick Tracy,\" is one of the rare film versions of a cartoon that succeeds. It does so by staying true to the look and spirit of the original. It wasn't created by committee to be a summer blockbuster, hence it is allowed to have a personality and flavor -- a flavor that blooms with repeat viewings."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Atreyu_II",
        "review_rating": "7",
        "review_title": "Wait a second: this isn't even 30 years old?",
        "review_detailed_main": "Not that it bothers me. I'm just surprised that this movie is from 1980, which means that it isn't even 30 years old. This movie looks so dated that it looks like a movie from the 60's. Without a doubt, it is very old fashioned.\n\nAlthough it does look dated, it is an okay movie. Based on the famous cartoon about Popeye, (the sailor man with a spinach can) I liked this live-action movie better.\n\nHowever, \"Popeye\" was poorly received and probably misunderstood by the audiences and remains extremely underrated and forgotten nowadays.\n\nThis movie features Robin Williams in one of his earlier roles. He was the perfect choice for Popeye. He really looks like Popeye in every ways. It's truly delightful to see Robin Williams on a role like this. He's so funny! His voice here is so different (a result from his legendary talent to do voices) and the way he speaks is difficult to understand but incredibly funny! By the way, ironically he hates spinach.\n\nThe actors who play Olive Oyl and Bluto are too well in their roles. And the baby is such a cutie! Swee'pea is a strange but humorous name. After all, Popeye has sense of humor.\n\nThis movie is a simple production with simple sceneries, but also some pretty backgrounds.\n\nThe songs are nothing special, but not hateable either.\n\nEven so, I think that very unlikely this movie could possibly be better than this. It is correctly made. Although kinda cheesy and corny, it does its duty rather well: to entertain and amuse the public even more than the famous cartoon, but without leaving behind the cartoon's spirit."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ultramatt2000-1",
        "review_rating": "1",
        "review_title": "Popeye The Movie?! More like Popeye The Mess!",
        "review_detailed_main": "Back by popular demand it is time for \"Matthew Rambles\". What you missed rants, so do I but there will be some soon. Right now I got to ramble about this movie. When I first heard about this movie, I found out something about it. I was four when I saw a pirated video of it on Betamax and it had Arabic and French subtitles! When I was young I was familiar with Popeye with the cartoons. Whether it is the Fleischer Bros. (1933 to 1941), Isadore Sparber (as in the Famous Studios era from 1942 to 1957), the turgid Al Brodax cartoons (1960 to 1962) or the Hanna-Barbera reboot (1978 to 1983) I knew who was who. When I got the movie, I thought to myself, \"Oh it is Popeye, I don't care!\" When I got it I had fun, for a few moments. When I got older, I read that it was turgid. After giving it another watch, I found out why this was bad. It was so bad that Mad Magazine spoofed it as FLOPEYE! Thanks to a new set of eyes, I found out why this movie is not good! First of all, who is Robert Altman, who had a ton of dramas in his filmography, trying to cater this movie to. Those who watch musicals, or dramas and comedies you can see on a dull January? When KING KONG was remade in 1976, it was catered for those who watch disaster movies because Dino Dellaurentiis wanted to give this movie a disaster movie fell to it. POPEYE - THE MOVIE was made to rival the success of Richard Donner's SUPERMAN - THE MOVIE (1978). How can you cater a movie like this to those who watch a film like SUPERMAN? Second, while the cast is fine, Bluto is a bit of a problem. Bluto needs to have a big body and small head. Lou Ferrigno would be a good choice. Third, which is following number two, some scenes might be too scary for small children. Bluto angrily approaching Popeye, which leads to him rolling like a wheel. A small child would say, \"Does this happen to a real person?!\" Also, prostitutes in that musical number called \"I am what I am\" and the octopus (scientific name, Octopus-Cartoonicus) are other reasons why this movie is rated PG. Fourth, the writing. Since when did Popeye not like spinach?! Whenever danger rears its ugly head, he takes his spinach. When he eats it, his arms get big, his legs get big, his chest get big. You don't get to see that in this movie. In fact it can only work with nice stop-motion animation with a model of Popeye and have someone like Jim Danforth or David Allen animate it. We would like to see the octopus get clobbered. In fact it did get clobbered, it flew sky high. It would be funny if it lands explosively and when the smoke clears, you see something like cooked calamari or sushi. Now that is a good gag. All in all, POPEYE THE MOVIE is a mess. It is a Frankenstein Monster made of a drama, a musical, a western, Homer's The Odyssey, various cartoons and comics for which the film is based on and cinematography from Frederico Fellini films as the bolts on the beast's neck. This movie caused a trend that Hollywood would be doing over the next 35 years. Some went well such as the original TEENAGE MUTANT NINJA TURTLES trilogy and A FAIRLY ODD MOVIE: GROW UP TIMMY TURNER. Other are just plain terrible like well, MASTERS OF THE UNIVERSE, THE FLINTSTONES, INSPECTOR GADGET, THE ADVENTURES OF ROCKY AND BULLWINKLE, SCOOBY-DOO, UNDERDOG, SPEED RACER, DRAGON BALL EVOLUTION, YOGI BEAR, JEM AND THE HOLOGRAMS, the TRANSFORMERS franchise and the atrocious ALVIN AND THE CHIPMUNKS franchise. This film like any other movie has a cult status. Other people love it. My mother loved it and praised it like CITIZEN KANE. I wish I could praise, but I got a new set of eyes. Recently she found some moments where some scenes let her down. Bottom line, give it a watch at your own risk, because it is a guilty pleasure of mine. Rated PG for violence, mild language, some prostitutes and peril."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "fliphop",
        "review_rating": "",
        "review_title": "\"i am what i am\" : one of the greatest songs ever written",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "gizmomogwai",
        "review_rating": "3",
        "review_title": "Proof Robin Williams made excruciatingly bad movies even before his career indisputably went to hell",
        "review_detailed_main": "Robin Williams: His death was shocking even for non-fans, and led to an outpouring of mourning for a man praised as a comic genius. Indeed, he had plenty of talent (see Aladdin, Good Morning Vietnam, Mrs. Doubtfire), but let's face facts- he made many awful movies. Among the worst you could find from Hollywood. Long before his career hit rock-bottom with trash like A Merry Friggin' Christmas (2014) and before he was begging pathetically for the Joker in Dark Knight, he was starring in embarrassments like Jack (1996), Flubber (1997) and Father's Day (1997). As a kid, I grew a strong dislike for him that only improved after I saw Good Will Hunting.\n\nPopeye came well before any of the films I mention above, and might appear promising. Its director won the Cannes Grand Prix (so did Coppola, but that didn't stop Jack from being awful), Shelley Duvall, who worked with Altman before in the great 3 Women, seems like an ideal Olive Oyl as a black-haired walking pole; and you would think Williams could play Popeye himself (it turns out he can't- his voice impersonation is decidedly one-note). Alas, the film Popeye falls flat quite badly, due to lack of plot, banal TV commercial-style direction, stupid jokes rarely scoring a laugh and more (or less?).\n\nThe musical numbers are particularly embarrassing, barely musical numbers at all. They're often short and overly simple, Duvall can't sing, and the worst is mindnumbingly stupid and especially grating- it consists of Duvall simply repeating \"He needs me, he needs me\" endlessly, occasionally mixing it up with \"Dah dah dah dah.\" That's not even a freaking song. This is a film worth immortalizing- not as a monument to Williams' (or Altman's) genius, but as an episode of Mystery Science Theater 3000."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ggk-34-546807",
        "review_rating": "3",
        "review_title": "Interesting movie... but sadly a bad one",
        "review_detailed_main": "There are few things I must give the movie credit for\n\n1) The actors resemble the characters 100%, especially Olive Oyl was simply perfect. 2) I like the fact it was base more on the original comic strip since it was way richer then the cartoon ever was and it manage to capture some of the spirit of those stories\n\nSadly as a over-all experience this movie was simply horrible! There where few good jokes now and then but their either spoiled by bad timing or they simply didn't have the money for better special effects and most of the visual gags looks simply bad. Much of the Popeye's dialog is hard to heard. Im not sure is it editing fault since I can see this movie work on paper but much of the scenes simply look bad from the story telling point of few. The musical numbers are just getting worse and worse. One exception is the song \"I yam what I yam\" with felt OK but that's about it.\n\nI guess it has cult fallowing and you may enjoy it if love watching incredible bad films but overall it as bad it can get. Still three stars for few good points I mentioned in the beginning."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "r96sk",
        "review_rating": "4",
        "review_title": "It's all very pedestrian",
        "review_detailed_main": "Very poor.\n\nSafe to say, I didn't enjoy 'Popeye' one bit - despite the presence of one Robin Williams. He is pretty alright in the role of Popeye, but I personally didn't like the uneven/whacky nature of the film. I see - and appreciate - what they were going for, it just doesn't come off in my opinion. It's all very pedestrian.\n\nThe characters around Popeye are annoying, as are the very forgettable musical numbers which don't fit in. I had high hopes for this, given I had heard good things of the titular character (not necessarily from this, just overall) as well as the fact of Mr. Williams appears. For me, in terms of his films that I've currently seen, this is closer to 'Hook' than (the awesome) 'Bicentennial Man'.\n\nI'm sure many out there would disagree on that latter point, as well as my view of this film itself. That's fine, each to their own of course. I, though, couldn't wait for it to finish."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "eskimosound",
        "review_rating": "7",
        "review_title": "Urm....",
        "review_detailed_main": "I had to watch this movie twice... The second time with subtitles... You really can't tell what they are saying, there is absolutely no direction, it's an actor's free for all. In fact it shows you exactly why actors need Direction. Complete and utter mayhem. The editing is terrible so is the audio. It's chopped together in no particular order. The audio was redubbed as was inaudible when recording and it's still bad...really bad!! On the plus side the set and costumes are amazing!! I believe most of the budget went on the Set and Cocaine, with the Producer Robert Evans being arrested for trying to buy it. But there's little to no plot or story to follow. Seriously, there's no flow... But Robin Williams is perfect for the part and plays Popeye perfectly...it's just all such a mess and seen from too far away with so much going on in no particular order that you just wonder what on Earth were they thinking? I can see why it's gotten such bad reviews but I dare say with a bit of re-editing, re-dubbing, and a bit of CGI for the Octopus you could polish it up nice. It just needs some love!!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "JasparLamarCrabb",
        "review_rating": "5",
        "review_title": "It is what it is...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mike48128",
        "review_rating": "7",
        "review_title": "Altman's Live-Action Cartoon is Both Brilliant and Strange",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "Robin Williams tries but so much wrong",
        "review_detailed_main": "It's the iconic Popeye the sailor man (Robin Williams) and he hates to eat spinach. He rows his rowboat into the seaside town of Sweethaven. He rents a room from the Oyls. Olive Oyl (Shelley Duvall) is getting engaged to Bluto. The town is run by Bluto for the Commodore. Popeye is looking for his Poppa. He befriends Wimpy but the town is generally unfriendly. Olive Oyl is conflicted about her engagement and about to run away. Someone switches her basket with a basket with abandoned baby Swee'pea inside. Bluto sees Olive Oyl with Popeye and beats him to a pulp. The Oyls lose everything as Bluto takes it all for tax. There is a challenge to anyone who last one round with Oxblood Oxheart for a 10 days tax exemption and $15. Castor Oyl tries and gets knocked out. Popeye takes on the challenge and has to overcome Oxblood's mother (Linda Hunt). Popeye pushes the Taxman into the harbor and instantly becomes the town's hero. Wimpy gives Swee'pea to Bluto for some hamburgers. It turns out that the Commodore wants to use Swee'pea's insightfulness to find a buried treasure.\n\nThe set of Sweethaven looks both ugly and fake. The first thing Popeye encounter is tax. It's not a good start. The camera is far away with long uncut scenes. It's Robert Altman's style and not a good fit for Popeye. It is not a good fit for a blockbuster. In fact, I think Altman is horrible fit in every way for this movie. The songs are boring, sad, and not catchy. Robin Williams tries very hard. Olive Oyl is such an annoying spoiled brat. Everybody is a bit annoying and terribly unfriendly. Of course, they talk over each other as an Altman movie does. There are quite a few acrobats at work but it is not filmed well. There is no energy. It is a lot of blah, and a lot of groans. There is a general ugliness to the whole affair. The biggest problem is still that Robert Altman is the wrong fit. For Popeye, this is simply unfunny."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Maeve43",
        "review_rating": "10",
        "review_title": "I love this movie.",
        "review_detailed_main": "I could care less what any critic or naysayer has to say that would trash this movie. It's corny, it's silly, it's full of odd performances, and it's the most beautiful, pure movie ever. The songs are catchy, Robin was the perfect choice, and so was Shelly. I bought this on dvd many, many years ago and introduced my daughter to it. Now it's one of her favorites as well. Someday we'll get to Malta and visit the actual Sweethaven."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "safenoe",
        "review_rating": "6",
        "review_title": "Reflections of Popeye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "sino-45171",
        "review_rating": "3",
        "review_title": "A dreary waste of Robin Williams and Shelley Duval",
        "review_detailed_main": "The original \"Popeye\" cartoons were simple-minded but enjoyable. This live-action musical adaptation isn't. It's neither funny nor enjoyable. The songs are lifeless and forgettable, and the plot is dreary. Even the elaborate, well-constructed sets make the town of SweetHaven look like a depressed, economically ruined area. Who takes young children to a movie to see that? Robin Williams as Popeye and Shelley Duval as Olive Oyl do their best with the scenes they've been stuck with."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Coxer99",
        "review_rating": "",
        "review_title": "Popeye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "hampersnow-41369",
        "review_rating": "1",
        "review_title": "I walked out",
        "review_detailed_main": "I think it really says something about a movie when 44 years later you still remember it as one of the worst things you've ever seen. I was a teen seeing it with my friends at a $1 movie theatre. It had recently been released and was such a flop it quickly ended up at that dump of a second run movie theater. What we saw on screen was so unfunny, so cringeworthy , so hard to sit through, we all worked out. You would think with that cast and a cartoon character brought to life you could entertain young people just looking to kill some time but there is nothing entertaining about this movie. 44 years later I remember it was like being tortured. Robin Williams and Shelley Duvall are kind of niche actors anyway, neither is a favorite of mine, but I didn't even watch the whole movie and it still ranks as one of the worst things I've ever seen on screen."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "disdressed12",
        "review_rating": "5",
        "review_title": "great looking sets,but not much else",
        "review_detailed_main": "This is a movie that makes little sense,but then i don't think it's supposed to.regardless,i didn't think it was that great.i found it slow and boring,and it had too many musical numbers for my taste.but i will say that Robin Williams was good as Popeye,and i liked Shelley Duvall was good as Olive Oyl.i didn't like the character of Bluto very much.he just seemed like a poser full of hot air.maybe that's how he was supposed to be,but i still didn't like him.i did like the look of the film though.i think a lot of effort was put into the sets.to me,the setting looked like an authentic village by the sea.overall though,i wasn't impressed.but if you're a fan of the old Popeye cartoons from the 30's and 40's,you might like this movie.my vote for Popeye is a 4.5/10"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ronnybee2112",
        "review_rating": "2",
        "review_title": "Unbelievably BAD...",
        "review_detailed_main": "I have always enjoyed the 'Popeye' short cartoons. All of them were funny and they made me laugh out loud,chuckle,or at least smile. Naturally,I had high hopes for the 1980 'Popeye' movie. When I went and saw it at the theater,I couldn't believe how BAD it was! The cast,the sets,the wardrobes were all top-notch,so at least- on paper- this should have been a slam-dunk success. What went wrong? Everything went wrong! Robin Williams mumbles unintelligibly throughout most of the show. Much of what Robin Williams said in the film was apparently very funny to him,but what very little that the audience can actually hear is mostly snide remarks and nonsense that isn't funny at all. Unfortunately Mr Robin Williams was nowhere near as funny or talented as his super-sized ego told him he was,and this movie showcases this glaring fact. The talents of the rest of the cast are mostly wasted on a weak script and poor directing. The whole movie is an appalling disaster,it really and truly stinks. I see that many people have given it a high rating,calling it a masterpiece etc. These people either didn't see the same movie I saw,or they are joking,they have to be! Watch it if you are still curious,but don't say you weren't warned!🌞"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "spencejoshua-22736",
        "review_rating": "6",
        "review_title": "A decent attempt.....",
        "review_detailed_main": "...to bring the cherished cartoon character to life. The film has its ups and downs. As you can see many of the reviews are heavily divided. There's definitely pros and cons .....\n\nThe cons are the length of the film, the set, the number of villagers, the sound editing, makeup, some of the casting, some of the script, amount of singing, the first act, lack of closeups......there's quite a few.\n\nThe pros would be Robin Williams, Shelley Duval, Ray Walston, Sweetpea, a few of the songs, the octopus and the second act.\n\nAll things considered, I would watch it again, but mainly for the early effort to bring comic strip characters to the live action screen. This challenge was still in its pioneer period. In these present times of CGI/technology advancement, it's easy to criticize older films. I feel it's better to give credit where it is due and this attempt was not a total failure."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ingridwinter-31613",
        "review_rating": "3",
        "review_title": "Good and bad",
        "review_detailed_main": "Good portrayal of cartoon characters but this has to be the most annoying thing that i ever subjected myself to for three painfull minutes."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "80's guy",
        "review_rating": "6",
        "review_title": "Popeye Loves Carrots,Hates Spinach",
        "review_detailed_main": "yea,i too liked this ( 6-10 ) ,,a lot unfocused,but fun...but you really have to watch ray walston ( pappy ),evry scene with him is very enjoyable!.songs were annoying but grow on ya.wlliams does a 1 note performance,duvall is splendid (annoying),,,check for dennis frantz in the diner scene."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Beta_Gallinger",
        "review_rating": "5",
        "review_title": "Robin Williams playing Popeye had so much more potential",
        "review_detailed_main": "I first became familiar with the famous cartoon character, Popeye, in the late 90's, when I was around ten years old. I think an old comic book I read introduced me to him. I had no idea that a live action movie featuring the main character plus other characters from the cartoons had ever been made until towards the end of 2001, when I saw a bit of it on TV and saw who was playing Popeye, Robin Williams. To this day, I haven't seen any of Popeye's animated cartoons, nor have I ever been an avid fan of the comics, but have finally seen this entire live action movie from start to finish. Beforehand, I saw its low rating here, but also knew a lot of people seemed to like it, so I decided to watch it with an open mind. Nonetheless, it was not entertaining for the most part.\n\nPopeye is a sailor with muscular forearms who rows his boat one stormy night to a seaside town called Sweethaven. After going around the town and meeting various people, with some negative reactions, he arrives at the Oyls' boarding house, where he rents a room. He quickly falls in love with the daughter of the family, Olive, but this leads to trouble, as Bluto, a big bully in the town, is to marry her. The sailor also meets a hamburger loving man named Wimpy. During Popeye's stay in this town, he accomplishes a lot with his fighting skills, which brings him a lot of attention from the townspeople, and also, with Olive Oyl, he finds an abandoned baby boy and names him Swee'Pea. However, one man who is hard to take on is Bluto, who wants revenge on Sweethaven after Olive dumps him, and it's up to Popeye to try and stop the ruffian!\n\nThe part at the beginning with Popeye on his way to Sweethaven is a little tedious, but after that, as the sailor sings his way through the town as he meets some of its residents, it is pretty funny. However, it soon goes back downhill after that, I think when he makes it to the boarding house. For the rest of the film, it drags on and is rarely funny. I did laugh a bit here and there, during parts of the boxing match, and the part where Popeye meets his long-lost father, but most of the film isn't very funny at all. In addition to the lack of humour, there's also too much talking, and as a musical, some of the songs aren't bad, but a couple songs sung by Olive Oyl, played by Shelley Duvall, are ridiculously repetitive. Even if that's for comic effect, it's not funny, and it doesn't help that Duvall sounds quite bad singing in her Olive Oyl voice. Robin Williams does a decent job playing the starring role, but unfortunately, that is overshadowed by the film's flaws.\n\nSince I've usually never paid attention to the \"Popeye\" cartoons (comics and animations), I can't really make comparisons between them and this full-length live action adaptation. However, I have seen several other films starring Robin Williams, so I can make comparisons between this film and others I've seen featuring the comedian. It appears he made his silver screen debut in \"Popeye\", and while not all the films he has starred in since then are that good, he has definitely been in much better ones than this. This film is not lacklustre because of Williams, he seems like a great choice for the role of Popeye, but because of the problems I've mentioned, it still fails to deliver. Despite how much criticism this movie has faced, a lot of people would disagree with what I've said about it. We're all entitled to our opinion, but I've given my two cents' worth."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "kl-reagan",
        "review_rating": "8",
        "review_title": "\"Sweethaven\" for Popeye fans!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "classicsoncall",
        "review_rating": "6",
        "review_title": "\"Hello. Better grab me loins up for this one.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "sbspence",
        "review_rating": "5",
        "review_title": "Why reinvent the wheel?",
        "review_detailed_main": "Popeye was a hit in original style in all of the cartoons. It's still one of my favorite cartoons, and one of my favorite characters. He is also one of my favorites to draw as an amateur cartoonist. I remember seeing this in theaters in 1980 and thinking it was hard to understand and difficult to follow. The town seemed bleak and depressing unlike any of the cartoons. The new for the big screen songs? Why? His song was and is a classic. They seemed to be trying to reinvent the characters as well, which I find totally unnecessary. I loved the idea of the movie and wish they would've stayed more true to the comics and cartoons. The last straw was when they let fly with the curse words! I thought I'd misheard but the dozens of small children in the theatre didn't and they all gasped and giggled uncomfortably, the parents obviously upset, and i as a teen sitting with my own family felt awkward. There was simply no need for the language! I thought so then and I still think the same as an adult. It was gratuitous and served absolutely no purpose other than for Hollywood to jam down our throats every time they got a chance. SMH. It could've been a blockbuster, it could've been a classic it ended up being a mostly forgettable two hours with some of the biggest names in Hollywood filling the cast. What a waste."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "possumopossum",
        "review_rating": "",
        "review_title": "This Film Needs Repeated Viewings",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Sherparsa",
        "review_rating": "3",
        "review_title": "why i gave a full-stars production only 3/10?",
        "review_detailed_main": "Did that not because the movie is not well made, which it is indeed (although i expected it to be better!) but because i never liked the original Popeye cartoons as a kid ...\n\ni loved Felix The Cat, or Betty Boope and the mandatory Mickey Mouse and even the creepy old Koco The Clown, which did keep me watching despite being so boring as well as nightmarish ... and in spite of the fact that they were all at least two generations 'behind' me when i was a small child in the mid 1960s ... (my most fave was Heckle and Jeckle though, which decades later i found out it was mostly a banned cartoon in some US states ... and the Flintstones ... and well ... some others as well ...)\n\nbut i never got to terms with Popeye, not even later when i grew up and developed a taste for some items i didn't quite like earlier ..."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "callanvass",
        "review_rating": "3",
        "review_title": "Boring",
        "review_detailed_main": "(Credit IMDb) The sailor man travels to a seaside town called Sweethaven, falls in love with Olive Oyl, adopts Swee'pea, and makes an enemy of Bluto.\n\nI'm a huge Robin Williams fan and that's the sole reason why I decided to watch this movie. I'm not all that familiar with Popeye to be honest with you, so maybe my review isn't the best if you're looking for an informed opinion. I just know that I was bored silly by this movie. Even Robin's antics get old after a while. I got annoyed by the pipe that is constantly in his mouth. Shelley Duvall can't sing worth a lick, and her performance grated my nerves. At 114 minutes, I thought it was also a bit too long as well. Despite the impressive set-pieces, a rather decent first 30 minutes or so, this movie really gets annoying after a while. Maybe Popeye isn't for me. If you want to watch it, by all means do so.\n\n3/10"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Pjtaylor-96-138044",
        "review_rating": "4",
        "review_title": "That's all I can stands and I can't stands no more.",
        "review_detailed_main": "In a way, 'Popeye (1980)' is hard to actively dislike but, at the same time, it's not good - like, at all. The first, maybe, forty-five minutes are actually kind of awful. I mean, the piece is straight-up boring for quite a while and its attempts at humour are the opposite of funny. Eventually, things liven up just enough for the thing to be watchable - primarily thanks to some inventive sight-gags and scenery-chewing performances. Indeed, it's the latter that really stand out here, as pretty much all main players encapsulate their well-known characters to a tee. Duvall, especially, is a once-in-a-generation match, portraying the often-flailing Olive Oyl with apparent ease. Still, the piece is never even remotely compelling or, even, all that enjoyable. You can tell exactly what it's going for and there are moments where it almost achieves this, but it ultimately feels rather subpar. Its crooked, cartoon-like visuals and clumsy, uninspired music numbers may have a certain charm to them, but its half-baked plot and, I suppose, general aesthetic prevent them from providing any real entertainment, even ironically. It's not awful but it's certainly not good. Somehow, it leaves you with an oddly satisfied feeling, though. However, it's certainly a false feeling; all it takes to sour this satiation is a little trip down recent memory lane. 4/10"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "japamo",
        "review_rating": "7",
        "review_title": "Sour Grapes Doomed this \"Popeye Projeckt\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "TOMNEL",
        "review_rating": "5",
        "review_title": "Style over substance, and the style wasn't great.",
        "review_detailed_main": "I remember loving this movie as a child, but going back and watching it now, it just seems like a waste of talent.\n\nRobin Williams plays Popeye to perfection. In fact, all of the cast is very true to the old cartoons. Shelley Duvall looks and sounds like Olive Oyl, Paul Smith plays a great Bluto, and Paul Dooley plays an excellent Wimpy. The sets look like something out of the Popeye cartoons, but at the same time they look dull and low budget. Whoever had the idea to make this a musical, had a good idea, but in order to make this a good movie musical it needed good songs. The songs are awful! Some of the tunes are okay, but the lyrics are so terribly uninspired it's amazing! Often the songs just repeat themselves including, \"He Needs Me\" sung over and over by Olive Oyl and \"I'm Mean\" sung numerous times in a row by Bluto. This movie had so much potential, and with director Robert Altman, it seems like it couldn't fail, but it did.\n\nMaybe Popeye just wasn't meant to have a 2 hour live action musical.\n\nMy rating: ** out of ****. 114 mins. PG for mild language and violence."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "one9eighty",
        "review_rating": "6",
        "review_title": "It is what it is - and he is what he is - aggaggagg :D",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "wisemantonofski",
        "review_rating": "4",
        "review_title": "Spinach Doesn't Age Well Either (to be fair)",
        "review_detailed_main": "I got a weak spot in me heart for this ol' shanty on account'a Robin Williams and a childhood love of the characters. However, I've also got a weak spot in my stomach for it on account of Shelley Duvall and the God-awful song sequences that drag on forever and sound like they were written by Sweetpea"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "elisereid-29666",
        "review_rating": "10",
        "review_title": "Popeye with a dose of surrealism",
        "review_detailed_main": "My pervasive thought throughout Popeye was \"I had no idea Fellini made a musical comedy about Popeye!\" Indeed, I almost looked up the film in the middle on my phone to be sure it was Robert Altman that made it, because this film is so unlike what I expected that I was almost not sure what I was seeing.\n\nFor those of you who don't know what I'm talking about, in Fellini's better works, each of the characters are in their own little world and talk *at* each other rather than *to* each other. This is the element of Fellini's surrealism that I saw the most of in Popeye, along with the strange set design and costumes that could have almost come from the same cloth (haha) as those in Fellini's Casanova. For a film that was at least partially shot on location, there is a strange artificiality to its visual style that, yes, makes perfect sense when you consider that what we're watching is a live-action cartoon.\n\nBut I digress. I've gone on and on about the technique of the film but I've yet to answer the bottom line question that any review should address which is, \"is the movie any good?\", and my answer to that is simply \"Yes! Very much so!\"\n\nThe late Robin Williams inhabits his role as Popeye as only he could have. Shelley Duvall nails the gravity-and-physics-defying nature of Olive Oyl as she appeared in the cartoons, and she does it with posture and body movement as opposed to special effects, which makes it all the more astonishing. The songs range from melodic and beautiful to almost spoken-word, and there is an operatic feel throughout.\n\nBut then, I grew up enjoying the Popeye cartoons, so I recognized that Altman and company also loved them and that his film was a loving tribute to them. Would somebody that disliked them (or was uninitiated to them) enjoy the film as much as I did? It's hard to say (though I suspect that many audiences didn't know what to make of it in 1980, given its reception), but I find it really hard to imagine anybody disliking a movie so doggone sincere as Robert Altman's Popeye."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "CubsandCulture",
        "review_rating": "6",
        "review_title": "I don't understand anything about this movie or its reception",
        "review_detailed_main": "I have no great interest in Popeye the cartoon strip or the older cartoons. I only saw this (twice) because Altman is my favorite director. On its own merits it is a perfectly cromulent family film. It has a breezy tone, more gags that land than don't and it never gets bogged down. The technical aspects are-octopus aside-all top notch. I like how detailed Sweethaven is and it reminds me of all things of the set design in McCabe & Mrs. Miller. The music is catchy. Williams and DuVall absolutely live their characters.\n\nWith that being said I don't know why Altman directed this and more to the point why a studio let him. The film is about as idiosyncratic as a tentpole can be but the film is very cartoon-y and it doesn't sit comfortably with say Nashville. Likewise, the Altman excesses-Popeye disliking spinach is a plot point, Altman shoehorns in gambling-don't fit well with the Popeye of the cartoons and to a lesser extent the comic strip. The overall film feels like a mishmash of competing interests. The film is messy-but not in the unresolved style that is Altman. It's messy in the too many cooks in a kitchen sort of way.\n\nHowever, the film is good enough that it shouldn't have savaged by critics when it was first released. Altman was in his mid-career slump and this was the last of a strings of failures. The reception has gotten less vitriolic over the decades but I think the critics were still mad at Quintet. The film should not have sent Altman into exile in the 80's as well because the film at worst broke even. (20 million budget, 60 million box office). Eisner (yes that Eisner) got savaged by Altman in the press probably didn't help his cause but it is a myth the film was a\"bomb.\" It under-preformed expectations but it didn't lose the studio any money."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "IWasKnownAsThe1SentenceReviewer",
        "review_rating": "5",
        "review_title": "Renowned Williams",
        "review_detailed_main": "Renowned Williams (whose performances I loved in movies such as Mrs Doubtfire (1993), Good Will Hunting (1997), Good Morning, Vietnam (1987) and a few others) is rather interesting to watch as the eponymous hero but I am often dissapointed by live-action movies based on cartoon characters (How The Grinch Stole Christmas (2000), Astérix & Obélix: Mission Cléopâtre (2002), etc.) and this one makes no exception with its fake looking sets (on which most of the budget went..) and clownish slapstick moves."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mlevans",
        "review_rating": "",
        "review_title": "This movie isk what it isk & that's all that it isk!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "iquine",
        "review_rating": "3",
        "review_title": "Charming or Cringe Worthy?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Aaron1375",
        "review_rating": "5",
        "review_title": "For the most part the casting was good.",
        "review_detailed_main": "It is the story that suffers here. Popeye and Olive are perfectly cast. Robin Williams plays Popeye very well, and if ever there was a role for Duvall it is that of Olive. They should have gotten someone better known though to play Bluto, but unfortunately he isn't really that big of a player in this one considering how important he is in the cartoons. Here in lies the problem with this flick, the story is awful for the most part. Something about Popeye coming to a sea town to find his father. Bluto is a bit to quiet and mean in this movie as well. In the cartoon he was talkative and friendly and sometimes even best friends with Popeye. Here, he is almost evil. This movie also has a few songs so it is sort of a musical too. This may not turn some off, but I am not wild about musicals."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "T-ZER0",
        "review_rating": "5",
        "review_title": "Somewhat of a mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "zetes",
        "review_rating": "6",
        "review_title": "Below average Altman, but still interesting",
        "review_detailed_main": "This film, generally considered one of Altman's greatest follies, is not all that bad. Unfortunately, it's not all that good, either. The director, along with his production team have created a unique and amazing world in Sweethaven, populated by bizarre and amusing live-action cartoon characters. It's an awesome film just to look at. Unfortunately, the script is very weak. I wonder if Altman insisted upon his regular method of film-making, in coming up with a lot of it on the spot, having his actors create the scenes. It feels like there was at least some level of improvisation, and it doesn't work because these characters are all two-dimensional cartoons. Neither Altman nor the actors are ever able to convince that these people are real, even in their fantasy world. When asked to improvise, I imagine the actors had a hard time imagining what their characters' motivations were, as there's not much psychology in your average Popeye cartoon. A lot of the characters' interactions consist of moaning, shouting and jumping up and down angrily and it gets annoying. The film might also have worked better if the music were better. Harry Nilsson's songs are almost all poor, except for the two performed by Shelley Duvall, perhaps only because Duvall's Olive Oyl voice sounds so good in song (remember how brilliantly P.T. Anderson used the song \"He Needs Me\" in Punch-Drunk Love a few years ago). The movie must work in some capacity, though: I absolutely adored it when I was a kid, and watched it numerous times on television. This isn't the disaster it's often touted as, but it's definitely one of Altman's failures."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "freespan100",
        "review_rating": "5",
        "review_title": "expensive flop, some good acting talent and production values",
        "review_detailed_main": "Unfortunately this film is now proceeded by a bunch of bad press, that overshadows the strong aspects that the film has, (like most major films that are 'flops' there's piles of strong work, just not an entire movie thats worth recommending) - essentially Popeye is filled with attractive and lavish sets, the entire film designed to evoke the feel of the original 'Popeye' series and books, perhaps raising the question as to why the film wasn't an animated feature.\n\nThe other strength is Robin Williams acting, its great, but its also ingratiating. Then there's Shelley Duvall, also committed, but sometimes dropping character, in frustrating moments. All the characters are predictably one-dimensional, the violence and action is entirely stylized, making the 'mechanics' of the plot frustrating, for some reason. The other problem with Popeye is that, really there isn't much of a story dynamic, or anything for the carefully presented and acted characters to do, they just exist in the lavishly created world that Robert Altman envisioned for them. There's a plot about an evil sailor trying' to steal Popeyes adopted infant Sweetpea, in an attempt to find lost treasure. Plus, of course, Popeye has considerable strength when he eats spinach and can't be messed with.\n\nThe best I can say about the movie is that its not offensive to young viewers, but its not a great kids movie at all. Secondly, the movie features a number of musical numbers that are completely weak and forgettable. How could such an professional team overlook the fact that the musical score belongs in a high school production? Popeye is essentially a really goofy and unflattering depiction of a little working class seafaring community, with two talented actors and no story.\n\nLastly, the film was released after Superman the Motion Picture, except with less enthusiasm and fanfare. In some ways Popeye is analogous to the mega-flop Dick Tracy, released after the successful 1989 film Batman."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "Popeye is one of those films for which I could guess the plot exactly before I saw it. I don't know if it's because it's super predictable or because I've seen too many movies. You can predict the whole movie and ending very easily. These characters were walking cardboards. I could've cared less what happened to these characters because there was no depth to them and I didn't feel attached to them at all. We've seen these clichéd characters a million times. These are the only things to critique on. The directing, music, editing, etc are not focused on at all. Overall, the film was...\"eh\". I was bored through most of it and I left the theater with no intentions to ever see it again."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "WilliamtheAdequate",
        "review_rating": "4",
        "review_title": "I got it, but I don't know that I wanted all of it.",
        "review_detailed_main": "So, watching this was kind of a weird flashback. I remember it from when I was a kid, but I also remember it leaving a bad taste that has taken 30+ years to get over. So tonight I gave it another try and... well, it is better than I remember, but I also understand now why I didn't like it then. First, the good - it actually does a pretty good job following the feel and tone of the original cartoons. If you don't know the characters or cartoon, don't complain about Shelly Duvall's singing, or the goofiness, or everything that was completely and directly related to the original Popeye. (Why would you even watch it? Sheesh.) As for the bad... It's long. Really, REALLY long. Not like \"Desolation of Smaug\" long, but it's just hard to take a concept that was always meant to be 5-10 min. and turn it into a full length feature film. (Sadly, Hollywood didn't learn this from \"Popeye\" and has tried everything from cartoons to board games since; Expect \"Candy-Land The Movie\" any time now.) The first hour is cute, and quaint, and you think about the cartoon and it's kind of fun. The second hour is... well, I can't say for sure. I fell asleep for part of it, and couldn't stop thinking about what else I should be doing the rest of the time. Then there is the \"Haul Ass\" final pseudo-song ending. OK, maybe Popeye's Pappy is saying \"Haul Aft\", but this is supposed to be a kids movie and it simply gets old and wasn't really funny the first time. So, I guess my suggestion is this - watch the first half hour or so, see some great performances, have a trip down memory lane and then let it go. It ends how the cartoons end - Popeye eats the spinach, Brutus looses, and toot-toot, all is well in the world. I just saved 60-90 minutes of your life. You will thank me someday."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "c.riker",
        "review_rating": "8",
        "review_title": "A classic and a film you will not forget",
        "review_detailed_main": "This is one of my father's all time favorites. I was young when I first saw it, and remember loving it. In fact, I still do. The music is absolutely wonderful and Robin Williams and Shelley Duvall are terrific as Popeye and Olive Oyl, respectively. Paul Dooley steals all of his scenes as Wimpy, the hamburger loving oaf.\n\nGiven that so many comic strips/books are being made into full length films it is nice to see a film that does justice to its inspiration and performs as expected. Rent Popeye. You'll be very pleasantly surprised. I for one am shocked at its low IMDB score... give it a chance... it far exceeds the score it has been given!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "PedroPires90",
        "review_rating": "6",
        "review_title": "Not bad",
        "review_detailed_main": "Not as bad as most people think. It's different, it doesn't have a problem with being pathetic, funny and nonsense. Not a great plot, neither good dialogue, but you will have a good time."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "DrPhibes1964",
        "review_rating": "4",
        "review_title": "A beautiful mess of a movie",
        "review_detailed_main": "My admiration for the film is mostly in its production design. The town of Sweethaven is stunning to look at and , far as I know, remains standing and is a tourist attraction if you're in the Malta area. It gives the film a very realistic quality in an otherwise cartoonish story. This may or may not have been my first Robert Altman film and I was unfamiliar with his style of characters talking over one another and the very loose manner in which he structured his stories. They can appear like a series of disconnected scenes that seem to have no real story and feel like they ramble on without a point or purpose. He's an acquired taste and he can be very hit or miss. Popeye, for me is an interesting miss. It had all the elements for something better but there was some key element that was missing. I don't know who this film was targeted for. Nostalgia for these characters couldn't have been very large and children would have been bored by it. Even for die-hard Altman fans it must have a WTF reation. The casting is excellent. Robin Williams and Shelley Duvall were ideal choices. This goes for most of the supporting cast and they all bring their characters to life, and several of the Harry Nielsen songs are catchy, but it's all in service of nothing and it just fizzles out. It's an opportunity squandered."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "andy-227",
        "review_rating": "",
        "review_title": "Strange but true.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "rossini-1868",
        "review_rating": "7",
        "review_title": "For the Pure in Heart...",
        "review_detailed_main": "Every time I watch this movie, I'm reminded that Fate decides. And Fate decided here to morph the classic cartoon into a cute little stage version of itself, so benign, so dull, so non threatening and so lifeless as a movie that it manages to be fascinating. And this, mostly due to the fame of its director, I suppose, but to tell you the truth, its mostly because Shelly Duvall and Robin Williams hit the cartoon nails on the head, and gave inspired, ingeniously perfect interpretations of Popeye and Olive Oyl. They are the reasons that even while you're cringing through this strange dud of a film, you can't stop watching it until its over. Ray Walston as Popeye's father captured it too. Whatever it is. Study the Kubrikian opening, when Popeye the Sailor braves a raging storm at sea in a rowboat, in end of the world gloom and doom, only to have the scene lighten into a sunny piece of fluff when he lands in Sweet Haven. Study this, and you'll see that a spirit of childlike wonder touched Altman and literally forced him to go in an aggressively silly, lighthearted direction.\n\nThe problem with this movie was that the well written music was so poorly arranged and orchestrated that it did little more than hold the movie hostage as stiff and stagey, which we dismiss as \"quirky\" thanks to the genius of Williams and Duvall. I could listen to them talk to each other all day long doing those voices. Remember what John Williams did for Stephen Spielberg in Hook? If that had happened here, we would be having a different conversation about this classically strange and curiously compelling movie. It maintains a powerful innocence, an almost tragic naivite, that could help explain why Fate decided to release these classic cartoon characters in humility, instead of grandeur. This movie is for the pure in heart. The innocent, naïve child in all of us."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "v-56289",
        "review_rating": "6",
        "review_title": "Popeye the sailor man",
        "review_detailed_main": "I decided to watch this movie after I returned from the Popeye's Village that still exists in Malta. The beautiful place where the movie was filmed has been turned into a theme park . As I fully recommend visiting Popeye's village, I can not say the same about the movie.. The screenplay is weird, some actors really irritate me.. Throughout the movie I mostly don't understood what was going on.. The last scene, when Bluto takes the kid to an island is silly.. the best is to just watch teh blue water and picturesque cliffs..."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "EdgarST",
        "review_rating": "10",
        "review_title": "Altman's Utopia",
        "review_detailed_main": "I feel so content to see that viewers' opinions about \"Popeye\" are changing. I liked this motion picture since its release and just as someone else mentions here, I sit and watch it again whenever it's playing on television. I was a fan of Popeye's cartoons when a kid, and as a grown up I have become an indeclinable admirer of the films of Robert Altman, who I consider one of the greatest directors of American cinema. As someone wrote in a review of \"Dr T. & the Women\", Altman is a genre by himself. One may go to see an Altman comedy, but it is better to be warned that one must emphasize the director's name instead of the genre. This is indeed a film version of a comic-strip character, but I believe \"Popeye\" is mainly Altman's (and writer-cartoonist Jules Feiffer's) vision of Utopia in a town by the sea called Sweethaven, where \"Flags are waving wet people from the sea, safe from democracy, sweeter than a melon tree\" (lyrics to \"Sweethaven\", an anthem by Harry Nilsson). It is a love postcard from the filmmaker to his fellow Americans, who so far have preferred to follow the critics' failed opinions about his work, or his peers' disdain when the time comes to give out awards. And then Sweethaven is also more than that: it is Altman's surrealistic vision of humanity dealing with its basic emotions and needs. For the recreation of a world where \"God must love us\" (Op. cit.), Wolf Kroeger created marvelous sets in Malta, photographed by Giuseppe Rotunno (the magician of light who captured so many of Fellini's clowns and buffoons), peopled with a cast giving its best and to the rhythm of simple, sweet and affectionate songs by Nilsson, that seem more than appropriate for this universe --I do not agree with negative opinions about the songs: they are in complete atonement with the spirit of the film and cartoons. (Do you remember Olive singing \"I Want a Clean, Shaven Man\"?) What I find disturbing about the film is its sudden change of mood, from observation of people's strength and foibles, into an action movie. It makes me wonder if \"Popeye\" was severely cut by its distributors. In the soundtrack album, there are songs never heard in the movie. It would be great to see a restored version of \"Popeye\". But there are many wonderful things about it as it is, that I can pass the deficiencies. For example, one of my favorite scenes is Popeye's first dinner with the Oyls: it is pure Altman, with overlapping dialogues and his brand of humor all over the place. Then you have the whole engagement sequence, with Olive escaping from home as she sings \"He's Large\", meeting Popeye and finding Swee'pea, while Bluto destroys her house. All the humanity contained in the \"cartoonish\" frame makes me love this film. I just can't help it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "neil-476",
        "review_rating": "6",
        "review_title": "What a shame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ksiress",
        "review_rating": "",
        "review_title": "A worthy gem.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "andrewbasson",
        "review_rating": "6",
        "review_title": "Only sort of Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "erminahotmail",
        "review_rating": "7",
        "review_title": "ok movie",
        "review_detailed_main": "So at this moment I decided to do reviews of films based on cartoons. Obviously that live action adaptation so why are there really too many people who hated this type of film but for me these types of films are not bad at all some Yes but the others are not forfor this reason I'm making the review starting from the first one that started, namely Popeye, a film inspired by a cartoon from the 1930s, so I won't even explain to you that who Popeye is, those who don't don't know this sailor who made animation history later in 1980 havedecided to do the live adaptation I want to tell you something a lot of people say that this is a Disney film but it's not like that because it's a sin only collaborated with Disney not created so I can't explain why So I won't tell you the plot because this film there was no realplot there are some things done at the same time So here I say what I think of this film for me it's an ok film it won't be one of the best films I know but I don't find it that bad and I'll tell you one thing the actor who plays Popeye and is played by a very young Robin Williamsand I also tell you that this was his first film that he played as a protagonist because before he only worked on television and for me he was really very good at playing Popeye Even if for me it is not one of the best films with Robin Williams But I can tell you one thing curiosity the actor whoplays Bluto who played by Paul L.smith and that I learned that this person comes from where I live or in Italy it means that he is an Italian and he is well known for being the fake version of Bud Spencer this Incredible but true to It is also common to tell you the setting of set Who invented this movie existsreally you can also take a trip to that place and I can't because this film was a flop and was panned in every way Ah for me in October nothing is right because this film was exactly identical to the cartoon you can't it's about a product that you do that thingand then you talk about another thing as happened in the adaptations say something that is based on for example a comic book scratches nine cartoons video games Instead of this film we have Popeye It was really a very good film I recommend it if you are a fan of cartoons But this is itIt was just the beginning. I also review the other films based on cartoons. There will be many of them to conclude with a rating of 7."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "departed07",
        "review_rating": "10",
        "review_title": "One Word: Fantastic",
        "review_detailed_main": "\"Popeye\" is one of the best comic-strip adaptations in the 1980's. What makes the film realistic like the comic strip is the actors themselves. Robin Williams is pitch perfect as the one-eyed sailor who is looking for his father; Shelly Duvall is great and looks exactly like Olive Oyl; Paul Dooley strikes the resemblance of Wimpy the hamburger eating lover and Paul L. Smith is scary as the brute Bluto. The film is just like the comic strips, and so life like as well about Popeye trying to look for his father, and is welcomed by the Oyles who take him in. Yet, as Olive tries to ditch her engagement with Bluto, the character Sweetpea is introduce as an abandon baby for which Popeye and Olive take in. With the baby having a gift of predicting the future, Wimpy tries to use Sweetpea to win horse bets at a race. The rest of the plot I'll leave you to figure out as you watch the film. A childhood favorite that is still one of a kind in every direction."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ohiochett37",
        "review_rating": "7",
        "review_title": "Nostalgia",
        "review_detailed_main": "Loved this movie as a kid. Havent watched it since about 1985. Saw it playing on Pluto TV and decided to watch. Not as great as I remember; but really what is?\n\nDecent movie, great for nostalgia."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Petey-10",
        "review_rating": "",
        "review_title": "Popeye!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "SusanVanderburgh",
        "review_rating": "7",
        "review_title": "Popeye the sailor man",
        "review_detailed_main": "I enjoyed the movie and it was cute. I think the cartoon version was better. The filmed version was interesting. I enjoyed the music aspect of the show."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ThaBamboozler",
        "review_rating": "6",
        "review_title": "This movie is nuts!",
        "review_detailed_main": "This movie is just nuts. For one, if you've never seen the original Popeye cartoons you will be very confused on what is going on with these characters. They are all so extremely over the top that it hits you with the sense of, \"What the heck am I watching here?\" Getting over that, the screenplay adaptation is really a great transformation from the cartoon to the big screen. I say that in the sense that when you watch this movie, it still feels like you're watching the cartoon. Lastly, you have to be prepared to watch a music feature film. Popeye the movie plays out as musical theater on the big screen, and it really feels that way. If you get over those hurdles, you're in for a wild ride filled with nonsense and physical humor. Just remember, you're watching a cartoon!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "flundar",
        "review_rating": "8",
        "review_title": "Very strange and amusing.",
        "review_detailed_main": "This movie is very unique in that it is a charming family movie, sappy and protagonistic, yet uncannily bizarre. The kicker is it really seems like a live action version of the old classic black and white Popeye cartoons, right down to the spinning pipe.\n\nIm 30, grew up in Georgia, and have seen many of the old Popeye cartoons. These cartoons didnt make much sense, but they were very predictable. Their charm was in the little things. Things like Popeyes constant punny comments, the confusingly random splice of ludicrous characters, and the overblown fighting gags.\n\nI remember a Popeye cartoon where Popeye has to walk Olives little dog. He reluctantly agrees (sap!) and he and sissy dog meet up with Bluto walking his big bull dog. Harassment ensues, Popeye says \"Me pekinese is week in de knees\", they both eat spinach, and in a barrage of whimsical yet freakishly brutal retaliation, Popeye and pekinese triumph.\n\nThese cartoons werent really my favorite, but seeing them put to live action with intricate detail is a trip. In creating the world Popeye lives in, there is a necessarily huge amount of artistic license, but the sets are so cool and colorful, it almost seems like another planet. The movie is basically an introduction to the whole Popeye saga. The central cast of characters are all well cast and faithfully portrayed and the rib jabbingly obtuse humor is playfully retained.\n\nOne thing you must brace yourself for is that this is a musical. Critically lambasted after release in 1980, it was called boring, cluttered, and a lot of attention was called to the songs as being ill-conceived and vapid. But there is a quaint lowbrow feel to the songs, as the lyrics are intentionally simple and repetitive. Personally I like the music, its catchy in its noticeably unsophisticated originality that seems to fit with the vintage, salty world of Popeye.\n\nI saw this movie in the theater as a kid, and Im not sure if I would recommend it as a kids movie. But seeing it again as an adult in a slightly altered state, I found it a rush of memories and laughs. If you plan to see this movie and remember the cartoon, think of the old show first, and be amazed as it almost comes to life. It cant actually do that, but they give it a frighteningly good shot.\n\nFavorite Popeye line \"Anudda ting I got, is a senkse of humiligration.\"\n\nI give it 8/10."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "scottdshaker",
        "review_rating": "8",
        "review_title": "Liked it 1980, Love it in 2016",
        "review_detailed_main": "To start I want to say that I Marginally liked this film in 1980. Before 1978's Richard Donner's \"Superman\" there weren't too many comic/cartoon adaptations out there so we really didn't know what to expect from comic book movies. In Robert Altman's \"Popeye\" the audience didn't get that Altman was trying to make a cartoon come alive without animation. Robin Williams performance was spectacular as was Ray Walston's and Shelly Duvall. People didn't think it should have been a musical and that the music didn't work and critics trashed it so the stars and director disowned this film.\n\nTim Burton's \"Batman\" in 1989 started to set the tone for what comic book movies should be but then the comic book themed movies fell apart with the rest of the Batman franchise until Christopher Nolan and Joss Whedon gave comic book movies a new direction.\n\nNow that there are comic book/cartoon movies out about every other month it would be great for younger viewers to revisit this film, I now find it delightful and hate to use the term \"ahead of its time\" but it really was!\n\nThe only hard part now it that most younger viewers probably don't know who Popeye the Sailor man is and its too bad that Robin Williams is gone because a new film with him as Poop deck Pappy would be a lot of fun!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "210west",
        "review_rating": "10",
        "review_title": "Charming -- in fact, magical",
        "review_detailed_main": "I guess you'd say this film is... controversial. Leonard Maltin declares it's a \"bomb,\" critics have termed it \"disastrous,\" and a lot of IMDb's viewers seem to find it either boring or (more weirdly) \"scary.\" I'm glad to see, however, that a number of IMDBers have hailed \"Popeye\" as an underrated classic; put me down on their side. I've watched the movie four times now -- certain scenes, in fact, more than a dozen times -- and continue to find it funny, charming in a quirky way, true to the spirit of the Popeye cartoons, and in fact quite magical. Normally I can't stomach Robin Williams, but he and Shelley Duvall are delightful and endearing in this; it's a bit of casting made in heaven, and they've got real chemistry together. Some viewers dismiss the musical numbers, but I love their oddly loose, unpretentious, offhand quality; the songs are simple, infectious, and -- that word again -- endearing. (Lately I've been walking around with the songs playing in my iPod; they can cheer one up in the middle of a New York crowd.) For me the best musical number is the first, the haunting and memorable \"Sweethaven,\" when -- after those strange, dark, disturbing opening-credit shots of the lone figure of Popeye rowing his way across the dark and stormy sea -- the sun suddenly comes out and we're introduced, as on a stage set, to the population of Sweethaven as one by one the characters come trooping out of their homes."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "pazuzu-2",
        "review_rating": "8",
        "review_title": "An under rated gem",
        "review_detailed_main": "When it came out, most critics trashed Popeye, except for Roger Ebert and Gene Siskel. I happen to have loved it as a kid and I love it now.\n\nRobin Williams and Shelly Duvall make a terrific Popeye and Olive Oyl. The songs were simple and fun \"I would gladly pay you Tuesday for a hamburger today...\". The atmosphere of Sweet Haven was very well rendered and the supporting characters all had... well... character.\n\nI think that the reason that this film was initially trashed is because of the rapid fire M*A*S*H* style dialog and humor which could seem out of place in a book about a comic strip character. I happen to think it contributed to the uniqueness of this film.\n\nLittle things weaving in and out of the film such as the Tax Man bits makes the film really unusual and textured. I hope that Paramount will someday release a letterboxed version of this film and recognize it as the underdog cult gem it is."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "GOWBTW",
        "review_rating": "8",
        "review_title": "I'm POPEYE The Sailor Man......",
        "review_detailed_main": "Everyone remembers the spinach chomping' fist popping' brawler who woos Olive Oyl(Shelley Duvall), and beats up Bluto(Paul L. Smith) at the end. It's Popeye(Robin Williams)! The salty sailor with big arms has hit the big screen hard. The town of Sweethaven has become a town under scrutiny when Olive's fiancé Bluto gives out a curfew, and the town's tax man(Donald Moffat) gives them a hard time. Popeye, the sea-fairing sailor comes to this campy town searching for his \"Pappy\"(Ray Walston). This old salt was working for Bluto until Popeye and Olive Oyl discovered SweePea in a basket. The Oyls discovered also what kind of a person Bluto was so Olive called off the engagement, because like she said about him, \"HE'S JUST A MEAN OLD BRUTE!\" The fight scenes in the movie are hilarious. The fight at RoughHouse's, the boxing match against OxBlood, and the fight fight scene against Bluto after feeding Popeye spinach, one punch turned him yellow. \"Scaredy cat! Scaredy cat!\" Very musical indeed, I think this movie is worth the keep for fans of the sailor. You must be strong to the finish, when I eat me spinach, I'm Popeye the Sailor Man! TOOT! TOOT! 3 OUT OF 5 STARS!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mschrock",
        "review_rating": "9",
        "review_title": "Impossible to recreate? Nope!",
        "review_detailed_main": "The recreation of Popeye characters in this film is phenomenal!!\n\nI've always felt one of the biggest challenges in movie making is to recreate characters that are either already well-known, or ones that have been fully developed in a best-selling book. No plot can carry a viewer along if they are aren't seeing the character they expect to see, and already love.\n\nIt's hard enough to do that for a book, but for a cartoon character who's actual visual image is ingrained in the entire viewing audience, it has to be a HUGE challenge.\n\nWell, Popeye and Olive couldn't have been done better. The rest of the cast is well done too.\n\nAny version of a \"Popeye like\" plot would be just fine. Just don't ask Popeye to do something the \"real\" Popeye wouldn't do, and I'm happy enjoying the recreated characters. Great movie!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "anniebell1977",
        "review_rating": "10",
        "review_title": "My favorite Movie from childhood",
        "review_detailed_main": "Popeye was the first movie I ever saw in the movie theater. I saw it with my father and grandfather. I have always been a fan of Robin Williams, and I think he did a great job playing Popeye. Shelly Duvall was wonderful as Olive Oyl, too. It is very hard to bring a cartoon to live action, and the cast was great."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "artzau",
        "review_rating": "9",
        "review_title": "I LOVE SHELLEY, ROBIN and RAY!!!",
        "review_detailed_main": "Yes. Shelley, Robin and Ray. They make this film a delightful romp. Forget all the negative comments and blasts sprinkled among the other (33 at this writing) reviews. It's not clear what those individuals were looking for in a movie made of a Thimble Theater carton which (now, this is hard to believe) even antedates me! Old guys like me who can remember the halcyon Hollywood days of WWII, can also remember Popeye from the strips, then in its sunset. However, the surge of early TV wanting to sell things to kids and thereby creating cartoon shows and using cheap (inexpensive) black and white cartoons from the 30s, reacquainted kids, like my own, with the Popeye characters. We're talking real Americana here, fans. Altman, Feiffer and Nilssen are taking on our history. As in any art, we can ask, \"does it work?\" Well, reading through the other comments, you'll find a concensus that supports the feeling that it works. I'm not surprised that some of our Brit friends are put off by Popeye. It's our humor and not their 'humour.' Altman and Feiffer have put together an eerie film, timeless in its scope and lonely in its landscape. Nilssen's music seems a little silly at times, but so what? Ray Walston IS Poopdeck Pappy; Shelley Duval IS Olive Oyl, and Robin Williams, even when he struggles to hold the squint, IS Popeye. I know, writing this, only \"buffs\" will ever scroll down to the 34th spot of a review, looking for opinions that either conform or oppose theirs; if they're looking for a suggestion as to whether they should see this film, I must say, see SHELLEY, RAY and ROBIN. Their performances are well worth the price of admission."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "snowblynd",
        "review_rating": "10",
        "review_title": "Great Musical Laughter",
        "review_detailed_main": "To date Popeye is one of my favorite musicals. The songs are nicely coreographed and witty. It have been some time since I have seen the movie as the video stores around me do not carry it. I have been patiently waiting for the DVD. To me this movie is a must see for someone in the mood for a great comic movie adaption as well as lots of musical fun."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "btemple-3",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "I think as far as kids movies go when bringing a \"Cartoon to Life\" this movie was great. I enjoyed it so much as a kid I watched it over and over again. In fact, this movie along with Mork and Mindy made me a Robin Williams fan for life. I think if this movie was casted incorrectly, it could have been a flop. But every character was casted perfectly from Robin Williams as Popeye to Ray Walston as Poop Deck pappy. Robin Williams brings such a natural talent to this character and make Popeye so believable. For some reason critics really didn't care for the movie, and all I have to say is either they aren't a Popeye fan, or they just didn't get it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "djk3030",
        "review_rating": "10",
        "review_title": "One of the rare movies where it's as much fun to watch what's going on behind the main characters as the main characters themselves.",
        "review_detailed_main": "Every actor playing a character from the cartoon has even the minor mannerisms of their cartoon character down pat. And the new characters I don't remember from the cartoon, such as Ham Gravy (also Bill Irwin's film debut) and the Taxman, are played with such finesse and creativity as to make them as memorable as that of Popeye (Robin Williams' film debut) himself.\n\nI saw it as a kid in the theater when it first came out and liked it then, then didn't see it again until I was adult with kids of my own, and loved it even more. On top of that, \"Pop\" was the first movie my daughter learned to say by name; and needless to say we watched it probably 50 times in the space of a few months before she moved on to \"The Wizard of Oz\" and \"The Sound of Music\"."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "magicsteven",
        "review_rating": "9",
        "review_title": "Recommended",
        "review_detailed_main": "I have to recommend this film... Having not seen it for many years, I returned to it and enjoyed it more than I thought I would. The Altman style is applied to the form \"Children's/Family Musical\" with great inventiveness. You may be surprised and exhilarated by the spirit and roughness of this picture."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "talkstick",
        "review_rating": "9",
        "review_title": "A lot of people don't like it. I hates them best",
        "review_detailed_main": "There is something about this movie. It's bizarre, unconventional, over-the-top, unbelievable, mildly offensive, short, and disjunct. There isn't really a plot, there isn't really character development or growth, there aren't really any poignant speeches or commentaries about anything at all relevant to the real world. But, who cares?\n\nThe quality that this movie has is that, it is so far removed from what one might expect from any movie, that you can't help but enjoy it. I think the only people that won't enjoy it are the types that are simply looking for specific things that they look for in all movies, or the types that can't accept something that doesn't make sense because it's not trying to make sense.\n\nThe movie is innocent and child-like, with a fascinating tone to it. Half the cast are Circus performers fercrissakes! All said and done, the Casting *is* remarkable. Everyone is cast about as perfectly as you could ever imagine for a translation of all the characters from Popeye. The Sets are pretty fantastic too. The songs are all strange, but they blend with the movie perfectly.\n\nOnce you get over your preconceptions about what a movie should or shouldn't be, you will enjoy this. You can't not enjoy it really. One reviewer said that not enjoying this movie is analogous to not enjoying puppies and babies playing with rubber duckies in a bubble bath. I think that is appropriate. The sheer detached nature of this film and it's complete lack of substance, combined with some truly clever wit and subversive humor, make it a real gem for anyone that enjoys the finer things in life."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "kevin_robbins",
        "review_rating": "8",
        "review_title": "This is an underrated family gem",
        "review_detailed_main": "Popeye (1980) is a movie my daughter and I recently watched together on HBOMAX. The storyline follows our solo sailor friend who is looking for his long lost dad and arrives in a small town where he was last seen. Meanwhile he runs into some new friends (Olive Oyl and Wimpy) a baby and a new nemesis, Bluto. Will Popeye and his new friends be able to find his father, while taking care of a baby and fighting off Bluto?\n\nThis movie is directed by Robert Altman (The Player) and stars Robin Williams (Good Morning Vietnam), Shelley Duvall (The Shining), Ray Walston (The Sting), Paul L. Smith (Maverick) and Paul Dooley (Sixteen Candles).\n\nThe sets, props, attire and cast are all so well done. The writing is also very good and Robin Williams delivers a mesmerizing performance. His mannerisms and voice were perfect. The fight scenes were so fun, as was the subtle and direct sarcasm. The boxing sequence was hilarious. There were also some cool and unique boats in this that gave this a magical feel. The ending is rewarding and concludes the plot to perfection.\n\nOverall this is an underrated family gem that is an absolute must see. I would score this an 8/10 and strongly recommend it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "wescodox-42300",
        "review_rating": "9",
        "review_title": "A CLASSIC ! Totally unfair reviews , a great production despite the flawed support. The movie provides wholesome laughs and interest and does great credit to the comic strip.",
        "review_detailed_main": "Great acting and singing !! Very entertaining. The people who gave their Reviews were extremely biased for reasons escaping me. I never expected this \"Popeye\" movie presentation to be so entertaining as a comedy and as a musical. . What will be remembered is the grossly unfair movie critics reviews. To the actors and director who performed so very well, I Salute You, THANKS for this great presentation of the \"Popeye\" comic strip !!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "chefseanaz",
        "review_rating": "9",
        "review_title": "A hidden gem of a musical.",
        "review_detailed_main": "Robin Williams in his only live action musical. His portrayal of popeye is phenomenal, with Shelly Duvall capturing olive oyle perfectly. The songs are fun, good way for kids and old folks to enjoy something together. Don't let the theatre snobs turn you away."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "crayzeekatlady",
        "review_rating": "10",
        "review_title": "RIP - WHAT GREAT TALENT LOST",
        "review_detailed_main": "Either you love it or you hate it - maybe kinda campy since it was previously a cartoon in 1929 - it's definitely a cult classic and not for everyone - it came out when I was 11 (do the math yeah I'm middle aged) I think the AYES have it I loved it then and still love it now - gonna rent it tonight in tribute - great bit of cult classic nostalgia (I think up there with The Princess Bride tho it's a different cast). Gone before your times RIP Ray Walston (dad) Robin William (Popeye), Shelley Duvall (Olive Oyl) and Paul Smith (Bluto), to those who can appreciate my love Ms Linda Hunt u are the best and a glass ceiling breaker - you touched me in \"The Year of Living Dangerously\" - Dennis Franz need I say how moving an actor you are, you really touched me in NYPD Blue - Paul Dooley! What can I say you crack me up in everything I've seen you in! This is an all star cast and maybe this could be considered campy but it's an all star cast and definitely a great cult classic with a great cast!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "lrallennyc",
        "review_rating": "9",
        "review_title": "Brilliant Moviemaking",
        "review_detailed_main": "It's one of Robin Williams most underrated performances. How can you even bring this to film to make it a real life version of a cartoon!? Incredible! And, while Shelley Duvall is not one of my favorites she embodied quintessential Olive Oil with emms and awes incredibly intact. While an amazing tribute to Robert Altman and his talent, the staging, sets, storyline, casting were spot on. The offbeat music and lyrics (and even the bad off pitch vocals) fit into the overall sweetness of the story. I want to live in Sweethaven and to know these crazy characters. A simpler time in America reminds us that life can still be relevant and fun!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "supersprung",
        "review_rating": "8",
        "review_title": "Great performance by Robin WIlliams",
        "review_detailed_main": "Robert Altman directed this film, can you believe it? I saw it in the theater in 1980 when I was 7 years old and I've seen it several times since. Maybe one day, a comedic role can get consideration for a best actor award, even if it's a local film festival award, and it's a shame Robin Williams wasn't recognized for bringing Popeye to life on the screen. Maybe it was the coke he was doing at the time, but he nails the character. He's got the voice, the mannerisms, the vulnerability, all nailed down. Nothing in this film that would offend, so it's great for viewing with your whole family and the Popeye characters span the generations like few icons do."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ghbrett",
        "review_rating": "10",
        "review_title": "One of the best comics as live action",
        "review_detailed_main": "This is my favorite comic re-done as live action. The sight gags were there, the characters were represented well, the location and sets were incredible. This is one of the few movies I watch over and over again.\n\nLike others I wish the soundtrack were available."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "prosak",
        "review_rating": "10",
        "review_title": "Wonderful! Whole family adores this film!",
        "review_detailed_main": "My family and I watched this film for the third time this evening--and we plan to watch it again this weekend before returning the video tape to the local public library. We range in age from 7 to 60-plus years old and all of us find the film absolutely delightful. We especially adore Shelley Duvall's performance. Duvall captures Olive Oyl to perfection and brings tremendous warmth and imagination to her performance. She electrifies the film and raises the level of an already excellent production another notch or two.\n\nI saw this film when it first came out twenty-some years ago and loved it then. All these years later, the film has only improved in my estimation.\n\nThe set, the costumes, the character acting, the choreography, the silly lyrics (which remind me a little of the absurd lyrics in the VeggieTale cartoons)are all brilliant. I'm not a scholar of Popeye cartoons, but I remember reading them in the 1940's, on Sundays, while lying on the living room floor after church. The film captures the flavor of that end-of-depression era, as I remember it: none of our neighbors owned a car, TV was unheard of, the iceman delivered ice for our coolers, the coalman delivered coal to our cellars, and there were no supermarkets.\n\nThe film is filled with interesting visual details and cartoon-like gags. We all laughed and sang along with the lyrics. This film is a treasure, one of the rare films that I would consider adding to my personal film library."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "emguy",
        "review_rating": "8",
        "review_title": "Charming fun, eccentric songs",
        "review_detailed_main": "This movie recaptured the spirit of the old comic strip and the old animated cartoons, including the odd little mumbled comments. Shelley Duvall was the perfect Olive Oyl. The wacky songs were different and fun. (My wife and daughter know and sing most of the songs, just for fun.) The movie looked great.\n\nThe movie also has a moral center, focusing on honor and loyalty, with no pandering to \"Hollywood\" morals.\n\nDennis Franz looks a little different in this early role!\n\nThe musicians were cameo roles for professional musicians: Klaus Voorman, Doug Dillard of The Dillards, Van Dyke Parks.\n\nI was fortunate in seeing this in theater release, because there were quite a few Popeye fans in the theater. There's an extra element of enjoyment in a movie if you're seeing it with people who are there to enjoy themselves."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "elking41",
        "review_rating": "9",
        "review_title": "Excellent Movie",
        "review_detailed_main": "It does provide a wonderful look at the cartoon life in Sweet Haven. My favorite line is when Popeye and Olive Oyl are taking care of Sweet Pea and Whimpy comes into the kitchen. He wants to take Sweet Pea to the betting parlor. He asks Popeye if he can take Sweet Pea for a walk, and Popeye says, under his breath which by the way is when most of the wonderful comments are made, He can't walk. Whimpy says, Well, I will carry him! Popeye then says to Olive, What is he going to do, take him for a drags? The good are really good and the bad are really bad and the miserable get happy. Also, the sets are remarkable. They are almost a maze of houses and simple construction. I know that they talked about how the set was destroyed and had to be rebuilt. The feel is of a cartoon, and not the Dick Tracy cartoon like movie set. But a real place that you could go visit. I don't know why one of the theme parks doesn't adapt it for a section in one of the parks. It makes me feel like a kid every time I watch the movie."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Scully2",
        "review_rating": "8",
        "review_title": "One of the most underrated movies today",
        "review_detailed_main": "People talk about how this movie was a total mess....well, I disagree with that because every time this movie is on TV I just have to sit down and watch it. It's one of my favorite movies from when I was a kid, and I'm not ashamed to admit it. Sure, the songs are not exactly noteworthy, the singing isn't the greatest (It's Sweet Haven, I'm not exactly expecting Phantom of the Opera), and a couple of performances were a little off (I can never think of Shelly Duval as anything else but Olive Oyl now). But it's Popeye! Are you expecting high drama?\n\nI still love this movie, even today. I recommend it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "stanford9",
        "review_rating": "10",
        "review_title": "\"Popeye\" Could Not Have Been Done Better",
        "review_detailed_main": "This is one of my favorite movies of all time, and I gave it a 10/10. I originally went into it because I thought it looked cute, and thought Robin Williams was a perfect choice for the lead role (he was.) When I walked out of the theater, I was in awe. Without fail, every single actor and actress they got for the well-known roles was perfect. Shelly Duvall as Olive Oyl? Who else could have done her justice? It wasn't only the cast in the movie, however. The scenery and sets, the locale, the creation of this little Sweethaven that could be Anywhere, Earth, the story itself when we meet Popeye for the first time.\n\nA co-worker of mine, who studied film in college, said that they used \"Popeye\" for study as one example of a technically perfect film, going far more in-depth than I ever could in this comment. Usually when I tell people that this movie is one of my all-time top five favorites, they laugh, but when I told him, I found a fellow fan who knew what an incredibly well-constructed and well-acted movie this is.\n\nIt has some VERY minor harsh language, but all-in-all it's safe for the kiddies (who I'm sure have heard those words before), but has a lot of more mature elements thrown in for the grown-ups. That's another reason I love this flick: just like the earlier original cartoons, the muttering and mumbling going on in the background and on the sly is quite scandalous and funny, if you pay attention to it. I'm sure it's Williams' usual ad lib that he's well-known for.\n\nOne particularly humorous ad lib is when he's reading a letter, with Sweet Pea in a basket in front of him, and Sweet Pea clearly says \"Baby.\" Williams points to the letter and says, \"Yes, you're a baby, it says right here!\" going along with the baby's actual word (the baby was the grandson of the producer, if I remember right.)\n\nI don't normally like musicals, but I love every single song in this film, and have seen it so often that I can sing along to it. I especially love the Sweethaven national anthem, and Popeye's little song to Sweet Pea is very endearing.\n\nSee this film, over and over again, as I have."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "TalesfromTheCryptfan",
        "review_rating": "8",
        "review_title": "Great underrated comedy!",
        "review_detailed_main": "A squinty-eyed big-armed sailor named Popeye (Robin Williams) arrives in a harbor town called \"Sweet Haven\" for a home and searches for his long lost Pappy (Ray Waltson). Over there he meets a Hamburger addicted man named Wimpy (Paul Dooley) and a skinny woman named Olive Oyl (Shelly Devuall) whom happens to be the fiancée to town bully Bluto (Paul L. Smith), she falls for Popeye's charms and adapts a baby boy named SweetPea. Now Bluto wants revenge by taking his vengeance on the town since Olive dumped him as Popeye has many adventures in stopping him and trying to find his father.\n\nEntertaining and underrated live-action musical adaptation of the beloved classic cartoons and comic strip is a wonderful little surprise from Robert Altman. Duvall and Williams were pitch perfect playing Olive and Popeye as they were the roles they were born to play, the film is truly faithful to the classic cartoons of yore. It features a handful of fun songs by Harry Nielsen like \"I'm Mean\" and has a great playful sense of fun thanks to the excellent performance of Williams as the title hero.\n\nThis film has gained a cult following and is one of the better live-action adaptations of a cartoon there is."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "hbot3000",
        "review_rating": "9",
        "review_title": "Give it a try...one of my favorites...",
        "review_detailed_main": "I was born in '78 and remember watching this movie on HBO in the early 80's. It has always stuck with me and made me a big Popeye fan. I recently got the DVD (which has NO special features unfortunately). While the plot is thin at best, the individual 'episodes' are amusing, the sets a real treat, and the chemistry between Popeye and Olive is actually very sweet. The music is hit or miss, when it hits it hits just right; when it misses, it misses by a mile (Bluto's song). The all out musical numbers involving many people are hard to understand or just poorly done, but the personal numbers between Popeye and Olive are especially good. I think \"He Needs Me\" as sung by Shelley Duvalle is one of the best musical numbers in any movie I've seen. She sings it off key and dances in an amusing fashion, but it doesn't get any sweeter. I showed my wife this film and she absolutely loved that song in particular. It was even used by Paul Thomas Anderson in Punch-Drunk Love. Give Popeye a shot, it's gotten a bad rap and gets better on repeated viewings."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "armstrongman",
        "review_rating": "10",
        "review_title": "A True Under-Appreciated Classic!",
        "review_detailed_main": "Popeye is perhaps one of the most misunderstood classic films of the late twentieth century in my opinion. Having seen the film six times in the theater at age nine, I may be biased of course, but I found the world of fantasy that Altman, crew, and cast created, utterly brilliant. From the enchanting town of Sweethaven (built from entirely from scratch on the island of Malta off Italy's coastline) to the costumes and larger than life characterizations and double talk, it's all truly inspired. I still believe Robin's portrayal of Popeye is one of his great acting achievements of his career. He managed to harness something intangible about the cartoon that neither I, nor anyone most likely, had ever really seen to the full extent... the true heart of the irascible sailor. You feel like you're watching an emotionally three dimensional human being, a cartoon come to life. And some of the best moments are in the mumblings and mutterings that Mr. Williams seemed to improvise to a large extent. For example, when he interacts with Olive Oyl's mother and asks about their \"room for renk\" she responds in a mind-numbingly odd way that leaves Popeye bewildered. He looks at the mailbox and sees the name \"Oyl\" and mumbles to himself, \"Oyl. Dat explains it. She must be a quart low.\" Witty, clever, brilliant. Altman's direction is also key because he lets scenes play out and breathe so that the quirky, uncomfortable moments that happen in real life are also there in this fantasy world. It lends such credibility to what could've been an overblown, vacuous cartoon movie. It's a tribute to Altman's understanding of the human condition that he injected vulnerability and caring into the characters. Ray Walston's portrayal of Poopdeck Pappy is a great example of this emotional layering. We see his disconnect from Popeye and the bitterness and regret of years lost with his son which eventually gives way to love, acceptance and true joy. It's a heartfelt subplot that, again, adds to the broader canvas of honest emotion in the film. Shelley Duvall as Olive Oyl is also one of the great casting moves of all time. Has there ever been a person more suited to play a part? Her physical resemblance to the character is incredible, but it's what she does with her voice, her walk, her eyes, and just about every single part of her being that makes her the embodiment of Olive Oyl. Finally, no review of \"Popeye\" would be complete without talking about the incredible soundtrack from the legendary Harry Nilsson. It is another truly overlooked gem. Best known for the classic theme \"Everbody's Talking\" from the film \"Midnight Cowboy,\" what Nilsson does on the Popeye soundtrack is as imaginative and emotional sonically as the film is visually. It is an anthology of the entire film, a storyline told in song. From Popeye's initial arrival into the sleepy harbor town of Sweethaven which is punctuated by Nilsson's small town celebratory anthem \"Sweethaven\" to his triumphant self-affirming declarations of \"I Yam What I Yam\" and \"I'm Popeye The Sailor Man,\" the music takes you on a journey along with the characters. Since \"Popeye\" is essentially a musical in large part, all the main characters get their theme. Bluto sings with conviction, \"I'm Mean\" while blustering around and intimidating locals. Olive Oyl croons, \"He Needs Me\" as a plaintive ode to Popeye's love for her and her realization of that love. Even Poopdeck Pappy gets in on the act as Ray Walston belts out the grumpy, \"It's Not Easy Bein' Me\" and \"Kids,\" an analysis of the parent/ child dynamic that could be an addendum to any Freudian psychology class. Really listen to the lyrics as Pappy uses double talk and double negatives to hammer home his litany of irritations with little tykes. Quite amusing. When it was released in 1980, \"Popeye\" was universally panned by critics, and it was partially responsible for sending both Robert Altman and producer, Robert Evans (former head of Paramount) into tailspins. They had both been legendarily out of control on set with partying and drug use. In an episode of \"Inisde The Actor's Studio\" Robin Williams spoke about this in response to a question about what working on that set was like. He said \"It was Altman and Robert Evans. Whoa! Throw in Harry Nilsson, and you've got yourself a weekend. Even Betty Ford's going 'I'm booked.\" Very funny way to sum it up. A side note of interest: the song \"He Needs Me\" is also used by Paul Thomas Anderson in his film, \"Punch Drunk Love\" to great effect. Anderson is a self- confessed Atlman fanatic, and his films are reminiscent of the Altman style with the naturalistic over-talking and large, talented casts. Okay, that's it. Go rent the \"Popeye\" DVD and sit down with the kids to enjoy a fun ride.\n\n***No spoiler below, just a hidden treasure to look out for**** There is only one curse word in the movie, but it was clearly thrown in almost as a subversive afterthought: when Popey jumps off Poopdeck Pappy's ship into the ocean near the end of the film, listen closely to the word he screams on the way down. It's a \"colorful\" one that nearly slips by if you're not really paying attention. It ain't \"geronimo\" that's for sure."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "paprikapink",
        "review_rating": "10",
        "review_title": "One of my all-time favorites",
        "review_detailed_main": "I didn't love it much when I first saw this movie back in 1980, but maybe it was just ahead of its time (or was I stoned?). I've seen it again now, in 2007, and it got me! I love the goofy songs. I think \"Sweet, Sweethaven\" is beautiful and sad and funny. Shelley Duvall and Popeye couldn't have been more perfectly cast. It's visually rich -- there is something going on in the background of every scene. And of course it's Robert Altman -- something going on in the background of all the dialog too. The baby who played Sweetpea is possibly the most adorable movie baby of all time. Okay, I haven't made an exhaustive survey. But what a cutie!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "fjustice",
        "review_rating": "",
        "review_title": "The best comedy of the 1980's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "SHB_73",
        "review_rating": "9",
        "review_title": "Popeye's the man! (sailor man)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "breakdownthatfilm-blogspot-com",
        "review_rating": "10",
        "review_title": "As good as a live action cartoon gets without CGI",
        "review_detailed_main": "With all the live cartoon adaptations that are coming out now, it's amazing how people forget the films that were done without computer generated images. Director Robert Altman's Popeye is one of those films that should be given credit. For being a film that was released before CGI was a prominent special effect, it does a spectacular job at making all the characters look as accurate as possible. And that's just one of the aspects of this film that makes it stand out from the rest.\n\nRobin Williams stars as the one-eyed sailor and I got to admit, it was a smart choice casting him. Williams' acting is brilliant. All the mannerisms, speech impediments, and wisecracks are all like what Popeye would probably say and they're funny to hear. Not to mention the costume he wears is great looking too. I'm curious to how they got him to have such large arms. Playing Olive Oyl is actress Shelley Duvall. Her acting is also very accurate because of how physically lanky her body structure is. Her clumsiness adds to the humor as well.\n\nMy favorite character in this film was Poopdeck Pappy acted by Ray Walston. Walston has some really comical lines and it's even funnier whenever he's laughing or ranting. I'm not going to list all the actors because the cast goes on and on but to summarize, Altman picked the perfect set of individuals to portray every character in this movie. Supposedly, Altman hired many actors from a circus to participate. This make sense because throughout the film, the viewer will notice many of these actors are quite flexible. This is a good thing to have when it comes to creating a live action cartoon movie.\n\nThe area I wasn't expecting in Robert Altman's version of Popeye was the music. Discovering that the actors also have their own solos was an interesting add-on. At first, it may seem like the singing parts weren't necessary but it turns out that having the cast break out into song gives the story a little bit more liveliness to it. So in retrospect, this film doesn't have a musical score because it is a musical. The songs aren't bad so there's nothing to really dislike about it. My favorite was the \"Everything is food\" song. Throughout that entire song, there were a lot of funny parts.\n\nGoing back to special effects, there is absolutely no CGI in this film. Everything is formed one way another that uses anything in the physical world. This is what makes this film so good because everything is real and on screen for the actors to touch. When Popeye and Bluto fight, the way they fight is all made to look like no matter what happens, they are still on screen. Also any objects that any characters touch can fall apart or break off which adds to the comedy of the film.\n\nComedy is the other great element to this film. Even though much of it is over the top gags, a lot of it is still funny. What was most enjoyable was how the actors coordinated the gags. For example, Popeye finds his pipe on the ground and above him a group of men carrying a piano on a ledge. The group loses grip of the piano and it sways right over Popeye's head just as he bends down to grab his pipe. If that's not well planned timing, then I don't know what is!\n\nFor 1980, the cartoon live action version of Popeye is done with utmost preciseness in its characters and comical elements. This is also probably the only cartoon adaptation that is a musical too, which makes it that much more culturally deviant."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "johnstonjames",
        "review_rating": "9",
        "review_title": "A Message Of Togetherness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "elmerldodson",
        "review_rating": "8",
        "review_title": "Highly underrated.",
        "review_detailed_main": "Maybe it's not thought provoking, diverse & use popular hit songs--but it's still genius at casting /set work & the ability to bring a comic strip character to life without 'in your face' violence & mind blowing CGI. I'm surprised a director even risked trying, that's a TALL order. Many higher rated movies fair poorly over time due to their referencing current fads (Shrek?), Popeye won't. It's worth rewatching just to study background details & overall cast acting, then you'll see it's greater than the sum of its parts."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "zjfrendt",
        "review_rating": "9",
        "review_title": "Whaaaaat? This movie is fabulous! Fun and Quirky!!",
        "review_detailed_main": "I used to watch this movie as a kid and always loved it. Now, 25 years later, I am watching it for the first time with my own kids, and thinking how much more I love it now than before!! Just for fun I thought I'd check out the ratings.....and I was SHOCKED! This movie is wonderful. The songs are funny and silly (as a Popeye movie should be) and EVERY SINGLE CHARACTER is NAILED by the actors/actresses!! I am sooooo disappointed that the critics have been so harsh on this sweet, funny, romantic and musical gem. I have to believe that it was just way before its time and if reviewers were watching it today they would see exactly the kind of magic going on here. People love comic strip films today, and revel in the plays on the original. While I won't go into detail on the plot (it's Popeye....so, think Popeye!), I just felt that I HAD to add a good review. I hope that some day this film gets the recognition that it deserves, and that Robbins, Duvall and Altman, among others, receive all due credit for their sincere adaptation of a beloved cartoon classic!!!!!!!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "tm880",
        "review_rating": "8",
        "review_title": "True to form",
        "review_detailed_main": "This movie was one of the greatest adaptations from comics to date. I have been an avid Popeye fan for years before this movie. My preference was always towards the original black and White cartoons. To this format, the movie stays true. From the occasional mumbling by Popeye to himself, to the interactions of whimpy, bluto (not brutus as he was called in the 70's) and Olive.\n\nGranted the fact that it plays mostly like a musical can get some what annoying at times, mostly due to the poor songs, But the acting by R. Williams, S. Duvall and R. Walston more than make up for the lulls. This was the perfect High Energy movie for Robin during the Mork and Mindy Era. I can't say enough about the comedy and fun in this movie."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "nightowl_2004",
        "review_rating": "",
        "review_title": "Before its time***SPOILERS***",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mickdoyle",
        "review_rating": "9",
        "review_title": "Songs and Lyrics by Harry Nilsson",
        "review_detailed_main": "Harry Nilsson wrote all songs and lyrics, 3 years after his RCA contract expired, right after Steve Cropper, the producer of his last album, \"Flash Harry,\" was unsuccessful in getting the album released in the US and had to settle for releasing it in the UK only (on Mercury). This soundtrack is probably one of the last things that Harry Nilsson did as an actual job, making actual money. The simplicity of his lyrics is key, keeping the movie accessible to children (See \"The Point\"). A few of Harry's colleagues & friends have bit parts - Van Dyke Parks as the piano player, for example.\n\nRobert Altman's direction is dead on. He keeps everything moving. Robin Williams showed he can act. No doubt a lot of Williams' mumbling was ad-libs, but surely he and Altman created the character together. Shelly Duvall is a great of course. A 30's style musical updated for 1980. It still works. How hard has it been to actually pull off a musical since the 1950's? HARD; REALLY hard, yet Altman and company do it.\n\nThe screenplay: This is first and foremost a musical. Considering, the screenplay holds up rather well. With Popeye, what would YOU do?\n\nRecommended to fans of Popeye, Altman, Harry Nilsson, Shelly Duvall and of course Robin Williams."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "funmelodies",
        "review_rating": "",
        "review_title": "Beautiful and Trippy Melodic Mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "AzRanger",
        "review_rating": "10",
        "review_title": "Cartoon to movie - Perfectly!",
        "review_detailed_main": "By far, the best ever remake of a popular cartoon into a live action movie! I saw all the favorite parts of the cartoon I grew up with immortalized in this movie. `I would gladly pay you Tuesday for a hamburger today.' I gave it a 10!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "billymac72",
        "review_rating": "",
        "review_title": "Could use a little more spinach.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "artzau-531-978839",
        "review_rating": "8",
        "review_title": "Under-appreciated",
        "review_detailed_main": "Robin Williams's first starring role kinda fell flat in 1980 for a number of reasons. Fist, the Thimble theater cartoon by Segar went through several changes but had been pushed out of the mainstream viewing by such more cerebral cartoons like Peanuts, Doonesbury, Bloom County and then 5 years later, Calvin and Hobbes. As late as the 60s, these Popeye cartoons were seen only on kiddie shows and as such, were long out of the public view. Hence, the appeal of the strip was restricted to old duffers like me who grew up with Popeye in the 40s and 50s.\n\nToo bad, because this film reflects the talents of Altman and Feiffer, maintains a level of tristesse and timelessness that hearkens back to the old Segar cartoon strip. My only criticism of the acting was Robin Williams's difficulty in getting Popeye's squint done which Ray Walston did so beautifully."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Trtlervr",
        "review_rating": "",
        "review_title": "A Hate/Love Thing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mhmcintyre-74425",
        "review_rating": "8",
        "review_title": "Picture Perfect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "jclvpjm",
        "review_rating": "",
        "review_title": "Changed my view of critics",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Bellatrice",
        "review_rating": "9",
        "review_title": "Max Fleischer and Popeyes",
        "review_detailed_main": "I have always loved cartoons from the depression era when many of the studios were still located in New York. The \"stretch and squeeze,\" morphing (and other physical impossibilities) were hallmarks of these animated films. They also reflected the times. \"Snow White, Any Rags, Pots'n Pans, the Old Man of the Mountain\" are works I never tire of watching. They reflect gritty street life, wishful thinking, hunger (I will gladly pay you Tuesday for a hamburger today), poverty, joie de vivre and hope.\n\nThis era also gave rise to many cartoon strips which served as inspiration for animated films. Max Fleisher was one of the pioneers. He created Betty Boop, Popeye, Gullivers Travels and many more.\n\nI think the movie pulled off a miracle in keeping that surreal quality. Robert Altman was the perfect director with his busy visuals and overlapping dialogue. The set design reminded me of Tim Burton's Nightmare Before Christmas with its crazy, cartoony settings. And Shelley Duvall was brilliant as Olive Oyl!\n\nThis film reflects an imagined reality far different than that of Spongebob, and unless one seeks it out, it's not that easy to find. Check out YouTube if you're curious."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "arndt-pawelczik",
        "review_rating": "8",
        "review_title": "Surprisingly enjoyable oddity",
        "review_detailed_main": "This is by no means a great film. This is not even a good film by conventional standards. And how could it have been? Who - knowing the original Popeye cartoons - could ever have thought it would be a good idea to make a live action film of the subject? This was always doomed to fail. And it does in many ways.\n\nBUT...then there are the performances by Robin Williams and Shelley Duvall. They are a joy to watch, as these two actors give their roles a unique charm and by doing so save the film. The whole thing feels like you are watching a high school production of a Shakespeare play, and it is predictably pedestrian and even sometimes cringe-inducing, but then the two leads appear and not only save the day but make you come back for more the next night.\n\nAnd a special shout-out to Wesley Ivan Hurt in the role of Swee'Pea, the cutest film baby I have ever seen."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "comedyfan718",
        "review_rating": "10",
        "review_title": "I feel sorry for anyone who doesn't like this movie.",
        "review_detailed_main": "How could anyone not like this movie??? Seriously, what is wrong with some people. I've read some negative comments and people say they can't understand what Popeye says... they must be hearing impaired, everything he says is hilarious. Some people say the songs stink... I guess some people have no taste in music. One reviewer says he walked out of the theater... why were they at a children's movie anyway? Some people are really, really stupid. The songs alone would be worth the price of admission, even without all of the great jokes that pop up every few seconds. This movie is a classic, heartwarming, and really funny version of a cartoon, which I guess some people just don't understand. I really feel sorry for them... go watch a gory or pretentious movie for people without hearts.\n\nJust to correct a few more mistakes by reviewers: Popeye made fifty million dollars domestic box office (more than Robin Williams' next two movies combined) and cost twenty to make, it was a commercial success. It also made more than his third and fourth movies combined, it made more than The Fisher King (his best movie), and more than License to Wed recently did. Get your facts straight before you post a review.\n\nIt was an artistic success as evidenced by the fact that it is still shown on TV regularly 28 years later, and so many people love it.\n\nIt was a critical success. Critics like Ebert and Canby loved it, according to the web.\n\nIn the early cartoons Popeye hated spinach. Who in their right minds likes raw canned spinach? Get a clue people.\n\nThe funniest thing about the reviews is people going on and on about the director. I personally didn't know until now who directed it, and I absolutely couldn't care less. Some people are really full of themselves and their 'movie expertise', sorry for them it gets in the way of pure, simple goodness.\n\n\"Sweet Sweethaven. God must love us.\" Absolutely classic, I never thought of it as a musical because the songs flow from the emotions of the characters. When I sing in the car that isn't a musical, its life.\n\nNow remember, its based on a cartoon, not a deep philosophical novel, and its meant to be silly, goofy, and fun. If you are a fun person then this movie is for you, otherwise watch some mindless violence and special effects or whatever sad, dreary dross that speaks to you. Negative reviewers must be jealous of people with joy in their lives, don't let them steal your fun. Every characters' movement is visual comedy, every mutter (espcially about Popeyes' fadder) is a comic gem."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Quinoa1984",
        "review_rating": "9",
        "review_title": "wavers between campy send-up and real 'family' entertainment, it's Popeye squared Altman",
        "review_detailed_main": "I know I shouldn't recommend Popeye, but somehow I yam (ugh, did I just make that pun, forgive me). Maybe it would be a different perspective had I seen it when I was little- frankly I'm not sure why I missed it, as I liked the cartoons and liked Robin Williams- but now as an adult Popeye is one crazy kind of movie. It's a work that is all its own, even as it looks way too derivative of bad kids musicals and second rate slapstick. But there's 'something' to Popeye, I can't quite put my finger on it, and it's due more than likely to Robert Altman.\n\nSome have said the film's a masterpiece (I wouldn't go that far), while some say it's a travesty (I wouldn't go there either). One thing is for certain: under a different director, either more mainstream or of a more high-velocity action-movie kind of filmmaker, Popeye wouldn't look and feel this way. Yet Popeye turns out to be satisfying because Altman does what any of the exceptional directors- Sam Raimi, Tim Burton, Guillermo Del-Toro, Richard Donner- who've adapted comic books do, as he captures the spirit of the source in a specific style suitable for the director. It's far from being any great work of art, but I'd dare anyone else to make a Popeye film as joyful and buoyantly crazy as this.\n\nAnd maybe such an idiosyncratic director like Altman- who as Gary Trudeau once said is a great director of 'scenes'- could translate such simple little diddies like Popeye stories. There are no big arcs to follow or a whole host of villains that Popeye must thwart; the only story is that Popeye (Robin Williams) comes to Sweet Haven looking for his Pappy, only to find that he's something of an outsider among the town's multiple eccentrics, meets and sort of falls for Olive Oyl (Shelly Duvall), and gets into hot water with Bluto (Paul L. Smith) while trying to protect a baby named Swee'pea. The rest of the picture is like a big ball of impressions taken from the original strip, and a little from the cartoon (sorry, folks, not much spinach until the climax). But what Altman also goes for is the manic side of Sweet Haven, how many rules there are with the guy who fines you for every little thing (unless you're Olive Oyl for some reason), and bullies seem to be right at the Burger joint on the mark. Luckily there's not too much overlapping dialog like in his other films, otherwise it might get cluttered- that is, if it isn't already.\n\nDid I mention it's a musical? And not a great musical by any stretch. I'd imagine it wasn't Altman's intention- maybe more Robert Evans, or whomever, maybe Disney- to make this film a musical, least of all like this, where the ratio is split down the side: half the songs are actually pretty catchy, or at least performed well (\"He Needs Me\", which Olive Oyl sings and was used in Punch-Drunk Love recently, is probably my favorite after the original theme song), and the others are just bad, dead weight (the song that Popeye sings as he writes a letter to Swee'Pea and brightly hued images of Swee'Pea pop up, is atrocious, as is Pappy's number when he's tied up). Yet somehow the songs don't detract a whole lot from the rambunctious attitude to comedy. Sometimes it might be something unintentional, like a line from Williams as he mutters a throwaway jab or observation that's a riot. Or the physical pratfalls, mostly expected like Olive's clumsiness or Bruto's BIG anger in the house enraged at waiting for Olive, that do connect.\n\nIt's this cheerfully mad attitude that keeps Popeye from becoming a total warp of a kids movie, where watching Popeye go to work on a Oxblood Oxheart in a boxing match is beautifully choreographed to the wacky comic-book mentality. The only danger in all of this then is to consider whether much of this is funny because it genuinely is, for a family movie anyway, or if it's just so corny that you can't help but laugh.\n\nIt's not a Howard the Duck scenario, of course, but there are times when it is, frankly, stupid stuff Altman's dealing with here, and ironically photographed in mostly great compositions from Giuseppe Rotuno (yes, of 8 1/2 fame) and with wonderful production/costume designs. Where else will I see an animatronic pelican and (a totally spot-on) Shelly Duvall getting dragged underwater by a rubber octopus, least in an Altman film? Or Robin Williams with fore-arms larger than his head? Could it be a guilty pleasure? If it is, then damned if it isn't one of the sunniest and most delirious of the 80s. Well, blow me down!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "runamokprods",
        "review_rating": "8",
        "review_title": "A lot of fun, but promised even more",
        "review_detailed_main": "A lot of fun, with Shelly Duvall a flat out fabulous Olive Oyle, Robin Williams, excellent as Popeye, Paul Dooley a great Wimpy who steals almost every scene he's in and good old Ray Walston is terrific as Popeye's dad. The production design is amazing, and the whole thing comes as close to creating a live action cartoon world as anything I've ever seen. Harry Neilson's songs are pretty great as well.\n\nOn the other hand, after starting out like a masterpiece, it doesn't really go anywhere. The plot lines get more conventional and less subversive as it goes along, and the climax is pretty instantly forgettable. At first you think it's going to be Popeye meets Threepenny Opera, a complex social satire under the jokes, but it ends up just sweet, good natured, wonderfully done, but slightly shallow fun. That's more than enough reason to see it, but just slightly disappointing when you think what could have been."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "jeremycrimsonfox",
        "review_rating": "9",
        "review_title": "Exciting, Underrated Musical",
        "review_detailed_main": "Watching this movie, this has given me a lot of hope. While most live action movie adaptations of classic cartoons basically change stuff up a lot to fit with real life or to make the topic modern, Popeye keeps it classic.\n\nWhile the story can basically be seen as sort of origin story for Popeye, it makes good care to ensure the characters are as accurate to the original cartoon shorts as possible. Popeye comes to the town of Sweethaven looking for his Pappy, but gets more than he bargained for when he crosses Bluto, the leader of the town, causing the Oyls, who welcome him into their house, to be hit with heavy taxation. However, an orphaned baby Popeye finds, which he names Swee'Pea, has the ability to predict the future, causing Bluto to think he is a good present to offer to the Commodore.\n\nThe late Robin Willians does a good job playing Popeye, who is portrayed as he is in the cartoons (down to the oversized lower arms that are the character's trademark). Shelly Duvall does a perfect job as Olive Oyl and Paul L. Smith makes a good Bluto. The movie does a good job recreating the slapstick of the original cartoons, and the songs it has are well done, considering this is a musical. If more live action movie adaptations of cartoons were as good as this, then they would not have the bad reputation they are getting."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "atomicjeff-41850",
        "review_rating": "10",
        "review_title": "I am what I am, Yuck Yuck Yuck.",
        "review_detailed_main": "Popeye is one of those underrated films that was not given much credit considering the outstanding performances by the cast. Popeye the sailor was brought to life by the late and exceptionally talented Robin Williams. His performance captured the heart and essence of this beloved cartoon hero. Shelly Duvall did equally the same outstanding performance bringing Popeye's beloved sweet Olive Oil to life. The other supporting cast from Bluto, Wimpy, The Commodore, and the entire cast that comprised the rest of the towns people also did an exceptional job. This was a action drama musical like Popeye himself packed a punch. This movie was never given credit for its brilliant writing and songs that were featured. I still can hear the opening song to the movie, \"Sweet Haven\", in my head after all these years. Popeye came out over 44 years ago, which is hard to believe, yet it feels like yesterday to me. Robin Williams should have been nominated for an Academy Award at the least for his performance, because this character would be very difficult for an actor to pull off, and Robin knocked it out of the park. If you have never seen this querky, fun, and charming movie, sit down, open up a can of spinach, and watch this movie that really is a cinematic masterpiece, you will be glad you did."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "martijnvanderveeer",
        "review_rating": "9",
        "review_title": "Magnificent",
        "review_detailed_main": "Just watched Popeye (1980)\n\nIt is indeed a masterpiece.\n\nBest movie I have seen so far this year.(May,2016) Williams and Duvall are brilliant.\n\nThe set and lighting are amazing and dreamy perfect in every detail. There is something undefinable about it. As if it makes perfect sense but it doesn't.\n\nComplex yet simple. Real yet unreal. Just like a cartoon.\n\nDuvall's performance in the song 'He needs me' is magical.\n\nArt and entertainment in its purest form."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Rainey-Dawn",
        "review_rating": "9",
        "review_title": "I Still Eats Me Spinach",
        "review_detailed_main": "I was 8 years old when Popeye came out on the silver screen. I had a lot of fun watching the film then, and I have as much fun now. - And I still 'eats me spinach' to this very day.\n\nI don't understand how this film can be rated so low on IMDb, Letterboxd and Rotten Tomatoes. Maybe because Shelly Duvall's breakdown shortly after? Maybe because Robin Williams had to dub his character 2 times? Is the story that boring to them? Do they not like Popeye cartoons? I'm unsure. I for one still love this movie.\n\nDuvall, Williams, Smith, Walston, Dooley and the rest all nailed their roles. The songs are joyful to hear. The costumes, set designs, story and cinematography are all aces.\n\nIf you haven't seen Popeye 1980 then I recommend watching it with an open mind and thoughts of your childhood memories of Popeye.\n\n9.5/10."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "densonjohn",
        "review_rating": "10",
        "review_title": "One of the best movies ever.",
        "review_detailed_main": "Popeye is total entertainment for the wide-eyed kids and cynical adults alike. Robert Altman knows this, and he throws it in our faces.\n\nAltman wants us to know this is a live play on film, (the sets especially standing out). The casting is perfect. The sound, effects, make-up is as if it's a cartoon. Duvall's Olive Oyl is perfect, as is Williams' Popeye.\n\nThis may not be in my top ten movies ever, but it's in my top twenty for sure. It's like live artwork. The classic stories of Popeye, Olive Oyl, Bluto and Wimpy are all there, yet they're almost overshadowed by the imagery.\n\nI've never understood why this movie was panned. It's brilliant."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "turboglo",
        "review_rating": "10",
        "review_title": "Heart warming",
        "review_detailed_main": "I just don't get it. Why does this movie have such a low score? First, let's start with the cast. From each of the lead characters to the smallest bit parts, every performer in this ensemble brings a piece of the cartoon to life. Even the ridiculous tax man is lovable. The costumes and set design are like those of a great a stage production, yet they translate perfectly to film. The minimalist songs by the late, great Harry Nilsson manage to be both contemporary and reminiscent of more innocent times. The Jules Feiffer script, including the back story of Popeye's father, is funny in typical dry Fieffer fashion, yet is deeply human and heart warming. I saw this movie when it first came out and have seen it a couple of times since. My appreciation has just grown over the years."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "9",
        "review_title": "Underrated Comic Book Film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Mr Pants",
        "review_rating": "",
        "review_title": "Hoopla!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Mfbarry-90-773507",
        "review_rating": "9",
        "review_title": "Under Appreciated Masterpiece",
        "review_detailed_main": "A really mis-understood film, Altman brings to life the incredible Fliescher Studio cartoons of the 1930s & 40s. Widely considered some of the greatest cartoons ever made (and rightly so) the Popeye in those cartoons was hilarious, mumbling wiseass, sarcastic and, often, risque comments under his breath; the type of cartoons that kid can enjoy but adults will get a whole different level of humor from. Wickedly clever stuff, years ahead of it's time, with Olive Oyl often matching Popeye comment for comment. (Years later both characters would be lobotomized and cleaned up for Saturday morning cartoons along with Bluto being renamed Brutus.) Anyway, the original Popeye cartoons and Thimble Theater comic strips were filled with hilarity, adventure and great characters. Long before CGI Altman brings that whole world to life. His direction and Williams and Duvalls performances are amazing and hilarious. I've recently upgraded my review from 7 to 9 stars due the the new widescreen blu-ray release. It's phenomenal. Enjoy."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "bensan9",
        "review_rating": "10",
        "review_title": "I also put my vote in for this being a masterpiece.",
        "review_detailed_main": "This movie is its own very quirky yet fun world. The set is awesome. It looks like they created their own amusement park to film in. It is all made before digital octopuses or fake digital worlds, so that is also much more pleasing to the eye.\n\nYou get to enter into the set and join the actors who are totally giving their all to their roles. The voyeuristic feel is certainly an Altman movie characteristic and it blends well with the cartoon feel.\n\nRobin Williams is great. No one else can do what he does in his roles, and this one is no exception. I also really enjoyed watching Shelly Duvall almost more than Robin Williams. The other actors were also totally given to their roles and to making the very strange world come to life. The music was mesmerizing as well.\n\nI saw this a few times when I was a kid, so that may have helped me enjoy it. But I am going to be watching this tons more in the future. Masterpiece."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "stinky_kniggits",
        "review_rating": "10",
        "review_title": "An underated masterpiece",
        "review_detailed_main": "If you've ever watched the cartoons you observed: Popeye mutters, Olive Oyl whines, Wimby is a beggar and the tempo of the cartoons was wonderfully emulated in this movie.\n\nI was fortunate enough to see the movie in the original release. And now it can be enjoyed on demand in HD with a booming surround sound system. The songs are wispy and that's what makes the fun.\n\nI love this flick and am glad to have seen this."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "abalpn-99472",
        "review_rating": "10",
        "review_title": "A classic masterpiece of comedy from the great Robin Williams",
        "review_detailed_main": "Robin Williams really did brought Popeye to life in the big screen. I remembered that I watched it on television before and I saw it again on YouTube. There were great moments from comedy and musical numbers. I noticed that there were people saying that they disliked this film but others said that they enjoyed watching it. This is Robin Williams' greatest work. It's heartwarming and fun. They don't make movies like these anymore."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "josephwilliams321",
        "review_rating": "10",
        "review_title": "short but sweet",
        "review_detailed_main": "This film is near on as old as me and i had never watched this due to its bad publicity and critics but just watched this and was blown away not only by its story but acting too.robin williams shows what he could do in his first film he was ever in playing popeye and shelly duvall is olive oyl.if you can picture the cartoons of popeye then they both look and act like them.the story can be a little jumpy sometimes but if your wanting to get a kids film for a family night you cant go wrong with this.classy wholesome fun that leaves you warm after you watch this."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "truemythmedia",
        "review_rating": "8",
        "review_title": "A Disasterpiece",
        "review_detailed_main": "One of the things I enjoy most about the cinematic art form is when I find a movie that is truly one of a kind.\n\nAnother thing I love about film is when a director, crew, or actor gives it their all and fails spectacularly, despite never giving up.\n\nYet another thing I love about film is the memory I have of watching movies with my dad and brother as I grew up, whether I always understood the movies or not.\n\nTo me, \"Popeye,\" is a perfect storm of those three things.\n\nLook. I'm not going to say that this is a great film. It's not. I'm also not going to say it's a disaster, as many critics might. It's not. I'm not going to say everyone should see this film. They shouldn't.\n\nBut there is an audience for this film that I believe will love it, warts and all.\n\nIt's hard to describe to someone how bizarre this film is. Imagine a film where someone thought, \"Hey, I love Popeye cartoons. There should be a Popeye movie, but not a cartoon movie. It should have all the same cartoony gags, cartoony outfits, and cartoony characters, but it should be live action, starring Robin Williams, and it should be a musical.\"\n\nDoes that sound insane to you? Does it sound fun to you? Does it sound like a charming disaster?"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mexicanmoon16-809-24579",
        "review_rating": "10",
        "review_title": "My Childhood Favorite",
        "review_detailed_main": "I was 6 when this came out and I loved it! I still do! I can't think of a negative thing about it. Olive Oil cracks me up and is played really well by Shelly Duval. Robin Williams made a perfect Popeye too!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "watrousjames",
        "review_rating": "8",
        "review_title": "Corny, but fun film.",
        "review_detailed_main": "This is Robert Altman's only family friendly film. A musical comedy based on an old comic strip and cartoon. The critics panned it though a few liked it such as Roger Ebert and John Stanley (former film critic of the San Francisco Chronicle and author of THE CREATURE FEATURE MOVIE GUIDE). I just re-watched it. I haven't seen it since I was a little kid. I wondered if I would like it or not. I did. It was fun. Robin Williams was very good as Popeye. Shelley Duvall gave one of her best performances as Olive Oil. Paul L. Smith was a little over the top as Bluto. Ray Walston and Paul Dooley were good as Pappy and Wimpy. The supporting cast was good. Even the baby who played Sweet Peas (and was Altman's grandson) did a good job. The set design and costumes were all done. Yes, it is bit corny, but so was the cartoon. The songs were mostly forgettable except for \"He Needs Me\" and the final \"Popeye the Sailor Man.\""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Mike Sh.",
        "review_rating": "",
        "review_title": "Really, really, really bizarre!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "cherubrat",
        "review_rating": "9",
        "review_title": "Childhood favorite",
        "review_detailed_main": "I can't imagine anyone else as Popeye or Olive Oyle. Amazing costuming, songs by Harry Nilsson, campy in the best possible way. Stood the test of time rewatching as an adult."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "handmethatspanner",
        "review_rating": "8",
        "review_title": "Stop & imagine this as a live play...",
        "review_detailed_main": "A re-interpretation... An Art Film... A must-see for cinephiles.\n\nMy parents were raised with cartoons like this when they were *new* -- In an era that still had Vaudevillians live onstage.\n\nThink of Charlie Chaplin - live, or Bob Hope - live, or Burns and Allen -live.\n\nI saw all these cartoons much later on B&W TV.\n\nThe farther you are as a viewer from pre-WW2, the more this is a telescopic view of the life and times it represents.\n\nThis is a severe and violent world.\n\nThis is an era that builds the reactive political Left and is co-incident with the first bloom of broadcast radio.\n\nDiesel is High Tech... These cartoons made light of the life those people were living -- which was funny to them as it is better to laugh at your own misery that it is to weep over it.\n\nThis is Depression Era grim humor.\n\nAs a boomer I could not understand just how hard life was before \"the Korean Conflict\".\n\nThis shows that people 'then' had much the same issues as we still have.\n\nBut the extremes have slightly narrowed as time has moved forward.\n\nThe Popeye series extends beyond the Second World War and begins to parody itself.\n\nThe moviehouse of this time had a weekly News Reel, two comics, a Serial ( think Flash gordon - an episode each week... ) and sometimes had a co-feature. The notion of a 'serial' is paid homage by the text scroll of the Star Wars series... Additionally -- THIS IS A MUSICAL! Not my favorite genre... Yet this is one of three I like.\n\nTo some degree this is like the Bizzaro-Superman vis-a-vis Superman -- which only makes sense if you know the old comics... This is possibly THE Best Cast Movie Ever Made.\n\nWhich is why is makes more sense to think of it as a live-on-stage performance.\n\nA live-action Cartoon as opposed to animation -- because that means something else in this century.\n\nAltman got reamed by the industry for this one.\n\nReportedly he had regrets. The critics, blinkered by the commercial media of the time, could not see the cultural significance.\n\nThe situation was reversed for Terry Gilliam's Brazil -- which is satirical in the extreme. The critics loved it when the studio wanted to bury it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "zqckhrdsi",
        "review_rating": "9",
        "review_title": "Great adaptation.",
        "review_detailed_main": "Honestly surprised that this is a 5.4 rating on IMDB. I suppose you can't argue with taste.\n\nThought this was a great adaptation and the performances of Robin Williams and Shelley Duvall were stellar. Great casting. Robin Williams was perfect for Popeye and Shelley Duvall was meant to be Olive Oyl. So sad they're both gone now. Can't imagine anyone else as her. Overall a fun film.\n\nMy only wish is they would have had the Sea Hag and Alice the Goon somehow. Especially the Sea Hag. Very underrated character.\n\nNo one can say that Robert Altman doesn't know how to cast. Feels like he nailed down everyone just like the cartoon."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "seppert",
        "review_rating": "",
        "review_title": "You'll enjoy it more with this Tip",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Scully2",
        "review_rating": "8",
        "review_title": "\"Car Crash Movies\"",
        "review_detailed_main": "This is one of those movies where you see it on TV, you just have to stop and watch it like a car wreck. One of my favorites from when I was a kid -- I still can't look at Shelly Duvall and not think of Olive Oyl when I see her in something else. Songs may not be the greatest, but they fit the tone of the movie. I recommend it. :-)"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "TheCapsuleCritic",
        "review_rating": "",
        "review_title": "Robert Altman's & Robin Williams' POPEYE 40+ Years Later",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "holmescj80",
        "review_rating": "8",
        "review_title": "Strong to the Finish",
        "review_detailed_main": "Its been almost 20 years since I have seen this film on television.\n\nPay-TV played it recently and I managed to watch it.\n\nAll the memories of it came flooding back.\n\nThe film tells the tale of Popeye, a sailor who is looking for his father in Sweethaven and meets Olive Oyl and her family.\n\nThe film was pretty violent from my perspective with Bluto losing his temper - this is where anger management would have helped Bluto keep his cool.\n\nLots of sound effects were added to the film, mostly where there were explosions and fists flying.\n\nI didn't like the tax-man character - always taxing everybody for day to day activities.\n\nRobin William's portrayal of Popeye and Shelley Duvall's role of Olive Oyl was spot on for me.\n\nA fun film - for the Popeye fans."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "suzyqfd",
        "review_rating": "",
        "review_title": "This one was a woof, woof, bow wow!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "llamaflyagaric",
        "review_rating": "10",
        "review_title": "Best Horror/Surrealist Movie I've Ever Seen",
        "review_detailed_main": "I've seen a lot of scary movies, from slashers to thrillers to surrealist nightmares. Dream sequences and images that not only boggle the mind, but turn it inside-out, up-side down, twist and morph and stretch and squeeze it until you're left with little but a vague recollection of what sanity and reality used to feel like. I've seen images that burn themselves into the psyche, haunting the mind and driving mad the most stable and well-grounded person you could think of. I've spent my waking life seeking out the most explicit, graphic, disturbing, demented, nausea-inducing combinations of sight and sound that the deranged depths of the horror cinema world, mainstream and underground, have to offer.\n\nAnd nothing*.\n\nNOTHING*.\n\nCompares to the mix of emotions brought about by Popeye. Robert Altman is truly an artistic genius, bringing to life a nightmarish world filled with incomprehensibility and pain. Like being a lost in the woods at night, the film evokes a childlike fear and desperation. Robin Williams and Shelley Duvall make an amazing performance as Popeye and Olive, each of them bringing the two-dimensional characters, with all their mannerisms and quirks, to life. The special effects team takes the exaggerations and the subtle fantasy of a comic-turned-cartoon, and apply them to reality as though they were applying paint to a wall. The writers appeared to have taken inspiration, and possibly dialogue, directly from my most wild and nonsensical dreams. The end result is a movie that is, to put it simply, freaky as all hell.\n\nBurton, move over. Tarantino, get lost. King, take a hike. Never before has a big budget been devoted to making such a bizarre and erratic film so painstakingly. Never before has so much care and effort been put into making something so surreal, and so staggeringly strange. Popeye is more, much much more than a movie. It is the quintessential iota of human emotion. It is love and hate and laughter and fear rolled into one. It's the worst film that was ever made well. It speaks to the most basic part of humanity: the small voice inside all of us that looks, perplexedly, and asks, \"Why?\".\n\nIn short: This film will blow your mind in ways you cannot possibly imagine.\n\n(*Note that while Popeye is the most frightening movie I have ever seen, it is not the worst. That honor goes to Terror Toons, which is legitimately frightening in the fact that the movie exists at all)"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "ghoul-3",
        "review_rating": "",
        "review_title": "Terribly written and performed anti-musical.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "schwartztek",
        "review_rating": "10",
        "review_title": "Popeye - great kids movie",
        "review_detailed_main": "I saw the movie in the theater when I was six. I certainly have fond memories of going to the theater but that is because I enjoyed the show.\n\nI watched it again recently with my boys and we all had fun. It's like watching a cartoon except with real people. For cartoons we have watched Popeye, Tom and Jerry, Donald Duck and similar - we stick mostly with the classics.\n\nAll great for kids and I enjoyed watching Popeye again. It certainly is different and that's why it is great for those who are young or young at heart. I could see younger generations not liking this movie, if they don't know the cartoon. Whatever. I like Popeye the movie. A good role for Williams."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "sugarmanp",
        "review_rating": "10",
        "review_title": "Underrated Classic",
        "review_detailed_main": "Very fun movie, but very different so many don't get it. As with so many Altman films it has a great ensemble and it stands apart from his other films (and most movies) in going for a stylization of real people as cartoons. Shelley Duvall is excellent as Olive Oyl and the whole cast creates a surreal world of live action yet cartoon. Robin Williams is good, but as Popeye he is the straight man so it isn't a typical Robin Williams performance. Very nice score by Harry Nilsson as it is a musical as well. Ray Walston, Bill Irwin stand out as well. Entertaining movie for all ages but you need to be open to something different."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "possum-3",
        "review_rating": "",
        "review_title": "Why Altman?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "allenb-335-506151",
        "review_rating": "10",
        "review_title": "Pure Genius",
        "review_detailed_main": "I love everything about this film. Every character is fascinating. The soundtrack is amazing. And the set is gorgeously weird."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "gabelazarick-76306",
        "review_rating": "10",
        "review_title": "GOAT",
        "review_detailed_main": "Greatest musical of all time...you read me. Bluto is understandably upset at the fiance stealing Popeye and seeks to extract vengeance."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "timberlinetoast",
        "review_rating": "9",
        "review_title": "Popeye has a lot of heart and charm",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "shelbythuylinh",
        "review_rating": "9",
        "review_title": "Robin Williams Movie Debut",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "dhlee3",
        "review_rating": "10",
        "review_title": "A heartfelt, quirky delight",
        "review_detailed_main": "Robin Williams embodied both the the cartoon quality of Popeye but also brought unexpected depth and subtlety to the character. The photography and sets are beautiful and the music expertly fits the mood with songs that further the story. It was panned by critics when it came out. I think it was just ahead of its time. If you love smart, fun, quirky movies, you can do no better than Popeye.\n\nRobin Williams embodied both the the cartoon quality of Popeye but also brought unexpected depth and subtlety to the character. The photography and sets are beautiful and the music expertly fits the mood with songs that further the story. It was panned by critics when it came out. I think it was just ahead of its time. If you love smart, fun, quirky movies, you can do no better than Popeye."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mariacadle1981",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "scottkrants",
        "review_rating": "10",
        "review_title": "Most underrated of all time!!",
        "review_detailed_main": "I have always loved this movie... and grow more fond as time goes by. Great music.. great cinematography... terrific set design.. I dont know why people give it a bad wrap."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "slowcando",
        "review_rating": "9",
        "review_title": "Childhood-fave is still great, newbies may be less enamoured",
        "review_detailed_main": "I saw this a bunch back in the 80's and probably early-90's too. We had it on video. Haven't seen it since.\n\nSimilar to The Flight of Dragons (1982 animated fantasy): returning to an old childhood-favourite after over 30 years confirms Popeye as a fantastic fun 9/10 adventure! And like Flight Of Dragons I can't imagine new viewers being anywhere near as enamoured as those of us who already have the film's DNA imprinted into our own...\n\nMy partner had to give up after 30 minutes: she just couldn't get on with the dialogue and eccentric humour. Whereas I was having a great time! Laugh-out-loud gags, joyous songs, even some touching moments. Wonderful performances from all the cast, Shelley Duvall almost stealing the show from Robin Williams. They're a great team, lovely chemistry.\n\nThe movie has those Altman-typical crowd-scenes, so lots to look at. Later on an endearingly-engaging baby character is introduced which gives the narrative some needed focus.\n\nIf yous haven't seen it and are curious: try it with kids....or if not available then some booze :D Popeye is an event film!\n\nNote: unusually the UK (and European) DVD-releases are heavily cut. The US-release has about 15 minutes extra scenes which flesh out Bluto and (no spoiler here)."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Michael_Pilkington",
        "review_rating": "",
        "review_title": "Well, blow me down! A big screen version of the cartoon.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "reydelgado",
        "review_rating": "9",
        "review_title": "I love this movie",
        "review_detailed_main": "Don't know why all the hate, its really not a bad movie"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mikemoto",
        "review_rating": "",
        "review_title": "My Vote For All Time Worst Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "twelve-house-books",
        "review_rating": "10",
        "review_title": "Fun Never Gets Better Than This!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "sngbrd39",
        "review_rating": "",
        "review_title": "I'm really sorry, but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "metsfandave86",
        "review_rating": "8",
        "review_title": "Robin Williams is a character genius",
        "review_detailed_main": "Of all the characters Robin Williams ever played, his portrayal of Popeye the Sailor Man might just be his best. His look and the voice he used was spot on. The storyline was a little quirky, but for this movie it fit. Shelley Duvall as Olive Oil was fantastic. If you are looking for a fun movie with really good character acting that takes you back to the cartoon series or comic strip, Popeye starring Robin Williams is a great family film."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Poor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Blueto",
        "review_detailed_main": "I like the bit where he ate spinich and punched Brutus"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Houmatt",
        "review_rating": "",
        "review_title": "AAAAAHHHHHHHH!!!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "lindsaykennen",
        "review_rating": "10",
        "review_title": "Best Movie Robin Williams Ever Did!",
        "review_detailed_main": "I love Popeye! This movie is so adorable - cute and funny. It is full of excellent actors that make this movie GOLDEN!\n\nIn my mind, this is the best movie that Robin Williams ever did. He made this movie great. I will always remember him as Popeye.\n\nI wish they did more shows like this. It is a classic and it should have received an award = excellent characters - music that I will never forget - and an upbeat and cheerful storyline. This is entertaining. This is what I like in a movie.\n\nThere will never be another movie as good as this one. It was one of a kind.\n\nIf you love Popeye, then you will love this movie!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "joseppi 1",
        "review_rating": "",
        "review_title": "Unfortunately good casting, costume and set design can't keep this boat afloat.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "jerry-77470",
        "review_rating": "10",
        "review_title": "Any rating lower than 8 should be removed!",
        "review_detailed_main": "How can anyone rate this lower than an 8? This film is a classic and a masterpiece for so many different reasons. I believe that this is one of Robin Williams all-time classics and best ever films, although 99% of his films were amazing masterpieces.. in guessing that if someone rated this movie less than 8 never had the opportunity to experience Saturday morning cartoons, unfamiliar with Robins body of work, or just straight up has no class or sense of comedy!\n\nEvery actor in this movie captures their characters personality and charisma! This is truly one of the classics for sure!\n\nNow, if you are one of the misinformed people or there who rated this less than 8, you need to seek the services of a doctor!! Seriously!!\n\nWe ALL really miss you Robin, Mork, Popeye, and all of the characters you played over the years... THANK YOU for all the laughs and forgive those who can't comprehend your comedy style or acting talent.\n\n!!!! POPEYE IS A CLASSIC !!!!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "imddaveh",
        "review_rating": "",
        "review_title": "So close, yet so far. I'm disgustipated.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "mandahop-83178",
        "review_rating": "8",
        "review_title": "Weird and wonderful",
        "review_detailed_main": "This is such a bizarre movie that somehow captures the essence of the original cartoons and has some truly great musical numbers. I've been watching it since I was a kid and still love it."
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Sarah-95",
        "review_rating": "",
        "review_title": "The second scariest film ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "danbaig",
        "review_rating": "10",
        "review_title": "Still incredible!",
        "review_detailed_main": "I loved it as a kid & I still love it now! The characters are amazingly brought to life!"
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "15231",
        "review_rating": "",
        "review_title": "Wonderful look but fails in its translation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "gazzo-2",
        "review_rating": "",
        "review_title": "Ugh-gugugugugugugugugugh!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "philosopherjack",
        "review_rating": "",
        "review_title": "Plays more like a self-absorbed, semi-penetrable mystery than a family entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "veliath",
        "review_rating": "",
        "review_title": "Mixed opinions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "deadbull-95171",
        "review_rating": "",
        "review_title": "WONDERFUL ALTMAN MOVIE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "Pnkprinses309",
        "review_rating": "",
        "review_title": "Well then",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "jccw27",
        "review_rating": "",
        "review_title": "Not \"strong to the finich\", but it does have it's highlights",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0081353",
        "movie_name": "Popeye",
        "movie_rating": "5.4",
        "review_username": "oliverio-p",
        "review_rating": "",
        "review_title": "Where was Captain Jack McCarthy?",
        "review_detailed_main": ""
    }
]