[
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "TdSmth5",
        "review_rating": "5",
        "review_title": "A bit too empty",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Someguysomwhere",
        "review_rating": "6",
        "review_title": "\"If she's unconscious, we ain't limp.\" (Yeah, keep believing that.)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "tomgillespie2002",
        "review_rating": "5",
        "review_title": "Will resonate in your mind for some time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "rogerdarlington",
        "review_rating": "",
        "review_title": "Brave - but too obscure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Maria_Sanchez",
        "review_rating": "1",
        "review_title": "The debut feature film by novelist Julia Leigh is anything but artistic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Likes_Ninjas90",
        "review_rating": "7",
        "review_title": "It's difficult to fault the film's artistry and its originality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "metal-7",
        "review_rating": "2",
        "review_title": "not only a terrible film, it's not even original",
        "review_detailed_main": "I left the theater after seeing Sleeping Beauty shaking my head. Both my wife and I felt more than a little cheated. It really takes a special kind of bad to make a beautiful girl -- prostrated naked all over the screen for the better part of the movie -- boring and unappealing. And yet, this is precisely what we got from it. Why? The problem seems to be that much of the tension and drama hinges on empathizing with Emily Browning's character, a girl shallow and adrift, yet simultaneously cold to the world. Financial predicaments and dissatisfaction with life make her teen angst blossom into ugliness. The expression \"bored people are boring\" comes to mind.\n\nI do not wish to recount plot details beyond what is outlined in the summary, in case you decide to see the film for yourself. However, tonight my wife discovered an earlier film from Germany, which shocked us, having seen Sleeping Beauty so recently. The film is called \"House of the Sleeping Beauties\", directed by Vadim Glowna in 2006, based on Yasunari Kawabata's much older novel. What's peculiar is that House of the Sleeping Beauties is so painfully close to Sleeping Beauty, it's not funny. Virtually every critical plot point is present in both films. And yet, House of the Sleeping Beauties is made from a completely different perspective and strikes a decidedly different tone. It's more nuanced, more three-dimensional, more mysterious. It's... just better. The night we saw Sleeping Beauty, my wife and I agreed that despite all the drawbacks, the premise held something and the film could have been good. House of the Sleeping Beauties is that better film.\n\nI sincerely hope that Julia Leigh meant to reference the earlier German work and create an interplay between them. It's an interesting idea. Though, I'm a bit skeptical, seeing as there appears no mention of the other it anywhere in the credits, nor in marketing or writing around Sleeping Beauty itself."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Marter2",
        "review_rating": "7",
        "review_title": "Don't Fall Asleep. You Might Miss It!",
        "review_detailed_main": "When you create a film and title it \"Sleeping Beauty,\" you had better not make it boring. Otherwise, you'll get reviews utilizing every possible play on the word \"sleep,\" but more importantly, word of mouth will spread using the same types of puns. When you use a title made famous by the Disney animation, you're going to have to guard against those comparisons as well. As you can see, this film is already on the defensive.\n\nTo put even more pressure on \"Sleeping Beauty,\" before it has even begun, is the fact that it is the directorial debut of a novelist. Julia Leigh also wrote the screenplay, but it is her first time stepping behind the camera to helm a film production. This isn't necessarily a bad thing, but it means an even bigger risk was taken by the studios, and just as many debuts fall flat as they do flourish. Luckily, Leigh's is a success, even if her film isn't going to be something that many people are going to enjoy.\n\nTo start the film, we begin by watching the daily routine of a young woman named Lucy (Emily Browning). The first scene made me cringe, as we find out that one of her many jobs involves testing out medical equipment. We watch a tube being inserted down her throat. This is done in one unflinching shot that has the opposite effect on the viewer. Later on, we learn she also does office work and works at a restaurant, but the medical testing was by far her worst job.\n\nWhy does she need to work three jobs? That's really a good question. We learn that she's behind on her rent, and also goes to school. Maybe school is really expensive, but she only seems to have one class, which can't be too heavy a burden. She's renting a room from people she knows, and I wouldn't think that would be that expensive either. Why she doesn't pay her rent on time, I'll never know. This isn't a film that's going to lay things out for you.\n\nBecause working three jobs isn't enough for Lucy, she inquires about an ad in the paper that requires her to serve dinner to old rich men while wearing lingerie. It pays $250 an hour, although it's freelance work, we're told. She works once, and after she gets home, she burns a $20 bill. Why? Again, I don't know, and it's actions like this that make me think she isn't wanting for cash. Regardless, working multiple jobs, including the dinner-while-wearing-lingerie one, continues for most of the film, even as her performance gets so bad that she sometimes sleeps on the floor while working.\n\nSleeping is something she'll end up doing quite a bit as the film continues on. She was told when she took the server job that there were opportunities for promotion. She gets that chance later on, when she's told that she can take a drug, lay naked in bed while passed out, and sleep for a few hours. Oh, and an elderly man will come in and sleep with her while she's knocked out. \"Sleep with\" in the literal sense of the meaning, as actual intercourse is forbidden.\n\nNot that Lucy really cares. She doesn't seem to care much about herself, and would probably have accepted the job without the binding rule. She's the type of nihilist that will do whatever anyone wants her to do at the flip of a coin. At a bar, she's approached and asked if she wants some cocaine. \"Why not?\" is her response. Later, two men she just met actually use a coin to decide which one would have sex with her that night. She doesn't care, although come to think of it, I can't remember her saying \"no\" once to anyone in the film. She's very polite, even if she has no regard for her own body.\n\nThere's a lot of symbolism in the film, and if you thought this was a film that's going to make it easy on you, you can look elsewhere. You're going to have to infer a great deal about the characters and their reason for doing what they do for most of the time you watch them. I can see this being seen by some as a lack of character depth and development, but I think it's all there and just hidden behind imagery and a classic fairy tale. The way I saw \"Sleeping Beauty,\" it actually does steal a couple of things from Disney cartoon. Unfortunately, giving that away now might change the way you view the film, so instead, go in with as fresh a mind as you can. This is a movie that will reward subsequent viewings.\n\nIf there's a problem here, it's the character of Lucy. She's often difficult to like, and because she's such an apathetic person, not a lot goes on. She's little farther, for better or worse, when the film ends than when it began. None of the blame can go to Emily Browning, as she plays her without fear, but the way the character is written means that she's not exactly amiable or has a decent enough personality to build a film around. This is largely forgotten about once it gets going, but upon reflection, making her grow as the film progressed would have improved it as a whole.\n\nRegardless, I was engaged by \"Sleeping Beauty.\" Is it for everyone? Not at all. If you like artsy films that are there for you to figure out instead of being told everything about them, then it might work for you. It has a solid performance from Emily Browning in the lead role, and it has enough imagery and symbolism to keep you coming back for another watch. That is, if you don't fall asleep during the first time."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "targetboy",
        "review_rating": "1",
        "review_title": "90 minutes of plot less nonsense",
        "review_detailed_main": "I will carefully watch the career of Director Leigh and at all costs avoid anything that she ever makes again. There is a severe and astounding lack of story line or plot and any promise of a haunting, thrilling complex tale is a flat out lie. The film is a disjointed sequence of odd non relating scene's some of which are totally pointless and the rest are only fairly pointless. I would recommend anyone to watch anything else than this. There is no subtext, there is no complexity only pretentious gibberish. I hope this does not mean the end of Emily Browning, who was faultless in Sucker Punch but if that is the cost of never hearing of this film again it will be a bargain. 1 star and a grudging one at that!"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "angel-clare",
        "review_rating": "7",
        "review_title": "A Bizarre & Uncomfortable Art Film",
        "review_detailed_main": "Featuring Australian actress Emily Browning in the titular role, this bizarre and uncomfortable art film is almost worth watching for her exquisitely pretty face alone; but alas, she plays an utterly depressed character completely devoid of feelings, emotions, and, well, character—a combination uncomfortable to watch whatever face is behind it.\n\nSleeping Beauty finds Emily Browning portray a college student who allows herself to be drugged into unconsciousness and played with by perverted old men for money—though in a bizarre turn of events it turns out she seems to care for the money as much as she does her maltreated body.\n\nShe also has a bizarre friend known as \"Bird Man\" who seems to be in love with her. Whatever the case—long periods of naked unconsciousness; old wrinkled men in the buff; and a seriously depressed, repressed, oppressed, and suppressed protagonist make this a very bizarre and uncomfortable art film.\n\n(Disclaimer: The film features gorgeous cinematography and has an affecting plot, even if it isn't entirely discernible. Certainly worth watching)"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "info-15459",
        "review_rating": "1",
        "review_title": "Long winded utterly boring story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "shallowphil",
        "review_rating": "8",
        "review_title": "Written by Julia Leigh? What about Yasunari Kawabata?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "alecharris2004",
        "review_rating": "6",
        "review_title": "Flawed Beauty",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "justchillz",
        "review_rating": "1",
        "review_title": "No ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "he_who_leads",
        "review_rating": "",
        "review_title": "5/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "claudio_carvalho",
        "review_rating": "1",
        "review_title": "Pointless, Boring, Pretentious and Unpleasant Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "bowmanblue",
        "review_rating": "6",
        "review_title": "One of those love it or hate it movies",
        "review_detailed_main": "Sleeping Beauty is a fanciful 'indie' movie about a girl, Sara, who has numerous mundane jobs as she attends an Australian university, but decides to take on some *ahem* nightwork as an inanimate object who sleeps alongside paying customers.\n\nIt's one of those films that leaves me wishing that I was smarter. I figure that way I'd like movies like this more.\n\nLet's face it - it's different. It's different in the way it's shot, the way it tells it's story, the way the actors speak and are asked to perform and it's definitely not your average Hollywood output. It's an independent film which, if it's lucky, will achieve a cult following.\n\nThe dialogue is slow (if there is any at all), there is even less background music, it is filmed largely with one static camera shot per scene (scenes which tend to go on for longer than you might expect) and the actors all behave very aloof.\n\nI have nothing against films that go against the 'classic Hollywood narrative.' The film industry needs them. And I'm no prude when it comes to tackling sensitive adult issues on film. However, sadly, I have to come down on the side of those who thought this film was just simply boring. I know it tries to be shocking and different. I just thought it was dull.\n\nIt's basically one of those love/hate films. I've read plenty of other reviews on it and about half side with me, while the others praise its artistic merits and depth of film-making. That's fine. Just expect to either turn it off after twenty minutes or sit riveted to the end in admiration.\n\nNow, if you'll excuse me, I'm now off to watch Bruce Willis slapping bad guys and giant monsters trashing New York."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Boba_Fett1138",
        "review_rating": "5",
        "review_title": "It will more likely turn you into a sleeping beauty instead.",
        "review_detailed_main": "It's not like I'm not capable of appreciating a good artistic or original movie, on the contrary really but this movie is offering far too little to make it stand out on any level.\n\nPerhaps it's true that I'm simply getting fed up with these sort of movies, since I have seen far too many of them already. It's the sort of movie that's all too well aware of its style and realizes very well its being part of the more artistic, independent movie genre. It's therefore being just like any other movie out of the genre basically, without offering anything new or provoking.\n\nIt has a very deliberate and well thought out and planned, style of film-making to it. It doesn't feel spontaneous in any way. The movie very rarely cuts away. When there is a cut in this movie, it means that the scene is over and another one, set at another place will start. The camera does move at times but lots of times the movie only consists purely out of static shots, with characters sitting or standing in the foreground. It's all too forced and obvious and if I want a front-view of actors, with a few props and sets, I'll go and watch a stage-play. The possibilities with movies are now days pretty much endless, yet the movie is doing absolutely nothing with it. It's minimalistic and slow, up to a point that the movie actually starts to become a bit of a drag. It manages to make 104 minutes seem like a very long time!\n\nSo is the movie pretentious? It's deliberately trying to be an artistic one, with its images and storytelling but I wouldn't go as far as saying it's being a pretentious one, since this is director's Julia Leigh first movie and I do believe all of her intentions with it were very honest. Still she really needs to work on developing a style of her own, that really suits her and the stories she is trying to tell with her movies. There now still is nothing that makes her style unique from anything else, or distinctive in any way. It also wouldn't had harmed the movie if she got a more experienced screenplay writer to come in and help to write the story with her. I actually do feel and believe that the story worked well on paper but on the silver screen it really falls flat.\n\nIt all really could had still worked out well if the movie indeed had an intriguing story or main character in it. But the movie tries to tell its story more so with its images, rather than featuring a real good main plot line or emotions in it. It does come across a bit as some lazy film-making; 'Don't worry about the script or actors, just place a camera in a room and let the emptiness and remoteness of the scene tell the whole story'. Sorry, I just really wasn't falling for that.\n\nIt does make Emily Browning's role also a bit of an ungrateful one. Ever since she had been appearing in movies and series as a child, it was apparent that she would one day not only grow into becoming a beautiful woman but also a great star and actress. However after seeing her in this movie it also becomes apparent that she isn't quite ready for it to play a lead role and carry a movie almost entirely on her own. But all of the blame can't fall entirely on her in this case, since it probably was director Julia Leigh that told her to play her character as a very distant and emotionally bland one. Seriously, she is hardly ever showing any emotions on her face. You can't really tell if she is ever happy or sad and as a viewer it makes you feel very detached from her. This is also because she is doing some very unusual and unlikely things in this movie. It never becomes really apparent why she does them and why she is the way that she is. The movie is not really offering you an exploration into a young woman's mind and her journey in life, on her way of becoming a true woman. Just like many of its scene's, the movie feels mostly as a very empty and distant one.\n\nAnd what was with here wearing the same type of clothes throughout the entire movie? She is either wearing a skirt or a dress, with some high boots, or she is either half- or completely naked. Nothing wrong with showing some skin but Emily Browning's body looks like a 13-year old, even while she was 23 at the time. The clothes she was wearing really didn't seemed to suit her body type and it actually worked quite distracting for me. It made me want to send her some money, so she could buy some pants and normal shoes.\n\nSome people might still get something out of the movie its images or will read deeper into some of the movie its moments but personally I got very little out of this movie. It was a very empty movie story-wise and an emotionally bland one, that by the end left nothing more than a very redundant impression on me.\n\n5/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "sanloz11",
        "review_rating": "7",
        "review_title": "Different",
        "review_detailed_main": "This is just a quick slapped together opinion.\n\nI found this movie interesting and it kept my attention the entire time. I was slightly disappointed with the ending, however there were a lot of very important messages in this film particularly relevant to the world that we live in today.\n\nI am surpirsed that it's rating is so low after actually taking the time to watch it.\n\nI had a lot of depth and considering what most Australian films are like that makes me want to give this one even more credit.\n\nWorth a watch I think."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "bwickens84",
        "review_rating": "1",
        "review_title": "i don't think i get Australian films!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "thulean33",
        "review_rating": "6",
        "review_title": "Interesting study on feminine psychology; but too cold and utilitarian",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "momanimohanned",
        "review_rating": "1",
        "review_title": "the only spoiler here is that movie sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "OutlawsDeLejos",
        "review_rating": "9",
        "review_title": "A challenging and rewarding film experience.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "s3276169",
        "review_rating": "7",
        "review_title": "An insight into contemporary societal dispossession....",
        "review_detailed_main": "Sleeping Beauty is based on the novel The House of the Sleeping Beauties, by Yasunari Kawabata.\n\nIts a tale of a young woman, who, dressed in very little, waits on and, as the film progresses, eventually sleeps, in a drugged state, with wealthy older men. No sex takes place, the men are only allowed to touch her, a rule outlined and enforced by the upper class madam, who farms the girls out to her prominent clients.\n\nSleeping Beauty is not an easy film to come to grips with. On the surface the overriding feeling is one of emotional and societal nihilism, expressed through a sexual medium. Delving deeper the real heart of the story would appear to be one of dispossession. The loss of one's self, which leads to nihilistic behavior on the part of its key protagonists.\n\nLucy, a university student experiences loss of home, family and her best friend.Her world is a cold place, inhibited by people who are indifferent to Lucy and only see her in terms of her \"value\" to them. Lucy's response to being treated as a commodity, is, to play her would be users at their own game, selling herself to the highest bidder. Lucy uses they money she is paid to create her own shallow, materialistic world. Predictably, however, money does not fill Lucy's emotional void any more than it does the other key protagonists of this film, her wealthy clients.\n\nLucy's clients are, in their own way, no different to Lucy. Like Lucy money has not freed them from their emotional bonds but has, in fact, bound them more tightly. Money obliges them to follow societal expectations in terms of their family and working lives, leaving them bereft and empty. Their attempts to escape their personal dispossession, play out in the perversely erotic fantasy world they share with Lucy.\n\nIn terms of acting and directing, this is a polished film. The quality of acting, in particular, is of a very high standard.The overall direction of the film is well managed too but the atmosphere of impersonal coldness that inhibits the film is overplayed. As a consequence, its very hard to empathize with Lucy, even though, intellectually, you know you should. The moments of humanity and warmth are simply far too few.\n\nIn summary, I would say Sleeping Beauty is certainly a quality film. That said, its not a great film. Its too clinical in its treatment of the subject matter, leaving the viewer numbed by the experience. Its an unwelcome departure from the book, which handles the subject matter with more humanity. Nonetheless a good effort and a worthwhile watch. Seven out of ten from me."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "grantss",
        "review_rating": "1",
        "review_title": "Pretentious nonsense",
        "review_detailed_main": "Australian dramas mostly fall into two broad camps - great crime-dramas, e.g. Animal Kingdom and Snowtown, or pretentious crap, e.g. Jindabyne. Sleeping Beauty is one of the latter, and it takes pretentious crap to levels of pretense and craptacularity usually only the French can muster.\n\nNo real point to the movie at all. Plot's initial idea is to shock the audience, and even that feels dull and drawn out, reminding me of Eyes Wide Shut. After that it just drifts around and goes nowhere.\n\nPerformances are generally unconvincing and dull, in keeping with the plot. Emily Browning was miscast in the lead role (though every other actress out there should be thanking their lucky stars that they don't have this on their CV).\n\nAvoid at all costs. It will save you nearly two hours of your life."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "torontomovies",
        "review_rating": "",
        "review_title": "Draw your own conclusions.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "creepy story, but not very compelling",
        "review_detailed_main": "Poor university student Lucy (Emily Browning) responds to a mysterious ad and falls into an erotic creepy job.\n\nThe pacing for this is way too slow. I'm willing to let the creepy story seep in, but I can't let the creeping pace go. There are too many nothing scenes. Julia Leigh is the writer/director of his artsy film with pretensions of greatness. As for the nudity, there is no sexiness or beauty. It's not gritty. It's not powerful. If we need anything, we need really tough acting from Emily Browning. She needs to show a range of emotions that she doesn't seem to possess. For most of this movie, she gives us her blank face. I must admit that there is something unique here. It's probably worked out exactly as Julia Leigh had wanted. But I just don't find it compelling."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "valleyjohn",
        "review_rating": "6",
        "review_title": "Strange but compelling.",
        "review_detailed_main": "I have not got a clue where to start with Sleeping Beauty. I have not got a clue what i was watching but most of the time although i found it strangely compelling and interesting in a voyeuristic kind of way.\n\nEmily Browning stars as a young woman who makes her money in every way she can although seemingly not needing the money . She get a job as a nude silver service waitress for a strange group of retired man and woman and it involves a ritual of which she could never have imagined.\n\nAlthough this film is extremely strange and obviously has hidden meanings that are so hidden i couldn't find them , i still found this film to very watchable. Emily Browning is stunningly beautiful and i could watch her all day long and i think that's the hook i had on this film.\n\nI can't see this film appealing to many people but i wouldn't say it's a total disaster. If you like your films arty , then you will love it , but if you like structure and explanation then Sleeping Beauty mike make you nod off."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Rockwell_Cronenberg",
        "review_rating": "3",
        "review_title": "A great idea poorly executed.",
        "review_detailed_main": "I was hoping for a lot from this movie, but it didn't really give me much of anything. Julia Leigh had some interesting ideas when it came to her approach, but I don't think she executed them well enough and as a result the film was just void of anything really. Obviously there wasn't going to be much by way of emotional influence, but there wasn't much on an intellectual level either. People are praising Emily Browning's performance as being incredibly \"brave\", which I suppose it is in the sense that it's brave to take off your clothes and have the things done to her on screen happen, but that doesn't make it a particularly good performance. She's not a competent actress by any means and this is just the strongest example of that so far."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Turridu70",
        "review_rating": "6",
        "review_title": "An erotic tale that just doesn't click",
        "review_detailed_main": "This film was in my opinion Boring because it all focused on the petite and Beautiful Emily Browning. Director Julia Leigh fails to bring the character Lucy into fruition. It was like she was just there and none of the other characters were never explored. Sleeping Beauty centers on a college student, Lucy, a college student who enters into a dark erotic world. Browning's performance was well done but it seems she's lost throughout the whole film. The cinematography was good. I got the impression that Leigh try to paint this film as like a portrait of Venus but fails miserably. Yet it is barely entertaining but it lacks interests on the doomed and vulnerable Lucy in a world she never thought she would be involved. My rating a hardly: 6.0 only because of Browning. It should have gotten lower."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "q_annie",
        "review_rating": "3",
        "review_title": "We are living in a dark age",
        "review_detailed_main": "If I didn't knew what the human nature is capable of, I would be amazed by this movie. If I thought there could possibly be a 'hidden meaning' in this, I would be thinking about it, rather than writing this review. Plato once was wondering over the nature of this mysterious universe and over the nature of God, he decided that when the light feared its absolute existence, darkness came into being. Darkness, hence, never really existed until its existence was given a meaning by the light. That was what Plato thought and later his student, Aristotle, became teacher of Alexander the Great. Subconscious is more powerful and active than its opposite, if saying few words to a sleeping person can change his entire outlook of life, then watching a movie, like watching a dream, can make you change the outlook of your life. If this movie is intended for any other purpose than to justify Hollywood that is turning into a porn and sex industry, or to justify the worlds largest prostitution chain that exists in America, I don't believe in that purpose. If physical needs are a 'mysterious hidden world of unspoken desires', then this hidden world is but creation of our own idea of powerlessness regarding such needs. Just like darkness was nothing but a thought of light. Injustice anywhere is a threat to justice everywhere- Martin Luther King,Jr. Therefore, a seemingly unimportant movie such as this can turn almost any possibility into reality, even those that bring shame to us in private."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "RavenGlamDVDCollector",
        "review_rating": "7",
        "review_title": "Sleeping Beauty, did somebody doze off?",
        "review_detailed_main": "Actually, a 7 minus. Because of missing out on true greatness. But gets my award for hottest nude scenes.\n\nIt has a very attractive DVD box cover. Image shown here. Reminiscent of the paintings of the old masters. I stumbled across it when researching Emily Browning checking up on her other work - I am a SUCKER PUNCH fan (I hear just about everybody else disses it, but I would never!), I liked her in it, and recommend that one highly - and when I learned about SLEEPING BEAUTY I was immediately intrigued, no, hooked - despite the strings and strings of overriding mostly negative comment I encountered here on IMDb. There's one guy here on the board post that even snickered about her feet, that was very off- putting, but I decided as I almost always do, check it out for myself, and am I glad that I did.\n\nFirst off, Emily Browning. Who doesn't want her Dad to see this movie. Hell, made me want to see it even more! Okay, Emily's acting, her screen presence, there is nothing that can be faulted. She plays a difficult-to-fathom character. Described as emotionless. No way. That is quite wrong, you've goofed, film analysts. She shows emotion in the last scene with Birdmann when she starts sobbing uncontrollably. She is generally coolly in control, but it is quite clear that she is simmering underneath. Okay, the only bit of weak acting by her is in that scream scene, she couldn't maintain it convincingly, her acting fizzles out there. Right then, on to the fun stuff: as for Emily's physicality, she has one of the prettiest faces, think living doll, plus she is petite, slim, pert, natural, tiny (ahem) upper structure, but very, very well- formed. And with the fairest complexion. All over white. All over... Gee baby!\n\nIt is the most naked part in a mainstream movie. From the movies I have reviewed here, it takes over from CLOSER's Natalie Portman as the most intimate display by a lead actress. There's even a flash of pelvic thatch. Breasts small, not too small, very shapely, perky upright nips. She is like a child, only matured. An innocent doll. Who, lying supine, gets straddled by that naked disgusting threatening troll licking her face as if she's an ice-cream cone. (Which she kinda is, definitely vanilla by her skin color!) And that other guy, carrying her, dropping her? Wince-worthy! One long uninterrupted scene, didn't yell, remains seemingly out like a light, real trooper of an actress.\n\nStrong content, the nudity. Brings to mind scenes from SALO, 120 DAYS OF SODOM, those down-on-the-floor kneeling in supplication 'servants' showing their bare backs, foot-soles and butt- ends. I think that's the most explicit nudity in any mainstream movie. Together with the slightly S&M-ey bare-breasted waitresses, there's enough for a legion of prudes to complain about all week long. Yet there's no sex. Thought the 'madam' was gonna jump her there at the end, but, okay, I misunderstood... :)\n\nThe movie itself? I have viewed it twice, I am actually still quite confused, have done some Plot research on Wikipedia to clear it up, now understand what I was supposed to understand. Lots of things said there doesn't balance with what I have just seen. Birdmann didn't die in her arms. Not in the IFC DVD release I just saw. I've even checked up again. So somebody on Wikipedia didn't pay proper heed. And what's mentioned as a funeral on Wikipedia sure looks like a garden party to me, glasses of beer and all.\n\nAnother scene baffling me: After having slept with that guy, as she gets dressed, an insistent knock on the door. She continues getting dressed, another knock. She then moves to open the door, the next moment, she is sitting there in the corridor, some other guy (who's he?) standing near her, as the first guy pokes his head past the door, as if he's the one responding to the knock. Some deleted scene there?\n\nBut many of the secondary characters were extremely sketchily presented. Like, who is that, and why are they...?\n\nAnd why why why waste time with that old man telling that never-ending story that did not did not did not further the plot in the teensiest bit? Was it akin to product placement, the author of that book mentioned? If it had been to establish the old guy as an acceptable character, there'd have been plenty more economic ways. Simply an \"I feel old and weak and dearly in need of this lovely young girl's presence\" not that long-winded story lasting eight rolls of film, shucks, I had time to boil a cup of tea and let the dog go do his business (kidding, I don't have a dog).\n\nThe movie is way out of tempo with Hollywood fare. Initially, my first complaint was that there are way too little close-ups, almost everything was at a distance. There is also a certain meandering style, like this needed some discipline, some stronger direction, but then again, the cinematography in some scenes were very good, like paintings, for instance in that scene with the brutal man where she falls on the floor. Her marble-white skin on the green rug...\n\nGenerally, I am not going to say too much against it, save that there remained lots of room for improvement. They were on the right track here, but the real winner it could have been got clear away, but yet, a prize catch was netted."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "gregking4",
        "review_rating": "2",
        "review_title": "a rather dull and bland psychosexual drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Bloomer",
        "review_rating": "8",
        "review_title": "Wearily negative",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "ian-39125",
        "review_rating": "6",
        "review_title": "Hypnotic but unsatisfying",
        "review_detailed_main": "It's hypnotic but ultimately baffling to me what this movie is about. I must be too naive or ignorant. Emily Browning as the Sleeping Beauty is stunning and believable to me. The rest of it is over my head. From a movie making point of view, there's no 'smoking the pipe' at least. It is stylishly shot in a comparatively low budget 'eyes wide shut' kind of way. The ending is as unsatisfying as the service offered must have been. The story has so many threads left where they lay. There are no hints, no clues clear enough for the vulgar or uninitiated like myself perhaps. Maybe that's it's point. It's as messed up as real life can be. There is no meaning."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "rubenm",
        "review_rating": "2",
        "review_title": "Complete emptiness",
        "review_detailed_main": "I had a very hard time finding any quality in this movie. No story to speak of, no characters to identify with, no humor, no suspense, no intelligent dialog, no message, no link to what actually happens in the real world. And I could go on.\n\nThe movie is filled with seemingly unrelated scenes, incomprehensible images and people talking nonsense. It is about a female student sleeping with old men for money, without really having sex with them. Sounds weird? It is.\n\nThere is a slight possibility that I missed the point. That the film has certain qualities I wasn't able to discover. Therefore, I read some of the other reviews posted on this site. As far as I could see, they vary from extremely negative to mildly negative. So, if the film has qualities I didn't discover, at least I'm not the only one.\n\nI left the cinema with a feeling of complete emptiness. I had just spent 102 minutes watching something I couldn't relate to at all, something that couldn't offer me anything appealing.\n\nThe only reason I didn't give this film the lowest rating of 1 star is the actress, Emily Browning. Not for her acting accomplishments (it consists mainly of being nude or semi-nude and showing no emotion at all) but for the audacity it took to accept this part. I only hope she doesn't regret it."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Interesting character study, nothing more. Overall a disappointment.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Mark-457",
        "review_rating": "1",
        "review_title": "Slow and pretentious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "7",
        "review_title": "That's one way to put it",
        "review_detailed_main": "Lucy attends college. She has a seemingly endless stream of odd jobs. It's not entirely clear if all of this is truly just to pay for student loans, and maybe it's very little she's paid at each, or if there is some other reason. Ultimately, I don't think we need a clear answer to this, because that's not really the purpose of this film.\n\nShe and everyone around her seem stuck in a state where they don't really care enough about things to improve - maybe they don't even think it is possible for them to - even though clearly they are not fulfilled. And so we see them engaging in various activities to try to feel something, never really reaching a consistent positive state.\n\nThe camera rarely moves and tends to stick to medium and wide shots, leading to a very sterile feel and a sense that it and we are ogling Emily Browning. She nails the role like she also does in Sucker Punch, The Uninvited and A Series of Unfortunate Events. Thus, we are encouraged to consider the male gaze, something that for the longest time was just seen as the norm, an inescapable fact. There is definitely a discussion to be had on whether or not it is the right approach, if it works, and certainly I don't blame anyone for saying that it doesn't justify its use. 7/10."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "jimjimjimjim-167-495946",
        "review_rating": "3",
        "review_title": "Er, what was that?",
        "review_detailed_main": "When writing a review for IMDb you have to select whether or not that review is going to contain spoilers. On this occasion however I can confidently say that this review will not contain spoilers, mainly because I've no idea what just happened!\n\nI like a good art house film, and totally understand storytelling in which \"less is more\". It's nice to be treated with enough respect by a writer/director that I don't have to have everything spelled out for me. But Sleeping Beauty took this to the extreme being giving away virtually nothing.\n\nThis film consists of a series of seemingly unrelated snippets; Lucy's flatmates, the Birdman, the various temp jobs, and then ultimately the strange/erotic sleeping arrangements which the film is sold on. I've no doubt that the writer and director have something they want to say through this (no one makes a film for no reason and I love art-driven film because that reason tends to be more meaningful that the box office take) However, you can't put a few streaks of paint on a canvas in the style of another great Austrailian artist, and then down tools with \"Can you tell what it is yet?\"\n\nIn some ways you'll find this film even more disappointing because in some ways it's very good. It is so beautifully shot and Emily Browning puts in a good follow-up to Suckerpunch. On this occasion there just isn't enough to bring those bits together into a coherent whole. In much the same way as we would all deride CGI heavy films that don't hit the mark; being pretty isn't enough if you don't have the substance behind it and they just forgot to put in enough ingredients to make a complete film this time."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "GOWBTW",
        "review_rating": "6",
        "review_title": "A bold move for Emily Browning",
        "review_detailed_main": "Julia Leigh makes her debut in directing \"Sleeping Beauty\". This has more of an erotic twist than usual. Here you have a university student name Lucy(Emily Browning) , who holds some jobs: works at a coffee shop, makes photocopies at an office, even volunteers as a human lab rat(test subject). Then one day, she checks out a ad for freelance silver service: that's serving older men. The dinner is very formal, and the pay is well. There's one important rule: No penetrating sex. In the meantime, she would meet up with a very quiet man who is known as Birdmann (Ewen Leslie) she never seems to return the favors from him, but she's very content. Following the last session of her job, Birdmann calls her up, and he has overdosed. Lucy would cuddle up with him as he slowly expires. Following his death, Lucy would get a more expensive apartment, and also a secret camera so she would know what's going on while sedated. The next client she had was the first man who didn't cross the line. After the session, he has died from the tea he drank. Guess his heart wasn't strong enough to handle the dose. This movie had a very dark tone, and it was very morose in its way. Very enjoyable by the way."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "RedPanda_1",
        "review_rating": "3",
        "review_title": "A really big disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "lynnfriedman",
        "review_rating": "6",
        "review_title": "This Ain't Your Granny's Sleeping Beauty",
        "review_detailed_main": "Remember the Sleeping Beauty story of your childhood? You know, that family friendly, romantic fantasy musical? OK, now take out everything but the beautiful girl and the fantasy, add a lot of soft core and inexplicable behavior.\n\nThe 2012 Sleeping Beauty is a complete enigma. I suppose it's about a young student exploring her sexuality, or maybe exploiting her body for financial gain. Ultimately I arrived at the conclusion that our lovely Lucy was searching for her true self. In the classic modern single gal mode she signed up for any and all experiences offered to her. All those drugs, unexplained relationships, just plain weird habits, and random sexual encounters added up to a modern upside down fairy tail. Instead of getting the prince, Lucy is searching for a genuine feeling. We don't have a clue what makes her tick and neither does she.\n\nFor about an hour and a half you will be completely baffled by our lead character. Lucy is working her way through college by taking odd jobs such as a test rat in white walled labs and office drudgery in a perpetual paper pushing office. Who could blame Lucy for jumping at the chance of making some big bucks when she hooks up with a kinky temp agency.\n\nInitially she is hired to serve rich people food in some fancy private club. The catch? All the waitresses wear racy lingerie and allowed themselves to be admired/leered at by old men. But wait, there's more. Lucy keeps getting promoted to more challenging and lucrative assignments. Finally the audience gets to see the sleeping beauty reference. Not to spoil things for you, let me just say she drinks a potion, she sleeps, and old men do mysterious things to her. Yes, human sexuality can be perverse. You will see many examples of this, some full frontal, and behavior including random acts of unexpected kindness and disturbing brutality. This isn't your granny's Sleeping Beauty. Or if it is, she didn't write a book about it so you'll never know."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "billcr12",
        "review_rating": "3",
        "review_title": "Pointless",
        "review_detailed_main": "Sara(Emily Browning is a waitress, a college student, an office worker, and, last but not least, an escort. She is also a guinea pig in some unexplained medical experiment in a lab where a long tube is dropped into a throat; a full schedule indeed.\n\nSara drifts from scene to scene without any purpose whatsoever. While working as an escort, a series of rich, old, impotent men are the \"clients\" who are told that the one rule is \" no penetration.\" During the encounters, Sara is sound asleep, her sleep being induced by a strong sedative to prevent her from awakening while do what they will with her semi-comatose body.\n\nI am shocked that a woman, Julia Leigh, could write such a misogynistic, dreary script filled with so many unsympathetic characters; what is the point? I guess we didn't already know that wealthy men past their prime desire young, nubile women, what a revelation. Avoid \"Sleeping Beauty\" at all costs; take a nap instead."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "nihao",
        "review_rating": "8",
        "review_title": "No anaesthetic, thank you, doctor...",
        "review_detailed_main": "An interesting choice. Prostitution amidst university students. Rich old men who spend their money on flesh. Modern 'dettachment'... separating the body from the heart, the soul, the mind. Most of the critics of this film seem to dwell on complaining that \"our world is not like that! All the people here are horrible...!!!\" Of course they are missing the point. We are watching crude realities, but also dreams, symbols, Freudian/Jungian fetishes... A woman is directing. Jane Campion is producing. This is also a 'clue' that MAYBE there is more to this film than meets the eye... Behind the veneer are MANY hidden truths.( Behind the Twin Towers, behind the choice of a black president after a guy like Bush jr.) Separation from the truth. We are all 'anaesthetised'... so Lisa is NOT so strange, after all. Money rules. Maybe we are victims of our society, of our times. We are 'dead', as T.S. Eliot wrote some years ago. Of course the world is full of wonderful, hearty, passionate and generous people. But this film aims elsewhere, and I myself feel grateful to its director, scriptwriter (and , why not, actress) for taking the plunge, and re-floating Pasolini's 'Salò' in a more digestible (maybe more intelligent?) guise. Kubrick? His last movie may still reveal something in the future (ALL his films age very well), but he was an elderly man, and this young director seems to have the upper-hand in as much as hitting the nail on the head with the 'ésprit-du-temps', the 'Zeitgeist' or, more plainly,(and painfully), the new age our youth are forced to grow up in. Somewhat puzzled at first, I gave this film a chance...let it 'breathe', in my conscience and intellect. I'm glad I did. It contains more than one morsel of food for thought."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "george.schmidt",
        "review_rating": "7",
        "review_title": "Browning is a game actress in a brave turn in an otherwise awkward attempt at social mores and sensuality.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "oneguyrambling",
        "review_rating": "3",
        "review_title": "This isn't art. This isn't poetry. This isn't good.",
        "review_detailed_main": "The movie is called Sleeping Beauty.\n\nWomen who watch might call it Stupid Beauty.\n\nGuys will see it as Sleeping Booty.\n\nI see it as an amazing feat for star Emily Browning, who managed to segue effortlessly from her role as the scantily clad pouting idiot in the execrable Sucker Punch into this. The film that I would choose Sucker Punch over.\n\nHang on, I just threw up in my mouth.\n\nBy day Beauty is an everyday teen, juggling school and multiple part time jobs and supplementing her income with submitting herself as a test bunny for medical and/or scientific research, (apparently into how long a woman can have a tube in her mouth without vomiting). She is apparently so busy that she never sees the Australian sun – albino Eskimos have better tans than Emily Browning.\n\nPersonal relationships seem fleeting at best, and generally see Beauty placating various people, an alcoholic (possibly abusive) mother, a friend with addiction, and more mundanely flatmates by coming up with the rent on time and doing some cleaning.\n\nBy day she is known as Lucy.\n\nThe evenings are spent with casual drinking, drug-taking and prostitution\u0085 After responding to a classified as Beauty finds what she sees as a promotion. No longer casual and freelance, she now gets to wear a uniform and serve clients – only her uniform is by no means in the Macca's style, and her clients are little more than rich old pervs.\n\nBy night she is known as Sara.\n\n'Sara's' boss/madam/pimp is Claire. Claire is prim, proper and demanding. The customer is always right, regardless of how messed up or creepy he is.\n\nThe work is well paid but sporadic, but Beauty doesn't do it for the money. In one scene she casually burns a $100 note and watches it crinkle and melt without emotion. The 'job' involves nudity and submitting oneself to potential abuse and ridicule, but Beauty doesn't do it for titillation, satisfaction or compulsion. She just seems to do it. In fact, half way through the film I thought a better title might be The pasty girl who never says no. The phone rings, she answers, and with monotonous frequency heads of immediately at the caller's bidding.\n\nWhether the director meant this to appear empowering or pathetic is beyond me.\n\nRegardless of intent eventually Beauty finds another promotion, essentially becoming little more than the world's largest Pillow Pet for essentially the same clientele.\n\nWe learn practically nothing about Lisa/Sara/Beauty. The film has little music, minimal dialogue and moves at a languid pace like melted icecream down a kerb, but I would argue watching this is more of a tragedy than dropping your Drumstick.\n\nThen with a scream it all finishes, and you wonder why. Keep your artsy. Save your fartsy for another day. To me this is 100% uncut dull and pointless fare. Sure we have an up and coming Hollywood starlet shedding her clothes frequently, apparently this is challenging, daring and mesmerizing.\n\nI just wonder how challenging, daring and mesmerising it would all be if – how you say? – a more natural woman was in the lead. Say the girl from Precious instead of Casper's sister\u0085\n\nFinal Rating – 3 / 10. This isn't art. This isn't poetry. No-one learns lessons. No-one is better for the experience. What it is is a drab two hour exercise in making beautiful female nudity distasteful and unlikable. If anything that is perhaps the film's crowning – and only – achievement."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "tabluvzredgummibears",
        "review_rating": "",
        "review_title": "Don't waste your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "jonathanruano",
        "review_rating": "2",
        "review_title": "Sleeping Beauty",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "aishu-31726",
        "review_rating": "6",
        "review_title": "Cringe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "p-stepien",
        "review_rating": "3",
        "review_title": "Sleepwalking Beauty",
        "review_detailed_main": "Lucy (a revelatory performance in an otherwise underwhelming feature by Emily Browning), a university student, takes on various odd jobs in order to survive. Despite working multiple odd-jobs working as a waitress, a copy assistant or a test subject, while occasionally picking up well-off men at high-end pubs, she barely makes ends meet, unable even to pay her rent (timewise and money-wise drop any attempt to find this logically feasible, as any rational scriptwriting is shunned for the sake of 'artistic' impact). Living in an alternate universe with a 36 hour day Lucy decides to enter another employ - this time as a very well-paid per-job waitress for a lingerie silver service. This in turn leads to another job proposal - to play the role of Sleeping Beauty for wealthy (mostly old) men with somewhat special preferences...\n\nDetached from higher sensibilities each line of work is instrumental for gaining money, an end to itself, as Lucy seems to have no apparent well-conceived needs, instead with an almost nihilistic need for possession - a direction-less victim of societal expectations. The idea of possessing money seems a goal in itself, with Lucy unceremoniously burning some of her earned dollars celebrating the notion that she 'has money to burn'. Here each line of work has a sense of rape of individuality, with tubes penetrating her body in her 'normal work' as a test subject. In some sense the sexual role of Sleeping Beauty offers her better conditions through the strict non-penetration rule, making her a youthful doll to be admired and cherished, unlike in normal life, where she is disregarded. Despite this objectification of hes fetishist employ the monetary gratification in some sense help empower her, while at the same time causing her to become more vulnerable.\n\nDespite some intriguing artistic ongoings intertwined within the movie is an opaque and dull watch, probably the most sleep-inducing movie ever to have half of its screen-time focused on a naked beautiful girl. Emily Browning exposes her body right, left and centre, but the overall cold aesthetic effectively (and purposefully) remove any sensuality or eroticism from proceedings, instead imprinting a dreary uneventful tone of drab boredom. Overall Lucy's character, detached from background or any wider perspective, lacks charm (Emily Browning pulls off a great performance, so she herself is not at fault for the director's misgivings) and appeal to manage to breath life into the monotone uneventful story. Obviously sophomoric from writer Julia Leigh the movie further loses footing due to striking thematic and aesthetic similarity to the vastly better \"Shame\".\n\nLacking any power and overladen with art-house style scenes (borderline forced with severe touches of pretentionality), the movie lacks cinematic language (with severing bland narrative) to convey the more poignant content lingering just around the corner. An overreach of style \"Sleeping Beauty\" will likely disengage even many an art-house audience. Instead it is half expected that most viewers take example from the titular Sleeping Beauty and catch a nap midway into the runtime."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "fernandoschiavi",
        "review_rating": "6",
        "review_title": "A pretentious erotic drama that seems to be a juvenile metaphor for persistent dissatisfaction with society's conventions. But, Emily Browning is stunning in every way!",
        "review_detailed_main": "Lucy (Emily Browning) is a college student trying to make ends meet. Her parents are not rich, and, like a Cinderella cat, she has to juggle three jobs to pay for college and the rent. So far, nothing very new. The young woman who has no problem giving herself to a man based on the outcome of a coin toss game and who, always in need of money, is even forced to use small tricks to get on the subway for free. Then the Sleeping Beauty side comes in, when the young woman meets Clara (Blake), an elegant woman who proposes a curious job: acting as a waitress at high society dinners wearing only lingerie - and it doesn't take long until the girl is \"promoted\" and get the chance to earn small fortunes by agreeing to be drugged so that rich men can use your inert body for their private fantasies.\n\nHowever, it would be a mistake to believe that Lucy accepts all those proposals due to some financial need: although she owes the rent, the girl is not miserable and has friends who could help her. What moves her, therefore, is a subtle (or not so subtle) desire for self-destruction, as she does not hesitate to indulge in potentially dangerous activities and even burns part of the money, she receives just to see the note on fire - a sabotage action aimed against itself and which represents just one among many other similar attitudes. However, the question is: why does Lucy act this way? What moves her? By the way, who is this girl? Apparently having fun keeping the protagonist as a complete enigma, the film reflects this interest even in Emily Browning's performance, which appears inexpressive (on purpose,maybe, since here and there, when necessary, she displays some emotion) and even distant. Due to the director's always open staff. Likewise, the men who pay to use her (but without penetration, as Clara demands) seem driven by private desires and frustrations that gain expression through absurd actions or monologues that are not very enlightening - which indicates that the director and screenwriter has a chronic lack of interest in the characters themselves.\n\nIn just over 1h30, the feeling is that we were presented with several plot fragments, which were not properly glued together to create a consistent whole. We walk a straight line full of flaws, faced with characters that we don't have the chance to understand very well. The worst thing is that, often, this straight line seems to turn into a circle of repetitive and empty scenes, with endless camera movements that are so slow. At these times it seems like the film will never come to an end. All of this is combined with the fact that Lucy doesn't change, doesn't undergo transformations, doesn't learn, doesn't win and doesn't even seem to have a specific goal. Therefore, we are not facing a typical Hollywood film. Julia Leigh breaks the mold and presents us with a protagonist who, for most of the plot, seems to be anesthetized, apathetic. Not even when Lucy is consumed by the curiosity of knowing what happens in the hours when she is blacked out, can we feel this need. It's only when she wakes up - in the broadest sense possible - that the audience can finally see a spark of feeling. But then, the film ends.\n\nAnyone who remembers \"Eyes Wide Shut (1999)\", Stanley Kubrick's last film starring Tom Cruise and Nicole Kidman, will have a good idea of what's to be seen in Sleeping Beauty. But the vision here is on the other side of the curtains, which are revealed to the outside world only at the last hour. The protagonist's lack of motivation can be seen as a criticism of the current contemporary situation of young people, who have access to everything but nothing really interests them. But the director is not incisive enough in her speech, and the general impression ends up pointing to a lack of objectivity in the entire project, slipping into the very criticism she intended to make. With the current wave of live-action film versions of classic fairy tales, sparked after the stunning success of \"Alice in Wonderland (2010)\" - and followed by \"Red Riding Hood\" and the two adaptations from Snow White (\"Mirror Mirror\" and \"Snow White and the Huntsman\"), \"Sleeping Beauty\" can easily be mistaken as a retelling of \"Sleeping Beauty\". Such a mistake would not be completely unreasonable, as there are, in fact, elements that link the two stories. But this production, selected for the competitive exhibition at the Cannes Festival in the year of its release, has a cruelty, a dissatisfaction and a lack of enthusiasm that irremediably distances it from any children's fable. It can be considered a version of the fable, but from modern and pessimistic eyes, for which a happy ending is as impossible as it is unlikely.\n\nA work of art is an expression that comes encoded through a sound, an image or a sign, which is often not easily understood by the person who observes or listens to it, leading that person to reflect or be inspired by what that makes you feel or think. In this case, \"Sleeping Beauty\" can even be called \"artistic\", however, I believe that it can also be easily labeled within another adjective, commonly associated with this type of cinema, which is \"pseudo-intellectual\". This is because what sustains the film is the suspenseful plot and its aesthetic aspect and not a possible questioning within the theme it addresses. The choppy plot, the disjointed narrative, the extended and static plans end up serving to make us curious, impatient and possibly frustrated with the ending, which is presumed strong, but, however, has no resolution. The character herself ends up becoming uninteresting on her path due to her apathy and passivity in the face of the things that occur around her.\n\n\"Sleeping Beauty\" is an erotic drama. There is no sex, due to the fact that the company's policy is only the worship of the female body and satisfaction through closeness and viewing, not sexual acts. However, there is a lot of contact. Which makes \"Sleeping Beauty\" a work that takes sexuality to another level, a more sensitive and almost pagan one, very rare in contemporary cinema. The men who hire Lucy's services follow the rules, but they also obey their own desires and play with the girl's body in the way that satisfies them most; from just caressing him to putting out a cigarette on her face (an act that, whether he gets away with it or not, is not clear in the film, as this is also apparently prohibited). The portrayal of the feminine is the strongest aspect in the film. Emily Browning's perfect features and curves, plus the tone of her skin, hair and lips, in a room with light sheets and soft colors, give her a divine appearance. A Goddess with the role of satisfying men's deep desires, hidden away in her own subconscious and waking up the next morning only knowing that, the night before, she made someone happier. And leaving with your money. In the end, without major spoilers, Lucy comes to a conclusion that she can redefine her self-esteem forever, a conclusive conclusion that is heavy and, like almost everything in the film, humble. It would be a light film, if it weren't for just one element: Browning's intense, energetic and surprising performance, who bravely faces the film's loud and explicit graphics, the exposure of his own body in extreme positions and the drama that the character exudes.\n\nUntil Lucy discovers this new \"profession\", the film is slow to introduce who she is, who she lives with and what she does. Almost all scenes are filmed in a single continuous shot, which, combined with the slightly slow script and the absence of a soundtrack, can be a bit tedious. However, even if the film's rhythm doesn't change, the character's rhythm changes, and with it, our perception of the story. And the use of the virtual phenomenon of the fetish for sleeping women, combined with the reference to the classic by the brothers Grimm and Charles Perrault, plus the aesthetic elements of Renaissance paintings in the character's characterization make \"Sleeping Beauty\" a film rich in alternating simplicity and energy, but with many defects.\n\nAppearing at best as a juvenile metaphor for persistent dissatisfaction with society's conventions, \"Sleeping Beauty\" is a pretentious and empty film. The big problem with this plot is that there doesn't seem to be any motivation for the character, much less anything that gives meaning to her actions. Browning does what she can with her performance-and she tries-but you realize that even she couldn't decipher her own role, going from one situation to another as if she were anesthetized. The very outcome that she intended to be shocking, not only does not bring any response but also does not show anything that the public has not seen before. First-time director and screenwriter Julia Leigh leaves her artistic mark on the dialogue and images with subtle camera movements and direct framing. A good example is an extended monologue from one of Lucy's clients to her agent. There are some impactful scenes inside the mansion in which the film's best scenes unfold, but nothing that makes \"Sleeping Beauty\" worthy of attention. What should be a parable about feminism (old men have Lucy's body, but they can't reach her mind) ends up being a tedious essay on pretensions in cinema.\n\nBut this entire attempt to position his work as purist art falls apart due to the lack of narrative planning, placing the script in a kind of limbo, from which it cannot emerge to give a satisfactory final answer to the viewer. \"Sleeping Beauty\" has only one gift for men: the impossibility of not being totally mesmerized by the beautiful and simply stunning Emily Browning naked in several scenes, with her skin \"as white as snow\" like Snow White. Furthermore, it is an example that there is a big difference between a film with several interpretations and a shallow film with nothing to interpret. And it falls squarely on the second alternative."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "johnklem",
        "review_rating": "3",
        "review_title": "Shocking(ly awful)",
        "review_detailed_main": "The most interesting question in this film is posed by a minor character who asks his pupils why the master played a move that resulted in his certain defeat after 27 minutes of deliberation. It has absolutely nothing to do with the story and we never learn the answer. The second most interesting is... what on earth possessed anyone to allow their name to be linked with this barely better than student effort? Written (and I use the word loosely) by somebody who doesn't understand or hasn't bothered to learn the basics of working in film and apparently directed by the same person, the film blunders its way from pointless scene to pointless scene, filling in the gaps with dialogue so stilted you might as well be watching bad porn from Chatsworth. The third most interesting question is what were the selectors at Cannes smoking when they decided to include this? Oh, and one more... can Emily Browning's career (so much wasted bravery on show here)survive this and Sucker Punch?"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "PeterMitchell-506-564364",
        "review_rating": "6",
        "review_title": "Sleep on it",
        "review_detailed_main": "One thing I can say about Sleeping Beauty, it is bloody original. Don't you just love it's title. This only heightened my interest. The story could be fantasy, or it could real, or may'be part fantasy. Sadly some of the scenes fall flat on their face, a couple of others are just flat out boring. Take the first scene. Our ravishing beauty, Lucy (the lovely Emily Browning) who looks tasty in lingerie with the perfect of figures, walks into this room, probably a hospital, where this guy inserts something into her mouth. She's obviously a volunteer in a Semax kind of job. You'll understand, if you're an Adelaideein. She also works in an office and a restaurant. At this one Sydney singles bar, she goes home with men of fathering age to have sex. In one early scene, she puts the smile on the face of one lucky winner, the better looking of the two, after winning a three toin coss. This guy's also older. When does she sleep, hey? Well that could be when her life really happens? But back to the hospital room, we nearly wait one whole minute for Emily's entrance, where we just watch this guy set up this device. BO-RING. Only a series of tasty scenes with Browning naked, semi clad, make up for it. Lucy shares this townhouse, with two other young flatmates, if you can call em' that. She also goes to university, so we have one tired lass. So tired, she likes to take little catnap on the floors of the office she works. Struggling to make ends meat, as obviously her two other housos are sort of freeloading, she answers yet another ad, but this is no ordinary ad. It's an ad for an exotic hostess in lingerie in this mansion, where they serve these refined, mostly creepy sort of 60 something men, though there's a woman as well. God knows what her thing is. These richly shot scenes work well. Little Lucy is among slightly older lingerie waitresses, with overdone make up, their breasts showing through their ugly corsets, all of them ugly compared to her. Another weird scene has Emily serving them drinks, her open breasts, slightly protruding about her fabric, as two other women are knelt down beside the fireplace, with their moons showing during the whole erotic display, that immediately had me thinking of similar scenes in Eyes Wide Shut. This rich clientele men are the same men that have sex with her, without her knowledge, as she's drugged. Only one rule for these men, that's a drag. No penetration. We see these men get full frontal. The camera's not afraid at all to show these men, or Browning in close shots, also ones of her getting done by this sixty something guys. The first old guy, the best looking out of the three, provides the movie's boring scene. Prefore to stripping down and having sex with our beauty, he tells a five minute story, to a madam sort of figure, Clara who runs the place. It's so bland and dead boring, you almost want him to cark it. It's actually one of the most boring scenes I've witnessed in my whole movie watching history. The second old guy, yes that is legendary actor, Chris Haywood show's a horrid dislike for our beauty, purposely tripping her up in the dinner room. While in the bedroom, he gets atop her and licks her face while keeping her mouth open, lips protracted and using some quick shocking expletives. Even before he strips, well he does have his shirt unbuttoned, he drops a bit of hot ash from his lit cigarette onto Lucy's face. We see her face wince for a moment, but also with this, a look of anger and repulsion. Haywood says this great line about viagra that stays with me. The scene with the third client, Hugh Keays Byrne, looking somewhat very different from the toecutter he played in Mad Max, just tossing naked Lucy around like she was a pillow, is just stupid and pointless. What the hell was that? May'be it was what the Lucy character thought she only amounted to, and like the deal of this movie, it doesn't really add up to the much either. I take my hat off to Emily Browning for her brave tour de force performance. And that's what a real actress is, someone who can tackle real challenging roles like this. This is one actress you shouldn't sell short. In my opinion she's of higher acting stature, to Teresa Palmer or Isabel Lucas. You name it. That Oscar nomination has to be somewhere around the corner for this lass. You show em' Emily. I couldn't watch a second viewing of Sleeping Beauty, without having to fast forward through a couple of scenes, but with Emily naked, part naked, those scenes would warrant a quick re watch. Sleeping Beauty's ending is quite a shock climax, then one of sheer relief, where Lucy has sex in this special room that earlier in the film, sees another spunky young chick, drugged, being quickly escorted towards a waiting limo as she just steps out of hers. Definitely, something different, but not for all tastes. Let's hope there isn't a sequel. And again I must add, Emily looks darn hot in lingerie."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Mozjoukine",
        "review_rating": "1",
        "review_title": "Misguided attempt at an Oz art film.",
        "review_detailed_main": "Why anyone would want to do a down beat Australian version of BELLE DE JOUR is hard to figure and why they are being encouraged after the event is even more so. File this one in the same bin as EVERLASTING SECRET FAMILY - wants to be shocking & profound but ends up dumb/nasty.\n\nThe sensational elements mainly consist of Browning getting further undressed each time out and introduced to more humiliation. However the viewer is distracted by wondering how she manages to fit in her tertiary maths course, a day time job collating documents that you'd expect the machine in the same room to do, second job at the cafe, visiting a dried out case who has museli and gin for breakfast, getting picked up in bars and hiring on as a fetish object. Lets not start in on why she burns the hundred dollar note in sustained shot, like the opening with white coat shoving a tube down her throat.\n\nThe photography is quite pro and cutting rare - most scenes play without any inserts. As for the performers, our sympathy for the actors' humiliation overrides any criticism of their performances."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "angel-with-a_filthysoul",
        "review_rating": "10",
        "review_title": "Absolutely Beautiful if you are a film lover!",
        "review_detailed_main": "A lot of people will not like this film due to it not being mainstream. It is open to interpretation and closed minded people will not understand it. Emily Browning is gorgeous and well cast. This film reminded me a lot of Stanley Kubrick's films as they are both beautifully shot and nudity is art rather then sexual. This is the direction Tim Burton's Alice in Wonderland should have gone as it is a very dark and erotic tale of Sleeping Beauty and it is Australian! This film has a lot of hidden messages to girls in the sex industry. She is not a prostitute but is willing to go to far lengths for money. She reminded me of a stripper but it was not enough and has to go to far ends to earn money. I advise you to go see it and support Australian Cinema and watch it with an open mind! You will love it"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "kareemamgad",
        "review_rating": "6",
        "review_title": "An Intriguing Yet Unsettling Experience",
        "review_detailed_main": "Sleeping Beauty (2011) is an enigmatic and provocative film that offers a haunting exploration of power, control, and intimacy. While its themes and execution are undoubtedly bold, the film falls short of fully delivering on its potential, leaving me with mixed feelings.\n\nEmily Browning gives a fearless performance as Lucy, embodying her character's vulnerability and detachment with remarkable subtlety. Her portrayal is deeply unsettling yet captivating, holding your attention even when the narrative itself becomes opaque. Browning's willingness to immerse herself in such a challenging role is commendable and a highlight of the film.\n\nVisually, the movie is stunning, with its cold and sterile aesthetic reflecting the detached and clinical world Lucy finds herself in. The cinematography is precise, often framing scenes in a way that feels voyeuristic, which enhances the film's unsettling atmosphere.\n\nHowever, the pacing is slow and the storytelling is sparse, which may alienate viewers looking for a more conventional narrative. The movie raises many questions about its characters and themes but leaves most of them unanswered. While this ambiguity is likely intentional, it can also feel frustrating and incomplete.\n\nDespite its shortcomings, Sleeping Beauty (2011) is a unique film that lingers in your mind long after the credits roll. It's not an easy watch, and it's certainly not for everyone, but it's a thought-provoking exploration of dark and taboo subjects.\n\nApproach this film with an open mind, and you may find its stark, minimalist style and unsettling themes worth contemplating. It's flawed but undeniably intriguing."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "ejsha_gebadi",
        "review_rating": "3",
        "review_title": "Could have had more potential",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "writers_reign",
        "review_rating": "",
        "review_title": "perchance to dream",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "eyecatcheramit",
        "review_rating": "1",
        "review_title": "extremely lame movie",
        "review_detailed_main": "I don't know why on planet earth this movie has got a 5+ rating on IMDb. it seems like all the characters who worked in this movie have given a 10 to bring the rating up. Its a huge waste of time made by some art house wanna be. I would drop a $100 bill in the toilet and flush it so that i can see it go round and round till it disappears and that would count as a piece of art than this piece of garbage. they should have named this movie as sleeping turd than sleeping beauty. Emily browning was expressionless as usual, same thing she pulled up in sucker punch. At this rate she will be obsolete in few years from Hollywood. She really needs to pull up her socks than drop her clothes on screen."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "tomlu1",
        "review_rating": "7",
        "review_title": "What's going to happen?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "JenEvans1",
        "review_rating": "1",
        "review_title": "Possibly the worst film I have ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "micropotato",
        "review_rating": "6",
        "review_title": "one of those artsy films that leaves you with a weird empty feeling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "grouchyeditor",
        "review_rating": "5",
        "review_title": "Fantasy Time for Dirty Old Men",
        "review_detailed_main": "I like my movies odd, and I like my movies sexy. In general, when I review an odd, sexy movie, I want to be kind because I don't want filmmakers to stop making them. But there is a limit – and freshman director Julia Leigh's \"Sleeping Beauty\" is long on odd and short on sexy.\n\n\"Sleeping Beauty\" is about a young woman named Lucy (Emily Browning) who is psychologically damaged. In fact, everyone Lucy encounters – an old boyfriend, co-workers at a temp job, the landlords with whom she lives – is damaged in one way or another: hostile, bitter, emotionally impenetrable. So Lucy, who is nothing if not experimental, takes a new job as a living blow-up doll for rich old men to play with (but never to \"penetrate,\" as we are constantly reminded by the madam of the high-end brothel for which Lucy works).\n\nLeigh's movie is basically a 100-minute peep show in which we observe Lucy and her peculiar acquaintances. It's an Australian production with French art-film pretensions; when someone pours a glass of tea or wipes down a tabletop, Leigh's camera lingers portentously. There is much unspoken angst in the film – but not to worry, because all of this somber silence will soon be broken by some kinky sex.\n\nIf I didn't know better (actually, I guess I don't), I'd wager that \"Sleeping Beauty\" was produced by a committee of dirty old men, several of whom get to appear in scenes with the fetching, young Browning. How else to explain numerous scenes in which these geezers, their twigs-and-berries on full display, spoon with the naked and unconscious girl, or mount her sleeping (drugged) body, or toss her recklessly onto the floor?\n\n\"Sleeping Beauty\" is promoted as an \"erotic drama,\" but while watching it I found myself empathizing with one of Lucy's customers, who complains: \"The only way I can get a hard-on these days is if I swallow a truckload of Viagra.\""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Kingslaay",
        "review_rating": "6",
        "review_title": "Not all bad",
        "review_detailed_main": "Sleeping Beauty is intriguing and shocking in parts. There is no easing into anything here, the film is unapologetic and wastes no time. It does cast a light on the realities some young woman face and the choices they make. While the sleeping element may not exist a lot of woman do various jobs to make ends meet. Sex and youth sell. In the society we live in the ones with a lot of wealth and power tend to be on the older side and the young have to be open to odd requests to see some coin. The film is almost a snapshot in time of the life of a young woman and some of the things she feels she needs to do to survive. I wonder what her life will be in 50+ years time, when she is on the older side? Will too succumb to such a depraved lifestyle and the cycle repeats itself?"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "PThornett",
        "review_rating": "1",
        "review_title": "Complete rubbish!",
        "review_detailed_main": "This film is unadulterated rubbish. I cared nothing about what happened to anyone in the film, few of the scenes led to anything of meaning or interest (a small example: as Lucy is waiting to get in a lift, a group of students is seen nearby, and the presumed occupant of the flat they were previously in darts out to return something to one of the group; this has nothing to do with anything in the film, and appears to serve no purpose whatever). The film lacks any emotional content, and seems to serve no purpose and answer no questions.\n\nThis film might remind some of Kubrick's film Eyes Wide Shut, but that film is far superior in every respect."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "mathomas-28053",
        "review_rating": "9",
        "review_title": "allegory for women's lives",
        "review_detailed_main": "I see this movie as an allegory about the lives of women in our society. Caretakers, sex partners, objects of fantasy and desire, switching among multiple jobs in a 24-hour day, driving themselves even when they're sick, scared of death (not only their own but others'), kicked around, not respected, expected to be polite, trying to make the rent, doing menial jobs, doing very important jobs, etc. Etc.\n\nIf you watch the movie in this context, it is very well done. Great directing, excellent acting, good casting, good camera work, good makeup, good hair styling, pithy script, a good message, very watchable and entertaining. It kept my attention."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "maxiam_us",
        "review_rating": "6",
        "review_title": "Potential to be a Grindhouse Flick, imho",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "SanteeFats",
        "review_rating": "4",
        "review_title": "Huh??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "doctorsmoothlove",
        "review_rating": "",
        "review_title": "Boring Beauty",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "odoacer-1",
        "review_rating": "3",
        "review_title": "Drink the Tea (spoiler)",
        "review_detailed_main": "This movie may be the most boring erotic movie of all time. And perhaps that was it's subversive point.All sex all the time eventually gets....boring.\n\nI wished that I had an opportunity to drink the tea before I began to watch this movie.If I had, I would at least have gotten some solid hours of sleep. As it was, I was merely bored to tears by the whole thing. Was the screenplay secretly written by the Marquis de Snored?\n\nThe one thing about the film that was mildly interesting was the allusions to her past life. If more had been shown about that, this movie would have been mildly improved."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "unendurable_lampoonery",
        "review_rating": "1",
        "review_title": "unoriginal and flatly acted. pretentious.",
        "review_detailed_main": "this film was terrible and i believe Emily Browning is a horrible actress who's last two movies. (this and sucker punch) have got to be in my top ten worst movies of all time.\n\nthis movie is pretentious on so many levels and again boring, drab and in my opinion flatly acted by at least half the actors.\n\nthe storyline is also rather distasteful, not that movies need to be tasteful or anything as i also understand that film is just another medium for an artist to get there message across with. but in all seriousness this film made me feel a little sick, but i think the acting did that on it's own, especially how it seems Emily Browning just droned her way through the scenes."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "daninpaddington",
        "review_rating": "1",
        "review_title": "Worst film I have ever see in a cinema!",
        "review_detailed_main": "I say that, because it reminds me of a student film made by someone with more money than talent... but I can't just blame it all on the director - the acting was appalling, the script seemed like a great idea but lost the plot in what must have been thought of as 'art'! Surely, even a good composer might have been able to add something to this film, but they didn't even give them a chance!\n\nHaving said that, the cinematography and lighting are quite good... in fact, a couple shots were mesmerizing (but I am afraid of spoiling anything by saying which ones I thought were :) Also, the make-up was excellent and the wardrobe worked well, as did location scouting (for the most part), but the acting was truly the weakest point of the film – in the end, no one in the theatre gave a stuff what happened to any of them – the audience laughed when the film ended!\n\nI give the director credit for trying, and truly welcome their next effort, just please, don't insult the audience next time...\n\nStay away! You won't even been able to sleep through this movie - much as you will want to!!!"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "MihaiSorinToma",
        "review_rating": "3",
        "review_title": "A time-wasting movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "njs-55801",
        "review_rating": "8",
        "review_title": "Emily Browning is excellent as Lucy, whose need for money and conflicted personality lead her into the fetish world",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "butcherkelvin",
        "review_rating": "3",
        "review_title": "pretentious, moi?",
        "review_detailed_main": "Even David Lynch and Kubrick at his worst would have blanched with embarrassment and thought twice before committing this pretentious tripe to celluloid. So bad I was sure it was directed by Paul Cox. There is more drama and eroticism in the flicker of Emily Browning's eye lid than in this entire film. There are moments of visual splendor (mainly when the camera lingers on Browning) but then a character spoils it all by mouthing sub-Pinter profundities. It's as if it was put together from scraps of Eyes Wide Shut and Mulholland Drive, scraped up off the cutting room floor or found in some long forgotten waste paper basket. Further evidence (if it were needed) that a first time director should avoid directing their own script."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "mohammadumairkhan",
        "review_rating": "2",
        "review_title": "You can defend your art by calling it art.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "redclann",
        "review_rating": "1",
        "review_title": "Boring to Death",
        "review_detailed_main": ". . . and only gets more boring throughout. The name, the picture, and the trailer are completely non-representative of the movie. It is many layers of horrible. A severe disappointment. Save yourself. It is the ultimate waste of life."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "saadgkhan",
        "review_rating": "5",
        "review_title": "A W****House of different type so as the Movie",
        "review_detailed_main": "SLEEPING BEAUTY – CATCH IT ( B- ) Sleeping Beauty is an erotic Australian movie about a w****House of a different kind. A young girl gets involves herself into W****house, where she doesn't have to prostitute herself but let herself to sleep for hours while other abuse her body in most disguising way. The subject matter of the movie is shocking and it shows us a side of people under their suits. How far humans can go for to fulfill their twisted fetishes? Human may have started wearing clothes and behaved civilized but under closed doors they're worst than animals. For me watching Emily Browning in such an erotic role was surprising. Watching her for the first time in Lemony Snicket's A Series of Unfortunate Events with Jim Carrey to this is defiantly a surprise. Emily Browning has done a tremendous job, not only she is stunningly beautiful but she allows herself to go that raunchier in it. Michael Dorman was okay. On the whole the movie is good but it doesn't show us the purpose of making it. Was it just a shock value or director could not go more into the reason behind these psychotic fetishes?"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "RedQueenIMDB",
        "review_rating": "4",
        "review_title": "I get it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "bruno_bracco",
        "review_rating": "9",
        "review_title": "Disturbing, but thought-provoking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "DICK STEEL",
        "review_rating": "5",
        "review_title": "A Nutshell Review: Sleeping Beauty",
        "review_detailed_main": "With the re-imagination of fairy tales such as the take on Little Red Riding Hood and two upcoming snow white movies in Mirror Mirror and Snow White and the Huntsmen, filmmakers are digging deep into fairy tales for inspiration for their stories, giving them a little twist to the characters and scenarios, that sometimes court a little more controversy like in this case.\n\nAt first glance, this film is likely to be mistaken for a fantasy adventure for elite club old men, who maintain a hush hush membership to a somewhat clandestine dining club where they are served by naked women, and then for those who want to, get to spend some alone time as well with the girls. The catch however is that these girls are given a tea to drink prior to the nights accompaniment, that sort of works like a date rape drug, but the pact that the old men have to promise to adhere to, is that there should be no penetration. But who's there to check anyway?\n\nWriter-director Julia Leigh in her debut feature puts us there like a fly on a wall, with that exclusive sneak peek into what goes on behind those bedroom doors, but alas like the pact the old men have to keep to, we don't get to see anything in exchange for some privacy, where the narrative fades to black as things get a little more risqué. And what we do get to see in having our voyeuristic tendencies fed, is plenty of Emily Browning in the titular role, being moved around, abused even, in her birthday suit, and one wonders if she's really fast asleep given the sick things these men have up their sleeves, and whether their promises of not sticking it in will be kept. All that we're getting is a tease, and suggestion, with little else on offer.\n\nBrowning plays a poor university student desperate to make some money on the side, and we don't actually get to see whether she gets paid for spending the nights with random strangers picked up from bars. Her house-mates don't like her for not paying rent on time, and she spends half the time on campus looking for jobs, or sustaining her waitressing one during the nights, or volunteering for some health probes and screening just to earn a quick buck. Opportunity knocks in the form of a job under Clara (Rachael Blake), where discretion is key and expectations get set, and she's to maintain her nubile body and not abuse it with smoke, drink or drugs, which of course this girl of the night finds it hard to do without. Whatever free time also gets spent on a man (Ewen Leslie), with whom she seems to be sustaining a strange, domesticated relationship as well.\n\nWe journey with her into her new job, and get to see various old men taking her to bed, treated like a piece of meat. Naturally throughout the course of making it good and getting paid handsomely for her efforts, curiosity will creep in and comes in the form of a spy camera, which she installs during one of the forays to capture and witness for herself how her body would get abused. This set up promises to shock during the end, but all we get is a whimper instead after all the expectations built into the narrative given its premature transitions (at least to audiences wanting more) to the next scene.\n\nSome may say that this may have touched upon the theme of empowerment of her sexuality, but I would prefer to go as far as saying this is like the Emperor's New Clothes. There isn't nearly anything much to see, and the narrative is pretty bland. We spend more time ogling at what's going on because it's so in-your-face and the desperation of the old men somewhat hilarious as well, though we're probably wishing we have membership to such an exclusive club, than to try and peer beneath the veneer of ostentatious clubs. One wonders what Browning sees in the role other than to announce her hastiness in wanting to arrive in the big leagues, thinking that going without clothes could probably fast track her career as the fearless actress willing to bear all for an arty role. She plays her character convincingly, although I'm not quite sure if Sleeping Beauty would give her the mileage she expected to receive.\n\nAs a first film, it is daring, bold and provocative, but if you'd sit back and think about it, you're likely to feel, what's the point in this more style than substance film?"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Chris_Pandolfi",
        "review_rating": "5",
        "review_title": "Art for Art's Sake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Ruskington",
        "review_rating": "3",
        "review_title": "Creepy pretentious twaddle",
        "review_detailed_main": "Julia Leigh's indulgent debut movie is a waste of an interesting idea. This slow and often disturbing story relies too heavily on shock value and it is only the strangely captivating performance from Emily Browning that makes it even remotely watchable."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "evan-310-803914",
        "review_rating": "1",
        "review_title": "At points, I was considering gouging my eyes out with a dirty spoon to raise the entertainment level.",
        "review_detailed_main": "Where to begin, well to be fair – there was a bowl of fruit near the television and I found it a constant distraction because at times, the bowl of fruit seemed to be more interesting than the movie. In reality I found this movie disjointed, with multiple disconnected unnecessary scenes linked together making an already long movie so long it felt like it might have actually slowed down time to the point where it might have stopped.\n\nIt seems that the director only had two entertainment tools – sex and nudity and there was a constant battle to try and lure the viewer in by showing one or the other\u0085 or both. This film can be best described as new-age hippie cinema, and should you find it interesting there is a bowl of fruit that I can recommend that will almost certainly knock your socks off."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "marydm-43470",
        "review_rating": "1",
        "review_title": "Disturbed and Disturbing",
        "review_detailed_main": "And not in a good way. I so wanted to like this movie, being an Aussie and a woman. Instead it made me sick to my stomach. I wonder whether the actors involved, especially the luminous Rachael Blake, felt the same while filming their scenes. Yeah, great art is often disturbing. But this movie is only pretentious \"art\". No point discussing the usual cinematic aspects with this movie, even though the cinematography is pretty good. Nor is it a squeamishness about the sex that is bought and sold. Who cares about that? It's the oldest game in town. The problem with this movie is its total lack of conviction and integrity. There's no character motivation, development, moral conflict. They all go through their paces like it's a moral pantomime, they're actually pretty frigid characters despite the pretense of super kinky sex.\n\nGive me disturbing art that has integrity any time. Don't try to pull the wool over my viewer eyes with dishonest garbage. What a sad, sad, sad piece of cinema.\n\nOne star because the can't post without."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "drownsoda90",
        "review_rating": "8",
        "review_title": "Silence speaking volumes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "PotterHead-7",
        "review_rating": "1",
        "review_title": "One of the worst films ever made",
        "review_detailed_main": "Awful, pointless, stupid and disgusting. That's 2 hours I'll never get back."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "emfiliane",
        "review_rating": "4",
        "review_title": "Self-aware, cold, and interesting, but disconnection and overuse of repetition",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "moviemajesty",
        "review_rating": "4",
        "review_title": "A Whole Big Bunch of Nothing",
        "review_detailed_main": "Lucy, played by Emily Browning, is a young college girl who decides to make some money by taking a drug that puts her to sleep and letting old men do what ever they want with her. The film really was a drag and could have been about 30 minutes long. It seemed like every scene was prolonged, from the slow dialog, no music, and 10 second fade-to-back- screens. About half of the scenes seemed to have nothing to do with the plot and were completely random. And finally, the ending was just bizarre and seemed out of place.\n\nOn the positive side, I did appreciate the film for its attempt at something different, as I can't really think of any movie I have ever seen like this. A few of the scenes of Lucy and an old man in the bed were fairly disturbing. I also enjoyed Emily Browning's performance, although she really didn't have to do much besides get naked.\n\nOverall, I wasn't a huge fan of the film, but I can appreciate it for trying something new. But I felt it was a bit too \"arty\" and definitely not for everyone."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "rpathak113",
        "review_rating": "5",
        "review_title": "Good try but failed attempt",
        "review_detailed_main": "First half of the movie was better makes the second half curious. However second half and climax goes flat without thrill. Movie revolves around lucy the Lead character performed by Emily's, her performance was good and challenging.\n\nFew scenes gave me goosebumps however Many of the scenes could have been avoided which does not go with the story.\n\nDialogs are not effective and expression of the characters are less effective. Its no where a Mystery or Thriller. Its a straight Erotic drama movie.\n\nDialogs towards end of movie should have been more to explain the reason of the actions.\n\nClimax was too short and not explained well. Excitement to watch till end drops the movie is finished."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "educallejero",
        "review_rating": "1",
        "review_title": "More like a Nightmare?",
        "review_detailed_main": "Ok. I don't know if I \"got\" this movie. The protagonist is a girl working different jobs to pay for college. She's human, so she likes some druggs, alcohol and sex. That's all ok. But then, she sudenly gets a weid sexual job, and gets a promotion to a even weirder job, where she's paid to drink some drugg to laid naked and unconscious so some old farts can do whatever with her body, except penetrating her. So that's the movie and I won't spoil it.\n\nWhat I got from it and its conclusion is some sort of metaphor on how she was already wasting her life on a not really significant life (without a working relationship and more than anything, druggs and alcohol) thus a parallel with that kind of job where she literally just \"sleeps\" while things happen to her.\n\nThe \"you are not enjoying life\" tale has been done a gazillion times before and way better at every level. The dialogue is not absurd enough to pair with the weirdness of the movie. The acting is, probably purposely, empty. The movie doesn't have any comedy, so you have to take it at face value and super seriously. And its disturbing like a Black Mirror episode, but less entertaining and it doesn't leave you thinking after it ends. To me, it just doesn't work."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "maciejchrzanowski",
        "review_rating": "8",
        "review_title": "East and the West",
        "review_detailed_main": "The title and main plot of the film is inspired by Yasunari Kawabata novel House of the Sleeping Beauties written in 1961. In book main character and narrator is visiting the house providing special services for wealthy old men. The client can spend the whole night with a beautiful young girl who is under the influence of sleeping pills. There is only one condition - no penetration. According to narrator the girl's sleeping state allows to avoid old men embarrassment.\n\nUnlike the book, the film is mainly told from the perspective of one of the \"sleeping beauties\".\n\nIn contrast to the rather perverse subject, the book is full of subtle poetry which, unfortunately, the creator of the film failed to convey. Perhaps because the film takes place in the present day, in the 21st century, or maybe because of the differences between the cultures of the East and the West.\n\nThere is also a feeling of certain embarrassment that the viewer can share with one of the characters in this film of participating in something immoral. But maybe it was intention of director of the film ?\n\nWhile writing this review, which is essentially critical, I realized that I rated the film quite highly, giving it 8 stars. But I guess that's for the courage to take on such a controversial subject."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Bello-4",
        "review_rating": "1",
        "review_title": "Who Writes This Stuff??? A Disjointed Mess...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "transformation-49932",
        "review_rating": "2",
        "review_title": "Self. Indulgent. Australian. Claptrap.....",
        "review_detailed_main": "....reminiscent of the worst of Jane Campion's offences. Tiresome. The Australian Film Industry wonders why Australia won't support it. Here's why."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "bluebubble0927",
        "review_rating": "2",
        "review_title": "I Really Got Sucker Punched into Watching This Mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "deeper_blue",
        "review_rating": "5",
        "review_title": "Beautiful but soulless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "MrGKB",
        "review_rating": "3",
        "review_title": "Unrelentingly pretentious twaddle...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "casioshaman",
        "review_rating": "8",
        "review_title": "Intriguing and portrayed without unnecessary construct",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "estreet-eva",
        "review_rating": "2",
        "review_title": "How boring could mild porn be? Here's you answer.",
        "review_detailed_main": "You would be hard-pressed to find a movie with more stilted scenes or performances than those in glacially-paced evidence of \"Sleeping Beauty\" (presumably the title also doubles as the effect movie has on audiences). In many scenes the actors stare at one another like complete strangers at a tech support networking event. Given minimal dialog and stage direction that largely amounts to \"pretend you are at a fancy, perverted, dinner\" there is a lot of uncomfortable shuffling of positions and awkward silences. After a lot of nothing happens the first, seemingly, 16 hours of the picture, eventually Julia Leigh gives up and just starts contriving far-fetched reasons to see charisma- challenged Emily Browning naked. Another 10 hours in and basically it just the laconic and implacable Browning full-frontal long, long after it has lost its nominal power to charm. In short, use the time to get a nap instead - having that same anxiety dream for the umpteenth time will be more interesting."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "mompaxton-481-121381",
        "review_rating": "2",
        "review_title": "Mmmmmmmkay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "metratonic",
        "review_rating": "2",
        "review_title": "Yasunari, sorry",
        "review_detailed_main": "The idea for a non-penetration brothel, a house of sleeping beauties is taken from the short story \"House of sleeping beauties\" (Nemureru Bijo) by Kawabata Yasunari and brought upside down, bowels out and head over heels, keeping only the overly sleepy mood of contemplation (here: self- contemplation). The point of view switches radically from the old man (book) to the sleeping girl (movie). So far, so good. The idea was more than fine, the book - okay, but the movie was a true disappointment. Why, though? First, it lacks a true intrigue. And I'm so sorry to say that the only thing that kept me more or less awake while struggling to watch this, was the sight of Emily Browning more or less naked. Perhaps they told her to act sedated during the whole movie, so that the viewer could see some sense in the title (because in more half the film Lucy, her heroine sells her body in various ways, none of which includes the slightest hint of sleep, but nonetheless her nipples show way more emotion and development than her face). That very same larger half of the movie seems to act like a poor cinematographic justification for prostitution, which sadly is not so cinematographic, even with the eyeswideshuttish scenes of erotic silver service or overly theatrical and profound blackouts between scenes, or even the final frame that serves as an unexpected (yet not unsuspected) ending. The movie is void of character development or a visible concept or anything, but that is not necessarily a bad thing. The book was the same: the contemplation, the sensual but not erotic stuff and the all- pervading impression that human beings are immanently messed up. It's not exactly the inspiration to make you go out of the cinema with pulse over 100 and the strong desire to change your life and the world, but it could have triggered some thoughts and emotions if it weren't for:\n\nThe dialogue: there were a few lines that worked extremely well (Lucy's first conversation with Birdmann for example, which was a gleam of brilliance) and there were some other good moments, but few worked well enough to help the viewer understand what's happening (if anything at all).\n\nThe acting: Except for Clara and perhaps Sophie, the rest of the female acting was cut down to a plain showoff of numb young flesh, which might have been intended as creepy and conceptual, but works more like a great bore.\n\nThe lack of soundtrack: a few tones here and there, to wake the audience? The closeup frames: as badly composed, plain and boring as a closeup can get. And more, and more. Since writing about it is almost as tiresome as watching, here are the few things I actually liked:\n\n1.Said Birdmann conversation and a certain strong-spirited muesli.\n\n2. Clara talking to the bearded man. 3. First and third nights as a sleeping beauty.\n\n4. Coin-flipping dialogue\n\n5.First frame.\n\n6. Sophie talking with her hair unbound.\n\n7. Nipples and lipstick (please, note that I mention nipples again only because I like the number 7)"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "fascinating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "andrewtwilcock",
        "review_rating": "1",
        "review_title": "A dreary poorly directed film with so much potential",
        "review_detailed_main": "I have seen enough of these types of films. That was about thirty years ago. The direction is so amateurish it harks back to almost thirty years, and I don't get the feeling that is deliberate. I get the art, I get the mood, I get the message, but the packaging is so bland, so awful, it spoilt what could have been such a good film. The bland nature of this film comes from a complete lack of creativity on the part of the direction crew. Camera techniques that are more like a school drama class filming for the first time, lighting that is done over and over again. Say what you will about the subtle veneers in the storyline, but they just don't translate in an meaningful way. And what's with the same camera position on the old man recounting a really boring story he had once read. Please use some imagination. This is either a case of someone being lazy, or someone being so self indulgent that they forgot they have an audience."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "daniel-nagrecha",
        "review_rating": "2",
        "review_title": "90 minutes I could have wasted reenacting lion calls",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "RockPortReview",
        "review_rating": "8",
        "review_title": "Interesing to say the least!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Hitchcoc",
        "review_rating": "4",
        "review_title": "Anything for a Buck?!!",
        "review_detailed_main": "Is there anything to this? I really am fairly astute when it comes to all kinds of film. This left me cold. I was left so cold by the basic sadistic nature of this film. This girl needed some money. She needed to get out of her situation. i give you that. But what she does and the people that provide the opportunities are so bizarre that I just couldn't imagine it. I know she was truly tough and resilient, but what she puts up with would destroy anyone. She is defiant to a fault. This could be a reason, I suppose. There was a fair amount of money offered. But it wasn't enough for her, unless she felt so desperate that there was no other way. They never really tell us that. Then there are the sick relationships outside the position she accepts. I'm sure someone might explain to me that there is artistry at work here. I don't get it."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Vincentiu",
        "review_rating": "",
        "review_title": "Body without bones",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "slowcomb",
        "review_rating": "1",
        "review_title": "Worst movie ever rented!",
        "review_detailed_main": "Sleeping Beauty 2011 is a disgrace to the name and Mr.Disney would roll over in his grave in revolt!! I've never seen such a disjointed pile of awful in my life. There is no plot, there is no point. I kept asking myself, what is the point? This movie was a waste of money. It is stated NR for no rating- it should be X or at least R. It is that bad. What has this got to do with sleeping beauty? It does not follow the expected premise at all. Where is the prince? A different name should have been chosen for this movie and it's rating should reflect that it is absolutely not for children!I rented this from a Family Video. This is definitely NOT a family movie. It is by far the worst movie I have ever rented."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "daleth-74309",
        "review_rating": "5",
        "review_title": "struggled to hard to have depth and artistry",
        "review_detailed_main": "To be honest one of the only good things about this movie was the nude scenes of Emily Browning. The only message I really got was that she would do anything for money. Was this a typical feminist movie? Or not feminist at all or a little of both. There was the typical all men are useless or evil. On the other hand it was not feminist , in that it displayed the darkest side of women, when there nesting instinct goes to far, where as men generally lust for power, sex and status, women generally lust for security, money and material things. It just seemed to be a long winded repetition of this theme, overdone with meaningless obscurity and lucid dreaminess. Is she a victim or her own worst enemy and why does she also treat everyone else in her life with such disdain and irresponsibility. I had a hard time feeling sorry for her as she seemed to be to passive. Which seems typical of female characters, in modern films, the have no agency or awareness its the world thats wrong and everyone else in it and they have no will to change. This does seem to be the bizarre product of 3rd wave feminism."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "alexferdman-98602",
        "review_rating": "3",
        "review_title": "Propaganda for kids.",
        "review_detailed_main": "Sure its done professionally. Sure it has plot. Sure some skin for good measure. Sure its all fake. It starts realistically. But as flick unravel I didn't have any sympathy for main chick and her choices. Then came main kick when she supposedly unconscious with old farts who not suppose to penetrate her. Well, we call them old farts for a reason but who knows what's going on in privacy. Resume--avoid."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "martoni64",
        "review_rating": "4",
        "review_title": "Surreal and forgettable",
        "review_detailed_main": "I have very mixed feelings about this film. While I can see the arty/surreal/dreamscape aspect of it - it never ignites any interest. One reviewer said about the main character that \"In fact, there's hardly any evidence that she processes strong emotions at all. She just goes about her business. Things happen to her, and she's too reticent to shrug them off.\"\n\nThis gives it a kind of dreamlike quality. It's as if nothing ever hurts her. People around her can - it seems - do anything and she barely registers the act. Lucy - the main character - is a student without money apparently doing anything to stay alive including deadly boring office work, and equally non-exciting cafe duties and doesn't stop at prostitution either. All with a totally nihilistic attitude.\n\nAnd this is my main problem, there is basically no reaction to anything that happens. The main character just floats through existence of life and the movie without any emotional reaction at all. It all feel surreal and dreamlike without me ever taking any interest in the main character.\n\nSome of you might be wondering about the amount of nudity in the film, it seems to have gained some reputation in that department. There is a lot of it in the second half of the film, but it never becomes in the least anything even remotely close to sexuality or pornography - these scenes are equally dreamlike and surreal. But for those taking exception, you have been informed ..."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "lhunt-9",
        "review_rating": "10",
        "review_title": "Unimaginably difficult role",
        "review_detailed_main": "My esteem for Emily Browning soared after seeing this movie. It is an extremely difficult role, which she played consummately. Without her grasp of the demands of the role, the movie would certainly have failed. Due to Ms. Browning's talent - capturing the essence of a passively disengaged young woman, the film succeeds. As you may be aware, the plot of the movie is to follow the story of a young female who is willing to step outside social norms to make her way through the world. She hits upon a higher paying \"job\" in which she is clearly exploited, but which nonetheless accomplishes some of her goals, leaving us to wonder whose ends were served, and in what way. The topic is not likely to be sit well in anyone's comfort zone, but a dark and probably important corner of human nature is explored here and portrayed masterfully."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "brentbovell",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "This would have to be up there with the worst movies I have ever watched. If only I could get that time back."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "grayxenon",
        "review_rating": "",
        "review_title": "Sleeping indeed..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "drmatto-1",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "Someone when to film school and said \"I wanna be like David Lynch\". They tried. They failed. So badly.\n\nTerrible plot. Terrible script. Terrible actors. Terrible pacing. Absolute rubbish. The sets are terrible. Sound design terrible. Editing terrible.\n\nThe main character is unattractive and unlikable. The actress is so so so bad. No wonder her career is where it is."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "apunchhtc",
        "review_rating": "4",
        "review_title": "Poor writing, Poor direction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "jasonpauljones-64690",
        "review_rating": "4",
        "review_title": "She's cute but...",
        "review_detailed_main": "The sort of film that doesn't allow Emily Browning to showcase her acting skills, rather she spends much of the time undressing and sleeping. The subject matter, though, is interesting but the characters are very superficial, partly due to the lack of actual words spoken and we don't develop any opinions for any of them in any which way."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "chrislepen",
        "review_rating": "1",
        "review_title": "Try Secret Diary of a Call Girl instead",
        "review_detailed_main": "1 hour and 36 minutes that I will never get back Although the film maintains a certain mystery atmosphere, has no plot whatsoever! It's like someone took \"The Secret Diary of a Call Girl\" class-ed it up, in a world where men do not crave sex, but they go prostitute hunting for their own sick fantasies. This film cannot connect to the viewer, unless you're a high class payed mistress that will not have sex with her clients or you're a non sexual misogynistic man that has deeper issues regarding the female gender. 10 lines for this film? This is really difficult, have you seen it? Awful film, really awful. 1 hour and 36 minutes that I will never get back Although the film maintains a certain mystery atmosphere, has no plot whatsoever! It's like someone took \"The Secret Diary of a Call Girl\" class-ed it up, in a world where men do not crave sex, but they go prostitute hunting for their own sick fantasies. This film cannot connect to the viewer, unless you're a high class payed mistress that will not have sex with her clients or you're a non sexual misogynistic man that has deeper issues regarding the female gender. 10 lines for this film? This is really difficult, have you seen it? Awful film, really awful."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "khrisolivier",
        "review_rating": "9",
        "review_title": "Underrated and gripping. This film is not for the general public's viewing.",
        "review_detailed_main": "The film's sequences have gotten a standing ovation from me: it was nicely done. I won't be surprised as to why the general public doesn't understand it because of its originality. Movie watchers these days are used to patterns but the Julia Leigh have definitely has broken all of the barriers. 9/10! from me."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "dragokin",
        "review_rating": "2",
        "review_title": "narrative fiction",
        "review_detailed_main": "Someone's recently told me the how value of narrative fiction isn't limited to the plot line. This is usually used as an excuse by the authors to do whatever they want with their movie and claim they used alternative means of storytelling, be it random images or complete absence of plot.\n\nSleeping Beauty didn't go that far since it has a plot, although it becomes blurred as we progress through the movie. At the same time, it used endless shots with music to underline the supposed importance of the scene in order to create tension.\n\nI see that a lot of people mention Stanley Kubrick's influence which i found misleading. In my opinion, the main influence comes from David Lynch's direction. Sleeping Beauty shares his use of long shots occasionally filled with weird images. Overall, the scriptwriter either didn't have the enough ideas to write or simply left it unfinished in order to get closer to some kind of ideal narrative fiction."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "anthonydavis26",
        "review_rating": "",
        "review_title": "Wakeful in an eternity of emptiness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "jtw9471",
        "review_rating": "5",
        "review_title": "Don't have sex with men for money. There... I ruin film message for you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "duerden60",
        "review_rating": "4",
        "review_title": "Not very good at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "mwriter-2",
        "review_rating": "5",
        "review_title": "** Great premise and potential yet fell short **",
        "review_detailed_main": "This is a movie that could have been great. I will not repeat the same critiques of others, I appreciate the art and artist for a great gamble, but at bottom I feel it failed to develop the story, give depth to the characters and could not break past the merely unsettling to show us a truly erotic, horror movie. I never felt depth and I did not get enough visually to feel I understood the meaning or message beyond what I put there. In all I feel I was left with too many unanswered questions, thus the film felt underdeveloped As a high point, I felt it had some of the better treatment of nudity I have seen, just enough at seemingly the right moments, but not a substitute for story. It was even shy with it at times, so the nudity was not overtly erotic, indeed it was almost clinical, not a distraction but an actual element to move us forward. I was impressed.\n\nAll that said, I think it is worth watching for some intriguing visuals, a thought provoking story premise and insight into how horror can have sexuality without \"slasher\" violence as seems the default and actually touch you. I wanted the unsettling, the suspense and the tragedy that seems to have eluded this film. Thus, I think it was a great premise, and it should have been better."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Slow paced dull art",
        "review_detailed_main": "This film is described as an Australian erotic fairytale. It is apparently a sort of reimagining of the classic tale.\n\nFor the film, it is most definitely for a certain audience as it is quite slow moving, features a lot of silence between scenes and very little dialogue. Many scenes end in a fade to black.\n\nEmily Browning stars as Lucy, the Sleeping Beauty and doesn't exactly show much emotion or range. None of the characters are very expressive.\n\nAt first it was somewhat confusing in following what was occurring but as the film progressed, we get a sense as to what it's about.\n\nLucy is a struggling university student where she takes several minor part time jobs to pay her rent. The main plot kicks in when she gets a high paying job at a rich establishment where she's paid to sleep nude being sedated while older rich customers are to keep her company.\n\nFeaturing quite a lot of skin where our lead undresses and many close up scenes showing her body.\n\nIn the end, this film doesn't offer much of any action of any real twist or turn. It is a character study which many casual mainstream audiences would find it rather boring and bland."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "nancyaliedel",
        "review_rating": "8",
        "review_title": "A Fascinating Look at a Disturbed Life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "brothermarx",
        "review_rating": "9",
        "review_title": "A week in a university student's life",
        "review_detailed_main": "The movie is following Lucy (Emily Browning) a young beautiful female student in Sydney who struggles to finance her studies until she finds a new mysterious job. Lucy is attending classes at university; volunteering as a research guinea pig with a young male scientist; working extra in a pub with a friendly male boss; going out to a bar with a friend who gives her cocaine before she leaves to f.ck one of the older bar visitors; sharing house with people who constantly complain; resting in her own room; working extra as a photocopier assistant in a big office with an ever controlling female boss; talking to her alcoholic mother on the telephone; visiting her honest, depressed and alcoholic friend who she serves cereal with vodka. However, then she finds a new job as a half-naked waitress, where her vagina will never be penetrated according to her female boss, who encourages her to take drugs as they are \"aspirin for the soul\". In this job she is soon promoted to sleep naked in a big bed, after being put to sleep by sleeping pills, without knowing what is happening to her during the sleep. Will she ever find out?\n\n9/10"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "addi_du",
        "review_rating": "9",
        "review_title": "Flawless and haunting collage of ones story",
        "review_detailed_main": "Looking at the reviews, it seemed like The Sleeping Beauty was another try that did not quite work out, I was excited about seeing Emily Browning in this film, I admire her much and her past work which is beyond some actors imaginations. One can clearly see she has grown up and started taking responsibility, this movie really shows a new side of the Australian actress.\n\nThis movie is an endless story about young girl Lucy and her path through struggle, or just the ordinary day. She is clearly a troubled girl as you can see the director clearly have showed up. No background story needed, this is not a story about Lucy herself, more about ones collage. She wakes up, takes classes, work 3 different jobs and then ends her day as miserable as the previous. Lucy don't mind, being gentle and average she does not care less about a future. Thus she lives for today. When the new job offer strikes her, she is more than pleased, but she never really know what goes on in the room while sleeping. One can never really figure out the curiosity of Lucy as she never reveals herself. If you want a story that is settled in front of you, look away. In the end, I was as charmed as I was in the beginning. Emily is flawless and haunting in this role, it's provocative, and disturbing. I myself see this movie not only as a big screen fascination but also as a collection of art. The director is very careful with not putting too much details, you're there to figure out them yourself.\n\nMany questions left a mark on me after wards, I'm not in need to figure them out, it's perfection for me, to not always know everything. This is not a movie for everyone. I fancy underground movies like this that does not top everyones expectations because of the genuine style. I would definitely tell all my beloved artsy friends about this extraordinary movie. This is sure a movie delicate by ones eye."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "Tweetienator",
        "review_rating": "8",
        "review_title": "Real Gem or Real Crap - It Depends",
        "review_detailed_main": "Sleeping Beauty is one of those movies (or records, books etc.) that split most of the audience into two groups - you like it a lot or you don't like it at all. Imo, if the reception of a work of art is very controversy that just shows that the respective piece did something right and hit a nerve - to the good or to the bad.\n\nSleeping Beauty gives us a glimpse (no matter if its accurate or not) into a world of riches and the price of and for beauty and of the diversity of sexual \"interestes\". Moralistic bores won't and cannot appreciate such a movie, because its about sexuality and not about \"romantic love\", but in times where many students (at least in Europe and even on a global scale) sell their bodies (many without bad conscience) for a lot of money to rich and not so rich men and women (escort services and such things) this kind of \"high-profile\" prostitution is reality. Work for some bucks per hour for Walmart or have some fun and earn a lot of money such women (and men) argue. In a very capitalistic and materialistic world this is for some people simply a matter of a cost-benefit calculation.\n\nVery beautiful almost poetic pictures, a fine cast and an interesting story make this one an fine dish for the connoisseur of the unusual. In the 60s and 70s Romy Schneider would have played in such a movie with a French director of course.\n\nA movie with a very European tone and a real gem between all those hollywoodized and stereotyped movies that spill our screens usually."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "vmoreno2007",
        "review_rating": "10",
        "review_title": "A compelling movie about extremes of humanity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "dgrozier",
        "review_rating": "10",
        "review_title": "Dont miss it,,,GORGEOUSSS",
        "review_detailed_main": "Sexy ,beautiful, poingnant ,meditative ,gripping ,touchihg ,death. The actress is stunning and the perfect doll. Watched it twice over a couole of years. Very enjoyable. The gormless nerds who can't go along for rhe ride ,,I dare say have lead a boring life. Highly recommended. Stand out film. 10 DG's"
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "noiamwiki",
        "review_rating": "8",
        "review_title": "Life as Death as Sex as Sleep",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "sarahilayda1",
        "review_rating": "8",
        "review_title": "It's An Unusual Movie",
        "review_detailed_main": "When I read the reviews, I thought, I don't need to watch this movie. The reviews of this movie are just negative. But this movie is just spectacular. I love Emily Browning, she is amazing, she is beautiful and talented. And her acting is just another level in this movie. I'm gonna admit that I love depressing movies. And this movie is surely depressing. But the director just caught that depression and turned into something beautiful. I loved the scenes and the colors, I think the shooting places are just beautiful. And I especially loved the concept. Some of you may say that this movie contains so much nudity and sexuality and yes, some of you are right. But the nudity of this movie is not dirty. It's pure and innocent. It comes from the suffers and depression of a girl, and it doesn't disturbs you. I surely enjoyed this movie, and I suggested it to many of my friends. It's not a movie for everybody, it has a small fan-base. But it's one of my favorites and I think it deserves a solid 8."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "yowzah-699-306527",
        "review_rating": "",
        "review_title": "A slowly unfolding story with subtle undertones of danger",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "louisstucki",
        "review_rating": "9",
        "review_title": "Excellent movie",
        "review_detailed_main": "This is an excellent but also mysterious movie. We never get to know the reason why Lucy (Emily Browning) offers herself naked to other men, it is even difficult to say if she's a happy person because she hardly shows any emotions. This reminded me about the movie \"Jeune et Jolie\" with Marine Vacth, a student working as a prostitute who shows as much emotions as Lucy which means almost none. However, Lucy is still a person you can sympathize with because she's very friendly to all peoples and says \"Thank you\" throughout the movie so much as almost no other movie character does (about nine times or more). I would recommend this movie to anybody because it makes you think about what lies beneath Lucy's reserved behavior. I'm glad the script writer didn't show her background completely, so the audience, as Emily Browning (an actress with interesting views by the way) said herself, has to do some thinking."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "nerome87",
        "review_rating": "",
        "review_title": "movie's massage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "joseluisuman",
        "review_rating": "10",
        "review_title": "Full frontal nudity but no sex",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "elizabethmoonstar",
        "review_rating": "8",
        "review_title": "Obscure, slow, has something interesting, but you need to think for see it. Difficult is the best word.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "roland-scialom",
        "review_rating": "8",
        "review_title": "A depressing stoy",
        "review_detailed_main": "All characters on the screen are decadent and has no existential consistency. I understand by \"existential consistency\": having a life project, and act pro-actively toward the realization of this project and so on. Lucy is a young woman who divides her activities between a strange college course, and part time activities in a bar as a waitress and as xerox operator in an office. She lives in a house in which she has a poor relationship with the other tenants who, by the way, are obnoxious and end up expelling her for failure to pay rent. She frequents nightclubs where she arranges sexual partners. The film is not clear about her relationship with these partners: is it prostitution? While she seeks for a way to increase her earnings, she starts to work for a pimp, Clara, who serves a clientèle of senior citizens, rich, sophisticated and degenerate. The role of Lucy in this prostitution scheme is to be offered naked and sedated to old impotent satyrs that use her to implement their pornographic fantasies, which, by the way do not allow penetration. The old men who hire the services of Clara are absolutely depressing. Clara is very competent professionally in serving her clientèle, and shows evidence of an exquisite taste and intelligence, and lives in style. This competence is also depressing. The alcoholic friend Lucy is a poor, devastated and self-destructive guy, with no personality. A depressing individual. The story end up with Lucy having a nerve crisis after awakening close to the corpse of one of Clara customers, who decided to commit suicide close to the sleeping beauty. Every move of Lucy is depressing. The reason why Clara awakes Lucy to make her get aware of what happened during her sleep, is not clear. Finally, a depressing story. If that was the goal of Julia Leigh, so she succeeded."
    },
    {
        "movie_id": "tt1588398",
        "movie_name": "Sleeping Beauty",
        "movie_rating": "5.3",
        "review_username": "donald-dweebo",
        "review_rating": "",
        "review_title": "Pretentious, but provocative",
        "review_detailed_main": ""
    }
]