[
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "grintemcstinger",
        "review_rating": "5",
        "review_title": "So and so",
        "review_detailed_main": "Sinister 2 isn't as bad as some make it out to be. It's not a good movie either. Like most sequels, it struggles with the novelty gone and never manages to succeed in new ways or areas. It is a mediocre and forgettable film, just as the name of it's main character.\n\nI very much enjoyed the first movie. While it's not without its faults - I actually don't think it was that scary with too heavy reliance and textbook-use of \"creepy\" sounds and the children were too cliché for my taste; it was a very absorbing movie, well directed with excellent music, a good sense for mystery, mood, pace, a solid twist and awesome ending. It cleverly managed to outbalance it's shortcomings.\n\nSinister 2 starts off promising enough - at first it looks and feels just as it is supposed to, the snuff-flicks are still here with their grainy look and new, obscure kills complimented by creepy music. We find out what has happened after the first movie and continue the investigations surrounding the murder cases involving mysterious events, now with a new family (with twins - which could've provided an interesting twist to the story) and more involvement of the deputy from the prequel which at this point pretty much has inherited the knowledge of the previous main character. Everything you could possibly want in a sequel to Sinister is here, but sadly it is meaningless as they never manage to do something as interesting or memorable with it.\n\nThe death-flicks are useless this time as they don't provide anything to resolve the puzzle or any kind of new information. Even worse: the pace of them is pretty much straight to the point giving them a very rushed, uninspired and uninvolved feeling - not enough build-up and no intensity. As opposed to some in the first movie, none of them made me wonder or left me amazed how they were filmed. Instead some of them involve CGI rats and crocodiles - don't even ask. Even the characters argue to watch them all through in one sitting almost as if just to be done with.\n\nThe movie also suffers from too much exposition provided by the ghost children. The family, the deputy and Bughuul I found to be decent, but also problematic. While the deputy continues to be the same, likable character, you'll never fear for him because he seems to be too safe from all of it. The character of the mother is another one we should fear for, but oddly enough she is almost entirely absent in any of the horror events; her struggle is only on the family-issue side which doesn't quite sit right with this kind of movie and is more or less a subplot which lacks emotional depth, partially due to the father being so over the top. There is just overall little sense of danger in this movie which is its biggest fault.\n\nTo it's credit it does try to provide new things while being true to the first movie. It has it's moments where it shows potential and ideas, but never quite manages to expand on it in suspenseful and creative ways. It does however bother to explain some things surrounding the history and what if's, just about in the right amount without ruining too much, which is always nice. It also has its fair share of plot holes and faulty logic, just like the previous one did (some are even still the same), but I found it to be forgivable as it's not something I should be too concerned about with a movie involving supernatural events.\n\nIt's not exactly trash. I wasn't really bored watching it, but it also didn't provide enough suspense either, which is something it definitely should have. With a third Sinister movie seemingly sure to be made it'll be interesting to see where he series is being headed and if it'll reach cult status as any other popular horror franchise. The first one has potential to become a classic, this one is a much weaker entry which makes me wonder how they will handle the next one. Sinister 2 had potential and could have used more polish in almost every aspect. Hopefully the makers will learn from it and allow them more time to come up with good material."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "joaovieiramonteirod",
        "review_rating": "5",
        "review_title": "It could have been great.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "lukem-52760",
        "review_rating": "6",
        "review_title": "James Ransone is Very Good but the film isn't scary at all & it felt more like a Children of the Corn flick.",
        "review_detailed_main": "The first SINISTER was a fairly scary & very atmospheric Horror film but this sequel definitely wasn't scary in the slightest because it felt like a Children of the Corn flick & a family drama mixed together.\n\nJames Ransone is very good again as the timid & scared Duputy from the first film & James is a very interesting actor & is a very good actor & i liked him more than Ethan Hawke in the first film. James was excellent in the brilliant \"IT: Chapter 2\" & is genuinely a good actor who i like to see. Ransone definitely is the best thing about this sequel. His Deputy is a funny character with a good heart & is now a private investigator working on the case of the Evil Supernatural Deaths after the horrific murders of the Oswalds family.\n\nThe Deputy meets a scared mother with her two weird sons that are on the run & hiding out in a big old farm house next to an abandoned church that was the site for a families murder. The story is fine really & the cast is decent with the super sexy Shannyn Sossamon as the boys weary mum with her own problems going with her abusive ex-husband & now Supernatural goings on at her farm house. The weird skinny young boys are the target of a bunch of evil ghost kids that wanna persuade them to kill their family but one boy is good & one is bad.\n\nThis does feel very routine for a Supernatural flick & nothing stands out as scary, unique or even creepy at all. In fact SINISTER 2 felt like a Goosebumps episode or something similar. The fact you see the ghostly kids constantly & the boys sit talking to them regularly that there is zero threat at all & no tension or fear for the audience but it's still a fun & entertaining supernatural film. Of course Sinister 2 was totally inspired by Stephen Kings Children of the Corn & that's fine. I did like the rural setting with the big old farm house & the corn fields.\n\nThe film is watchable & fun but that's completely down to James Ransone keeping it all interesting & fun because he's a good actor & Deputy is a good character full of awkward charm.\n\nThe first Sinister was definitely more creepy & atmospheric but i will say that Sinister 2 is much more fun & i love that Duputy character."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "lnvicta",
        "review_rating": "3",
        "review_title": "Scare-free cash grab that killed the possibility of a great franchise.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dar0417",
        "review_rating": "6",
        "review_title": "Solid but didn't live up",
        "review_detailed_main": "Not as good as the original but still an okay horror movie. Maybe if it didn't involve the kids so much the scenes could have been more graphic."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "lukenutt5",
        "review_rating": "1",
        "review_title": "I wanted to like it...",
        "review_detailed_main": "Being a huge fan of the first Sinister, I was beyond excited for this movie. After seeing the trailer, it looked like they were going to go over the top with this one and make it intense. I really wanted that to happen. I really wanted this to be even better than the first.\n\nI didn't get what I wanted.\n\nThis is my first review, so I'll keep it short. Everything that I was hoping this film would have, wasn't there. Not really a spoiler, but I felt like it tried to be more of a family drama movie with some supernatural stuff going on in the background. There were non-genuine jump-scares and the acting was less than average. Even with the glaringly bad plot, I sat there trying to look at some positives. The positives are that some scares got me. I'm jumpy even when I know jump-scares are coming, so they got me on that. But when the movie ended, I couldn't help but reflect on how bad the overall story was and how stupid some of the scares were. I won't spoil any of them, but let's just say that you'll probably be wondering how the scares were \"genuine\" when you really put it into perspective.\n\nI give this movie a 5/10. Mostly because I just really, really wanted to like it. I kept searching for any redeeming qualities throughout the movie and they are slim to none. I recommend watching if you're bored one night and you've seen just about all the horror movies out there. It'll pass the time, but it's just a plain jump-scare fest with a nonsensical story. Don't go in having high expectations like I did.\n\nEDIT: I gave this movie a 5/10 because I was in denial. This movie not good. 1/10."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Sweet_and_Lowdown77",
        "review_rating": "",
        "review_title": "A poor follow up to original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "brendanrmorrow",
        "review_rating": "7",
        "review_title": "Much better than I expected",
        "review_detailed_main": "Sinister is one of my favorite horror films from the past few years, so when the reviews for this sequel started coming out, I was really disappointed. I mean, it has a 13% on Rotten Tomatoes at the time that I'm writing this. But after going into the movie with an open mind, I actually thought it was surprisingly solid, a whole lot better than the reviews would have you believe.\n\nWhen Sinister 2 was originally announced, I was pretty skeptical. The original focused so heavily on a mystery that was solved by the end, so how do you make another one when we already know what's going on? C. Robert Cargill and Scott Derrickson pull that off by offering something totally different that still feels familiar. We follow the madness from a child's perspective this time, and that allows us to explore the rules of this universe in a really interesting way. In the first one we're begging for the Oswalt family to leave the house, but this time, we're begging for the family to stay in it. The formula is flipped around a bit, and while still being structured around a collection of film reels, Sinister 2 feels different enough to justify its existence.\n\nIt's also quite creepy just as the original movie was, although the atmosphere isn't as bleak and relentless this time. A whole lot of scenes take place during the day and just consist of a lot of dialogue, and it was definitely missing the Scott Derrickson touch in some places. Sinister 2 also relies on jump scares a bit more than its predecessor did, and in fact nearly every single scare in the movie is accompanied by a loud noise. They all worked on me, so I didn't mind too much, but I wish I could say the scares in this one were as inventive as they were the last time.\n\nBut overall, Sinister 2 does a really solid job of building on the first one. The plot is far more interesting than I expected, James Ransone and Shannyn Sossamon are both great, and the film reels themselves are all pretty fantastic (except for one that goes a bit over the top and just looks silly, but I won't spoil it). Best of all, while Mr. Boogie gets more screen time here, I never felt the added exposure made him any less terrifying, and luckily the franchise hasn't gone the Halloween route of explaining too much.\n\nNo, it's not as good as the original, but if you enjoyed that movie as much as I did, you should have a good time with Sinister 2."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "eddie_baggins",
        "review_rating": "3",
        "review_title": "Still sinister but totally unmemorable",
        "review_detailed_main": "While Sinister 2 is still quite well\u0085 sinister, it certainly lacks any of the originality and constant vibe of fear that made its predecessor such a memorable and competent horror film that found both success at the box office and on home release.\n\nDirected by soon to be Dr. Strange deliverer Scott Derrickson, Sinister was a competently made horror that featured scarily good sound designs, an assured lead turn from Ethan Hawke and a somewhat unique premise that introduced us all to one of horror's most eerie creations of recent times in the form of the child hungry Bughuul.\n\nWhere the first film's use of home footage horrors and sudden appearances of Bughuul and his tribe were used to horrific effect, new director Ciarán Foy struggles to utilise the murderous footage to chilling affects here (even though a rat centric set piece is a dastardly delight) and an overuse of Bughuul undoes many of the films wannabe scares. It also doesn't help that an uninteresting story that's been co-created by Derrickson fails to engage like Ethan Hawke's struggling writer plot line of the first film.\n\nTrying to keep things tied together by the return of James Ransone's one time sheriff's deputy So & So (seriously we never get to hear his name) and his quest to stop Bughuul's evil dominance, the plot that also includes Shannyn (yes I'm still acting) Sossamon's mother of two increasingly doomed boys just fails to fire and with a mere handful at best of genuine frightening or terrifying moments, Sinister 2 fails to recreate the ominous mood of the first film and where the first film culminated in a shocking finale, Sinister 2 try's but fails to shock us with a fiery and scythe laden crescendo.\n\nThe first Sinister offered up so much opportunity for a new franchise to take hold and while Bughuul still remains and interesting and scary creation, Sinister 2 seems to mark an early drop off in form that will likely see the Sinister franchise relegated to bargain bins before long, which is a sad proposition for a storyline that if done right, could be all types of horror filled greatness.\n\n1 ½ late night basement movie screenings out of 5"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "7",
        "review_title": "Pleasantly surprised",
        "review_detailed_main": "Ex-Deputy(Ransone, still no name, and charmingly awkward as ever) continues the investigation. He's found another house. Rural, middle of nowhere, instead of a small town one. Burning them seems to work - it's tied to the locations. But there's a problem. There's someone living there. Now, he has to keep them from leaving, without wanting to tell them why.\n\nSequels to horror stories fail. They just do. We know too much now. You can't pretend we don't. Retread? Too different, it won't be the same. How could you possibly follow up? By shifting the perspective, setting and approach to the material by just the right amount, maintaining yet expanding the lore and cleverly retooling key elements. The children are creepier and better used, the family is more prominent and interesting, a writer's studying is replaced by a protective former cop whose fondness for, and bonding with, his charges grow and develop. And the films are shown for a different reason. Bughuul appears in different ways, somewhat more overt, hardly any of them compelling. That does bring up the negatives. Deaths go too far, ending up as torture porn, if at times genuinely scary rather than merely gross. The CGI is limited in use but never looks convincing.\n\nThis builds solid tension and suspense. The jumpscares are quite good, always surprising and not too frequent. Ideas for what grips us are creative, at times excessively so. This moves nicely along, giving enough time to each major plot point. In addition to the welcome increase in dialog and lines in general, far more happens in this. While this improves on the first in few ways, it takes enough risks and gives us the right amount of the unexpected, that which we didn't get before.\n\nThere is a lot of gruesome, disturbing content, violence and some graphic gore and strong language in this. I recommend this to any fan of the genre. 7/10"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Demetrius_Stork",
        "review_rating": "3",
        "review_title": "Insulting to the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "vengeance20",
        "review_rating": "9",
        "review_title": "As good as the first Sinister!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Robert_duder",
        "review_rating": "7",
        "review_title": "Adding to the lore while giving the series a different feel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "claudio_carvalho",
        "review_rating": "5",
        "review_title": "Deceptive Conclusion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "fairyrainbow",
        "review_rating": "1",
        "review_title": "Awkward movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "quincytheodore",
        "review_rating": "6",
        "review_title": "Lighter on the terror, thought the new cast sympathetically keeps the tension running.",
        "review_detailed_main": "Sinister had a good premise and twist that separated it from ordinary horror flick. This also means it was relying on the mystery aspect that was revealed at the end. The sequel loses the luxury of having the paranormal riddle. Instead of completely rehearsing the plot it utilizes different perspective and personalities, then combines it with dreadful bits to make a terrifying spectacle.\n\nResuming the events from previous movie, now Ex-Deputy (James Ransone) is trying to sever the haunting circle by destroying the houses it affected. Unfortunately, there's a new family of mother (Shannyn Sossamon) and two sons who occupies one particular house. They are in danger of repeating the same terrible fate as previous victims, especially the children.\n\nJames Ransone is a much different lead than Ethan Hawke was, he's more timid and less intense, but he looks very decent which should endear audience to his valiant effort. There's good chemistry with Shannyn Sossamon who is a great cast for the mother role, just like in TV series Wayward Pines. The two are not the typical family or paranormal whiz of recent horror movies, and this gives the characters a sense of urgency.\n\nThere are bits of usual investigation involved, but the main draw is the perverted twist on the children and the eerie clips they made. These short clips are like snuff movies from children's point of view and presented with old cryptic filter. It may seem a bit similar to that of first film, but they are dauntingly effective and much more diverse.\n\nThe children themselves don't look menacing and often seem like superficial apparitions. Unlike the original movie which displayed them sparsely, their appearance here is overexposed. It may have worked if viewers were introduced more to the children or the child abuse issue was treated with more polished, although unfortunately there's not much depth on the youngling characters.\n\nFor most parts the scare looks average, coupling a few jump scares and taking hints from creepypastas. It loses the steam towards latter end since it becomes a tad predictable and the ghostly kids are hardly frightening, however the characters are adequately presentable which should keep audience invested throughout the unworldly predicament."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "adamonIMDb",
        "review_rating": "3",
        "review_title": "Boring and unimaginative, a weak sequel",
        "review_detailed_main": "I enjoyed the first 'Sinister' movie, so naturally I was looking forward to the sequel. It soon became clear that 'Sinister 2' was going to adopt the same scare techniques as the original film, namely ghost jump scares and disturbing scenes of murder. Only this time, it was tame in comparison.\n\nThe storyline is poor, unimaginative and not particularly engaging. The 'scares' are cheap, predictable and, well, not very scary. I also thought the chemistry between the characters that was so prominent in the original film was lacking. I don't know why, but they seemed to place far less emphasis on character development in 'Sinister 2', which didn't help at all.\n\nA very disappointing sequel to the original 'Sinister', which was a very creepy and strong horror movie."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "drownsoda90",
        "review_rating": "7",
        "review_title": "Enjoyable and atmospheric in spite of an innocuous and confused plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "blee0744",
        "review_rating": "2",
        "review_title": "5.3 Rating? Really?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "roguecritic42",
        "review_rating": "7",
        "review_title": "If you loved the First You Have To See the Second!",
        "review_detailed_main": "I can't believe the ignorance and arrogance of critics. So many bad things said about this movie, so I almost didn't see it. NEVER Listen to CRITICS!\n\nOK, First, the critics said this movie lacked the scares the original content of the first. Wrong. Purely Wrong!\n\nLet me say, yes, this movie didn't star Ethan Hawke. But this movie did just fine giving you same horrific scares, gore, and horror as the first. Great content, great story line. Hot female lead. Attractive male lead. Good chemistry between them. Good story line. Plenty of surprises. If you are seasoned horror movie lover, you will still get your fill of jump out of your seat moments. If you are a sadistic torture porn lover, you'll still get your fill of that too. New story, that accurately and properly continues from the first. Good new scares, good new torture and gore scenes, great movie over all.\n\nDon't listen to the haters. If you loved the first, go see it. I can't believe the ignorance and arrogance of critics who see horror movies these days. These guys are not even qualified to comment on these movies. This IS NOT Mission Impossible 10 or Avengers 5, it's Sinister 2, and I LOVED IT!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Unwanted sequel is a lesser film in every respect",
        "review_detailed_main": "SINISTER 2 is an unwanted sequel that carries on the below-par outcome of the first film. As I recall it, the first half of the original SINISTER was an exemplary little thriller, about a guy uncovering the antics of a historical serial killer and the creepy home movies he left behind. Then it all went supernatural and turned into a dumb INSIDIOUS clone.\n\nUnfortunately for the viewer, SINISTER 2 carries on in this same supernatural category, although for some odd reason the filmmakers seem to be more inspired by CHILDREN OF THE CORN here than the original movie. It's unfortunate that nobody in Hollywood tries to be truly creative these days instead of copying what has come previously.\n\nAnyway, this is a typical ghostly B-flick little different from a hundred others. The film is saddled with annoying kid characters for the leads, while the adults fail to act or do much. The sense of dread from the first half of SINISTER, with the creepy music and home movies, is gone here. There are still home movies but they lack the novelty shock value and have been too planned out. SINISTER 2 is a dud, and let's hope they don't bother with a third."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "droidX",
        "review_rating": "10",
        "review_title": "As good as the first, if not better.",
        "review_detailed_main": "I don't write many reviews on IMDb but I feel this movie deserves one. Sinister is easily my favorite horror movie to come out in the last 5 years so I was pretty sure I wouldn't like the sequel more than the first film. Even 20 minutes into the movie I said to myself \"Nope, this isn't gonna be better than the first\" but as time passed and as the movie kept going I realized this is one of the best sequels of a horror movie ever. Sinister 2 is as good as Sinister or better, that's up to you. Me? I think Sinister 2 is just a bit better. I just loved every thing about this movie. I am almost certain that if Deputy So & So wasn't in this, I wouldn't have enjoyed it as much as I did. Shoutout to Deputy & So So, he did a great job and I hope 7 years from now he reads what I typed here. Courtney, Dyan, Zach, and all of the ghost kids were great and I really enjoyed seeing more of them. I was so happy there would be a sequel to Sinister and it did not disappoint. Sinister 3? Idk. It will likely happen someday but if it doesn't happen I will be perfectly fine with that. The ending goes both ways. It could have a 3rd film but if it ends at 2 you won't feel ripped off. I hope that you will go see this movie if YOU want to see it and not let lame sites like rotten tomatoes ruin your chances of going to see a movie that you want to see. So what if bald guys in suits don't like the movie. They aren't you. Sinister 2 is definitely worth seeing. Amazing sequel that truly does match the quality of the first."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "StevePulaski",
        "review_rating": "6",
        "review_title": "An amalgamation of two films that need two very different setups and executions",
        "review_detailed_main": "Negative reviews, lukewarm box office predictions, and oversaturated markets be damned; Hollywood will not give up its latest \"get rich quick\" scheme of making supernatural films for little to no cost to all-but-guarantee an opening weekend haul of more than the production and marketing budget combined. \"Sinister 2\" already arrives during a year that has seen a third chapter of the \"Insidious\" franchise, the stylish \"It Follows,\" which came out of nowhere and shocked most of its audiences, and the underrated and unfairly bashed \"Gallows,\" which, like \"Sinister 2,\" is another Blumhouse cheapie.\n\nThe original \"Sinister\" was a low-key winner, and, even in 2012, was coming at a time when buzz about the next \"Paranormal Activity\" sequels were winding down and the genre was beginning to be an annoyance to the general public. \"Sinister,\" through assured directing, slowburn suspense, and a gripping, clearly invested performance by Ethan Hawke, was one of the genre's standouts, proving that the paranormal had some discernible life and potential longevity in it. With \"Sinister 2,\" a film that's existence was only inevitable, we're getting closer to seeing this franchise turn into nothing more than a dime-a-dozen series, but like a malfunctioned guillotine, life and sanctity is spared thanks to a few strong parts.\n\nWe follow Courtney Collins (Shannyn Sossamon), a mother who moves into a home with her two boys, Dylan and Zach (Robert Daniel Sloan and Dartanian Sloan) following the eve of a brutal custody battle with her abusive husband Clint (Lea Coco). What they don't know, however, is that the home they moved into, a quiet, rural shack in the middle of nowhere, is haunted by the Pagan deity Bughuul, who possesses children to take the lives of those they love while videotaping them before possessing their souls. Bughuul has taken numerous children, seen only as ghosts by similar-aged children, and Zach begins to fall prey to Bughuul's temptation. Courtney seeks out the care and protection of a former deputy (James Ransone, reprising his role), in order to get information about how to protect her and her children from the paranormal and, most importantly, her husband.\n\nThe biggest difficultly \"Sinister 2\" has to overcome is trying to be a horror film in the face of looming drama. With the domestic violence and brutal custody battle coming into play, \"Sinister 2\" is essentially juggling two stories that each need their own level of buildup and structure to be successful. Merging the two subplots creates an unattractive dichotomy that allows for both stories to be at a disservice, for the custody angle can never get the emotional or true substantial focus it deserves and the horror elements can never get the treatment nor the buildup they deserve. The film tries to double-back constantly and work with both stories but, through it all, writers C. Robert Cargill and Scott Derrickson (who penned the original \"Sinister\") can't seem to recognize the bridge between these two stories is far too long, wobbly, and unstable to sustain and effectively.\n\nThe standout actor in all this madness is James Ransone, who's naturalistic presence is sure to go unnoticed amidst all the chaos and the jump scares imbedded in the film's story. Ransone is incredibly believable, maintaining a composed yet believable character throughout the entire picture, and his occasional bouts of being watchable yet unnervingly eerie echoes that of Jake Gyllenhaal's ability to balance between both parts. Though my memory is admittedly fuzzy on the original \"Sinister,\" I can't remember Ransone commanding the screen in that film like he does here.\n\n\"Sinister 2\" may lack the thoughtfulness in its setup and the slowburn structure to its story that its predecessor so confidently helmed, however, it does work towards a rather fulfilling climax. The development of Zach's possession begins to unfold and suspense takes over any distraction the film tried to work with during the final act, though, by then, \"Sinister 2\" has spent a great deal of time developing other affairs that it's hard to find ourselves truly invested in this sudden shift in focus. This is a film that's directly in the middle of the road, booned by a terrific performance at its core in addition to a strong climax, but very much crippled by its desire to try and paint two stories at one time. It's far more commendable than a great deal of throwaway nonsense the genre sees on a regular basis, but it's also a farcry from stronger, more laudable efforts."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Reno-Rangan",
        "review_rating": "4",
        "review_title": "What's the most dangerous? The dark force or the evil father.",
        "review_detailed_main": "The first film was good, I enjoyed it, but not scary. So a sequel was expected and it failed to live up to the standards of the original. I would say, it was a decent horror film, with more story and drama than the creepy atmosphere. One character retained from the previous and the core theme remained, but tried a different method of narration. Something like 'Goodnight Mommy' with two brothers and mystery events surrounding them.\n\nIt definitely lacks what a horror film required the most, and predictable too. But the story wise, it was decent, because the actors did a good job. So it is an average film. I expected a better ending and it did not conclude at its best leaving me disappointing. The way it ended might have been the suitable for the story, but I wasn't impressed. Again, another sequel is most certain, so I think this tale is not over yet and chances are very high that the story would follow with the same cast.\n\nIt was not a bad flick, but not a follow-up you would have wanted. If you're looking for a genuine horror film, then you should skip it. There's nothing brilliance to appreciate at any level. Overall, I too felt it should have been better in some places. So my advise is if you forget its genre and try to enjoy that you're watching some movie that you don't know its category then surely would have a decent time with it.\n\n4/10"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "leonblackwood",
        "review_rating": "2",
        "review_title": "Takes too long to get going! 2/10",
        "review_detailed_main": "Review: Although I quite enjoyed the first movie, I found it hard to get into this one. The creepy twins, Zach (Dartanian Sloan) and Dylan (Robert Daniel Sloan), didn't seem that surprised with all of the extremely weird episodes that were happening in the house and the director made a right mess of the storyline, which didn't seem to flow properly. The dark theme and airy scenes, did bring some intensity to the movie but it takes ages to get going and I personally lost interest after a while. The ex-deputy (James Ransone), who is investigating the brutal murder of a famous author and his family, doesn't help the flow of the movie and while he is piecing together the evidence about the murders, the kids father is trying to get custody of his kids, from his ex-wife Courtney Collins (Shannyn Sossamon), who put in an average performance. By the time the whole story came together at the end, I really didn't know what the hell was going on but I was glad that it was over. The unheard of actors and poor script, made this feel like your everyday \"straight to DVD\" type of movie but the first movie was a big hit, so this sequel made a hefty profit at the box office, even though it didn't deserve to. After watching it twice, just in case I missed something really interesting, I was still disappointed, so it has to get the thumbs down from me. Disappointing!\n\nRound-Up: Although I haven't seen James Ransone, 36, before, he did star in 12 episodes of the Wire, Inside Man with Denzel Washington, The Next Three Days with Russell Crowe, The Son of No One, the first Sinister, Oldboy, Empire State and Broken City, and he has also made appearances in various TV series like Treme, Hawaii Five-0, Law & Order etc, but I personally don't remember his face in any of those movies, so he obviously didn't make a big impact. Anyway, the movie was directed by Ciaran Foy, who made Citadel in 2012. I can honestly say that I didn't like what he done with this sequel and the whole, \"kids seeing dead people\" theme, just didn't work for me.\n\nBudget: $10million Worldwide Gross: $53million\n\nI recommend this movie to people who are into their horror/mystery/thrillers starring James Ransone, Shannyn Sossamon, Robert Daniel Sloan, Dartanian Sloan, Lea Coco and John Beasley. 2/10"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "breakdownthatfilm-blogspot-com",
        "review_rating": "7",
        "review_title": "A noticeable improvement over the first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "djangozelf-12351",
        "review_rating": "1",
        "review_title": "A P.G.13 horror, not even in the league of the first.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Hellmant",
        "review_rating": "7",
        "review_title": "A decent enough sequel.",
        "review_detailed_main": "'SINISTER 2': Three and a Half Stars (Out of Five)\n\nSequel to the 2012 horror hit 'SINISTER'; about a family haunted by a demon, called Bhughul, through the ghosts of murdered children, using super 8 snuff films. This installment picks up where the last one left off, with a new family being terrorized by Bhughul. The movie was directed by Ciaran Foy and written by Scott Derrickson (the director of the first film) and C. Robert Cargill (the duo also wrote the first movie, as well). It stars James Ransone (who also costarred in the original flick), Shannyn Sossamon, Robert Daniel Sloan, Dartanian Sloan and Lucas Jade Zumann. I enjoyed it, although not quite as much as the first film.\n\nA mother, Courtney (Sossamon), and her twin sons, Dylan (Robert Daniel Sloan) and Zach (Dartanian Sloan), move into a countryside farmhouse. They're on the run from Courtney's abusive husband, Clint (Lea Coco); who has hired people to search for them. Dylan is having continuous, horrific, nightmares; and begins seeing the ghosts of dead children. These spirits are led by a kid named Milo (Zumann), who starts showing Dylan Super 8 home movies; of families being brutally murdered. Ex Deputy So & So (Ransone), who investigated the crimes in the first film, shows up and tries to help the family.\n\nThis film has a lot bigger budget than the first movie, $10 million compared to $3 million, so the productions values are a lot better. It looks cooler, and the nightmarish gore scenes are at least as well made as the original installment (if not better). It is lacking Ethan Hawke (the star of the first film) and Derrickson at the helm; Foy shows decent talent here, but he's definitely not as skilled as Derrickson (yet). The movie has some really creative and haunting horror imagery and atmosphere, but it is slow paced and not that involving. It's a decent enough sequel though.\n\nWatch our movie review show 'MOVIE TALK' at: https://youtu.be/rHh87mlE5WQ"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "tjgoalie13",
        "review_rating": "4",
        "review_title": "Dull, and Not Scary",
        "review_detailed_main": "Sinister 2 is dumb, clichéd, and worst of all not scary. What made Sinister good, was that it capitalized on it's opportunities to scare, and gave the audience what it wanted, horror. Sinister 2 abandons the approach of the first film, and looses all horror, besides the few jump scares, the film isn't even remotely scary. The lack of horror, and poor acting, leads to the film being very dull. The characters are underdeveloped, the film falls back on horror clichés, the story lacks any intelligence or depth, and there's almost no humor. So in the end, Sinister 2 is a dumb, dull, clichéd, sequel that completely abandons the things the original film did well, most importantly the horror."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "moviexclusive",
        "review_rating": "",
        "review_title": "The rare sequel that lives up to the legacy of its predecessor, 'Sinister 2' offers gripping suspense while amping up the shlock for a genuinely unnerving experience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "AlukardsCastle",
        "review_rating": "7",
        "review_title": "Exactly What You'd Expect From A Horror Sequel. But So What?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "A Sin, Not Sinister",
        "review_detailed_main": "This movie was absolute rubbish. I'd be generous if I were to call it a scary movie because it was far from that. It was a drama with some scary parts--if that much.\n\nBuguul is after new prey and he's found them. A mother has ran away from her extremely abusive ex-husband and she has her two sons in tow. One of these two sons is chosen for the deed of offing his family. The majority of the movie is exposition about the mom, her ex, and the one ex machina character that is trying to prevent the next massacre. It is so bogged down with drama and visible ghosts that you wonder if they're even trying for horror. I contend that they were not.\n\nI think they figured they wouldn't be able to make a good horror sequel anyway so why try. Let's just use the same title, the same antagonist and somewhat of the same plot, throw in a couple of very unlikeable characters and then people will lap it up. This movie was lazy, over the top and just plain hard to watch. If everyone was killed in this drivel I would have been more inclined to applaud. There was no mystery to uncover, there were no characters that were beloved and there was nothing scary about this movie. It was sinister what they did to the viewers."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ffxpa",
        "review_rating": "9",
        "review_title": "I definitely recommend this!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "george.schmidt",
        "review_rating": "7",
        "review_title": "Second in the budding supernatural franchise is as most sophomore outings, more of the same",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Prismark10",
        "review_rating": "3",
        "review_title": "Sinister 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "baunacholi-86159",
        "review_rating": "3",
        "review_title": "Cluttered",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "neil-476",
        "review_rating": "7",
        "review_title": "OK sequel with incomprehensible rules",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "svarta_skuggan",
        "review_rating": "3",
        "review_title": "This sequel makes the original look like a horror classic.",
        "review_detailed_main": "Now, I'm one of those who looks leniently on modern horror films. Sure the story doesn't make sense in some films, but the acting and directing can be a saving grace -- or vice versa. I mean we're not talking about a genre that gets Oscars. So I found the original \"Sinister\" film to be quite entertaining despite its flaws. It established a mythology surrounding the mystery and the ending was a twist nobody saw coming.\n\nFast forward to the sequel. It wrongfully assumes that you've seen the original one because we're introduced to a main character who played a secondary role in the first one and the audience is expected to know who he is, his back story and motives. The main story is about a mother with two sons who tries to escape from her abusive husband (and father of her children). I really believed and liked the acting of the protagonists in the scenes without the supernatural. If the film would've been a drama about a single mother trying to get away and protect her children from an abusive husband and father then if would've been great. But these serious scenes clash poorly with the supernatural ones.\n\nIf you've seen the first film you will find a lot of things that just don't comply to the original's mythology. Nothing makes any sense and there is so little of the horror or suspense element that it's unbelievable. There are thankfully few jump scare shots (apparently Hollywood listened to the public which clamored \"Jump scares does not equal horror!\"), but without them there is nothing that will scare the viewer. The climax and resolution (which baits for a sequel, as most horror films do, the cliché that \"and everything got back to normal ... or did it?\") were so poorly conceived and executed that I had to bury my face in my palms out of dismay.\n\nI'm giving the film 3 out of 10 because the acting and dialogue in the scenes not having anything to do with the supernatural were great. As stated before, I wish the film was a drama about a mother's fight for her and her sons' freedom from an abusive husband with the help of an ex-deputy. The actors had chemistry and they were doing the best they could. Let's just hope there won't be any \"Sinister 3\"."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "BandSAboutMovies",
        "review_rating": "7",
        "review_title": "Better than the first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "cosmo_tiger",
        "review_rating": "5",
        "review_title": "Nothing terrible and not the worst sequel ever made but it went away from what made the original scary and it hurt this one.",
        "review_detailed_main": "\"It's the kids, he gets the kids.\" After leaving her controlling and abusive husband Courtney (Sossamon) moves her kids to a secluded home in the country. Originally the kids are excited about the move but when they see strange visions in the house their attitude begins to change. Now the only way for the kids to escape the terror is to make one final movie, involving they ones they love. The first movie was creepy because it was psychological. The dad would watch a movie and then see bizarre things. This one almost dumbs down the horror and spoon feeds it to the viewers. This one also ups the blood and gore factor, which to me adds nothing to the horror aspect. There were a few parts in this that I thought were a little creepy but like most sequels this falls short of the original. Overall, nothing terrible and not the worst sequel ever made but it went away from what made the original scary and it hurt this one. I give it a C+."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "lost the creepy",
        "review_detailed_main": "Courtney Collins (Shannyn Sossamon) is on the run from her abusive husband Clint with her sons Dylan and Zach. She has custody but he has connections. Deputy (James Ransone) is back from the first movie. He's off the force after the Oswalt incident. He has been researching Bughuul and tracks down another murder house. Courtney has moved in and the child spirits lure Dylan to watch the films. Ex-deputy defends Courtney as Clint and his police friends try to get the boys back.\n\nThe return of deputy dog is fine. Courtney's battle with Clint is interesting. It's great to make the kids as real characters and putting them in the center, unlike the original. The moody creepiness of the original is gone but the sequel could never recapture that anyways. It would be fool's errant to try. The biggest problem is the last act. It's too neat and too many convenient moves. It doesn't fit the Sinister concept. The first movie ended with the family getting wiped out."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "TheMovieDiorama",
        "review_rating": "3",
        "review_title": "Sinister 2 was less frightening than Bughuul having a good ol' boogie with ghost children.",
        "review_detailed_main": "Derrickson's original horror film was, much to everyone's dismay, an unexpected surprise for me. Sure some of the jump scares were insanely stupid (the laptop screen moving? Gimme a break...), but the grisly plot, Hawke's acting and cinematography were alluring. Naturally, an unnecessary sequel was to be spawned from the depths of Babylonian mythology, and it's a slapdash low-budget effort with no real purpose to it. No scares, no noteworthy performances and certainly no artistic memorability. Yawn! A family on the run from their abusive father, experience ghostly apparitions who were taken by Bughuul at their rural farmhouse. But Deputy, I mean, Private Investigator \"So & So\" is on the case to stop this chain of horrific events.\n\nRight, so this is pretty much a lesser re-hash of the original, \"okay?\". Uninspired Super 8 mm films of death, \"okay?\". Bughuul standing there looking all cute, \"okay?\". And a terribly dull performance from Sossamon who says \"okay\" in every frickin' sentence whilst obviously chewing her gum like a cow grazing, \"okay?\". \"Okay.\". \"Okay! Okay! Okay!\". The abusive father sub-plot, although heavy handed, had some ground for deeper thematic purpose. But then the third act arrives, which was depicted several times in nightmarish visions so was hardly a surprise, using every horror cliché available to ensure that any literary meaning had been taken by \"Mr. Boogie\" himself. Wait, how did obviously violent father find the farmhouse again? I may had dozed off...!\n\nRegardless, problem is this sub-plot takes precedent over the continued storyline from its predecessor. So the scenes involving the Deputy felt like filler just to throw in some obnoxiously loud jump scares, with the same sound effect as the \"lawnmower\" Super 8 footage from the first film. Oh, and it ends on a jump scare with \"Mr. Boogie Wonderland\" peeping his head on screen like an unwanted child. Just leave me alone! Aside from some atmospheric sequences, such as the ominous shadows in the church, this was pointless. Next!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kenzor-38907",
        "review_rating": "10",
        "review_title": "Excellent Movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "lizxypopcornkid",
        "review_rating": "6",
        "review_title": "preferred it to the first , better plot line.",
        "review_detailed_main": "Although this title is much poorly reviewed than the first i preferred it plot line much more as well as how the story enfolds. With terrifying violence and an even more carnage Sinister 2 had a better ending than i expected with a much more compelling harsh reality , they cannot escape Bagul."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "shroedingerspuppy",
        "review_rating": "4",
        "review_title": "Hardly sinister",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "sean73267326",
        "review_rating": "2",
        "review_title": "Extremely disappointing horror sequel.",
        "review_detailed_main": "In the opening moments of 2012's acclaimed \"Sinister\", we see what looks like a family murdered - hanged from a tree with a cold and horrifying simplicity. The shot itself doesn't ever divert its attention, and instead focuses entirely on an image of cold, hard, obvious death. By far, it's one of the most effective opening sequences of any horror movie I've ever seen. It's so frank, it's utterly bone chilling, and while that shot took place, there was a collective hush of horror over the cinema.\n\nThe horror was in how frank it was in its depiction of death. There's no screaming, there's no nasty jarring chord, there's no sensationalism. In the opening moments of Sinister II, a murder also takes place, and for a moment it seems like it may have gotten things right. But, alas, the movie throws the spellbinding horror of this moment out the window, and instead replaces it with a jumpscare. This all-too-obvious approach ends up being the death of Sinister II, a movie that forgets what made the original a smash.\n\nThe plot itself doesn't do much to distinguish itself from other horrors, really. Family move into a house, family notice strange occurrences, family realize there's a supernatural force trying to kill them. The detective from the first movie is thrown into the mix, but he doesn't really ever do much for the movie apart from advance a few plot points. This is a cookie-cutter plot; disappointing, considering the original took a similar one and actually explored a lot of seriously interesting ideas with it.\n\nSinister II tries to do the same, but falls flat. Instead of the original's subtle commentary on violence in the media, this film goes for violence in the household. It's heavy handed and syrupy, not helped by the fact that the main non-supernatural villain is the ultimate in abusive-parent caricatures. I think it should have gone down the same lines as the first film. I appreciate it trying to do something different, but why not leave this subject matter to another movie - a movie where it may actually fit the plot instead of serving it?\n\nOn to the horror itself, and Sinister II doesn't really do much to help it stand out from the crowd. There's literally nothing in this movie that wasn't done already, and probably done better. Unlike the original, which was all atmosphere peppered with some horrifying scares, II doesn't manage an atmosphere - at all. Instead, it throws what feels like hundreds of jumpscares at us. That isn't scary - it's just a bit stressful. When Baghuul popped out of nowhere for the tenth time, I just wanted to leave the cinema.\n\nAnother problem is that it forgets the main rule of horror - what you suggest is scarier than what you show. It doesn't really matter what type of horror it is, that's a hard and steady component, and Sinister II completely forgets this. It's hugely disappointing that it forgets this because its predecessor had such a queasy, nasty feel to it because we were completely in the dark for most of the movie. Baghuul also didn't look so cheap in that one - he appeared mostly as a distortion in a photograph, or a barely visible face. Here, he's comical - with the spotlight squarely on him, he's about as scary as a kitten.\n\nI could go on, but you get the point. I could have mentioned the kids (this one goes WAY over the top with its dedication to spooky kids), I could have mentioned the awful script, I could have mentioned the almost universally awful acting, but I feel I've mad it clear. It's actually with a lot of disappointment that I say this, but Sinister II is a failure on nearly every level, and considering the promise, that feels like a damn crime."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "treakle_1978",
        "review_rating": "7",
        "review_title": "Better than you think",
        "review_detailed_main": "While it has a lot of jump scares they are effective. The kids in this movie are great. I love the twins in this movie especially. While it's not as good as the first film it is a worthy sequel. Definitely worth a look.\n\nTim Treakle"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "MisterAwesome",
        "review_rating": "3",
        "review_title": "Disappointed with the sequel",
        "review_detailed_main": "Let me first state that I really liked the original. Sure the original had some really easy jump scares, but I loved the super8 films, the plot and Ethan Hawkes acting.\n\nThe second one was, in my opinion, really unnecessary to begin with. The ending of the original was satisfying enough to not need a sequel. The scares in sinister 2 where way to few, way to easy (jump scares) and way to far apart. There was hardly any creepy atmosphere and the plot was nowhere to be found. Bughuul was nowhere as mysterious and scary as he was in the first movie which made it really disappointing.\n\nThe super8 films in sinister 2 where decent and pretty original though and sometimes hard to watch. But without any backstory to the families being murdered or any connection with them whatsoever, it made it hard to even care and put it in perspective with the story.\n\nAll in all, sinister 2 just tries to make money of it's original, but falls short in every way. I'd say just stick with the original and don't even bother with this one unless you really, really love the first one and want to see everything that has anything to do with it."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "Twice As Stupid.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kldvd-80933",
        "review_rating": "6",
        "review_title": "About what you would expect",
        "review_detailed_main": "I loved the first and was hyped for the 2nd one. All the bad reviews in the world couldn't keep me away, as I'm a horror junkie. There are a few jumpy moments, a couple done well....a few that missed the mark. The shock factor has dropped considerably as when you are watching it, you can't help but think \"been there, done that.\"\n\nThe only thing that really shocked me was how tame the super 8 films actually were. Blood was minimal. I've seen critics mention the dentist one...which you see maybe all of two seconds of in the background of a scene - hardly worth mentioning. The super 8 films were probably the biggest disappointment for me. They were, for the most part, pretty dull / tame. (At least from what I was expecting)\n\nThe main story line starts a bit rocky, but the performance by deputy someone-so really made this movie worth while. His character was great, all the way through - which helped carry the, otherwise dry, film along. If you are a fan of the first, it's worth a one- time viewing. Probably not something I'd add to my library, or even watch a second time for that matter.\n\nI think most fans of the first will kind of scratch their head at the end (typical blumhouse fashion), and turn to the person next to them and go, \"Mmm..yea..that was kind of okay. Pretty decent - kind of what I was expecting. Not great... but not terrible. It was okay-ly entertaining.\"\n\nMore reviews at horrorplayhouse.com"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "capone666",
        "review_rating": "5",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "Sinister II\n\nTwins make the worst paranormal victims because you have to haunt them twice as much as normal.\n\nWhich is why the ghost-children in this horror movie only torment one sibling.\n\nEvery night Dylan (Robert Daniel Sloan) is visited by a group of adolescent apparitions that haunt the abandoned farmhouse their mother (Shannyn Sossamon) moved him and his brother Zach (Dartanian Sloan) in to.\n\nJealous of his brother's newfound friends, Zach attempts to gain their favour by abusing his brother and watching the horrify home videos that his squeamish brother refuses to.\n\nMeanwhile, an ex-deputy (James Ransone) with knowledge of the home's history hopes to torch it and the sinister Super 8 reels inside.\n\nThanks to its untalented new cast and scream-free script, this slapdash sequel to the surprisingly distributing original fails to capitalize off of its predecessor's cult status.\n\nFurthermore, who needs ghost-kids when twins are scary in and of themselves?\n\nRed Light\n\nvidiotreviews.blogspot.ca"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "billyandsuzanne",
        "review_rating": "10",
        "review_title": "Great Sequel. Great Film.",
        "review_detailed_main": "As a big fan of the first Sinister, I went out to see the sequel. I was excited but didn't have big expectations because most people ruin horror sequels. But it exceeded my expectations and beyond. It was an extremely good movie and I can hardly believe the reviews that I have read. It's as if these \"critics\" didn't even see the film and are bad mouthing it because they can. It was suspenseful, it was scary, and it was well thought out. The themes are for a specific audience but I think any horror fan can watch Sinister 2 and have a great time. Don't listen to the bad reviews because they are way too brutal and over the top. This sequel just as good as the first if not better. I applaud the makers of this excellent film. 10/10."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Not As Good As the First but an Entertaining Sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dnaples-72178",
        "review_rating": "7",
        "review_title": "I liked it, solid horror",
        "review_detailed_main": "I liked this one as much as the first, just differently. I dont know why all the bad reviews. The first one was the parents perspective, this one shows it from the childrens perspective. Therefore, it helps give an all around idea of how Bughuul haunts. They showed Bughuul more than they did in the first movie so I liked that."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ashleywork",
        "review_rating": "1",
        "review_title": "Possibly the worst horror film I have watched all year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "the_prodigy_bjpenn",
        "review_rating": "1",
        "review_title": "worst boring movie of 2016",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "blackmelo",
        "review_rating": "7",
        "review_title": "could have been part of the scream franchise",
        "review_detailed_main": "When writing this review this film has a rating of 5.3 which is not bad for a horror but it is much lower than the original which like many have pointed out was a classic and one of the most spine chilling horrors I have watched. The first was so creepy it left you scared to look over your shoulder after watching it, the director had a real skill to send chills down your spine and some reviews have pointed out that is lacking in this sequel which is true but it isn't not worth watching. I enjoyed it. Like my title says I enjoyed it like a scream sequel for example. A good story, a bit of fun, in a horror theme that I am into. The reason this film has such a low rating is because the first film was so incredibly good - any new director would have had a hard time topping that or even coming close to pulling it off again. People here giving it low scores were eager to get that same effect the first film provided like the saw franchise for example gives you that creeped out vibe. But getting a horror right is not easy. This director knew the plot, the bughuul goes and does his thing again and he introduces us to a new family, with the angry ex, deputy so and so which reminded me of dewey from scream. So if you like scream and do not go into this film with the expectation that it will be another creeper that won't make you sleep well after watching you will be disappointed like many reviewers were expecting just that. This director went for a different direction which arguably killed off the Sinister franchise instead of there being 6 sequels like saw for example. I don't think that's a bad thing, but that is for you to decide. But I was tempted not to even watch this one. It is a good film worth watching I thought, it didn't ruin the brilliance of the first, it was nowhere near as creepy but that just highlights how good the first was. It doesn't ruin anything watching this one so I would recommend it no matter what the disgruntled fans say expecting the worst nightmare of their lives. It was as good as any scream film I have watched so I can understand why the hardcore fans of the first were let down but I liked thinking that I knew a lot that deputy so and so didn't know from having watched the first. This film focusses on deputity so and so trying to save the family he meets. We already know the buguul well from the first film so this one is all about him trying to end the evil and figure out how. There is far less sinister vibes in this film than the first but I liked how the director didn't give in to making it the most sinister film ever but a fun sequel to watch. So I feel I had to write this review to clarify that for other horror fans out there that haven't watched this one yet."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "stevendbeard",
        "review_rating": "5",
        "review_title": "Cheap Scares",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "frosty-44431",
        "review_rating": "7",
        "review_title": "Not a bad sequel",
        "review_detailed_main": "I'm surprised by the low ratings for this. It has it's own style of horror/thriller and I found it really chilling which is what I wanted. Not a bad effort at all."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "begob",
        "review_rating": "4",
        "review_title": "Over weight story lands splat on its face",
        "review_detailed_main": "A sensitive boy suffering nightmares of hideous murders hides out with his mum and brother from their thuggish father, while a kindly investigator arrives to warn them of the hideous fate that awaits them at the hands of a supernatural malevolence.\n\nYou see how hard it is to write a logline for this confused mess? The storyline with the father should simply not be there - it adds a competing menace and completely unbalances the movie. But there was a lot to interest me in the first half, although the use of CGI in the opening scene put me on alert for overkill. The first act plays out nicely, with short scenes presenting brisk little mysteries, particularly in the supermarket. Then a hero comes along, and he's played with aw' shucks comedy - OK, could be interesting. The story is then punctuated with home-movie style sequences of devilishly cruel killings of various families. Definitely interesting, especially that final glance in the snow slaughter scene.\n\nBut when the father steps up, the rot sets in. What had been interesting before became too literal and the emphasis was divided between father, spooky ghost children, and the boogy man. I expected an elaboration on the myth of the first film, but not such a departure from the original bone chilling style. This ends up with the story bulldozing through the natural progression and, without explanation, landing us in a cornfield with flames all round. As if the director skipped an entire section of the story while leafing through the script with sticky fingers. I can imagine all sort of shoe-horning and cutting in post production.\n\nThe first film disappointed in the final act after scaring the bejeebus out of me, but the sequel ends in a ridiculous scooby doo farce, with zero suspense or frights.\n\nThe acting was OK - particularly the boys when they're scrapping - and the movie looks good, editing is rapid, some of the humour works (but none of the jump scares), and the music is interesting - although more silences would have been welcome.\n\nOverall - enough quality for a few points, but badly misconceived at script stage."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Clintborari",
        "review_rating": "6",
        "review_title": "\"It's the aesthetic appreciation of violence than summons him\"",
        "review_detailed_main": "The biggest weakness of Sinister II is that it suffers from a great mass of copy and paste from the first film. And unlike the previous installment, you already know the major unveil. So this takes away a lot of this film's originality, enticement, and shock value.\n\nThis film needed something unique, new, and horrifying to keep us thoroughly entertained. I was craving this second part after the chilling effect the first film had on me, but I noticed a severe decrease in psychological horror.\n\nThe kill films are more gruesome than its predecessor, however, they don't seem to have the same effect on me as they did in the first film. I didn't find them as enticing or as creative the second time around.\n\nA greater expansion of the history of Bughuul and the sinister children's upbringing added some new lore to the already intriguing tale. However, The overkill of the threatening youngsters that are trying to inspire the boys to commit violence made this film a little less terrifying, and It came across as a little cheesy in some parts.\n\nSinister II did successfully add some new disturbing imagery, such as the church scene with the rats, but otherwise, it was fairly slow-paced in trying to build up suspense, and alas it wasn't nearly as effective this time around.\n\nThe positives of this film are there are many ways the story could go, and it was left wide open for a potential horror franchise in my opinion.\n\nI felt that all the children taken by Bughuul were shunned or neglected by their parents in some way, which made it easier for them to be manipulated by Bughuul's influence, thus leaving them vulnerable, and it instilled a temptation for them to commit these horrific crimes against their own families.\n\nAll in all, I was left fairly content, yet a little disappointed at the same time. I wasn't blown away by any stretch, but Sinister II did keep my interest, and yes I do want to see more.\n\nI found the ending more satisfying in this part, but otherwise, everything else in the film was just a lesser variation of the original.\n\n6/10."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "elliotjeory",
        "review_rating": "3",
        "review_title": "Ye it's not good",
        "review_detailed_main": "Such a miserable horror, no suspense silly kills, I mean how do you hang four people upside down over a crocodile infested water? Try's to have the shock factor but it's just lame. Courtney cute though."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "cheekymonkey_gemmy",
        "review_rating": "9",
        "review_title": "True to it's name this film truly creeps me out",
        "review_detailed_main": "I'm a big fan of horrors (insidious/conjuring/Annabelle etc) and this is among the best. I watched this in cinema for the ultimate scary experience and boy was i scared! Be prepared for lots of jumps and suspense (this sounds cliché but its not).The main bad guy was verryy creepy as well. Also don't worry if you've not watched the first one, there's nothing you need to know in order to watch the second one (although it follows a similar plot). The only negative feedback i have for the film is that the ending could be improved, i don't know why but i found it disappointing. Overall great horror and i think it's even better than the first one."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "guardianofthewhills",
        "review_rating": "7",
        "review_title": "I think this was a great sequel",
        "review_detailed_main": "It appears their were a few different schools of thought for what was expected from this sequel 5+years ago. I watched both movies more recently, long after the initial hype, and I think this sequel is a great extension of the first."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ten-thousand-marbles",
        "review_rating": "4",
        "review_title": "This one wasn't very Sinister",
        "review_detailed_main": "This sequel had a lot to live up to, and it didn't quite get there. The original was a great movie. Sinister II isn't bad, but it's slow at times and it strays from the formula of the first. The 8mm films didn't seem as legit, and bringing the undead kids to the forefront made the film a bit cheesy. The cast and production are decent, but lack depth due to a lackluster script and story. I'll watch a third installment if one is made, but part of me hopes that doesn't happen."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "nkareem-57300",
        "review_rating": "3",
        "review_title": "Another one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "andricfilip",
        "review_rating": "6",
        "review_title": "Sinister 2",
        "review_detailed_main": "Although \"Sinister 2\" feels like a forced and washed down follow-up to its brilliant predecessor, it still offers some thrills and explores the first movie's interestingly creepy universe."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "honeybloggs-69648",
        "review_rating": "1",
        "review_title": "Ridiculous !",
        "review_detailed_main": "What a silly explanation of why families were being m.urdered ! There was no atmosphere , no creepiness , no logic .\n\nIt was pathetic and a borefest . I think it was just a money spinner riding of the reputation of the first movie. . I feel sorry for people who had pad all those years ago for this pile of junk! ."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "akshatmahajan",
        "review_rating": "6",
        "review_title": "Not as good as original",
        "review_detailed_main": "Sinister was different horror experience for me. It had well written story, quality actors and a genuinely creepy atmosphere. Main problem with Sinister 2 was that story didn't have that suspense which made original different. Story was very simple. Also, the actors could have perform better. Director tried his best to setup the chilling tone but failed miserably.\n\nOverall, would recommend this to those who have watched first part."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "sp-smediaglobal",
        "review_rating": "4",
        "review_title": "Lots of potential but a lot of wrong turns",
        "review_detailed_main": "This film has all the elements of a good horror story. In saying that, I must tell you that this was one of the less intriguing horror films I've seen in the past few years. It had the flash, the flare, and every opportunity to get really good! Then, your left with a void or lack of completion. I was left wondering why on earth out of all the directions you could go with this that would be awesome? They just did not deliver... maybe just to be different and it didn't work. I think it frustrates the viewer when you don't give the audience what they want. It took way to long to develop the plot and even at that it was the wrong focal point spending time on a meaningless 5 min plot that was never developed. Good make-up, good music, awkward lines or bad delivery. Oh, Plus a touch of: \"how on Earth did you get this in theaters\"? It's like they almost ran out of money and had to rush..... No spoilers here other then wait for it to be at the dollar theater. SP"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "shandov23",
        "review_rating": "6",
        "review_title": "Bughuul's at it again!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kasrarahimi-38824",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Somebody is walking around with a lot of money in his pocket because he sure didn't spend it making this God awful movie."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "uncertainwonder-1",
        "review_rating": "8",
        "review_title": "As good or better than the first one",
        "review_detailed_main": "1. This feverish experience is one of the best horror films of the year.\n\n2. You don't have to see the first movie to see this one, but I highly recommend it. The context of the film won't make a lot of sense without it. And part of the intensity of this movie is because you know the secret, but the people in the movie don't.\n\n3. It follows Deputy So & So after the events of the first film. Obsessed with stopping Bughuul, he comes across a woman with two sons who have unkowingly attracted the pagan deity. While the mother deals with her ex-husband, dead kids appear to one of the boys and show him snuff films in the basement (if the snuff films in the first movie bothered you, you should know that these are worse).\n\n4. As with the first movie, the use of sound in this film is an experience in itself, expertly cutting together music and effects to heighten the hallucinatory nature of what's going on.\n\n5. In a super rare occurrence for a horror film, there is actually a second plot line. I mean, this is like a real movie. While some will be annoyed by the extra story because it takes away from the supernatural stuff, it's a great development that makes the characters real people, so that you actually care what happens to them. It's also a grim reminder that some things in real life are just as scary as a ghost.\n\n6. The movie quickly but cleverly uses an obscure, but actually real, phenomenon known as \"numbers stations\" to give a greater scope to Bughuul's actions.\n\n7. There are some good jump scares in the movie. But the filmmakers know the difference between a \"scary movie\" and a \"horror movie\". By making the film rated R, they gave up some viewers that would have seen it if it were PG-13. They use that harder rating to their full advantage, making this an actual horror film. This movie is NOT for kids.\n\n8. There is a quick, easy-to-miss conversation between two characters that bring up the idea of \"aesthetic observation of violence.\" If you want to get all meta, you can apply that concept to the movie you're watching, and get some uncomfortable insights into the nature of horror itself.\n\n9. If you like your horror movies to be the flash-bang generic type, like \"The Conjuring\", then this film may not be your thing. But if you want your horror movies to mean something, to stick with you, and even make you genuinely uncomfortable, then you owe it to both yourself and the horror genre to watch this film."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "troyputland",
        "review_rating": "7",
        "review_title": "Makes its own way without destroying the concept of the original.",
        "review_detailed_main": "Sinister isn't the first horror film to spring to mind that's gained a sequel. Read this review on the basis that you've seen the original. Ethan Hawke and his family are long gone, the evil bogey-man and his evil children relocated to other properties, including one residing a woman and her two sons. The policeman from the original, weirdly named Deputy So & So (James Ransone), investigates the property and its inhabitants. Unlike Hawke's excursion, So & So's casts the bogey-man in light for all to see. The shocks are erratic, neither heavy or light, yet quick off the mark. Sinister 2 engages well, putting the Collins' family in the heart of everything that takes place. The murderous history comes across stronger than ever, pushing the sick and twisted envelope to the max. Both the son's acting are dark, the cop turned private investigator the weakest for being weak. Sinister 2 upholds the original concept whilst making its own way through the horror scene. Expect a third, or even a fourth film very soon."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "GeminiRift",
        "review_rating": "3",
        "review_title": "A Disappointing Sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "sdabron",
        "review_rating": "2",
        "review_title": "Missed the mark majorly. Big let down from first movie.",
        "review_detailed_main": "Had high expectations for this sequel. Really enjoyed the first movie but this one just killed it for me. Bad acting and a below average script. Maybe I just expected too much from this movie. Very disappointing since the first instalment is one of my favourite horrors. Not worth the time spent watching it."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "subxerogravity",
        "review_rating": "6",
        "review_title": "Really good ghost story.",
        "review_detailed_main": "Sinister 2 was definitely worth the watch. It was a really gripping story with a lot of interesting characters.\n\nThey were highly developed and performed well by the actors in the movie.\n\nAlthough the boogie man that played the main antagonist in the first movie takes more of a back seat in this film with the frights being done more by his ghostly children he has taken over the years, who attempt to add to their roster by haunting two boys living in their home at the time.\n\nThis might be why I found the first movie more scary. The kids did not frighten me like the monster did in the first movie. Instead my fear was replace by eeriness and disturbed-ness, which was fitting for the story they were telling about an mother trying to get her children away from an abusive husband only to place her children in supernatural danger.\n\nSo yeah, I recommend the movie. Not as scary as I hope but a ghost tale that escalates beautifully."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jethrotroll-30807",
        "review_rating": "2",
        "review_title": "Not Even Close to the Original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "johnsmithjanuary-20081",
        "review_rating": "6",
        "review_title": "still better than Conjuring",
        "review_detailed_main": "I haven't seen the first yet but this one was entertaining enough for me to make it through. Not scary really at all but enough to keep my interest at least."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "mattwilde123",
        "review_rating": "3",
        "review_title": "Sinister 2",
        "review_detailed_main": "Modern horror sequels are often failures. I thought that as the first film wasn't great that I wouldn't be as disappointed if this film turned out to be bad. I was wrong, Compared to this, the first instalment was a masterpiece and this made me realise how it was successful at achieving its goals sometimes.\n\n'Sinister 2' was quite scary in places. No doubt, the cinema playing the film super loud helped elevate the jump scares though. The creepy depictions of murder in the first film were crazily overdone in this.\n\nThe screenplay was terrible. The main story was stale and predictable and the characters were unsympathetic and cold.\n\nThe performances were poor all over this film in particularly the ghost children seemed like they were performing a rubbish school pantomime.\n\nOverall, I can't be too surprised with what I thought of this film but, sadly, I can see sequels for this being churned out more and more in the future."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "lita-ann88",
        "review_rating": "7",
        "review_title": "Read this before negative reviews please.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "xenite5",
        "review_rating": "3",
        "review_title": "a really bad sequel",
        "review_detailed_main": "It is sad to see that this movie also became a victim of terrible sequels. First of all, none of the stories or characters are formed and founded well. No character development whatsoever. Literally so many pieces are floating in the air that many questions are left unanswered. I would say this is just a bunch of shocking murder tapes. (if you find them shocking of course) I didn't even find it suspenseful. Sadly after some point I was checking my phone and watching the movie at the background. That's how it can't grab your attention to be a good horror movie."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "josiemaria-09225",
        "review_rating": "8",
        "review_title": "Sadistic.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "j0hn22",
        "review_rating": "7",
        "review_title": "As good as the original movie",
        "review_detailed_main": "First of all, when I first watched \"Sinister\" (2012) I really enjoyed that film and I was definitely looking forward for the sequel. Eventually, the sequel was as good as the first movie and I liked it. The plot of \"Sinister 2\" was very interesting, but it was similar to the previous movie. The storyline was well-written and everything was well-explained, but it was kinda different than the original movie. The characters were very interesting, well-developed and most of them were likeable (except, the dad). The filming location of the movie was just a big old creepy farmhouse in the middle of nowhere. The casting was nice and their acting was descent. I have to admit, it was a very scary movie and there were too many jumpscares. The opening scene was kinda creepy and promising. The ending scene was definitely predictable, but I enjoyed it. The boogeyman's appearance was as creepy as the first movie and kinda terrifying. Overall, it was an enjoyable sequel, very intense and I would probably recommend it to my friends. Last but not least, I'm definitely looking forward for a third movie, even though I don't think they're planning to make one..."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "knightox",
        "review_rating": "3",
        "review_title": "A Sort of Shameful Sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "americantragedy13",
        "review_rating": "1",
        "review_title": "Predictable",
        "review_detailed_main": "None, and I emphasize None, is how many stars this movie deserves.\n\nThe following is why:\n\n-Bad acting -Predictable storyline -Characters you \"feel in touch with\" -Those real annoying kids(2sons -The utterly abysmal ending"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Seth_Rogue_One",
        "review_rating": "6",
        "review_title": "Not up to par with the first one for sure... But not all that bad",
        "review_detailed_main": "The first one was creepy as heck that had you glued to your seat almost feared to look at the screen to see what disturbing events were gonna be portrayed in front of our eyes.\n\nThis one does not achieve that heavy creepy-factor unfortunately and at times the movie feels like it's a little all over the place.\n\nA little too many segments of 'films' being watched and the 'beings' interact a little too much with the humans in this one, and that is possibly why it's not as creepy as the first because what's hiding in the shadows is often more scary than what's standing right in front of you.\n\nBut it still manages to keep your interest for the more part and wraps itself up neatly in the end to where at least I felt satisfied enough with the watch even if's not as memorable as the first.\n\nJames Ransone who played a smaller role in the first one as Deputy so and so returns to get the lead in this one and he does a good enough job, and Shannyn Sossamon is good as well.\n\nConclusion; if you expect it to be as good as the first you will be disappointed but if you look at it as a stand-alone movie and disregard some flaws chances are you'll find it decent enough."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "mtg-25511",
        "review_rating": "1",
        "review_title": "I don't know why I thought the sequel would be better?",
        "review_detailed_main": "\"Sinister 2\" attempts to expand the mythos of the first film but falls short, succumbing to tired horror clichés and a lack of originality. The sequel fails to carve its own path, instead relying on predictable scares and a formulaic approach that hampers any chance of delivering genuine terror.\n\nThe storyline feels contrived, trying to build upon the foundation of its predecessor without offering any fresh or compelling elements. The attempts to deepen the mythology around the sinister events lack depth and only serve to convolute an already weak plot.\n\nCharacter development is virtually non-existent, with the protagonists feeling more like caricatures than relatable figures. Their decisions often defy logic, making it challenging to invest in their struggles or care about their outcomes. The performances, though earnest, are hindered by a lackluster script that fails to provide substance or depth to the characters.\n\nThe scares are disappointingly predictable, lacking the subtlety and suspense necessary for an effective horror film. Jump scares are telegraphed, leaving little room for genuine shock or fear. The movie sacrifices a chilling atmosphere for cheap thrills, resulting in a forgettable and underwhelming experience.\n\nIn conclusion, \"Sinister 2\" fails to stand on its own merits, delivering a lackluster sequel that relies too heavily on worn-out horror tropes. It lacks originality, compelling characters, and fails to evoke the spine-tingling terror that defines a successful horror film, ultimately leaving audiences more disappointed than frightened."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "nour_bs-02013",
        "review_rating": "7",
        "review_title": "Good movie",
        "review_detailed_main": "I really enjoyed the second movie. I thought it was much better than the first one where it takes ages to figure out what's going on. Shame there won't be a third one."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "darren-506-989227",
        "review_rating": "2",
        "review_title": "most pointless sequel EVER!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "michaelRokeefe",
        "review_rating": "7",
        "review_title": "Is it the house or the demon that rules it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dellamorte-44869",
        "review_rating": "2",
        "review_title": "Not good",
        "review_detailed_main": "Sad to say the sequel is quite a disappointment if you enjoyed the original. This is a shallow imitation"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "alecb-58424",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dukecitydoors",
        "review_rating": "6",
        "review_title": "Nope!",
        "review_detailed_main": "Other than Mick Thomson playing Buhguul (Again), movie was a No-No. not fun to watch. Silly at best."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "andyhilton-970-322774",
        "review_rating": "3",
        "review_title": "Really bad acting... Really bad",
        "review_detailed_main": "I'm not entirely sure that the casting director actually had a reading for these actors. The actors never did get into character and the whole thing felt like a highschool play put on by the faculty."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "FuriousFudanshi",
        "review_rating": "3",
        "review_title": "The Only Good Thing About This Movie is James Ransone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "7",
        "review_title": "Two movies for one",
        "review_detailed_main": "I normally don't like the whole, this is not a horror movie, it's that and that. But if you think about it, many classic and good horror movies actually work as dramas too. I'm not putting this into the pantheon or anything, but it's a decent second installment, which continues from where we left off in part 1.\n\nSo yeah it would make sense to have seen the first one, although it does work on its own too. It's also great to see Shannyn Sossamon in a bigger movie again. Over a decade ago, I thought she might become the next Hollywood darling, especially after the Knight movie she did with Heath Ledger, but it didn't turn out that way. She still has it of course and her story is the one that we focus on here. It works if you invest yourself in the characters ... and I think that can be the case here"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "LaCatbutaXeno",
        "review_rating": "3",
        "review_title": "An unsurprisingly horrible sequel to a surprisingly interesting movie.",
        "review_detailed_main": "After seeing Sinister a few times, I've decided that it is quite an outstanding movie among its peers, especially its core concept. Take everything good about the concept, drag it through the trash, and bring it to cinemas. There you have Sinister 2. I suppose some of the tapes had a sliver of the original's magic, but the entire rest of the movie was worthless. This was an upsetting movie, but only in the sense that a unique and decent idea was desecrated by a sequel that need not exist at all."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "UNOhwen",
        "review_rating": "",
        "review_title": "Why would ANYONE see ANY sequel and think it'll be 'better'?!?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "cubsckc",
        "review_rating": "6",
        "review_title": "Adds Some Story but Falls Short",
        "review_detailed_main": "An addition to the Sinister 1 story, this movie continues from the last film. There are some interesting aspects if you are interested with the lore in the first film. The cop in the first film who was helping out Ethan Hawke, returns to Sinister II with the mission to destroy all traces to Bughuul. I think the movie sets up an interesting scenario because he essentially destroys the houses and tapes of the other houses. He comes to a completely different house, unrelated to the previous film. This kind of shows that there are multiple camera's that have their own victims. This is further reinforced by the radio we see later in the film. It essentially had its own series of victims from Denmark.\n\nSo the cop from the first film has burned down the other houses and goes to this new house with a mom and two kids Dylan and Zach. They are in a house that is cursed by Bughuul because the family there had been killed in a church right next to the house. We see Bughuul and the children haunting one of the brothers, Dylan with a series of different films from he first. It begs the question of whether there are several series of cameras and their own tapes and how they spread. I think an interesting thing here is the fact that the spirits of the other kids that had killed their families are the main force behind driving the living kids to kill their families. Its different and I'm wondering if they just did a random switch from the first or if thats how it was meant to be. The kids are essentially willingly persuaded to kill their families for one reason or the other.\n\nIn this film, the mother and her kids are running away from their crazy father who beats the mom and Dylan mostly. So you almost immediately see a reason for Dylan to fall victim. He also starts to go through a major competitive relationship with his brother Zach. Its a relationship that really reaches the conclusion of the film.\n\nThe movie has some good qualities, but really goes over them really fast. It has bad focus in my opinion. So many elements thrown but not explained can be very irritating. Another thing that could be taken either way is this different aspect that the ghost children essentially drive the innocent child to kill their own family... and its done willingly. I personally liked this aspect. However, the first film felt like Bughuul had more influence over the events that were happening in the film. You also felt that the kid was truly innocent and sort of controlled by Bughuul. It seems a bit different and almost a different film, and I could see how anyone would say there isn't enough Bughuul in the film.\n\nTo go back on the focus of the film, I don' think the film spends enough time with the lore of Bughuul or the characters. In this sense, it feels like another cheap horror film with several jumpy scenes, which is too bad because it certainly has a horror figure and some lore that is very interesting. The characters are also not developed well. Whats up with Zach acting like a madman all of a sudden for example? The main character searches the church but not the house? It just seems that many scenes and critical aspects were done lazy.\n\nThere is potential for the continuation of more films due to the lack of lore and understanding. The film wasn't bad, but it had opportunities to shine. Unlike most films, the first Sinister had a lot of open questions that needed answers, which left the door for the sequels to really jump up and shine, and I don't think the film really feed off that."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "FolkHorror",
        "review_rating": "3",
        "review_title": "Shameless Cash In",
        "review_detailed_main": "Sinister 2\n\nFormat: Amazon Prime Language: English Released: 2015\n\nDirector: Ciaran Foy\n\nStarring: James Ransone, Shannyn Sossamon, Robert Daniel Sloan\n\nLet me start with a question; one that you would have hoped the film studios asked themselves before giving this film the green light; How do you follow up a sleeper hit such as Sinister? Their answer, sadly, seems to be, \"We don't care, just make us some money\".\n\nThe story revolves around two boys, whose Mother, Courtney Collins (Shannyn Sossamon), is on the run from her violent ex-husband, being made to watch homemade films by what I can only imagine are meant to be ghost children. The boys Dylan Collins (Robert Daniel Sloan) and Zach Collins (Dartanian Sloan) are not only unconvincing as brothers (which is highly amusing as they are real life siblings) they are also so blood boilingly annoying that you end up hoping they fall prey to the demon, Bhughul, as soon as possible. On the subject of Bhughul, the demon responsible for making the children commit such horrific crimes in the first place, he seems to have been reduced to nothing more than a cameo in his own film for reasons unknown.\n\nThe main triumph of the first film, was, in my opinion, the 8mm films of the killings. This helped, not only build up the atmosphere but created some good off-screen space in terms of the world the characters inhabited and character development. They are a mess in Sinister 2. It was like watching scenes from one of the Final Destination films in 8mm; there was no point to them other than to try to add shock value; but Foy, failed utterly and they were just so bad it wasn't even funny.\n\nThis film is in no way, shape or form, anything other than mediocre, even the acting from James Ransone as Ex-Deputy So & So and Shannyn Sossamon as Courtney Collins is nothing special. It is sadly like the rest of this film, just about passable.\n\nIt's hard to put my finger on what Ciaran Foy was thinking when he made this film, a weak story filled with weak performances and at times questionable film-making made this a huge let-down. Where the first film gave you an engagingly creepy and eerier atmosphere, albeit light on plot, this film doesn't even try and I am left asking if Ciaran Foy even watched the first film. Sinister 2 is nothing but a simple cash in on the first and a completely forgettable one at that."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "briggnalle",
        "review_rating": "7",
        "review_title": "Think of is as Sinister 1, but with a chance to see the kids perspective.",
        "review_detailed_main": "Cause that's kind of what is. Picking up from the first one, the story was done well to continue the legend of the Boogeyman and his legion of children. I liked the story. It picked up well and worked for its advantage. Now, heres what I did not like: The cheesy plot lines considering the children. What tugged at my heartstrings almost as bad as The Girl Next Door, was the amount of abuse. To the kid the wife, I hated it. I hate seeing it. Was it needed for the movie absolutely. So I will say that is my biggest reason why I don't personally like it. And when the abusive man who I shall not name dies I felt no remorse. At all. Anyways, what made this movie good like I said was the story. What was also good were the scares. While some were predictable- actually no VERY predictable, some still managed to catch me when I least expect it. The atmosphere this horror movie delivered was SPOT ON. Just what It needed. Now what was bad, the cheesiness on the children, and the lack of logical reasoning behind the famous tapes and such. Maybe they really were possessed by the need to watch the films but obviously they could have fought it and saved the story a good hour and a half of its time. Nevertheless it managed to sell well, and it worked. Also was the humor added to it. I'm all for humor. No seriously, I really am. It makes us human. But I am not okay with the guy cracking jokes after finding out or seeing something very disturbing. That kills the mood in my opinion. But all in all, I liked this movie. The story picked up good, the scares and sense of dread was strong if they were not at all predictable, and think everyone should at least give it a try. Now my only question is concerning the ending... Does that mean Sinister 3? Dear God what then?"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "danceERS96",
        "review_rating": "3",
        "review_title": "So disappointed",
        "review_detailed_main": "I was so excited about this movie and I was completely let down. I got so bored I had to turn it off. There was no sense of malevolence like the first or any foreboding thoughts like, \"you probably shouldn't't watch those videos Ethan Hawke\" to tide me over.\n\nWhat a bummer. What a disappointment."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "lupitag-11852",
        "review_rating": "8",
        "review_title": "I honestly enjoyed this more than the original.",
        "review_detailed_main": "I'll keep this short since plot descriptions are redundant and attention spans are short these days.\n\nSinister 2, instead of giving us a straight rehash of the original, changes the perspective from the parents to the kids and introduces a menacing, ghostly group of children that give the Children of the Corn a run for their money in terms of creepiness.\n\nThe story sees the return of Deputy So-and-So from the original film, following up on leads and attempting to stop the string of murdered families. In his quest, he comes across our new family, living next to a church where a horrible crime took place (which we do eventually see on 8mm, and it's quite gruesome).\n\nThe film worked for me because Deputy So-and-So is an affable, much more sympathetic main character than Ethan Hawke from the original, and the story takes time to develop the entire family. No one feels like a side character or a throwaway.\n\nAmidst all of this are themes of parental abuse and domestic violence, all gelling together to make a richer plot than the original's. There's simply more going on, and contrary to the trailer, the film is not loaded with jump scares. When they occur, which is seldom, the music is more revelatory than \"gotcha.\"\n\nI found the directing to be more nuanced and the added element of the familial drama to be much more involving than anything in the original.\n\nIn short, I think this was a more accomplished, classy film. It kept my interest throughout and had a lot more going on than the original.\n\nA rare sequel that actually surpasses its predecessor."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "nitzanhavoc",
        "review_rating": "6",
        "review_title": "Fun, a well made sequel, not as good as the first.",
        "review_detailed_main": "After delivering an excellent terrifying film which was the first Sinister, screenwriters Scott Derrickson and C. Robert Cargill set off on a very complicated and usually unrewarding task - creating an equally successful sequel regardless to the close and satisfying ending of the first film. Judging by official cinema standards, I must say that in my opinion - they have failed. However, while not being nearly as good as the first, Sinister 2 is still scary at times and fun to watch nonetheless.\n\nSinister 2 has all the characteristics of the 2nd film in a trilogy. Aster the first film gave us the frame story and \"set the rules\", the 2nd sets out to \"change the rules\" by slightly \"zooming out\". This is achieved mainly by giving the certain plot aspects that were only slightly noticed in the first film a much more significant role. In addition, Sinister 2 follows a method exercised by many Horror and Psycho Thriller anthologies and uses survivors of the first film as main characters in the 2nd. This could be viewed as redundant, but still nicely done.\n\nThe story is quite simple, showing the characters trying to handle the evil uncovered in the first film, while having more information this time. The \"twist\", sadly, is terribly predictable, with the actual ending obviously trying to cover for it in an obviously amateur way. Such an ending can spoil an entire film, and I had to really force myself to be fair and merciful while choosing how the final rating...\n\nStill, Sinister 2 offers several excellent features that have nothing to do with the wanting plot and turn of events. Focusing on child characters tends to make Horror films all the more frightening for me, especially with the profound acting of Robert Sloan as Dylan. His brother (both in real life and in the film), Dartanian Sloan (and the Oscar for best name in the business goes to) is a remarkable actor as well, and does a great job as Zachary, but I couldn't help feeling he didn't amount to his brother's talent. Excellent move by the creators, casting actual brothers, a lovely Easter egg! In addition, seeing Shannyn Sossamon for the first time since A Knight's Tale was a wonderful surprise for me, she is one fine actress!\n\nIn addition, the almost perfect soundtrack of Sinister was kept for the sequel, but I can't really give Sinister 2 points for that... The main tool used to scare the audience is still the jump scares and \"boo!\" moments, and giving the main antagonist more screen time simply makes his ridiculous appearance more apparent (seriously, he looks like a member of Slipknot, and would simply be more funny than scary if it wasn't for the jump scares).\n\nAll in all, I can't say Sinister 2 is bad or not fun to watch, especially for fans of the first film. It does give more information about the overall story, and it's not the same plot using different characters and places (like far too many Horror \"sequels\"). It simply fails to compare to the first one, especially because of the disappointing and anticlimactic conclusion. Still, if you enjoyed the first one, do give this one a chance, and join me in hoping a third part will be released and top both films."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "DVR_Brale",
        "review_rating": "3",
        "review_title": "Deliver yourself from Sinister 2",
        "review_detailed_main": "There's only one horror movie I've ever seen even worse than Sinister 2: it's Deliver Us From Evil.\n\nI remember seeing the original Sinister. That one made me feel so disturbed and scared that I almost left the cinema. Sinister 2 almost made me leave the cinema as well, only for a different reason: it's an unbelievably dull movie which makes you disturbed with how bad it is. Disturbingly bad - that's a new horror sub-genre.\n\nWhat made the original Sinister so scary is primarily music combined with snuff-movie-alike video tapes. Listen for example \"Sleepy Time '98\". You don't need a video to get scared when listening to this one! Then listen Sinister 2 soundtrack; few people will find it scary.\n\nNow I recall watching \"snuff\" movies in the original Sinister and turning my head away from the screen because they were too scary and obnoxious. Combined with formidable music they were very unpleasant.\n\nSinister 2 made me feel unpleasant as well. Not because it's frightening, but because it tries really bad to emulate milieu of the original and always, but always lands short. Ciaran Foy took the original idea, added absolutely nothing new and succeeded in ruining the main premise of the original Sinister.\n\nWhat was crucial to the first Sinister is the mystery side which renders reasonable framework that creates space for \"snuff\" movies hence making them central. Since \"snuff\" movies are Sinister's trademark and main premise, Sinister 2 should've somehow created space for them as well - but it doesn't. Hence, main premise became just a sort of an add-on. This reasoning explains why Sinister 2 is such a mess even though it copy-pastes concept from the original.\n\nOverall, the critics are right. This movie doesn't deserve more than 32 on Metac critic. Kyle Anderson from Entertainment Weekly sums it up nicely: \"Sinister 2 doesn't know what it wants to be, and doesn't add up to much.\"\n\nDeliver yourself from Sinister 2."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "richard_kitchen",
        "review_rating": "4",
        "review_title": "Not a patch on the first",
        "review_detailed_main": "Let's be honest, there is a fine line between horror and stupidity. The first film stayed perfectly on the right side with its creepiness and subtlety.\n\nThis very quickly goes on the wrong side with silly child ghosts... even if they are smartly dressed.\n\nThe horror home movies were a brilliant touch in the first film, but in this they go too far again.\n\nIt just felt quite juvenile as opposed to a decent horror which the first was. It gave me Scooby Doo vibes."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "genderarm",
        "review_rating": "7",
        "review_title": "If it had any real feeling to it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "TriggerDon",
        "review_rating": "3",
        "review_title": "A sequel we all wanted, but didn't get",
        "review_detailed_main": "Sinister 1 was a massive hit and a big surprise for me, might as well say it out loud, that it found itself in my favorite horror movie list. When they announced the sequel I got really excited... I tried not to get too excited, since after all it's a Hollywood horror movie sequel and those don't do good most of the time.\n\nWhen it was released, it hit hard, like a truck...Terribe, just godawful script, overly exaggerated jump scares WHY. It's like they completely ignored what the first movie was about. Also, what's up with showing Bughuul like every 5 minutes. That just ruined the whole secrecy and mystery about \"it\".\n\nThe ONLY good thing they included from the first movie was the Deputy So and So and his efforts to stop this whole cycle. But it wasn't enough to save this movie from being dogs*it, pardon my language.\n\nI heavily suggest you not to waste your time on it..."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "PhilLeasure",
        "review_rating": "6",
        "review_title": "Not perfect but great.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dexteritous",
        "review_rating": "2",
        "review_title": "Bad directors make movies like this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "deloudelouvain",
        "review_rating": "7",
        "review_title": "It lost his element of surprise but it is still enjoyable",
        "review_detailed_main": "After reading a lot of reviews on here I get why people find the first Sinister better then the sequel. I have the same point of view as them. But is that not the case with almost every sequel that you know? Sinister 2 might not be as frightening as the first one but it still remains a nice horror movie to watch. Okay it lost his element of surprise that you got in the first one but the apparition of Baghul every now and then is still fun to watch. Certainly for me just because my wife is so scared every time he appears on the screen and just that alone is entertaining for me. The story itself is still way better then most of the horror movies. The actors are okay, so I can't really complain. I had fun watching this one, even though the first one was better."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "aprilsfriendorin",
        "review_rating": "5",
        "review_title": "Honestly not a terrible follow-up to the first movie",
        "review_detailed_main": "If you're going into this movie holding it to the standards of the first one- yeah, you're going to end up disappointed. But on its own, this actually isn't a bad movie. It's not terribly scary, but it has its moments and is entertaining enough."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "mm-39",
        "review_rating": "8",
        "review_title": "Disturbed and evil!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "robfollower",
        "review_rating": "6",
        "review_title": "For hard core horror fans. Even at that Sinister 2 falls short.",
        "review_detailed_main": "For hard core horror fans. Even at that Sinister 2 falls short."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "HorrorEnjoyer",
        "review_rating": "4",
        "review_title": "Misses the point",
        "review_detailed_main": "While the movie started promising it quickly went down hill.\n\nGone is all the mystery and the atmosphere of the original, this movie takes the direction of standard ghost/slasher flick with cheap jump scares you see coming from mile away and stupid looking villain character, just standing there in the open most of the time, like an idiot, rather than hiding in the shadows, like he did in the original.\n\nActing is not nearly as good, even campy at times, characters are pretty badly written and dialogue is often cringe worthy.\n\nEven killing scenes are not that great - some are ok, but others are pretty absurd, even laughable and seem pretty impossible to set up for a kid - which was the whole point in the original.\n\nOverall I'm very disappointed, that this movie took the turn from clever horror to cheap thrills and laughable stereotypical villain. If Sinister 3 will ever be made, my hope is that it will go back to its roots rather than continue going into this direction."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dcarsonhagy",
        "review_rating": "5",
        "review_title": "A Huge Letdown",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "davispittman",
        "review_rating": "7",
        "review_title": "Don't get all the hate",
        "review_detailed_main": "Sinister 2 got a lot of hate from critics when it was released. But I really don't understand why I got so much hate and harsh criticism. Now I don't think it's as good as the first one, but I really don't think it's bad. The acting is pretty solid from all the cast members, even the children. The tense scenes and the scare/creepy factor is pretty high, as it should be in a film like this. I really like the children actors, I thought they were impressive, especially for their age. The mother and the abusive husband were also played very well. I do have one complaint for this film, and that is that it seems to me that some scenes were skipped or left out, in the ending it seems like there was something missing, seemed like things happened really fast, faster than usual, but that's really all that I have complain about. No this is not the best horror film out there, but this is still pretty satisfying. It is thrilling, creepy when it needs to be, and the acting is good. 7/10 for Sinister 2."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "datorsiers2",
        "review_rating": "4",
        "review_title": "A rather poor sequel",
        "review_detailed_main": "It is one of those films, that should not have been made. They could have just let people enjoy the first movie and focus on a new project, but of course, just like for the majority of hit movies, they have to make sequels and they tend to come out to be lack luster.\n\nThe horror in this film was just awful, very predictable, nothing original apart from one scene. Starts with a few lazy jump scares like most of these type of horror movies. Does not have likable characters, could have been more in depth when it comes to small details about the main villain and the case in general. The mother of the kids seems to be a completely useless characters as she is made out to be completely oblivious of what is going on up to the very end of the film, or when i think about it, she never found out what is really going on. I did not expect this movie to be great, but it could have been much better, at this moment it just feels like a completely lazy and effortless attempt to make some quick cash on the hype of the first film.\n\nThey also made it very open for possible future sequels, which we are going to see in years to come, at least in my opinion. Overall nothing special of a film, would not recommend. Not looking forward to the next movie of this franchise!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "CarlMarket",
        "review_rating": "6",
        "review_title": "Would have been really good but had 2 major flaws - I still liked it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "mpbsfm",
        "review_rating": "5",
        "review_title": "Overall ok.",
        "review_detailed_main": "Not bad. Some good jump scares. Very bad ending. James Ransone did a better job than in Sinister."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "amnesiac12001",
        "review_rating": "6",
        "review_title": "Decent Film That Underperforms Due to Overreaching",
        "review_detailed_main": "SINISTER was one of the best horror films I had seen since the start of the millennium, so much so that I knew it would be virtually impossible to replicate it in a sequel. I was right, but not for the typical reasons. To begin with, the film keeps its original creative team, so there's a solid continuity with the first film. The problem comes not from the execution so much as the story: SINISTER 2 is trying to be PART 2 and PART 3 in the same film, and the narrative demands pull it in 2 different directions, which is what weakens it.\n\nThe A Plot is the strongest, following the Deputy from SINISTER on his quest to destroy Bughuul's agenda on Earth. He's terrified, out of his depth, and all alone, but his nervous Dudley Doo-Right demeanor in the face of evil makes him achingly likable. The B Plot involves a battered wife played by Shannon Sossamon, who is hiding herself and her twin boys from her powerful and psychopathic abusive husband on an abandoned plot of land, unknowingly placing her family in Bughuul's cross-hairs. The C Plot involves the ghosts of Bughuul's victims trying to corrupt one of the twins into becoming another statistic.\n\nThe problem is that the A Plot is so focused that the narrative needs the B Plot to slow the movie down. The Deputy is so competent in his quest that without the B Plot, the movie might be over in 40 minutes. So the B Plot, which feels like a story from another movie, literally intrudes on the A Plot to complicate things, and that's where the horror movie clichés come in: jump scares, spooky-house-searches, inconvenient phone calls and unexpected errands to distract people from finding solutions too quickly, etc. The B Plot is fine on its own, but it doesn't gel right with the A Plot and you can feel the difference.\n\nThe A and C Plots however, are fairly solid. Not only do they get right to the myth-building, but they also help flesh out that Bughuul is more powerful and dangerous than SINISTER led us to believe. Not only has he been busier and for much longer than previously suspected, but he's also ruthlessly determined to eliminate those who would stand in his way, regardless of dimensional barriers. The C Plot is thin, but the child actors are surprisingly good, and they drive home the point that maybe the kids who go missing from the murders aren't as innocent as they seem. There is a massive plot hole as to why they would serve as agents for the god who is slowly consuming them, but there's also clear indications that they aren't who they used to be, another hint of Bughuul's power.\n\nThe film kind of breaks some of its own rules for the sake of action towards the end, but thankfully, it doesn't wallow in the weaknesses of traditional horror films...it just trips on them a lot to pad out the running time. I have to admit, I was impressed at how SINISTER 2 derails our expectations about how things are going to go the same way SINISTER 1 did. The ending feels rushed and familiar, but getting there is more exciting and uncertain than it is for most sequels.\n\nMy guess is that SINISTER 2 is supposed to get most of the slower parts of a franchise out of the way so the future sequels don't get bogged down too. SINISTER 2 might just be the road bump on the path to a faster and leaner SINISTER 3 and/or 4."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "RforFilm",
        "review_rating": "2",
        "review_title": "Unlike the first movie, Sinister 2 is not worth removing from the attic",
        "review_detailed_main": "There's only so many times when one can say that finding a good horror movie is rare. I don't mean the guilty-pleasure, brain-splattering, repetitiveness that horror fans happen to love. A lot of those are allowed to exist as most know that those movies won't get enough exposure to dampen a threat on to the Hollywood system (which is looking harder for horror thankfully as most of the really bad ones go straight to DVD or digital mediums). The kind of horror that seems to be dying is genuine good horror that also manages to be an engaging story. The good story part is subjective and can have many kinds of meanings, so let's just say a well put together story. After all, Jaws, The Exorcist, and Silence of the Lambs all were met with phrase and were even nominated for academy awards.\n\nThe one movie that hits me is Sinister, a new interpretation on the Boogieman. In 2012, this sleepy horror story hit the theaters with surprise, grossing way over it's budget, pleasing both horror fanatics and a mainstream crowd. That one understood well that if horror wanted to continue, it had to try harder to bring something different. What scared a lot of people was the announcement of a Sinister 2.\n\nIn a smart decision, the movie is a continuation, with only Deputy So & So (played by James Ransone) returning who tried to save the family of the last movie. He is now responsible for making sure that all the houses that were the target of Bughuul or \"Mr. Boogie\" are burned down so that no one can move in. One such house he misses proves too late as a mother and her two twin boys have moved in to get away from their abusive father.\n\nCourtney Collins is staying in the farmhouse in order to repair the accompanying church, unaware of the previous family murdered. The sons are in on the history as Dylan is having reoccurring nightmares of the spirits of the missing children visiting him and showing him the Super 8 movies of the murders of the families. His twin brother Zach doesn't seem to care too much, but the brothers and their mother make the best with their hideout. Deputy So & So arrives to warn the family, but can't bring himself to tell them while he gets closer to the mother. Dylan knows that the more he watches, the further time is left.\n\nAs with most sequels, you have to offer something new in order to justify it's existence. Sinister 2 tries to add a few more elements, but they are all for the worst. First of all, why have the ghosts debate about which sibling should be the one to make the movies? Wouldn't it make sense for the bogeyman to have already chosen the kid and set him in stone. Second, why bring in an abusive father figure as a villain. In horror movie, the monster is usually enough as a villain.\n\nFinally, they make the mistake of showing the spirits that are communicating with children. It tries to come off like Children of the Corn, but rather then showing creepiness, they seem more ready to go to a local kids TV show. Nothing about them scared me.\n\nAs with the victims, none of the family members are interesting. It's just stereotype farm mother and a conflicting tough son and sensitive son. That's pretty much it for them. Deputy So & So is not interesting enough of a character to get his own movie. The one element that almost works is the Super 8 footage, but even that gets a little over the top.\n\nI'll give this two burning farmhouse out of ten. As far as I'm concerned, I only view Sinister as a single movie, like Halloween, Exorcist, and Friday the 13th; all fine horror movies that didn't need a continuation. This is a definite skip."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "gingersnap0974",
        "review_rating": "10",
        "review_title": "Terrific-Must See",
        "review_detailed_main": "I loved the first one and the second one is great as well. I believe the rating may be lower only because it is more disturbing and the snuff films are awfully hard to watch. Anyhow, I am just blown away by both movies. This movie was fantastic. If you truly appreciate horror movies this will satisfy you.The second one is consistent with the first movie. I actually do not recommend seeing this movie if you have not watched the first. Do not watch this movie if you do not like being frightened and disturbed, if you do on the other hand you will LOVE it!!!! It truly is one of a kind. I rank it up there with The Conjuring and Insidious. I do believe other than The Conjuring I've never watched a scarier movie and it takes a lot. The movie did a great job, I wasn't disappointed whatsoever. I hope for a Sinister 3."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "rprice01",
        "review_rating": "6",
        "review_title": "A Decent Horror Sequel",
        "review_detailed_main": "I felt that this was a decent movie. It gave a little more insight as to what was going on with those videotapes from part one and more insight as to what the \"Sinister\" entity is all about. But if definitely had some very slow parts too. Around the middle, I found myself wanting the movie to pick up its pace. . I say that if you are a huge fan of \"Sinister\" 1 like me, this may be an interesting addition to the franchise, but if you are new to it or looking for something really scary, you may want to wait and see this on video... The movie was not that bad. It had some disturbing scenes,, but I can't say that it was awesome either."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kinwingwu",
        "review_rating": "1",
        "review_title": "super 8mm colour Kodachrome processing was stopped in 2010 by KODAK!!!",
        "review_detailed_main": "An interesting update of Japanese horror with films like 'Ring' and 'Fatal Frame' video games.\n\nOnly If this film was made before 2010 then its plausible, but Kodak would have by protocol alerted the appalling images to the lab manager who would have immediately have contacted the local police dept or FBI if the quality control technician would have checked the footage before dispatch during the two week turnaround time of processing Kodachrome 8mm, as I'm an ex-processing technician we were constantly alert and confiscate film that contained alarming images and report it!\n\nWished I didn't know this, but its like NASA shows Michael Bay 'Armageddon' to its new employees to see if they notice all 168 scientific errors!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "FlashCallahan",
        "review_rating": "3",
        "review_title": "The Crow looks lost......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "fedor8",
        "review_rating": "",
        "review_title": "Boogeyman kills in a very roundabout way.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "bilaltat",
        "review_rating": "6",
        "review_title": "Same of the first one",
        "review_detailed_main": "The movie does not bring some new content, new plot or new development that fix or enhance the content. However, it keeps the same theme again and again. Has all pros of first movie but it is the same. 6/10"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jacobjohntaylor1",
        "review_rating": "1",
        "review_title": "It is to easy to scary kids these days",
        "review_detailed_main": "I am 32 and I have see a lot of horror movie from the 60's and 70's and 50's and older. It is a good thing they do not make horror make like they used to. It is good thing they don't make them like they were in the 80's and 90's. Because if this is all it takes to scary people now it is probably better they do not see old horror movies. The story line in this movie is awful. This is best Sinister movie and it is total crap. I think if a horror movie gets 5.3 it could be king of scary. But this is not ever a little scary. 5.3 is just overrating it. This movie has an awful ending. Do not see this movie. It is not scary at all. Do not wast time and money. Do not see this awful movie."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "rafaelrdm",
        "review_rating": "6",
        "review_title": "Not as bad as people claim",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "georgieramone",
        "review_rating": "1",
        "review_title": "Sinister poo",
        "review_detailed_main": "I work at a cinema and me and a friend watched this after hours. Sinister 2 is one of the worst movies I've seen this year and its definitely worthy of 4% on RT. The main character guy was lame as hell, seemed like he had autism, kids were annoying and bad actors, the mom was a bore, step dad was a over the top, and the monster looked like Michael Jackson wearing a Slipnot mask. The movie was like an accountants idea of what a profitable horror movie is, they take a little from as many successful franchises as possible... Children Of The Corn, Paranormal Activity, Saw, Insideus, etc and mixed them together into a s**t stew. The plot was straight up ridiculous, a bunch of nerdy ass ghost kids who wanna watch snuff films with you so that you get desensitized to the violence and kill your family. WTF? Why did the kids even need to be ghosts? in fact if this was an original movie that might have been a half way decent premise to make a story about a group of real kids who discover they're dads snuff film collection, go insane, and kill they're families. Maybe that was the original premise and they decided to make it a Sinister movie instead because sequels make so much more money. Sinister 2 relies almost entirely on jump scares with the occasional found footage torture scene involving characters we're never introduced to, so whats the point. I can go on and on about this atrocity of a movie but i'm tired... Don't support crap like this please, otherwise studios will keep making them."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ripsmoke",
        "review_rating": "1",
        "review_title": "This movie sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "timmitpierce",
        "review_rating": "8",
        "review_title": "WOW,Finally a good film",
        "review_detailed_main": "I'm a huge Ethan Hawke fan and I thought the first one was just o.k.I had low expectations for this one going into it.I'm so glad I went to go see part #2. It had everything.It reminded me if CHILDREN OF THE CORN and THE NIGHTMARE ON ELM STREET had a baby. It shocked me that so many critics trashed this one. I'm not easily spooked,But this one was creepy....Ignore the critics and go see this one.Unless you like the same boring movies like the AVENGERS part 4,Really? How many are they going to make? 20? I used to always take critics reviews into consideration before going to see a movie,But not anymore. The trashing of SINISTER 2 from critics is going to make me not to listen to them ANYMORE till the day I die. Yeah I agree that some people might not care for this movie. To each his own,But to trash it? I enjoyed it a lot and so should you if you're in the mood for something different rather than the thousands of action movies where the main character beats up 100 guys and walks away without a scratch."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "somlaign1",
        "review_rating": "1",
        "review_title": "Worst Movie Ever. I'd rather burn my money.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "HandsomeBen",
        "review_rating": "5",
        "review_title": "Not as Dark as the First",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "AlfieTimewolf",
        "review_rating": "7",
        "review_title": "Actually Not That Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "Sinister 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kimheniadis",
        "review_rating": "7",
        "review_title": "Pretty good for a sequel.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "artieup-570-920707",
        "review_rating": "5",
        "review_title": "Where Have Scary Movies Gone?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "twelve-house-books",
        "review_rating": "6",
        "review_title": "Better Than the First One",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "LincolnSixEko",
        "review_rating": "3",
        "review_title": "Garbage.",
        "review_detailed_main": "First film had some genuinely creepy stuff going on. This movie is more focused on the child actors which is usually always a bad sign. Cheap jump scares and a dumb ending."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dhainline1",
        "review_rating": "8",
        "review_title": "Mr. Boogie and Deputy So-and-So are Back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "budgetbabecouture",
        "review_rating": "7",
        "review_title": "Pretty Good",
        "review_detailed_main": "Honestly, I thought that this one was better than the first. (I know not everyone agrees on here.) I thought the tapes were better and the children had a good creepy feel to them. My biggest complaint was how in the world did they get tied in the cornfield? I shouldn't have to ask it should have showed us. What I liked so much about this movie is instead of your typical jump scares this movie was provoking a different type of fear from the inside out. Meaning if you are focused and are really think about and realizing what is going on with the tapes it is creepy. It also has a completely creepy undertone throughout that you also never see with many horror movies. Instead of just having some creepy moments the entire movie has creepiness running throughout the background."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "epiceffectss",
        "review_rating": "3",
        "review_title": "None of the charm of the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "queentulawanda-07689",
        "review_rating": "1",
        "review_title": "What the hell?????",
        "review_detailed_main": "The first Sinister movie wasn't very scary, but this was just awful!!! Just gross torture scenes - no plot, per se, just mindless torture scenes of pain, blood, and screams. The horror movie has DIED. No one knows how to make a good one, anymore - they think gross-out movies are horror; they're not. The characters her just wander around from scene to scene, never accomplishing anything. Explanations don't exist and without good lines to explain the plot, it's just a waste of time. Don't bother. It's 2 hours of your life that you'll never get back!!!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "parry_na",
        "review_rating": "7",
        "review_title": "Spoilers follow ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "elaeitan",
        "review_rating": "1",
        "review_title": "DO NOT WATCH THIS MOVIE",
        "review_detailed_main": "Are you looking for a movie with no plot, actors who play like they just started acting school and about to fail all of the classes, CGI thats worse than the app that you got on your 2005 nokia phone? This is the movie for ya. Enjoy. Literally, worst movie I have ever watched by far."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "forpassord",
        "review_rating": "6",
        "review_title": "An improvement!",
        "review_detailed_main": "I found the first movie to be mostly boring and predictable. This movie seemed to be even more predictable based on the beginning. But it quickly turned out that this movie actually used a new perspective, and thereby added a new layer to the story.\n\nCompared to Sinister, I actually found this sequel to be more interesting and less predictable, and it gave me at least one jump scare. In my eyes the first Sinister was mostly a murder/crime mystery for a long time, and barely deserved the label horror movie, if it deserved it at all (since I did not find it scary). But this sequel is at least a little bit frightening at times.\n\nAll in all: If you liked the first movie, watch this one as well. For me, this movie was something as rare as a sequel that was BETTER than the predecessor..."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "chmchugh",
        "review_rating": "3",
        "review_title": "Not awful",
        "review_detailed_main": "It's a decent horror movie and I'd give it perhaps a star more but the lead actors hair doesn't move the entire time and quite frankly the acting.........."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "cardinalsfan27",
        "review_rating": "6",
        "review_title": "Solid movie with a let down of an ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "851222",
        "review_rating": "3",
        "review_title": "A joke rather then a movie",
        "review_detailed_main": "Greetings from Lithuania.\n\n\"Sinister\" 2 (2015) is one of the worst horror movies i saw in many moons, and i love horror films, watch tons of them no matter how small they are. \"Sinister\" was one of my favorite (if not the favorite) horror movie in like 5 last years, it was that good, creepy horror picture. Sequel on the other hand is a joke, it is barely a movie at all.\n\nWhen you watching a movie in which children are doing these unimaginable things, it's one thing. The other thing if you look more closely, it is not possible by any means for kids to create such a situations, like hanging 4 adults upside down over the three over the river? Seriously? Who did this, that not creepy looking ~7 years old ghost girl? It took away any sense of creepiness when you know it is absolutely impossible to do this, and that looses any sense of dread or whatever. Or putting 3 crosses in the middle of field and putting 3 people on them including two adults, how did he did it? It is beyond any ludicrous stuff i probably ever saw in a movies before. I know this is a movie, but it has to have at least a bit of plausibility. \"Sinister\" 2 doesn't have any of it, nor it is scary. Script is terrible, as the whole movie.\n\nOverall, \"Sinister\" 2 is an insult sequel to the superb first movie. Skip it, avoid it by any means, i regret the very dragging 1 h 30 min that i invested in seeing this pile of garbage."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "lewiskeeffe",
        "review_rating": "8",
        "review_title": "Forget the last 10 seconds and it is the perfect sequel.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "pal05052003",
        "review_rating": "7",
        "review_title": "Deputy So and So seeks to investigate the mysterious deaths of families and stop the evil force behind it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jonnytheshirt",
        "review_rating": "4",
        "review_title": "A difficult act to follow",
        "review_detailed_main": "The First movie stood out due to the riddle and suspense however once that is gone there is little left for a sequel. The cast are decent enough with the Deputy and Mother quite watchable and the two kids are pretty good, even moments of humour are well received. The movie like many Blumhouse productions also looks smooth however the script just falls flat at times with rather silly side characters and all the incidents involved with the suspense and fear being rather terrible, the scares were pretty laughable and most certainly the premise of horror near the movies third act pinnacle was entirely ridiculous. I did want to like the movie being a fan of the first however I'm afraid this gets the thumbs down despite a good effort."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "samgiannn",
        "review_rating": "2",
        "review_title": "Recycled scares and a laughable script plague \"Sinister 2\"",
        "review_detailed_main": "When I had originally heard that there was going to be a sequel to Sinister, one of my favorite horror films, I was pretty excited to say the least. Then, early spring this year, the first official trailer was released. I suddenly felt less enthusiastic about the movie, but I still held on some hope that it could be a decent follow-up to the original, until I finally saw it tonight. I read the signs but ignored the warnings, and my punishment was an astonishingly disappointing sequel. Sinister 2 takes place some time after the events of the original film and follows Deputy So And So (that's seriously how he's credited in the film). He has become obsessed with tracking down murders and child abductions that could be linked to an ancient pagan deity named Baghuul, who coerces a child into killing their family and takes the child's soul. It leads him to a farmhouse near the site of a mass murder in a church which he expects to find empty. When he arrives at the house, So and So sees that a mother and twin sons have already moved into the house, and one of the twins is the subject of midnight show-and-tell with the ghost kids' kill tapes. From the first ten minutes, I noticed that something felt terribly wrong about this movie. Deputy So and So was nothing more than comic relief in the original film, and, outside of the big plot twist at the end, he can hardly carry more than a scene by himself, let alone an entire movie. While he is a generally likable character, Deputy So and So just isn't cut out to carry an entire film by himself. His character actually made the movie funnier than it was scary, and there was very little to be afraid of in this movie. If you've seen the trailer, and I'm not exaggerating, every single scare is spoiled in the trailer, and there aren't any surprises left for you. It seems like the filmmakers thought that showing Baghuul off as much as possible could make the sequel scarier than the original, but what made the original so terrifying is that Baghuul was just a shadow in the back of the tapes. You rarely saw him for more than just a glance, and it was scary as hell. In Sinister 2, however, you can practically count the buttons on his black overcoat because he's shown so profusely throughout the movie. Along with a ridiculously over-the-top abusive husband side plot, a weak script and bland direction, Sinister 2 is one of the biggest disappointments of the year for horror."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "shiman_king",
        "review_rating": "6",
        "review_title": "Poor Boogeyman",
        "review_detailed_main": "Simple review of the movie:\n\nVery poor acting from the Ex-duputy (James Ransone) and Shannyn Sossamon. For the most of the movie, their conversations, were just awkward and cringy, it might be because of a poor script, but still: Very poor acting. The kids in the movies did quiet well, and the movie has a lot of cool shots, but once again ... I want to see more of Boogeyman. I want to know more about him, than we did, I want to see him do something and not just pop up, and jump scare me. It's a creature and character, you can do so much with. He's mysterious, scary and powerful but we end up seeing so little.\n\nThis movie doesn't live up to the first one, but I got to give credit where credit is due. The home movies were the main spot of the movie. The acting, the script and so on was horrible, I would still end up giving the movie a solid 6 out of 10, because of the home movies and music. This was the drive of the movie.\n\nTL;DR Don't have big expectations, poor acting, poor script but still has some of its charm from the first one."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "SusieSalmonLikeTheFish",
        "review_rating": "5",
        "review_title": "Boys, when I say \"rutabaga\", run out of the supermarket!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "bjornrhein",
        "review_rating": "6",
        "review_title": "Better than the first",
        "review_detailed_main": "So I guess the same clowns who thought the first was 10 stars is the same who rate this with 1 star, sure the first was an ok movie but it was bad acting, annoying sounds in the background and the ghostchildren looked like they came home from a halloween party\n\nThis movie is good acting, better story and great jumpscares, so yes I think this is a better movie and not agree with the people who dont think this is creepy because it is\n\nYet its not blow you of the chair, not sparkle, its just a good horror movie, but it has some children of the corn vibes and some extra spice perhaps would have helped , but it is what it is, a good horror movie nothing more nothing less."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "LeonLouisRicci",
        "review_rating": "1",
        "review_title": "Irresponsible and Troubling Sequel with Nothing to Recommend",
        "review_detailed_main": "There is a Difference between Reality Disturbing and Movie Disturbing. Children Doing Evil Things to one another and Evil Things being Done to Children can make its Cinematic Concern in Small Doses, but when that's all there is for most of the Running Time, it's Troubling.\n\nThe Entertainment Value is Sucked from the Screen from the Weight of the Baggage connected to the Real Life Trauma of Domestic Violence, Battered Women, and Abused Children. When Served up for Commercial Consumption, it is Irresponsible and Immature.\n\nThis is Assembly Line Movie Making. A Thoughtless, Lazy Production with Insensitive Hubris that Talentless People Exploit as Cutting-Edge.\n\nThe First Film was Interesting and Horrific without being Brain Dead. This is just Hackery and there is Nothing here to Recommend except to the most Undiscriminating, Callous, and Numb Horror Movie Fans."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "pzct",
        "review_rating": "6",
        "review_title": "It is Sinister!...for the last 30 minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "snowbound-93313",
        "review_rating": "1",
        "review_title": "-10/10 would not watch again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Shelpa",
        "review_rating": "8",
        "review_title": "A really strong sequel",
        "review_detailed_main": "I'm a big Ethan Hawke fan and I think he really shines in scary flicks. Sinister was creepy and original so I wasn't sure what to expect from the sequel.\n\nI was pleasantly surprised and really enjoyed how this followed on from the first. I love the character of the deputy played by James Ransone and the rest of the cast was just as strong.\n\nWhat also helped hold this movie together for me was the way they continued the style of the 'home movies' and the fact that they bough to life the characters of the children.\n\nI would recommend you give this a watch but make sure you watch the original first if you haven't already."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "authorbrycecarlson",
        "review_rating": "7",
        "review_title": "I will keep this short and sweet.",
        "review_detailed_main": "The first one was pretty good, this one was also all right, but definitely not on par with the first. The title is \"Sinister\" in which the first one was also described as \"Sinister\", this one was \"Sort of Sinister\".\n\nThe videos and found footage were intense, but the rest, meh. Still a fun series to stay up to date with. Hopefully a sequel, but I want it to go back to it being more Sinister."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "zheng-qin-bj",
        "review_rating": "1",
        "review_title": "Fairly speaking, this is one of the worst horror sequels I've ever watched",
        "review_detailed_main": "I love the first Sinister, like everyone of you, so there is nothing stopping me from going to the theatre for the sequel, regardless of my painful experience watching some horrible horror sequels to those marvelously first installment of the story. Come to think of it, Paranormal Activity 2 and most of the Saw sequels are probably the only sequels that exceeded my expectations. But Sinister 2 is definitely not PA2 or Saw2/3/4... The story is too straightforward, it's actually quite difficult to write a story without any twist, isn't it? They have managed to do it. The acting is pale, I don't think anyone in this movie knows how to play their role, even the ghost kids this time. What else... oh yeah, I watched this movie last night, with other dozen of people in the theatre. 6 of them walked out before the hour mark. I seriously want to give this movie a zero."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "sauravjoshi85",
        "review_rating": "3",
        "review_title": "Slow, Boring and Dull.",
        "review_detailed_main": "Sinister 2 is a supernatural horror film directed by Ciarán Foy. The film stars James Ransone and Shannyn Sossamon.\n\nA young mother, and her twin sons move into a haunted rural house and start experiencing a string of supernatural occurrences.\n\nThe film is squeal to 2012 film Sinister.\n\nYou should watch this film only after you've seen the first part to understand the film better.\n\nIf Sinister was creepy and scary then this film is dull and boring. It seems that the makers were more interested in cashing the name of the first film instead of working on the proper script.\n\nThe plot of the film is similar to the first film and the film moves forward where the first film ends but the execution of this film is poor and dull. The film doesn't have many scary scenes and the limited scary scenes irritates instead of make you scare.\n\nActing in the film is average and screenplay is slow and doesn't keep the viewers engaged, the climax of the film is average and doesn't excites much.\n\nFor me this is a boring, slow and dull film."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "alesia-jenkins87",
        "review_rating": "6",
        "review_title": "Not what I expected.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Reviewenstein",
        "review_rating": "2",
        "review_title": "Not Just Bad, Morally Idiotic",
        "review_detailed_main": "There's a lot badness in here, but it'd be pretty overlookable if the movie's moral compass weren't so skewed. It's clearly a completely different creative vision than the first one, and it makes some baffling storytelling choices, but for the most part it works until the final act. After that it degenerates from a classic spookfest into a pointless, inconsistent, sexist, hateful, and generally misanthropic hack job with delusions of significance. This is a franchise killer of a movie, and the fact that anyone still has to pay to see it this long after it was vomited into existence is a crime against cinema."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "rlaine",
        "review_rating": "7",
        "review_title": "Not quite as bad as the reviews and score say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "prestjohnwick",
        "review_rating": "1",
        "review_title": "It tries to scares us at the end, it didn't work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "mcollins-72625",
        "review_rating": "1",
        "review_title": "Disappointing!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "thepreston-46818",
        "review_rating": "8",
        "review_title": "Brilliant Wrap Up For Franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "zardoz-13",
        "review_rating": "1",
        "review_title": "Sucks 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "burnham-42353",
        "review_rating": "4",
        "review_title": "Sinister 2",
        "review_detailed_main": "Sinister 2 is a sequel to the 2012 sleeper hit Sinister starring returning actor James Ransone as deputy So and So. What made Sinister so scary and disturbing is all but gone in the sequel. Sinister 2 picks up with So and So trying to stop Buhguul's reign of terror and while doing so runs into a family on the run from their abusive father. Sinister 2 lacks the scares and uneasiness felt by the first film. Starting with the snuff films though more gruesome and elaborate in Sinister 2 somehow aren't as disturbing as they were in Sintister as is Buhguul, where as you only caught glimpses of him in the first film he is front and center here (as are the children) taking away what made him so frightening in Sinister. In short Sinister 2 is a very, very disappointing sequel to a great horror flick. 4/10"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jp_91",
        "review_rating": "5",
        "review_title": "Dissapointing!",
        "review_detailed_main": "Meanwhile \"Sinister\" (2012) was one of the best horror films of the 2010's, a creepy film, this sequel is a great dissapointment, the script was stupid and not scary at all, the cinematography is cheap and the film locations not that good for a horror film. The jump scares are bad, obviously that was the worst mistake of the film, a good point is Shannyn Sossamon's acting. A bad sequel, a real flop!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "modernmonstersdotnet",
        "review_rating": "3",
        "review_title": "The Right Snuff",
        "review_detailed_main": "A \"What's down there?\" format with blatant but still mainstream pedophilia, Sinister 2 follows two conflictual twin brothers, one being a pussy and the other an alpha male, so any educated viewer won't have any major problem discerning which one is the ghost and which one is not.\n\nAs a way to put things in motion, some Children of Super 8 Corn Film Club cult has established base camp in the twins' basement and its members each in turn shows snuff movies of their family demise. We are shown a fishing trip and a Christmas morning, by which we are led to understand that \"the murder are captured through Art\". Art doesn't in any way improves the twins relationship, their mild humiliation turning to domination/submission; \"F*** you, c***!\", says one 10 year old to the other. This is as close as bromance as we will get.\n\nBut ah, the Art. Who the hell is editing the home movies, by now showing an elaborate brasero involving rats and entrails? How the hell can we think that Dad is not abusing his son(s), creating the Bogey Man who says \"Boys have to eat\"? And, ahem, eat what exactly, Dad? I mean, if I may ask?\n\nAs for a finale, New Kid on the Snuff painstakingly recreates the pre- title sequence as if no one told him that it has been done again, not better but the same, nevertheless proving that a 10 year old boy is able to crucify his family, setting them on fire, then attempt to finish them off with a scythe while filming/editing. Up yours, Orson Welles.\n\nSome telekinetic and nonsensical jump scare end ensue. Apparently Evil comes from Norway. Well, rutabaga."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "tomasctinoco",
        "review_rating": "3",
        "review_title": "As boring as can be.",
        "review_detailed_main": "This film completely derailed a promising franchise. Too heavily inspired by The Children of the Corn, slow, flat, boring, no suspense, no thrills. Just a poorly crafted film with a almost non existent plot, and weak direction."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "shelbo7861",
        "review_rating": "8",
        "review_title": "Not as bad as others say",
        "review_detailed_main": "Honestly I found it just as good as the first one. I love how they continued to develop the story. It's very disturbing and slightly graphic as is the first one which at times I have to remind myself that it's not real cus it's so freaking creepy to me. But I think both sinister movies were highly original with excellent acting and I like the ending of this one more than the first at least it kinda made me feel better at the end"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "matthewjcclarke",
        "review_rating": "4",
        "review_title": "Tripe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "strike-1995",
        "review_rating": "3",
        "review_title": "One lime",
        "review_detailed_main": "Without the nuance and subtlety of the original. It never required a sequel."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kamalbeeee",
        "review_rating": "4",
        "review_title": "Once watchable",
        "review_detailed_main": "Really i would watch inspired by first sequel...but really disappointed the story plot eventhough i got scared some of the scenes.its predictable story and worst screenplay...but i can suggest you for timepass with popcorn..."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "FeastMode",
        "review_rating": "3",
        "review_title": "my notes",
        "review_detailed_main": "Pretty pointless and dumb. not scary other than a few startles (1 viewing)"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "parkerbcn",
        "review_rating": "3",
        "review_title": "Only watch in you enjoy bad movies",
        "review_detailed_main": "If you watched the first film and you liked it, please don't watch this (unless you enjoy bad movies!). At least it's useful to show the things that the first movie did right (like create the correct atmosphere and tension) and even when there is no horror here (just cheap tricks) I was more or less invested with the relationship between the character played by James Ransone (the only one that returns from the first film and one of the best characters there) and the one played by Shannyn Sossamon, until the last quarter of the movie when character development became secondary and we go full throttle into the \"grand finale\"."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "reddosmedy",
        "review_rating": "10",
        "review_title": "One of the best horror movies I've seen!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Seraphion",
        "review_rating": "4",
        "review_title": "Not that good at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "alphafillo",
        "review_rating": "3",
        "review_title": "Huge letdown, definitely NOT like the first Sinister",
        "review_detailed_main": "I had high hopes coming into this movie but what a bore...Horrible acting by all the children AND adults, maybe one \"scary\" part in the whole movie. The trailers showed almost everything. I don't get why they take great initial horror movies and make awful sequels. I love horror movies too but just no..Expected more... we need more Conjuring, First Sinister, Inisdious Movies-they are by far the BEST! We definitely need more James Wan films, that man knows horror. PLease do not waste your time and hard earned money on this film.....go watch insidious on netflix or rent conjuring or the first sinister if you haven't seen it yet"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Alanjackd",
        "review_rating": "4",
        "review_title": "Not bad",
        "review_detailed_main": "Well....having not seen the first movie I decided to catch this anyway.\n\nNot what you might call a bad or scary movie, it just repeats what a lot of so called horror movies do.Faces flashed in front of your eyes...horrible kids....very bad man with scary face...reflections in glass and all that stuff. Nothing here we haven't seen a million times before,\n\nProbably would have been better as a stand alone but I think it was just using the name .\n\nVery well filmed as well and fair acting( though not Oscar nominations). About as scary as a very fluffy kitten.\n\nProbably another sequel in 18 months."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Prasil15",
        "review_rating": "4",
        "review_title": "Mediocre",
        "review_detailed_main": "Sinister Part 1 was one of the finest, well written, well executed and well performed horror movie. So, the expectations from Sinister 2 were bit higher. But it couldn't meet those. There was nothing exciting about this one. The story was too weak. It was a joke for the horror genre and Sinister franchise. I felt that the movie could have been a way better, but the movie drastically fall from initial only. There was no exciting moments, no horror content, and more importantly no story, like Sinister 1.\n\nIn a nutshell, this one is a hug disappointment for the genre as well as for the franchise too."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "marc5477",
        "review_rating": "5",
        "review_title": "Lets all run away from the 10 year old with a sickle... yeaaaa no.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "flitz35-633-627650",
        "review_rating": "10",
        "review_title": "A truly scary movie!",
        "review_detailed_main": "I still try to figure out why professional movie critics judge a movie based on who was involved in creating it. My only guess is to prevent the movie from making money so other movies can. That's why I take movie reviews as serious as the Easter bunny. Sinister 2 scared the heckler out of me from the first scene. I kept my interest while biting my nails the entire time.\n\nThere are to many bad horror movies out there to throw a good one away. If your a horror movie fan and like a good story we'll this one will shock you especially after reading the dishonest, greased up palms review from individuals who make a living on trying to persuade the public whether to see a movie or not. This is a good one."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "AvionPrince16",
        "review_rating": "3",
        "review_title": "So awful and boring than the first one",
        "review_detailed_main": "The first movie was good and have some pretty good moment of scare but this one is so cliché and have so little scare and even none. The little boys are annoying and the whole story about watching movie for bagul was clearly boring. We just watch a movie without any surprise or revelation. It have a love story but it s so cliché and stupid, it dont have any complexity. The end didnt scare me at all. The movie was so cliché of each part: story, characters that it make this movie annoying and not very believable. Disappointed."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "cezbanbelubo",
        "review_rating": "2",
        "review_title": "Sequence horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "charlesjgallagher-93392",
        "review_rating": "4",
        "review_title": "It's not like the first movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "tpkrause1",
        "review_rating": "4",
        "review_title": "Tries too hard.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ChristinaBarrett-USA1986",
        "review_rating": "1",
        "review_title": "A great big daunting film which ruined me in more ways than 1.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "leahdragon",
        "review_rating": "8",
        "review_title": "Unpopular opinion!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "xmjhrt",
        "review_rating": "1",
        "review_title": "Hot Garbage",
        "review_detailed_main": "Perfect way to make sure you end a potentially decent horror series."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "sofiaemma-16714",
        "review_rating": "1",
        "review_title": "Bad horror movie ever",
        "review_detailed_main": "We just lost 2 hour's of our life watching sinister 2. Maybe, if we'd watched sinister 1, we'll make sense with this one, but absolutely this was the worst horror I've ever seen and I've watched a lot. Please don't make sequel movies which don't make any sense if you haven't watched the first."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "CleveMan66",
        "review_rating": "5",
        "review_title": "\"Sinister 2\" is almost as sinister as the original.",
        "review_detailed_main": "Horror sequels are tough to make. You have to be able to scare your audience without the benefit of the original film's novelty. You have to duplicate (or improve upon) what made the first film successful, while adding fresh elements – and those new aspects have to make sense within the world created by the original. It's also important to maintain a consistent tone from the first film through the second. As the follow-up to 2012's \"Sinister\", the sequel \"Sinister 2\" (R, 1:37) does at least some of that stuff well.\n\nDeputy So & So (which is the only way his character is identified) is played by James Ransone, the only returning cast member from the first film, but now he's ex-Deputy So & So. The sheriff fired him for (in the first film) secretly helping writer Ellison Oswalt (Ethan Hawke's character) to investigate a series of grisly family murders. So & So now knows what the Oswalts learned too late: The ancient evil spirit Baghuul can possess children who view his image and then make them murder their entire families.\n\nIn these cases, the children even film the murders with an old 8mm camera, making home movies of their crimes. After the murders, each young killer-filmmaker disappears into Baghuul's realm, only to reappear in visions and entice other children to follow their example. Every time a family murder is committed, the next family who lives in that house ends up slaughtered by one of their children – soon after moving out of the house. So & So is attempting to break these cycles by torching the unoccupied houses where such murders occurred.\n\nSo & So is making progress, until he shows up at another cursed address for some proactive arson, only to find someone secretly living there. Courtney Collins (Shannyn Sossamon) is hiding from her estranged husband, Clint (Lea Coco). (The house is owned by the father of a friend of Courtney's, but has been for sale since a heinous family murder took place in an old church on the property.) Courtney is temporarily living in the house with her twin sons, Dylan (Robert Daniel Sloan) and Zach (Dartanian Sloan).\n\nZach is aggressive, like his father, and picks on Dylan mercilessly. Dylan is more sensitive and has suffered physical abuse at the hands of Clint – in both situations, like his mother. Dylan also has nightmares. Ghostly children, led by Milo (Lucas Jade Zumann), who committed the unusually creative and ritualistic murders in the church, come to Dylan at night. Milo insists that Dylan come down to the basement and watch each child's \"home movie\", promising him that doing so will cure him of his nightmares. That sounds like telling a drunk to take a shot of whiskey to sober him up after he drinks a 6-pack of beer, but Milo's \"solution\" does seem to help the reluctant Dylan\u0085 for a little while.\n\nCourtney knows what happened on the property and ex-Deputy So & So seems like a decent guy, so she lets him poke around the old church. So & So makes successive visits and comes to care about Courtney and her sons, especially the troubled Dylan. So & So helps the family in their efforts to stay free from Clint. He also warns Courtney not to leave the house when he has to go out of town to visit with a young college professor (Tate Ellington) who has some new information about the Baghuul-inspired murders. You may think that you know what happens next, and you may be partially right, but the way this story ends has a couple twists that you probably won't see coming.\n\n\"Sinister 2\" isn't as scary as the original, but does a decent job at following it up. The plot fits nicely into its predecessor's storyline and builds well on the folklore established in the first film. The scares are harder to come by in this one, but the kids' movies are every bit as scary and disturbing. The acting isn't great and the mood is a bit too light at times, but this sequel adds enough that is original (especially in the third act) to please fans of \"Sinister\". \"Sinister 2\" gets a \"B-\"."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Allierubystein666",
        "review_rating": "5",
        "review_title": "Shameful Sequel",
        "review_detailed_main": "Yet another pointless horror sequel, Sinister 2 squanders what the first one conjured up, providing less scares, less originality, and less of a coherent plot and direction to go off of. I am a huge fan of the first Sinister film, so believe me when I say that this one is nothing but a grand disappointment. The sad thing is that it did have some things working for it, although the potential it had was often futile in the hands of the writers and director who made this film. There are a few interesting little things in the film. There is some good tension towards the end, some new information that comes to light, and a new point of view. However, none of it feels even with the rest of the film. The biggest mystery of the film is how the first film went from making something so horrifying, to something rather dull and predictable. There are far too many jump scares throughout the film to provide for any real frights, and although it does provide for some intense moments, the family narrative throughout can feel a bit generic and worn down- a situation we have seen far too many times in film, and in horror in general. The performances are okay, but many of the lines justs seem to awkward for any actor to perform, and it becomes its worst when they take them so seriously. Its cinematography is grim and awfully uninspired, and its direction is honestly quite horrible. It goes to show not only how good Scott Derrickson is at directing in the first film, but also how pitiful an film experience can be without a vision to guide it. In the end, Sinister 2 is a misfire, and is rather unforgivable. A few cool moments can never make up for what could have been an outstanding franchise, and it really is a shame the series had to die this way.\n\nMy Rating: 4.8/10."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Stevieboy666",
        "review_rating": "5",
        "review_title": "Time to call it a day for the Sinister franchise",
        "review_detailed_main": "Sinister did not live up to the hype for me and so I had little hope for this, it's sequel. What's with this supposedly scary demon in these films? It's just some guy wearing a rubber Halloween mask, I've seen scarier looking members of Black/Death Metal bands than this! I liked the idea of young brothers Dylan and Zak being made to watch shocking home movies by their ghostly friends. The developing relationship between their mother and the investigator was interesting. All of the acting was good. And I liked the obvious Children of the Corn homage. But the fact that it fails to be a scary horror film let's it down, and I certainly will not be getting excited by the thought of any more sequels."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ericrnolan",
        "review_rating": "9",
        "review_title": "\"Sinister 2\" is freaking' frightening!",
        "review_detailed_main": "For the life of me, I cannot understand how \"Sinister 2\" (2015) is getting such bad reviews. It's a well made, terrifying horror movie that actually exceeds the 2012 original, which itself was superb. I'd cheerfully give it a 9 out of 10.\n\nThese films have a hell of a story setup. I won't describe it in detail here, to avoid spoilers for either movie. Suffice to say, it is disturbing, even by horror movie standards. If your standard fare is disposable slasher flicks, bump-in-the-night ghost stories, larger-than-life survival fantasies like zombie movies — beware! This film take it up a notch. (As Nigel Tufnel once expounded, \"This one goes to 11.\")\n\nThe movie depicts a demon who is responsible for the ostentatious, ritualistic murders of entire families. If that isn't bad enough, his exact modus operandi is \u0085 gut wrenching. I can't imagine what kind of pathological muse spoke to screenwriters Scott Derrickson and C. Robert Cargill in coming up with this s@#$. Yeesh!!!\n\nI actually thought this was much scarier than the first \"Sinister.\" (A caveat — I'm pretty sure I'm alone here; it seems like nearly everyone else panned this movie.)\n\nFirst, the demon's sickening systematic methods here are examined in detail. (The first movie worked as a mystery, in which these methods are gradually discovered by an investigative journalist.) We examine in greater depth the 8MM film strips that serve as a story device. (I don't think I am revealing too much here, as they are shown in every ad for the movie.)\n\nSecond, we have a protagonist here that we can actually care about. It is none other than \"Deputy So-And-So\" (nicely played by James Ransone), the supporting character from the first film, who turns out to be a surprisingly likable anti-hero. He's got character and charm that Ethan Hawke's arrogant true-crime writer utterly lacked in the first movie. (It was the screenwriters' fault, not the immensely talented Hawke's, by the way.) We've got a nice guy that we can care about and root for. The imperiled family here is also more likable; the writer's family in \"Sinister\" was portrayed in little depth.\n\nSeriously, this is a highly disturbing horror movie, if that's what you're in the mood for. The \"Christmas morning\" scene really got under my skin. My fellow horror fans might skewer me for saying this, but it scared me as much as anything in \"The Shining\" (1980). It \u0085 just \u0085 YEESH, man!!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "eberkerbatur",
        "review_rating": "5",
        "review_title": "Sequel is not good (5.4)",
        "review_detailed_main": "It was a very bad sequel to be honest I didn't like the first film anyway, but the first film it was more scary.\n\nPretty horrible story as a subject really creeps and the first film actually succeeded but the sequel fails so much about it of course, the continuation of each film is a bit worse.\n\nThe only thing i love in this movie is the first movie with a nice connected other than that it was a simple and unsuccessful film"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Duchino",
        "review_rating": "5",
        "review_title": "Just some good gore and torture porn, otherwise same old fuff",
        "review_detailed_main": "Watched it after a friend told me she was gonna see it after having enjoyed \"Sinister\" (2012), but this one didn't work for me. I remember seeing the first movie, though I don't recall if and how much I liked it, so it probably wasn't that memorable. Besides the beautiful Sossamon, there's little else worth bothering with; while they have done a good job with torture death setups and convincing gory clips, the creep windup is spoiled by the usual cheap scares, goofy makeup and cheesy jump apparitions. 'Never work with animals or kids' – true here, since the ghost gang is neither spooky nor well acting. Skip this and watch the haunting \"The Ring\" (2002) instead, or \"The Babadook\" (2014), which was pretty creative."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jared-25331",
        "review_rating": "1",
        "review_title": "What have you done to Bughuul?",
        "review_detailed_main": "I love Sinister (2012), but Sinister 2 (2015) is one of the worst horror movies of the modern era and one of the worst movies from Blumhouse Productions.\n\nPositives for Sinister 2 (2015): James Ransone, Shannyn Sossamon, Robert Daniel Sloan and Dartanian Sloan give good performances in the movie. That's all I've got to say for the positives.\n\nNegatives for Sinister 2 (2015): Despite Scott Derrickson and C. Robert Cargill writing the script again, it is so obvious that director Ciaran Foy didn't give a crap because he wasn't even trying to make a good movie. The ghost children are now talking and being annoying. Bughuul is constantly showing up and his presence is being made a joke here. The snuff films aren't good, overly violent and ridiculously unrealistic. Shannyn Sossamon's ex-husband is cartoonishly over the top, does nothing and then dies at the end. You also have this exposition guy who is basically a replacement for Vincent D'Onofrio from the first movie. And finally, the movie has a lot of annoying and generic jumpscares.\n\nOverall, Sinister 2 (2015) is an insult to the original and Blumhouse should be ashamed of themselves for this."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dejanmandic",
        "review_rating": "5",
        "review_title": "Disappointed",
        "review_detailed_main": "The first Sinister really made an impression to me (8/10), but this sequel is far from being a good horror movie (5/10)."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "filipemanuelneto",
        "review_rating": "5",
        "review_title": "It's not as good as the first one, but it's still worth it.",
        "review_detailed_main": "As I have already mentioned several times in other reviews, I see film sequels with some caution, knowing that many of them serve only to raise money from the public and do not reach half the quality of the first film. This case is just another one that follows that line. If the first film was very good and worked quite well, this one has turned out to be much weaker.\n\nIn fact, this film repeats, with some nuances, the same formula that we saw in the first one, without the advantage of the element of surprise that worked very well the first time. Once again, we see a house haunted by Bagul, an evil entity that turns children into murderers of their own families. Again, we see an innocent family being victimized by this entity, while a retired policeman, whom we saw briefly in the first film, tries everything to save them.\n\nCiarán Foy assures the direction whereas Scott Derrickson, who directed and wrote the first film, limited himself to signing the script this time. Maybe that's why the film is never as good as the first. It manages to create a tense atmosphere around the house and the evil that surrounds it, but the fact is that we already know what that evil is and what its capable of, so everything that follows is easy to guess. The film has its good moments, there are some scares that work well and make the film worthwhile, but in general it is much weaker.\n\nJames Ransone was good enough in his role and is supported by Shannyn Sossamon, with whom he seems to collaborate quite well and create a convincing chemistry. Robert Daniel Sloan, given his age and inexperience, was very good, while Dartanian Sloan was weaker. At a more technical level, the film closely follows its predecessor, with an elegant and well-made cinematography, especially in the footage that reproduce the home movies. The soundtrack is very good, but it seems copied from the initial film, with slight additions."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "syafrimail",
        "review_rating": "10",
        "review_title": "truly perfect horror movie",
        "review_detailed_main": "I didn't expect too much before I went to the theatre till I sat down and watch the first scene which could make me feel the horror like the first Sinister. Also like first Sinister, scene by scene gives me scary feeling. The plot of this Sinister 2 is also unpredictable just like the first Sinister. And for me, the first Sinister and Sinister 2 are very creative movies that we cannot guess how the ending will be. If you want to watch Sinister 2, I think it would be better if you watch the first Sinister before you decide to go to the theatre to watch the sequel. And I suggest you should be accompanied while watching this, because this Sinister and Sinister 2 are one of truly very creative horror movies."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "MJB784",
        "review_rating": "5",
        "review_title": "It was a cross between a custody drama and horror movie.",
        "review_detailed_main": "I was disappointed. It was just ok. The movie had a few jolts, but it wasn't as interesting because the family was boring and it was also a custody movie about the abusive father taking the kids away from his ex-wife. It was very weird watching both a heartfelt drama about an abusive father and an evil creature wanting to take a child away and kill the family. I realized it's especially hard to make a sequel to Sinister because he's just going to haunt another family, take children and can't die."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "luizfilipenf",
        "review_rating": "5",
        "review_title": "Disparity",
        "review_detailed_main": "Never saw one big disparity between two sequel movies like these... The Sinister 2 looks like a very amateur movie... Very disappointing..."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "gianmarcoronconi",
        "review_rating": "5",
        "review_title": "The same as the first",
        "review_detailed_main": "The problem with this film is that it is practically the same as the first one but with more children and therefore it loses some interest. But it is a lot of fear and even makes it more than the first, really a pity that it does not bring anything new compared to the first."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jeremyfoster-08821",
        "review_rating": "4",
        "review_title": "Not a bad movie. Still not better than the first Sinister",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jobayedahamedjim",
        "review_rating": "1",
        "review_title": "Not good at all",
        "review_detailed_main": "In horror/creepy movies, viewers go through some mysterious thing along with the main characters. It's like something supernatural things are going on and those characters are being confused about the events and viewers get the same feelings like what is happening, what's going on. They try to find it out and watch the movie attentively... But in this movie,we got nothing mysterious. After watching the first sinister,we have already know the context, the mystery. Viewers already know that an evil is controlling those children and making those things happen but in this movie those characters are solving the mystery 😆."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "bwicknoff",
        "review_rating": "10",
        "review_title": "Top 3 best horror movies ever made",
        "review_detailed_main": "Sinister 2 is an amazing movie which instantly captures your interest. The movie is brilliant. The actors are fantastic and from beginning to end is a masterpiece. It still gives me nightmares to this day and this was released to us viewers 8 years ago. I have watched this countless times especially when I can't find a movie to watch and it always hits the spot. Its the perfect amount of scary, the kids watching the videos scene is especially scary, crazy and gives you a chilling feeling when watching. I absolutely love this movie, it is super entertaining and have enjoyed watching for the last couple years. If you haven't seen this you need to watch it right now, it will not disappoint!"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Howling_at_the_Moon_Reviews",
        "review_rating": "5",
        "review_title": "First one was a 6, this one is a 5",
        "review_detailed_main": "While this was not quite as good as the first, it wasn't far off. A solidly entertaining, average horror film. The whole premise/plot was interesting and suspenseful for the most part.\n\nWhen I reviewed the first one I noted that the only performance that I wasn't crazy about was the deputy's. So, you can imagine how I felt when I saw him as one of the main characters in the sequel. However, his performance leveled out a bit and he lost some of those odd quirks he had in the first one. Conversationally I enjoy his choices, but I don't know if he is well suited for drama. The mom and the \"evil husband\" had great performances.\n\nSame issue I had with the first one was the way Bughuul looked... I just, did not like it at all. It was like a weird cartoony black and white joker/clown...? It felt fully off the mark to me for a pagan god and really took me out of it and cheapened it every time I saw him.\n\nWhile it felt a tad repetitive with the children in the basement it's a core part of the plot that was established in the first and was understandable. I almost wish it had been just a tad longer because I would have liked to seen them delve into the church and also the main family's background just a tad more than mentioning what was going on with them. It felt we got a decent amount of plot points but none of them were super elaborated on.\n\nOverall I was entertained with an engaging plot and some solid acting piggybacking off of my interest for the first one. I don't think that this is one I would suggest watching regardless of seeing the previous...it's not one of those. You should see them both consecutively. Would recommend, particularly if you have seen Sinister 1."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Pigeon_down",
        "review_rating": "5",
        "review_title": "Goth makes murder flicks - thinks he's scary - rolls eyes.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dfa120374",
        "review_rating": "5",
        "review_title": "To Repeat An Old Cliché...This Isn't As Good As The First",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "nathan-redo9",
        "review_rating": "5",
        "review_title": "It was all there .... then it just wasn't",
        "review_detailed_main": "This film started out great and then it just fell apart ....... This movie depended itself on the children that have already past and that was a great idea at the beginning !! Then it just ended up like bread with no butter POINTLESS ? Strong actors that were given very little chance to shine it just didn't do it for me. I rate this a 5 Because the potential was there but it just wasn't put together like how the original was . Overall it is another standard film but nothing to great and nothing to awful to be worth of a rating lower then five !"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "atinder",
        "review_rating": "5",
        "review_title": "Same as original",
        "review_detailed_main": "I was not a fan of the first movie, so I did not expect much from it.\n\nI thought the movie, had the same feel as the original, (well the first part of the movie) with a bit more action added to this movie.\n\nThe second half of the movie, it got really messy, it felt like they rushed it.\n\nI found subplot of the crazy dad, so pointless.\n\nI enjoy some of scarce scenes, which I thought worked but the last one, which I was actually waiting for, I did not expect it to be as funny as it was. Those scarce scenes DON'T work!\n\n5 out of 10 , Same as the first"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Elvis-Del-Valle",
        "review_rating": "9",
        "review_title": "A good sequel to Blumhouse's most disturbing Boogeyman",
        "review_detailed_main": "Continuing the plot now with the officer from the previous film as the protagonist, Sinister 2 already shows in more detail how Bughuul corrupts the innocence of the children he is going to kidnap. In this case, we have two brothers who, together with their mother, escape from a violent father without knowing the consequences that await them. The film maintains the tone of the previous one, although the suspense is less tense. Luckily it maintains the level of terror of the previous film and the disturbing super 8 sequences. They did well to place the officer as a protagonist, since despite having had little participation in the previous film, he had what it takes to be a leading character. The performances are quite good and believable, especially the children act very well. The soundtrack this time was by Tomandandy, but he didn't do a bad job. Sinister 2 is a good continuation and it's a shame that it was the last installment in the saga, since it deserved a third installment to conclude this great work by Blumhouse. My final rating for this movie is 9/10."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "asherrbh_15",
        "review_rating": "5",
        "review_title": "Very unimpressive",
        "review_detailed_main": "The ghost kids come off pretty goofy bringing down an already mediocre movie that suffers from a lot of character exposition and repeated moments from the original, and the original is just as good as this one."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ryanmark-57919",
        "review_rating": "5",
        "review_title": "Not as Good as the First One",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jstharun-55648",
        "review_rating": "5",
        "review_title": "👎",
        "review_detailed_main": "Not better than 1st part ,very slow.can be made better by adding more jump scares ...."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "farchettiensis",
        "review_rating": "4",
        "review_title": "A mediocre spin-off, this a different breed of movie than the first one",
        "review_detailed_main": "To be brief, I will say that this is a different breed of movie than its prequel. Mediocre at best, while the level of violence seems to have increased, this a terrible horror flick and a bad movie. The drama is centered around a family conflict - a mother who has run away from her violent husband in order to protect her children. The husband is relentless is his pursuit for his children. Meanwhile, the vulnerable mother meets former sheriff deputy \"so and so\", with whom she develops a connection of a sort.\n\nThis plot is almost independent of the Bughul subplot. It's almost an excuse rather than a genuine plot. Therefore, most of the movie feels artificial; emotions are not genuine.\n\nThe first movie had the excellent acting of the protagonist (and the movie pretty much centers around him), whereas this one has a goofy former deputy and a troupe of cruel ghost-children. In general, it's not just the acting that has gone down a notch, but the very denouement of such an artificial, extremely clichéd plot made the acting feel much worse than it really was.\n\nFor me, besides the attempt to create faux emotions, using violence as an instrument to shock, rather than a good story, one of the worst things of this movie was that it was effectively \"dumbed down\". It abused of the characters to communicate the entire mystery of the Bughul entity. With no mystery, there is no horror. This is why they had to recur to more violence, increased apparitions of supernatural figures (remember in the first movie when you hardly ever saw the Bughul?) to create reactions you can't create by doing a good, intelligent movie.\n\nThere's nothing \"dark\" and disturbing in this movie. The word \"disturbing\" is what comes to my mind when I think of the first movie; not for this one, in spite of the use of some similar resources. I'm horror movie veteran, so I'm not easily shocked by gore. I don't mind the clever use of film-making resources to create an atmosphere, to elicit emotional responses, and so on. But, if that's all there is to it, then there really isn't much at all.\n\nThe movie is watchable. It's not a good horror movie; it doesn't have any of the attributes of a good horror movie. It's a poor excuse for a sequel. 4/10."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "ravenhair702",
        "review_rating": "5",
        "review_title": "It's not all terrible.",
        "review_detailed_main": "I remember seeing the first Sinister, but my wife and I were looking for a movie and came across Sinister 2. It's 2015 movie that I guess we missed. The acting was good, and the storyline is creepy and interesting, but I can't put my finger on it. It had some jump scares and the films the boy had to watch were disturbing to say the least. I don't know. Just didn't like this enough to give it anything higher than a five out of ten. Really didn't like the end...maybe that was it. Most horror movies don't have a happy ending, I've come to expect that, but this one just left you hanging. Hate that. Give it a look if you haven't seen it before but do it just once. Peace."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "hnhnyc",
        "review_rating": "8",
        "review_title": "I may have liked this one more than the first",
        "review_detailed_main": "Obviously, there's virtually no mystery left to solve, since Ethan Hawke put in all the legwork in the first movie. So if you're expecting a whole new set of twists and turns and mysteries, you're gonna be let down. For me this was more about being invested enough in the characters to care what happens to them, which I was. Sure, it's not without its flaws and plot holes but frankly neither is the first. I thought this was much faster paced, had more \"scares\" and more richly developed plot lines and characters you actually cared about. It held my attention throughout, and I have seen much worse movies, let alone sequels. I wonder if everyone who had a \"negative\" review of this one would have felt the same way if this was the first film, or a standalone. I avoided this for a year because of the low rating and what I learned is that sometimes you just have to see for yourself. Just make sure you don't watch a copy you found laying around in a canister of 8 or 16mm film."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "MsHoneyBee",
        "review_rating": "4",
        "review_title": "I am not afraid of kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Saiph90",
        "review_rating": "8",
        "review_title": "Creepy",
        "review_detailed_main": "This was a creepy movie, a sequel to Sinister 1, a mother on the run with two children from an abusive father seek sanctuary in a house were some gruesome murders took place. A lot of jumps, good plot, well acted backed with a disturbing music score. One of the children is forced to watch horrific movies of families being murdered in various disturbing manners. Deputy so and so and this is all he is called from the first Sinister 1 movie arrives at the house to break the chain but finds the mother and two children living there, he tries to protect the family from the abusive father and the ghoul who is trying to get one of the children to create a film of the family being slaughtered. Good horror film."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "gamergirl-82124",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "fil-nik09",
        "review_rating": "8",
        "review_title": "2",
        "review_detailed_main": "Well, first of all, I wanna say that Sinister for me is the best horror movie I have seen...and possibly one of top 3 movies in any genre. So, I was really impatient to see the follow up though I was kinda afraid that it would disappoint me as any follow ups do...\n\nThis is not entirely the case with this one. As I consider the 1st one a masterpiece, this one could not be in the same line. Yes, the story is there. The children are there...That creepy but powerful music ( especially at the end of the film and while chasing the victims) is there. The cinematography... but somehow the story is less appealing.\n\nI liked the 'unespected shift' of interests from the disappeared children from one brother to another. I did not like the whole abusive father theme as I find it not important at all - maybe only as a way for justice to be served at the end.\n\nI liked that there is this guy from the 1st one. I did not like the mother much. She was not convincing all the time.\n\nI liked the 'movies' of tragically killed families but I did not like how the last one was being filmed...I mean, come on... instead of killing that boy or something, the family and the man are running through the fields into the house to hide, when they had car to drive away.\n\nAll in all, not bad! It can stand on its own. I gave it 8. But Sinister is a masterpiece. This is a good copy."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "muniramerruddin",
        "review_rating": "9",
        "review_title": "One of the best horror films, and it as a sequel succeeds in complemeting the first one.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "Evanoil",
        "review_rating": "8",
        "review_title": "Great addition to the genre",
        "review_detailed_main": "If you are a fan of horror , go watch it its a must! Yet another film that gets low score on the site mainly because its a horror title without any touching story.I wasn't expecting on seeing something better the first Sinister , i was right , it wasn't better but it got close to the first one that was a good horror film with an original plot.As i said the plot is good in this one ,plus the actors are good so i have nothing to add in this case.I warmly recommend this film because it serves its purpose very well , its scary with minimum amount of horror film clichés and thats something that is very hard to find in the newest horror flicks."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "fabiolamura",
        "review_rating": "8",
        "review_title": "SINISTER 2=8",
        "review_detailed_main": "Regia=9 Sceneggiatura=7 Interpretazione=8 Fotografia=9 Finale=7"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "iDropMagiC",
        "review_rating": "9",
        "review_title": "HElP",
        "review_detailed_main": "Good jump scares, good story at all is good recommended ! dont get soons !! ahaha"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jhester9614",
        "review_rating": "8",
        "review_title": "Stronger Plot, Weaker Scares",
        "review_detailed_main": "If you're coming into this expecting new scares or better scares, this isn't the movie for you. This has the same Bughuul jump scares, creepy kids, violent 16 mm films, and bad parents.\n\nThat being said, this movie has a much stronger plot with slightly smarter characters. We get a different point of view, in the form of a child being scouted as the next murderer for the films.\n\nI like it better than the first one if only because they turned on the lights in the houses, we got to see what Bughuul and the dead kids do to get other kids to join them, and the purpose of the camera.\n\nPros: Better plot, better ideas about the supernatural, better acting, awesome effects\n\nCons: Not as scary, repeated jump scares, you end up being okay with two murders\n\nBottom Line: Best horror thriller I've seen in a while, don't believe the critics."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "hammerheadshome",
        "review_rating": "10",
        "review_title": "part 2 usually fall short but this is not the case here!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "review_detailed_main": "i love that deputy so and so from the 1st movie is in the lead role and man he was perfect. his character and demeanor was spot on he carried on as the same character as in the 1st movie.as with the 1st one i can say enough about this movie. this movie explores more deeply into the 2 main characters deputy so and so and the boogy man. its filled with suspense, horror and drama, this too is one of my favorites and still watch it. makes you shudder really root for the deputy to save everyone.the end is fantastic i think i better than the !st one. i love sinister,sinister2 and i strongly you recommend you watv nh"
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "jtindahouse",
        "review_rating": "8",
        "review_title": "Hard to go wrong with a premise this good",
        "review_detailed_main": "'Children of the Corn' was one of the first horror movies to have a real effect on me when I was young. The combination of a creepy set of kids ('Isaac' in particular), the corn setting and the added element of a higher-being possessing the children all worked perfectly and made for a fantastic horror movie. Since then there have been a raft of sequels and even a reboot, none of which have been of any great quality with perhaps the only exception being the immediate sequel. So the idea to have an entirely different series, with an already successful original, base its sequel on that film to me is a brilliant idea and one that worked very well. Kudos to the filmmakers for using this piece of inspiration.\n\nSequels will always be compared to the original and thus often get a rough time with critics and audiences alike. To me, the best way to enjoy a sequel (and I frequently do as much as, if not more than the original) is just to treat it as its own film and judge it on its own merit. 'Sinister 2' isn't as good as the original but it was always going to have a tough time living up to one of the finest horror films made in the last couple of decades. It has a fantastic premise to fall back on though and this carries any flaws it may have.\n\nThe whole thing is just unnerving and tough to sit through (in a good way). The jump scares are often made even more effective simply by the vicious looking and haunting image of 'Baghuul' (the film's evil entity). The 'home-videos' in the film are a lot more creative this time around and that definitely worked in the film's favour. The only thing that set this one back a touch was how in-your-face it could be at times. The first one had the element of mystery to aid it, however in the second one we know what is going on, so the filmmakers take the route of being more upfront about things. This is fine but it did work better with a little mystery surrounding things. Just another reason sequels have it so tough. Altogether though it's another very well made horror film that will leave you as uncomfortable as a horror film should."
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "nogodnomasters",
        "review_rating": "8",
        "review_title": "YOU DON'T STOP EVIL",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "MrRightOne",
        "review_rating": "9",
        "review_title": "Great!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "kshirad",
        "review_rating": "",
        "review_title": "A potentially scary sequel bogged down by weak writing and unfocused direction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "dzeveraleksandar",
        "review_rating": "",
        "review_title": "Another unsuccessful sequel (Spoiler alert)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "shakil240582",
        "review_rating": "",
        "review_title": "Nonsense Story-Line & Direction.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "angelazagami",
        "review_rating": "",
        "review_title": "Beautiful!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2752772",
        "movie_name": "Sinister 2",
        "movie_rating": "5.3",
        "review_username": "leo_pcolle",
        "review_rating": "",
        "review_title": "Good movie terrible end",
        "review_detailed_main": ""
    }
]