[
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "lv_rk",
        "review_rating": "9",
        "review_title": "Here comes an exceptional movie in Hindi, after a long time",
        "review_detailed_main": "If you eat a good chocolate or sweet, the taste lingers in your mouth for quite sometime... right? Likewise, the taste of this movie lingers in you mind for quite some time! This movie is the best example of a brilliant script, brilliant execution and of course, some brilliant acting... Sanju and Arshad really rocks.... they make you laugh most of the time and there are some heart touching moments also... like in the first movie.. This movie surpasses its predecessor in every way.... The Mahatma angle in the movie has come out superb! Thank you Mr. Hirani for reminding us about Mahatma and his values... after a long time... :o) And lastly, i never thought that Vidya Balan would be so beautiful when I watched Parineetha then. She is very beautiful with radiant smile... Go watch it folks..."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "vivekdlko",
        "review_rating": "8",
        "review_title": "Why not more people make moves like thisthis is AWWWWEEESOMME MAAMOO",
        "review_detailed_main": "\"Lage Raho Munnabhai\" , the second film in the Munnabhai series and perhaps the most eagerly awaited movie of the year at least for the people who like meaningful cinema.This one was supposed to be a sequel but it has a story of its own and its refreshingly original and no connection with the first movie except the Munnabhai and circuit and their gang. I saw the movie and was completely spellbound by it.I was glued to the screen for the entire duration and enjoyed every bit of bit.To call this movie a comedy would be wrong this one is a mix bag you've got comedy, romance , emotions (and yes lots of them) and a beautiful script to tag along.\n\nThe entire cast is simply lovable and all have acted their part to the book. Sanjay Dutt excels in the role of Munna hes is well complemented by ever smiling Arshad Warsi as circuit who surprisingly shows his softer side in some well acted emotional scenes. Vidya Balan looks fresh and acts her part well. Boman Irani as The Punjabi builder is first rate,people get to see the various shades of his character.The supporting cast of elderly persons is also good. Dia Mirza provides glamor to the film in a brief but sweet role. Jimmy Shergill is likable in the scenes where he gets footage.\n\nBut the real star of the movie is \"RajKumar Hirani\" , yes the director of the movie. he has told the story in a very unique manner which appeals to the masses.I wont go into the details as it will spoil the fun but this man is a class apart, he has handled each and every scene with perfection be it comedy , emotional or drama brilliantly.\n\nMusic is perhaps the only weak point of this film. Though the songs blend well with the story but no songs stands out to be a chart buster. The picturisation of the songs is beautiful and visually appealing.\n\nOn the whole \"lage raho munnabhai\" is an excellent movie not to be missed. The movie will tickle your funny bone as well as bring tears to your eyes in some situations. Its unique way of story telling will find praises not only from the masses but from the critics as well. the movie has a surprise package in the character of \"mahatma Gandhi\" and the actor who's played the part suits the role well\n\nI can't wait for another outing with Munna&Circuit but good things come at a price. The price here is Another Wait Till Then patience rakho \"MAAMOO\"."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Rahul_Gairola",
        "review_rating": "9",
        "review_title": "Lage Raho MunnaBhai..............",
        "review_detailed_main": "Now that i have visited the NEARBY single screen twice for LRM , it's about time to write a detailed review(quite a big achievement as it's 10 km away from my residence ,all thanks to the VVC-Multiplexes stand off).\n\nHalf an hour into the film & i was thinking , WTH is happening ova here? I mean there wasn't any definitive motive behind munna's shenanigans but as we reach towards the intermission point , i was squeezed into a compromise.\n\n& the second half...well it delivers, delivers big time as munnabhai's \"Gandhigiri\"does create a \"chemical locha\" in our hearts & how ! Hats off to Hirani, & abhijat Joshi for creating such memorable screenplay which makes u rethink about bapu's relevance today, it's just stuffed up with great scenes whether it's about a man trying to get rid of unwanted stains on his door courtesy his pan chewing irreverent neighbour or an old retired teacher trying to get even with a corrupt officer in pure Gandhigiri style , they all create such a huge impact on one's psyche.\n\nArshad once again does a great job , on first viewing i founded him a bit OTT at times but the second session convinced me that his was a performance driven by astounding comic timing , well done circuit(though his screen time was a let down).\n\nBoman as Lucky was great too , sometimes his Punjabi lingo faltered but overall this definitely is his first notable outing post MMBBS.\n\nVidya is good but her Guuuuuuudmorning mumbai does irritate u at times , still she was better than gracy .\n\n& then there is sanjay dutt without whom munnabhai can never be what it is today , such a heartfelt performance that it makes u weep & smile at the same time ,one of the rarest of rare feet i must say.It's amazing to see that how he swings from Zinda's maniac urgency to munnabhai's goofy charm ,all in all Yet another awesome outing for him .\n\nEasily the best film of the year , waiting for munnabhai's next innings and until then , Lage Raho Munnabhai.\n\n8.5/10"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "movie_freak_dubai",
        "review_rating": "10",
        "review_title": "One of the best Hindi movies that I have seen.",
        "review_detailed_main": "I saw Lage Raho Munnabhai last night and it's still in my head today. I always go to watch sequels with a bit of trepidation but Mr. Hirani soon eased my fears with a wonderfully thought out comedy that is funny and has a message which he puts across without being preachy. Most of the same cast back again with only Sanjay Dutt and Arshad Warsi reprising their roles and playing the same characters again. This movie cannot be considered as a sequel as it is more of an episode in Munnabhai's life not unlike James Bond films or Charlie Chaplin's tramp.\n\nSanjay Dutt is just perfect as Munnabhai... i cannot imagine anyone else playing this role. It was said that Munnabhai was first offered to Shahrukh Khan, while i do like the King Khan i feel he would have gone overboard with this role. Sanju baba plays with a lot of conviction and i believe his true character and honesty shine throughout the film. He handles the comedic and emotional scenes with ease.... so naturally. Good rapport with the Bapu character.Arshad Warsi a.k.a Sarkeshwar a.k.a Circuit was also brilliant ...excellent chemistry with sanju and had some nice sequences. I liked him since the time he appeared in Tere Mere Sapne... and is coming into his own as a Bollywood star in his own right.\n\nVidya Balan was bright and chirpy... great teeth! Only disappointment was that Boman Irani did not have the same impact as he did with Dr. Astana but still a great performance. He makes the audience like and empathise with him even though he could be considered the villain of the piece.\n\nDirection was excellent, song sequences were handled beautifully with most of the songs being situational all well shot especially 'Samjho ho hi gaya' & 'Pal Pal Har pal'. This movie just proves that Bollywood movies can be just as good and entertaining as Hollywood while still giving us all the masala.\n\nWe should all follow \"Gandhigiri\" but first let's support this great movie by praising it and WATCH IT IN THE CINEMA!!!!!!!!!!!!\n\n10/10."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "pradyumnaj",
        "review_rating": "10",
        "review_title": "Excellent!",
        "review_detailed_main": "Incredible movie! The comedy was expected, and having developed his characters so well, Rajkumar Hirani couldn't possibly not make people laugh in this movie, but the most inspiring aspect was the message which was conveyed in such a beautiful, unpreachy way, something the audience would connect to. Definitely, no documentaries or books about Mahatma Gandhi could have had such an impact on the audience, and after watching this movie, I respect him much much more.\n\nThe screenplay and direction was flawless. There was not a single moment when you wanted to take your eyes away from the screen, and the dialogues were as good as the first part, in fact better. Sanjay Dutt and Munnabhai are made for each other, and he couldn't have played the role better. But yeah, without Arshad Warsi, the movie wouldn't be half as good, and like the previous one, he's delivered. Vidya Balan really adds life to the movie, and if you really want to compare, I'd say she's done much better than Gracy Singh in the previous one. Incredibly beautiful, and she's got grace, I can only but praise her in this movie. Boman Irani, Diya Mirza and others have done there bit, and Hirani has very nicely used all these characters around the main ones. And last but not the least, Mahatma Gandhi, played by Dilip Prabhavalkar is something you will not forget. Throughout the movie, he wears this enlightened smile you fall in love with!\n\nThe movie does have technical glitches, for instance, if vidya balan works at worldspace, how did her show air on FM radio and things like that, but you don't really care much about these things when you've just been through 2 and half hrs of sheer entertainment, where you laughed, cried, and every possible emotion you can go through with a movie. The movie has an incredible feel-good factor to it.\n\nSo all said and done, the movie is a must watch, watch it asap! I doubt I'd find a single person around me who wouldn't like it."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "shreerajca",
        "review_rating": "10",
        "review_title": "One of the best movies in recent times!",
        "review_detailed_main": "This is one the excellent movie that refreshed me to the core. A classic Vinod Chopra production, this movie does not only fulfill high expectations of the audience, being a sequel of Munnabhai MBBS, but exceeds it.\n\nA decent and hilarious comedy throughout, you can watch this movie with family and realize that superb comedy can be created even without vulgarity.\n\nOn acting front, it is difficult to rank the actors as everyone has made his role alive. Sanjay Datt (Munnabhai), Circuit (Arshad Varsi) & Bomman Irani (Lucky Singh) have given their best performances.\n\nCinematography is excellent and songs are appropriate to the situations.\n\nSO what is the best thing about this movie? Unlike most big-budget-glamorous Bollywood flicks, this movie entertains you, and still makes you think.\n\nIt carries a message for today's generation!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "kathuria_nidhi",
        "review_rating": "10",
        "review_title": "Munna Meets Mahatma Gandhi!!",
        "review_detailed_main": "The second innings of Munna Bhai and Ciruit in 'Lage Raho Munna Bhai' is one cracker of an innings! It's better than the first one, extracts more laughs and punches and the characters have a more humane temperament that explores the other side of 'bhaigiri'. The plot is truly the winning card of the movie, not to discount the effective casting, dialogues that are a mix of funny and introspective, a rib-tickling screenplay, enjoyable situational songs and a first rate direction. Sanjay Dutt as Munna Bhai and Arshad Warsi as Circuit wear their characters as their second skins, more comfortably, more snuggly and are more lovable than their avatars in the earlier Munna Bhai MBBS. Ditto for Boman Irani who dons the role of Lucky Singh, a sardarji builder; a meanie with a heart. Vidya Balan also puts her best foot forward as a radio jockey who makes Dutt's heart goes hmmm... Dia Mirza and Jimmy Shergill justify their cameo appearances. A surprise element during the climax is a thoughtful addition and cheers the audience, specially the female audience threefold. Though the film is not a sequel to Munna Bhai MBBS, Lage Raho Munna Bhai retains the characters of Munna and Circuit in the lead roles and their nontoxic, almost childlike idiosyncrasies. This idea also gives an unlimited scope for possibilities the hit pair of Munna and Circuit can indulge into in future. Lage Raho Munna Bhai is a story about Murli Prasad Sharma aka Munna who meets Mahatma Gandhi and undergoes a heart transformation. For Munna, breaking bones and abducting people at the snap of his fingers was easier than the courage it required to walk on the path of non-violence and truth. Hesitatingly and unwittingly he takes the road less traveled, which is thorny and full of obstacles in return for self revelation and a guilt-free conscience that fears nothing and no-one. The 'Gandhivad' is turned into 'Gandhigiri' by self proclaimed Professor Murli Prasad Sharma for its practical implementation in the present day, without sounding preachy or heavy-duty. There is a similar 'offering the other cheek' when someone slaps you, confessions of truth and also the 'satyagrah' for a bunch of old people who lose their house called 'Second Innings' to the manipulative and greedy Lucky Singh. Sad but true that our nation won freedom but lost its people, Murli tries to revive faith, courage, truth and justice in people from different walks of life. With his new found ideology or the chemical 'locha' in his brain, he triumphs over the cynics or the lost souls and also wins the love of his life. An interesting observation can be made between Rakeysh Om Prakash Mehra's 'Rang De Basanti' and Rajkumar Hirani's 'Lage Raho Munna Bhai', the fact that though the theme of both films is more or less the same, the approach to resolving the conflict is in complete contrast with each other, like two ends of the same thread. Yet both films succeed in their own unique ways and deliberate the depths of human emotions and reflections in an identical manner. In the end, hats off to Vidhu Vinod Chopra for producing a film that is a wholesome entertainer and succeeds in giving a heartfelt message in the times where films are made merely to fulfill the whims and fancies of egoistic filmmakers.\n\n-Nidhi Kathuria"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "AnonymousbutDilpreet002",
        "review_rating": "6",
        "review_title": "A little too simplistic",
        "review_detailed_main": "There is a simple solution to every existing problem in life and you need a Munna Bhai to get to it. Munna Bhai worked at a radio station, he kept solving common people's problems at the show. Whatever he reccomended, turned out to be right. Sometimes, the problems were as hard as broken marriage or suicide attempt, but it's all too easy for Munna Bhai.\n\nGandhi's philosophy is oversimplified here. Non-violence theme is repetitive.\n\nThe plot is formulatic. Few happy moments, than a sad one, then few happy moments, than a sad one, again some happy moments, a sad one before a happy ending.\n\nIt might be a feel good film, but seems to childish to me."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "nskanyal",
        "review_rating": "10",
        "review_title": "Munnabhai - the magic recreated!!!!",
        "review_detailed_main": "Probably, this is the best movie sequel ever produced in the Hindi cinema and surely would be one of the top ten comedy Hindi movies of all times. I can't remember if any comedy movie (hindi or other) ever been able to deliver such a strong message in such a subtle and non-preachy manner. Coming out of the cinema hall, you can't help from having that huge delightful smile on your face.. This movie isn't a sequel in its true sense; apart from the characters of Munnabhai and Circuit, there is nothing in common with its predecessor (unarguably, the movie would not have been possible without these two characters as in their original form).\n\nFew reasons which turn it to a must watch movie:\n\n1) awesome movie, with astounding screenplay, story, characterization and many other things. Its a 100% clean movie with no risqué dialogues, no item number, no vulgar dresses and no vulgar scenes, which is an achievement in today's times.\n\n2) Performance of Munnabhai and Circuit duo - Sanjay dutt is undoubtedly the most lovable bollywood bhai, he is bit old now but still going very strong and Circuit has come up with his magic yet again, this guy's timing of dialogues is perfect... In all, the duo rocks!!!!!!!\n\n3) Strong, strong and very strong message delivered... I won't delve much onto this or else risk disclosing the story and henceforth the fun... Everybody is going to respect Mahatma even more after watching this movie - bet you are going to love that enigmatic smile\n\n4) Jhanavi (Vidya Balan)... such a graceful beauty, her face is like bright morning light; gosh, the lady literally smiles with her eyes, you are bound to fall in love with this gurl, just like Munnabhai.. apart from that she acts very well and gives a strong performance...\n\nThere are many more things that make this movie memorable and a treat to watch.... surely, something to watch before you die :-)"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "scorpion83",
        "review_rating": "7",
        "review_title": "Lage Raho ... Lage Raho !",
        "review_detailed_main": "This is going to be the best comedy movie for the year .. I mean the team of Munnabhai has come up with such an interesting plot, that will keep you intact with the seat for a two and a half hour duration .. which believe me .. went in a whisker !\n\nEveryone who acted in this movie have done justice to their role .. and I loved Circuit in this one more than the first .. Sanjubhai has given life to Munnabhai yet again in style !\n\nThe initial title which was 'Munna meets Gandhi' would have been more apt for this movie. At interval though the movie was very good, I just thought that its missing something called as a logic. But the director has tied the open ends very well in the second half giving me a reason to stop speculations !\n\nOn the whole, this is one hell of a movie I would recommend for you and your family .. Laugh out loud !"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "npkar",
        "review_rating": "10",
        "review_title": "See this again and again!",
        "review_detailed_main": "What does one say about this movie? Coming on the heels of Rang De Basanti, Lage Raho Munnabai could prove to be another movie that stirs the conscience of the Indian masses, and dare I say, foreigners as well. Never before has Gandhiji's life and message been conveyed so simply, so beautifully and in such a rolling-in-the-aisle humorous manner. Everybody in the movie has played her or his role tremendously. Arshad Warsi and Sunjay Dutt make an explosive combination and Boman Irani is a riot. Don't be surprised if the thickest-skinned amongst you sheds a tear or two while laughing your guts out. You will walk out of the theater with a spring in your step, light in spirit, thankful that such a man as Gandhi walked the soil of our nation and inspired to become a little bit more like him. Even if a few of us are motivated to emulate Munnabhai's 'Gandhigiri', we could make a world of difference!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "My Experiments with the taporis",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "bali4life",
        "review_rating": "6",
        "review_title": "A fun bollywood movie but overrated",
        "review_detailed_main": "I give it a 6.5/10 because the movie is one of the best bollywood movies to come out for a long time - why? - Because it has some great acting, nice clean comedy & it teaches some good values to people, something that is sorely lacking in today's world.\n\nHaving said that, I see that the rating of this movie is 8.8 and I'm pretty sure the bollywood faithful are responsible for it. If you think about the movie from an international perspective, it lacks imagination - it is yet another of the typical bollywood movies - silly singing & dancing & no novelty (except that the central character sees Gandhi, which had a good twist). The central characters are happy to be uneducated goons, the people who are powerful are also uneducated & corrupt and this reality is what is depressing about the country and I find it hard to enjoy. When is bollywood going to make a Sci-fi like Jurassic Park or a drama like Crash or Brokeback mountain or a modern Martial arts classic like Ong-Bak so that it can truly challenge the international movie arena. I don't see that happening anytime in the next century.\n\nIn the meantime its going to be churning out millions of similar movies like Lage Raho ... every year only for stagnant people to rate it 8.8/10!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "babblerk",
        "review_rating": "2",
        "review_title": "Simply pathetic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "python_prince",
        "review_rating": "10",
        "review_title": "Munna Bhai back!!!",
        "review_detailed_main": "To start of with i didn't had much of expectation on this movie since I assumed that a second series to Munna Bhai might not be good as the original based on my previous experiences. But this movie 'ROCKS' with a different story line all together, still keeping the characters of MunnaBhai(Sanjay Dutt)in place. The crew is pretty much the same from the original except for the heroine Vidya Balan and she does her part in style with others. The chemistry between Munna Bhai and Circuit, whether its comedy or sentiments was handled with beauty by Sanjay Dutt and especially Arshad Warsi. Boman Irani again proves that he can the best for the character given to him. Go watch this movie with less expectations and you will enjoy this weekend comedy treat.. This movie is sure shot a box office hit and movie for every Indian to watch!! Don't miss it because I bet u will come out with the satisfaction of watching an excellent movie with flawless script!! - Mobs"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "porgiamor",
        "review_rating": "10",
        "review_title": "very entertaining movie",
        "review_detailed_main": "you have to understand folks that this is not an artistic film nor does it pretend to be an artistic film. it's really intended to be pure entertainment with a message. And that is why this movie accomplished these goals in mind. entertainment - entertainment - entertainment!\n\ni really admire the gandhi pacifist theme to this film. the acting was great throughout. great to see a movie with sanjay dutt as the top billed actor. sometimes you just want to see a common looking person and not an overtly handsome male lead like SRK or Salman or Saif Ali.\n\nSanjay can really carry this movie with his acting. I loved his crying scene with gandhi - he was so believable. boman irani and vidya balan are just as great as he is. boman's body language in his character role was amazing. vidya balan is such a natural performer, she's better than meryl streep because her acting skills are more nuanced and less technical than meryl's.\n\nif you love movies then you'll love the spiritual quality of this movie with the ghost of gandhi popping in and out. the musical numbers are also fun but add more to the story by showing you how the characters truly feel about what is happening to them.\n\nKUDOS to Cinematography C. K. Muraleedharan and Director Rajkumar Hirani and Producer Vidhu Vinod Chopra. Screenplay by Abhijat Joshi is just brilliant. When Gandhi sits on the couch and says \"Why don't you just shoot Lucky?\" - I died laughing. These folks are the future of film and Adam Sandler/Will Ferrell/Jim Carrey need to take lessons from a movie like this in my humble opinion.\n\nI say Bollywood all the way!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "WWF_Deadman_Undertaker",
        "review_rating": "10",
        "review_title": "One of the Greatest...",
        "review_detailed_main": "I haven't seen something so vibrant and refreshing and don't get me wrong, I'm only 14 but, I know a lot about Hindi Movies and this is one to brag about. I was laughing so hard I would hiccup and even during parts that you would think are only to be tense, Munnabhai and Circuit do the unbelievable and turn it into something that will make you tear...\n\nThe other thing is that, although it may not impact anyone because it is a hard message to go by, the whole idea of the teachings of Mohindra Karamchod Ghandi being incorporated was a twist unlike any other. I'm going again this weekend and watching it again, the great thing is... I have hardly any remembrance of the movie because I was laughing so hard.\n\nOf course there are also things that weren't incorporated, like why Ghandi died... Of course it was a serious matter that couldn't be very much enlightened by the duo. Some say that his student was crazy and did it out of spite and jealousy. Others say that Ghandi deserved it because he agreed to help the British in their workings in order to get them to leave but, this is only because it was the peaceful way out...\n\nNow here are some points about this movie: - It is a hilarious spectacle that could rob you of all of your oxygen as you thrust out all the air in your body in reaction to the laughter.\n\n\n\n\n\nThanks for reading, have a nice time watching it..."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "movind",
        "review_rating": "10",
        "review_title": "An all time great Hindi movie",
        "review_detailed_main": "Quite possibly, one of the top five Hindi movies of all time. Manages to provide a thoughtful perspective on fixing interpersonal problems with rip roaring comedy and great music. Comments on growing old with dignity, treating people with compassion, the pitfalls of astrological nonsense and ridiculous superstition, the hideous Indian bureaucracy, and any number of important social issues all interspersed with side splitting comedy sequences. While the acting is passable the credit goes the original story line and the empathetic, sensitive directorial skills of the wonderful Rajkumar Hirani. An absolute must see. Appreciating it requires some prior exposure to and acceptance of the Bollywood melodramatic, in your face story telling style."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Kya Bore Ho Munnabhai",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "unsuidojo",
        "review_rating": "7",
        "review_title": "Clean cut comedy",
        "review_detailed_main": "Hero of the Movie is Director!!! reminds me of the genre of movies made by Hrisikesh Mukherjee,Basu Chatterjee and Sai Paranjpe. Story involving common people and common themes. Of course we have two lead characters with \"Tapori\" background , but their perception of social problems and solutions to the same, makes this comedy different. Incidentally this is second movie in the recent times when the character studies real personality from History, which in turn changes his/her approach to life. Yes I am referring to Rang De Basanti , where the group of youth emulates the revolutionary freedom fighters. and Here we have the protagonist, who starts a lie to win over his love & ends up becoming supporter of \"Truth and Non-Violence\" and how he implements those two principles in modern times creates all those comic situation , which teach lesson or two for the viewers .. Sanjay Dutt & Arshad Warsi are made for each other pair, they have really got mastery on the Munna-Circuit Combo , and I wont mind another 10 sequels made to the movie , with unique story-lines of course..."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "arcvish-1",
        "review_rating": "10",
        "review_title": "Simply amazing movie",
        "review_detailed_main": "I went to watch Lage raho Munnabhai without much expectations as sequels rarely live up to the original. But, to my surprise, I felt this movie was even better than the first. The first one being so popular, they could have easily extended that story for the sequel but instead they came up with this BRILLIANT idea of imagining Munna Bhai - Mumbai Don - being influenced by Gandhian thoughts. Not only was the Idea brilliant and novel, implementation was excellent too. The first half of the movie is a laugh riot with hilarious sequences of endearing Bhai-Circuit duo and extremely funny one-liners. Arshad Warsi again does a great job as loyal, lovable Circuit. In the second half, whenever movie seemed to drift a little, it came right back on track with Warsi's one-liners. While fully entertaining the audience with good comedy, the movie also puts across a good message - showing us how Gandhian thoughts can possibly be an answer to our everyday problems. Like the first one, this movie also wins the hearts of the audience, who are not only satisfied with brilliant comedy but also linger upon a heart-warming message."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "dr_anant",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "The fact that the Mahatma and his ideologies have been paid little more than lip - service in recent years is common knowledge to most Indians. As is shown in the movie, currency notes, roads n one - sided history lessons have become the only way to remember Bapu, that too momentarily. This is where this 'Lage raho..' scores heavily. Like 'Rang de basanti' earlier, it draws parallels to our freedom struggle by invoking Gandhiji. Mixing 'Gandhigiri' with a contemporary phenomenon like Munnabhai is a master stroke. The movie has its fair share of laughs(maybe a li'l less than the 1st one), but the overall feel is better and the innocence has been retained. All the leads are in great form, right from Sanjay Dutt to Jimmy Shergill. Vidya Balan looks very pretty n innocent, as suited to the role. The performance, tho, I really liked was Boman Irani - damn good. He's repulsive n likable in equal measure. And finally, the actor playing Gandhiji, is so astutely tongue-in-cheek, u cannot but love him. There are a few stretched sequences-a couple of the drunk scenes, the songs, but not too many. Patriotic comedy, I read somewhere. Gandhian humor is what I'd call it."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "amitjogi",
        "review_rating": "10",
        "review_title": "An Amazing film!",
        "review_detailed_main": "Every once in a while, there comes a movie which makes you feel good about yourself: suddenly, the possibility that we can all be better human beings becomes all so real, if only for the next two days. And then, when the feeling seems to be getting stale- movies after all are make-believe- you go again and watch that film. Over and over again.\n\nFrank Capra did it with Mr Smith Goes To Washington and The Lost Horizon. Spielberg worked that magic by reviving the child in all of us with ET. More recently, there was As Good As It Gets. But that's Hollywood. In European cinema, Kieslowski's Three Colors trilogy stands out. Such films are rarer still in India, more so Bollywood. Hrishikesh Mukherjee's Anand was definitely one such film. Now, after a gap of over three decades comes Lage Raho Munnabhai.\n\nI will not discuss the film here. But if you do not leave whatever it is you're doing and rush to the nearest cinema-hall near you, then you are really missing out on one helluva an experience.\n\nRemember: don't walk. RUN!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "sriramthestranger",
        "review_rating": "7",
        "review_title": "When times change...",
        "review_detailed_main": "It is interesting to watch this movie in the social media era, where there are polarizing views on 'for' and 'against' Gandhi. The plot revolves around Munna Bhai trying to follow Gandhianism (or) the non-violence way in current times and the consequences that follows.\n\nThe screenplay is brilliant and there are enough ebbs and flows to keep the viewers invested. Rajkumar Hirani has this knack of using a recall element - be it Hugs in Munna Bhai, Get well soon in Lage Raho, All is well in 3 idiots, wrong number in PK - so well in all his movies for comedy and emotional content.\n\nGood entertaining movie!!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "calexicoca",
        "review_rating": "1",
        "review_title": "My candidate for Top 100 worst movies",
        "review_detailed_main": "The reason I intended to give this movie a chance to take 2 hours of my life (actually it was only 35 minutes) was my wish to try to understand and hopefully appreciate Indian cinema. All I have ever seen were few older movies of S.Ray.\n\nBrowsing through IMDb I came across this one and after seeing rating of 8.7 I concluded this must be the one which will open the doors of unknown and bring artistic enjoyment. Oh my how wrong I was! The only logical explanation for this rating of 8.7 is that most of 970 people who voted are Indian and their only venture outside Bolliwood production were Adam Sandler movies.\n\nWith this rating this movie would be ranked on 9th place on IMDb List of 250 best movies above Citizen Cane, Goodfellas of Psycho! I am really not in a mood to review and criticize because there is simply nothing that I find worth remembering from this painful experience. My only hope is that there is a lot of Hindu who like me find this movie as is -- plain stupid, with abundance of kitsch and cheesy music."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ig_ilangovan",
        "review_rating": "9",
        "review_title": "This movie rocks and how !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "EditorVinodSingh",
        "review_rating": "10",
        "review_title": "Munna Bhai Lesson to Nation",
        "review_detailed_main": "This movie is a sequel to earlier movie \"munnabhai MBBS\" .As the earlier one was a complete entertainer and was framed on very emotional ground ,the new one is also based on certain values, emotion and feeling of life . This movie is not any tapori type but give insight to normal thinking of common people and also their problem. Director knows that if u want to teach the audience you have to have solid base and vidhu has made his ground with nation's father Mahatma Gandhi. one the one hand the storyline has been steady and binding through out on the other hand dialog delivery of each character has been kept near perfection. if i talk about anyone in the movie i must say sanjubaba is fantastic in his role as and in munna bhai. His presence in the movie is strengthened by his chelaram circuit . they seem to have good chemistry on screen and the same has worked in the movie. this movie is a complete family entertainer and anybody can go with the family to watch the movie. The concept of Mahatma meeting with munna bhai is good and giving other thought to the movie. you know i liked one more thing very much that is the way Vidya Balan pronounce gooood morningggggggggggggggggggggg mumbaiiiiiiiiiiiiiiiiii this movie is summation of drama emotions feeling self respect and over above healthy entertainer must see movie for everyone"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "zachary_hipp",
        "review_rating": "10",
        "review_title": "Once Line - First Class Perfect Entertainer! Must Watch!",
        "review_detailed_main": "Alwaysly we have expected lots of laughing from this movie.\n\nMunnabhai MBBS and Lage Raho Munnabhai are 2 Different Films. Characters are same but it's whole new movie, new story.\n\nMunnabhai MBBS had lots of comedy and drama. This one has it too. I can say this one is actually better in terms of keeping you looking at screen without blink. Reason, You can tell that more than half of part in first movie was comedy and little after that was sensitive drama. This Movie has Both of it, but you can say which part wasn't funny or which part didn't have sensitive feelings. It is one perfect mixture of Comedy, Drama that deliverers a Moral for today's society.\n\nSanjay Dutt needs no introduction. Arshad Warsi is at his Best. Munna & Circuit was hit and is super hit with this movie. Vidya Balan looks beautiful and has done her part best, so have other characters.\n\nStory is perfect, screenplay is perfect, direction, music...... everything is perfect. I am giving 9 from 10. Being Greedy for 1 Point as I wanted to see just little more of Munna & Circuit doing their Dadagiri Before Gandhigiri.\n\nThis is must watch film."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "QaReZmA",
        "review_rating": "9",
        "review_title": "A total different sequel",
        "review_detailed_main": "I did not dislike Munnabhai MBBS, neither did I love it\u0085 in my opinion it was OK, plenty of laughter and light moments, in fact a realization how much effect a jaadu ka jhappi can make to one's close people. The rare departure of a vasooli gangster to a kind hearted bhai is really adorable to watch, therefore I watched Lage Raho Munnabhai with no expectation at all, just keeping in mind the huge success and revolution it has made in India.\n\nI really respect the makers of LRMB for not trying to recreate any magic or moments of the MBBS prequel, neither did they bank on any aspect from the previous movie. In fact this was a fresh start for the characters and the whole storyline itself. With the success of this installation, I will not be surprised if Munnabhai turns out to be a famous franchise of Bollywood film industry, the first of its kind.\n\nThe combination of Munnabhai and Circuit manage to churn out plenty of laughter, at the same time bring realization among the youngsters who seem to have forgotten their roots and history of India. This movie is not just applicable to Indian community, but also throughout the world where all of us have forgotten to appreciate small things in life and forget to do good to others. The whole execution of the storyline is admirable, as there is no bit of rona-dhona, overly emotional or drama involved, yet it manages to reach the heart of the viewers.\n\nThe ending, is simply superb, one moment you might be feeling a drop of tear in your eyes, and the next moments its so funny, you just feel happy and fall in love with life. Watch it, otherwise its your loss."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Good natured, crowd-pleasing sequel, hilarious Warsi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "DesiBaba",
        "review_rating": "7",
        "review_title": "Bole to movie to Ekdam Sahi Hai Bhai!",
        "review_detailed_main": "Demag pay Taala Laga Ke Dekho to movie to Saahi hey Bhai! Paar Ek do bottle Dalene Ke Baad Ej Dekhneka, Kya? Aur comedies Ke to Esne Barabbar Ki Vaat Laga Dali Hai. Kaam to Sab Bhai log Ne mast Keiyela Hai. Timepass Ke Vaste to Saahi movie Hai. Gaandhiji Kaa Bhoot Bhi Dalela Hai movie Mein, Kya Jaakas idea Marela Hai! Isme Se Kuuch Sekhneke Vaaste to Khas Hai Nahin. Gandhigiri Kaa Zamana Nahi Hai Bhai! Vaarna Bade Pitaoge! Kafi Buddhe logo Ki drama Baji Bhi Bhar-Bhar Ke Dalela Hai, Thooodi Kam hone KO Maangta Tha Bhai. Gaana Bajaana to Apun Ne forward itch Kar Dalela Tha, Vaise Bhi Kuch Khaas Nahi Laga Apneko. Arshadbhai Aur Sanjubhai Dono Ki Jodi to Jameli Hai Bhai."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "harry2283",
        "review_rating": "10",
        "review_title": "the complete work of cinema(audio/visual treat)",
        "review_detailed_main": "i saw this movie on its first day of release and would say that its one of the best movie of this decade, finally a movie is made in India which can make lots of Hollywood flicks cry on their knees. The plot, sub plot, screenplay and dialogues are amazing, apart from making Ghandhiji more great and meaningful the movie itself is very fine piece of art and entertainment, this movie is an answer to those who say that if u wanna make commercial cinema u have to compromise on certain things, but this movie is artistic as well as a commercial hit....... a must must watch if u are a true cinema lover........ the movie is as good as the first munna bhai movie and who says u cannot repeat the success of an original one??... huh... the performance of arshad warsi and sanju is excellent, they can beat chris tucker and jackie chan any given day....."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "kooleshwar",
        "review_rating": "7",
        "review_title": "Gandhigiri Rocks!!! But the movie doesn't.",
        "review_detailed_main": "Like everyone else I to loved Munnabhai MBBS maybe not as much others but no matter what people said I had to see this film.\n\nIn this case however I feel the people have unnecessarily hyped this film.\n\nI really think people have not really liked this film as much as they think they did.\n\nSounds weird but lets see if this helps.\n\nJust answer the following questions...\n\n1)In 1 min can you name 3 scenes or more in the movie that were absolutely hilarious, or absolutely lovable? Most of the people I spoke to couldn't as opposed to the first one.\n\nThe best answer that i received is that this is Feel Good Film.\n\nMy sentiments exactly.\n\n2)So can you tell me 2 (3 is too much) scenes in the movie that really made you feel good or that you can relate to, something that you would aspire to incorporate in your life even though you know you may never do it.\n\nHmmmmmmmmm...\n\nYet to meet one person who was able to answer this in the the stipulated time satisfactorily.\n\nYET THIS MOVIE IS BEING HAILED AS THE BEST MOVIE OF THE YEAR, THE BEST MOVIE EVER, THE BEST MOVIE BY SANJAY DUTT ETC ETC.\n\nIts rating here is 8.5/10 hell that makes it one of the best Hindi movie ever.\n\nApply my simple questions to any movie you have seen that you feel you have loved as much and see how fast you are repeating the scenes.\n\nMy personal feeling that due to lack of any good releases Hindi or English in the vicinity of the movie and the marketing force that has been put behind this movie people are convinced its much better than it is.\n\nYet there is no denying the quality of this movie.\n\nThe acting is fabulous from the entire cast, I cannot think of a single character who has underperformed or overacted.\n\nArshad Warsi has excelled in this film and even though he will not be remember for anything special from this movie his role was much more important in this film.\n\nThis movie may have supposed to be a sequel but IT IS A MOVIE WITH THE SAME CAST AT BEST.\n\nThe Plot of the movie borrows nothing from the except the main characters no one in this film plays the role he played in the original.THIS IS NOT A SEQUEL FROM ANY ANGLE.\n\nI however consider this a good thing and goes to show the maturity of the audience who is willing to accept the fact that this movie is more about the characters than the storyline and almost no one is complaining about the plot holes.\n\nThe movie endears but at the same time there is blatant disregard for the facts such as Munnabhai is actually a criminal no importance is given to his past criminal activities.\n\nMarketing in this film luckily is not as blatant as the other films but I really don't think this new wave of promotional tie-ups and product placement (if it can be called that )is good for the industry.\n\nRead my review on Pyaar ke side effects to see how it should be done.\n\nThere were a couple of funny sequences for me such as circuits hopes of becoming great merely by going to jail and the earlier lottery system for giving the correct answers.(even i cannot name more than 2).\n\nHowever the feel good factor wasn't as good for me because frankly speaking I feel there are many much better movies (not recently though) in this regard.\n\nTechnically also this film is up there (as any film with this kind of budget should be).\n\nThe songs of this film are completely forgettable and are far below the league of the earlier one and also other songs out right now.\n\nThe first half is almost boring and pales in comparison to the second.\n\nDopnt get me wrong Gandhi was a great man and such a unidimensional look at a person can be a very dangerous thing we have to learn to deglorify our heroes and learn from not only his good qualities but also from his bad.There is no human who is perfect.\n\nI for one am not a great fan of Gandhijis political decisions while I am a great fan of his personal choices.\n\nIn all a film that is good but has been over-hyped to epic proportions.\n\nYet its a must watch but please don't go in expecting the world.\n\n-s HIGHLY Over-hyped, no really big funny or feel good scenes, poor songs, first half is boring compared to the second.\n\n+/-s not a sequel strictly speaking, Unidimensional look at Gandhiji.\n\n+s great technically, super acting, some good scenes and a good message at the end.\n\ntotal 7/10 (absolute and factoring in expectations)."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "email-671",
        "review_rating": "10",
        "review_title": "Please Lagey Raho Munna Bhai",
        "review_detailed_main": "Nice movie For the movie that teaches patience, it surely doesn't test ours right away, cuz thankfully it wasn't long like other so called big movies of the year. They kept it short and sweet. The movie was full of moments ... be it the laughters or the triumph of truth, both pleased the audience like a charm. The plot was intelligent to say the least as it carries a lesson in its comic theme. I don't know if any documentary on Gandhi could ever have an impact on such a mass audience; this one filled in a lot of trivia on Gandhi for me and it was truly inspirational. You can see some parallels to Rang De Basanti and quite ironically, these two seem to be the no.1 and no. 2 movies of the year.\n\nWhile it doesn't exceed the original Munna Bhai MBBS, it doesn't fall behind either. It does have its glitches and some weak script moments, but it can all be forgiven for its sheer brilliance and lively performances. You can't help but fall in love with Munna and Circuit; they just happen to create magic on the screen together. Vidya Balan plays her role well; she was very charming and outright adorable. Her 'Good Morning Mumbai' expression was cool. Boman Irani didn't have as meaningful role as the first one, but he did complete justice with it. He came out safe even playing the antagonist of the movie. The cameo trio of Jimmy Shergill, Dia Mirza and Abhishek were justified as well... well may be not Abhishek's role, but Dia Mirza added the glamor and Jimmy did his bit with one of the most sentimental scenes of the movie. The guy who played Gandhi deserves major props. The songs weren't forced and the cinematography is excellent ... the \"samjho ho higaya\" had excellent blends.\n\nWow... didn't even realize i wrote that much... i guess i was bit impressed :)This movie is beyond the traditional comedies like Hera Pheri, Chup Chup K and Malamaal Weekly, it has bigger than life moments. Abhi tak parh rae la hai, watch it already \"Mamu... boley tou Abhi-ich make a plan to watch it\", you won't be disappointed. The government should applaud this movie and name some towns MunnaNagar and Circuitabad to honor it. Afterall, which other movie teaches such lessons and gives tributes to the nation's founding fathers."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "silvan-desouza",
        "review_rating": "7",
        "review_title": "Superb successor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "abhijeet2525",
        "review_rating": "1",
        "review_title": "waste of time---result of over confidence",
        "review_detailed_main": "LAGE RAHO MUNNABHAI is really a disappointing movie . I have seen the first part of MUNNABHAI and it was really good but this one really make u bore n disappoint u.......................................\n\nThis movie really waste yours time and money . I went with my friend to this movie on the first day of its release and v both get bore in cinema-hall......................................................\n\nRole of CIRCUIT was very small n useless n this movie . I think SANJAY-DUTT cut down the role of ARSHAD VARSHI........................\n\nCharacter of the movie is also not well define like the previous one .this movie show u the result of OVER-CONFIDENCE .........\n\nThe ideas of MAHATMA is also not define and confusing..................\n\nA REALLY VERY BIG DISAPPOINTMENT"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "divyeshgmehta-1",
        "review_rating": "10",
        "review_title": "Hilarious",
        "review_detailed_main": "Big smile indeed...!if you thought \"Munnabhai \" was a hoot,this one goes beyond. Humour,compassion,loads of fun and romance...Acting,direction,editing and script are brilliant..! A must see... Sanjay Dutt and Arshad Warsi bring this sincere,funny,heartfelt and lovable performance to the screen..script avoids getting preachy and does not waste any time.. Boman and Vidya are classy and very good creating a light but credible story... Music was a let down but may be will grow on me .. all in all,kudos to Hirani and Chopra to have the guts to pull it of... The audiences were in splits almost all the time and I have not enjoyed an Indian movie so much in a long,long time."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "iampartha",
        "review_rating": "10",
        "review_title": "Munna, we all love you",
        "review_detailed_main": "simply, fantastic movie. After so many days a great movie like this has been released and after so many days we laughed so much. The best part is no repeated dialog from the part 1. The emotional scenes are also very good. Thanks Raj and chopra ji for the gift. I think they are true assets of the nation. The combination of munna circuit and Lucky is really super. They have shown Gandhiji's character with great respect and some concern.I couldn't stop my tears in some scenes and immediately i laughed loudly for the next dialog.I have seen the movie by paying double in black in Bangalore and it is worth. I was even ready to pay more. I am very happy that my favorite Munna bhai has high demand. Waiting for the part 3."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "Brilliant Entertaining Movie..Better then the First....MUST SEE",
        "review_detailed_main": "Munnabhai MBBS was a Fabulous movie that was very entertaining. Looking at the trailer and storyline i assumed the Second Munnabhai will not bee as good. I was wrong, I absolutely Loved the second one much more then the first. There is plenty of humour with mature comedy, with lots of heart warming scenes mixed with serious issues providing High Class Entertainment. Sanjay Dutt is Superb yet again portraying the lovable Good hearted Goon. Arshad Warsi is fantastic as the loyal sidekick, He is brilliant in almost every scene. My Favourite Scene has to be when Munnabhai and Circuit hug and make up, a very heart warming scene. Vidya Balan is alright i guess although her voice is a little annoying when she repeatedly says Good morning Mumbai! Boman Irani is great just like the first. Jimmy is hardly there and could of been deleted out. Diya Mirza looks Sexy and was perfect. This is a FANTASTIC MOVIE and deserves to win awards."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "lovelywaz",
        "review_rating": "10",
        "review_title": "L.R.M.B 100 Times Better Than KANK or Krrish, Reason: Because its Original",
        "review_detailed_main": "So far best movie of this year, there were one or two scenes which I thought too much Drama, but I will ignore because overall the movie was damn good. And best thing I liked about this movie is, Its Original (IMO). Not a copy of any movie or some scenes stolen etc. etc. etc. .............. I might go for 2nd time again ;)\n\nMy Review == 4.8 / 5 ( - 0.2 because of 2 scenes with too much Drama )\n\nActing ............ All did very well and played their characters so dam good\n\nMusic .......... You will like the songs more after watching the movie Direction .............. Excellent Story ........... Wow!!\n\nRecommend to others === 100 Times better than KANK or Krrish :) Go and Watch the movie and decide yourself.\n\nBonus == Eklavya Trailer :) :) :)\n\nWaiting for 3rd Part, If they decided to make it and when ever it will release :)"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "tintinherge",
        "review_rating": "7",
        "review_title": "Worth a watch",
        "review_detailed_main": "Lage Raho Munnabhai gives you what you expect from the movie - It does what it says on the can. Its more of the same, just another serving. So if you enjoyed the first one and want a similar experience, go watch it - You wont be disappointed. The script goes a bit awry towards the end but the screenplay is good. As can be expected, the chemistry between Sanju and Arshad is tremendous and keeps the audience smiling,laughing all 3 hrs,almost. If the movie becomes a super-hit, which I can see happening, expect this pair to go down in Bollywood history books. Full marks to whoever wrote the dialogues, jokes, one-liners for Arshad and to Arshad himself for the class comic act. I have been warned not to watch \"Anthony Kaun Hain\" but after this performance, Golmaal and Salaam Namaste, its hard to resist going for a cheap rental DVD.\n\nFor the entire review, go to : http://sharadslife.blogspot.com/"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "gaurav_bandhu2000",
        "review_rating": "9",
        "review_title": "Keep Going Munna and circuit",
        "review_detailed_main": "Movie is released today in Australia, its a dam good movie but with small gaps (which we can say away from munna bhai and circuit) ,most of the characters r same in the movie as of previous but totally different story( no relation with previous movie). Every one has done a good job and after this movie i m in love with Vidya Balan, she looks gorgeous. She has improved her acting to much as compared to Parinita. One last think thank good \"a nice relief from KANK \". A nice entertaining and lovable movie. Songs r good , some u can listen for no of times. I miss \"MAMU\" word , which is used very less in the movie.\n\nOverall i give 9/10"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "HeadleyLamarr",
        "review_rating": "7",
        "review_title": "Bache raho munna bhai",
        "review_detailed_main": "I thought that now that Sanju Baba has been convicted I need to prod myself to write a comment on this film. I hated Munna Bhai MBBS so I was resisting this one for the longest time. But the actual viewing turned out to be a pleasant surprise. I actually liked the film. It was repetitive and not very funny but it had its moments and it did achieve some of what it set out to do - bring front and center the fact that we live by completely different rules these days and wouldn't it be nice to change that. Sanju Baba was quite good as Munna Bhai, Boman Irani was awesome as his boss, Vidya Balan was adequate as the DJ, the entire assemblage at second innings house was great, but the show-stopper no doubt was Arshad Warsi as Circuit. The man is awesomely talented and made Munna Bhai a decent and watchable film.\n\nIf you believe in Gandhian philosophy you might get upset at this new version called Gandhigiri. If the message is to twist Gandhian ideals into a new more menacing avatar then that is a scary thought. But if the film is really just poking fun and not trying to be very serious then you can chill and watch it without too much trouble. The thing is, I am not sure what the film is trying to do. However, it does bring back into notice the Mahatma and his life - so it does achieve some useful purpose. Afterall - Bande me thaa Dumm, Bande Mataram."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "pinaki-poddar",
        "review_rating": "10",
        "review_title": "Art of Humor at its best",
        "review_detailed_main": "Here is a movie that can make you laugh and cry at the same time. A nation that proclaimed one of the most remarkable humanist of the last century as 'the father of the nation' at the euphoria of most unique mass-movement to gain independence from British colonial rulers -- erected Gandhi's statue everywhere, named every main street as Mahatma Gandhi Road, decorated every Government office with his portrait ... and in a feat of amnesia forgot all about the unique message of this 'half-naked fakir'.\n\nThe director, Mr.Rajkumar Hirani had accomplished the masterly act of reviving Gandhi's timeless message in a humorous wrapper through underworld don Munnabhai (Sanjay Dutta) and his loyal lieutenant Circuit (Arsad Warsi) in contemporary Bombay bursting with cellphones, satellite radios with such acumen that will make you burst out laughing. But in the footsteps of great master Charlie Chaplin, Mr.Hirani is well aware of the art of humor -- as Munnabhai encounters every problematic situations -- be it eviction of senior citizens from '2nd Innings Home' by a greedy builder (Bommani Irani), or a young man who lost his father's savings in the quicksand of stock market or the bride-to-be with an unfavorable horoscope -- Gandhi advises him on strategies that are diametrically opposite of typical 'underworld strategies' rooted in violence. Gandhi tells Munnabhai that it requires more bravery to apologize than to commit violence or love is more powerful than hate. These moral messages come through in hilarious circumstances and never in a preachy manner -- again to establish the maturity of the director to assume a matured audience. The wave of progress is sweeping India -- and some quarters of the society worries the impact of such rampant changes on this old civilization -- but the artist like Mr.Hirani brings out the true power of Indian culture -- that always assimilated the foreign influence with a moral, non-violent, humanist message embodied in Mahatma Gandhi ."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Scrooge-3",
        "review_rating": "7",
        "review_title": "Entertaining and Fun",
        "review_detailed_main": "This is the first Bollywood film I have seen, and I enjoyed it very much. The story was funny, romantic, and even contained a strong moral lesson. The actors all seemed to do a good job -- it is harder to judge with a subtitled film. The songs were generally well done and not too intrusive. The cinematography, costumes, and set design enhanced the film -- and made me want to visit India some day. About the only suggestion for improvement would be to shorten it a bit -- this was at least 30 minutes too long for a comedy/musical, in my opinion. One technical gripe about the DVD: the commercials at the beginning were too long and unable to skip."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "raja_bhat",
        "review_rating": "5",
        "review_title": "A good and honest attempt",
        "review_detailed_main": "I give the film 5 rating not because I did not like it but because of the lack of sophistication in it. Just like writing, painting, composing; film-making is an art. That does not mean that it cannot use coarse language or local dialect, but it should have more than that. This is the only drawback of the film. In any work where Gandhi is a major theme, one needs to be a thinker rather than just a moviemaker. Gandhi is not a simple subject, and it is better to leave it to the intellectuals to deal with it. Yet I thought the filmmaker did an excellent job handling the contradictory ideas such as 'if someone slaps you don't retaliate but show him the other cheek'. But it was presented in a literal manner than its inner meaning. We must be taught that Gandhi was a pacifier and that is most important. All great personalities around the worlds are pacifiers and to understand that we need to develop a rational mind, not 'Gandhigiri'. Apart from this, the film did an excellent job handling the social issues. The most fascinating of all is the way it ridiculed the superstition of our society. Superstitions are rooted so deep that real hard kick on their bu**s from films like this one is a treat to the modern movie-watchers. Great job in that department of bu** kicking! The emphasis on the usefulness of scientific reasoning is another area where the film excelled again. After watching the film I thought that the filmmakers went through a lot of intellectual discussions before filming it. This is rare in Bollywood. The filmmakers also tried to keep the usual Indian melodrama aside. I must agree that they did a fair job in that department too. Except for a very few places, there was no melodrama at all. Overall, leaving aside Gandhi philosophy and some overacting (a common problem with Indian cinema), it is a good work. I'll remember it for a long time. Although it is a good film for Indian people, but has a limited appeal towards greater audience, which is not a negative point at all. If it is a good film and gives Indians something to use their brains, who cares if it is not Oscar-worthy?"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "imurnitin",
        "review_rating": "10",
        "review_title": "must watch movie...",
        "review_detailed_main": "We live in a cynical world, but even in such times, sometimes a person, book or film comes along and shows you a tiny crack in the wall behind which there is a lot of light, and suddenly your heart is full of happiness.The music of the film seems okay when one listens to the album in isolation, but watching the film, the songs are exactly what the film needs, pleasant and soulful throughout with a background score that enhances them, using the sound scape of the songs itself. The cinematography and the production design complement each other and stay true to the film.Lage Raho Munnabhai is one such film that makes you laugh,makes you cry, and also makes you feel good to be a human being."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "kzfy",
        "review_rating": "8",
        "review_title": "Munnabhai Ko Alvida Naa Kehna",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "vivek-udz",
        "review_rating": "9",
        "review_title": "Refreshing",
        "review_detailed_main": "Death of Hrishhikesh Mukherjee marked end of an era in Bollywood, but with Lage Raho Munnabhai, it seems there is someone who wants to keep the tradition alive. Mr Hirani, with this movie, is all set to prove that viewers still love movies without \"Item Numbers\" and \"Skin Show\". This movie comes at time when everyone is going ga ga over \"Rang De Basanti\" and Mr Hirani dares (rather, makes a sincere effort) to convey exactly opposite message of what was conveyed in RDB. I bet, everyone will agree that he is successful. Confidence and excellence of this director is proved by fact that it was not an easy job to put \"Gandhian\" morals in mainstream commercial bollywood cinema. For viewers, this movie has in store a very fresh script, complimented by excellent direction, music and most importantly editing. Though the story is very much predictable, but it is overcome by powerful direction. This movie makes you go emotional and smile at the same time\u0085. Munna saying sorry to circuit is one such powerful scene. All the scenes of so called \"gandhigiri\" by Sanjay Dutt are very well shot. Though the director has used few jokes and scenes from Munnabhai MBBS, but he knows his limits and makes sure that the repetition is not irritating the viewers. Viewers still enjoy same old jokes. In today's world, when even Gandhiji would have given second thought to his ideology (no offense meant) here is a director that conveys them out loud and in a manner that everyone enjoys the same. All said and done, the movie has its flaws, Boman Irani and Vidya Balan's characters provided little scope to showcase the acting talents. Overall a wholesome entertainer. Though the director may not change the world, but at least when you are watching movie, he succeeds in making you believe that \"Gandhian\" ideology works in modern world too."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "acehearts",
        "review_rating": "9",
        "review_title": "at last a really funny Indian movie",
        "review_detailed_main": "Don't really find Hindi movies funny, apart from Johnny Lever, But, this movie was just really funny!!Never really liked Sanjay Dutt so was not excited to see this movie at all, But this one is just so funny. Its Arshad (man in black T-shirt- Moorli's side kick) who makes the movie a real success. His timing and expressions keeps audience wishing there are more scenes with him. I had tears when Gandhi appeared giving this movie a very serious message, about loving people and standing up and being counted even when its so obvious you are fighting a losing battle and about truth. Very thought provoking movie and movie that will spark discussion. Its about time that a movie like this was made.Something for everyone.Gandhi- long may you live in spirit!!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "rai_maximus",
        "review_rating": "6",
        "review_title": "A Sweet, Innocent Bollywood entertainer which gets a little too sacharine .... It is able to deliver the Mahatma's message in a more easily digestible form",
        "review_detailed_main": "The Movie starts off with that (in)famous song - \"Subah ho gayi Mamu!\" and a gag that will leave you laughing your arses off. As usual, Arshad Warsi as Circuit steals the show with his wisecracks that range from the silly to the absurd, but never fails to tickle the funny bone. It then proceeds to slowly unravel both the characters and the plot and switches from one gag to another, from one subplot to another with great ease.\n\nThe casting is just spot-on. Boman Irani as the evil-Builder/doting father delivers another great performance. Dia Mirza and Jimmy Shergill have their bits and essay it with conviction. The oldies group also does its bit with some fine ensemble acting. Sanjay Dutt as Munnabhai is just sublime - his interactions with \"Gandhi\" are very nicely done. The actor who essays the role of \"Gandhi\" has delivered a rock-solid performance. But, the one man who steals the show completely is Warsi as Circuit. I hope Mr. Hirani writes many more scripts centering around this great caricature of a gangster's goofy chamcha!\n\nVidya Balan is of course just a whiff of fresh air, amidst the tanned/exposed and hyped up set of actresses - she blends perfectly into the role and besides, its a great visual treat to see her on screen. However, the one thing that she does wrong is the \"Good Mooooorrrrrning Mumbai!\" - The phrase is repeated so often and with such an annoying intonation, that you wish to personally quieten her down!\n\nWhile the 1st half delivers most of the rib-ticklers, the 2nd half has its share of funny moments, although they are far and few. There are many high-points in the movie, so many so that its difficult to pin-point any one. The 2nd half of the movie admittedly becomes too saccharine and sentimental - at times, the situation is dramatized to such an extent, that it becomes a superficial and forced attempt to elicit teary responses from the audience. In that sense, the movie could have done away with less melodrama and a more mature view of the situation.\n\nAnother small point that must be made with regards to the melodrama is the annoying practice of showing flashes of either smiling/weeping faces, which accompanies each of Munna's accomplishments. In the 1st movie, they had wide-eyed, smiling nurses and weeping sweepers/ward-boys in the background - thats okay (by okay I mean tolerable). But here, Mr. Hirani employs the services of Barbers and customers at the Barber's, Police Inspectors and regular people - and strangely all the faces were masculine. Mr. Hirani, a feminine face is far more astute at portraying emotions - its not Rocket Science to get that. At least the nurses were decent and visually pleasing. Whats with the Masculine attraction, Mr. Hirani?\n\nWhere the movie delivers, however, is the perfect blend of Gandhian values, Patriotism and a modern-day India which thrives on individualism. It doesn't overload viewers with a barrage of statistical information or documentary style detached narration or \"preachy\" dialogues. What it uses is : kick-ass street-smartness + wisecracks by Circuit and Munna + Gandhi's Teachings + Patriotism\n\nAnd this results in both 'paisa-vasool' entertainment and also ensures that you leave the theatre with a renewed sense of hope and vigour to your bit for your country. True, that this brand of pop-partiotism and wisecracking-Gandhism is hardly a concrete solution to India's problems, but what the heck! You certainly wanna believe badly that the solution could be a gun-toting Munnabhai and his knife-toting sidekick Circuit.\n\nBottom-Line: This is NOT as humorous as the 1st movie - it doesn't pretend to be either. What it is though is pure family entertainment at its best. After a long long long time, Bollywood has produced a movie without Raakhi Saawant and item numbers, without crunching explosions and 3rd rate special effects, without borrowed Hollywood/Japanese/Korean scripts. This movie is sweet, innocent and pure, yet street-smart and total dhamaal. Go and watch it with your friends and/or family - this is one movie that everyone can enjoy! Kudos to Mr. Hirani and his team! They have stopped making movies like these!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "swapnil-shahane",
        "review_rating": "10",
        "review_title": "Funny lovely with moral msg,pure entertainer, Munna-Circuit Rocks!",
        "review_detailed_main": "This is bollywood.. Perfect blend of rib tickling comedy, sweet emotional moments, strong social message and a charming love story.\n\nThere are few things (which cant be mentioned as flaw, but..) Songs are good but nt what i expected from it except d unique whistle tune of munnabhai. All the old peoples are introduced in initial scenes are not given to establish in remaining movie.. Whatever but these are just minute things\n\nTons of Positive things Superb screenplay, Good script, Perfect blend of mass and critic appealer. Superb chemistry between lead characters (of course i am talking abt Munna-Gandhi n Circuit) I can nt give it less than 9\n\ni keep mesmerizing Circuits ubique funny dialogue."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "chandrabhanusolanki",
        "review_rating": "7",
        "review_title": "Gandhigiri",
        "review_detailed_main": "This movie is quite enjoyable, you will enjoy the timing of comedy and punches. The use of radio as a powerful medium in this movie is good effort. The faith in principles of Gandhi can lead you some place where you can be a good person."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "smartrittik",
        "review_rating": "10",
        "review_title": "best movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Kdosda_Hegen",
        "review_rating": "4",
        "review_title": "It's in a way remake, not a sequel.",
        "review_detailed_main": "This is a huge disappointment. I loved the first movie but this film is just a remake and a bad one. It is in no way a sequel since it does not follow any events of the first film and secondly, many actors now play completely different characters. This film has redone many ideas and scenes and plotlines from the first film. It's as if alternative version of the first film and not a sequel. Other than that, on it's own this film is not good. It's not funny and while storyline has some good morals, the execution is very weak."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "runi_star",
        "review_rating": "9",
        "review_title": "Coming of the new age sequel!!",
        "review_detailed_main": "\"Kitne aadmi the\", \"Mogambo Khush Hua\"; these epoch - making dialogues were from different directors. But once in a lifetime, it happens that \"Jaadu ki Jhappi\" and \"Gandhigiri\" coined by the same man get popularized and that too back to back. Bravo Mr. Hirani!!!\n\nIf the faith healer worked in Munnabhai, \"Gandhi\" worked for Lage Raho Munnabhai. Keeping the basics i.e. comedy intact, Hirani changed everything. I think this is the beginning of the new age sequel pioneered by Hirani. It is so similar yet so different.\n\nWitty dialogues, well written screenplay, good comic timing, and well thought about characterization. Everything is so common. The only uncommon element is the plot and the backdrop.\n\nIt's the screenplay, all the scenes just flow and are well knitted. Nothing is enforced. Our Munnabhai falls for Jhanvi, Vidya Balan who is a radio jockey. Vidya has a good screen presence and amazing dialogue delivery.\n\nThe quiz contest on Gandhi, Murli Prasad aka Munnabhai winning the contest and his eventual entrance to the Mahatma Gandhi Library, are all very situational.\n\nSanjay Dutt reading n number of books on Gandhiji is a bit indigestible, probably that's the reason Gandhiji comes out of the pages and that too without spectacles!!! I was kidding\u0085ever saw Gandhiji without Spectacles? It's same as Sanjay Dutt with Books!!!\n\nJhanvi arranges a lecture on Gandhiji for her grandfather and his friends at their place fondly called as the second innings home. Munnabhai being the professor and Gandhiji, one man rescuer.\n\nIt was at the second innings home that their feelings get mutual. Here is the entry of the cunning Sardar Lucky Singh!!! Boss what characterization!\n\nHe looks very convincing as the greedy builder. It's him that moves the story ahead as he sends them to Goa and takes possession of the second innings home through Munnabhai's right hand Circuit.\n\nI must say that Circuit just steals the show. He has developed himself as an actor with great coming timing. In spite of repetition of the same character, he has managed to make people roll out of their seats. It's the powerful performance of the character that makes you feel the need of a Circuit in your life!! Jimmy Shergill and Diya Mirza do justice to their respective roles.\n\nThe phone-in programme on the principles of Gandhiji is a brilliant idea, very original.\n\n\"Gandhigiri is in full swing\".Gandhiji tried to be preachy but the presence of people like Circuit and Lucky Singh diluted the effect making it a film with a vision. The show leaves you with nothing but a smile on your face and the theater buzzes with Pal, Pal, Pal\u0085Pal Har Pal"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "paulsmithson-192-243826",
        "review_rating": "9",
        "review_title": "A film of two halves",
        "review_detailed_main": "For me the start of this movie was so cheesy I actually turned it off as after watching the first ten minutes or so I really didn't think it was something I'd enjoy. However, my wife and I decided to give it another go and we stuck with it and managed to get beyond the terrible opening and boy am I glad we did.\n\nAs the movie progresses it just seems to get better and better in every way. The story unfolds in a magnificent way, the characters become less two- dimensional, and the message of the films shines through so brightly ... well, I won't say any more as I'll leave that for you to discover.\n\nAfter the first ten to fifteen minutes I would probably have given this movie 3 out of 10, but by the time the final credits rolled that had gone right up to a well earned 9 out of 10."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Paul_Lunberg",
        "review_rating": "9",
        "review_title": "\"Lage Raho MunnaBhai\" is a super family movie",
        "review_detailed_main": "An absolutely delightful movie, complete with possibly the world's most beautiful woman. My wife and I saw this movie in Jaipur while on holiday in India and, despite not understanding the language, we were able to follow the plot. Indeed there were tears in our eyes during some of the time. Music good and the dance \"dream\" sequences quite fabulous. I read that the movie has increased youth awareness of Ghandi and his beliefs which must be a big plus, I wonder if the producers will issue an English language version? It would be valuable if some of our Western Youth were able to learn a little of the thoughts of this great man. Meanwhile the film started with a really funny sequence which set the pace for a relaxed couple of hours of entertainment. A \"gotta see\" movie!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "arkasamanta",
        "review_rating": "8",
        "review_title": "Better Than the First Part",
        "review_detailed_main": "When I went To see this movie, i had a lot of questions in my mind. Will it be good? Will it'll live up to its expectation? How will be the acting? etc etc. But when I saw this movie, I was simply moved by its Storyline.\n\nIts a fresh story, from scratch. (So don't Confuse yourself when U'll see Boman Irani as a Punjabi Fellow.) So Out goes Gracy Singh and in comes Vidya Balan. She did a fantastic role as a RJ. Sanjay Dutt and Arshad Warsi are simply Superb!! No comments could actually describe their performance.\n\nThis movie has lots of surprises, catchy lines, and not to forget a very good moral for todays world. Make it a note to watch this Great Movie. Hats off to Vidhu Vinod Chopra."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "xagt-89071",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "Though this movie feels obsolete and too typical bollywood happy ending, but this movie teaches us morals, Munna bhai is a gangster, never in his life he did anything right, but the moment he read about shri mahatma gandhi his life changed, we all know about him but still are forgetting his principles day by day.\n\nI think to honor his words and deeds, this movie deserves an applause. 👏 👏 👏"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "way_heaven_skerboi_extre",
        "review_rating": "9",
        "review_title": "I wouldn't say the best but definitely a very good movie suited for all generation.",
        "review_detailed_main": "Its not fictional and its not real but a very good movie with lots of humor and fun. When i say its not real, i mean to say that the way Muna solve everyones problem is a correct way to do but it doesn't happen in real life and the scene when he sees Ghandhiji. But the movie doesn't deal with this, it deals with comedy which has been portrayed in a wonderful way. I must say its not like other comedy movie. This movie is the best movie so far to me and i am preety sure it should be for others to coz it is. Krish has been the biggest grocer of the year so does Fanna. If the movie like Fanna can create huge box office, Definitely Lage Raho Munabhai should. The movie that i liked so far in 2006 are RDB, Phir Hera Pheri and Kank. I must say lage Raho Muna bhai is far better than this all.\n\nGood work by Sanju and Warsad"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "vinitb",
        "review_rating": "10",
        "review_title": "Teaches more about Gandhi than all schoolbooks combined",
        "review_detailed_main": "This is an AWESOME movie!!! This movie makes a rare and updated review of what made Mahatma Gandhi the perfect freedom fighter with his simple skills of honesty and non-violence. It is a very enjoyable movie that can be enjoyed by the whole family. A movie on Gandhi obviously doesn't have a lot of violence or bad language!\n\nSure, this is one of the funniest movies ever. If for nothing else, watch it as an excellent comedy. This is an Indian movie that can enjoyed by everyone around the world. If you can watch it with a Hindi speaking friend, that much the better.\n\nSomething interesting about this movie is that is uses characters from another movie (Munnabhai MBBS) but is not really a sequel. So don't worry about trying to watch the first Munnabhai movie before this."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "eh5963-297-967354",
        "review_rating": "9",
        "review_title": "Get Well Soon Mamu!",
        "review_detailed_main": "A goon promoting the principles of Mahatma Gandhi - Sounds unusual and ironic, doesn't it? No big challenge for Raju Hirani who transports the viewer into the colorful world of Munna and Circuit. LRMB leaves you with a huge smile refusing to fade away alongside a number of beautiful lessons in a very enlightening manner.\n\nMunna and Circuit are small time goons who work for Lucky Singh. Munna is in love with Janvi and pretends to be a history professor and tells her he is a big follower of Gandhi to impress her. A turn of events leads Janvi to know Murli's truth. What happens next? Watch LRMB and find out.\n\nLRMB is one of those rare films that never lose steam. There's a perfect mix of comedy and emotions. Best of all, it has tremendous repeat value.\n\nScenes to look out for? Too many but here's a few.\n\n\n\nThose are just some of the moments not to miss. Actually, you really cannot afford to miss any.\n\nMusic is okay but sounds much better in the movie. Situational like the last Munnabhai.\n\nThe writing is nearly flawless and dialogue is applaud worthy. Just brilliant. They tear you up, either in laughter or emotions.\n\nVidiya Balan is fantastic. Suits the role to the T. Boman Irani is first rate. Gives a fine act. Diya Mirza, Khulbushan Karbhanda is as always. Jimmy Shergill is good. Ditto for Surab Shukla.\n\nSpecial mention for Dilip Pravakar as Gandhi. He's terrific.\n\nOf Course the 2 goons steal the show on screen as Munna and Circuit. The acting, the chemistry, the delivery - just astounding. Brilliant act by both. Sanjay Dutt is born for this role and he does full justice. He's lovable. Arshad Warsi is at his best when he plays Circuit. He brings the house down with some of the best lines.\n\nThe hero off screen is director Raj Kumar Hirani. Great execution and story telling by this gem of a director.\n\nOverall, a brilliant feel good entertainer worth watching unlimited times."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "singhbul",
        "review_rating": "9",
        "review_title": "Excellent Movie",
        "review_detailed_main": "Incredible movie, an eye opener and a ready reckon. Don't know when do I have seen such a wonderful movie, which directly affects the ill practices of the society. If you ask my I would give 9 out of 10. One may ask why not ten, this is because Sanju 'baba' doesn't seem to be 'baba' now at this age. Come on boss he is grown up now. His growing age is visible all through the movie in spite of the heavy make-up he has put on. No doubt he is a wonderful actor, but his characters at this stage of his career shall be commensurate with his age, say elder brother, uncle etc. I liked his movie 'Mission Kashmir'. It was an outstanding movie with his excellent acting.\n\nHowever there is a big question ahead should we, taking lessons from the movie act in the same way and make people asking for bribe ashamed in front of the society or should we not do anything at all and just accept it as normal practices as it is now. The bigger question is even if we adopt the lessons from the movie how much will the stubborn, corrupt bureaucracy who are neck-dipped with all kind of ill practices will be ready to take the challenge and change for the better. Overall a good movie to be seen at least twice."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Sparrowmaniac",
        "review_rating": "10",
        "review_title": "Perfect, just perfect",
        "review_detailed_main": "I don't think you can actually make movies that can be rated 10 on 10. But Lage Raho is just one of those. Its just flawless. It is a real laugh, with some strong messages in it.\n\nBased on its prequel, MBBS, Lage Raho, features the two primary characters, Munna and his henchman Circuit. True that MBBS, focused on the primary characters a bit more, whereas here, the focus is a little less, since the director had to accommodate too many characters here. The entire cast seems to have remained the same, but unlike MBBS, where the comedy was in short spurts, Lage Raho is a constant laugh. The only negative aspect that this movie seem to have is the lack of proper songs. MBBS had far more superior songs compared to these lame tracks, but what the hell, I am here for the movie review right ??\n\nVidya Balan looks amazing in this movie, looks wise and acting wise. Sanjay Dutt is the same Munna, with his swears and typical 'Tapori' language. Circuit has a much larger role to play here than the previous movie. But still he is a killer. Boman Irani, yet again puts on some heavy make up, but that doesn't mask his amazing acting abilities. He is fast catching up to Paresh Rawal and Johnny Lever with regards to comedy. Diya Mirza and Abhishek Bachchab gives more of guest performances than a proper role to comment on. Jimmy Shergill's character is shorter than the previous outing, but still he has a credential in this one.\n\nAll in all, in MBBS, where the message of the movie was very strong, here, the message is kept subtle throughout the movie, until the very end when a five minute sequence projects strongly the theme of the movie. I wont go on harping on the plot because almost everyone knows about it. The direction is superb, acting superb, camera work, whatever was needed was superb. All in all, 10/10 !!!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ashishmalgi",
        "review_rating": "9",
        "review_title": "Excellent !! Send it to Oscars",
        "review_detailed_main": "This is really great movie I have seen in a very long time. Very well written and well made. I had never thought Bollywood would have some people who can think and produce such outcome.\n\nThe movie is all about Gandhi's principles and those executed by a gangster called Munnabhai. The finest performances by Sanjay Dutt, Vidya balan and Arshad Warsi take this movie to the next level. The film is very funny and you can not stop laughing for 3 hrs. The movie also has a very good message which most of the bollywood movies lack.\n\nArshad Warsi truly deserves a National Award for his performance. The real hero of this movie is Rajkumar Hirani the director of the film. I really feel that movie should go to Oscars as official entry from India."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "mridulmmishra",
        "review_rating": "10",
        "review_title": "Lage Raho Munnabhai",
        "review_detailed_main": "Bole to Apna Bhai Fir Se Waapis Aa Gela Hai Re Maamu!! and to say the least with the same glamor, style, fun and sentimental heart... I dunno whether Bollywood produced such a good sequel before... but this one is really as good as part one if not better... Movie starts with the same type of scene as it started in first part... just to remind u of offbeat tactics and offbeat character of Munnabhai!! First half makes u roll on your seats with laughter... u just cant help... Murli Prasad Sharma and Cirkeshwar in their old form... though sometimes u notice Cirkeshwar is more sophisticated than the previous movie.. but as movie progresses u stop noticing differences and just enjoy whatever u watch... Second half starts with slow scenes and u start wondering whether all the hard work in first half is gonna perish as in all the Bollywood movies... but then movie catches up after some time... and u are given small doses of laughter in every scene whether sentimental or serious... I find songs good, fit to the occasion and choreography really innovative specially Samjho Ho Hi Gaya... where song is shot in a single Gulli!!! wonder why Yashraj Needs those costly foreign locations... Creativity beats everything... Gandhi.. a difficult subject to handle for anyone... but director shows his maturity and u never have overdose of HIM!!! all in all a good watch... have fun ride people... and wish Best of Luck to Munna and circuit for their all future adventures...\n\nwish Circuit would have got more lines... but then doesn't matter because we always expect more than what we get..."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "manab_saha",
        "review_rating": "8",
        "review_title": "Lage Raho",
        "review_detailed_main": "i am coming rt from the theater n man i am compelled to comment....what a perfect combo of comedy,emotion,drama n of course a message or two.This movie makes ya believe Big things can be done simply.Yes Mahatma is still relevant 2day n will be like that 4ever.\n\nVidya Balan was mesmerizing...may be better than Gracy Singh(Munna MBBS n Lagan fame).Sanjay is gr8.Boman Irani was good as usual.n Arshad...Arshad who??Are bole to apna Circuit bhai.Tell him to build a new bangla....coz he will fall short of space due the awards he is going to receive.\n\nWell, abt the movie- first half is flawless...n in early 2nd half it at few times some wud feel it a bit lecture type but that goes along well 4 me..no issues...given the standard of the movie.Length of the movie is quite perfect...it will never bore u(unlike Fanna).\n\nPS:-Do keep a hanky with urself in case u shed a tear of two...n i bet even the hardest of the lot will do so.\n\nHey wen is the next sequel going to come?Watin 4 it from 2day only."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "jaskunwar993",
        "review_rating": "9",
        "review_title": "Where Gandhigiri meets Dadagiri...with a touch of \"chemical locha\" of course!",
        "review_detailed_main": "OK, whether you agree with me or not, I know that i agree with myself - this is one of the most enlightening, entertaining, and touching movie I have seen till date. A touch of \"Dadagiri\" in Gandhian philosophy will have you rolling with laughter, and moving your heart every next second or so. The cry of \"Good morrrrrrrning Mumbai\" shall lift your heart, and the evolution of \"Dadagiri\" with a \"locha\" forming \"Gandhigiri\" will at times have you crying (atleast inside your heart!!!\").\n\nOne thing is clear with me - just as soon as you see the last frame of the film, your mind will be begging for a \"chemical locha\"...\n\nOne great riveting ride! Lage Raho..."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ckumar",
        "review_rating": "9",
        "review_title": "LRMB rocks!",
        "review_detailed_main": "OK, so the 'Gandhi' is one of the ugliest you've ever seen...but use him just as a poor prop for the man's personal image you have... and the heroine doesn't quite succeed in capturing the heartfelt exuberance of Robin William's \"Good Morning, Vietnam\"... But minor sins these in an otherwise honest to goodness farce that makes you laugh and cry all the way! Sanjay Datt as Munnabhai and Arshad Warsi grown far bigger than a regular sidekick as Circuit, carry on spiritedly from where they left in Munnabhai MBBS, and enliven the bigger canvas of love, life and yes conscience (abstracted as a 'chemical locha (trouble)' of the brain!! Selling Gandhi to my young generation is like selling spinach to my young daughter....you haven't got a chance, unless prob'ly Popeye eats the spinach and well, Munnabhai practices Gandhigiri! This is the best achievement of this movie...it works!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Paritosh",
        "review_rating": "9",
        "review_title": "Must Watch",
        "review_detailed_main": "Bollywood has a history of copycats.Leave sequels, you watch a good Hindi movie and later find out that it was copied from some English flick.\n\nLage Raho Munnabhai defies history by not only providing a pristine script but also provides healthy comedy in a sequel meeting all expectations. Vidhu Vinod Chopra has yet again blended emotional drama with characters and has come out clean giving a message to the society.\n\nDil chahta hai ,Rang de Basanti ,Munnabhai,Krrish have been movies which clearly depict the progressive and maturing behavior of bollywood in the past few years.\n\nLage Raho Munnabhai not only makes you laugh but reiterates that how a common man can play a powerful role to change the society.How following the right path is important in life.Vidya Balan again proves how talent is not only with the big stars and plays a bubbly RJ of mumbai city. Circuit is as fresh as ever with his commitment to Munna but the whole storyline is new.\n\nA must Watch"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "Fun to watch as always a raju hirani movie is always made with perfection. Not taking anything away from this movie but I think part 1 was better."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "abhi-16044",
        "review_rating": "10",
        "review_title": "A masterpiece !",
        "review_detailed_main": "Raj Kumar Hirani really nails it with Lage Raho Munna Bhai. What a movie guys !!!! Definately a must watch movie for everyone.\n\n10/10 from me."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "abphadore",
        "review_rating": "10",
        "review_title": "Bhaigiri meets Gandhigiri",
        "review_detailed_main": "\"Lage Raho Munna Bhai,\" directed by Rajkumar Hirani, is a brilliant follow-up to the 2003 hit \"Munna Bhai MBBS.\" Released in 2006, this film continues the story of the beloved gangster Munna Bhai, played by Sanjay Dutt, and his loyal sidekick Circuit, played by Arshad Warsi. With a perfect blend of humor, heart, and a powerful message, this film elevates the franchise to new heights.\n\nPlot and Execution:\n\nIn this sequel, Munna Bhai, still the kind-hearted gangster, falls in love with a radio jockey, Janhavi (Vidya Balan). To win her heart, he pretends to be a history professor and a Gandhian. His life takes a turn when he starts seeing the spirit of Mahatma Gandhi (Dilip Prabhavalkar), who guides him through various challenges. Munna, inspired by Gandhi's teachings, starts a movement of \"Gandhigiri\" to solve everyday problems with non-violence and truth.\n\nStrengths:\n\nPerformances:\n\nSanjay Dutt reprises his role as Munna Bhai with the same charm and charisma, delivering a performance that is both humorous and deeply touching. His portrayal of Munna's transformation is convincing and heartfelt.\n\nArshad Warsi as Circuit once again provides perfect comic relief and showcases excellent chemistry with Sanjay Dutt. Their partnership is one of the highlights of the film.\n\nVidya Balan as Janhavi brings warmth and sincerity to her role, making her character believable and endearing.\n\nDilip Prabhavalkar as Mahatma Gandhi is a standout, delivering a performance that is both respectful and impactful. His portrayal of Gandhi's spirit is a key element that drives the film's message.\n\nBoman Irani as Lucky Singh, the antagonist, is both menacing and comical, adding depth to the conflict in the story.\n\nDirection and Script:\n\nRajkumar Hirani's direction is once again masterful. He balances humor, drama, and social commentary with finesse, creating a film that is both entertaining and thought-provoking.\n\nThe screenplay, co-written by Hirani and Abhijat Joshi, is sharp, witty, and poignant. The dialogues are memorable and impactful, contributing to the film's lasting appeal.\n\nCinematography and Editing:\n\nC. K. Muraleedharan's cinematography captures the vibrant essence of Mumbai and the different locales with a keen eye, enhancing the narrative visually.\n\nThe editing by Ranjeet Bahadur and Rajkumar Hirani is crisp, ensuring a smooth narrative flow that keeps the audience engaged throughout.\n\nMusic and Sound:\n\nThe soundtrack by Shantanu Moitra is delightful, featuring songs like \"Pal Pal Har Pal\" and \"Samjho Ho Hi Gaya,\" which complement the film's tone and mood perfectly.\n\nThe background score enhances the emotional and comedic beats of the film, adding to its overall impact.\n\nThemes and Social Commentary:\n\nThe film's core message of non-violence, truth, and the relevance of Gandhi's teachings in contemporary society is beautifully conveyed. The concept of \"Gandhigiri\" is both inspiring and practical, encouraging viewers to consider peaceful and honest solutions to conflicts.\n\nWeaknesses:\n\nPredictability:\n\nLike its predecessor, the plot follows a somewhat predictable trajectory. However, the unique characters and engaging execution keep it fresh and entertaining.\n\nSupporting Characters:\n\nWhile the main characters are well-developed, some supporting characters could have been given more depth to enhance the overall narrative.\n\nConclusion:\n\n\"Lage Raho Munna Bhai\" is a gem of a film that successfully combines humor, heart, and a powerful social message. Sanjay Dutt's endearing portrayal of Munna Bhai, coupled with Arshad Warsi's impeccable comic timing and Rajkumar Hirani's brilliant direction, make this film a must-watch. Its engaging storyline, memorable dialogues, and impactful themes ensure that it resonates with audiences of all ages.\n\nThis film not only entertains but also inspires viewers to embrace the principles of non-violence, truth, and kindness in their lives. \"Lage Raho Munna Bhai\" stands as a testament to the enduring relevance of Mahatma Gandhi's teachings and remains a timeless classic in Indian cinema."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "sheriff718",
        "review_rating": "10",
        "review_title": "LAGE RAHO MUNNABHAI is mindblowingly entertaining!!",
        "review_detailed_main": "LAGE RAHO MUNNABHAI is mindblowingly entertaining!! (no spoilers)\n\nThe expectations from Lage Raho Munnabhai were huge. So does the movie live up to expectations? Well in terms of quality the movie is a winner from the very first scene to the very last! In short LRM is mindblowingly entertaining and it retains the feel-good element that was seen in the Munnabhai M.B.B.S. I don't think I've had this much fun watching a Bollywood film in a Long time!! The biggest plus point of the movie is its original and interesting script by VVC and Raju Hirani. It shows in the movie how hard they have work and how time they have spent in writing the script! Hats off to Raju Hirani (especially) and VVC..\n\nThe story of the movie is simple but honest treatment by Raju Hirani makes the movie work. The screenplay is simply brilliant and the movie moves forward at a breakneck pace keep the viewer engrossed in the story with plenty of non-stop laughs as well as few tears right through thats how entertaining the film is. It never drags!! Therefore IMO the real hero of the film is Rajkumar Hirani! The songs are average (though i liked them from the very first listen) but they have been picturized mindblowingly (esp. Samjho Ho hi gaya) and not for once do they hold the narrative except Pal Pal..which is nice song but wasn't required.\n\nThe Performances are yet again of high caliber! Vidya Balan is natural and looks gorgeous throughout the film.\n\nBoman Irani as Lucky Singh is terrific yet again though his role is not as good as Dr. Asthana of Munnabhai M.B.B.S but he slips easily into his Punjabi character and is a treat to watch! The two pillars of Munnabhai series are Munna and Circuit and will always remain so! Arshad Warsi has acted so fabulously that he quite outdoes his turn in Munnabhai M.B.B.S. He was good in the original but here he is unmatchable! He is simply mind-blowing. One cannot imagine Munnabhai without Circuit! Which brings us to our Munnabhai bole to apna Sanju Baba. One might say that he looks too old in the film, that Jhanvi looks young enough to be his daughter, that he has put on weight. IMO one would be right about all of these things, and yet none of it seems to matter, so lovable is Dutt in this film. He is so endearing that we smile without a reason the moment we see him. It is difficult to even imagine another actor playing Munna, as Munna fits Dutt to the T (I'll say same for Circuit). What a charming performance!\n\nOn the finishing note i would like to say that the Chemistry between Sanjay and Arshad is electrifying. It makes my heart melt (spoiler: witness the apology scene)!! They have officially become one of my most favorite(if not the most) bollywood jodis.\n\nI am still undecided as to which part is better..i guess i'll leave it upon my second viewing to decide! As for this year my first viewing is enough for me to say that LRM is the best movie of the year (followed closely by Zinda, RDB & Omkara) and most certainly my most favorite movie of the year!\n\n9/10 Bring on the 3rd in the series!!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "abhyu-bats",
        "review_rating": "10",
        "review_title": "Gandhian thoughts in the circuitry of tangled brains.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ashray_koch",
        "review_rating": "10",
        "review_title": "This one is great",
        "review_detailed_main": "UNLIKE most Hindi movies whose sequels used to flop frequently i think only this year that the sequels became hit but the sequels which where made either lacked pace or good story and screen play unlike there first parts but this movie has exceeded all expectations of mine as i thought that the movie would not be that much entertaining as the first one but i was totally proved wrong a word of appreciation should be given to the director for his work, the movie was not only a clean comedy movie but also carried message with the comedy this one entertains you from the beginning to the end the concept of MAHATMA GANDHI was great as earlier movies of him didn't make it to many hearts of the people but this movie keeping GHANDHIJI as a supporter of the lead character who is a goon by nature transfers himself to the principles followed by GHANDHIJI and tries to implement the principles of non-violence etc, which makes his life difficult for him and off-course the lead character SANJAY DUTT and his friend ARSHAD WARSI both their duo combination of comedy is just excellent all in all this movie has a very good story with equally good direction and acting."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "fredrik-josefsson",
        "review_rating": "9",
        "review_title": "Could almost have been made in Hollywood",
        "review_detailed_main": "That is what I thought when watching this film. I have never watched a Bollywood film before but judging on the shorts snippets I have seen of such films, in TV-programs etc, this must be a far way from the ordinary Bollywood film. Actually I am convinced that a similar plot could easy become a successful Hollywood film. All the elements are there. There is the unhappy crook who falls in love, and to get his girl he has to pretend he is something he is not. There is the crook's comical and not to bright side-kick who supports him through thick and thin. There is the pretty and intelligent girl. And there is the ancient wisdom, here manifested in the holy Mahatma.\n\nAnd then there is the typical life-changing plot. The crook tries to become a better man and at the same time succeeds in making the world a better place.\n\nYes I really liked it. There were a couple of musical numbers that I thought were well made and made sense. And the acting, writing and directing were all professional. Several times I laughed out loud at the comical points."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "yasirqhan",
        "review_rating": "10",
        "review_title": "An Absolute Masterpiece: A Cinematic Triumph",
        "review_detailed_main": "I had the pleasure of watching this movie and I must say, it is an absolute masterpiece. From the very beginning, the film captivated me with its stunning visuals and compelling storyline. The director's vision is clear and executed flawlessly, bringing a unique and refreshing perspective to the genre.\n\nThe performances are outstanding, with each actor delivering a powerful and convincing portrayal of their character. The chemistry between the leads is palpable, adding depth and authenticity to their interactions. Special mention goes to Sanjay dutt, whose performance is nothing short of extraordinary.\n\nThe cinematography is breathtaking, with each scene meticulously crafted to create a visually stunning experience. The use of color, lighting, and camera angles is masterful, enhancing the emotional impact of the story.\n\nThe soundtrack is equally impressive, perfectly complementing the mood and tone of the film. Each piece of music is thoughtfully chosen and adds an extra layer of emotion to the narrative."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Puroo",
        "review_rating": "10",
        "review_title": "The perfect duology",
        "review_detailed_main": "Lage Raho Munna Bhai is the last film I ever saw on DVD. And I'm really glad that the final film I saw on that platform turned out to be so great. Everything about this film is absolutely perfect, and that's actually saying something since this is only the second film by Rajkumar Hirani (the first being its prequel). It's really surprising that Hirani created such an iconic duo in his very first duology films.\n\nThe film is set around Munna Bhai once again, as he tries to impress an RJ after winning a competition about Mahatma Gandhi. It is really funny that Murali, someone who is literally the opposite of Gandhi, resolves to give up on the thing that ensures his survival in the otherwise violent world. Before I saw this film I didn't even know that there are actually people who don't like Mahatma Gandhi, since I was just 7 years old and didn't know anything about politics. As I grew up, I understood the role of Gandhi more and more, and how different political ideologies tend to see him. And Lucky was a good example of this.\n\nLucky tends to be Munna's biggest problem in this film. He is exactly the opposite of what Munna wants himself to be. As one goon is on his path to redemption, the other wants to drag on in the destructive life that he lives. In the world where people tend to use any means to justify their ends, odds are mostly in Lucky's favour. This shows why and how Mahatma Gandhi must have also faced problems in his times. There are occasional stories on Gandhi, telling how he took his decisions and what challenges he had to face, comparing their similarities and differences with Munna.\n\nMy favourite character in this film was Circuit as usual. He always has the air of being a character who can never want something wrong to happen with Munna and takes any path he needs in order to satisfy his boss. He does make his mistakes and tries a little too hard to appease Munna, but in reality is a person pure of heart and a loyal sidekick. My favourite scene was when Munna becomes an RJ himself and gives tips to his audience by taking help from Mahatma Gandhi's hallucinations. And finally in the end he is able to use these methods to convince Lucky.\n\nI really wanted there to be more such films, but now Sanjay Dutt and Arshad Warsi have both aged very much so there's no way we are ever getting this back. Also some things are better off left in nostalgia rather than being dragged on and getting ruined. This film is great to occasionally come back to. If anyone wants to watch Bollywood comedies, this duology is the perfect place to start from."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ashekhar",
        "review_rating": "9",
        "review_title": "a must for India today..",
        "review_detailed_main": "forget about the slapstick, this film is a timely and extremely successful peek at the horrors of Indian society today - corruption, superstition, lack of truthfulness, meaningless idolatry...munnabhai will make a difference, you can just see it by the audience response.\n\na social satire draped around the slapslickness of the basic premise, this is the best thing to a black comedy that has come via bollywood since \"jaane bhi do yaaro\".\n\nwell done munna and circuit..and lage raho hamare fellow citizens...forget about crying about the national song, remember your basic civic duties."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "arvindmenon",
        "review_rating": "10",
        "review_title": "Fantastic movie.",
        "review_detailed_main": "To deliver such a movie in present times with such a powerful message is truly commendable. The movies starts of on a slightly trite note but later flowers into a movie with high impact. The best part about the movie is that it is presented in a way that most common people can relate to it.. It is this quality that has propelled the movie to such acclaim. This is the sort of movie that showcases the true spirit of India and its father, Mahatma Gandhi.\n\nIn times when its considered sissy to not have an \"eye for an eye\" this movie breaks all trends and goes back to good old days.\n\nits hard to describe the sort of reactions its produced in India for real. May it suffice for me to say that a lot of incidents or rather the methods used to achieve the goal in a larger sense, have actually started bearing fruit.\n\nKudos to the director for making such a movie in present times. Though the movie has done exceeding well, it also ran the serious risk of bombing at the box office. By opening himself to possible criticism and still sticking to his guts, the director has done justice to the movie as well as its message. God bless."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "singh-amrit",
        "review_rating": "9",
        "review_title": "Keep it up.... Lage Raho.",
        "review_detailed_main": "To be very honest I was not very sure if they could match the class of Munnabhai MBBS again. Even though I watched the film a good three weeks after the release, by that time the rave reviews and ripple on the box office were sign enough to make anyone believe that they have done it again. But not me. I was of the opinion that this one would have a big hangover of MBBS and people are liking what they liked in earlier version, and there would not be anything new to offer.\n\nBUT.... how wrong perceptions can be.\n\nThis is a revelation of sorts. Its not even a single notch below the its predecessor. Its right up there.... on the top, among the finest films of the year...or if I may dare to say EVER. Just when we were actually forgetting Mahatma Gandhi, and he starting to become nothing more than a photo on currency notes, comes Lage Raho Munnabhai... rejuvenating Mahatma from nowhere. Franckly speaking, I was not a fan of Mahatma Gandhi, I am not very impressed with his doings... but this film surely changed the perception a lot if not completely.\n\nRevealing or commenting anything on the story or performance or any other technical aspect of the film would be stupidity, as its seen to be believed.\n\nYou'll realize the beauty of the film when you won't realize when your eyes were filled with tears while laughing your hearts out.\n\nLage Raho Munnabhai, Raju Harani (Director), VV Chopra (Producer) and the entire team.\n\nDon't MISS THIS ONE."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "karthik-globalsoul",
        "review_rating": "8",
        "review_title": "Lage Raho indeed! Aptly named!",
        "review_detailed_main": "Easily the most loved \"dynamic duo\" in today's cinema world, Munna Bhai and his sidekick, Circuit are back! And this time, they come together in the sequel of the fame hit to Munna Bhai MBBS is Lage Raho Munna Bhai.\n\nIt's a normal day for this happy go lucky duo. The love interest this time is Vidya Balan as a Radio Jockey. The radio jockey idea seems obvious with the hit of Priety Zinta as the RJ in Salaam Namaste, and also keeping in touch with the recent trend of radio coming into vogue again, this time with a bang.\n\nThe basic idea behind Munna Bhai is the same, mistaken identity and doing crazy things to keep the girl interested in him\u0085 this time, however, Munna does not go to college as a student (thank god). Jahnvi (Vidya Balan) mistakes Munna for a history professor! The Movie carries on where it left, lots of fun, extremely witty and not to forget \u0096 humor with a message - with Jahnvi testing Munna's \"historical interests\".\n\nThis is not just another movie in the park - I don't want to spoil the surprise, but, here is a spoiler: Gandhi playing a \"role\" in the movie, there are some interesting moments.\n\nWith a twist in the run of events, the movie proves how contemporary the Gandhian values are.\n\nThe Songs are not what you might call chart busters, with Kabhi Alvida na Kehna topping every music channel in sight, but songs are a luxury anyway in this wonderful movie.\n\nInvesting money in watching this movie will pay you rich dividends \u0096 laughter, fun and extreme satisfaction! There are apprehensions over the prices of cinema tickets, but this movie makes you sigh and gives you value for money From student to teacher, Munna has most definitely graduated and come of age! Arshard Warsi is too good once again\u0085 They say sequels are not so successful as the first movie, but this movie shall be the path breaking movie breaking that theory! Lage Raho indeed! Aptly named!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "goassasiango",
        "review_rating": "10",
        "review_title": "Funny and Hearworming",
        "review_detailed_main": "In this romantic comedy, a talented yet socially awkward doctor finds herself navigating the complexities of love while tending to her patients. She is joined by a charming and laid-back pediatrician, and together they form an unlikely bond while working on a high-profile medical case involving conjoined twins. The film expertly weaves humor into the story, providing plenty of laugh-out-loud moments without detracting from its genuine emotional core. The chemistry between the two leads crackles with wit and charm, making their budding romance both believable and heartwarming. As their relationship deepens, audiences are kept on the edge of their seats by a healthy dose of drama. Overall, this romantic comedy is a delightful blend of humor, romance, and heartfelt moments that will leave viewers smiling long after the credits roll."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "chakut",
        "review_rating": "10",
        "review_title": "Best Hindi comedy in a long time",
        "review_detailed_main": "Really good Hindi comedies are few and far between. Lage Raho Munna Bhai is by far one of the best in recent times. You will laugh till your sides ache, and you will be forced to think about truth and non-violence on your way back to reality. The movie starts with a music that will tell you it is a sequel to Munna Bhai MBBS, but goes off as an independent story, with only the main characters (Munna Bhai, Circuit and the other \"dhobis\") coming back. Boman Irani is in this \"sequal\", but in a totally different role, to which he does justice AND MORE.\n\nThe story is woven well, the music is hummable and meaningful (something which Hindi films lack a lot), the choreography is pleasing, the directing is wonderful and the acting is superb. Boman Irani (Lucky Singh) and Arshad Varsi (Circuit) steal the show, and Sanjay Dutt (Munna) and Vidya Balan (Janvi) are not far behind.\n\nEven when the plot gets a little \"serious\", the film holds the audience (this is what Hindi films mostly mess up).\n\nAfter you have watched it once and laughed a lot, watch it again: there will be bits and pieces of comedy and thought-provoking dialogue and actions to notice the second time, which will make sense.\n\nThis is a movie to treasure. I hope more movies like this hit the screens."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "universal_guy25",
        "review_rating": "10",
        "review_title": "The best bollywood movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Smittyboy318",
        "review_rating": "10",
        "review_title": "Simply Amazing",
        "review_detailed_main": "I thought this movie was excellent! It literally brought tears of joy to my eyes. I recommend this movie to anyone. It really doesn't matter if you have seen the first movie or not. Even though this is a sequel, it doesn't have a continuing storyline. But that doesn't matter at all. The plot in this movie is awesome. The story, the best I have seen in a Hindi movie. But if you don't want to see the movie, don't. No one is forcing you. My favorite part was the Munna/Circuit apology. It was so deep and emotional. I can't tell you how much I loved this movie because I will keep repeating myself and that is kind of what I am doing so I can take up these minimum of 10 lines that i need. But seriously though, watch the movie. It will be worth your time."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "namraansari-45335",
        "review_rating": "10",
        "review_title": "A must watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "Harshithnagraj",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "Good movie with some good content. Sanju rocks in this film. One of the best sequel made in Bollywood."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "vittal",
        "review_rating": "10",
        "review_title": "Gandhigiri is the future of India",
        "review_detailed_main": "It is the greatest Movie of the century. It is the height of Man's intelligence of story telling.If Movie \"Gandhi\" got so many Oscars, this movie \"Lage Raho Munnabhai\" deserves 10 times more Oscars.\n\nGandhism is very intelligently communicated to the mass through \" Gandhigiri\".\n\nThere is an element of psychology in the movie. But, that is how this whole universe works on principles of belief.We should take this as an intelligent way of the director, to communicate with the viewers.\n\n\"Gandhigiri\" is the only future for India, through which it can win the world, not by high tech software, or high rise buildings. This is the only principle, which will cleanse India of all corruption and cheap politics.\n\nVittal Belandor, Bangalore"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ImIndeed",
        "review_rating": "10",
        "review_title": "Bollywood's finest product in recent memory",
        "review_detailed_main": "Anyone familiar with Bollywood can be forgiven for reading the title of this review and not being particularly impressed - Bollywood has produced some profoundly horrible films in awe-inspiring quantities in the past.\n\nBut Lage Raho Munnabhai sets aside all of the usual complaints one has about Bollywood. Its plot is in no way ripped off of something from Hollywood - indeed, it would be hard to come up with something more uniquely Indian. The songs, while ridiculous in a way that only Bollywood can achieve, are not so far gone as to be irredeemable and are actually well integrated into the plot. Finally, while the central motivating force for the plot is a typical Bollywood impossible love, the actual theme of the film is far deeper. True, the movie carries about it a certain absurd quality in everything from dialog to editing, such does nothing to detract from the power of the message.\n\nThe plot, in short: Mumbai mobster Munna falls in love with a radio jockey, but to impress her pretends to be a professor who specializes in Mahatma Gandhi. In the process, he is forced to learn Gandhi's philosophy, causing a \"chemical imbalance\" in the form of Mahatma Gandhi's ghost who compels him to solve his problems with peace and truth.\n\nThough the main factor of this movie is comedy, at which it succeeds quite well (Circuit is far better characterized and thus far more lovable than in Munnabhai, M.B.B.S.), what I took away was a shaking awe of this man we call Mahatma. Though its exposition of his philosophy is a bit more modern/ridiculous than what the Mahatma practiced, it nonetheless accurately conveys the sheer courage of satyagraha. A mobster, someone accustomed to killing and being killed, is forced to acknowledge that real courage comes in taking a blow rather than fighting back. The movie's implication is that our modern society believes only the insane would follow in the path of Gandhi, yet watching it makes one wish more of our leaders today had \"chemical imbalances.\""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "hetvin",
        "review_rating": "10",
        "review_title": "Gandhigiri Zindabad",
        "review_detailed_main": "One of the most loved movies of our time, Munnabhai MBBS has the kind of repeat viewing value that few other movies can boast of. It's not surprising then, that when Rajkumar Hirani wanted to make a sequel and took a survey all over the country for an apt title, a majority said 'Lage Raho Munnabhai'! So he dropped his title 'Munnabhai Meets Mahatma Gandhi' and settled for the public vote instead. This movie had expectations rocketing to the moon, but one is highly surprised to see that this movie is as good as the first one-it's not really a sequel, it just has Munna and his adorable sidekick Circuit and a host of other characters, some seen in the original like Boman Irani and Jimmy Shergill, playing completely different roles, and some new and brilliant finds. The safest thing for Hirani is that there can be no comparison with MBBS, as it has got nothing to do with it, but is fresh, new, hilarious, thought-provoking and has two of the most memorable characters in Indian film history-Munnabhai, Circuit, and their inimitable slang."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "india202",
        "review_rating": "8",
        "review_title": "lage raho sanjay dutt",
        "review_detailed_main": "what can you say about this movie, i have seen it so many times now and i still luv this as much as i did the first time. You become so involved with the movie it makes you think you're actually with them. The comedy is just as promising as its pre-quel.\n\nMoving on to the cast well Munna bhai isn't complete without Sanjay Dutt, and where would he be without Arshad Warsi aka Circuit, the comedy pairing is so perfect. this is the second movie i have seen with Vidya Balan casted and i have to say she is just as perfect in the role of Janvi, minus the \"good morning mumbai\" which became fairly annoying.\n\nThis is definitely a movie to watch u will be laughing through out as well as understanding the message the movie portrayed.\n\nI wont go into the details but its worth a watch. So please if u get the chance I'm sure you'll love it."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "die_Heuchler",
        "review_rating": "8",
        "review_title": "Gandhi isn't gone.",
        "review_detailed_main": "Finally we have a sequel better than it's original. Truly, I was driven into deep thought as I watched Lage Raho Munnabhai. What makes the movie so touchy is Mahatma Gandhi, and it's the reason why today's youngsters must watch this film. This is a film about truth, honesty and selflessness and behind a light-hearted comic screenplay lays deep thoughts and realities of today's society. Munnabhai meets Gandhi, and his world changes, but more than that it compels us to think what if we meet Gandhi and feel embarrassed upon ourselves for not being able to take what he wanted us to.\n\nI am not an Indian, but Gandhi being an Indian has laid down a path of truth and honesty for people all around the world. To say the least, Gandhi is the God of modern times and people like him aren't born often. The producers of this film have attempted to unravel the reality of our times where people have become so mean and selfish, that in fact if today Gandhi was to come back, would sadly return embarrassed and humiliated seeing how badly we all have failed to give him respect and cared less to what he said and did.\n\nAnd if films like these continue to come up, we may one day say that Gandhi isn't gone."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "khan_at_work",
        "review_rating": "10",
        "review_title": "Sanjay Dutt aka Munnnabhai deserve award for this!",
        "review_detailed_main": "Munnabhai Returns!!\n\nWell i watched the film good expectations but the film surpassed my expectations. Frm the Director to the actor everyone simply rocked! The story was really\n\ngood.. The concept was fresh and original! There is not a single boring moment in the film! Sanjay Dutt fits Munnabhai to the T and am not even a big fan of his. No one can play this role better then him.. He was out of the world just like in Munnabhai MBBS..He was excellent in every scene..bet it emotional or comic!. bole to award daina mangta hai mamuuu!! Arshad Warsi as circuit was good but OTT sometime.. ! Boman was very good..his best performance after MBBS! Vidya Balan was beautiful...\n\nMunnabhai/Circuit scenes were hilarious and Munnabhai/Lucky Singh scenes were great too.. Sanjay was just awesome in all scenes!! This is one heck of pasia vasool film.. The best one this year!!\n\nThis film is not just hilarious but gives you a message too.. Ghandgiri as Sanjay says in his tapori style is going to be really popular.. I brought in my friend to the cinema.. He is doesn't like Bollywood movie but he loved this one!!!\n\nWell folks nothing much to say except go and watch it because you have to watch it to believe it!\n\n10/10"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "vishal_wall",
        "review_rating": "10",
        "review_title": "Positive Entertainmenet",
        "review_detailed_main": "This has got to be one of the most inspiring films made in the Indian Film Industry in the last decade. The other films I can think of are 'MunnaBhai MBBS', 'Hydrabad Blues' and 'Nayak'. Though HB was an independent effort. The script of LRMB is too good. When Boman Irani says \"Get Well Soon Munna\" it struck me so hard. The whole plot is in loops. Taxi driver and running bride already have a connection from the previous scenes. The script may not be air-tight but its definitely very well edited and has imaginative loops. Although the backdrop of the film is love story it actually is a social drama. Beautiful!!! The concept that Gandhiji only answers questions Munna already knew was just too much. That shows how tight and well thought out the plot actually is which looks like a regular comedy.\n\nBoman Irani is very good. Sanjay Dutt is convincing. Vidya Balan is just cute smiles. She was much better in 'Hum Panch'. Kulbhushan Kharbanda is great as usual. Arshad Warsi walked away with the glory this time. No doubt. He got the best lines and every time he got the home run. Dilip Prabhavalkar was also very convincing considering the kind of job he had to do. Theatre and films are two different medium. I will definitely see him on stage now. Diya Mirza has improved. Jimmy Shergil was also very impressive. It was nice to see Parikshat Sahni after so long. Although casting says three names in the writing department but we know for a fact that the brain behind this fantastic film is Rajkumar Hirani. Great Job. Must have been a journey for a sound editor in 'Hero Hiralal' to direct a film after 15 years and that too 'Munnabhai MBBS'.\n\nThere are so many fantastic scenes in this film but my favorite is when lawyers beat up Gujju lawyer Dhansukh Bhai Patel. It's a very positive effort with many social messages. The most important things about the film are that it is very modern, talks about real issues with humor and is not preachy. 9/10"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "riteshdelhi",
        "review_rating": "9",
        "review_title": "Munna Bhai .... Excellent movie!! Lage Raho.. Even Better",
        "review_detailed_main": "I saw this movie last week (Sunday). I wanted to see it at Priya Cineplex which is the best movie theater in Delhi (arguably), but realized that the movie was not at any PVR multiplexes (due to some settlement issues).\n\nNevertheless, I had to see the movie as I was very sure that the movie would be a total failure as the first part (MBBS) was very good. I just wanted to see how bad ... so much so that I got a Rs. 70 ($1.25) ticket at Rs. 150 ($3.0) at one of those Other Cinema halls.\n\nIn retrospect now, I have found the movie to be definitely worth the last penny that I spent. Lage Raho is BETTER than MBBS (IMDB rating are already specking the story!!!). Although, I am not one of those techy movie goers, but I know for sure that the Critics would have a VERY difficult time critique'ing this one. The best part of the movie is that the director did not go the conventional route of connecting the threads with the prequel and then loosing the focus from the story. I have seen many Bollywood (sequel) movies not doing well because the directors were not ready to experiment \u0085 Kriss is a classic example of a sequel movie gone WRONG!!\n\nOn specifics: Sanjay Dutt is looking old \u0085.but who cares!! He is still going strong. Arshad Warsi \u0085.. who knows him by his original name now? :-) At least my parents don't \u0085. He is \"Circuit\" for them. Vidya Balan \u0085. She is not there just for her chocolaty presence\u0085. She delivers!!! Boman Irani \u0085. One talented SOB!! 2nd Innings Team \u0085.. perfect. (especially the \"Kissing Car\")\n\nRest of the team is equally good.\n\nAnd Finally: The Mahatma \u0085.. Needless to say, the director has treaded an extremely difficult path of featuring a popular political/human figure in the most subtle of manner. Normally, movies of such type end up raising many eyebrows (if not only from the censor board). Not this one!\n\nBravo to the whole crew!! \u0085. This movie will go into Bollywood folklore as being one of those better known classic movies.\n\nToday, I got to know that PVR is also featuring this movie and I will not miss the opportunity of watching the movie again at my favorite Cineplex \u0085 Priya!!!\n\nPlease watch it once!!\n\nPS: This is my first review on any movie till date. I just couldn't resist the temptation to comment on this PERFECT movie. 10/10 :-)"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "Second time is the charm.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "geckomehra",
        "review_rating": "10",
        "review_title": "Pure unadulterated entertainment!",
        "review_detailed_main": "The most awesome film i have seen for a long long time.the way raju hirani has carried his story is unbelievable.if you thought m.b.b.s was awesome,wait till you see this film.the trailers didn't do justice to the film's content.i would have never believed it could be this good,until i saw it.its hard to imagine what the film holds in the second half,but i bet it is better than most of us could imagine.the way this film has inspired us Indians has to be seen to be believed.its impact can be seen in our politics as well.sanjay dutt has got what he needed to be remembered as one of the all time greats. all hail Munnabhai."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "natarajanganesan",
        "review_rating": "9",
        "review_title": "Sequels are foreign to Indian movies but this one...",
        "review_detailed_main": "...is a trend setter. I wont review the storyline since many have done a better job.\n\nMaking a comedy, yet a contemporary message oriented, movie has not only been a challenge to Indian movie makers but also been a disaster. Such movies were always the strongholds of trained movie makers or new art film directors from Film Institue in Pune.\n\nThe movie is strictly not a sequel in the sense that the storyline is completely new. However, the Munna-Circuit duo is kept very much intact and the punchy dialogues distributed evenly among all characters. This time Munna meets Mahatma Gandhi and makes a disastrous yet a hilarious attempt to reform himself (and an others!). What starts of as an innocent visit to Gandhi library to impress his heartthrob ( a radio show host) spirals into a Gandhian struggle to reclaim the land of a small old age home. How Munna manages to come through this is the whole story.\n\nOf course, Munna is incomplete without Circuit who combines the devotion of Lakshman (to Ram) and naiveté of Sancho Panza (of Don Quixote). Their pair is likely to be exploited commercially in the time to come. At times the movie risks the glorification of 'Goondagiri' but manages to steer clear of it with the help of Gandhigiri. The satire that drips through every line of the story nails home the point of Gandhi's relevance in modern times. However his main strength of 'Satyagraha' is never emphasized as much as the spirit of forgiveness (which is amply demonstrated).\n\nThis is a MUST-WATCH movie even for the movie audiences in the United States and the Hollywood Industry. In fact the sequel is worth a remake in Hollywood than its prequel that has 'patches' of \"Patch Adams\"."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "kokovyas-15873",
        "review_rating": "10",
        "review_title": "Great film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "gurupiriya",
        "review_rating": "10",
        "review_title": "Excellent Film",
        "review_detailed_main": "Laugh your way through this film and for sure it starts a chemical locha in ur dimag. This could well be the dawn of a new age bollywood film making, the script is crisp so is the direction. A must watch for its realistic approach to the modern day issues but with a Gandhian Flavour aka Gandhigiri. If bollywood has to get recognition at the global level, it should try churning out movies of this calibre, which not only showcases Indian Values of truth and ahimsa, but also the need of the modern age to embrace them. Hats off to Vidhu Vinod Chopra and Rajkumar Hirani, for giving back Bapu to India. Excellence is stamped all over the film as it smoothly sails from one frame to another. It leaves us with a thought to reconsider and rediscover the ideals of Father Of India, Mahatma Gandhi. The Ideals are as relevant today as then."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "vs_acharya",
        "review_rating": "10",
        "review_title": "Gangster & Gandhi prove it. Truth alone triumphs!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "prabha_s_kamath",
        "review_rating": "9",
        "review_title": "Hilarious & original!!!",
        "review_detailed_main": "Excellent story line...truly original theme. Couldn't stop laughing.. Circuit's character is very lovable & Lucky Singh has spoken like a true Punjabi....Would highly recommend this for one and all, young or old.\n\nThe Bambaiya Hindi brought back a lot of memories on our previous life in Mumbai.... All the characters have been cast very well & the songs are pretty good too. Vidya Balan & Sanjay Dutt shine in their roles & all the supporting cast do a great job too.\n\nA film which preaches good moral values in a hilarious way... I personally think this takes the 1st Munnabhai movie to a higher level."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ab-47531",
        "review_rating": "8",
        "review_title": "Better than the first in some ways",
        "review_detailed_main": "Love and being good always triumphs, although these values don't always work in the real world they work beautifully in Lage Raho Munna Bhai. Chemistry between the leads is great, Sanjay Dutt, Vidya Balan, Asrad Warsi, and Boman Irani knock it out or the park and the lesson to be a good person and triumph is endearingly told. Songs are better than the first movie IMHO. Worth the watch"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "adarad",
        "review_rating": "9",
        "review_title": "Generations to come will scarce believe that such a one as this walked the earth in flesh and blood",
        "review_detailed_main": "I don't watch too many Indian movies these days because i am putout by the rubbish they come out with.But lage raho munnabhai was a welcome change. I had seen the first movie (munnabhai MBBS) and i had liked it. Although the first movie had borrowed its theme from patch Adams,nonetheless the director did a good job. The second movie was totally original(to my knowledge).It shows how a small time goon by chance is forced to learn about Gandhi by chance,and he starts realizing his mistakes.He tries to go out and tells the world the forgotten message of Gandhi. In short he tries to prove wrong the prophesy of Albert Einsteins \"Generations to come will scarce believe that such a one as this walked the earth in flesh and blood\". This movie passes along many social messages without being too corny."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "itssaurabh100",
        "review_rating": "10",
        "review_title": "Practical gandhigiri",
        "review_detailed_main": "Lage raho munnabhai.....what to say about this movie.I think this is the most positive & optimistic movie ever made in Indian cinema.Its not a movie showing life of Gandhi and his principles but tells you how these principles can be practically implemented to solve some very common problems like corruption.......using gandhigiri.\n\nThis movie is a good blend of comedy,emotions and of course gandhigiri.Everybody has done good acting especially Arshad Warsi.I am sure after watching you will never forget this movie.If faced by situations shown in the movie,in real life, you will always be guided by their solutions as shown.\n\nSo do not just watch this movie for entertainment but also try to take the message it gives............."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "indu9",
        "review_rating": "8",
        "review_title": "misleading title; great movie.",
        "review_detailed_main": "enough has been said already about how good or the thoughtful the movie is, so wont repeat that here.\n\nThe only disappointment was the title itself. The name gave me the impression of some real commercial, laugh-n-forget a typical Hindi movie and came out wondering what a great innovative plot to make a movie on. solid thoughtful storyline and yet very comical !!\n\na very clever job by the director/writer to convey Gandhiji message in a simplest possible way.\n\nArshad Warsi is hilarious. Sanjay dutt looks old at times.\n\ndirector could do a better job in portraying these 2 as don, esp in Mumbai real estate market."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "mnalgirkar",
        "review_rating": "8",
        "review_title": "Truly original Hindi comedy after a long while?",
        "review_detailed_main": "As someone who yearns for light-hearted quality Hindi cinema of the 70's from the likes of Hrishikesh Mukherjee, Basu Chatterjee and others, I am sure that I am not alone in having been disenchanted with Bollywood for quite some time for what seemed like a lack of creativity and blatant imitation of Hollywood under the excuse of \"inspiration\". I am happy to report that Lage Raho Munnabhai will turn people like me into believers again. This is an indigenous, intelligent effort driven by some great out of the box creative thinking by the film-makers. Congratulations to the film-makers and we should certainly hope that we'll get to see more of such intelligent, original, world-class cinema from the world's largest film industry!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ppatil007-1",
        "review_rating": "10",
        "review_title": "Best comedy movie I have ever seen.",
        "review_detailed_main": "It's a perfect bled of all important ingredients of a fabulous movie.\n\nIf you don't rate this movie 9 + the some wrong with your sense of humor! Any age group it's a must watch.\n\nIt's also got a great message, which has faded in time. It makes you think yet does not stress you. Depicts some important aspects in life in a jovial way. Sunjay Dutt and Arshad Warasi have done a great job again proving the 2nd squeal can be better than the first one. The humor is great and it appears natural on screen unlike other comedy movies where in comedy is drilled in.\n\nThanks to Vidhu Vinod Chopra and Rajkumar Hirani for making a film that is more than just a rip-roaring comedy. It makes you laugh, makes you cry and make you think ."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "machado-7",
        "review_rating": "10",
        "review_title": "A movie with a message",
        "review_detailed_main": "I have seen so many comedy movies , where comedy is forced and the Actors have to make all kinds of funny faces and tricks. But this movie just takes you through the real streets of Mumbai its almost like an Art Film . Especially Ghandigiri portrayed is something where the script writer doesn't want to preach yet he delivers the message in a very straight forward manner . All the things happening around us i know in real life for us to ensure total Ghandigiri is impossible in the present world but not to forget, thats the way we got our freedom from the British. This is the best performance by Mr. Sanjay Dutt , an ignorant strong man and then there goes ( I will call him a phenomenon ) Arshad Warsi , a friend who is more than a friend , his acting is something which makes you forget all your troubles. I was even laughing while i was walking out of the cinema. This is definitely a hilarious movie ever made in the history of Indian Cinema , where all age groups could watch together. Hats off to the entire crew"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "bindas",
        "review_rating": "9",
        "review_title": "Absolutely Awesome movie .....!!!!!!!!!!!!!",
        "review_detailed_main": "One of the best Hindi movies ever seen after a long time. I like this movie better than some of the best Hollywood movies. The Gandhi factor is so beautifully woven into the script. No hard preachings, but still manages to communicate the message very strongly.. This should be given tax free in all Indian states as it has a very strong message to convey. This will remain one of the best movies that has been churned out by Bolloywood for many years to come .. Songs are melodious, comedy is hilarious (makes you really laugh out loud), emotions touches you so much (you virtually cry.!) and acting and direction is top-class ..! Hail MUNNA, CIRCUIT and GANDHIJI trio...!!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "natraj_i",
        "review_rating": "10",
        "review_title": "Great entertainer",
        "review_detailed_main": "After a long time I have seen a movie that is entertaining as well has some good values. Most Hindi flicks play to the masses - so does this one. But the biggest difference is that it carries a powerful message. The best part is that I was not bored for a single moment in this movie. The songs are pretty good and the director has done a great job of editing the movie.\n\nActingwise, Sanjay Dutt and Boman Irani are good, but the best part is played by Arshad Warsi. His dialogue delivery and facial expressions are a treat to watch. Even a stupid joke appears funny when Arshad Warsi delivers it. All in all, kudos to the movie team. Great job guys and I hope more Hindi film makers take to making movies that are fun and carry a message instead of the same love stories."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "rnsaha",
        "review_rating": "10",
        "review_title": "When Munnabhai says Hellllllllooooooooo Gandhigiri!",
        "review_detailed_main": "Riding high on expectations due to its well-accepted predecessor (Munnabhai MBBS), this movie satiated every 'tapori' who cared to invest his time to watch this classy 'lafra'. Munnabhai, the goon with a golden heart, returns to the silver screen with his second-in-command Circuit. This time, he takes on something he is not accustomed to: non-violence. In order to win over his love, lovely Jhanvi, Munna introduces himself to the ideologies of Mahatma Gandhi. How he endures, flourishes and spreads 'Gandhigiri' is what this movie is all about. Almost everything appears well-manicured in this movie. Well thought independent events to sprinkle Gandhism makes every moment of this movie likable. Except Jhanvi, every other character is well sketched and the movie tickles you hard with its hilarious 'tapori' lines and hard-nut Gandhism. Never preachy, Gandhism attains new heights and diffuses into the viewer quite efficiently. And finally, there is Sanjay Dutt, who after his portrayal of several hardcore gangster characters, blasts the screen with his rustic charms as Munnabhai. A must see if you want a nice laugh with some thought provoking leftovers to ponder upon as you scroll down the credit titles at the end."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "dbadhani",
        "review_rating": "10",
        "review_title": "Hilarious comedy with loads of substance",
        "review_detailed_main": "Very few Hindi movies can claim what this movie can and should. Clean, \"above the belt\" comedy and a subtle yet powerful message, that's what makes this movie so unique and worth watching. It was heartwarming to see that someone could weave a fine story using elements like tapori (goon) lingo, simple romance, day-day problems of the common-man and Gandhiji's ideology. And yet, no compromise at all. Kudos!!! Sanjay Dutt is at his best again, and Arshad Warsi is impressive with his flawless, spontaneous comedy. Almost everyone from the previous movie has a big or small ( yet significant) role here. While Vidya Balan does good justice to Jhanvi's role, Gracy Singh's absence was felt; just for the reason that she did such a great job in the Munnabhai MBBS. After \"Rang De Basanti\", this is another movie which portrays the restlessness in today's youth to change the rotten system prevalent in India. If only we could have more such movies in these times. Again kudos to the entire team for making this masterpiece!"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "nabraj",
        "review_rating": "10",
        "review_title": "worth watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "ssingla",
        "review_rating": "10",
        "review_title": "The one bollywood movie which deserves an Oscar",
        "review_detailed_main": "This is not just a movie, it's an experience and no offense but you ARE a fool if you haven't seen this movie, and you are definitely not a human being if you haven't liked this movie. The three hours journey leaves you totally stunned as it makes you cry, laugh, and connect to the characters. Somewhere, in the movie, it makes you realize your wrong doings in life. You don't cry for the characters in the movie, but for yourself. I have seen this movie for like at least more than fifty times now, and still every time i see it, I learn a lot from it. Emotional is an understatement for this movie, it is much more than that. This kind of cinema has never been done and I am definitely sure can never be repeated again, not just in bollywood but anywhere in the world. The movie simply teaches you a way of life, a way for you to realize that you are not just a highly developed class of animals fighting for surviving on this planet but much more than that. Believe me, you will thank me after watching this movie if you are watching it after reading my comment, moreover you will thank yourself for watching it, you will feel deep in your heart a sense of relief and satisfaction as if you have done something great."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "labiba_habiba1",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "This was a great movie. It was funny and entertaining, yet weaved a strong and very needed message through out the movie. It was great to see a movie that was able to entertain yet remind us of history and the message we may forget. I admired how the many different threads of this movie i.e. music, comedy, and history were brought together so well. Being American and having to read the sub-titles didn't take anything away from this movie for me. I was very moved by this movie, and would recommend it for every one to see. Sanjay Dutt being so handsome is an added plus in watching this movie ..wink..\n\nLabiba"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "sudhirajverma",
        "review_rating": "9",
        "review_title": "Though made in 2006 . It's more relevant today",
        "review_detailed_main": "A brilliant movie. Must see for all and learn how the indian Psyche is tuned to gandhigiri"
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "prasadandre",
        "review_rating": "9",
        "review_title": "Much needed for every Generation!!! Greatest movie.",
        "review_detailed_main": "Each and every dialogue has its great meaning.\n\nMovie engages you from start to end. Eagerness increases as movie goes... Bhai circuit bhi hai na ismainnnn....."
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "johny_bravvo",
        "review_rating": "",
        "review_title": "The Gandhi in all of us !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "mustajab-77732",
        "review_rating": "",
        "review_title": "unforgoten movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0456144",
        "movie_name": "Lage Raho Munna Bhai",
        "movie_rating": "8.0",
        "review_username": "pthareja",
        "review_rating": "",
        "review_title": "If Mahatma Gandhi visited back, the credits are to the Munna (Bhai Lage Raho) scheme, and all your team.",
        "review_detailed_main": ""
    }
]