[
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "ReviewingHistory",
        "review_rating": "8",
        "review_title": "An Emotional and Intimate Journey to the Heart and Family of An Iconic Woman",
        "review_detailed_main": "Aquarius is an emotional and dramatic saga, featuring Clara in her fight for her apartment. In a world of expansive corporate engineering practices, Clara fights and hard for what she had and inherited.\n\nEmotionally, Aquarius runs as a mix of drama and thriller. The film it leaves the viewer on edge at times, witnessing the covert tension Clara herself experienced and the engineers placed on her. The film's ending is unique and ending, so expect to ponder how the heck a resolution would be reached ultimately.\n\nBesides plot twists, Aquarius also portrays the intimate experiences of Clara, her love for Brazilian and international music. It features a nice selection of songs and rhythms.\n\nFinally, Aquarius also gives voice aspects of Brazilian society, such as the class division, and the shared experience of light in a coastal city, almost in passage, but beautifully.\n\nIn sum, It is an emotional, long, and intimate journey into the heart and experiences of an iconic and unforgettable woman. It may feel long at times and slow, but it is sure to pick up later on. It is a hard film to watch, but one superbly acted and edited."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "vasco_cid",
        "review_rating": "8",
        "review_title": "Elegant, insightful and intelligent",
        "review_detailed_main": "Quiet, precise and profoundly critical, Aquarius is a sharp depiction of an ever changing, ever adapting Brazilian society, increasingly subject to a disproportionate capitalism that is bulldozing over identity, history and sentiment.\n\nSplit into three chapters - one of them construed as a prologue - there would not be a better way of introducing who this(ese) character(s) is(are) and setting up what their nature is, what motivates them and what kind of culture, family values and roots they hold throughout. Led by a powerful and heartfelt performance by Sónia Braga that single-handedly carries the film, meticulously embodying all of the character's traits in her continuous struggles with motherhood, disease, change and most importantly time lapse. Her artistic preferences and passions show how a deeply and typically traditional society can still honor and maintain their culture while not being averse to technology, change and evolution.\n\nAt the end of the day, Aquarius is an elegant tale of how opinions and values change with time and how easily the current generation might be bent and influenced by money and greed and how that greed can easily stampede over traditionalism. A definite must see."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "ferguson-6",
        "review_rating": "8",
        "review_title": "Sonia's finest",
        "review_detailed_main": "Greetings again from the darkness. If you were an avid movie-goer in the 1970's, you likely fell in love with Sonia Braga while watching Dona and Her Two Husbands (1976) and Kiss of the Spider Woman (1978). Those movies catapulted the Brazilian actress to global stardom, and a long career limited only by some regrettable script choices.\n\nWriter/director Kleber Mendonca Filbo wisely casts Ms. Braga in the lead of his latest, and she delivers what may be her best performance ever \u0085 and certainly one of the best by any actress this year. Clara is the lone holdout in a beachfront apartment complex against a corporate developer intent on modernizing the old building in order to maximize profits.\n\nThe film is divided into three parts: \"Clara's Hair\", \"Clara's Love\", and \"Clara's Cancer\". The initial segment is set in 1980 when Clara is recovering from cancer treatment and is attending the 70th birthday party for her beloved Aunt Lucia (Thaia Perez). Lucia's flashbacks to her younger days bring a subtle smile to her face, while providing parallels to what we see later with Clara. Some secrets from family are treasured memories, not meant to be shared. As the story moves forward, we grow to admire and respect Clara and join in her defiance of the smirky hotshot developer.\n\nThe big company bullying the old lady would be an interesting and predictable story, but here it's secondary to the story of a strong woman – a woman who overcomes cancer, carries on after the death of her husband, fights to keep her home, and generally lives life on her own terms. She maintains her strength and dignity despite outside influences.\n\nA recurring theme throughout is \"old vs. new\". From the first sequence with the \"old\" Aunt passing the baton to her younger niece, to the old lady battling the young developer in order to prevent the historic building from being turned into a modern co-op, to the contrast of the vinyl records of Clara's collection to the digital music of the younger generation, to Clara's preference for actual phone calls to texting. It's the classic now versus then argument, and it's summed up by Clara's line to her kids: \"When you like it, it's vintage. When you don't, it's old.\" There are some similarities to Sebastian Lelo's 2013 film Gloria, which featured an exceptional performance from Paulina Garcia, and this one utilizes some terrific \"little\" scenes \u0085 conversations with family and daily life with her housekeeper – all while staying close to a glass of wine, her favorite music, a cozy hammock, and her Barry Lyndon poster. While the ending is a bit disappointing, and Brazilian politics prevented it from being that country's Oscar submission, those don't negatively impact the strength of Sonia Braga's Oscar worthy performance as we rejoice in the strength of an independent woman."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "massashihosono-1",
        "review_rating": "10",
        "review_title": "Don't judge this movie by trolling reviews",
        "review_detailed_main": "Aquarius is a movie that tries to catch the audience by showing our almost forgotten resilience, commitment to individual values and beliefs. The main plot is a story about a wealthy lady facing a frequent and \"polite\" invitation to sell her apartment for a greedy and ruthless real state company who wants to put down her old building. Meanwhile, she not only tries to keep her place, but to buy other units.\n\nMovie's director, Kleber Mendonça, is a very skilled storyteller when it comes to expose the most bitter side of Brazilian's contradictory elite society. I've watched all his movies and shorts and I must tell, they are not comfortable. Yet they disclose things that either we don't talk about or we don't clearly see. It's a mind blowing criticism over our cultural trends and social costumes.\n\nAs for the main actress, Sonia Braga is one of the most iconic actresses in Brazil. She moved to US to live a relationship with Robert Redford, another great actor and director. As years passed by, she did connected with America's movie industry, though she never left her carrier in Brazil entirely.\n\nIn 2013 Kleber wrote a script that according to Sonia, while reading it, was a \"present\" from its author. So he invited her and she promptly replied. The result is this movie where, as The Telegraph correctly said, \"will make you want to move to Brazil\"."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "diogo_chalegre",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "First of all I'd like to apologize myself due any English mistakes.\n\nI didn't understand those bad reviews that I just read here. In fact the movie is simple, with a simple a story but very emotional. Here in Brazil we face racism and a social fight which is pointed out in the movie.\n\nThe actors are good and Sônia Braga spectacular. I could see this movie more ten times and I am sure that I would always have something to learn.\n\nI'm giving you this review without political issues, I am just a cinema lover. Do not miss the opportunity to see how prejudice and racism are frequent around the world. Also you're gonna experiment a time travel throughout the memories!"
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "Red_Identity",
        "review_rating": "",
        "review_title": "Very well-acted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "Turfseer",
        "review_rating": "6",
        "review_title": "Cancer survivor battles nasty real estate developers in this lugubrious but compelling character study",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "marcosleekim-955-164864",
        "review_rating": "9",
        "review_title": "Ignoring all the political controversy surrounding this movie, what remains is a fantastic story.",
        "review_detailed_main": "It is sad that a powerful movie like this is contaminated by political ideology from both sides. Although I don't necessarily agree with any of the positions brought forth by the makers of this movie, this is still a fantastic piece of art, a fantastic story about the struggles of a middle-aged woman against not only a very real real estate speculation movement in Brazil, but also against her past, the upper-middle class blame, the old age labels, her family, all directed by probably the greatest living director of Brazil today.\n\nFrom IMDb synopsis, Clara, a 65-year-old upper-middle class mother of 3 children, refuses to sell her apartment, the last still occupied, to a big real estate company, built in the upper class, seaside Boa Viagem Avenue, Recife. Pledging to only leave her place upon her death, her building is probably the last remnant of a not so long ago past. Facing this conflict ahead mostly by herself, she will reflect upon her past and future and give her new strength.\n\nAlthough the story can seem to be a bit clichéd, the movie excels in representing a middle-aged woman in an unique and independent way, something rarely seen in movies, where usually these characters are simply secondary, caricatures. There will be no big reveals and big turns, it is a mostly linear story (quite different from Kleber Mendonça Filho last movie, \"O Som ao Redor\", also critically acclaimed). But the way the director tells the story is what is so great. With a technique so sharp, he creates tension throughout the whole movie in ordinary situations (his trademark, an influence from John Carpenter), like in the scene where Clara and the real estate manager are simply maneuvering cars in the building's garage. This tension is what carries the whole movie, until the powerful ending.\n\nIn addition, the greater part of the movie has no actual direct connection to the its apparent central plot. Clara attending parties, talking to the lifesaver, walking with her nephew, having family meeting is what fleshes out her character, telling so much about her personality and her past indirectly, and this is the film's greatest strength. The moment she has with her 3 kids is maybe one of the greatest scenes in Brazilian cinema.\n\nForget all the political ideology. Watch it for what this movie really is, a powerful, fantastic piece of art."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "recover-67805",
        "review_rating": "7",
        "review_title": "Interesting story",
        "review_detailed_main": "Film is OK. The story is nice and the artist are trying their best.\n\nSome reviews are so sad and that's because people fill their brains with low budget horror and negative, dark themes (like lovely Galves_WormFilledSkull and others). Please try to watch something clever, uplifting, intelligent, medium budget :), smart, with a proper view of the world issues. Stop depressing yourselves and being such a miserable being. Life is worth living, don't waste your time feeding your brains with negative stuff as you will became one too. All the negative reviews seemed to be about their negative political and non political views of the country."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "tarsosa",
        "review_rating": "9",
        "review_title": "A good glance into the Brazilian urban everyday life",
        "review_detailed_main": "Aquarius is an interesting film, which has a good photography and a beautiful soundtrack, besides a compelling performance of the cast. Sonia Braga is great, playing a mature woman who stands for her rights and opinions. The story is shot in Recife and slowly presents the almost silent tug of war between Clara (Sonia) and the construction company. They want Clara sells them her apartment - the last one to be sold in the whole building - for the construction of a new property. The development of the characters is good, Kleber Mendonça Filho finds the correct pace for telling us Clara's story, so we can see why is so important to her to stay living in that place. In the other side, we have enough clues of how bad the other people fight against Clara, because there's real money and other interests involved. Although I think it worths watching, I recognize it is not a film for everyone; maybe some details only can be truly understood for people who has spent some time living in Brazil. I refer to the almost invisible social war between wealthy and poor people, represented in many subtle dialogues, gestures, and eye contact among characters. That's why I don't give 10, as a warning for non-Brazilian spectators."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "avital-gc-1",
        "review_rating": "7",
        "review_title": "Beyond the manifestation",
        "review_detailed_main": "I wonder what non Brazilian would think. Here this film became a political manifestation, and people forget to simply watch it. The story is simple: a 65-year-old widow, a retired journalist, declines a good offer to leave her apartment (the last occupied one) in an old building near the beach in Recife. The bad guys would do everything to expel her.\n\nShe lives well, goes to the beach, meets friends, and enjoys music and beauty. She is lonely, but strong, well-off and resilient. The threat is looming, however. The most interesting stuff is her relationships, and there's one powerful reference to breast cancer. The beginning is quite weak, but fortunately, the film quickly skips many years to the present. There are mentions of endless issues: class , race, gender, prejudice, sexuality, generation gap, capitalism, corruption and what not.\n\nSome references are very odd, and if I didn't get them, people out of Brazil will never understand. For instance, a brief scene of someone digging bones from a grave. The ending is simplistic. However, between the beginning and the ending, and ignoring some loose ends, the middle has much good stuff. Sonia Braga who plays the widow is good. The best actor is probably Humberto Carrão who plays a rich young man out to conquer the construction world.\n\nAlso: great music!\n\nThe director, staff, cast and all made a manifestation against the impeachment of the Brazilian president in Cannes Festival. So now the left endorses the film and the right abhors it. Me? I liked it for the several strong moments, and was sorry it had too many weak ones. It stayed with me as day later, so it's not bad."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "morisame",
        "review_rating": "10",
        "review_title": "Superb film not to be missed",
        "review_detailed_main": "Aquarius certainly deserves all the raves it's been getting. It's a well- rounded film with perfect acting from all actors especially Sonia Braga. I love her character in the film, Clara, her clout and courage, and the way Kleber Mendonça Filho constructed the film. I was deeply touched from beginning to end. Don't be misled by all the bad reviews made by resentful and bigoted ringt-wing Brazilians who didn't even see the film. The film has a political undertone but overall it's about a woman fighting for herself and her rights. A must-see for anyone who believes in justice, equality and the value of human life over the power of greed and money. Thank you Mr. Kleber Mendonça for helping us Brazilians restore our dignity through this beautiful piece of art."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "Reno-Rangan",
        "review_rating": "7",
        "review_title": "Home is where all the memories preserved.",
        "review_detailed_main": "I have to start the review by mentioning the recent year Russian film 'Durak', also known as 'The Fool' in English. In the same year, another similar themed Russian film, 'Leviathan' got nominated for the Oscars. What those both films highlighted were not just the corruptions, but the threats the common people face. Raising voice for good against evil is still a distant for such potential country. Here comes the Brazilian version. This is not on the same level. I meant the intensity of the event, how all folds. Nevertheless, the same core issue in a different continent.\n\nThis film met with several controversies. One of them omitted it from the Oscars race. But the film was received well from all the quarters. I did not find any issue. I thought it became unfortunate victim, especially, could be because of the developers and their connection with the corrupt powerful men. It's neither a masterpiece. I just consider it a good film. A message film. But not for everyone. Particularly, it is good for grownups viewing for the reason I'll going mention later.\n\nThe story of the 65 year old Clara. Her life has been successful being a music critic. Now a widow, and all her children settled down. It opened on her birthday where all the friends and family gathered to celebrate the occasion. Living alone in a small and beautiful beach view apartment. But the thing is she's the last one who still in that old building. Everyone had left it when the developers decided to demolish it and build a modern one. She's fighting to save the heritage. All her memories lie in there. But the developers have a different plan to force her out, and that's the remaining film to unfold how and other following developments.\n\n❝So when you like it, it's 'vintage'. If you don't like it, it's 'old'. Right?❞\n\nThe opening scene was a slight offbeat. Because right away it does not reveal who is the person of the film. Besides, some of the odd scenes in the middle would raise some eyebrows. Those were not actually the full fledged scenes, but glimpses that goes back to like the 70s or something. The idea of those parts were not properly understandable, but I think it is about missing those good times. The lone fighter concept was inspiring. At one point, when everybody around her thought that she's making an unnecessary scene out of it, she was firm on her decision and did what has to be done.\n\nThis was one of those films I did not like it on the spot. But slowly captivated. Once it's focus was fixed on one particular character, the rest of the tale set forward on what it wanted to tell us. As I understood it, it was not exactly about corruption, except a part of it was. It was the fight for ones right. A fight to save the past. On the other hand, the people from her opposite are ready to take extreme steps to defeat her. That's where it gets into the controversy. The controversy of those stupid tricks used to achieve the goal. This kind of a film coming from Brasil is really wonderful to educate poor knowledge people who easily become victims in a similar fashion.\n\nIt was a French-Brasil collaboration film. I'm reviewing it after a couple of days of my watch. Because I wanted to think about it for a while, scene by scene. The more I recall, the more I'm starting to like it. So I advise same to you as well that don't come to any conclusion just after you have watched. Because it could not be what you have heard about it. My only issue was the runtime. The 150 minutes were a too long. But manageable if you watch regularly, such slow films.\n\nWell written, directed and acted. Even the location was ideal. But they could have avoided the those sex scenes which I earlier labelled them as odd scenes. There were too many, even camera pans out from somewhere far away in the bush. Kind of unrelated. I am not against such an idea, as human daily life filled with those. But when the theme was seriously pivoting on a serious issue, these came as distraction. Why I'm pointing out that strongly is that a fine film like this should be for all ages, even for teenagers. It missed that opportunity. Otherwise and still a nice drama film to recommend the adults.\n\n7/10"
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "vixian",
        "review_rating": "3",
        "review_title": "Meandering and Overlong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "wel2005",
        "review_rating": "9",
        "review_title": "Aquarius is more than a film, it's an experience.",
        "review_detailed_main": "I did not react to Aquarius session end, I left the movie anaesthetized, not knowing what to think. Complex films like this do not involve value judgments. As the scenes were sat in memory (pictures, lines, track, details), things became more Clear. Clara (Clear, in Portuguese), by the way, is the name of the character of Sonia Braga, an old woman, a retired music critic, who decides to fight against a conglomerate of construction, preventing the building is demolished. With this wisp of plot, the young and talented director Kleber Mendonça, speaks of memory, time, social, loss, resistance, prejudice, ethics, preservation ... It's such a rich work that would need to be watched more times for an accurate and faithful analysis. There are moments of delicacy that made me breath away. The first part of the film, Clara's hair is bright. Unable to hold back tears. Aquarius is authorial film, which does not follow formulas, is not related to cinematographic conventions, is not entertainment. It was done to annoy, make the viewer to think and question. Do not expect the impact of City of God, or the catharsis of Central Station, Aquarius has another footprint."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "lasttimeisaw",
        "review_rating": "8",
        "review_title": "a rapier-like social critique welded with an endearingly patient character study",
        "review_detailed_main": "Brazilian film critic turned filmmaker Kleber Mendonça Filho's second feature AQUARIUM, after his well-acclaimed debut NEIGHBORING SOUNDS (2012), has already received Cannes main competition treatment, which could be boosted by the consequential involvement of one of Brazilian cinema's living legends, Sonia Braga, who dauntlessly takes its central role of Clara, a retired music critic and refuses to move out of the film's titular building in Recife even if she is the only resident remains.\n\nThe film's vintage prologue takes us back to 1980, we are first introduced to a young Clara (Coleen), celebrates both her victory over cancer (later a briefing scene will inform us it is breast cancer) and her aunt's (a sprightly silver-haired Perez) 70th birthday, who reminisces of her wild youth (a carnal liberation in particular) when she clocks to an inconspicuous cabinet, which will become a mnemonic to trigger Clara down to her own memory lane 35 years later.\n\nIn the present time, Clara has outlived her husband for 17 years (life has its unpredictable quirks, who could image a seemingly healthier husband would be gone so soon) and now lives alone, she takes the leisurely pace to continue her daily life, as an independent, mature and loving woman: schmoozing with the lifeguard (Santos) on the beach where she routinely swims; enjoying a dancing night with her girlfriends and having no qualms to engage in a spur-of-the-moment making-out with a widower, who politely recedes to decency when he is aware of her physical condition (how shallow a man could be?). And obviously she has become much closer to her nephew Tomas (Queiroz) than her three adult offspring (a married son, a divorced daughter and a gay son), especially her relationship with her daughter Ana Paula (Jinkings) is strained, because of the status quo: the Aquarius building, erected in the 40s, is acquired by a construction company for a complete reconstruction except for Clara's apartment, and Ana Paula doesn't understand the reason why Clare won't sell it.\n\nSo what is the reason? Clare cannot be bought off by money because as she claims that she has 5 apartments under her name, therefore she has no financial exigency to exchange her favorite property into cash, which marks her a different case from the usual hungry-for-pecuniary-gain mass. Aquarius adumbrates her fondness, nostalgia and affections of her long winded past, all the happenings (like the B-day party in the prologue) comprising her entire life, in her sense, they live and die with the building itself. There is no denying it is a somewhat selfish reason to sabotage a project might be beneficial to assuage the local housing problem. But Mendonça Filho is trenchant and adamant to exercise the disproof, a final startling revelation will jolt Clara into the self- righteous action of hauling the evidence right in front of these corporate crooks. This is a tub- thumping censure to a society festered with sleaze and corruption, and utterly relatable in most corners of our world.\n\nWhat hits the unusual mark of extraordinary is the filmmakers' impeccable tact and devotion of playing out an unbiased portrait of a woman of certain age who, more often than not isn't even be considered to assume the cynosure of a movie, and Mendonça Filho welcomes her with the full treatment including the often dismissed libidinous department, when you find out there is a raucous orgy organized in the empty apartment above yours, what is the best rebuttal other than calling an escort to quench that aroused thirst?\n\nIt goes without saying Ms. Braga's towering performance is of tectonic import to the success of the film, so much composedly immersed herself in the character, she takes Clara's prosaic daily life in stride, and not for one second, slackens her dignified defiance or renders it patronizing or haughty (which would very likely occur in lesser hands), she holds court whether there is a tacit awkwardness in her bungled sex-in-the-car diversion, or a whiff of disappointment toward her self- serving daughter, not to mention when she lets rip with a tirade in front of Diego (a smugly educated Carrão, admirably fending off Braga's all-out verbal offensive), the young representative of the company, that sequence alone can give 2016 Best Actress hopefuls a run for their money!\n\nAQUARIUS is ultimately a rapier-like social critique welded with an endearingly patient character study, manufactured with deliberation, consideration and integrity, a transcendent sophomore piece presages an auteur in the making. On a less rigorous note, it is a cautionary tale exhorting us not to mess with a refusenik who has a hammock in her apartment, which means that she has both strength and means to stick it to the end."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "CinemaClown",
        "review_rating": "",
        "review_title": "Makes For An Interesting Character Study But May Not Resonate Well With Outsiders",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "luisxlves",
        "review_rating": "7",
        "review_title": "Could have been better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "gersonllobo",
        "review_rating": "9",
        "review_title": "Terrific",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "kaptenvideo-89875",
        "review_rating": "6",
        "review_title": "So when you like it, it's vintage; when you don't like it, it's old.",
        "review_detailed_main": "In two days, I have managed to see three movies about getting or being old in a row – \u0084Going in Style\", \u0084Aftermath\" and now \"Aquarius\". Is the universe trying to tell me something? Anyway, \u0084Aquarius\" is the only good one of the bunch. It's maybe half an hour too long and slows almost to standstill at times, so I won't give it a higher score. But for movie lovers, it's worth the time. The story is about Clara (Sonja Braga), the last resident in the old upper-class apartment house that the property company can't wait to take down. The 65 year old woman has pledged to only leave the place upon her death, and will engage in a cold war of sorts with the company. On deeper level, it's about having lost the purpose in life, which doesn't really depend on number of people or friends and family surrounding you, and how bad things can bring motivation to continue fighting. In some improtant ways, \"Aquarius\" is similar to this popular French movie \u0084Elle\", both released in 2016 and premieried in Cannes Film Festival. Both are about strong female character getting kind of old but still ready to continue fighting after bad things happen, and deal with extended family around her. \"Elle\" has Isabelle Huppert in the lead, \"Aquarius\" has Sonja Braga. Both are also worthy movies in their own right, although could win from being a bit shorter. But in comparison, \"Elle\" is flashier and offers more quick excitement, whereas \"Aquarius\" feels like its artsy sister. Screenwriter and director Kleber Mendonça Filho has chosen as non- flashiest approach to storytelling as possible. This works both for the movie's favor, or against it, depending on the taste of viewer. The characters, events and relationships are so real-life-like that it can alienate many viewers who will claim that \u0084it's boring\", \u0084nothing is happening\", or something along these lines. The others will, vice versa, applaud the sharpness Filho has achieved in portraying people and relationships as they would really be in life. It's an art in itself, really. Just like in \u0084Elle\", the central character and leading lady's portrayal of her gives the viewer constant joy and is easily the noteworthiest thing in the whole result (which, of course, was the goal). Sonja Braga amazes with her subtle but powerful acting especially in Clara's moments of great stress such as troubles with children, or when things with property company turn nastier. I'm not very good at describing exactly how well Braga has played out all the different shades and aspects of the woman's personality – from healthy pride that rises from knowing your worth and place in life to inflexible stubbornness, from being dead inside to still discovering lust for life in some ways. But I assure you that it's a classy work from the thespian clearly on top of her game. Sadly, \u0084Aquarius\" did not turn out to be Brazil's submission for the 2017's foreign-language Oscar race, so it may not win more international attention than it already has. But it may be worth your time if you don't mind spending time on getting to know the people on screen. \u0084Aquarius\" is not compact enough to get easy recommendation – honestly, you will test your endurance at times – but all in all, I quite liked it. Easy to like a story centred on such a strong and intelligent female character, or actress as Sonja Braga."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "Jithindurden",
        "review_rating": "9",
        "review_title": "Amazing",
        "review_detailed_main": "A character study on the main character a retired music critic and subtly every kind of politics of Brazil. Themes of exploitation, privilege, affection towards places and homes are all explored here. It's amazing how they've been able to convincingly portray all of this without shoving everything down your throat nonetheless powerful and effective. Cinematography, lighting, music etc are all done wonderfully complimenting the rest of the film. Then there is Sonia Barga, I can't understand why I never heard her name during the awards season as a favourite. She's atleast as good as if not better than Huppert who was the favourite."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "andrewchristianjr",
        "review_rating": "7",
        "review_title": "WELL CRAFTED.",
        "review_detailed_main": "A well crafted invitation to visit a family on a beach in Brazil, learn their secrets, and witness how they deal with issues from their cultural perspective."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "mkurtsen",
        "review_rating": "10",
        "review_title": "Super duo Kleber And Sonia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "ASuiGeneris",
        "review_rating": "6",
        "review_title": "Sônia Braga Impresses",
        "review_detailed_main": "Aquarius (Brazilian Portuguese) (2016)\n\nFierce stubborn widow, Somehow charmingly tiresome. Flashbacks reveal why. How place, space can define us, Wistful look at life's details.\n\nThough gorgeously told, Far too long, sudden ending, Discordant or rushed. Braga's stellar performance Not enough to outweigh flaws.\n\nSomonka is a form of poetry that is essentially two tanka poems (the 5-7-5-7-7 syllable format), the second stanza a response to the first. Traditionally, each is a love letter and it requires two authors, but sometimes a poet takes on two personas. My somonka will be a love/hate letter to this film? #Somonka #PoemReview"
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "cferreira-67170",
        "review_rating": "5",
        "review_title": "Slow paced, overlong movie. Tiring to watch.",
        "review_detailed_main": "We waited with anticipation to watch this much \"acclaimed\" movie, but both my wife and I could not take it with the extra long takes, close ups, playing music bits, with nothing to add to the story.\n\nExtremely and unnecessarily long, would have been much better told in 1:20 than 2:25hs."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "richsmith-71982",
        "review_rating": "9",
        "review_title": "Excellent film",
        "review_detailed_main": "I don't usually review (I'm not good at it) but I liked this film so much I made an account just to have a say after reading the opinions of those who consider it trash.\n\nFor me the entire cast gave excellent performances and the film was beautifully shot. Aside from that, the themes of ageing and sexuality, generational conflict and social humanity and culture vs soulless, bottom line, entitled profiteering really resonated with me and I personally felt that they they were not dealt with in a clichéd way at all.\n\nPerhaps if, when all is said and done, you identify with the protagonist you will like this film. If, on the other hand, you identify with the '$*£!-eating smile' character maybe not so much. Also, if you are a fan of 'The Fast and the Furious' I don't imagine you'll get it.\n\np.s. I experienced absolutely no problem with the pacing of this film.\n\np.p.s. Any film featuring that sublime Gilberto Gil tune can't be bad."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "masonfisk",
        "review_rating": "9",
        "review_title": "THIS IS MY HOME...!",
        "review_detailed_main": "Quiet perseverance, silent oppression, both traits can be attributed to Sonia Braga's protag in Aquarius. When her apartment building is being bought out by a ruthless developer, Sonia is the lone holdout who will not move due to the memories & experiences she has cultivated over the years in her humble homestead. A welcome respite against the easy notion of selling out, Aquarius challenges the viewer to see if they can put their money where their mouth is."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "christopher-underwood",
        "review_rating": "7",
        "review_title": "Set in Recife, Brazil",
        "review_detailed_main": "An interesting film and I was particularly of finding the woman a 65 year old widow with the problem of her flat the company want her out to have plans of the plot. Set in Recife, Brazil by the sea and with her many family and friends of largely feel she should give up and take the money as she is the last flat in the block."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "kosmasp",
        "review_rating": "9",
        "review_title": "Close to the edge",
        "review_detailed_main": "A woman on the eve of her existence ... rattled to her core. Being the sole owner of a house that a large company wants to buy and own (for whatever purposes that may be, I think it's safe to assume, they don't have good intentions, yes?). As a general rule most viewers will be with her. But is she still of sound mind? What do her children think about this? And why is she so stubborn? Then again, it's not like she has anything else to do.\n\nI generally hope this is not how all Brazilian urban everyday life is like - like another user suggested. But I can't say one way or the other. What I can say is, that you will be able to identify with her. Maybe not always agree with her, but understand. And seeing life go by, slowly , there is a certain dreadfulness to it. Why it feels the need to be rather explicit with flashbacks and sexual situations I'm not entirely sure. But it shows what was and what she lacks or rather might be missing. Something for sure she isn't getting or having now ... another character puzzle piece, but maybe also another look into motivation. A complex movie that some may dispute or find rather boring and annoying. It's why we have different tastes. Still makes this a very engaging and certainly impactful movie (especially the ending, which is harrowing to say the least) ..."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "guihideki_",
        "review_rating": "10",
        "review_title": "Resistance",
        "review_detailed_main": "Thematically \"Aquarius\" is sweeping, their issues are current, urgent and universal, and are treated in a palpable way. The direction of Kleber Mendonça Filho is inventive and risky, and interested and observant, and mise en scène sensibly captures the film's message. The technical part is excellent: The edition (the film is divided into 3 parts) is coherent and employs a rhythm, which, despite its long duration, never tires the spectator; The soundtrack, mostly diegetic, talks to the situations and emotions of the characters, pampering the audience with great songs (emphasis on the theme song); And the production design is perfect, imparting an incredible sense of real makes us believe that this apartment is real and livable, causing us to import and create an almost affective relationship with that house. And Sônia Braga gives a show. She understands, feels and lives the character. Sônia is Clara, and seeing her acting very willingly is exciting."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "bobbie-16",
        "review_rating": "9",
        "review_title": "critical and touching view of contemporary Brazil",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "MikeyB1793",
        "review_rating": "1",
        "review_title": "beyond tedious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "pssmilly",
        "review_rating": "10",
        "review_title": "A critical movie",
        "review_detailed_main": "OK. I can't even believe this movie is so medium rated. I watched this movie at the public movie theatre and it was strongly applauded. Maybe for the conjuncture in my city and my country. I'd already been writing a paper on the issue before watching the movie so I could easily relate. Anyway... I think it's an artistic movie and (maybe for that characteristic) is also critical on the real estate speculation problem. It talks about your memories and bonds to a certain place (the place you grew up in) and also about how the real estate makes everything to kick people out of their place without caring for their bonds and even for the architectural characteristics of the neighborhood or for the environmental problems caused by so many high buildings on the city. Though it still had a lot to talk about on city issues, it has my heart."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "lisadkenn",
        "review_rating": "8",
        "review_title": "Excellent",
        "review_detailed_main": "Very real story and incredible acting. Central to the main character and really enjoyed a female lead."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "scratchthat2009",
        "review_rating": "10",
        "review_title": "Simple, Direct, Driven, and Flawlessly Executed",
        "review_detailed_main": "I am typically drawn towards pretentious art films, but this film wasn't TRYING to be over the top artsy. Yes, the film has politics, but it's more than that. It's a film about the life cycle, family, dealing with changes in society and the world that's also in close proximity to you. The film is feminist in all the right ways, too. As a woman, I'm not huge on feminist themes if they're executed too over-the-top or forcefully. Rather, we see a woman taking care of her business, her family, asserting dominance over people who are truly weaker than her. The film paints a picture of the hardships, and the beauty, of Brazil's society today. No performance will charm you more than Braga's portrayal of Clara. For any type of film-goer, I recommend this film, because its style is easy to watch, but the message is overwhelmingly powerful."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "asmgodoy",
        "review_rating": "9",
        "review_title": "Real state speculation and the struggle for the past",
        "review_detailed_main": "Aquarius pictures a seeming conflict between real state speculation and a stubborn Brazilian lady. However, a more profound battle enhances the plot's backbone: the resistance towards the present through the appeal of the past. A certain obsession with the past might be an interpretative key to this charming movie. Clara, the main character, played by Sonia Braga (a Brazilian paramount star) on a certain moment proudly shows a John Lennon's LP, Double Fantasy, in which there is a Los Angeles Times old clipping commenting the plans that Lennon had for the future. He was murdered just a month after. She says: a message in the battle, which is another reference to the past. One has in mind the infamous Police's tune. Clara resists the present for perhaps she cannot accept her failures. Aquarius captures real life characters, on a glowing Brazilian language. A fascinating movie."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "ThurstonHunger",
        "review_rating": "8",
        "review_title": "The Clarity of Clara",
        "review_detailed_main": "Part of my Kleber cinematic cavalcade.\n\nThis story is a bit more confined than his other films, by an empty apartment building. The good/evil forces a bit too well laid out, and yet still a captivating watch.\n\nMostly for Ms. Braga (as a youngster I remember reading about her and \"Her Two Husbands\" but I never saw that film.) While she's still a beautiful woman, the role here is all about her character, and even without reading anything about her and the industry and her country, you can feel her latch on to the power of Clara.\n\nThe film would pair well with \"The Last Black Man in San Francisco\" (a really tremendous film imho). Sure the central story is simple, but no less essential. The opening flashback alone would make for an interesting short film. The interaction between Clara and her children and her maid, for me very fascinating. As was the dating/mating patterns for a strong, older female character.\n\nLike \"Neighboring Sounds\" this has Recife in the recipe, specifically an older person who has lived a life with/as a shark on land, takes a dip in the water with them as well. And again KMF fills a film with sound and music very well.\n\nThe film is more than just a gesture again gentrification, the character study of Clara would have been watchable in an entirely different setting. But clearly the setting is a mirror for Clara, if not vice versa."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "ArminCallo-PalmSprings",
        "review_rating": "4",
        "review_title": "Tedious Film Wastes Talent of Ms. Braga",
        "review_detailed_main": "I cannot recommend this film. It was screened at the Palm Springs International Film Festival #PSIFF17 as part of its \"Talking Pictures\" segment, where audience members engage with the film maker after the film's screening, here Brazilian Kleber Mendonça Filho, one of Variety's 10 Directors to Watch. At the Q&A, Mr. Mendonca Filho was asked about this transition from film critic to film maker. He described the process as similar to being a party to a bar conversation and finally joining in on the conversation because one \"now had something to say.\" In AQUARIUS, I am at a loss of what exactly Mr. Mendonco Filho has had to say with his film in the context of cinema. While Sonia Braga again delivers a strong performance -- and it was great to see her again on the big screen - - I found the film tedious, poorly shot and woefully edited. And for a lover of music as is the director and his film character, the sound editing and mixing on the film was very third-rate. Frankly, shockingly so. A major disappointment, particularly in light of A.O. Scott's NY Times review and Variety's endorsement."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "guedesnino",
        "review_rating": "9",
        "review_title": "The most significant in \"Aquarius\" is its explicit range of understandings and possibilities.",
        "review_detailed_main": "The most significant in \"Aquarius\" is its explicit range of understandings and possibilities. It is a film where the public is invited to be also author, thus, can stick and build the story that suits him. Little freedom seen in Brazilian cinema.\n\nInversely contradictory to what is presented on the screen, \"Aquarius\" begins much more for the end than for a really beginning. His narrative explores the cyclical state of the human condition, where even the belief of continuous advances, whether in interpersonal relations or with technologies. Jumps that seek to conceal the lack of perspectives for recurring ills generation after generation, only amplifying their problematic and making sure to circle specific classes. As for example: the sewer pipe on Boa Viagem beach in Recife, which separates the rich part of the poor. Housing and real estate growth is common on both sides, as is the historical mimesis of inequalities and particular interests.\n\nMade in 2016, the film has the screenplay and direction of Kleber Mendonça Filho, who had already attracted the attention of the public and critics with \"O Som ao Redor\", of 2013. In \"Aquarius\" we follow through an optic testimonial of Moments and oscillating between significant and insignificant in the life of Clara (Sônia Braga), the greatest moment being the phase of 65 years, in which Clara is widow and last inhabitant of the building (Aquarius), on the edge of the beach of Boa Viagem , In Recife-PE.\n\nAs for the editing and editing work promoted by Eduardo Serrano, which fragments and joins times through the \"Jump Cut\", a dry cut made in an image sequence of the same plane where it advances in time, a dynamic cut, cutting the \" Breathing \"and pauses, which serves to transmit urgency or create the sensation of advancement in time, this style of assembly undoubtedly collaborates for the narrative construction of the film as this urgency and advancement of time, do not effectively result in anything, only advances by Emergency to start or change state, but that by the speed does not materialize, it only takes place as an obligation to close a cycle, and then to restart it.\n\nHighlight for the soundtrack and for the work of diegetics performed by the editing and sound mixing of Ricardo Cutz, who makes an impeccable use of the sound that participates in the narrative of the film and that is part of the universe of the characters. All Aquarius songs using the (diegetic) effect that relates directly to what the characters are listening to is the same as the audience, work perfectly and are not free, and has a track that basically splits into Be descriptive of Clara's personality, or evocative of a state, quite the style: now I'm feeling in the pit and I'll hear a pit music. However, in all cases and even with the diversity of the trail that goes from Roberto Carlos to Queen, through Reginaldo Rossi to Villa Lobos, everything is very coherent and credible of the personality and the likes of Clara. Creating a soundtrack of life, the only negative point, is the direct sound capture performed by Nicolas Hallet, in some moments are inaudible the speeches of the characters, for example, in the dance scene where Clara dancing with a man of origin \"Capixaba \", In which she already attentive to the fact that the character speaks\" softly \", and added to the sound of the party it becomes impossible to understand what this man speaks, it is doubtful if it was a proposal of the film, to be another one of the empty scenes (Not in the pejorative sense), but of intimate and personal scenes that build and modify Clara, or if it was a failure of capture, since it seems that a microphone had occurred only the main character.\n\nAmong the performances, only the embezzlement felt by the incoherence of an accent, which causes a certain strangeness in acting and convincing in the work of Thaia Perez (Aunt Lucia), her aunt, seems to have fallen there, in that house, out of nowhere. The work, in general, is satisfactory and well punctuated, although to those who know the work of Irandhir Santos (like Roberval), it is an apparent debt before the greatness of other cinematographic realizations. Sonia Braga (as Clara) and Humberto Carrão (as Diego), who know how to balance the game of personal interests and defenses, in the beginning the friendly and conciliatory air of Carrão are well dosed, and are not lost when he reveals His most aggressive tone as a young man with an MBA, and counterbalanced with these two poles, we have a Clara who introduces herself as a turrona lady and a woman who just wants to live in a place that is her right.\n\nDisregarding any and all controversy caused by the film's launch at the Cannes festival in 2016, and by the conscious stance of the artists who sought in that space, alerting to Brazil's situation after the process of a questionable impeachment of President Dilma, \"Aquarius\" is a film Well within the framework of Brazilian politics itself, where common interests rival the interests of large corporations and those in power, the system in force in Recife, which is criticized but at the same time reproduced by Clara of interests And personal support, are granted in the measure of the proximity of family or affective relations, is as common in our politics as in our lives, how good it is to have that person who, because he is close to us, de-bureaucrates a service. Among so many reflections and possibilities that \"Aquarius\" allows, is mainly that of a committed cinema to talk much more with his country, than with commercial interests, although box office does not do any harm."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "RainbowVic",
        "review_rating": "10",
        "review_title": "SONIA BRAGA!",
        "review_detailed_main": "Aquarius is a movie that tries to catch the audience by showing our almost forgotten resilience, commitment to individual values and beliefs. The main plot is a story about a wealthy lady facing a frequent and \"polite\" invitation to sell her apartment for a greedy and ruthless real state company who wants to put down her old building. Meanwhile, she not only tries to keep her place, but to buy other units.\n\nMovie's director, Kleber Mendonça, is a very skilled storyteller when it comes to expose the most bitter side of Brazilian's contradictory elite society. I've watched all his movies and shorts and I must tell, they are not comfortable. Yet they disclose things that either we don't talk about or we don't clearly see. It's a mind blowing criticism over our cultural trends and social costumes.\n\nAs for the main actress, Sonia Braga is one of the most iconic actresses in Brazil. She moved to US to live a relationship with Robert Redford, another great actor and director. As years passed by, she did connected with America's movie industry, though she never left her carrier in Brazil entirely.\n\nIn 2013 Kleber wrote a script that according to Sonia, while reading it, was a \"present\" from its author. So he invited her and she promptly replied. The result is this movie where, as The Telegraph correctly said, \"will make you want to move to Brazil\"."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "gg2507",
        "review_rating": "8",
        "review_title": "Sonia Braga shines in this great movie",
        "review_detailed_main": "I must admit the synopsis is not very attractive, the premise of an old woman refusing to sell her apartment doesn't sound exciting, but this movie and its lengthy running time are totally worth it.\n\nSonia Braga shines as Clara, who's not your usual protagonist. She's a 60-something very confident woman who, despite being nostalgic and reflective of her past, is still living in the present. She goes out with her friends, she has sex, she gets angry. I don't remember seeing a protagonist like her before at all and Sonia Braga is perfect in the role. Clara has so many layers and Braga is able to deliver a convincible performance at every moment.\n\nAs for the movie flaws, I think sometimes it gets too slow (especially at the beginning) and, considering that it lasts for almost 2 and a half hours, this can discourage viewers to stick to the end. I also personally wanted to see what happens after the closing scene, although I can totally understand why the director felt that was a good way to end the movie.\n\nAnyway, don't let the apparently dull synopsis or the slow pacing prevent you from watching this amazing piece of cinema."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "studionicoleti",
        "review_rating": "10",
        "review_title": "Thiago Ribeiro",
        "review_detailed_main": "Brazilian cinema and Sonia Braga never been so terrific."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "p-seed-889-188469",
        "review_rating": "4",
        "review_title": "Close but no cigars",
        "review_detailed_main": "First the good points - the actors are fine, the script is natural and believable, and the photography is fine. However in this day and age all these things are a given, just like we expect a modern car to have 4 wheels and be as reliable as any other car. You don't get points for that any more.\n\nThe problem with this movie lies with the story, or maybe even deeper than that, a reason for its existence. If a filmmaker wants to make a movie for his own entertainment or for trying out different techniques that's fine. But if a movie is intended for general distribution it is not unreasonable for a paying audience to expect some return, either in sheer entertainment or at least some stirring of emotions that would not otherwise have been stirred. In this the movie fails, leaving us with a feeling that we have been at most cheated, or at least, misled. This movie is by no means the only or worst offender in this respect, and I did make it all the way through the movie waiting for the pay-off to appear, but ultimately it was a disappointment.\n\nThis movie has all the hallmarks of being substantially made up as it went along, and/or being written around the characteristics of its actors. The lead actress, it seems, has had a mastectomy in real life, therefore the story is to some extent written around that, although that fact is irrelevant to it.\n\nYes there is an overarching story in this movie, that of someone being pressured to move out of their home by a commercial developer. This premise has a lot of potential which despite a relatively long running time of 2 hours and 20 minutes regrettably was not realised. Not only was the potential not realised the story is not even finished so that when the credits roll we are left wondering if this is just Part 1 of an ongoing series.\n\nIdeally a story should have a beginning, a middle and an end. As has been mentioned this one has no end, and arguably it has no beginning either, or perhaps more accurately, it does have a beginning but one that is irrelevant to what follows, or is perhaps a beginning for completely different movie and which got edited onto this movie in error. This \"beginning\" starts with a car load of youths on the beach listening to music before moving indoors for a birthday party for an \"Aunt Louisa\" in which a large number of people appear, most of whom are unnamed and with indeterminate relations to each other. Aunt Lousia sits there stoically looking for all the world as if she would rather have slivers of bamboo poked under her nails than be at this party. For some inexplicable reason this scene seems to require many gratuitous flashbacks of phonographic sex, involving, we must assume, Aunt Louisa in youth. You would think, then, that Aunt Louisa would feature heavily in the remainder of the movie but you would be wrong. Aunt Louisa is mentioned once in passing in the remaining 2hours. She is, apparently, a red herring to throw us off the scent.\n\nWith a sudden leap we leave the mysterious Aunt Louisa to an unknown fate and zoom forward 30 or so years to the main course of the movie to focus instead on a \"Clara\", someone who was also present at the aforementioned Birthday party but about whom we as yet know very little. Whoever she is, she is, of course, now a retired woman, still apparently living in the same apartment in which the historic party took place.\n\nWhereas in the beginning segment Clara is constantly smiling, time seems to have been unkind to her, for she never smiles during the entire remainder of the movie. She is a cold, hard, cynical fish, it seems, to everyone, including her own family, although for all that she is well regarded and respected by all. We do not really know anything about this woman, but her past seems to have involved music, and she seems to be some sort of minor celebrity, with a circle of friends and relatives, some of whom may or may not be the same as the young people in the beginning segment, we will never know. She lives with another woman whose function and relationship is unclear and whose presence is entirely unnecessary. We find that Clara has had a mastectomy, and wonder if this is to become a major subject in the movie, but no this is a mere detail irrelevant to the story.\n\nClara it seems is not all that bright because she has not noticed that over the course of the last 30 years all her many neighbours in the apartment have moved out and that she is now the building's sole occupant. The building's owner, possibly not unreasonably, wants her to move out so they can build a more modern complex. OK, we get it, we might expect Clara to fight back, but given Clara's lack of personal warmth and her seeming obliviousness to the inevitability of the situation over a period of 30 years, it is difficult to root for her 100%. Yes, we can watch with interest to see what eventuates, but it is difficult to become emotionally invested in her struggle. We feel like an observer of someone we are not particularly interested in.\n\nAfter 2 hours and 20 minutes the filmmaker, it seems, has had enough, he evidently has no idea how to finish the story. So he orchestrates an implausible ending and films it in a way to give the impression that, voila, in one fell and cunning swoop, this has solved Clara's problem, whereas it is obvious to anyone that this would not be the case in real life. We, the audience, find we have been cheated, we have been sold half a story, and not a particularly interesting one at that.\n\nOK, I perhaps exaggerate a little for emphasis, but only a little. I expected better, and it should have, and could have been better. Not a disaster but a disappointment."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "leonardoemail-186-141475",
        "review_rating": "1",
        "review_title": "Terrible!! No wonder why people leaving in the middle of the movie..",
        "review_detailed_main": "I leave the theater very disappointed. The movie has absolutely NOTHING to tell. No history at all.\n\nClichês with no sense. NOTHING original, poor acting. I can make a better movie with my phone camera.\n\nSonia Braga should be ashamed. Is her financial situation so bad to accept to be submitted to this kind of movie about nothing? The others actors, I don't know. I mean, really! I DON'T KNOW ANYONE of them. Probably never will again.\n\nAnd what was that political bragging about? Politics and culture should not mix.\n\nI rated it 1, but might as well give it a big 0.\n\nOr, as we shall say it:\n\nDon't waste your $$."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "mickharry",
        "review_rating": "5",
        "review_title": "Sonia Braga is brilliant",
        "review_detailed_main": "Just home from seeing Aquarius in a cinema. This is cinema. You must not watch films like this at home. It is has to have a theatrical setting because it is a film designed to make you think. It is long, overlong. I appreciated the pace at first, family parties, friends gossiping at a dance, etc. I must admit though that towards the last third of the movie I was thinking, \"Get on with it!\". I know I got irritated but I also know these scenes will come back to me over the next few days as I try to get my head around why the director did not make an edit. What was that scene meant to convey? The film makes comments about Brazil. They do not flatter the country. In long scenes and conversations someone sticks in a comment about the nature of society in Brazil. The comment is made and the conversation moves on. Sonia Braga is fantastic in this. In a really long film she is the centre of every scene. I found the woman she played not someone I could like, but someone I could admire for her stubbornness. She admits, \"I am a woman and a child!\" I think the overriding feeling I have is that it's just too long!"
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "inlovewithwords",
        "review_rating": "1",
        "review_title": "Stay away from this boring stinker.",
        "review_detailed_main": "Don't get misguided by the media hype about this mediocre movie. It's been overblown by the fans not due to its intrinsic values but due to its use as a political propaganda against the overthrow of a brazilian president in 2016 when the actors and director staged a protest during its release at the Cannes Film Festival. It's boring, kitsch, oversentimental, badly directed and the acting is mediocre at best. If I were you I would save my hard earned dollars to watch a decent foreign movie if you're into international cinema. Stay away from this stinker."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "louissvalo",
        "review_rating": "2",
        "review_title": "A regular movie, interesting.",
        "review_detailed_main": "It is a good movie, mostly simple and cliché, bordering on a bit mediocre (why not?), but it is a good production and I hope I get my opinion respected, because I know there are better movies with a similar theme, wonderful titles by the way (even in Brazilian cinema) :) The cast is very good (at most), and so are the scenarios. The music are very well chosen and live up to a good movie, and even improve their value The way the story unfolds is somewhat interesting, but it is not innovative at all. It is more of the same, but there is a good work accomplished, even if it is a formula already well-known in the cinema. The only thing that gets me disappointed about the movie is the way it has garnered the resources to be produced. Anyway, is an interesting movie. If you have nothing more important to do, and you are open mind for good vibrations and a nice story, so this movie worth watching."
    },
    {
        "movie_id": "tt5221584",
        "movie_name": "Aquarius",
        "movie_rating": "7.4",
        "review_username": "curuense",
        "review_rating": "3",
        "review_title": "Overlong and boring",
        "review_detailed_main": "This is a good history, but unfortunately, very long. Clara is the unique inhabitant of an old building, named Aquarius, facing the sea and refuses to leave it. But there are unnecessary frontal nude scenes, dragged dialogues, very slowly scenes, resulting an overlong movie."
    }
]