[
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "bob68k",
        "review_rating": "5",
        "review_title": "Good Movie",
        "review_detailed_main": "Listen, this movie does have some comedy in it. It is what it is, and knowing the main characters and subject you are getting what you expect to get. This movie starts out a little slow but eventually builds up into a film that can hold it's own. This movie was fluid enough to keep me entertained and laughing here and there so it's not half bad. The fight scenes are good for the men. There is a romantic side of the movie too for the women,and a cultural touch as well. It is also very patriotic in the sense that it's a military movie and I'm sure many GI's will enjoy this movie too. Give it a chance if you have 90 minutes of free time, you may be surprised."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "dustinhunter707",
        "review_rating": "5",
        "review_title": "Average Comedy",
        "review_detailed_main": "I am going to be honest, I thought this movie would be a little funnier than it was but it wasn't a complete disappointment. The first 35 minutes of the movie was just plain retarded and unfunny, then after that it gets a little better. However seeing that the 3 leading comedians were Larry The Cable Guy, Bill Engvall, and D.J. Qualls, I still found the funniest guy in this movie to be Keith David. His role as Sgt. Kilgore made me laugh several times more than I laughed at the others, oh and Danny Trejo was pretty good as being the villain and being funny at the same time. But anyways I give this movie a 5 out of 10 because it starts off slow and unfunny, but then it kind of picks up and you might have a few laughs before the end credits start to roll."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "wsbowles",
        "review_rating": "5",
        "review_title": "On the level of \"Dumb and Dumber\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "tyzephyr",
        "review_rating": "1",
        "review_title": "For rednecks & people under 15 y/o",
        "review_detailed_main": "I've seen a lot of really bad movies in theaters. Sat through them and suffered. This was only the second movie in my life time that I've actually walked out on. I wish I had left sooner than what I did (I sat through nearly an hour and a half of this crap), I could have gotten a lot more done that day. Seriously, it was nothing but vague references to overdone jokes by both Larry the Cable Guy & Bill Engvall - two comedians who haven't changed their routines in nearly a decade, who by some fluke of nature, still have careers. At one point the movie actually paused to zoom in on Larry, covered with ammo, so he could say \"Git-r-done\" and rile up all the rednecks in the audience.\n\nEvery aspect of this movie was terrible. The acting, the fight scenes, the comedy, even the explosions were terribly boring and pathetic.\n\nWhat it boils down to is this: Bill Engval & Lary TCG are nothing without Jeff Foxworthy and Ron White. No, the movie wouldn't have been much better with those two on the bandwagon, but it might have at least had some laughable humor in it."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "dbgillespie-1",
        "review_rating": "1",
        "review_title": "Quite possible the worst movie in all of history",
        "review_detailed_main": "I really wish I could give this movie a negative rating it was just so terribly bad. My date and I were the last people to walk out of the movie; the whole theater was empty about an hour and a half into the movie. The jokes were just not funny. I had a couple of times where I forced a chuckle, if only because I went to the movie really wanting to laugh. The acting, scripts, plot, everything, was pathetic. Do yourself a favor and avoid this movie at all cost. If you really feel the need to dispose of your money so wastefully, you could wire it to me and the money you spent will provide you with the same amount of entertainment. If, after reading this and the other reviews of this travesty of a movie, you still feel you must watch it, wait for it to show up on cable... as bad as this movie is, you probably will not have to wait more than a month before it hits TV."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "stoogedude",
        "review_rating": "3",
        "review_title": "Larry and Bill should stick to stand-up comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "nalders",
        "review_rating": "1",
        "review_title": "Half of the Blue Collar Comedy Tour Presents: Stripes 2: The War on Humor",
        "review_detailed_main": "This is an unfunny version of Stripes. In fact, it's almost as though they took the script for \"Stripes\", replaced Bill Murray with Larry the Cable Guy, Russia with Mexico, and cut out most of the humor and wit. It has a bare handful of almost-mildly-amusing moments, and I only laughed because I was drunk. Mostly, though, it's just dumb. Really, really dumb. And not \"funny\" dumb. Just... dumb.\n\nAnd what a waste of Marisol Nichols. That woman is as hot as this movie is bad.\n\nDon't pay money to see this. Wait until it's on TV some night, when there's nothing else to watch. Even then, you might want to consider just going to bed early."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "therica",
        "review_rating": "",
        "review_title": "Loved it! Laff a minute!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "Lorenzofoto",
        "review_rating": "1",
        "review_title": "This movie is PAINFUL, RACIST, and DUMB x100! Worst ever!",
        "review_detailed_main": "The only thing semi-good about this movie was the original premise. After that it was the most painful movie experience of my life. This actually may be the worst film I have ever seen. It is amazing to me that anyone could be unintelligent enough to like this film at all! In fact I think its what's wrong with America (but that's another letter for another time)! The entire time I was in the theater I thought I was on punked - because NOTHING COULD BE THIS BAD. The jokes weren't funny AT ALL, the story was ridiculous and unconceivable beyond belief, and it looked like it was shot on home video. The fact that this movie got Greenlit is dumbfounding to me. If someone wants to see something funny in this genre then see Three Amigos (of which this movie is a blatant rip-off). I am not even that liberal of a person....but this movie would lead people to believe that American's believe that Mexicans are useless, uneducated, people who need rescuing by the amazing Super Power. Its appalling how it tries to represent what we Americans \"think\" - and if it is, we are doomed! This movie was Racist, full of Homophobia, and just plain stupid. I am so angry this film was made I can't even think.."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "nabor7",
        "review_rating": "7",
        "review_title": "Don't Overthink this!",
        "review_detailed_main": "After reading the various comments for this, it seems that most viewers have allowed others to do their thinking for them. This movie is not \"To Kill a Mockingbird\" or \"The Sound of Music\", it is a movie made by redneck comedians dedicated to our real fighting men and women. Anyone who has ever been in combat knows that humor is where you find it, and this movie has a lot of it, if you keep your mind open. This database is an amazing tool. If you look at other movies commented on by users who didn't like this movie, the majority haven't liked other inane titles with the same bent of humor. I don't pay theater prices to see a movie. They are a ripoff especially when most movie goers are rude, inconsiderate slobs. I guess my point is that if a person doesn't like this type of movie why pay the money to hate something you have predetermined to hate? The trailer was enough to know how the movie would be.\n\nIf you like to be entertained and don't want or have to think, this is an excellent movie"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "LeroyBrown-2",
        "review_rating": "1",
        "review_title": "A comedy with no originality or laughs",
        "review_detailed_main": "This is one of the most horrendous movies I have ever seen. It's supposed to be a comedy but It wasn't very funny at any moment. And I don't know if it has a political message, is it pro Iraq war or anti, either way I couldn't tell. It's just a mess that should be avoided at all cost, it has no original joke and every joke has been told before. More than that, every joke and every situation that's supposed to be funny has been telegraphed and expected.\n\nThe movie is about a trio of redneck buddies who are in the Army reserves and are called up to duty to join the fight in Fallujah. Needless to say they did not make it there, but the redneck part is played to the hilt. From the first time they were introduced up to the time they landed at the wrong destination. Everything they do emphasize their ignorance and none of it is particularly funny. It's like the worst of \"The Beverly Hillbillies\" it's not even ignorance in some cases just stupidity. And it makes the movie more painful to watch than already is.\n\nNone of the jokes and situations are original, and most of them are telegraphed and quite very early. The situation with Larry and his girlfriend (Christina Moore) was pretty much where it was going to go. You can't convince me that you didn't know what she was going to say. Even the sight gags were so obvious, sending us endless message that this trio are a bunch of rednecks and they're suppose to do the redneck cliché.\n\nOld jokes can sometimes still work if you have the right people to deliver it. Suffice to say this cast of goofballs just are not the right people. For the most part they know they're delivering a one liner or a punchline. It's been said that the best way to play comedy is to play it straight. These guys know they're in a comedy and what's worse is that they know it's bad comedy. None of the three leads are particularly good actors and what they do isn't create a character but rather create caricatures. Personally I find that that's common with comedians who try their hands at acting.\n\nThis movie is an unoriginal, unfunny, clichéd film. The jokes are clichéd and so are the situation. To make matters worse none of the lead are any good as actors."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "drtre2006",
        "review_rating": "10",
        "review_title": "Its Just A movie",
        "review_detailed_main": "OK why cant people just watch a movie and enjoy it for what it is why is it that every movie release has to be reduced to some ridiculous claim of racism. This movie is not exactly great but it was enough for me too be entertained through-out.DJ Qialls with his build is hilarious in this setting i haven't seen him in anything since The New guy.And well if you liked the blue comedy and more importantly Larry the cable guy you will get your fix \"GET R'DONE\".Nothing in this film is malicious or racist its just puns and dumb giggles. BUT come on What else would you expect.The only thing that i really didn't like in this movie was the American glorification but I've come to expected that All I can say is turn off your brain and you might like the movie."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "ssto",
        "review_rating": "7",
        "review_title": "despite the ill comments this is a funny movie",
        "review_detailed_main": "i'm not sure i understand some really hateful comments on this movie. i found it funny, in a lightly-spirited way, entertaining enough to keep me watching it to the end. nice characters, funny story and, well, laughable stereotypes\n\ni didn't see anything even mildly insulting, or politically incorrect. maybe if you're Mexican it could offend you if you woke up this morning at the wrong side of bed (and not wanting to see that its the Americans this movie is laughing at, not the mexicans, dough!), but hey - do you also hate Desperado for the same stereotypes?\n\ntake it easy, have fun, if not - go spitting poison somewhere else please\n\n7/10\n\npeace"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "agarwalmukund",
        "review_rating": "1",
        "review_title": "What were the producers thinking?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "gregmovies",
        "review_rating": "1",
        "review_title": "Truly pathetic",
        "review_detailed_main": "I'm not sure I've ever seen a worse 'comedy', although Epic Movie gives it a run for its money. None of the jokes were funny, Larry the Cable Guy was just as obnoxious as usual, the acting was terrible, the script stupid, and the premise no better. Unfortunately I got dragged to this one by my brother, who likes most every stupid movie out there (Epic Movie, Paul W.S. Anderson films, etc.). This isn't even one of those \"so bad, its good\" movies. How Larry the Cable guy continues to get paid for these pieces of trash is beyond conceivability. The saddest thing is 680 people, 12.9% of voters, gave this movie a perfect 10.\n\nI give \"Delta Farce\" 1/10, avoid it like the plague. If you liked this film, well, normally I give recommendations here, but, I can't imagine anyone actually enjoying this."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "raypdaley182",
        "review_rating": "2",
        "review_title": "awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "planktonrules",
        "review_rating": "4",
        "review_title": "Not as bad as I'd expected.",
        "review_detailed_main": "Originally, Jeff Foxworthy was scheduled to star in this film. Fortunately for him, his schedule wouldn't allow him to be in the movie and so his two friends, who were less lucky, starred in this mess. I thought Bill Engvall was too talented for this sort of terribleness. Larry the Cable Guy, however, is pretty much in his element. Don't believe me? Look up his filmography on IMDB! As for who took Foxworthy's part, I assume that was D.J. Qualls...a super-skinny guy who I cannot remember having seen in films before this one.\n\nIf you can believe it, 260 pound and 44 year-old Larry the Cable guy, 50 year-old Bill Engvall and D.J. Qualls (who appears less athletic and muscular than Wally Cox) are ALL supposed to be in the Army Reserves. We are not only supposed to believe these three are in the military (at least part-time) but that their Reservist unit consists of just these three men and no commanding officer!! Soon, however, a sergeant (David Keith) arrives and you'd think he'd whip them into shape. Instead, he announces they are going on active duty in Iraq!! So, in the next scene they are in a transport plane headed to Iraq...and an accident occurs and drops the four of them in Mexico*...and they three idiots believe it IS Iraq. As for the sergeant, he was left behind because they thought he was dead.\n\nAfter wandering about the countryside, they wander in to a town and they attack because they think they are in enemy teritory. Yes, despite everyone speaking Spanish, they still think they are in Iraq. However, they accidentally do something good...they drive off a group of nasty bandits who have been terrorizing the town. Now, the three morons are heroes.\n\nUnfortunately, their life as heroes is short-lived. The sergeant IS alive and is coming to get them AND the bandit leader (Danny Trejo) is planning on a rematch. What's next? Watch the film...or don't. I wouldn't blame you if you didn't.\n\nTo say that the story makes little sense is a big understatement...along with the fact that no country would ever allow these three misfits to serve. Much of it is totally stupid, some is offensive (IMDB won't allow me to post the offensive word they kept using) and, accidentally, some of it is actually funny. Now here's the interesting part--the professional comedians are NOT funny....but Danny Trejo is a hoot and makes the film at least watchable...the same is true of Qualls. More of them and less of the Larry/Bill would have made this a much better picture. In fact having NONE of Bill and Larry would have made the film much, much better. They suck...no two ways about it.\n\nSo is it worth seeing? Perhaps, if you have rather low standards. But I will say it's NOT as bad as many of the reviewers say...and I cannot imagine giving this one a 1 or 2 when there are thousands of worse films...not that this is a glowing endorsement to go see it! My attitude is that it's a brainless and occasionally funny time-passer....I just wish Engvall and Larry the Cable Guy had opted out of appearing in this one, as they were the worst thing about the film. Larry was, quite simply, Larry (I think that is pretty self-explanatory) and as for Engvall he generally acts like he's nearly comatose during most of the film.\n\n*Their reserve station was in Georgia...how they had to fly over Mexico to get to Iraq is beyond me!!"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "hung_fao_tweeze",
        "review_rating": "5",
        "review_title": "No where nearly as bad as some would have you believe",
        "review_detailed_main": "Yes, this is redneck humor. Don't look for anything terribly intellectual or deep in this tale. If you settle in and expect a bit of stupidity, groaning, and a complete lack of plausibility you can enjoy this movie. In fact, there are a few real honest to good belly laughs here. The Mexican alpha-dog bandit is a hoot and is probably the best actor in this exercise in silliness. His gay nephew is a knee-slapper as well. Meanwhile, everything else is lightweight and not stressful. Think 'Gilligans Island' and you'll be right about where this will fall in the scheme of things. I did enjoy the flick and will probably watch it again because I was entertained which is all I wanted to begin with. If you don't get into rednack farce you probably won't have much use for this movie. I give it a 5 because it could have been a lot funnier - a lot of missed opportunities and some situations just fall flat. But I got pretty much what I expected and ended up not feeling ripped off for watching it."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "asimonetti88",
        "review_rating": "1",
        "review_title": "Delta Farce is the downfall of Western Civilization",
        "review_detailed_main": "I read a lot of user comments and ratings on IMDb and have for a long time. I have never before written one, but after reading some positive comments for this movie, I felt compelled to register just to comment on this movie. This movie is the downfall of Western Civilization. The plot by itself should make you want to die a slow death: soldiers think they are going to Iraq but end up in Mexico instead. Someone said that this somehow supports our troops? I'm sure our troops are sleeping better at night in Iraq because Larry the Cable Guy made a movie depicting US soldiers as too stupid to know the difference between Iraq and Mexico.\n\nThis whole movie is offensive and there is no way around it. I'm not an easily offended person either. There is no way that anyone with a brain and a conscience could actually enjoy this movie. The official slogan is \"War isn't funny..... but the movie is!\". This movie, combined with the fact that there actually people who gave this movie a good rating, is the reason why everyone else hates America."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "anthon-six",
        "review_rating": "7",
        "review_title": "Really funny",
        "review_detailed_main": "After reading the comments for this movie, I thought it would be bad.\n\nBut I was wrong, this movie is funny, really really funny.\n\nCool casts and really nice and sharp jokes.\n\nThere are not many comedies that have made me laugh, but this was one of those who pulled it off.\n\nThe first 15 minutes or so were a little slow, but after that it gets a lot better.\n\nThis movie wasn't some wannabé comedy, that want's to be funny, this movie was funny.\n\nI give this movie a 7, for what it is - a funny entertaining movie.\n\nPeace"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "pdiddypeters",
        "review_rating": "5",
        "review_title": "Satisfactory in the funny department",
        "review_detailed_main": "I thought this was a lot better than Health Inspector, particularly because Larry has one of his Blue Collar pals joining him for the ride. I've always liked Bill, and the chemistry between him and Larry during the film was very neat. Plus, their comedy was more satisfactory. The setbacks were that D.J. Qualls' character was too insane at times, and that Keith David's performance was big departure from his more memorable military performances. Danny Trejo gave me some great laughs, especially when he sees some of his cars blown up and declares it vandalism. Also note, I took a friend that was in boot camp not long ago to the movie and she enjoyed it a lot. Like I said , this movie is satisfactory in the funny department, and even if it don't cause you to have roars of laughter, it will give you enough chuckles to make it worth watching."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "ed-76151",
        "review_rating": "9",
        "review_title": "Very funny",
        "review_detailed_main": "If you served in the military, then your only response to this film is to laugh your ass off.\n\nIf you didn't serve, then you might not get some of the humor, but, hopefully, you were able to laugh just the same."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "dobbin-4",
        "review_rating": "7",
        "review_title": "I actually really liked it.",
        "review_detailed_main": "Delta Farce is the newest comedy to come from Larry the Cable Guy. In this movie 3 army reservists (Guess) are all sent to Iraq but accidentally get shipped to Mexico. The movie is funny with only 3 or 4 jokes not getting a laugh from me (Which is better then some of the other S@!t coming out nowadays. Anyone who likes a laugh SHOULD get a kick out of this movie. As long as you can sort of Dumb down for an hour and a half this should be an OK film. Overall this film is good and deserves to be recognized for that. I could understand a 4.6 or a 5.5 but a 2.7 is shocking. I rate this film a solid and fair 69%. Good day and god night from Dobbin-4."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "webb-co",
        "review_rating": "1",
        "review_title": "Worst movie ever!!!",
        "review_detailed_main": "I would rather kill myself then have to sit through this piece of junk movie again!!! The only reason I finished this movie was because I have never seen anything so stupid in my life!!! If you thought this movie was funny chances are you are your an inbred hick who will never see this comment because you can't read!!! Fcuk Leary the cable guy!!! \"Get er done\" sorry Leary Giver up!!! What really amazed me was the fact that this movie came highly recommended from a friend! Take my advice and never watch this movie take the hour and a half and stare at a blank wall it will be more entertaining!! Next time someone tells me that delta farce was a good movie I will spit in their face."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "zardoz-13",
        "review_rating": "4",
        "review_title": "Dolt-a Farce",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "casey8818",
        "review_rating": "1",
        "review_title": "Awesomely bad movie",
        "review_detailed_main": "Just to show you how awful this movie is, I was the only guy in the whole theatre! If not for the nice feeling of my private viewing in my own home theatre, the rest of the 90 mins plus agony was excruciating.\n\nOnly people thats going to get entertainment out of this flick are children below 10, drop dead drunks and Red-necks. Phew.\n\nSave your hard earned bucks, give this a pass. Do yourself a favour you don't really need a bullet in your brains. :D You might want to wait for the rental. There should be a law against movies this bad. Is there some form of regulatory organisation like the FDA but this one for bad movies so it can be yanked out of circulation before it hurt our eyes and brains? Yucks."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "adamaisacylon555",
        "review_rating": "1",
        "review_title": "What?",
        "review_detailed_main": "\"This film rated only 3 percent at Rottentomatoes.com. That means it pleased only 3 percent of all the reviewers (critics would be a pretentious job description for most of these folks) who wrote it up.\"\n\nOh goodness, those \"reviewers\" didn't like this masterpiece of funniness ? What's wrong with them! Who needs Richard Pryor and George Carlin when we have this! \"If you read the reviews\u0097a proposition far more tedious than the film they seem to hate\u0097you'll see why there's nearly universal disdain for the flick: (1) a premise based on military reservists going to fight in Iraq (see Bush Derangement Syndrome), (2) jokes predicated on homosexual panic (the despised \"homophobia\"), and (3) \"idiot racist humor,\" e.g., \"I hear them carpet fliers don't wipe their butts.\"\"\n\nWow, most people don't find gay and fart jokes funny beyond imagining! What's wrong with them? Since I don't know what \"Bush derangement syndrome\" is maybe you could tell me! What possible connection does thinking \"delta farce\" is a horrible movie and disliking George bush have? I don't like this movie because I like humor that actually funny. You must be very sad since they canceled \"Hee Haw\"! \"Well! The establishment types cannot stand by and allow us to laugh at THOSE sorts of things, now, can they!? Especially not if they happen to be FUNNY.\" Those establishment types! What a rebel you are! Gay jokes and fart humor! You're the most rebellious guy in your junior high school!"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "Thomasbuettner22",
        "review_rating": "1",
        "review_title": "Darwin would have had a blast...",
        "review_detailed_main": "Usually people say you can't improve on nature, well, wait until you punished yourself through this waste of celluloid. Larry, Bill, PLEASE stick with stand-up comedy and address the meaning of life from your Redneck point of view, that's more funny.\n\nBut I guess everyone must have a bad day in his career and unfortunately, it was Larry and Bill's turn. Quite honestly, I've seen funnier animal documentations on Discovery but this one here takes the cake. So don't expect any great acting from a Stand-up and somehow I feel sorry for some good supporting actors.....but a pay check is a pay check, right? My advise, re-plan the 90 minutes that you anticipated watching this movie on something more thoughtful - watch Meerkat Manor if you want some laughs."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "DashTheGreat",
        "review_rating": "2",
        "review_title": "Medic!!!",
        "review_detailed_main": "I can't believe that I watched this movie, but the sad fact is that I did. I ignored the warnings of IMDb and the bottom 100, and decided to actually give a \"Larry the Cable Guy\" movie a shot. Boy, was I sorry.\n\nThis film doesn't actually have a plot. It's just Larry the Cable Guy, Dj Quails, and 2 other actors doing a 4 man comedy show, who happen to be in the military and in Mexico. \"Delta Farce\" is overrun with jokes that are downright embarrassing. This is the kind of stuff where, a bush-league newbie comedian goes on stage for the first time and gets crickets. I felt genuinely embarrassed for whoever wrote this movie, and would advise them to take the \"sue for name removal\" route immediately.\n\nSecondly, \"Delta Farce\" was stupidly unbelievable and ridden with clichés. For example, Keith David calls the men \"maggots\" in R. Lee Ermey fashion, and orders them to go to Iraq. Another dumb moment was the very fact that Marisol Nichols was in the movie, with makeup all done and perfect hair, with the rest of the village looking weathered and primitive. That wasn't the first, \"man, this is stupid\" moment, but it doesn't help you escape from the fact that you're watching a Larry The Cable Guy movie.\n\nSo, upon watching this garbage halfway through, I aborted my viewing mission, and left men behind; especially Larry the Cable Guy who should never star in a movie again. I'll probably work on humanitarian missions next, like advising other people to never watch this piece of crap again.\n\n2 / 10"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "bellino-angelo2014",
        "review_rating": "6",
        "review_title": "Not that bad and very funny in some points",
        "review_detailed_main": "When the story begins we see Larry (Larry the Cable Guy), Bill (Bill Engvall) and Everett (DJ Qualls) having all their misfortunes: Larry lost his job as a waiter thanks to his girlfriend who cheated on him, Bill is forced to stay with his wife as he's unable to divorce her and Everett is an inept security guard who crashed his car in a nail saloon. These three losers become members of the State Military Reserves and they are soon to go to Iraq to be deployed to the occupation of Fajullah. Hard-nosed Sergeant Kilgore (Keith David) has to prepare them and helping them keep a perfect shape. After this, they are all loaded on a C-130 transport plane bound to Iraq. However when the plane is over Mexico there is a thunderstorm and the pilots are forced to dump some cargo. The three misfits were sleeping in the Humvee that was dropped and Sergeant Kilgore happened to be there as he was looking where his men ended up. Since when they arrive they see only desert around them they assume they arrived in Iraq and even bury alive Kilgore! They soon end in a village and think that they are helping the villagers to fight against terrorists. In fact, the village is plagued by the attacks of a bandit gang led by Carlos Santana (Danny Trejo) and the three ''heroes'' try to defeat them in various ways (and also save Sergeant Kilgore after he is kidnapped). And in the end they are seen as heroes and awarded with the Silver Star and the Purple Heart (and Kilgore will open a fitness centre) and Carlos becomes a comedian.\n\nSo it this movie any good? I thought ''so and so''. But you might assume it isn't as it has a score of 3,6 and for a period in 2019 it was in the Bottom 100 (the list of the 100 lowest rated major released movies) and when I read the reviews I even thought that I was watching a different movie! It has some very funny moments (such as when Kilgore is abducted and is forced to sing I'VE GOT YOU BABE by Sonny and Cher, or when Everett disguises himself as a lucha libre wrestler and he defeats all his opponents which might seem impossible as Everett is probably the skinniest guy I have ever seen on film!) and also kept me very entertained towards the end as I was curious to see how the bandits ended up. And the supportings performers (especially Keith David, Danny Trejo and Glenn Morshower) were a real hoot to watch.\n\nMy opinion is that this movie was just a decent and funny time-passer and I couldn't force myself to give it a 3 or a 4 as there are worst comedies out there (including most of the other Bottom 100 entries). If you don't have high expectations during the viewing just like I did, you might even like it."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "johnno-17",
        "review_rating": "2",
        "review_title": "One point for the money spent to produce it (but why did they bother?)",
        "review_detailed_main": "I don't know where to start about how unfunny this film is. I suppose the first important point to make is that three guys who live in the south-mid-west - an area teeming with immigrant workers from Mexico - could possibly spend a whole day in Mexico thinking they are in Iraq. That level of dumbness is simply not allowed. True, the Three Stooges could get very close to this, but their comedy was rapid fire and unsentimental. This film, on the other hand is pretty standard sympathy-for-the-dummy fair, meant to appeal to people who suspect their own inadequacies, so they want a comic hero dumber than they are but who validates their values. That in itself tells you that this is a bad movie.\n\nAnyway, on top of that general disorder, there is the unfunny humor about Iraq (Fallujah was a horrible blood bath); unfunny humor about gang murder; unfunny Mexican stereotypes; unfunny redneck stereotypes; unbelievable, and unfunny two day bootcamp scenes - well, what's the point of going on. The operative word is \"unfunny.\" Toilet humor, of course, and unfunny slapstick. What more could you ask from a film this childishly amateurish? Oh yeah, you can ask it to end - or just pull it out of the DVD player half-way through, which is what I did."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "byozim",
        "review_rating": "10",
        "review_title": "Ignore the Hater's!!!",
        "review_detailed_main": "This movie succeeded in hitting all its objects...it's got a great cast of very funny people, the story is a crazy funny scenario, the jokes are great and totally in line for this cast. If you are a fan of, Larry the Cable Guy, Bill Engvall and DJ Qualls then you will really enjoy this movie. If you are not a fan of those guys and their comedy, then don't watch this movie and you can save the time you would have wasted writing hater comments!!! Remember that the hater comments, are coming from one dimensional movie goers who compare everything they watch to a few very select movies that they happened to like!!! So...know this...Delta Farce can't be compared to anything, it's just a fun movie that you will enjoy. I should have written this years ago, but I only read the negative comments now!!! Hopefully real fans who enjoy a broad range of comedy styles will ignore the negative drivel and watch Delta Farce. You will wonder why you are only watching this 2007 movie now :-)"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "bugz-rabbit",
        "review_rating": "6",
        "review_title": "Not as bad as the rating makes out",
        "review_detailed_main": "Being Irish-born living in England, I've never heard of Larry the Cable Guy, so his humour wasn't tired or 'more of the same' and also it is very unusual to see America doing satire. I guess this is a film that Americans just don't get, because the Iraq issue is such a serious one to them (along with the Mexican issues i guess) As you can see, i have rated this 6 out of 10.\n\nNo belly laughs, but i did find myself smiling at the jokes, and whats more, I didn't need to turn it off, or fall asleep, so its better than some Hollywood blockbusters I have seen recently (Rise of the Silver Surfer as one example)"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "Buddy-51",
        "review_rating": "3",
        "review_title": "How Low Can You Go?",
        "review_detailed_main": "\"Delta Farce\" strains credibility even for a comedy whose sole purpose for existence is to strain credibility. Larry the Cable Guy, Bill Engvall and DJ Qualls star as three imbecilic army reservists who are accidentally dropped off in Mexico on their way to Iraq. Unaware of the mix-up, the trio, believing at first that they are actually in Iraq, wind up fighting against some local gangsters who are terrorizing the inhabitants of a small rural village.\n\nAs written by Bear Aderhold and Tom Sullivan and directed by C. B. Harding, \"Delta Farce\" is riddled with wheezy plot mechanics, tired lowbrow humor, and insulting stereotypes of gays and Mexicans, the latter of whom are portrayed as either gold-toothed, moustache-twirling banditos or backward children who not only cannot defend themselves against the bad guys but must rely on good old American ingenuity and know-how to get even the simplest menial task accomplished. This is especially offensive given that these American heroes are not too many DNA strands away from being certifiable idiots themselves. None of this would really matter so much if the movie itself had managed to be funny. As it is, however, this is about as thoroughly witless and lame-brained a comedy as has come our way in a long long time.\n\nThe movie makers end on a sobering note, dedicating the film to the real military men and women fighting in Iraq and Afghanistan. It's a nice gesture, I suppose, but don't our brave soldiers already have enough troubles over there without having to contend with a cinematic \"tribute\" like \"Delta Farce\"?"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "wakka55",
        "review_rating": "",
        "review_title": "This movie sucked!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "solidgameboy12-1",
        "review_rating": "3",
        "review_title": "Horrible slapstick mixed with horrible stereotypes gives everyone a bad name",
        "review_detailed_main": "With movies that have made mockery of such stories and movies involving disaster films (Airplane!) Police squads (Naked Gun) Horror movies (Scary Movie) and even Teen Sex Comedies (Not Another Teen Movie) a mockery of the men and women in arms seems like a very possible topic to exploit for humor, right? If it were a movie done by the Wayans Brothers or David Zucker and it didn't star Larry the Cable Guy, Bill Engvall or D.J. Qualls, it might have had some kind of chance.\n\nDelta Farce is one of those kinds of films that tries to make fun of a lot of movies where the military branch of the world needs a little mockery, since it's such a serious profession to work in. This kind of recipe has been seen before: Take a couple of bumbling friends (Qualls, Engvall and Larry) give them some kind of crisis with their lives, and have them put into a situation where bumbling around actually means your doing a good job.\n\nThis has been seen before in much better movies, and trust me, those movies are a hell of a lot better than what you could see in this movie.\n\nWhat could have made this movie funny is that these three friends are stuck in Mexico, but they haven't got a clue, they just assume the people living in the village are Iraqis. Stuff like that could have been funny, but instead, it's never taken opportunity of. The characters act confused, and never make an understanding right away (Judging by the terrain, Iraq apparently has mountains and grass, but I digress.) This movie could have made jokes barraging the military, but instead, the three men in charge are much more bumbling and funnier to mock because of their stupidity and buffoonery, which is all well and good, but these kind of jokes rarely work unless the character(s) have a bit more intelligence than the ones in this movie.\n\nAlso, in poor taste, stereotypes are just strewn about throughout the film. The villains in this movie have some kind of intelligence when to inform others about their mistakes, but seem incompetent when faced with situations of their own. Danny Trejo is a poor villain known as Carlos Santana (Not the singer, Carlos repeats) whose annoyance is that he's given many opportunities to shoot people, and he talks about it.\n\nThere's also a very horrible slam to homosexuals that just disgusted me (He's gay, flamboyant and Hispanic, and no, I'm not against any of the three, it's just insulting to mock in distaste) and Keith David in this movie as the only real normal thinking man is rarely seen, probably to avoid being seen in this movie as much as possible.\n\nFor someone else, this might actually be funny to someone. My father, who was in the military for awhile, loved this film because he knew a lot of the stuff they were going through: yelling men, conflict in the field, etc. Perhaps this movie might be funny to someone who has went to basic training and gone to Iraq, or not.\n\nAll I know is that for me, this is definitely one movie I did not enjoy, it's very limited in laughs, in anything. My father loved it, but I did not. If you've seen \"City Slickers\" or \"Wild Hogs\" or \"In the Army Now\" with Pauly Shore (After seeing this movie, Pauly Shore actually seems like a welcome release.) Watch those movies again, because this movie is just not worth your time, your attention span, or for your country.\n\n3/10."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "robbiev-1",
        "review_rating": "3",
        "review_title": "Pretty bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "jhunior35",
        "review_rating": "1",
        "review_title": "bad ? trash? this movie is a real bomb",
        "review_detailed_main": "strong trash movie god save my eyes. the movie is a real bomb trash ,nosense no smile a scene never see a big trash in mi life. very ridiculous one has never filmed so idiotic and bad done in my life. A true wastefulness of time and money. It does not waste minutes of its life attending this bad bomb produced and without nexus some. the locations poor and bad are made, disorganized and meaningless plot. actors of BAD quality who do not serve nor to make amateur theater, now if you want to fast die and to ruin its eyes loses its time attending this tinned garbage. I recommend to my enemies this Joya of Storm art. j I had more efficient belly ache in humorists terms that this film."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "iamtherobotman",
        "review_rating": "3",
        "review_title": "Lucky Day, Ned Nederlander and Dusty Bottoms return...Kind of.",
        "review_detailed_main": "I stumbled across this on Amazon and thought i'd give it a wee go.\n\nThis is bad. It's clearly a rip off of 'The Three Amigos', but unlike that film, this one is utterly abysmal.\n\nIt's a typical cheap, quickly made American 'comedy'. The script is poor, the main cast are people no one outside of the US will know. The majority of the budget seems to have been spent getting Danny Trejo onboard, as he's the only face non Americans will really recognise.\n\nThe jokes (if you can call them that) are really, really poorly delivered and poorly written (You could have Billy Connolly deliver these lines and they still wouldn't be funny). It's just a very poor film."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "KinoBuff2021",
        "review_rating": "4",
        "review_title": "Bad but somehow not unwatchable",
        "review_detailed_main": "I'll be honest, this film is bad but not terrible. I don't think this film is really worth watching yet I wouldn't mind watching again if it was on tv.\n\nSome outdated jokes that don't really hold up like ones directed at certain minority groups specifically gay people. But some of the fun of the film is the lameness of the jokes. I laughed at certain things only because how ridiculous they seemed.\n\nAlso if you were in the military especially the reserves/guard you will get a good kick out of this film because there are things that civilians probably won't notice/get."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "mushbuster",
        "review_rating": "7",
        "review_title": "Harmless, amusing diversion",
        "review_detailed_main": "This film rated only 3 percent at Rottentomatoes.com. That means it pleased only 3 percent of all the reviewers (critics would be a pretentious job description for most of these folks) who wrote it up.\n\nIf you read the reviews\u0097a proposition far more tedious than the film they seem to hate\u0097you'll see why there's nearly universal disdain for the flick: (1) a premise based on military reservists going to fight in Iraq (see Bush Derangement Syndrome), (2) jokes predicated on homosexual panic (the despised \"homophobia\"), and (3) \"idiot racist humor,\" e.g., \"I hear them carpet fliers don't wipe their butts.\"\n\nWell! The establishment types cannot stand by and allow us to laugh at THOSE sorts of things, now, can they!? Especially not if they happen to be FUNNY. So they've sharpened their pens and let fly against what is basically a sweet, harmless, and amusing diversion. They said the same things (with a bit less vitriol\u0097after all, the premise didn't arise from the hated Iraq campaign, did it?) about Larry the Cable Guy's last movie. So I rented the DVD and laughed my ass off. I mean, can you really not laugh at Larry's fart and plumber's crack jokes, or big ol' burly rednecks worrying about their masculinity? Of course not. FART JOKES ARE FUNNY!\n\nHey, you may not laugh as hard as you would at the hoidy-toidy pretentiousness of the mainstream media's narcissistic reviewers, but you'll laugh nonetheless."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "derekdiercksmeier",
        "review_rating": "1",
        "review_title": "Absolutely The Single Worst Film In Cinema History!!!",
        "review_detailed_main": "\"Delta Farce\" is the single worst film ever made. Nothing else comes close. Not only is this film not amusing in any way whatsoever, it is also highly offensive. The film is racist, misogynistic, and primarily xenophobic. The story is about three men who think they are fighting the war in Iraq, when they are actually in Mexico. \"Delta Farce is the worst script ever written. Larry The Cable Guy is an atrocious actor. DJ Qualls is absolutely cringe-worthy in the film. I am not easily offended, but I was strongly offended by this film. \"Delta Farce\" is poison. To call \"Delta Farce\" a film would be an insult to art of cinema."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "turdferguson1000",
        "review_rating": "10",
        "review_title": "TERRIBLE MOVIE, but absolutely HYSTERICAL",
        "review_detailed_main": "i admit, i enjoy dumb, kid humor. I still laugh every time i watch ace ventura. anyways, Delta Farce is the dumbest movie i have ever seen. I cannot think of more braindead characters then the three in Delta Farce. Having said that, I have not laughed that hard in years. Larry The Cable Guy is quite amusing to say the least. He is the typical redneck. he definitely had his moments in this movie. however, i thought that the skinny guy stole the show. the creepy stash is so appropriate. and Kilgore riding on that motorcycle is so funny. I am definitely going to add it to my collection when it comes out on DVD just in case i have a bad day and i need cheering up. go out and see it with an open mind, obviously its not going to win any Oscars, but it definitely does its job."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "MLDinTN",
        "review_rating": "6",
        "review_title": "what happens when 3 idiots get assigned to active military duty...",
        "review_detailed_main": "to find out, watch this movie. This movie was better than I expected it to be. It was actually quite funny. Larry, Bill, and Everett are 3 guys that work just 1 weekend a month in the reserves. But suddenly, they get called to active duty and assigned to Iraq. On the way there, the airplane drops a truck in which they just happen to be sleeping in. So, when they wake up, they think they are in Iraq but are actually in Mexico. Then they must save a town from bandits.\n\nSome of the things they do are funny. DJ Qualls plays Everett and he has some of the best scenes. He's so skinny and in this he is supposed to be this great wrestler. He also wears a sniper outfit that looks ridiculous and one of the other guys calls him a retarded Chewbacca. Funny. There is also their Sgt. Kilgore who fell out of the plane too. He is forced to sing karaoke by the bandits. The ring leader is named Carlos Santana so of course that brings more jokes. The towns people give them tacos to eat and they just can't believe they have tacos in Iraq. There were many other scenes that made me laugh, but you get the idea.\n\nFINAL VERDICT: A lot better than you would think. It's funnier than a lot of movies I've seen lately. Check it out."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "metallipowerman5000",
        "review_rating": "2",
        "review_title": "This movie was beyond bad....",
        "review_detailed_main": "First off, I LIKE Larry the Cable Guy(or whatever his real name is).\n\nI actually enjoyed the Health Inspector movie he did(or whatever exactly it was called)\n\nBut this movie SUCKED....flat out, NO WAY around it.....period.\n\nIm sorry, but if you actually found this movie funny, you have the sense of humor of a 5 year old.\n\nThe ONLY reason i gave this movie 2 Stars was because....first off because i don't think you can give a movie 0 Stars....maybe you can, maybe i didn't try hard enough. Second off, there was like 1 or 2 small quick scenes i thought were funny.....that's IT.\n\nDJ qualls or whatever his retarded name is, is a HORRIBLE, HORRIBLE actor. (i realize this guy is a survivor of some kind of illness, but this guy SHOULD NOT be acting....period.)\n\nbill engvall was an innocent victim in this movie....he's a very funny guy, it's a shame he agreed to sign onto this movie.....he probably did it purely because they couldn't find ANYONE dumb enough to sign on, so jeff did it just because he's a good friend.....whatever.\n\nKeith David is AWESOME, i love this guy, he was actually the only funny guy IN the movie.....too bad he got suckered into signing onto this movie too.\n\nThis is one of the few movies i've actually just STOPPED watching because it just sucked so bad, the plot was weaker than the rating I gave it. The movie goes nowhere, the comedy was SO DUMB, yet they try to pull the plot off as real for a comedy movie, yet bombs out miserably.\n\nTrust me, I WANTED to like this movie, I TRIED to find the humor in it, but it just wasn't there.\n\nI'm the type of guy that will give any movie a chance, I am not picky at all. I like over 90% of the movies I have seen in my lifetime.....I am not hard to entertain or please.\n\nThis movie was THAT BAD.....WOW words cannot describe it.\n\nI'm so glad I actually never bought it, otherwise I would have glued it to a piece of cardboard and literally used it at the local pistol range just to get out some aggression."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "matty_mushroom1983",
        "review_rating": "1",
        "review_title": "This is just sad, brah",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "michaelRokeefe",
        "review_rating": "3",
        "review_title": "Weapons of mass destruction or three morons?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "alicedick",
        "review_rating": "3",
        "review_title": "Oh, the pain.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "joejasso-70-399261",
        "review_rating": "1",
        "review_title": "When you decide your audience is no one",
        "review_detailed_main": "There are bad movies just as there are bad songs, books, poems, and people. Yet, there is a audience for each of those works or humans, someone who will enjoy or agree with them for some reason. Delta Farce accepted this challenge and created a film that no could like. And I mean at the level that a mother would not defend their child or a stripper won't laugh at your joke level of rejection. Our \"film\" manages to pair two southern comedians/actors who would bring with them a more conservative viewership to the party and proceeds to shove anti-Bush era/anti-Middle East conflict propaganda down their throats for what seemed to be an eighteen hour movie. Liberals, especially those overeducated pansies I always hear about, are not spared. The Farce is packed anti-woke jokes thanks to their racist Mexican caricatures and tasteless homosexual representations. Moreover, it is actually a remake of The Three Amigos, proving that we have regressed in our art as much as our values. Delta Farce is an example of how we sound when our unfiltered/unchallenged minds have a sounding board. Now you might think I am bashing on this film, but I am actually its champion. It is brilliant in that regardless of what defines you as a human being we all have one undeniable commonality, we hate Delta Farce."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "michael-1997",
        "review_rating": "7",
        "review_title": "Lack of intellectualism and culture does not mean it isn't funny.",
        "review_detailed_main": "OK so its a bit lame but a lot of it is very very funny. This could be because since I can remember the U.S. movie industry has continually used the southern accent to show that a character is as dumb as a bag of spanners or so backwards they belong in a different century. Take Smokey and the Bandit or Deliverance. However if you are not from the U.S. this accent is incredibly funny by association. Tie it altogether with the modern equivalent of the three stooges some stereo type( we don't need no stinking badgees) Mexicans and a guy in a dress and the British will love it for sure. Granted it is lame, but it is funny and that is what it sets out to do."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "pops-72834",
        "review_rating": "2",
        "review_title": "Color by numbers",
        "review_detailed_main": "Just another rubber stamp low quality movie. Saying its unfunny is redundant since it has Larry the Cable Guy; the most UNfunny 'comedian' ever, next to Flo from the Progressive commercials (seriously search her act out) All your standard gags, done poorly. All the Ernest movies just jumped up a notch or two."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "punkin_flats",
        "review_rating": "10",
        "review_title": "Almost identical to Wild Hogs plot! check comparisons",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "guyfromjerzee",
        "review_rating": "6",
        "review_title": "Only average",
        "review_detailed_main": "This is the kind of movie that's worth watching if you happen to catch it on cable on a Saturday afternoon. It's definitely not worth seeking out, though. Larry the Cable Guy himself enjoys bashing his first film, \"Larry the Cable Guy: Health Inspector,\" but you know what? I enjoyed that a lot more. It was a much better comedy vehicle for the talented comedian. In \"Delta Farce\" he's not given nearly as many opportunities to showcase his brand of humor. If anything, I think this is a better vehicle for his Blue Collar buddy, Bill Engvall, who is quite good in the film. The movie is far from awful, but it never made me roar with laughter. Most of the jokes are predictable. How many times have we seen the gag where an out-of-shape man is doing chin-ups, and it's later revealed that someone is lifting him over the bar? There are also many gags where we're forced to believe the characters have no intelligence at all. I know they aren't the sharpest knives in the drawer, but how could anyone possibly confuse Iraq with Mexico? Speaking of no intelligence D.J. Qualls (who was good in \"Road Trip\" and \"The New Guy\") is wasted in a crappy role as the dumbest of the three guys. Danny Trejo, who's given a bigger part than he normal, is also wasted. This is another one of those comedies where all the good jokes were given away in the previews. Even if you're a fan of Larry, like me, you'll probably be disappointed by the film."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "rockorbe2002",
        "review_rating": "2",
        "review_title": "The only farce was that this comedy doesn't have comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "KineticSeoul",
        "review_rating": "2",
        "review_title": "Just scratch the first word in this film's title, because that is basically what this movie is",
        "review_detailed_main": "If you seen the trailer to this film, you basically seen the whole movie or at least the only good parts of it which wasn't even that good to be honest. I ain't even going to type a synopsis for this film cause all you really need to do is see the trailer. The blue collar Larry the cable guy isn't funny and just tries to make the audience laugh by making himself look stupid with his retarded squad. This really isn't worthy checking out even for comedy fans, the reason I give this film a 2 is cause I seen worse but that ain't saying much. To be honest I don't give a crap if a movie is offensive sometimes as long as it is funny, but this movie isn't funny and it just shows why other countries hate America. I didn't get a single chuckle out of this film and I don't see how anyone can find this film to be funny, except maybe rednecks, but I doubt they even they find this movie to be very funny. Just do yourself a favor and just go watch \"Three Amigos\" or \"Tropic Thunder\".\n\n2/10"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "Watchable, albeit generic and forgettable comedy...",
        "review_detailed_main": "I sat down in 2021 to watch the 2007 comedy \"Delta Farce\" for the first time. I happened to come across the movie by random luck. And never having heard about the movie, I opted to sit down and give it a chance.\n\nAnd while \"Delta Farce\" is watchable, this was hardly a grand cinematic moment in comedy history. The movie was just too generic, I suppose.\n\nThe storyline told in \"Delta Farce\", as written by Bear Aderhold and Tom Sullivan, was pretty straight forward, sure. But at the same time, the storyline was just not one that was overly crammed with comedy elements. So for a comedy then \"Delta Farce\" felt a little bit tame.\n\nPersonally I got no particular interest in Larry the Cable Guy, neither as an actor or a comedian, so I didn't sit down to watch \"Delta Farce\" because he starred in it. The movie does have some good enough names on the cast list, with the likes of Keith David, Emilio Rivera, Danny Trejo and DJ Qualls. The movie even had comedy Jeff Dunham in it, which was definitely a blast to watch. It was, in fact, Keith David and Danny Trejo that made the movie watchable, and they weren't even in the lead roles.\n\n\"Delta Farce\" has the occasional laugh here and there, but for a comedy it was a bit bland. I had hoped for a bit more contents that would make me laugh, truth be told.\n\nWhile \"Delta Farce\" is watchable, it is hardly a movie that I will ever return to watch a second time.\n\nMy rating of director C. B. Harding's 2007 comedy lands on a less than mediocre four out of ten stars."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "bigham69",
        "review_rating": "7",
        "review_title": "So bad, it's good!",
        "review_detailed_main": "I saw this movie first when I was 13. Now being 24 I see why I enjoyed it so much. It's just good ole dumb fun. If you're a serious film fanatic like me hopefully you could enjoy something so silly every now and then. It's a perfect 90min laugh. The characters are just as dumb as the story. It reminds me of \"In the Army now\" with Pauly Shore yet this one has a better story and characters. Now Don't go into this thinking it's a top 10 comedy cause it's not, but maybe top 500. Give it a watch. It's a decent laugh if you don't take it so seriously."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "django-1",
        "review_rating": "8",
        "review_title": "fans of lowbrow Stooges/Bowery Boys style slapstick, rejoice; all others avoid",
        "review_detailed_main": "I enjoyed Larry The Cable Guy's previous film, HEALTH INSPECTOR. It was a perfect example of lowbrow physical comedy that should have appealed to the Three Stooges and Bowery Boys fans out there. It used time-tested formulas dating back to silent comedy (check my reviews of obscure silent and early-sound comedy shorts and you'll see I love that tradition), and while they are simple-minded and obvious, they still work when in the hands of a comic master. For me, Larry the Cable Guy is in the Larry Fine/Leo Gorcey/Jerry Lewis vein, and also somewhat like the comedic sidekicks in old westerns. This new film is not as much of a gross-out vehicle as the Health Inspector. Bill Engvall is very much a straight man to Larry, while DJ Qualls is like a psycho version of Don Knotts/Barney Fife. These three are a great slapstick misfit trio, if crude obvious physical comedy is what you like. I presume anyone reading this already knows the plot--three loser guys are sent to Iraq to fight and mistakenly get dropped off in Mexico. Like any plot for a slapstick comedy, it's merely a device to hang routines on, and I found the routines to be quite funny. The writing is full of jokes and all three guys are great physical comedians. It's also nice to see screen heavies like Keith David and Danny Trejo in comic roles, David as the Sergeant who is leading the boys, Trejo as a weird bandit leader. Larry's stand-up routines are VERY different from this film. Don't see this film unless you liked Health Inspector. Or unless you want to see someone working the old Three Stooges/Bowery Boys type routines. My teenage daughter and I laughed quite often and found the film more than worth the money. By the way, the outtakes at the end of the film are interesting in that they show scenes that did not make the final cut. I hope those scenes will be included on the DVD. I anxiously await Larry's next vehicle, WITLESS PROTECTION."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "StevePulaski",
        "review_rating": "6",
        "review_title": "Knowledge is Useless in The World We are About to Enter",
        "review_detailed_main": "Another movie to poke fun at the concepts and seriousness of war. \"Delta Farce\" is a Blue Collar Comedy movie about the war in Iraq, but actually being set in Mexico. You'll see what I mean in a minute.\n\nThe film stars two of the Blu Collar Comedy actors, Larry the Cable Guy and Bill Engvall playing Larry and Bill, and a non member of the group, DJ Qualls who plays Everett Shackleford. The three men take a trip to an army base because they are National Guard members. When a request for more soldiers comes in, the three men are deployed to Iraq unexpectedly.\n\nAfter sleeping in the truck in the airplane and being dropped into Mexico, the clueless duo believe they are in Iraq and basically act as if they know what they are doing, when really, they are just as clueless as you would think. Señorita Maria Garcia (Marisol Nichols) falls for Larry after they protect their town from invaders or terrorists. Larry is determined to continue the job in Mexico until Carlos Santana (Danny Trejo) the dictator is with thrown.\n\nThis movie is full of slapstick and fart jokes throughout. Some of witch can be mildly entertaining, others are just silly and over used portions. In the first twenty minutes of the film I thought I would like it, but it just lost my attention more and more. The only actress that entertained me was Marisol Nichols. With her being one of my favorite actresses, her performance wasn't really that bad, but sadly to say nothing great. \"Delta Farce\" is a Comedy hated by most, loved by few, and respected by no one with good taste. Though I have to say there were pretty many movies I couldn't stand that I have seen this year. So this one is passable.\n\nStarring: Bill Engvall, Larry the Cable Guy, DJ Qualls, Marisol Nichols, and Danny Trejo. Directed by: C. B. Harding."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "epalejandrocarrillo",
        "review_rating": "6",
        "review_title": "Give me a minute and I'll explain.",
        "review_detailed_main": "1. Yes it's a 'check your brain at the door ' funny 2. If you like three amigos or tropic thunder give it another chance you might actually have fun."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "abitrowdy",
        "review_rating": "10",
        "review_title": "Much better than I expected",
        "review_detailed_main": "This is a very well done movie and deserves a much higher IMDb rating, if you like comedy for the common man. On the other hand, if you use \"red neck\" as an insult, then you should avoid watching movies like this to begin with. Why anyone would go into a movie with Larry the Cable Guy thinking they are going to see a sophisticated Shakespearian play is way stupider than those who enjoy this kind of humor. Larry The Cable Guy, Bill Engvall, and D.J. Qualls are excellent in the 3 Stooges style of slapstick idiocy. While it also gave Keith David and Danny Trejo the opportunity to show they are wonderful with comedy. People who complain should at least be honest. Just because you don't \"get\" this style of humor does not entitle you to pan it as poorly done. The jokes are funny and the acting was right where it should have been for a farce. Next time, pay attention to who is in a movie and its title before you subject yourself to all the angst you suffered for watching a very funny, if lowbrow, comedy."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "GeorgiaDixie",
        "review_rating": "7",
        "review_title": "It's funny, why don't y'all give it a break?!",
        "review_detailed_main": "Now, I bought this movie for a dollar at Goodwill, so I wasn't expecting much, but it turned out to be pretty funny. Sure, it's not smart or examining any deep issues, but it's not supposed to: it's supposed to make you laugh! And that is exactly what it did. I usually get really annoyed when I see serious movies with obvious military inaccuracies, but when it's almost pure comedy, I really don't care.\n\nStripes is lauded as a great movie, but it's plot was even dumber and it actually tried to be serious in some parts and it had far more military inaccuracies. Plus, I think Delta Farce is much funnier! So just why doesn't everybody just enjoy the movie for what is and have some laughs.\n\nP.S. The saving of the town while blaring \"Eastbound and Down\" (my favorite song ever, by the way) from Smokey and the Bandit is just awesome. I sometimes pull out the movie just to watch that one scene!"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "MrDevgel",
        "review_rating": "7",
        "review_title": "Surprisingly decent.",
        "review_detailed_main": "If you're looking for a proper plot or any sort of depth, you won't find it here. This 'film' is more like a really long comedy sketch, if that makes any sort of sense, as I don't know how else to describe Delta Farce.\n\nAs a non-American, I'm not wholly familiar with the main cast, the sole exception being Keith David (Sgt. Kilgore), who voiced David Anderson in the popular RPG, Mass Effect. I merely recognized him by his iconic voice, so it was a nice surprise, considering I'm a huge Mass Effect fan.\n\nOverall, the plot is weak, the ending was rushed, and even the climax was poor at best. But the film has more than a few good laughs and is better than most comedies Hollywood is churning out today which have lost their edge, just for the sake of political correctness."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "hacks-56635",
        "review_rating": "8",
        "review_title": "A masterpiece of hilarity and ridicule!",
        "review_detailed_main": "I mean, when ya realize where these clowns are, where they think they are, and what they are up too, how can you not laugh out loud... Such determination in the face of blatant insanity. And the angry Sargent! perfect performance...\n\nI really don't understand why people are insulted and it is rated so low. I rate things in context, for what they are. A dog is rated as a dog, a cat as a cat, a donkey as a donkey. For a light, funny, intentionally self-deprecating humor of the ridiculous type, this thing hits the nail right on the head!"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "benoit-3",
        "review_rating": "10",
        "review_title": "Finally, a perceptive comedy about US involvement in Iraq",
        "review_detailed_main": "It isn't a masterpiece but it made me laugh in places. The humour is mostly low-brow and working class (a.k.a. redneck), the situations, characters and the music are all generic but the stars are excellent at what they do. As usual when I see an American comedy that is rated so low, I look for reasons other than the film's \"intrinsic quality\". In this case, it is pretty evident that what turned a lot of Americans off is that the film, while being respectful of military personnel, uses its sly humour to make fun of the US' supposed military objectives in Iraq and its moral is a timely reminder that if it's freedom and democracy you're supposed to be fighting for, there is a lot more work to be done close to home than in a country most Americans can't find on a map. 10 stars."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "alexmomb",
        "review_rating": "10",
        "review_title": "A Movie to enjoy and not Think pure Entertainment",
        "review_detailed_main": "I walked in late at the drop scene.I was the only person in the Theater.I guess these type of Movies don't appeal to Woodinville, Washington people?I was howling at times,the scene of the Big Sgt. riding a motor scooter in the middle of the desert in a red Nightie was worth the admission price.The skinny guy was one of the funniest characters I've ever seen in the movies.Danny Trejo was perfect as usual.It was a cross between \"The Magnificent Seven meets Deliverence\".This is a Movie where you get the guys together,have a few beers, and enjoy.No thinking allowed.They had a guy who looked like a Mexican \"Dom Delouise\" who was perfect,I don't think he even had a line in the movie other than singing a duet with the Sgt."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "hchais",
        "review_rating": "10",
        "review_title": "I don't care what people say. This movie was funny!",
        "review_detailed_main": "This movie was funnier than I thought it would be. I love Larry the Cable Guy and I thought that he was funny in this. This movie had a funny cast of Larry the Cable Guy, Bill Engvall, DJ Qualls, Keith David, and Danny Trejo. Delta Farce had nonstop laughs for me because I love Larry the Cable Guy. I thought that this movie would be stupid. It was stupid, but it was also incredibly funny. It had all kinds of jokes from red neck jokes to racist jokes. Danny Trejo was very funny as Carlos Santana. Yes. Carlos Santana, but not the singer. I loved this movie and it definitely deserves more credit than it got. I thought that this was a great movie. 10/10."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "JohnnyMcCaffery",
        "review_rating": "9",
        "review_title": "Delta farce = Excellent",
        "review_detailed_main": "After reading other peoples comments and seeing the review score i was shocked, i can't believe how low that the score it.\n\nI think that this film is awesome, well thought out. Putting three dumb people in the army and sending them to Iraq but ending up in Mexico, while the three dumb people think that they are in Iraq. One of the best films i have seen. I have watched it 1000000 times, and I'm going to watch it now that will make it 1000001.\n\nI love the humor the actors and everything about the movie. They couldn't of made it any better. I hope that they make another one like this.\n\nI cant see how other people could not of liked it, but i guess that people have their opinions."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "roythedog",
        "review_rating": "10",
        "review_title": "I'm shocked",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "jennileest",
        "review_rating": "8",
        "review_title": "Delta Farce",
        "review_detailed_main": "This movie was so funny! I really liked it because one thing after another just kept happening, and one thing led right into another! They thought they were in Iraq when they were really in New Mexico. This movie was so funny with Larry The Cable Guy, and I think that the plot is great. I think if you are looking for a funny movie to watch with the family on a rainy night, than this movie is the right one! Anyone who loves Larry The Cable guy should watch this movie! If you thought Larry the Cable Guy: Health Inspector was funny, this movie is even funnier! This movie is a must see! If you want to really get a good laugh then you should watch this movie because it is full of laughs!"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "rrrriiiicccckkkk13",
        "review_rating": "10",
        "review_title": "Cinematic Mastery",
        "review_detailed_main": "Yes, I will place this film on a pedestal so high that movies like The Godfather, Citizen Kane and Gone With The Wind will suffer nosebleeds when gazing upward at it.\n\nLarry The Cable Guy's name should be engraved upon every best-actor Oscar given from now until the end of time.\n\nDJ Qualls should be the next Terminator should that movie line ever be expanded on. His action sequences were simply breathtaking-a true man amongst men.\n\nTo list this movie as (only) action/comedy is a travesty as the romance and drama were so genuine that I was forced to reflect upon my life decisions once the final credits rolled.\n\nI highly recommend this movie to any and all who are sick of the trash Hollywood has been churning for the past few decades (Titanic, Lord Of The Rings trilogy etc..). Treat yourself today."
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "pmtelefon",
        "review_rating": "9",
        "review_title": "Laugh-out-loud funny",
        "review_detailed_main": "Who would have guessed that Larry the Cable Guy would star in one of the funniest movies that I have ever seen. There are big laughs throughout \"Delta Farce\". I seen this movie a few times and I still laugh-out-loud when I watch it. The cast is really good. They all get their time to shine and they all deliver big laughs. Larry the Cable Guy is funny but Bill Engvall and Keith David are even funnier. David is fearless in this movie. Nobody believes my when I say it but \"Delta Farce\" is a great movie. (Now I need to ramble on a little bit because of IMDB's 600 character minimum. So, how was your day?)"
    },
    {
        "movie_id": "tt0800003",
        "movie_name": "Delta Farce",
        "movie_rating": "3.7",
        "review_username": "David_Brown",
        "review_rating": "",
        "review_title": "Totally Awful",
        "review_detailed_main": ""
    }
]