[
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "namashi_1",
        "review_rating": "9",
        "review_title": "An Immotral Film!",
        "review_detailed_main": "'DDLJ' is An Immortal Film! It's among those \"FINE\" films, that remain perfect forever. It's among those gems, that can never go dated. Be it the direction, the screenplay, the songs, the performances, the cinematography...everything just gets better!\n\n'DDLJ' Synopsis: A young man and woman - both of Indian-descent, but born and raised in England - fall in love during a trip to Switzerland. However, the girl's traditional father takes her back to India to fulfill a betrothal promise.\n\n'DDLJ', even if not so hugely successful, it still would have gained a cult-following. Aditya Chopra's Screenplay is engaging, moving & most importantly entertaining. The Love-Story works big time, so do the characters & the situations. Cinematography by Manmohan Singh is picture perfect. Editing is smooth. Chopra's direction is sensitive. Music by Jatin-Lalit, is fabulous.\n\nShahrukh's performance as Raj, became a rage & catapulted him into Superstardom. He is lovable as Raj. Kajol as Simran, is fantastic, as always. The Chemistry between Shahrukh & Kajol, is infectious. Amrish Puri, however, steals the show as the traditional Indian father. The late legend delivers an incredible performance, that truly leaves you in awe of him. Farida Jalal is first-rate. Anupam Kher is great. Parmeet Sethi plays the bad-guy well. Satish Shah is decent, while Mandira Bedi is passable. Others are perfect.\n\nOn the whole, 'DDLJ' is one of THE Finest films to come out of Hindi Cinema. It's The Mughal-e-Azam of the 1990's!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Peter_Young",
        "review_rating": "9",
        "review_title": "The beauty of mainstream Hindi cinema",
        "review_detailed_main": "Aditya Chopra's Dilwale Dulhania Le Jayenge is a superb example of the genius of Hindi commercial cinema. If you see it, you'll get that it's not very different as a love story. It is even ordinary. But it becomes special for many reasons. First and foremost, for its fresh, naive spirit. Secondly, the many paradoxes it contains: it is powerful yet subtle, larger-than-life yet simple, funny yet sad, magical yet realistic, and so on. Thirdly, it is one of the first films portraying Indians who live outside their country (in this case, London). It also shows the yearning of the first-generation NRIs who live far away from their homeland and for many reasons find it difficult to come back. Yet, the film remains mainly a poignant, melancholic romance.\n\nRaj and Simran, the characters played by Shahrukh Khan and Kajol represent the last generation of youngsters who were innocent and naive. They were much more simple, respectful and full of life. Such people almost no longer exist nowadays. The film relates their love story in a rather mesmerising way. Every scene is important. There are many great moments in the film. Raj and Simran's entire acquaintance and interaction in the first half is charming. Their separation at the end of the first half, when both make each other understand of their true feelings without explicitly admitting it, is moving. The traditional wedding preparations in the second half are well-made; the values they show, Raj's attempts to conquer Simran's father, and the couple's deepening relationship are interesting. The only thing I regretted was the typical fight scene towards the end.\n\nShahrukh Khan and Kajol, who undoubtedly form a great film couple, are both excellent in their roles. They act from the heart, and ably bring their characters to life. Shahrukh Khan is incredible as Raj, a modern guy who understands the value of family and marriage, and yet he has the look of a careless fool who does not take anything seriously. Khan acts with great ease, wit and humour, and his inner fear of losing his beloved is always understood. Kajol as the dreamy and poetic yet intransigent and smart Simran is exceptional, and she looks very hot throughout. Amrish Puri and Farida Jalal as Simran's parents provide great support. Amrish Puri is particularly impressive as the strict but soft-hearted father, and Jalal is touching as the woman who has lived life according to terms and does not want the same to happen to her daughter. Anupam Kher is funny and entertaining as Raj's father.\n\nThe film's soundtrack is outstanding and is clearly one of the main reasons this film works so well and is unforgettable today. The music is very well identified with the film and its story. Just try to imagine you would be given to watch the movie with the songs edited out. You wouldn't want to, right? That's because every song is a gem and is as important as every other scene. Every song comes in the right place and is sung and pictured exceptionally well. The one closest to my heart is \"Ho Gaya Hai Tujhko\", for its beautiful melody and very melancholic feel, which is aided by its blend of fantasy and reality on-screen. It is performed to perfection by Lata Mangeshkar and Udit Narayan. DDLJ is a film that should not be missed by anyone. It is one of the great gifts of Yash Chopra and his banner. It is a milestone of Indian cinema for its ability to inject fresh and magical energies into a banal love story, and for making it classically memorable."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "T-27",
        "review_rating": "9",
        "review_title": "Very good romantic comedy",
        "review_detailed_main": "I usually go for Bollywood films for the music-dance numbers. While this flick has a few good ones, I was mostly pleased with the plot. I liked the second half the best. I was very disappointed to learn from IMDb that this is the second of only two films done by Pooja Rupanel. She brought a lot of life and spark to a minor role - the female lead's younger sister. She should have done more films. Like any really good comedy, the story had its serious aspects - just enough to make the plot interesting. The stand=by Bollywood love triangle plot can be used as many times as one wishes as long as one has good actors, terrific musical numbers, and a few novel plot twists."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "editorbob",
        "review_rating": "10",
        "review_title": "Like every movie of its kind, and yet like nothing I've ever seen",
        "review_detailed_main": "Dilwale made me glad to be a Westerner, just so I could experience the sheer rush in the glorious way this film simply throws its Indian sensibility in your face. It is one of the most completely, openly joyful films I have ever seen. In many ways a totally Western film, it is yet completely un-Western, and absolutely invigorating.\n\nI found the (rather oddly looped in places) mix of Hindi and English dialog to be a lot of fun to follow (as incomplete as the subtitles sometimes seemed). The Indian/Western pop structure of the songs was entertaining and infectious. The choreography is simply amazing, and some of the most sheerly athletic I've seen. The Indian roots of the dance routines were at first almost unnerving--at once familiar yet bizarre, almost surreal (to my Western eyes). It was sheer fun making the cultural adjustment.\n\nThe plot is predictable, almost pedestrian--certainly not what you'd call \"never done before,\" and yet I found myself completely absorbed in the story, and rooting for the main characters. This is in large part due to Shahrukh Khan's and Kajol's performances as Raj and Simran. He is totally endearing, and she is totally hot!, and their on screen chemistry is as cute & perky and smoldering & steamy as Fred and Ginger at their peak. It was, simply put, fun to watch them having so much fun.\n\nDirector Aditya Chopra was, I understand, only 24 when he made Dilwale, and the film was so successful its Indian first run lasted a world-record 11 years (and may still be going on, as far as I know). A heckuva testimony to Bollywood indeed. This movie has instantly become one of my favorite musicals, and I look forward to finding more films from Chopra, Khan, and Kajol. What a treat!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ChiBron",
        "review_rating": "10",
        "review_title": "Srk-Kajol's chemistry at its best.",
        "review_detailed_main": "Srk-Kajol have worked in a lot of blockbusters together(Baazigar, Karan Arjun, KKHH, K3G) but DDLJ will always be recognized as their best to date. Debutant director Aditya Chopra so perfectly brings these two together at the back-drop of a realistic family setting that its hard not to fall in love with them. Its chemistry at its finest. For Srk it was his first \"Raj\" character(play-girl type guy with the right values and morals) which he plays to perfection. For Kajol, DDLJ was a career making movie. As Simran she's beautiful, sweet, sensitive and a bit stuck-up too. Thank god Madhuri didn't have the dates to work in DDLJ cuz no actress suits Srk better then Kajol. There are countless heart-warming scenes between em' in DDLJ. Each one of them is uniquely different and just as much fun to watch. The entire setting of DDLJ is very simplistic, which brings out that special \"oomph\" in their romance. The songs are first-class. The strong supporting cast of Amrish Puri, Farida Jalal, Anupam Kher and Satish Shah definitely helped the movie to become the classic as its now seen as.\n\nBottomline: DDLJ is 'romantic comedy' with Indian emotions at its peak. From the cast, chemistry, music, direction and the awesome pairing of Srk-Kajol....its perfect!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Calliegrl03",
        "review_rating": "10",
        "review_title": "God, I love this movie.",
        "review_detailed_main": "I recently took a class about India in college and towards the end of the semester, we watched a few clips from some Bollywood and Tamil movies. I was very moved and inspired by the clips alone! Then, I told my friend (who happens to be Indian) from my work study job that I like Bollywood. So she invited me to an \"Indian Movie Night\" at her dorm. We watched K3G and I was so touched by it! It was simply wonderful. Most of all, I became a SRK and Kajol fan. Their on-screen chemistry is remarkable! I can't explain it! Anyhoo, I asked my mom for some Bollywood movies for Christmas and one of the movies I got was DDLJ. And let me tell ya'll, it is now my favorite movie of all time. SRK and Kajol shine beyond reason in this flick. The script is excellent, everything is excellent especially the acting and memorable songs! The supporting cast (most notably Simran parents, sister and Raj's dad were figging awesome!) Mr. Amish (sic) Puri, who played Kajol's dad acts wonderfully with just his eyes! One of the funniest lines in the movie is when Raj's friend walks into Simran's dad store and says \"Uncle, can I have some beer?!\" Gosh, it's the way that cat said the line that made it so FUNNY! After watching it again yesterday, I realized that I love so many Hollywood movies (particularly classic ones) and yet I couldn't state my all time favorite one. But while watching the making of DDLJ (I own the special edition version with two DVD's inside), I became rather teary eyed. I mean, I'm getting teary eyed writing this review at this moment! This film touched not only my heart, but my soul as well. They are so many underlying messages in DDLJ that can strike a cord in a non-Indian's (like me, I'm Nigerian American) soul. In end, I hope people who read this will buy DDLJ, (Renting will be useless, because you'll want to watch it over and over again...) love this priceless gem of a movie, and this goes out to the girls, wanna \"come...fall in love\" with a cool, crazy, sexy guy like Raj!\n\nPS- THIS IS THE GREATEST MOVIE OF ALL TIME!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "anant_mathur",
        "review_rating": "10",
        "review_title": "Come fall in love...with a Classic!!!",
        "review_detailed_main": "Probably one of the greatest love stories ever told. Director Aditya Chopra made his debut as a director with this film. Aditya is the son of legendary Director/Producer Yash Chopra who gave us films like Deewar, Darr, Waqt, Kabhie Kabhie, Dil To Pagal Hai and Veer-Zaara.\n\nAditya was one the first Directors of the New Generation of the Indian film Directors. With his first film he got rave reviews and was immediately classified as one of the best directors in Indian Cinema. With DDLJ, Aditya showed us what falling in love, respect, and family values are all about. This film also confirmed the Pair of Shah Rukh Khan and Kajol as one of the best in the Indian Cinema. It made Kajol and Shah Rukh superstars over night and two of the most sought after actors.\n\nDDLJ also started the trend of love stories in Indian Cinema. Before DDLJ, most Indian films were action films. But DDLJ changed all that and the way of war was changed to a way of love. It's incredible how this film changed the Indian Cinema and the way of making films. DDLJ is a Forever Classic.\n\nIt recently set a new record for the longest running film when it crossed the 500th week mark (that means it's a 10 time golden jubilee), the previous record was 275 weeks and was held by SHOLAY (another forever classic). All I can say is you must watch this movie, because \"After Raj met Simran, love wasn't the same...come fall in love all over again\"."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Riazshiekh",
        "review_rating": "10",
        "review_title": "\"...Fascinating...\"",
        "review_detailed_main": "If you missed this movie than you have missed the best movie made in bollywood history.This movie never seems to bore you.I have saw over a hundred times(Really).It's a fascinating movie.The plot was wonderful.The acting was really award winning.Shahrukh Khan is a gem of an actor.Really incredible acting by him.Kajol was excellent.The songs were awesome!The music was wow.The direction was cool.A must see for those who adore romantic flicks."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "shaheena_ali",
        "review_rating": "10",
        "review_title": "Best Romantic Bollywood movie ever!!!!!",
        "review_detailed_main": "DDLJ has been my all time favourite movie. its a wonderful love story about the second generation Asian youths! Raj the main character played by Shahrukh khan gives a superb performance and equally good as Simran (co-star) played by Kajol!! Its about a girl living in London, who's marriage has been arranged by her father to marry his best friend's son. She accepts her fate until she meets Raj in Europe and falls in love. The movie has won many awards including National Award(in India)for best story. The songs in the movie are also worth listening to, composed by Jatin Lalit which are melodious and romantic. Overall the movie is definitely 10/10, no doubt!!!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "omarhussaini",
        "review_rating": "",
        "review_title": "Dilwale Dulhania Le Jayenge: A Commentary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "asuph",
        "review_rating": "6",
        "review_title": "Most overrated Bollywood movie ever?",
        "review_detailed_main": "For the life of me I cannot figure out the iconic status that this movie enjoys. Sure, first half of the movie has the chemistry that Indian film crowds so love, but the second half is such an idiotic morality drama, that I marvel that Aditya Chopra got away with it. I guess this has got to do a lot with the first half in which people have been hooked to romance. A romantic mind will gobble anything ;-).\n\nThis is not a great movie. This is barely a good movie. And it's regressive. It's so bloody regressive that it makes me puke. Worse: the regressive theme and it's popularity has made critics also treat it with kid gloves. The passed time is just working more and more in its favor.\n\nThis is the movie for NRI crowd. And it's quite stupid, I'm afraid."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "10",
        "review_title": "The Best",
        "review_detailed_main": "I watched it when I was a kid. At that time, Indian movies were very famous in Azerbaijan. This movie is the best among Indian movies. It's romantic, comedy, good musical and never gets old."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "wajeehkhan01",
        "review_rating": "6",
        "review_title": "One of the most overrated films of Indian cinema",
        "review_detailed_main": "I don't even know how the hell this film has been deemed a classic. It is cheesy to the core. The \"acting\" by Shah Rukh Khan is really bad, and honestly, I didn't really see anything special in his acting. I know he has the potential very now and then, but I really wouldn't consider this one of his finest. All I really noticed was an annoying laugh that kind of sounds like a goat. Kajol did okay, I think she did the best in the film though out of all the actors. And another thing I don't understand is how do people think this is a good film? I mean, SRK is a troublemaker who goes around causing mischief, and he falls in love with a serious girl (Kajol). Kajol literally lies to her parents, because she said that if she goes on her trip, she'll marry who her parents choose. During this trip she lets SRK do many awkward things to her and then they fall in love and then SRK crashes her wedding, and then Kajol totally forgets about her promise and all that crap. I mean, in one scene SRK literally undresses her while she's unconscious and then changes her clothes! That is messed up. And last, there is so much cheesy dialogue, and the story is filled with clichés. Anyways, the only thing I liked was the music. The soundtrack of this movie was excellent however. I only recommend this \"classic\" to people who are overly romantic. Overall I rate this film a 5.5ish out of 10. I really don't consider this a classic, I think it is overrated."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sumit_excel",
        "review_rating": "4",
        "review_title": "Beats 'Romeo and Juliet' in stupidity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "jENNA007",
        "review_rating": "",
        "review_title": "What an awesome movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "tiger900",
        "review_rating": "10",
        "review_title": "A Classic",
        "review_detailed_main": "Going to the theatre to watch this movie was supposed to be my 'punishment' (for doing what, I can't remember), but let me tell you, this was the best punishment of my life.\n\nThis movie was fantastic! I found it groundbreaking in that it solidly addressed the doublestandards and idiocy that tend to pervade in the minds of a lot of Indian parents. It was definitely an anti-arranged marriage film, which was a plus.\n\nI still watch this movie from time to time, and I have to tell you I thoroughly enjoy it, every time. The songs are great, the actors are great, and the dialogue is pleasing.\n\nA timeless classic, that will probably never be repeated.\n\n10/10"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "paulsmithson-192-243826",
        "review_rating": "9",
        "review_title": "Still excellent after 20 years",
        "review_detailed_main": "Bollywood has changed a lot over the last two decades. Production values have increased dramatically and that cheesiness that was so typical of old Bollywood films has been toned down somewhat and replaced by a professionalism that is often on a par with Hollywood. So how does this 20 year old film stack-up?\n\nIn short, it is brilliant. Yes, it is has a certain kitschness. It has musical interludes that are so cheesy you almost want to laugh, and some of the acting is pretty questionable. But at the same time there's something sublime about the film. Somehow, the kitschness, the cheesiness and the low-budget production seems to have come together to create a work of art that will live on for decades to come.\n\nRaj and Simran, the male and female leads, are endearing. The support cast are very good. The story line, whilst at times being predictable, also has some clever little twists and turns, and by the end of it you feel like you've watched a movie that will stay with you for many years to come, which I guess answers why Dilwale Dulhania Le Jayenge has such enduring popularity.\n\nIs it perfect? Definitely not. Is it worth watching? If you enjoy a little light-hearted, Bollywood romantic-comedy then that would be a definite yes."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "HeadleyLamarr",
        "review_rating": "10",
        "review_title": "A timeless classic!",
        "review_detailed_main": "Dilwale Dulhaniya Le Jayenge represented the cosmic confluence of a lot of young talent that came together fortuitously. A 24 year old director cast a 29 year old rising actor and a 21 year old actress of some note in a film that represented the lives of innumerable Indians who had left the homeland and gone off to foreign shores. The film did not just show them in their foreign milieu but looked into their hearts, minds, morals and then also showed them back in the homeland. In a sense it integrated the reality of NRI life with the reality of life in India. The picture was an idealized one and showed that among the affluent as well as the middle class while the outer trappings were very modern the mentality was very traditional.\n\nRaj Malhotra (Shahrukh Khan) is the only son of a rich business man (Anupam Kher) and seems a wastrel type of fellow, but scratch below the surface and he is a true blue \"Hindustani\"! Simran (Kajol) is one of two daughters of Chaudhary Baldev Singh, dresses in Western garb but again is a true blue traditional girl. On a tour of Europe the two meet and fall in love, but Simran has been engaged since childhood to the son of Baldev Singh's friend in India. She obeys her father and is taken back to India for the wedding. Raj follows on her heels. But Raj will not do the hackneyed thing of eloping with her - he has his own unique style and tries to win her by winning the hearts and minds of her family. The very traditional nature of the story resonated with the older generation among Indians and NRIs alike, while breaking from the tradition of eloping, and the charm and charisma of the protagonists appealed to the younger set. This made the movie into a huge blockbuster and one of the longest running films in Hindi cinema. In addition it made the careers of Shahrukh Khan, Kajol and Aditya Chopra.\n\nI like this film for its freshness and feel good feel, it never ceases to yank me out of the doldrums. It did set a bad trend in cinema because on its heels followed countless films with similar locales, characters, story lines. But isn't imitation the best form of flattery? The acting by the lead pair is amazing. Raj will charm a bird out of a tree, and Simran is the dream of every young man. Both SRK and Kajol did complete justice to these extremely well written roles and deserve all the kudos they got! Some moments of note - Raj grabbing beer from the store, telling Simran what kind of girl he is looking for, exchanging photos is Europe, on the bridge telling Simran he has fallen in love with her, telling his father that Simran is engaged to be married - in fact all but the last 15 minutes are excellently acted. Kajol telling her mother about the man of her dreams, hating Raj in Europe, telling him she she is engaged to be married, interacting with her mother upon her return from Europe - Kajol too hit the right note in each and every minute of the film except the last 15 minutes! Others are competent, Farida Jalal is of note as the mother and Anupam Kher as the father.\n\nThe music is outstanding, every song is a gem. Of particular note is the picturization of Na Jaane mere dil ko - the blend of fantasy and reality was a first and has often been copied since then. The song Tujhe Dekha to is outstanding and Mehndi Laga ke Rakhna is a perennial favorite. But I personally love the cheeky Ruk Jaa o Dil Deewane.\n\nThe movie does have some hackneyed moments - the last 15 minutes leave much to be desired, not in the ending itself but how every one got to that point. Amrish Puri is OTT at times as the angry father, but you can take all of this as there is so much that pleases so much!\n\nThis is a film that truly deserves the label of Evergreen - it is ever fresh and ever pleasing."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sauravjoshi85",
        "review_rating": "10",
        "review_title": "an Epitome for all the romantic movies in India",
        "review_detailed_main": "Dilwale Dulhania Le Jayenge is a musical romance film, directed by Aditya Chopra and stars Shah Rukh Khan, Kajol, Late Amrish Puri, Farida Jalal, Anupam Kher, Parmeet Sethi Satish Shah, Late Achala Sachdev, Mandira Bedi, Himani Shivpuri and Pooja Ruparel.\n\nThe longest ever running movie in the history of Indian Cinema is been considered an epitome in the genre of romantic movies. The movie is almost a flawless movie with mesmerizing music and promotes the family values and Indian culture with perfection.\n\nIn my opinion i am not in a position to judge or review the milestone movie of Indian cinema which has a stellar and impressive star cast, melodious and mesmerizing music and an engaging screenplay, iconic dialogues and unforgettable climax with Bauji letting Simran go to Raj the love of her life.\n\nThere could be few disconnect with the movie in regard to current generations and they might feel the movie little more over melodramatic or little exaggerated but to understand and enjoy the grandeur of the movie or the magnificence of the movie you have to watch the movie with the perspective of the generation who were born in late 70s and 80s who were in their 20s and few of them in their teenage and i am sure you'll understand the stature of the movie.\n\nA must watch for all the romantic music lovers and a must watch for all the true Indian movie lover or follower."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Rahul",
        "review_rating": "10",
        "review_title": "THE 1990's definition of the class Hindi film.",
        "review_detailed_main": "If you are reading this review to see if the film is worth seeing, where have you been hiding for the last few years?\n\nThis film is brought from the stables of Yash Chopra. As you may have guessed it is a 3 way story. Raj (Shahrukh Khan) is a modern Indian guy living in London with his father, played by Anupam Kher. He decides to go on a Eurorail holiday with a couple of his friends and easily gets his rich father's approval. Simran (Kajol) also lives in London but is of much more traditional upbringing, in part due to her strict father (Amrish Puri). Her father starts to reckon that it is time for her to get married. She has no option but to agree. However, she asks her father for the chance to see Europe once with her friends and Amrish Puri is not keen on this at all. Much persuasion follows and reluctantly he agrees.\n\nAs luck would have it, Raj and Simran and both of their sets of friends end up on the same train and visiting the same places in Europe. At first she detests him. However, she eventually becomes stranded in a remote part of Switzerland with him. All their friends are in the next location. Time passes, songs are sung and lo and behold the two begin to fall in love.\n\nThe first part of the film ends as the two characters are back in London with their respective families. Amrish Puri overhears Simran talking about the events of the holiday and hits the roof. He packs the bags and takes his family back to the small village in Punjab where they come from. Raj is spurred on by Anupam Kher who says if something is worth having, he must chase after it.\n\nThe second part of the film consists of Raj trying to win the trust and confidence of Simran's Punjabi family. It consists of several excellent comedy and song scenes. I will leave you to guess what happens in the end.\n\nThis film does not really warrant superlatives. It is better than excellent. It is as near perfect as we are likely to ever see. Like I say, if you have not seen this film, where have you been? The soundtrack is classic. Everyone knows the words to \"Tujhe dekha to yeh jaana sanam\" and \"Mehndi laga ke rakhna.\"\n\nThe performance of the actors is first class. This really is the film that took Shahrukh to superstardom. Kajol also gives an incredible performance. This is the role that really made her name and deservedly so. Anupam Kher does a top comedy role and all the other actors have put in a magnificent performance.\n\nThis really is a \"feel-good\" movie. If you have not seen it yet, make it your next priority to see the film. If you have, watch it again! This film, along with Hum Aapke Hain Kaun and more recently Kuch Kuch Hota Hai are the quintessential 1990's definition of excellent Hindi cinema. Take your family, as refreshingly, there is no sex, bad language or violence in any of the three films."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "paribadar",
        "review_rating": "10",
        "review_title": "AA A beautiful, brilliant film ever made, come fall in love over again",
        "review_detailed_main": "I just loved this film. I have seen it many times but still it's very entertaining, and a great family film to watch. Great story and brilliant actors in it. I just love Shah Rukh Khan and he is the best in this film along with other as well. Kajol is looking great and performance is the best too. If you have missed out this film then that means you have not watched a film that you can never forget. Come fall in love with it all over again. By seeing this movie you can feel like that you also want to love Raj or Simran too. Movie just brilliant movie. I can't express so much words but I think its just the best romantic movie ever made in film history. It had won the largest amount of awards that any other film has got. Shah Rukh as best actor, Kajol as best actress. Adi as best director, Best Film of the year, best play back singer Udit. Best supporting male and supporting female. And so many other awards as well. I just say that don't miss this flick. I give it a 1000/1000."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "DrEbert",
        "review_rating": "7",
        "review_title": "It's lovable because it's so stereotypically Bollywood",
        "review_detailed_main": "Every now and then, a movie comes along that manages to epitomize every single stereotype about its genre. For instance, \"Commando\" managed to epitomize a typical Arnold Schwarzenegger action movie. \"Dilwale Dulhaniya Le Jayenge\" epitomizes modern Bollywood.\n\nThe story, the characters, the choreography, the music, even the fight scenes are all very stereotypically Bollywood. The story is long, predictable, and melodramatic. Most of the characters are one-dimensional. Those that aren't are given \"depth\" in typical Bollywood fashion, i.e., by having them behave completely opposite in the last act of the film than they did in the first act. The scenes in India, London, and Switzerland are all beautifully filmed -- so beautifully, in fact, that they live up to the Bollywood stereotype of having bright, colorful, over-the-top locations for each of the song-and-dance numbers, and continue to reinforce Bollywood's love affair with Europe and European culture. The music is constant, pleasant, quite melodic, quite thematic, and always somehow upbeat, with heavy use of strings, the sitar, and the piano. The fight scenes are incredibly bad, again in true Bollywood fashion. The only thing missing is the requisite courtroom scene.\n\nAnd yet, in spite of all of this -- or, perhaps, because of it -- there is no doubt that \"Dilwale Dulhania Le Jayenge\" is an incredibly charming film. It makes for good escapist fun with incredible camp value, while also having enough genuinely good material (i.e., its songs) to make the movie into a bona fide classic instead of just a camp classic. There is a reason why this film persistently makes it onto critics' \"must-see\" lists of Bollywood movies. It is not because this film represents the finest of Indian art cinema. This is no \"Mother India\" by any means. Rather, this film represents Bollywood (i.e., Hindi-language commercial cinema) in top form. For those who were uninitiated with Bollywood films, this makes an excellent initiation film.\n\nYou will not walk away from \"Dilwale Dulhaniya Le Jayenge\" feeling inspired or moved. You will, however, walk away from it with a smile on your face. As silly as what you just saw was, there was something enjoyable about it."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "shailajarindani2005",
        "review_rating": "10",
        "review_title": "I have no words.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "rockmt",
        "review_rating": "6",
        "review_title": "overrated film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "abhishekkumar487",
        "review_rating": "5",
        "review_title": "Definitely Overrated......",
        "review_detailed_main": "I had heard so much about the movie everywhere that one day I decided to watch the movie. And guess what..??? I found the movie overrated. With due respect, I love watching Shahrukh's Chak de, MNIK, Swades, DON 2 (DON 1 was pathetic), but in this movie he was at his hamming best....!!!! I found his veer-zaara or Kal Ho Na Ho much better than this.\n\nIt would not have been overrated for me had it not been set as a benchmark in Bollywood movies (I mean there is Gangs of Wasseypur, Lagaan, TZP,Mother India, Sholay, Deewar, Swades, Andaaz Apna Apna, RDB and a very long list for setting Benchmarks ). For starters, the movie is actually at least 1 hour longer than what it's actual length should have been. Then there is an overacting Shah Rukh Khan at his peak.... And the script too is not so strong combined with so many loopholes and a monotonous and boring screenplay... I don't know how come it is said to be a benchmark film.\n\nHaving said that its just my opinion. But one thing is for sure that these filmfares and iifas are all so fake... SRK given the best actor award for DDLJ instead of Aamir Khan who definitely had given an amazing performance in Rangeela..."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "gah015",
        "review_rating": "",
        "review_title": "First mainstream Bollywood film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "metallic_kk",
        "review_rating": "10",
        "review_title": "Most romantic movie i have ever watched....",
        "review_detailed_main": "I am writing this review after watching the movie more than 5 times. The movie have very fine music, great presentation , very romantic story and so nice on screen chemistry between Shahruk and Kajole. Its a movie after which one want to fall in love. I think for Indian audiences the name of the movie is enough. I don't remember any movie in this genre to commensurate with this one. This movie comes out to be all time hit. So if you are feeling like to watch some musical drama, go for it again and again. One can also watch maine pyar kiya, jab we met, socha na tha etc for similar entertainment. I liked the acting of Mandira too. The way she falls for shahruk. The way she sees her faster heartthrobs."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "DaleLawson_1",
        "review_rating": "10",
        "review_title": "An Inspirational Masterpiece",
        "review_detailed_main": "This film is for anyone who has forgotten the meaning of life. It clearly demonstrates the power of love and its ability to move heaven and earth. This is much more than a movie. It is a gift for those whose hearts have been hurt, abused and misused. It is one of those rare occurrences where you can witness the real heart of Mother India in all her unobstructed glory. \"Shahrukh Kahn\", who plays Raj, is not merely an actor. He is the incarnation of one of those great Indian souls or teachers who is the embodiment of love. It is an incomparable privilege here to see him in his element. \"Amrish Puri\" is the quintessential Indian patriarch who is immovable in his dignity and beliefs. Beliefs that for him mean no less than the continuation of his Hindu ancestry. \"Kajol\", who plays Simran, is a true Indian princess. She will not disobey her father but she cannot ignore her heart or her love with Raj. I cannot praise \"Aditya Chopra\" enough for bringing this masterpiece to life. The direction is romantic, sweeping you up with every scene. You do not feel you are watching a film as much as experiencing a whirlwind. I must also mention that the music is true joy and inspiration and is essential to the whole package. The title song is magnificent. Thank you \"Jatin-Lalit.\" This film will make you feel like you have not felt in a long time. See this movie and live again."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "A_Voice",
        "review_rating": "9",
        "review_title": "\"A Gem..? No! not at all, But a Kohinoor.\"",
        "review_detailed_main": "I've seen a lot of Bollywood romances. Not just Bollywood but romances throughout the world cinema. They are more or less the same typical story of a girl meets boy, they have some obstacles and finally a happy ending. But what makes a romance special or different. The story? Obviously not! It is but the other details mainly character dept and development, an ordinary story artfully crafted into a path breaking script and to some extent awesome music.\n\nYou know a movie is great when you start to feel for the characters. Their pain their suffering, their happiness their problems become your own. 20 minutes into this 3 hour long experience, you become a part of it. You know what is coming next, but you want to see it happen. That's the power of SRK, Kajol and Aditya's finest.\n\nWhat is true love? It is something that can't be answered, but only felt, and only by those who have been through it. Everyone has their own definition. This movie moves along \"trusting in each other no matter what\". Another theme is the Indian culture. A diverse culture where girls are worshiped as the incarnation of Goddess Durga, at same time a girl child is frowned upon, a girl is caged in her house, forced to live the life which has been pre decided by her parents and the society. This is a girls tale towards her desire to be independent, and to be with the man who makes her feel independent. It is a story about a guy who is a spoil brat, but by heart an Indian who values his land's traditions.\n\nBeing an Indian, I know about the orthodox beliefs of arranged marriage where love marriage is still frowned upon by the society, movies like these vow to influence that \"orthodox\" strata of the society, and forces them to reconsider their believes.\n\nDespite the overwhelming positives, there seems to be a flaw, I am of the opinion that the costumes did not match the overall theme of the movie. Kajol wears a lot of \"non-traditional\" outfits, which could have been avoided. I understand that the character wanted to be free rather than a caged bird, but it seemed a little bit \"excessive\". Just my thought though, and an ignorable one perhaps! After the movie, its not the story, but the characters and the songs are what stays with you.\n\nDirection: Outstanding piece of direction, a well shot film across Europe and Incredible India. Thanks to Mr Chopra we today have some trade marked scenes, which will live on generation after generation, like \"meeting in the fields\", \"the train scene\" etc.\n\nScript: An extraordinarily written piece of drama, with excellent character development.\n\nActing: One of the best assemble. Each and every cast member has brought the characters to life. You feel as a part of the wedding. SRK and Kajol along with superb acting share a strong chemistry. Amrish Ji, Anupam Kher everyone was excellent. In the end a good advice by Mr. Yash Chopra to not Include Tom Cruise and make this an Indo-Amercian love story. And one more thing, I was really surprised to see Karan Johar LOL!.\n\nMusic: There is not an Indian alive who hasn't heard \"Tujhe Dekha to Yeh Jana Sanam\". I know people, who in 2013 hum the tunes of the movie, without knowing from which movie the songs are. An overly excellent Soundtrack. \"Ghar aja pardesi\" is my personal favorite.\n\nDDLJ is Bollywood's and India's Pride!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "jarfsu",
        "review_rating": "10",
        "review_title": "feel good movie",
        "review_detailed_main": "There is one scene in the movie when the song \"Najane Mere Dil Ko Kya\" begins, and the camera is focused on simran, and as she walks out the train station she turns back and longingly looks for some sort of answer. This is the type of thing great movies are made of. Dilwale Dulhania is a feel good movie based upon a very cliché plot, but somehow the originality of the actors set this movie far apart from the rest. It was the scene at the train station in London when you realize the acting is so convincing that you forget you're watching an actor and completely submerse yourself in the character. Shahruck khan may be the leading man in bollywood today, but kajol in this movie definitely stole the thunder from right under his nose. This is when you realize that although bollywood can mass produce movies every year, the ones that one should look forward too, are the ones where the leading actors have the most convincing chemistry. since kajols marriage, she had taken a hiatus from movies, and shahrukh khan had to make these epic love stories with other actresses, such as preity zinta and rani mukherjee. but the fact remains that not one single pair in bollywood history will ever compare to the pair of shahrukh khan and kajol, there movies will go down in history as being the very epitome of bollywood."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "COOLJAZ",
        "review_rating": "10",
        "review_title": "The Quintessential combination of superb songs and an exellent story...",
        "review_detailed_main": "One word after I saw this film....WOW!!! I only needed to see it once, and I'll never forgive myself for leaving it for so long before watching it.\n\nSo if you haven't seen it yet, WATCH IT!!! And buy the CD of the soundtrack, as you're going to end up playing it over and over and over!!!\n\nAll the songs are instantly likeable and stand out even today from the run-of-the-mill hindi soundtracks of the latest films, what else could spawn the hugely popular \"tujhe dekha to yeh jaan sanam\", or the brilliant \"ho gaya hai tujko to pyaar sajna\".\n\nPersonally, I dont think its the \"perfect\" hindi movie as the other reviewer suggests. It has its flaws that just get annoying after a while, such as Amrish Puri being called \"Baldev Singh\" and practising Hinduism and the selling of \"Beer\" in a petrol station (it wasnt even beer, it was cider!!). But still, the storyline is unbeatable for the comedy, originality and believability, (to an extent!!).\n\nGo see it ASAP!!!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "rm_shinde",
        "review_rating": "10",
        "review_title": "Best Romantic movie of all times....",
        "review_detailed_main": "Hey guys, this is the best romantic movie i have ever seen in my life, i have a personal VCD of this movie and whenever i am down i watch this movie and it makes me feel more close to my family and friends back in india.\n\ni liked the kind of values the director has tried to preach thru this movie. u should respect ur elders, ur parents, as they have sacrificed all that they had for you, and so u should always make them feel proud. this is the theme of the movie, and both the director, all the actors have done a fabulous job.\n\nit keeps u glued to the seat till the last scene. all the songs are melodious and very well picturised. the difference between foreign culture and indian family values is very well presented.\n\nwatch it....and u will love it.\n\nso come fall in love, once and for all."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "jboothmillard",
        "review_rating": "6",
        "review_title": "Dilwale Dulhania Le Jayenge (The Brave Hearted Will Take the Bride)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "bogartsthebest",
        "review_rating": "10",
        "review_title": "Great, fun, bubbly movie!",
        "review_detailed_main": "It's like this: Dilwale is no Battleship Potemkin, as my Indian friend who hates Bollywood pointed out to me when I said I preferred to analyse DDLJ than BP for our Analyzing Film exam but, then again, Dilwale is not trying to be.\n\nThe reason why the movie is great and one of the best I've seen is because it's silly and simple, yes, but also tremendous fun! The songs and dances are truly amazing and, unlike some people believe, the characterisation has depth. I should know because I had to discuss the different distinctive traits that make up all the characters in DDLJ in my exam and people would be surprised at just how layered and complex they are, if they took the time to pay attention (if you don't believe me, read the BFI book on the movie).\n\nAlso, the picture has no pretentiousness: unlike Devdas, which was so melodramatic I'm surprised the whole cast didn't die from the agony of having to act in such an overrated and over the top Romeo and Juliet ripoff (people scream all the time especially Aishwarya Rai who is the most hysterical of them all), DDLJ succeeds exactly because it's happy just giving us a magical young love story, which we could all relate to anyway but which is made even better because of the 1st rate performances given by everyone involved.\n\nKudos to Shah Rukh Khan and Kajol (my two favourite Bollywood actors), for creating such an intense, believable yet innocent and pure chemistry that made their love scenes just so sweet, beautiful and really heart-felt to watch.\n\nI'm not saying that just because we are capable of enjoying this movie, we aren't capable of enjoying something more intellectual and political like Battleship Potemkin.\n\nBut it's nice to watch a movie once in a while that is not depressing nor always giving us extreme scenes of violence and sex with which Hollywood seems to be obsessed with.\n\nNowadays movies just seem to feature people who think life is not worth living, are always suicidal and spend their time doing sex and drugs. Maybe these sort of characters should be pitied or something but, frankly, they're beginning to bore me. I've seen enough movies featuring these sort of personages to last me a lifetime. Give me a character who's happy with life and not afraid to have fun anytime!\n\nMuch like the celebrated Singin' In The Rain, DDLJ is fun, leaves you feeling elated, has funny dialogue and you can feel the love that everybody involved felt about the production, which increases the quality of the picture!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Sherazade",
        "review_rating": "7",
        "review_title": "The most over-rated Bollywood romance story ever! No, seriously it's like their Titanic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "svet14",
        "review_rating": "1",
        "review_title": "Awful piece of trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "mennoa",
        "review_rating": "8",
        "review_title": "Great movie!",
        "review_detailed_main": "I am not familiar with Indian cinema / Bollywood movies and I think this is the first movie I ever saw of this kind. It took me over three hours to watch it entirely(3h10m) but there was not even one moment I was bored! Basically it's a love-story about a boy (Raj) who meets a girl (Simran). They start to like eachother and this even goes further, they both feel they're destined to eachother and their friendship grows to love. Simran, though, is about to be given in marriage by her parents to a guy who lives back in India. What happens next is being told in a beautiful and exciting love-story which I can really recommend to see for anyone! The traditional costumes in the movie and the Indian music and dance make clear what's so different about these kind of movies (this one's one of a kind, though, I am sure!) compared to Hollywood-productions. I very much liked it anyway! Only positive comments are not to be taken seriously so I should think of any negative things. Lemme think... it'll probably be on the technical part of the movie. Fighting scenes are obviously all 'fake' (missed kicks and punches), the singing parts (especially Simran's) are obviously lip-synched. Some editing might have been done better, maybe in part two??;) Don't pay too much attention to these last lines because I (as a white European guy) still recommend this movie very much!! GO SEE IT!! (and ´judge´ it yourself)\n\nMenno"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Mardhiah12",
        "review_rating": "10",
        "review_title": "The best romantic Hindi film ever!",
        "review_detailed_main": "In this story, Simran and Raj are first shown as rivals and then, the relationship slowly developed into love. Shah Rukh became popularly known from this film and this film was shown at cinemas for 5 years! The film won 10 awards in Filmfare during its release. The scenery is beautifully potrayed and the songs, especially the theme song, Tujhe Dekha, could melt your heart. Even though, it has typical Hindi films ending (where the hero gets the heroin and they live happily ever after), you still seems to get worried that Raj won't be able to get Simran, and you laugh and cry along the movie. I won't spoil the ending for you, but truthfully said, I've never seen another romantic Hindi film that could match to this."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "paul_shock",
        "review_rating": "8",
        "review_title": "Great fun",
        "review_detailed_main": "I confess, I had to watch this film for school and went into it planning on a three-hour nap. Instead, I found myself watching a tremendously entertaining picture. Sure, DDLJ is frothy melodrama, but it has an innocence that makes it far superior to a lot of North American \"quirky\" romantic comedies.\n\n8/10 for great entertainment."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "joyce2",
        "review_rating": "",
        "review_title": "They should win the noble prize for chemistry!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "farsana",
        "review_rating": "10",
        "review_title": "1 of the best movie of all times",
        "review_detailed_main": "Dilwale dulhania Le jayenge is one of the bestest film in the world! Shah rukh khan is one of the main factor of the films great success, i absolutely loved it. It was hilarious and felt heart warming! I think everyone in the film did a great job. It made Shah rukh Khan rise to more fame as well as Kajol, because people wanted to see them act together more because of the chemistry between them. this movie and Devdas is a great credit to shahrukh khan, because you can see how Shah rukh khan has matured through acting. the best part of the film, is the fact that you see in other films where the lovers both want to runaway because the parents wont let them be together, whereas this film suggests that running away doesn't solve the problem. the other factor makes the film better is the fact that shahrukh khan himself went through the similar situation in 1994."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "Brilliant Entertaining Movie..SRK and Kajol are Superb",
        "review_detailed_main": "This is regarded as one of the Best Bollywood Film ever made. There is some Cinemas in India that are still projecting this movie with lots of House Full. It is the highest grossing Indian Movie of all time beating the 1975 Classic Sholay and 1994 Classic Hum apke hain kaun. Shah Rukh Khan delivers a Superb performance. Kajol delivers a Terrific performance. This movie made both Actors Superstars. It is One of the Best Films ever made. It is SRK and Kajols Best Movie. It was directed by First timer Aditya Chopra son on the famous Yash Chopra. It has Fabulous Music, my favourite song of all time is from this movie. Tujhe dekha to is one of the Best Hindi songs of all time. If you watched a few Bollywood Films, you have to see this. Instant Classic."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sswitzerland",
        "review_rating": "10",
        "review_title": "My all time favourite movie!!!!!!",
        "review_detailed_main": "This movie was a personal favourite of mine! The acting, the set, the emotions were all perfect! Not to mention the songs.....which will always be remembered and cherished. A definite must see! I have seen it about 8 times.....and still counting! *****"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "andre-71",
        "review_rating": "6",
        "review_title": "it has magical moments but also some flaws",
        "review_detailed_main": "I am a little undecided about this movie. On the one hand, the pictures are extremely beautiful, the actresses are overwhelmingly pretty, and the story is really romantic, yet fabulous for its provenience. On the other hand, I just cannot connive the defects of the film. The continuity is horrible. The characters seem to jump back and forth in time (from summer to winter and back in 12 hours) and location (they seem to hop between London and Switzerland in minutes). Dresses and cars appear from nowhere and vanish again the next minute. And then when I put all realism aside, why do extras (in the European part) always look uncomfortably and directly into the camera? Why do musicians obviously play something completely different on their instruments than is heard by the audience? All this appears so cheap and distracts!\n\nThe second part of the movie takes place in India and compensates reasonably for the flaws of the first. Still, I couldn't understand why they showed horribly acted fighting scenes in slow motion, so that you can exactly follow how fists and kicks always miss opponents. If this was to soften a violent scene, then why was there so much blood in the end of it? Nonetheless, the second part is catchy and in the end I was quite moved by the romantic story.\n\nIn my opinion, the film would gain a lot by being cut to two thirds of its running time (compressing much of the first part). Also the male main character should have been a little more serious. Through my eyes it was unintelligible how a girl could fall for such an annoying bighead."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "shere_panjab",
        "review_rating": "10",
        "review_title": "Best Hindi Film of the Century",
        "review_detailed_main": "I don't think I have ever witnessed a movie of such brilliance than Dilwale Dulhania Le Jayenge. I think the acting on behalf of kajol and Shahrukh Khan was superb and showed how brilliant indian actors can be. the support acting by Amrish Puri was brilliant and brought out the contrasting elements of Shah Rukh Khan and Amrish Puri.\n\nI think the underlying reason why this film is so brilliant and fantastic is that the film has reinvented and retold the story of love and made us believe in the fact that the right person is always out there. The film tells the reader of a love story in which no matter how big the obstacles are, that love always truimphs. Well Done to Shah Rukh Khan and Kajol etc for producing, in my view, the best film of the 20th Century, Dilwale Dulhania Le Jayenge."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "whepler",
        "review_rating": "6",
        "review_title": "Not What It's Cracked Up To Be",
        "review_detailed_main": "Yes, it's famous and popular. No, it's really not a well-produced movie by international or U.S. standards--and I'm no fan of Hollywood.\n\nWhere to start? \"Dilwale's\" acting is not strong, as fans claim (though how it's shot doesn't help, with silly zooms and slow-mo). The film uses practically no natural sound behind the actors, but insists on having music just about everywhere else, droning on, wearing on the viewer. As other critics have said, the editing--and consequently, the continuity--is awful, such as when the two lovers first see each other: where are they and how did they go from being totally unaware of each other to a sudden musical high at first glance? In slow-mo, of course.\n\nAdd to that almost laughable build-ups, as when we meet the lead actress in a strong wind (why?) standing at her window, veils swirling across her face (I watched for Mary Poppins' entrance). Next thing we know, she's doing a towel dance in a kind of silly tease, jumping on her bed, singing directly to us as viewers, and subsequently prancing clothed in the rain. The hero is idolized in her dream song, though she doesn't know he exists, through such heroic ventures as go-cart riding, bowling, and my personal favorite, virtually outrunning an airplane on take-off in a shot directly stolen from the famous Stallone boxing flicks. (We find out SHE can outrun a train.) He can also allegedly dunk a basketball as shown in the classic tight shot that doesn't show his feet. In slow-mo, of course.\n\nLet's not even talk about the heroine's dad's make-up and hair dye, or the ludicrous slow-mo used for the climactic conflict--don't worry, no spoiler necessary. No viewing necessary, either. Take this as stereotypical Indian fare, fairly pretty, but well behind the times even then in 1995, let alone the 21st century. India makes better, and so do a lot of other people."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sherlock-14",
        "review_rating": "1",
        "review_title": "terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "husnain_05",
        "review_rating": "9",
        "review_title": "This movie is one of the great ones i've ever seen.",
        "review_detailed_main": "Sharukh Khan suits Kajol and Priety Zinta perfectly. Dilwale. Dulhania.Le.Jayenge is a perfect movie that you can watch anytime. Amrish Puri was good in this movie and so was Farida Jalal.Satish Shah was fantastic even though I prefer him as a more type of comedy actor like his acting in Kal ho na ho and Main hoon na. This film was absolutely great and the songs fit in perfectly at the appropriate time.Shahrukh Khan and Kajol have worked in a lot of blockbusters together Karan Arjun, Kuch Kuch Hota hai, Kabhie Khushi Kabhie Gham, Baazigar, but Dilwale Dulhania Le Jayenge will always be their best movie together."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "mythrayee_ip",
        "review_rating": "10",
        "review_title": "Come fall in love",
        "review_detailed_main": "One of the beautiful movies I have seen. Love the characters of Shahrukh and Kajol and all other characters too. You will definitely fall in love with the characters in this movie. Don't miss watching this movie. Be it the Europe part or the Indian part. I became a fan of Shahrukh after watching this movie.\n\nThis is one of the best movies made in bollywood history and it will remain so. The songs were awesome. and all the other departments also. Brilliant teamwork gave a huge success to this movie.\n\nI love all shahrukh, kajol combination movies but this is their best and I give this movie a 10/10."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ItalianToni",
        "review_rating": "10",
        "review_title": "Still Mesmerizing 22 Years Later",
        "review_detailed_main": "I absolutely loved \"Dilwale Dulhania Le Jayenge!\" I am an Italian American woman and thought I had seen all the best love stories ever made, until I saw this movie. Spectacular!\n\nI've had many friends recommend \"Dilwale Dulhania Le Jayenge\" over the years, but never took the time to see it, so when my friend Rajni from Mumbai asked me last week if I had ever seen it, I decided to make the time. I'm very happy I did!\n\nThe movie was entertaining, fun and within a few minutes of watching the movie I found myself wrapped up in seeing Raj and Simran build a love story that made my heart melt! What a beautiful movie! I've been humming, \"Mere Khwabon Mein\" all day.\n\nOf course, Shah Rukh Khan and Kajol were perfect for the roles of Raj and Simran, who were absolutely adorable! I have seen them coupled in their other movies, as recent as 2015's \"Dilwale\" but must say, this is their very best! Knowing that I will watch this movie several times more, I purchased it.\n\nSo, it seems to me that \"Dilwale Dulhania Le Jayenge\" still mesmerizes those who have never seen it, even 22 years later!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "9",
        "review_title": "Winning the hand of sweetheart is a big project",
        "review_detailed_main": "After watching Dilwale Dulhaniya Le Jaayenge, I concluded that there's something about this movie which I had not read in any review or article pertaining to this movie. And that is - getting anything in your life you cherish, is a mission, a project which demands planning, efforts, self-belief, patience and perseverance. For a boy, winning the hand of a girl in marriage also falls into this line only. Winning her heart is one thing but after that, winning the will of her family / parents / guardians for the desired marriage is an altogether different and equally (if not more) difficult business.\n\nDDLJ is a love story of Raj (Shah Rukh Khan), an irresponsible motherless youth who happens to be the son of a rich NRI (Anupam Kher) in London and Simran (Kajol) who is the daughter of a London based Indian chemist (Amrish Puri) who despite living away from his motherland, has not compromised with the Indian family values. He expects his family members to follow the same path and Simran too has always complied with whatever she has been taught by him. However she has a vision of her prince-charming in her heart that she expresses in her poems. Against expectations, she gets permission from her father to go on a one month long tour of Europe with her friends and during this tour, she comes across Raj. And thereafter life is not the same either for Raj or for Simran.\n\nHowever, since Simran is already engaged to a youth in Punjab (India), her father gets furious when coming to know that she has fallen in love with someone. He, with his family, returns back to India and starts arranging for Simran's marriage with her childhood-fiancé, Kuljeet (Parmeet Sethi). Now it's a great challenge for Raj to win the hand of his sweetheart from her parents. He too comes to their place and gets intermixed in the family, pretending to be from the side of the groom. Winning over Simran's mother (Farida Jalaal) and younger sister (Pooja Ruparel) proves to be a cakewalk for him but winning the trust and will of Simran's father is a Herculean Task especially when he had already shown his true colour to him once on his chemist shop in London. How this Dilwala (a man with a heart) is able to carry (Le Jaana) his Dulhaniya (bride) with him forms the post-interval session of the movie.\n\nThe first half shows the faith of Simran's father in the Indian family and social values and his love towards the soil of his motherland despite his living away from it. It also shows the development of romance of Raj and Simran which is heart-warming.\n\nIn this movie, actually it's the script which despite being formula-studded, makes it a winner and renders it the status of a cult movie. There are several heart-conquering sequences with the impressive dialogs in both the halves. The doses of romance, sentiments and music are sufficient to take the audience in a state of trance especially when watching the film in theatre. And that's why this movie could run for one and a half decades in Maratha Mandir cinema of Mumbai.\n\nJatin-Lalit's music is mesmerizing. Though all the songs are good and Tujhe Dekha To Ye Jaana Sanam and Mehndi Laga Ke Rakhna Doli Saja Ke Rakhna were chartbusters, I will mention two different songs here – the first one is Ho Gaya Hai Tujhko To Pyar Sajna which underscores the depth of love in the hearts of both the lovers with a high level of intensity and the second one is Ghar Aaja Pardesi Tera Des Bulaaye Re which is definitely an underrated song of this album. You listen to it calmly and then you will feel the fragrance of the Indian soil through its word. Any NRI living abroad may get passionate to see his motherland by listening to this song. And Mere Khwabon Mein Jo Aaye is a song showing not only the talent but also the unmatchable sex-appeal of Kajol.\n\nPerformances are great. Shah Rukh Khan and Kajol have shown amazing on-screen chemistry and won the heart of the audience quite effortlessly with their performances. It's a movie to be watched again and again by lovers (and that too together). All others have also done well including Anupam Kher, being the proud father of Raj (despite all the minus points in his son's personality) and Farida Jalaal, being the frustrated mother who wants her daughter not to undergo the same frustration in her life as she herself had undergone.\n\nHowever the actor who has immortalized himself in this movie is Amrish Puri who has delivered perhaps the best ever performance of his career. A loving and caring father whose thoughts are rooted in the Indian traditional values but at the same time, who loves his daughter very much. He is against the boy because he opines him to be unworthy of his daughter but when he sees the depth and sincerity of the boy's love for his daughter, he mentally prepares himself for their union, has been portrayed by Amrish in a highly realistic, impressive and touching way. I have never seen a better performance by any actor in the role of the father of grown-up daughters in Bollywood cinema.\n\nI hope that the eligible bachelors who are longing to marry their respective sweethearts will learn from this movie to keep their morale high when the odds are heavily tilted against them in this regard and energize themselves for the mission impossible (just a figure of speech) to win them from their parents / guardians through the sacred knots. Keep remember, to get the Dulhaniya (bride), you have to be a Dilwaala (strong-hearted)."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ankishraj",
        "review_rating": "10",
        "review_title": "A classic that hasn't lost it's flavour even after almost 2 decades..!!",
        "review_detailed_main": "The youth of the 21st century find DDLJ boring, hackneyed and too melodramatic. And you can't blame them. The reason for this is simple- they have seen bits and fragments of DDLJ in countless other films that borrow from it so when they see the original, they find that it is the same old recipe. But no matter how many films borrow from DDLJ, they will always lack in the class and feel of this classic. DDLJ is an epitome of an ideal love story, simple yet effective. This is the most appealing part, simplicity. The characters of Raj and Simran are true to life, light years away from larger-than-life. You may call some parts over-dramatized but honestly, this film is 19 years old and considering that, Aditya Chopra's direction is perfect to the flaw. Ditto for the actors. Shahrukh Khan and Kajol are outstanding. Besides it also touches some relevant issues of Indian society. Gender inequality and marrying off the girl to the boy the parents like, without even asking for her opinion, are all dealt with and exposed without getting preachy. Another important aspect is the music. The soulful music adds a spark to the progress of the beautiful story. And the breathtaking climax- multiplies the impact of the film manifold Watch DDLJ like a classic 1995 film and you'll see it's true beauty. Watch it like you've watched everything and you ruin its essence. It can easily be called Bollywood's evergreen love story and it strikes the right chords."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "eh5963-297-967354",
        "review_rating": "10",
        "review_title": "The Perfect Indian Romance",
        "review_detailed_main": "Time is a tricky thing. A film of the 70's that's over the top would bomb in today's day and time. A film of today's time had no chance a few decades back. There are rare films that I feel remain fresh for eternity. Dilwale Dhulhaniya Le Jaayenge (Known as DDLJ) is one of those films that one can watch even today and not cringe in embarrassment.\n\nChaudry Baldev Singh is a Punjabi living in London. He's a very proud, egoistic and patriotic Conservative. He has a daughter Simran, a slightly liberal girl held back by tradition. Simran requests to go on a trip around Europe with her friends before she goes back to India to get married to the guy of her father's choice. Her father agrees and then starts Simran's love story with another Punjabi boy from London, who is the total opposite of what Baldev Singh would want. Raj, a spoiled, good hearted party boy also falls for Simran. However, Simran is already engaged and is forced to India. Then starts Raj's journey to go and get his love.\n\nFrom the very first scene, which shows a hard-working NRI Baldev Singh explaining how he and the birds are no different as they fly wherever they can eat, to the famous train climax. DDLJ is a treat to the eyes, ears, and most of all - the heart! If one actually analyzes, DDLJ is about a lot of issues. To start, the film can be seen through the eyes of a traditional father who wants to go back to the nest he grew up in. About a man who wants to raise his children the way he was in a totally Allen place. The initial scene and the scenes in the second half when SRK and the late and great Amrish Puri are feeding the birds are the deepest scenes in the film.\n\nDDLJ is also the story of a women's sacrifice. A girl's sacrifice. One of the most brilliant scenes in the film has Farida Jalal explaining the sacrifice of a woman to Kajol. Just astounding.\n\nAll said and done, DDLJ is about true love and going all the way to attain it.\n\nNow the story seems a bit serious on paper. However, that is not the case at all. There is humor all through the movie. SRK meeting Kajol for the first time is hilarious. My favorite comic scene is when Anupam Kher shows pride in his son failing - Classic.\n\nWhere most films have a dip in the pace in the second half, DDLJ just gets better. Raj's entry to Simran's family is clever and leaves a smile on your face. Of Course Anupam Kher's surprise in the second half causes even more laughs.\n\nThe film has been out for nearly 20 years and has had its share of criticism. Dumb criticism, mostly. I've heard and read ignorant people say that it's the same old love story and it's boring, it's over the top blah blah blah. I don't see that anywhere. In fact, most Indian love stories have been inspired by this classic. Boring? What movie were you watching? Over the top? It was quite subtle for its time.\n\nJatin Lalit have given their most memorable soundtrack with DDLJ. All the songs are worth listening to multiple times. The evergreen Tujhe Dekha Toh Yeah Jaana of course tops the list. Every song is a classic. The most underrated song in the album was Ghar Aaja Pardesi which also had the best lyrics.\n\nChoreography, camera, locales, sets, art, - Just a treat.\n\nAditiya Chopra's story is flawless. It is linear, yet so interesting. The screenplay is gripping all through. And of course, who can forget the famous dialogue of the movie? Lines such as \"Chote chote deson mein aisi badi badi baatein,\" \"Jaa simran, jaa\" and other various one-liners are still remembered by one and all.\n\nAditiya Chopra's direction is nothing short of spectacular. Not to forget that this was his first directorial venture. His films after this as director were not even half as good as this one, however. Though, even Adi will agree with me that DDLJ is something that even he cannot make again.\n\nShah Rukh Khan emerged the superstar he is with DDLJ. Playing darker roles and being well known as the villain in Darr and Baazigar, SRK tried his hand on an out and out romantic comedy which changed his world. There is nobody more charismatic, energetic, and spontaneous enough to essay this role better than SRK. It's definitely amongst his best acts and also one of the best acts by any lead hero in cinema. The comedy, action, romance, emotions - Just perfect! Kajol is one actress that has even given her leading men competition. She is nothing short of exceptional here. The great mix of innocence and spunk is only something Kajol can do. Superb! Amrish Puri is brilliant. In the starting reels, one really doesn't agree with his character. However, by the end of the movie he wins your heart. Known for being the bad guy, Amrish Puri is extraordinary as a supporting character here.\n\nAnother performance worth mentioning is of Farida Jalal. She suits the role to the T. Her scene in the latter half with Kajol when she explains a woman's sacrifice is applaudworthy. Anupam kher is hilarious. He helps complete DDLJ. Bringing him back in the second half was a master-stroke. Satish Shah is first rate. Parmeeth Sethi and Mandira Bedi are notable.\n\nOverall, what more can be said? Well, a lot more. However, I'll end it here and demand that you go watch this classic even if you're not a fan of romantic comedies. You will become one. Don't worry, you'll still love this film despite it being 18 years old, actually, you'll like it more than most Indian films you see today."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Aditya Chopra's \"untouchable\" winning trophy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "MovieInspector",
        "review_rating": "7",
        "review_title": "Fun, but nowhere near the likes of Mughal-E-Azam, Qayamat Se Qayamat Tak and Maine Pyar Kiya.",
        "review_detailed_main": "Let me start off with the performances. Shahrukh Khan was just himself; nothing too special about his performance. Kajol was her usual emotional self too. Amrish Puri is OK in the film as is Farida Jalal and Satish Shah. The story is like every single film of it is kind. It is nothing special.I don't actually understand why this film is so famous; there is nothing about the story or acting that justifies the film's status. What Kajol wears throughout the first half doesn't do her any favours as an Indian actress. The music and dialogues are the only two good things; everything else is very typical. This doesn't come close to Maine Pyar Kiya (1989), Mughal-E-Azam (1960) and QSQT (1988), but it is still a decent watch Verdict: just music and romance - I give it 7/10"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Rash",
        "review_rating": "10",
        "review_title": "Great songs, love the songs. Oh yeah, and the film...",
        "review_detailed_main": "I have problems giving films a full 10 out of 10. I usually panic and end up giving them 9. But I had no hestitation with this one. One of the very few films that actually made me shed a (solitary) tear. Being a laddish bloke admitting this is not easy.\n\nBack to the film. Usually a film lives off its songs (maine pyar kya being a prime example). However the storyline of this film stood out for its originality and the directing was superb. The scenes in London were the most realistic I have seen in any Indian film (or drama) to date (except the dancing on the streets of course).\n\nThis is the closest to Indian film perfection since Pakeeza. A must see film."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "r1mallat",
        "review_rating": "6",
        "review_title": "Nice but unachieved",
        "review_detailed_main": "All part taken one by one are pretty good in this movie : music, acting, story, etc... but it's missing a final touch to achieve it as a really good movie. Once more a very bad editing put you back in your seat every time to begin to fully enter the story. Nevertheless, Kajol and Khan make a very good couple, not as good as in K3G, but still worth watching it."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "patnaikcode",
        "review_rating": "5",
        "review_title": "Story of movie is no story.No logic nothings",
        "review_detailed_main": "Watch this movie only for songs and scene otherwise storyline of this movie is very weak.I gave 5 star only for songs.Songs of this movie are awesome."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "planktonrules",
        "review_rating": "8",
        "review_title": "A very typical sort of Indian love story...well done and likable but oh, so familiar.",
        "review_detailed_main": "In Indian films, there are several plots which are practically clichés because they occur so regularly. The most common, it seems, are the two lovers who fall in love but one or both of them are already pledged by their parents to marry another. Because of this, the plot to \"Dilwale Dulhania Le Jayenge\" is anything but original. However, this familiarity is something the Indian audiences love and pay to see. After all, almost ten years AFTER this movie debuted it was STILL playing in some theaters--such is the love of this sort of film in its native land. Since I am not Indian but love Indian films, I took the plot in stride and see this as a film that can be good but cannot be great simply because of the plot. It's a big case of 'been there/done that' as I watched...though the film is enjoyable and has its moments.\n\nWhen the film begins, Raj (Shah Rukh Khan) is supposed to be graduating from college but isn't because he's a bit of an irresponsible but likable rascal. As for his soon to be lady love, Simran (Kajol) is quite the opposite--very responsible and dependable. However, when they both go on vacations through Europe from their homes in the UK, you KNOW that soon they'll get together but the journey will, of course, be a rocky one. Because the movie is over three hours long, you know they cannot quickly fall for each other--and Raj's devil-may-care ways naturally rub Simran the wrong way...and they battle each other but always end up coming back to each other in the end. And you KNOW they are now in love because they take time to do musical interludes where they both talk about their love for each other. But, given the formula, the cannot get together...at least not yet. Simran is supposed to get married to a man her father chose for her and she's supposed to head to India to marry once this vacation is complete.\n\nAs I already mentioned a couple times, this film is very predictable and formulaic. But, it works better than it should because Shah Rukh Khan is very good as a likable sort of jerk. This is a tough balancing act because I've seen other Indian films with nearly identical plots where the guy is insufferable and easy to hate. Here, Khan manages to pull it off well. So did I love the film? No. I liked it and think it's worth seeing. The ending was particularly nice. But I don't, for the life of me, understand why it has as strong an appeal as it did in India. But what do I know?! At least I liked and enjoyed it."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "drknite-1",
        "review_rating": "10",
        "review_title": "Good entertainment",
        "review_detailed_main": "It was one of my first *new* Bollywood movies that I have seen and I loved it. After the brooding heroes of the 70's and 80's Raj Malhotra was like a fresh breeze.\n\nThe music is quite good, the characters are believable (and I swear I lived door to door with Simran's babuji a couple of years ago ;-)) and the love story is just cute. A bit dated when watched after ten years, but that is to be expected.\n\nLove the movie, love the music, but first of all I love Simran and Raj - Kajol and SRK do a very good job and have cemented their standing as Jodi #1 with this movie as well as with the following KKHH and K3G. Good family entertainment - THUMBS UP!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "saarajahan",
        "review_rating": "10",
        "review_title": "the biggest hit of Indian cinema",
        "review_detailed_main": "this movie is related to Indian culture although its based on NRI's. in first half Shahrukh(Raj) falls in love with Simran(Kajol) and in second half he makes the successful attempt to take away Simran as his bride by doing all things right. he had a easier option of taking away Simran without consent of her family but he chose the difficult way of proving himself the right person for her. the music of the movie is splendid and story is perfect. i don't have any more comments for this movie as the fact proves itself its simply THE BIGGEST hit of Indian movie industry till date. if you are an Indian then only you can appreciate this however it will make sense to others also.."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "bollywoodplusplus",
        "review_rating": "9",
        "review_title": "One of the best from Bollywood, Ever !!",
        "review_detailed_main": "The movie is truly wonderful, and one of the best Bollywood has ever produced. I am almost tempted to give it 10 out of 10. However, I would take a point out for not doing a great job on cinematography - but the movie is truly a superb from every other aspect, so felt bad taking a point off. The Switzerland alps look great as backdrops, however, a true cinematographer can create the magic in its absence too!\n\nDirection & script: superb! Kudos to Aditya Chopra on an awesome job. Many Hindi movies focus so much on lead characters, sometimes they forget the supporting cast. This movie shows the supporting cast are not just a prop for the story, they have characters too! You cannot ignore a single character - apart from major characters like the Father of bride (Amrish Puri), mother (Farida Jalal), even the characters of Kuljit & his father (Satish Shah) too are well taken care of! Very few movies (like Sholay) are so strong on giving importance to each and every characters.\n\nThe movie truly deserves all the 11 awards it got! The movie is surely the best for the SRK & Kajol duo. It touches every sense beautifully, so you never feel tired of watching it over and over again.\n\nMusic: It may not be the best Jatin Lalit has every produced, but it perfectly suits the movie. And of course all the songs have been very well choreographed, so the music video is imprinted on everyone's mind.\n\nThis movie was a milestone in opening up Bollywood's business abroad! It's got all the elements that appeals to an NRI audience. Bollywood has never looked back after this movie got so many accolades all over the world.\n\nThanks to Aditya Chopra for crafting such a gem, hard to believe its his debut movie!\n\nThis is the best movie of 90's and surely enough, it will remain in top 10 Bollywood has ever produced!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "AmidalaSkywalker",
        "review_rating": "8",
        "review_title": "Absolutely gorgeous",
        "review_detailed_main": "This movie is one of my alltime favourites! The plot although not new is perfect, which is probably why it has been used so many times. Raj and Simran fall in love while touring through Europe and when they get home, Simran is supposed to be married off to India. What I love so much about Bollywood, is all in here. First of all, Shahrukh Khan and Kajol are the perfect couple. They interact so well, everything fits. Second, The music is so great, I played the DVD a week or so until I got the CD. Third, we first see the cultural environment of London and Europe, which is contrasted very nice against India with all the fantastic colourful clothing. Fourth nice story components and Dialugues. The only reason for me not to give full 10 stars, is because off the dreadful late 80ies clothes (obviously the 80ties in India lastet deep into the nineties and because I want to spare a star for Khabi Khushi Khabi Gham, which is in my opinion still the best Hindi movie ever."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "swenliam",
        "review_rating": "",
        "review_title": "It may take another 20/30 years for somebody to make something like this again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ShitizSays",
        "review_rating": "10",
        "review_title": "People Outside India - This is the movie for you.",
        "review_detailed_main": "One of the things i am proud about India is this film. DDLJ as we all call it. I still remember the promos of the film with very dreamy titles and extremely heavenly tunes with Shahrukh looking like a perfect romantic hero and Kajol as completely different girl what she always appeared in her other movies. The movie was not a hit or blockbuster, it was a multi blockbuster. Shahrukh became uncrowned king, kajol became number actress and Yashraj films became number one production house. Every time i watch this movie i fall in love with it(which was also its caption). The narration, the story, the journey,acting and especially the songs, its songs are still hummed today and never seem to get old. Amrish Puri was good as always and the Shahrukh's antics and gaudy mannerisms pulled the movie from extraordinary to legendary. Must watch for everyone. Highly recommended."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sammen-84304",
        "review_rating": "7",
        "review_title": "I love this movie. Kajol is extremely beautiful.",
        "review_detailed_main": "As a european I had som difficulties, understanding the logic. Wonderfuld movie, songs and dance. Kajol looks at her very best in this movie. I understand the movie was in indian cinemas for 20 years ?"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "monique-mdavis",
        "review_rating": "10",
        "review_title": "Cute and holds interest",
        "review_detailed_main": "Some friends from India recommended this film to me and I absolutely loved it! Simran is beautiful and Raj is great in the film. This was my first attempt at watching a Bollywood movie and now I will watch many more! The movie is quite long, but worth every minute of watching,especially two hours into the movie. I cried at the end - if you want to see a love story, watch this film. It's a bit unrealistic at times - especially how fast they fall in love, but think in days and weeks rather than minutes and you will be okay. Lastly, if you're looking for Indian culture, singing, dancing and attire, this film has it all! No wonder it was a hit when it first opened in India."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Horst_In_Translation",
        "review_rating": "6",
        "review_title": "Who gets the girl? We all know it and cheer for him.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "bharatjiodedra-49383",
        "review_rating": "1",
        "review_title": "Full of cliche",
        "review_detailed_main": "Nothing to do with reality, full of cliche, normalisation of bulling, harrassment, saxism, and the list goes on"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Ibuk",
        "review_rating": "10",
        "review_title": "Dilwale Dulhaniya Le Jayenge- The Chopra's finest hour",
        "review_detailed_main": "Aditya Chopra, son of Yash Chopra made his mark with this ultimate classic love story. When released it broke box office records and it doesn't take any genius to work out why. The script was great, the songs were chartbusters. My favourite song was Mendhi laga ke rakna. A lot of scenes stand out for me, for instance at the end of Mendhi laga ke rakna where Amrish Puri does his rendition of Ae mere Zohrazabeen from the film Waqt. Shah Rukh Khan and Kajol performed extremely well whilst character actors like Amrish Puri provided great support. Farida Jalal touched my heart as the mother who wants best for her daugther\n\nShah Rukh Khan has been a Chopra favourite since Darr and he went on to star in Dil to pagal hai, Mohabbatein and Veer Zaara. Aditya Chopra next venture Mohabbatein made have made a lot of money but didn't appeal to me. Aditya Chopra has taken the Chopra name to a new level."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "gouravmahajan",
        "review_rating": "10",
        "review_title": "awesome movie in Indian bollywood history",
        "review_detailed_main": "I was very moved and inspired by the clips alone! Then, I told my friend (who happens to be Indian) from my work study job invited to an \"Indian Movie Night\" at her dorm. We watched K3G and I was so touched by it! It was simply wonderful. Most of all, I became a SRK and Kajol fan. Their on-screen chemistry is remarkable! I can't explain it! Anyhoo, I asked my mom for some Bollywood movies for Christmas and one of the movies I got was DDLJ. And let me tell ya'll, it is now my favorite movie of all time. SRK and Kajol shine beyond reason in this flick. The script is excellent, everything is excellent especially the acting and memorable songs! The supporting cast (most notably Simran parents, sister and Raj's dad were figging awesome!) Mr. Amish (sic) Puri, who played Kajol's dad acts wonderfully with just his eyes! One of the funniest lines in the movie is when Raj's friend walks into Simran's dad store and says \"Uncle, can I have some beer?!\" Gosh, it's the way that cat said the line that made it so FUNNY! After watching it again yesterday, I realized that I love so many Hollywood movies (particularly classic ones) and yet I couldn't state my all time favorite one. But while watching the making of DDLJ (I own the special edition version with two DVD's inside), I became rather teary eyed. I mean, I'm getting teary eyed writing this review at this moment! This film touched not only my heart, but my soul as well."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "jenaegarey",
        "review_rating": "10",
        "review_title": "One of the greatest adventures",
        "review_detailed_main": "When you look at the picture on the front, it's not too impressive. Okay, it's a guy and a girl- and he's got that strange hat on. Push play anyway. It's this great story about this rich dude who doesn't have a care in the world, who meets this sheltered girl and wow things happen. He's the very guy she's dreamed about. But there's a catch- dreams don't prepare you for the reality of dealing with your dream boy. Especially one such as she ends up with. And she's not the usual bride from a fairytale where they go to Lasvagas to get married either. Her dad had her promised to someone else before she could walk, never mind think/speak for herself. Will she brake the rules and allow her dream to come true? Will her dream boy have the smarts to win her heart and grit to survive the storm and bring her home? An award winning performance worth watching."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "asif-evolved",
        "review_rating": "10",
        "review_title": "Dilwale Dulhania Le Jayenge",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "blindlover3",
        "review_rating": "10",
        "review_title": "come fall in love",
        "review_detailed_main": "It has been 13 years for this movie and still as fresh as it was that time.I can watch it as many times as i can.The love with a different meaning.A love story with a message for new generation who loved to elope.If you have missed this movie,you would have missed the best (Bollywood) movie ever made.\n\nShahrukh and Kajol chemistry was just mind blowing.The opposite attracts and same case with this story.I just love this film i have watched this movie countless times and ready to watch it again and again.The best part of the movie is its superb story telling.The romantic movies are not easy to click and direction(Aditya Chopra) with his first directional venture made it so easy and lovable that no movie can match this movie magic.It was like a revolution in Hindi cinema which leads to more romantic movie and people changed their mind towards romantic movies after this one.It is still running in theaters.\n\nHighly recommended"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Mari_1990",
        "review_rating": "10",
        "review_title": "Two Decades of Greateness",
        "review_detailed_main": "DDLJ has all the features that a classic movie should have: love, laugh, drama, music, story, iconic scenes and spirit. The film is regarded as a transition point between conservative India represented by the parents of Simran and modern-era India destroying all the boundaries between people represented by Raj, yet respectful to traditions and family values.\n\nThe cornerstone of the film is, of course, beautifully crafted love story, which would be impossible without chemistry between Kajol and Shah Rukh Khan (In reality, both actors reject having chemistry and just call it a comfort-zone). Kajol plays a girl with strong personality, values and pride, who secretly craves for a passionate love; on the other hand Shah Rukh Khan plays a dangerous guy whose philosophy is to achieve success with every possible way, even with lie. The magic happens these two characters stay alone in an unknown country without money: Simran needs help from Raj, but never admits it due to pride, while Raj can not let her in danger.\n\nBesides love story, there is comedy, most notable of which are dialogues between Raj and his father; drama, resistance from Simran's father; music by Jatin Lalit; iconic scenes, mostly due to Aditya Chopra's vision, confession of love on the bridge, meeting at flower field and epic train scene.\n\nDDLJ deserves love and loyalty that it has gained (the fact that film has been playing for 18 years in the theater). Chopra and Shah Rukh Khan have made a lot of notable movies after it, which have recorded at box offices and depicted also beautiful love stories, even though only DDLJ has passed the test of time due to its characters, chemistry between lovers (Kajol and SRK are Super!!!), closeness to people and spirit."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Long but charming entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "manastest",
        "review_rating": "6",
        "review_title": "Good watch",
        "review_detailed_main": "This Is a love story. Dilwale made me glad to be a Westerner, just so I could experience the sheer rush in the glorious way this film simply throws its Indian sensibility in your face. It is one of the most completely, openly joyful films I have ever seen. In many ways a totally Western film, it is yet completely un-Western, and absolutely invigorating.\n\nDirector Aditya Chopra was, I understand, only 24 when he made Dilwale, and the film was so successful its Indian first run lasted a world-record 11 years (and may still be going on, as far as I know). A heckuva testimony to Bollywood indeed. This movie has instantly become one of my favorite musicals, and I look forward to finding more films from Chopra, Khan, and Kajol."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "the_birs",
        "review_rating": "8",
        "review_title": "Nice Movie.",
        "review_detailed_main": "I've been watching this movie recently and I really found it nice.\n\nIt's the kind of movie we are really missing because nowadays even in the Indian movie sector we can't see a movie which provides a good actors plays, good scenario, pretty songs.\n\nNaturally the couple SRK-Kajol is really a perfect match!The rare films they are both together was well done and got a lot of success.\n\nSo don't wait too much and go and watch it because I believe you won't regret it at all! I'm not Indian and unfortunately I must satisfy myself with the subtitles which are not that good.\n\nI found it great! Go please watch it!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "kinimak",
        "review_rating": "7",
        "review_title": "A typical Bollywood film",
        "review_detailed_main": "The movie is an all and all a cliche Bollywood movie one can expect. Storyline is predictable and the ending of the movie is what is it in the title of the movie. So it isn't like a polar opposite of what it is. Songs all throughout the movie were really great and in the all time classics. Acting by the supporting cast was good compared to the main leads especially by Amrish Puri. Kajol acted her decent best while Srks acting was okayish. On the contrary movie could have been cut short by 10-15 mins. It slightly felt dragged. What works for the movie is the build up towards the end. A fairytale ending just makes up for a good watch."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "mannuskyhigh",
        "review_rating": "2",
        "review_title": "Nothing Extraordinary",
        "review_detailed_main": "I find this movie so much overrated that it gives me goosebumps to consider it as one of the greatest movie of Bolywood. and this is just because of the commercial success it made. Had the movie been flopped, it wont considered such a great thing since it doesn't have anything special. Its just the hype which made it a good runner, otherwise from the content point of view it has nothing new to offer. the characters doesn't look believable and gives you a feeling that they are not characters but acting on screen.\n\nShahrukh khan repeats himself over and over again. Kajol overacts many times, an OK performance but definitely not an award worthy. the saving grace of he film lands to the music directors Jatin-Lalit and Amrish Puri.\n\nWatch it only if you have some time to yawn."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "fredberglyle",
        "review_rating": "8",
        "review_title": "Of late, I fell in love with Dilwale Dulhania Le Jayenge",
        "review_detailed_main": "The movie is a commercial/sheer entertainer and not to be taken as a serious film at all. The biggest hit in India (ran 10 years straight) and the debut film for the director Aditya Chopra. The songs needs no review at all and is one of the greatest and one among very few ones in which I watch each song twice while seeing the movie. The songs \"Dekha to hain jaana sanam\" and \"Doli sajake rekhna\" are my personal favorites. Apart from SRK and Kajol there is Amrish Puri and Anupam Kher, who were (as always) at their best. The movie served as an inspiration to number of SRK movies that followed it. The movie's runtime is 3 hours but I never felt boring at any instant.\n\nThe movie is a typical bollywood one and not for serious art-flick lovers. For others,if you haven't seen it yet, then what you're waiting for...\n\nCome... Fall in love with SRK and Kajol. This is best watched with your lady-love/lover."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "mishrarakesh793",
        "review_rating": "10",
        "review_title": "come fall in love!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "bayridge6810",
        "review_rating": "9",
        "review_title": "Life lessons to be learned",
        "review_detailed_main": "This video teaches a great lesson in life. There might be some behaviors that the characters do that might not be likable, but it teaches us that we are not perfect. The bigger lesson u can learn from this is that you should always try to have clean heart. Additionally it also teaches you that you should never take something that doesn't belong to you as it might hurt the owner. Just like raj chooses not to run away instead he asks her parents permission first. Raj not only cared about simran but also her parents as well. To him her parents are strangers but for her they are her world. He never could hurt them. The other thing it teaches is to respect women. Women are to be respected because they are precious. Women are special and their honor is important. There many things to learn from this movie if we disregard the small details we tend to look for so that we can criticize something. In the end the big picture matters and is often remembered. Not the small details. Relive the magical moments of raj and simran."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Dream_Woman",
        "review_rating": "8",
        "review_title": "loved it totally!!!",
        "review_detailed_main": "This has to be one of the most romantic movies ever made in the 90s,watch it with a loved one, they won't make romantic films like this for a long time, nowadays they all have the same plot and use nudity and sex to sell the movie.\n\nI remember watching this when i was younger with my family and have loved it since,Shahrukh and Kajol did excellent in this film, they acted really well and were right for the role and the songs were one of the best that were written today, i just hope that they got some awards for this film cause they really do deserve it.\n\nI don't think that you could ever remake this film it truly is one of a kind and if you have not seen it i suggest you go out and buy it and watch it."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "saru2020",
        "review_rating": "10",
        "review_title": "rewatching the EPIC after 28 years of its release",
        "review_detailed_main": "Watching it fully for the first time after 28 years of its release in a theatre is kinda a different experience altogether.\n\nAt the start, it feels like watching an old ad and at times it feels like watching a spoof if you don't really go back in time but if you just think about the way you've come from and I know its hard for people who don't come from that era to do so, hence this film is especially for those 90s kids who all saw this film or fantasised about this film in their childhood, once you go back in time in your thought process, re-watching this film becomes bliss and gives you a nostalgic pinch.\n\nIt is amazing to see this film re-release even today and I watched it with almost 30 people in the theatre, that too in a non-Hindi speaking state, which says it all about how this film is EPIC.\n\nTip: just make sure that you don't go with the person who takes about cliche & all, they'll spoil it all."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "rahumate",
        "review_rating": "9",
        "review_title": "DDLJ is the crux of Bollywood cinema. There are three generations who have grownup with it.",
        "review_detailed_main": "DDLJ the modern classic Dil Wale Dulahaniya Le Jayenge (DDLJ) a 1994 film which has recently completed 1,000 weeks. Indian cinema lovers have bestowed the warm love for this film. Today any film which is hit runs for 1 month and a super hit film runs for 2 months. Multiplex has replaced the single screen theaters. DDLJ has not only witnessed this change but reign in both times.\n\nI remember those days when people from nearby villages use to come to town to see films. Yes, it was 1994.Hum Aapke Hain Koyon, Rangeela, Bombay, Cooli No.1 et al. watching a film was a celebration. Indian cinema possesses the glorious legacy of song and dance sequences. Aditya Chopra was confident to make this film. He convinced SRK and Kajol to work on this film. SRK who was in news for his successful negative roles and he was happy about it. SRK and Kajol did not know that this film will write their fate. SRK became super star after this film. On social background Indian was on the way to globalization. Internet was yet to be rooted in Indian society. The youth was very much interested in going abroad and carving their career. It was a love story, a routine love story but told in an extra-ordinary manner. NRI Indian young boy met a girl when they both were on Europe tour. He was enjoying his failure as being a rich spoiled brat and Kajol being an apple of daddy's eye, which is enjoying her one and only month of her life. She is ready to sacrifice their life for their parents. \"Love is composed of a single soul inhabiting two bodies\". Said Aristotle The sweet Europe tour gets over and Raj and Kajol come together. The journey of Europe with lot of fun and exciting bites they find the real nature of each other. This is the beauty of this DDLJ love story. Raj who try to portray how responsible and caring he is completely opposite of his screen character and Kajol who is otherwise homely who try to be high hilled and bubbly girl. This is the successful equation. Indian people have enjoyed this film not only for its foreign locations but for the portrayal of story. 1994 onwards we have witnessed the ups and down of economy. That was the per-mobile and pre-internet era. Today's youth who is born after 1994 are known as internet generation. They have also liked this film may be because the NRI up market families and their nostalgia for their Indian ethos and love for soil. We are not going in the question of how genuine their love for Indian ethos and love for soil I remember the lines of Pablo Neruda here, \"Someday, somewhere - anywhere, unfailingly, you'll find yourself, and that, and only that, can be the happiest or bitterest hour of your life.\"\n\nSudden realization of love from the by SRK and Kajol takes a twist to the story. They long for each other and then their involvement with family members and with each other takes us through many ups and downs. SRK try every possible way to win the heart of Kajol's family. Kajol begins considering his as her future husband. The magical portrayal of first love attracts the youngsters. This Pablo Nerudian passion which he mentioned in his100 Love Sonnets, I would like to share it now, \"so I wait for you like a lonely house till you will see me again and live in me. Till then my windows ache.\" Raj (SRK) and Simran (name given by Raj to Kajol) became synonyms for lovers in the decades of 90s and 2000s. I remember many people had their name Raj. They felt silver screen proud that their name is Raj. It always has been one of the famous names from India. Today it is rarely used or not used at all. Credit goes to DDLJ. Every boy in India became Raj and every otherwise homely and average looking dusky girl is proud to be Simran. I think DDLJ will complete more 20 years as it left the legacy for nearly two generations. The youngsters who motivated by DDLJ must be in their 40s and have small children now. There are chances; this small generation may follow the Papa's classic DDLJ. The early teen generation of 1994 must be getting married now. The third generation of on the more lovers, who patronized DDLJ many times for its saga of love and Indian ethos many a times and enjoyed cinema experience in theater, they remember the magic of dark, AC and cinema hall experience of DDLJ. Most of the times these on the move lovers part but they have nostalgia for this DDLJ theater romance. Many youngsters of internet generation are making their face when they hear the name of DDLJ. Smart phones that connect everything to anything, Internet offer you the leaping vision. These gadgets have not only altered the space and time but they have made us more confused about human emotions. Today when asked to a college freak about DDLJ, his reply stunned me. Connecting this love story or SRK devotion for love and courtship is beyond their intellectual periphery.\n\nIt is worth taking a look, how we have grown from 1994 an ear of landline to today's smart phone. That was the era of letter friend columns in news paper and today with whatsapp. Chat machines and cyber café are the object of yesterday. Whatsapp has over taken the email account. The very equations of love have changed. Gone are those days when people use to praise lovers and their courtship. DDLJ we also find the last mile stone of love story. Today we have love story as it is the basic ingredient of Indian cinema but we do not find that charm what we find in DDLJ."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "gaurav",
        "review_rating": "",
        "review_title": "An Ideal Hindi Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "si_shaalini",
        "review_rating": "7",
        "review_title": "Not a bad movie.",
        "review_detailed_main": "But are really the second generation Indians in the U.K. like haU the characters are portrayed?The romance between the hero and heroine is good,the locations and songs also.It's a different film and has it's good moments of comic relief.The actors accents certainly don't saUnd English.It would have been more natural and realistic had it been so.WaI do the Bollywood filmmakers do this?Kajol's costumes were good and her character is too intense.And the lyrics of the songs are good.Shahrukh Khan has done justice to his role and Karan Johar in a small cameo appearance looks like a geek.The family laIf portrayed is really warm.From,Shaalini."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "koolwal-anirudh666",
        "review_rating": "9",
        "review_title": "Come Fall In Love!",
        "review_detailed_main": "I don't know why I liked this movie as it has the same average love story script. But I tell you this is where we all are wrong! DDLJ is much more than script! The acting is fabulous ! Not a SRK fan but I loved his acting, not to mention the other actors were also outstanding. Yash Chopra has magic in his cinematography it's just lovely. The songs are amazing too so no reason you cannot love this film. Just put your logical sense out because you are about be on a emotional rollar coaster ride!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "fhasannsu",
        "review_rating": "1",
        "review_title": "Overacting Film Le Jayenge",
        "review_detailed_main": "Meh meh. What the hell did I just watch?\n\nFull of overacting.\n\nI don't even know what else to write to meet 150 characters quota. Useless garbage.\n\nThe whole story doesn't make sense."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "kamruzzamansatu",
        "review_rating": "10",
        "review_title": "This movie is my childhood love movies.",
        "review_detailed_main": "This movie learnt me how to fall in love with someone & how to help a girl in train. When i will be father & my child see this movie. I know he/she will say papa this is a so romantic movie i have ever seen."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Saw-it-on-Tubi",
        "review_rating": "9",
        "review_title": "Forgive my doubt",
        "review_detailed_main": "I heard good things about this movie, and given its runtime, I split this one into two viewings. For this first half, I thought it was pretty good, but didn't see what the fuss was about. Today when I watched the second half, I understood. I kept thinking the movie had shown all of what was going to happen, and more would come. This film doesn't have a long wrap up; there is tension to the last moments. Even if you are sure how this will end, the path to get there will hold your interest."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "pradeephajipur",
        "review_rating": "10",
        "review_title": "Movie of this Era",
        "review_detailed_main": "Far...far beyond everything. Just watch it as many times as you can till your last breath."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "shashwatsisodia",
        "review_rating": "8",
        "review_title": "The saga of love's timelessness",
        "review_detailed_main": "This film changed Bollywood. Never have I seen a better film in twenty years. This story of two Non-Residential Indians, Raj and Simran, remains fresh through the ages. The film directed by Aditya Chopra changed Hindi cinema into Bollywood cinema."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "kartik051079",
        "review_rating": "10",
        "review_title": "The Best Movie Ever in the History of Cinema",
        "review_detailed_main": "Dilwale Dulhania Le Jayenge, till date, remains the best movie I have ever seen. Everything about this movie stands out. The story, the screenplay, the dialogues,the songs and above all the performance by each and every actor; especially Shahrukh Khan; makes this movie extra special. Every scene in DDLJ manages to make in impact. It makes you laugh, makes you cry, inspires you and above all makes you fall in love. This is also a movie with a very strong message. In today's time when most of the lovers lack the courage to fulfill their commitment made to their loved ones, this movie shows that if you have confidence in your love you can convince your parents about the same and this way you can marry the person you love the most without hurting your parents who have spent their entire life in bringing you up. I am sure that no movie before or after DDLJ can make the same impact that DDLJ managed to make. It is the longest running movie in the history of cinema and I am sure it will continue to run successfully for many many more years to come."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Rani-4",
        "review_rating": "9",
        "review_title": "Great Movie!",
        "review_detailed_main": "My fav hindi movie! I guess the best thing about this movie is Kajol. If you haven't seen it yet.....WHAT ARE YOU WAITIN FOR??! Get hold of it and enjoy with your family and friends! Believe me you won't be disappointed!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "shivakumarvishwa",
        "review_rating": "10",
        "review_title": "A Superb movie",
        "review_detailed_main": "Dilawale dulhania Le jayenge is an excellent film.This was the most Awaited one of 1995.The wait was worth it.The story is excellent.It tells us about 2 Indian born Brithish Raj and Simran.One day they go to Europe with friends.In Zurich they get separated.By the time they get back to their friends.THEY ARE IN LOVE.But Simran family go to India.Simran is to marry Kuljeet.There fathers planned the engagement 20 years back.She cames across Raj again.Raj says that he is only there for her.To what is next see this.This is a Superb movie.Kajol and Shahrukh .They have brilliant chemistry.Cinematography is mind blowing.Swizterland is beautifully shoot.The scenes where Simran runs to Raj in the flower field is everlasting.There was no bad point in the flick.The music is simply mind blowing with excellent Picturisations and the singers are in top form here.Photography is good.Script is excellent.Scenes are well arranged and so is the song.This is much much better than\"Qayamat Se Qayamat Tak\" and\"Maine Pyar Kiya\".Come fall in love with a classic.Complete family entertainer"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ajantaghose",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "Trash of a film, I don't know why people watch it. The only good thing was the music which can be really appreciated.."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "jagdish_lokhande",
        "review_rating": "10",
        "review_title": "DDLJ movie is worth watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "surya_m77",
        "review_rating": "9",
        "review_title": "Awesome movie...",
        "review_detailed_main": "One of the best thing about this movie is, it is still so fresh and entertaining even after its release 17 years before. I watched it today and enjoyed it thoroughly. I couldn't believe such was the talented team Yash Chopra had for this movie that everything just fell into right place. Be it songs, lyrics, background score. dialogues, acting or cinematography, everything is fabulous and I would proudly and yet with some regret say that no one including Yash Chopra and Aditya Chopra would be able to recreate this magic ever. This movie is masterpiece and I believe it can't be replicated ever. Its just now imprinted in the history. First half of the movie is set in London which has been portrayed very well including other parts of the Europe. Shahrukh khan rocks and after watching this movie one would definitely admit he was once the superstar of Hindi film industry. He had such a huge screen presence that you are just in awe while watching him act and goofing around to woo Kajol. Kajol as usual had talent and this movie gave her right opportunity to showcase it. This film is a great family entertainer and if you are really feeling low or sad due to any reason I would suggest just watch this movie and it will lift your spirits and at least for some moments you will be lost in this eternal tale of love between Raj and Simran."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "syedalom-06493",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "Great Story still everyone's favourites... great acting .."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "pratyush-03848",
        "review_rating": "10",
        "review_title": "One of the greatest Rom-coms of all time",
        "review_detailed_main": "Dilwale Dulhania Le Jayenge (DDLJ) is one of my favorite films of all time. It is the story of Raj and Simran, two polar opposites who meet on a train in Europe. Raj is the son of an industrialist and is a modern an outgoing guy. Simran on the other hand is the daughter of a gas station vendor and is more reserved. After these 2 meet, the audience is in for a fun ride filled with romance, comedy and drama.\n\nFrom start to finish, the film keeps you engaged and makes you cheer on for Raj and Simran. The songs are great, melodious, and make the film more enjoyable. The dialogs are equally memorable, so memorable that the President of the United States quoted a line from this movie when he visited India.\n\nThis review is coming from a guy, and yes most guys do not watch Rom-coms. But this is one Rom-com no one should miss. Whether you are Indian or not, a man or a woman, this is a movie no one should miss. It is great for all ages and once someone watches this, that person will watch it multiple times later in life. To me, it is the best Rom-com I have seen and that is why I highly recommend it to anyone. This is a film which I believe everyone should see at least once in their life. So sit back, relax and enjoy one of the greatest films in Bollywood history."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "amey32",
        "review_rating": "9",
        "review_title": "Landmark movie in Hindi Cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "kchandankumar100",
        "review_rating": "10",
        "review_title": "An all time classic by YRF......",
        "review_detailed_main": "DDLJ was a landmark movie in Indian cinema and one of my all time favourite.Yash Chopra has made many classic movies and this stands on top of the list.I really liked SRK and Kajol in the film and for me,their performance in the movie stands out as their best.Both must have given huge hits but I don't think any movie can get better than this.Everything in the movie was awesome be it the acting,dialogue or the songs and music.The film is an all time classic.It was this film that changed the face of Indian cinema in foreign countries and also earned SRK huge fan following.I would never mind watching it again and again. Yash Chopra's movies are always a great pleasure to watch,specially when the lead hero is SRK.I simply can't wait to watch his next release JTHJ and hope it does exceptionally well at the box office!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "I_Ailurophile",
        "review_rating": "10",
        "review_title": "An absolute, heartfelt joy",
        "review_detailed_main": "From the outside looking in, a viewer who is accustomed only to America movies might be taken aback by the distinct stylistic differences in pictures from the subcontinent. I can surely appreciate the cinematic culture shock, as the gap between the respective industries is notable. To earnestly engage with Indian films, however, is to recognize that they are bursting with extraordinary life to which precious few Hollywood features can compare. Even when at its core a narrative is simple and familiar - say, a romantic comedy-drama about a boorish young man and a hard-headed young woman who fall in love and must overcome the forces keeping them apart - the aesthetics and sensibilities of Indian filmmakers elevate these stories to another level. 'Dilwale Dulhania Le Jayenge' readily joins the fine company of its brethren, and is a joy all the way through.\n\nEvery country their own musical movies; the genre dates to the earliest days after the silent era gave way to talkies. Musical or not, many movies devote themselves to creating a grand, fetching spectacle. Yet what is often true is that these elements are reserved for select titles, and musical numbers are commonly relegated to specific sequences that often break the narrative flow. It's worth reflecting on this as a preface to admiring Indian cinema, for from one film to the next, every smidgen of song and dance, and all the most splendid exhibitions, are incorporated with tremendous naturalness and fluidity. In all the world there's nothing else quite like it: terrific choreography, and catchy music; vibrant, colorful production design, art direction, and costume design; strongly dynamic performances and melodrama - all woven so organically into the storytelling that one almost expects to walk through Mumbai or New Delhi and see such pageantry as a part of daily life. Movies that as a rule tend to be 2.5-3 hours long or more make full use of every last minute, and never feel as long as they are - they're exactly what they need to be. Even some of the most respected and well-reputed epics in Hollywood history can't make the same claim.\n\nIf it seems so far like I'm speaking to the industry at large more than than 'Dilwale Dulhania Le Jayenge,' well, you're not wrong. But it's only because it's exactly as worthy as most any one of its fellows, and that value is all but peerless - this is endlessly lovely, charming, endearing, and entertaining. Superstar Shah Rukh Khan, and co-star Kajol, have fabulous chemistry as scene partners. Everyone in the large cast does a fine job of realizing their characters and making the story impactful - special commendations to Farida Jalal for her excellent portrayal of Simran's mother Lajjo - yet Khan and Kajol in particular are so great that one immediately wishes to find more of their pictures. Aditya Chopra's writing and direction are both stupendous, conjuring brilliant, wholehearted splendor across three countries, many outstanding filming locations, and a variety of moods over these three hours. The major themes are ones we've seen before - conflicts between traditional and modern values, family and individuality - yet even relative to titles that have followed in subsequent years, it seems to me like DDLJ approaches these with an especially mindful, balanced hand.\n\nAll this is to say nothing of the fantastic choreography, songwriting, sets and costume design... Truly, from top to bottom, this is just such a rich, enchanting viewing experience. For every way in which the feature is discretely familiar and unremarkable, it's nevertheless presented in a fashion that makes it feel fresh and new. For every instance that the melodrama risks becoming overbearing, in the next moment a bright spark greets us to keep us attentive and sustain our enjoyment. As a matter of personal preference I can understand why this wouldn't necessarily appeal to all audiences, but by and large, anyone who appreciates cinema as a medium should have a great time watching. I gather that DDLJ has a long, enduring legacy even now, which speaks volumes about its quality, and it's hard to stop myself from saying this earns a blanket recommendation. Some movies are so good that they demand viewership even from those who wouldn't necessarily engage with the style, and this is probably one of them: 'Dilwale Dulhania Le Jayenge' is a modern classic that exemplifies Indian cinema, yet transcends it to become something essential on a bigger level. If you have the chance to watch, you really should."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "mad_crack_scientist",
        "review_rating": "1",
        "review_title": "One of the worst, most mindless movies I have ever seen",
        "review_detailed_main": "The heroine grows up in a very restricted environment in a conservative family, and immediately landing at europe, she starts wearing unconservative clothes. The songs are mindless. And most importantly, the story gives a wrong information - stalk a girl, humiliate a girl long enough, she will fall in love with you.\n\nSuch a weak female character portrayal!!!! Such a shame!!!!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "amishra-aman-mishra",
        "review_rating": "10",
        "review_title": "best romantic movei ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "manikagarwal2",
        "review_rating": "10",
        "review_title": "a masterclass:a divine experience",
        "review_detailed_main": "the mastery attained and the cult following that it enjoys is simply depicted by the fact that it is still running non-stop, 1 show daily since '95 in mumbai.Also it collected over 120 crores 18 years back when films would collect in 8 figures only.... Watched it myself some 30 or more times but can still watch it with praise any no. of times... Its not just any other flick, its an experience n 1 to be felt at least once before leaving for abode above!!!! Superb creation.....Be it acting, comedy, supporting cast, laughs, cries, family values, freaking out,friendship,cinematography,exotic locales, never forgettable music,singers of calibre of lataji, costumes, father-son/father-daughter /mother-daughter relationship, script, dialogues, editing,direction, the effortless shahrukh khan,beautiful actress kajol and their top notch chemistry( considered to be one of the greatest ever on screen pairs of Indian cinema)-- it simply is way at the top.."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "yadavaditya-81642",
        "review_rating": "10",
        "review_title": "Best romantic movie of the millennium",
        "review_detailed_main": "Every thing associated with DDLJ is cult.Even after 23 years filmmakers still use,recreate and take inspiration from the film.Everyone,he or she,of any age should watch this movie at least once in there lifetime.You will be surprised to see that the film looks like it was filmed recently.This is the longest running film in the history of film making and holds a Guinness world record for the same.\n\nCome fall in love........"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "vikashsarangi143",
        "review_rating": "10",
        "review_title": "memorable classic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sasinghgl",
        "review_rating": "10",
        "review_title": "Greatest Romantic Movie of all time",
        "review_detailed_main": "DDLJ: A Flawless Indian Fairytale That Has A Definitive Repeat Value!\n\nDDLJ it's not just an abbreviation, but self-defining, stand alone word! It speaks volumes of a generation. It speaks volumes about romance and film making simultaneously. The film by YRF is one memorable film for it is uber romance. It is utterly endearing and cute. This film has a definitive repeat value.\n\nThe story of the film set in 90s revolves around two NRIs who happen to bump into each other during a Europe trip. Raj and Simran, the two immortal characters have a hate-hate relationship which later turns into undying love. However, Simran's father has vowed to get his girl married to his friend's son and so the family leaves for India. This is the time when the love dawns upon the two estranged friends and Raj sets out to win back his love, to make her his Dulhan!\n\nThe story of the film is a champion hands down for it hits the right notes and pitches for appropriate scenes and sequences. Speaking about the direction, it is a typical Bollywood potboiler coming from one of the most acclaimed banners, YRF. Aditya Chopra like his legendary father, Yash Chopra, spans the story from the snow-clad, sapphire kissed peaks of Switzerland to the lush yellow mustard fields of Punjab. The film has picturesque places that make it a delightful watch. Every scene, every dialogues, every expression has a recall value to it; so much that the \"train sequence\" is still aped by the filmmakers of the contemporary times.\n\nThe film unquestionably created history for it wasn't just the places, sequences, style that added an edge to the film but the performance and the music too made it an enchanting watch. Neither can we let go of the suave image of Raj and the nerd chic avatar of Simran nor can we let of the image of Simran's brawny father, Baldev Singh (Amrish Puri) whose eyes were feisty enough to spit fire or the image of a Raj's perky Pops Dharamvir Malhotra (Anupam Kher) whose squeaks often made us giggle. Pooja Ruparel as Chutki, Farida Jalal as Lajjo, Satish Shah as Ajit, Parmeet Sethi as Kuljeet, Mandira Bedi as Preeti, or be it Karan Johar as Rocky (Raj's friend) and Anaita Adajania as Sheena (Simran's friend), each character became immortal and is still etched in our memories. Why, the poem recited by Kajol is one famous piece from the film we can never forget, or even the dialogue, \"Bade Bade Desho Mein Aisi Choti Choti Baatein Hoti Rehti Hai\" still gives us a bizarre bliss as we say it out aloud.\n\nThe music by Jatin-Lalit created a roar and rung the chartbusters for weeks! It still remains one of our favorite romantic music albums. The film not only gave us a film worthy of repeat viewing but also the film's ensemble took immense memories back with them. When the film was recreated on the celluloid by tossing in the spices of the century with Humpty Sharma Ki Dulhania, it was proved that DDLJ was one epic love story, almost a fairytale which can never be remade!\n\nMany find the film clichéd. As for us, however, it is flawless in its approach and execution. It hits you with emotions as well as tickles you with laughter. We believe if this film was to compete against any fairytale, it would win without much ado for it is perfect blend of fairytale-esque romance with dash of comedy and punch of action."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Andy_totem",
        "review_rating": "10",
        "review_title": "Love is the essence of life",
        "review_detailed_main": "IT almost 1000 weeks i and don't know what more to write abt this epic which is still lingering in my memories.....\n\nWe love this movie cause we learnt to love from srk ..\n\nWe learnt to dream with kajol..\n\nWe learnt perseverance and patience in testing times..\n\nWe learnt to take life lightly laugh it out and accept that its OK to make mistakes , someday u will redeem yourself too and be forgiven..As srk would say \"bade bade deshon mein choti choti baatein hoti rehti hai\"....\n\nWe learnt values of our culture and importance of going to back roots even while enjoying luxury\n\nwe learnt to apologise when we hurt others\n\nwe learnt to live in love...\n\nDDLJ is one movie which gives me another reason to cherish the past .. Don't take life seriously...love laugh celebrate Life.."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "quampumsuperstar",
        "review_rating": "9",
        "review_title": "An old gem!!",
        "review_detailed_main": "Really enjoyed it and was fascinated at the ending"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "titanic_poseidon",
        "review_rating": "1",
        "review_title": "awful movie ever",
        "review_detailed_main": "this is the worst movie i have ever seen in my life. the acting is typical.the scenes were worse.the dialogues were so stupid and idiotic that i would like to close my ears when my brothers play it.the director tried to make a big money out of this stupid film.take TITANIC movie for example. the budget was too big and so was the profit. in future please try to avoid making such typical movies.this was a joke in the name of films. the Hollywood films are so grand especially the titanic movie. the song and the heart wrenching music of titanic is so suitable for the film but here the songs are idiotic. the story, oh please a very simple love story. this is and will be a third class movie."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "mohmdsaifullah",
        "review_rating": "",
        "review_title": "Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "snig_r1",
        "review_rating": "10",
        "review_title": "Best Bollywood movie till date",
        "review_detailed_main": "This movie is a typical and the best Bollywood movie till date- critically approved. It released in 1995 and it is still in theatres throughout the year. And if u haven't seen it yet, first of all, that's strange and secondly see it right away! King of Bollywood, Shah Rukh Khan, plays the male lead role of Raj Malhotra and Best Actress winning Kajol, plays the female lead role of Simran. Right in the start of the movie, Simran's dad sees Raj and his friends stealing foodstuff from his department store in the UK. Simran and Raj both fall in love on a tour in Switzerland. When Simran's dad comes to know about this, he is angry and sets Simran's marriage with someone else in Punjab in India against Simran's will. Back in India, Simran finally gives in to her dad's anger, but Raj doesn't. Raj befriends Simran's fiancée and then becomes popular with everyone, even Simran's dad. But when the truth of his love for Simran is spilt out, he gives up and is ready to leave. That is when Simran's dad believes that Raj is the right guy for Simran and let's her go with him. Thus they live happily ever after."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "dupelose",
        "review_rating": "9",
        "review_title": "kajol",
        "review_detailed_main": "The way kajol is flourishing here...... i could go on for days about her beauty, her gesticulation manners, movements, her facial expressions is everything, to my little achy breaky heart she brings joy. And srk is super kawaii."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "shafi_zeeshan",
        "review_rating": "10",
        "review_title": "a finest film",
        "review_detailed_main": "This films is the FINEST films i have ever seen, there maybe some great movies, which have given amazing performances, but this one was fresh when it came out and it epitomised the idea of love...\n\nIt really made everyone fall in love...Its been 10 years since its release, and it is still running in one cinema...\n\nPerformances by SRK and Kajol, really converted the characters on paper of Raj and Simran to a real Raj and Simran. They became from fictional love stories to real love stories. I characterise them as historic lovers like romeo and juliet, Sheree and farhad, laila majnu, and once again raj and simran..\n\nI give it my complete referral to this movie...This is my number one movie..."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "pec_hero",
        "review_rating": "10",
        "review_title": "DDLJ is The Greatest Movie Ever",
        "review_detailed_main": "Simply The Best Movie Ever...\n\n10/10\n\nI Have Watched This Movie More Than 1000 Times & Still Counting"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "aggarwalira00",
        "review_rating": "10",
        "review_title": "Watch it if you haven't, watch it again if you have!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sanahashamkhan",
        "review_rating": "10",
        "review_title": "Dilwale Dulhania Le Jayenge\" (DDLJ) is a timeless Bollywood classic !",
        "review_detailed_main": "The movie continues to captivate audiences even after more than two decades since its release. Directed by Aditya Chopra and starring Shah Rukh Khan and Kajol in the lead roles, the film is a beautiful blend of romance, drama, and family values.\n\nDDLJ tells the story of Raj and Simran, two young individuals who meet during a European vacation and fall in love. However, their love story faces numerous obstacles when they return to India, as Simran's conservative father wants her to marry someone else. The film beautifully portrays the complexities of love, tradition, and the clash between modernity and traditional values.\n\nOne of the greatest strengths of DDLJ lies in its brilliant performances. Shah Rukh Khan delivers a charismatic performance as Raj, capturing the essence of a carefree and romantic hero. Kajol shines as Simran, showcasing her exceptional acting skills and bringing warmth and vulnerability to her character. Their on-screen chemistry is palpable and forms the soul of the film.\n\nThe film also boasts a stellar supporting cast, with memorable performances by Amrish Puri as Simran's strict father, Farida Jalal as her loving mother, and Anupam Kher as Raj's understanding father. Each actor adds depth and authenticity to their respective roles, making the characters relatable and endearing.\n\nWhat sets DDLJ apart is its evergreen soundtrack, composed by Jatin-Lalit. The film's music has become iconic, with songs like \"Tujhe Dekha Toh Yeh Jana Sanam\" and \"Mere Khwabon Mein Jo Aaye\" resonating with audiences of all generations. The melodies perfectly capture the emotions of love and longing, enhancing the storytelling experience.\n\nAditya Chopra's direction deserves praise for its seamless storytelling and the ability to create memorable moments. The film beautifully showcases the picturesque locations of Switzerland and Punjab, enhancing the visual appeal. The screenplay strikes a perfect balance between romance, comedy, and emotional drama, ensuring that the audience remains engaged throughout.\n\nFurthermore, DDLJ's exploration of cultural traditions and the clash between generations adds depth and relevance to the narrative. It highlights the importance of love, respect, and the power of standing up for what one believes in, regardless of societal expectations. These themes resonate strongly with audiences worldwide, making DDLJ a universal tale of love and self-discovery.\n\nIf there is any criticism to be offered, it would be that the film adheres to some predictable tropes of the romantic genre. However, this does not diminish the overall impact of the film or its enduring appeal.\n\nIn conclusion, Dilwale Dulhania Le Jayenge is a cinematic gem that continues to enchant viewers with its heartfelt story, remarkable performances, and unforgettable music. It remains an essential watch for Bollywood enthusiasts and a testament to the timeless nature of love. DDLJ will always hold a special place in the hearts of audiences, and its legacy as one of Hindi cinema's most iconic films is well-deserved."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "irbazure",
        "review_rating": "10",
        "review_title": "The best movie ever",
        "review_detailed_main": "It's the best movie the love story of srk and sim is awesome the acting of all the team is perfect"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "riadulislam-09593",
        "review_rating": "4",
        "review_title": "Overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "dakhanna",
        "review_rating": "",
        "review_title": "not all that great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "MehdiRizvi-7867",
        "review_rating": "10",
        "review_title": "Beautiful Chemistry Of Kajol And SRK",
        "review_detailed_main": "Watch movieTrailers & clipsReviews Ratings 8.1/10 IMDb 100% Rotten Tomatoes Audience rating summary 5 4 3 2 1 4.7\n\n2012 ratings Rate and review Profile image Mehdi Rizvi Posting publicly.\n\nWhat do you think about this film?\n\nAudience reviews Filter by All Review menu icon Profile image Ritwik Ghosh a year ago\n\nDDLJ: A Flawless Indian Fairytale That Has A Definitive Repeat Value!\n\nDDLJ it's not just an abbreviation, but self-defining, stand alone word! It speaks volumes of a generation. It speaks volumes about romance and film making simultaneously. The film by YRF is one memorable film for it is uber romance. It is utterly endearing and cute. This film has a definitive repeat value.\n\nThe story of the film set in 90s revolves around two NRIs who happen to bump into each other during a Europe trip. Raj and Simran, the two immortal characters have a hate-hate relationship which later turns into undying love. However, Simran's father has vowed to get his girl married to his friend's son and so the family leaves for India. This is the time when the love dawns upon the two estranged friends and Raj sets out to win back his love, to make her his Dulhan!\n\nThe story of the film is a champion hands down for it hits the right notes and pitches for appropriate scenes and sequences. Speaking about the direction, it is a typical Bollywood potboiler coming from one of the most acclaimed banners, YRF. Aditya Chopra like his legendary father, Yash Chopra, spans the story from the snow-clad, sapphire kissed peaks of Switzerland to the lush yellow mustard fields of Punjab. The film has picturesque places that make it a delightful watch. Every scene, every dialogues, every expression has a recall value to it; so much that the \"train sequence\" is still aped by the filmmakers of the contemporary times.\n\nThe film unquestionably created history for it wasn't just the places, sequences, style that added an edge to the film but the performance and the music too made it an enchanting watch. Neither can we let go of the suave image of Raj and the nerd chic avatar of Simran nor can we let of the image of Simran's brawny father, Baldev Singh (Amrish Puri) whose eyes were feisty enough to spit fire or the image of a Raj's perky Pops Dharamvir Malhotra (Anupam Kher) whose squeaks often made us giggle. Pooja Ruparel as Chutki, Farida Jalal as Lajjo, Satish Shah as Ajit, Parmeet Sethi as Kuljeet, Mandira Bedi as Preeti, or be it Karan Johar as Rocky (Raj's friend) and Anaita Adajania as Sheena (Simran's friend), each character became immortal and is still etched in our memories. Why, the poem recited by Kajol is one famous piece from the film we can never forget, or even the dialogue, \"Bade Bade Desho Mein Aisi Choti Choti Baatein Hoti Rehti Hai\" still gives us a bizarre bliss as we say it out aloud.\n\nThe music by Jatin-Lalit created a roar and rung the chartbusters for weeks! It still remains one of our favorite romantic music albums. The film not only gave us a film worthy of repeat viewing but also the film's ensemble took immense memories back with them. When the film was recreated on the celluloid by tossing in the spices of the century with Humpty Sharma Ki Dulhania, it was proved that DDLJ was one epic love story, almost a fairytale which can never be remade!\n\nMany find the film clichéd. As for us, however, it is flawless in its approach and execution. It hits you with emotions as well as tickles you with laughter. We believe if this film was to compete against any fairytale, it would win without much ado for it is perfect blend of fairytale-esque romance with dash of comedy and punch of action.\n\n86 people found this helpful.\n\nReview menu icon Profile image satishchandra dhage a year ago\n\nToday's Special - The Iconic movie DDLJ - Dilwale Dulhaniya Le Jayenge marks 25th year, Released on 20th OCT 1995. What an Timeless movie... Words would fall short to describe about this Romantic Tale.\n\nThough we are kids when this movie released.. we have seen it in our teens & it impacted a lot. The movie which created a History, will be flourishing its magic through out the Indian Cinema. That's why it is still running in Maratha Mandir - Mumbai theatre from last 25 years & still on Sunday's it goes full as it holds a special place in every Indian Heart. I hope if lock down was not there.. It would have been released in Multiplex & I would have watched this movie again with my Family.\n\nEvery scene is a must watch..The Train Scenes (Train Missing Scenes), Teasing Scenes, Proposal scene, Songs, Dialogues, the character's part, Screenplay, Story, Direction.. Everything was designed exceptionally beautiful by Aditya Chopra & everyone has portrayed their characters brilliantly giving their outstanding performances whether it's SRK or Kajol, Parmeth Sethi, Farida Jalal, Anupam Kher, Amrishpuri, Mandira Bedi though how many times we c this movie... Everything looks fresh. Everyone fells in dream as the movie caption suggests Come Fall in Love. Lots of memories of many people are attached with this movie.. let's refresh our memories & watch it again.. DDLJ... COME FALL IN LOVE."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "gshanansari",
        "review_rating": "10",
        "review_title": "EVERGREEN LOVE STORY",
        "review_detailed_main": "It is the longest running movie in the history of world cinema.. more than 23 Years & Still running.. If You loved romantic love stories.. Then watch it.. Surely You will love it.. It's one of the Greatest movie in the history of indian cinema.. probably GOAT."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Proxiframe",
        "review_rating": "10",
        "review_title": "You can't help but fall in love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "A-Thunder",
        "review_rating": "10",
        "review_title": "A Moral Compass that has Spellbound me",
        "review_detailed_main": "It's been months (almost a full year) since I've watched this film, and I still can't stop thinking about it. Despite being someone with no relation to India, or even true understanding of its religion, cultures, and transitions at the time, I found myself hooked on the universal themes told and expressed in nothing short of pure brilliance throughout this film. It was more than a story of enemies to lovers, or even a tale between westernized first generation young adults and their parents' culture. It was even more than a story about clashing cultures. I think what captivated me was it was ultimately a story about love for family vs love for another. That is an experience that anyone can experience throughout this world, no matter where one is from or where one was raised. To take this theme a step further, it pits the two against each other and asks a simple yet life-altering question, if you had to choose, which would you choose? And if your family or loved one had to choose, which would they choose for you?\n\nI think what haunts me about this film is that it gets the answer right. It follows a moral compass that is discussed so rarely nowadays. It answers this question by having its characters take the harder path, the right path. Which ultimately reveals that selflessness is the answer to true love. A lover recognizing and respecting that the family is more important. And the family recognizing that true, selfless love is more important.\n\nNow, almost a year later, this film has galvanized me to reflect on myself and the way I view love. Even more so, it's inspired me to try to learn Hindi, look up and follow current news from India, and seek out a multitude of Indian films. I am ashamed of how little I knew or thought I understood about a culture other than my own before. I owe it to this film for opening my eyes and heart to curiosity and love."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "manyashah-23708",
        "review_rating": "9",
        "review_title": "It's a classic",
        "review_detailed_main": "Ok it is a long movie but it's just so simple to understand and that's good! If your feeling down then just watch this movie it's not funny but it's simple,traditional and also good for kids! Must watch if you live in Switzerland😉"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "saurabhkale-87135",
        "review_rating": "10",
        "review_title": "DDLJ",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ashishsharma-99769",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "Shahrukh Khan acting killed it. Songs character script direction everything is just awesome... Full packed movie... Watching Movie on loop."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "aishik-a",
        "review_rating": "3",
        "review_title": "THIS is the most overrated movie in the history of Bollywood.",
        "review_detailed_main": "Three stars just for the music. Other than that, it's just another unrealistic, problematic, melodramatic, mediocre \"romantic\" Bollywood musical. SRK fans over the years have given it a \"legendary\" status; many of them even gone as far as calling it the greatest Bollywood film of all time (and no, I'm not a Salman Khan fan).\n\nIf you are a fan of Shah Rukh Khan, go ahead and watch it for the 49th time, but if you're into more realistic, sensible cinema with a good script, direction and acting, just skip this one like Kuch Kuch Hota Hai and Kabhi Khushi Khabhi Gham."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "enguvasaranya",
        "review_rating": "10",
        "review_title": "All time blockbuster",
        "review_detailed_main": "One of the best film's Bollywood have produced. The story and songs were good. Both Shahrukh Khan and Kajol's jodi is amazing, and of course their expression's were really good. I was 15 years when this movie released in the theater I saw it back in 1995, and today I watched it again. Please this movie."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "stewary-11872",
        "review_rating": "9",
        "review_title": "Blockbusters",
        "review_detailed_main": "Very good. One of the most iconic movies of all time. A must watch for Indian movie lovers."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Rahul143125",
        "review_rating": "8",
        "review_title": "Dilwale Dulhania Le Jayenge - A Trend Setting Film!",
        "review_detailed_main": "DDLJ is a story about Raj(SRK) and Simran(Kajol) who met each other on a vacation to Europe and secretly fall in love with each other. But problems arise as Simran's strict father Baldev Singh(Amrish Puri) rejects the proposal as he had promised his old friend in Punjab that his daughter will marry his friend's son. Thus Simran and her family leave London. Raj's father(Anupam Kher) suggests him to make Simran as her bride. Raj learns that Simran has left London and gone to Punjab. Eventually Raj also goes to Punjab. Simran and Kuljeet's(Parmeet Sethi) marriage is fixed. Simran meets Raj in Punjab and both of them unite. Simran suggests Raj to elope from there but Raj doesn't accept the suggestion and tells her that he would make her father make Simran as his bride. Soon Raj befriends Kuljeet and gets an entry in his house. There Raj wins everyone's heart and makes a good impression on his family. After few weeks Raj's father visits Raj. But Baldev sees a photo of Raj and Simran together and realizes that he was the one who fell in love with his daughter. Baldev throws Raj and his father out of his house. AT the railway station Kuljeet gets some of his friends to beat up Raj. Thus Raj and Others get into a nasty fight.Raj beats up everyone, All the other family members including Simran arrive at the station. Will Baldev let Simran become Raj's bride or No?\n\nStory, Screenplay and Additional Dialogues penned by Aditya Chopra is outstanding. Truly the script is a masterpiece. Dialogues penned by Javed Siddiqui is as good as the story and screenplay, even his work deserves appreciation.\n\nSRK AND Kajol's performance in this is award winning. Rest of the cast has also done a fine job. All the expressions are portrayed in an appropriate manner.\n\nDirection by Mr. Aditya Chopra is FLAWLESS. His narrative style gives an good impression on the film. The other technical aspects also deserve appreciation.\n\nRATING: 3.5/4"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "disharma-24131",
        "review_rating": "10",
        "review_title": "Dilwale Dulhania Le Jayenge\" is a heartwarming, feel-good movie that has stood the test of time",
        "review_detailed_main": "\"Dilwale Dulhania Le Jayenge,\" commonly known as DDLJ, is an iconic Bollywood film released in 1995. Directed by Aditya Chopra and produced by Yash Chopra, the film stars Shah Rukh Khan and Kajol in the lead roles. DDLJ is a romantic drama that has become a milestone in Indian cinema and holds a special place in the hearts of millions of people worldwide.\n\nReview:\n\nStoryline: The film revolves around Raj (Shah Rukh Khan) and Simran (Kajol), two young NRIs living in London. Simran's father, played by Amrish Puri, decides to take his family back to India and promises her hand in marriage to his friend's son, despite her secret love for Raj. Unwilling to accept the decision, Raj follows Simran to India, and thus begins a heartwarming journey of love, family values, and traditions.\n\nActing: Shah Rukh Khan and Kajol deliver exceptional performances that are still revered as some of their best work. Their on-screen chemistry is electrifying, and they effortlessly portray the emotions of love, passion, and sacrifice, making the characters truly memorable.\n\nDirection and Writing: Aditya Chopra's direction and writing showcase a perfect blend of romance, drama, and comedy. The film balances its storytelling between the modern aspirations of the youth and the deep-rooted traditions of Indian families. The dialogues, penned by Javed Siddiqui and Aditya Chopra, have become iconic and often quoted by fans.\n\nMusic: The film's music, composed by Jatin-Lalit and lyrics by Anand Bakshi, is a significant contributor to its success. The songs like \"Tujhe Dekha Toh,\" \"Mere Khwabon Mein,\" and \"Mehndi Laga Ke Rakhna\" have become timeless classics, continuing to be cherished by generations of moviegoers.\n\nCinematography: Manmohan Singh's cinematography captures the scenic beauty of Switzerland and the vibrancy of Punjab with equal finesse. The visual appeal of the film adds to its charm.\n\nImpact: \"Dilwale Dulhania Le Jayenge\" had a profound impact on Indian cinema and culture. It redefined the romantic genre, setting new benchmarks for love stories in Bollywood. The film's portrayal of family values, respect for traditions, and the importance of true love struck a chord with audiences worldwide, making it a cultural phenomenon.\n\nOverall, \"Dilwale Dulhania Le Jayenge\" is a heartwarming, feel-good movie that has stood the test of time. Its endearing characters, memorable dialogues, soul-stirring music, and timeless romance make it an unforgettable cinematic experience. For fans of Bollywood, DDLJ remains an essential watch and a classic that continues to be cherished by generations."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "GypsiB",
        "review_rating": "10",
        "review_title": "A Must-Watch Film",
        "review_detailed_main": "Simran (Kajol) lives in London and is betrothed to the son of her father's best friend in Punjab. The summer before she is to be married, she takes a European rail vacation with friends, and meets Raj (Shah Rukh Khan). They don't realize that they have fallen in love until they have parted. Raj then follows Simran to India, determined to win her father's approval for their marriage.\n\nIn this romantic comedy/drama, family values and respect for elders is placed in high regard, even while portraying that the most hardened of hearts must be softened in the face of true love. Both Kajol and Khan are excellent in their roles, maturing their characters perfectly. The supporting cast is stellar. While there is no breath-taking choreography, the songs are lovely and memorable. The costumes, cinematography, locations, and sets are all beautifully done. Overall, this is a funny, sweet, and serious movie that is a must- watch for any Bollywood fan."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "babyfacecry",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "A movie to watch with Family and never gets bored with it"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "rtalreja-94933",
        "review_rating": "10",
        "review_title": "A Masterpiece of Epic Proportions",
        "review_detailed_main": "DDLJ is a masterpiece, even after almost 3 decades, the film seems hardly aged! The songs, the performances, the Romance, The locations are all still picture perfect and seem as if shot yesterday.\n\nShahrukh gives the best performance of his career and Kajol matches his every step. The supporting cast shines with Farida Jalal leading the baton and Puri and akher following suit.\n\nEurope, UK, Punjab - the locations are almost like central characters in the plot and influence the story and characters. What's stands solid is the ability of the director Aditya Chopra to manoeuvre the stark contrast of different cultures and continents with relative ease. He is able aided by the music director duo of Jatin Lalit who score westen tunes while the story is in Europe and switch to Indianised arrangements when the movie moves to India in the second half. Kudos to everyone involved in this masterpiece....clearly the Best film of Indian Cinema ever!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "vishal-vaibhav",
        "review_rating": "1",
        "review_title": "Suckiest Movie of all times!!!!",
        "review_detailed_main": "Cute movie, alright! Chicks as well as romantics will love it like anything! Anyway, in my opinion it is the cutest bullshit i have ever seen on the screen. It is a story of a couple misfits and hypocrites who keep harping about following traditional values when deep down they know what is its' worth. Anyway, Kajol is awesome in the movie but SRK is the lamest character; bullshit humor, lame portrayal of NRI youth! - wait, I think i went too far, SRK would have suited as Kajol's girlfriend in the movie and then as a lesbian love story the movie would have rocked. The bullshit melodrama made me sick to my stomach!!! To all the international spectators: Indian traditions are no where close to what was shown in the movie - see, for a soft hearted romantic there is nothing more sentimental as two true lovers(!!!) forbade to realize their dream and if that's what makes your eyes wet then you are the right kind of audience for this movie; as for me, it was nauseating as hell!!!! I somehow missed the whole point about the NRI thing - what had London to do with this love story or for that matter European landscapes????"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "avisheksahu99",
        "review_rating": "8",
        "review_title": "Hegemonies of trust on first flight to freedom",
        "review_detailed_main": "If trusts could boast of freedom companies with an independent board wouldn't cite mutual funds as USP of market localised to keep international business in abeyance unless lenient figment of monarchy rule populating political parties to licence businesses swearing by their clout as burgeoisie still. Communist Parties spot their timelines equivalently with religion on the other side buttressing maneuvers of revolutionary style with socialist wars of militaries of yore. If space shuttles still have to be made, if flip phones are technological advancements, if 5G is cornucopia for professionals on the loose off university's lien, they all can be made and made in time as long as fathers are fathers, mothers are mothers, siblings are siblings, and spouses are spouses out of line in socialist and modernist India with Sensex and Nifty on records to substantiate Nikkei 225 as family paradise still albeit with professionals deigning to its diktats to keep animal husbandry and first world agriculture their mainstay over first world calisthenics ratified thus as the mobile phone's day out in the sun."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "shreejonb",
        "review_rating": "10",
        "review_title": "Its 2020 i still love watching it.",
        "review_detailed_main": "This was my first movie in a theater. I was 5 years old. DDLJ is love. It exciting, its intimate, it witty, its Europe, it good music, its Bollywood, its everyone a love story ever wanted to me. And ofcourse its Shah Ruk's besy."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "AleksaandraPL",
        "review_rating": "10",
        "review_title": "2021: still lovable all-time classic",
        "review_detailed_main": "What an European can write in 2021 about this classic Bollywood love story?\n\nI watched it for the first time around 2008, with a couple of other Shah Rukh Khan's films, which as some novelty were then easily available in Poland. I liked the film and I have been keeping, out of sentiment, a few Bollywood DVDs, one being Dilwale Dulhania Le Jayenge.\n\nAfter years I rediscovered Bollywood. I re-watched some films, including DDLJ, and saw some more. Some of these older ones lost their former charm, but not DDLJ.\n\nFirst of all, it is still a lovable simple story of Indian boy and girl, both born and raised in England, who fell in love on holidays in Europe. The girl, engaged to a never-before-seen fiancé, moves with her family to India for her arranged marriage. The boy follows the girl determined to win the bride.\n\nAs far as I understand from some reading the film became the Indian all-time blockbuster not only due to its captivating story, memorable performances and music. It presumably had perfect timing. The director and story writer, Aditya Chopra, then 23 and whose it was a directorial debut, delivered a perfect product for India of that particular time undergoing major economic and social changes. The film set the pattern in Bollywood cinema for years, showed non-resident Indians in a new light and enthroned a new superstar Shah Rukh Khan.\n\nTo western audience, apart from romance, the film offers an easily digestible glimpse of popular Indian culture like originality of music, dances and costumes or introduction to some Indian traditions. It presents values like importance of the family over the individual and conflict between tradition and modernity, where characters' choices might be sometimes hardly understandable by a western viewer. At the same time one must be ready for Indian emotionality that affects acting and storytelling.\n\nIn 2021 for me the story is still touching. The film's favourite scenes have remained favourite scenes. The cinematography more or less maintains quality. Performances of Shah Rukh Khan and Kajol as Raj and Simran retain their charm. Kajol is just great. Shah Rukh Khan nowadays is a more mature and better actor. Some of his DDLJ scenes were overplayed with energy excess, giggling or crying, but it is repaid with brilliant ones or his personal charm. Amrish Puri and Farida Jalal are memorable as Simran's parents.\n\nSurprisingly songs are still fresh. \"Ho Gaya Hai Hujhko To Pyar Sajna\" and \"Tujhe Dekha To\" belong to my Bollywood playlists (although generally I am not fond of Lata Mangeshkar). \"Zara Sa Jhoom Loon Main\" is still funny with its \"drunken\" picturisation. \"Mehndi Laga Ke Rakhna\" is classic.\n\nSo I am able to overlook the story's weaknesses, technical deficiencies and some irks of the 90s, and fall in love with the film again.\n\nWatching Bollywood movies without DDLJ is incomplete. Motives from this film were remade in so many other productions. The film is also important to understand the Shah Rukh Khan's road to stardom, since that film made him a romantic hero. Without the DDLJ it is also difficult to understand Indian fuss about Kajol's and SRK's later on-screen reunions.\n\nHowever, nowadays I would probably not recommend it as a first choice for people who want to taste Bollywood. One must be ready to appreciate it."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "harun0123",
        "review_rating": "10",
        "review_title": "classic love story",
        "review_detailed_main": "this is the best movie i ever see.as DDLJ, is a 1995 Indian romantic drama film. It was written and directed by debutante director Aditya Chopra, produced by his father Yash Chopra, and stars Shah Rukh Khan and Kajol. The film tells the story of a young couple who fall in love on a European vacation, and relates how the boy tries to win over the girl's parents so that she can marry him rather than the boy that her father has chosen for her. It was filmed in India, London, and Switzerland.The story also aims to capture the struggle between traditional family values and the modern value of individualism.[22] Though Raj and Simran want to be together regardless of her father's plans for her, Raj tries to win over the father rather than simply eloping. In this and other Indian stories, family values are ultimately considered more important than the romantic plot. Individual desires have to take a back seat to moral values and rules of conduct.[23] The film implies that \"Indianness\" can be defined by the importance of family life: whether at home or abroad, it is the Indian family system that is recognised as the social institution that most defines being Indian.[8]"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "guharudraneel",
        "review_rating": "1",
        "review_title": "Unnecessary and overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "nadkarnisumeet",
        "review_rating": "8",
        "review_title": "Ushering in a new Bollywood era..",
        "review_detailed_main": "DDLJ review :\n\nA landmark film in Hindi cinema and a career defining role for its lead Shah Rukh Khan (SRK); Dilwale Dulhania Le Jayenge introduced the NRI romance in the mid '90s which was later lapped up by all filmmakers from the newbie Karan Johar (Kuch Kuch Hota Hai) to veteran Subhash Ghai (Pardes/ Taal). Debutant director Aditya Chopra made his own 'Sholay' with this one and like Ramesh Sippy, continues to be identified with this blockbuster hit.\n\nThe NRI romance between Raj (SRK) and Simran (Kajol) extends to the yellow fields of Punjab where Raj comes incognito to gatecrash Simran's engagement and whisk her away (as the title suggests)...but only with her strict dad's (Amrish Puri) consent. No eloping for them, please!! SRK-Kajol's chemistry was outstanding and this was their hattrick success after Baazigar (1993) and Karan Arjun (1995). The audience just loved them as a pair.\n\nAmrish Puri surprised in a somewhat positive role and his opening scene where he feeds the London pigeons and yearns for his hometown in Punjab makes for an awesome transition. The \"ghar aaja pardesi tera dil bulaye re\" chant is intercut to church bells by junior Chopra showing his expert craft over the medium. Undoubtedly, Jatin Lalit's musical score was the film's highlight and the screen at Gandhinagar's Rajshree Cinema suddenly illuminated with lights for a wedding like feel when the popular \"Mehndi lagake rakhna\" number played. That was my first viewing of DDLJ and I loved it so much that I went in again at Aurora Cinema, Matunga in April 1996 for a re-viewing. Enjoyed it just as much even in a relatively modest screen!\n\nAs for its much touted record run at Mumbai's Maratha Mandir, not many know that DDLJ released first at New Excelsior, CST as its main theatre in regular three shows and ran there for exactly fifty weeks (Golden jubilee). It then shifted to Maratha Mandir in matinee 11.30 am show and has been running there ever since for last three decades. So technically, DDLJ is a combined run record unlike Sholay which ran in regular three shows at the iconic Minerva for first three years from 1975 till 1978 and then another two years in matinee at same theatre till December 1980.\n\nHaving said that, DDLJ is an important chapter of Bollywood. It ushered in a new wave of cinema catering to the youth and NRI audience and also gave SRK his signature open arms step- something he milked dry right till his last release Zero (2018). I feel like visiting Maratha Mandir once again after writing this... ohh my!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "armanaman-88287",
        "review_rating": "10",
        "review_title": "Ddlj",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "india_ram",
        "review_rating": "10",
        "review_title": "Best movie and return the old time",
        "review_detailed_main": "The movie is still the best romantic old time hit, even after 26 years"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "eventlaunch",
        "review_rating": "10",
        "review_title": "What Bollywood used to be a fun time",
        "review_detailed_main": "Bollywood movies copying Hollywood are losing their core audiences because they're getting too serious in their movie making We see Bollywood movies to escape and have a good time"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "safaughawte",
        "review_rating": "10",
        "review_title": "Very good movie",
        "review_detailed_main": "Best movie made in the history of Bollywood 🙏💓 if you missed this movie then u missed best movie in Bollywood"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "saimonsisir",
        "review_rating": "10",
        "review_title": "best move i have ever seen.",
        "review_detailed_main": "I love this kind of move. i think this is the best move of india."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "farazali-43989",
        "review_rating": "9",
        "review_title": "Thoroughly enjoyable",
        "review_detailed_main": "Shahrukh Khan's best film till date. This is a film that I can watch anytime. Kabir bedi is excellent and does full justice to his performance in a dramatic and a stonishing role in the film. Songs are very good.\n\n😀 shahrukh is a very prepared actor not just that but also has the talent and maturity to do well in each and every film of his films. An incomparable and unique actor.\n\n🍎 kabir bedi-an actor who is accurate and to his perfection is noticable every time he comes on screen\n\nThere was a film of kabir bedi called kismat alongside govinda where he presented himself to be a very good villain."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Shakiul",
        "review_rating": "3",
        "review_title": "Awful Experience, Waste of time",
        "review_detailed_main": "Waste of my full 3hr time.. That's why i don't dare to watch bollywood movies even they're famous ones, u must be very selective and careful to watch Indian movie, otherwise your time will be wasted, their good movies are very few in numbers... These type of movie is considered one of the greatest movie of bollywood! really! then i can just imagine how lame their movies are! How can such movies be considered like must watch bollywood movie! Then i should say bollywood spectators are classless ones who have very poor taste in movies or they don't have any taste at all! I'm also surprised to see that much IMDb rating for such bullshit type movie!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ROGUE_DREAMZ@HOTMAIL.COM",
        "review_rating": "10",
        "review_title": "A movie that defines an era.",
        "review_detailed_main": "From the first time watching this movie when it originally came out till now I can happily sit there and be absorbed by the movie.\n\nIt builds the characters up nicely and you feel for raj and simran whilst they are in europe. Once they reach India the emotion is hyped up as to how they go about things.\n\nAmrish puri for me is the real star of the film. An actor sorely missed. That final scene is made by him. He once humorously said that he's the real hero of this film as raj is the one trying to take his daughter from him lol\n\nI honestly cannot recall a film on this level since then.\n\nThis film began the King Khan era. That is how influential it is on bollywood cinema."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "raahilkhalifa",
        "review_rating": "9",
        "review_title": "Dilwale Dulhaniya Le Jayenge Come Fall In Love Once Again Is Classic Romantic Film.",
        "review_detailed_main": "Even After 27 years this film will forever remain a classic romantic movie in the history of Indian cinema the beauty of this movie, the iconic blockbuster hit songs, Those Iconic Moments, The Unforgettable Climax, The Cast Performance, SRK and Kajol Chemistry. It Truly Is One Of The Best Indian Movies Ever Made In History And Is An Unforgettable Evergreen Beautiful Romantic Classic Movie. The Storyline Is Superb And So Is Aditya Chopra Outstanding Direction Everything About This Movie Is Top Notch I am 2000s kid and when this was released I never saw it in cinema because I was not born but growing up when I watched this movie in TV I loved it today I rewatched the movie on Amazon prime And I simply loved the movie and enjoyed every moment of this movie. It's one of the biggest blockbuster movies in Indian cinema and it is still playing at Maratha Mandir cinema 11am everyday which created record for the longest running movie ever.\n\nDDlJ is A Classic Romantic Outstanding Evergreen Super Hit Movie Which Is Forever One Of My Favourite Bollywood Movies Ever. 4.5/5 stars."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Mr_OSCAR-99",
        "review_rating": "8",
        "review_title": "One of the best romantic movies in history",
        "review_detailed_main": "Amazing movie, a good romantic story, the songs are very beautiful, but the movie is too long it could have been shortened a bit, SRK and Kajol did a wonderful performance."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "gurpreettoora",
        "review_rating": "10",
        "review_title": "Saw it in September 2024 for the first time",
        "review_detailed_main": "I was little bit amazed to see the acting, costumes and locations even in 1995 film. Screen play and story was awesome and SRK and Kajol did it fantastic.\n\nI never imagined that it would be that much nice but after this movie i seen some more movies of them both they did amazing Job, i don't watch Bollywood that much but this movie made me watch some other movies of end of the 20th century.\n\nNice movie, i remembered the songs but not that much fan of songs but i really liked that and understood why Bollywood is lacking now days because no one can do that acting and that screen plays.\n\nAnyhow it was nice."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "dwijvasavada",
        "review_rating": "8",
        "review_title": "Dilwale Dulhania Le Jayenge! - Evergreen",
        "review_detailed_main": "There's a reason why it'll always comes across as a breathe of fresh air. There's a reason why something about it is hopelessly hopeful. And the reason is that in every other sequence, DDLJ brings your ideal life's fantasy come alive on the the 70mm canvas. By the time Ruk Ja O Dil plays, the boy next door has answered the industry that he is undoubtedly the King 'Shah Rukh' Khan. He's a culmination of a son, a lover, a friend or just a prankster you wanted to become at some point in your 90's life. The love story finds a perfectly strong anti-hero in Amrish Puri who, with his stentorian voice, will bring justice to his righteous character. And by the time Tujhe Dekha plays, India has found its Romeo & Juliet in Raj & Simran. The veterans, Anupam Kher & Farida Jalal perfectly tone the plot with their dialogue deliveries & performance. With the threads of love, friendship, hope & purposefulness weaved into this fabric of timeless chronicle of romance, Dilwale Dulhania Le Jayenge will make you fall in love (all over again)! ‪#ddlj‬ ‪#bollywood‬ ‪#1000weeksofddlj‬"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "aromals-72975",
        "review_rating": "10",
        "review_title": "Watch and came fall in love",
        "review_detailed_main": "The best love Film i watched ever.when you see you will also tell 'best moive i ever watched' ."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ettanfan",
        "review_rating": "10",
        "review_title": "What a masterpiece item",
        "review_detailed_main": "An evergreen moviee.. fabulous movie no words to explain and i dont seen any demerita on this movie."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "CAMKG",
        "review_rating": "5",
        "review_title": "Magar ham is film ko bhool jaayenge",
        "review_detailed_main": "Because that is what it is: forgettable. It is not a typically bad film; average would be the best way to describe it. As I write this comment/review I notice that all of the 21 comments posted are positive, which is quite similar to 99.9 percent of the people I know who have seen this film. Well being a lefty myself, minority status is nothing new to me.\n\nDDLJ has some great very funny moments. The breezy romance part is also ok. But where the film falls flat is where many other films from the Chopra/Johar stable - like DTPH, KKHH, KKKG and M (that's Mohabbatein by the way) fall flat. They try to elevate melodrama that has the depth of a daytime soap to some sort of elitist civilization. And if this was being done for purely commerical effect, you could go along with it. But to interpret philosophies of life, love and society from such shabby and shallow material is insulting to the viewer.\n\nShahrukh Khan must be a great human being I am sure (most of the film fraternity thinks so) and because of his tremendous success, he has also achieved superstar status. But an amazing actor he is not. Versatile he is not. Character portrayal, he does not do. Hamming comes more naturally to him though.\n\nKajole's spontaneity has been better expressed in a film like Dushman where she actually does something other than use her cleavage to fall in love with Shahrukh (as in KKHH) or wear a miniskirt in the rain to show her conservatism (as is DDLJ).\n\nAditya Chopra's film is regressive, cliched and I personally feel that his brand of cinema causes tremendous damage to the impressionable teenager. Because many of them learn about romance and romantic relationships from it. And to think that you have actually spend your time and your money to view this.\n\nBut as I write this review in 2003, I feel optimistic that Johar/Chopra brand of filmmaking has lesser popular appeal today. The audience has shown that they want something different and more imaginative. And with there being such a high volume of releases week after week, the filmmakers are returning the nod of approval with extrememly imaginative screenplays, even though occassionally incoherent. As far as DDLJ is concerned, 5/10."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "saeedalsuwaidi-43414",
        "review_rating": "8",
        "review_title": "The movie",
        "review_detailed_main": "I still remember the year 1995, when my friend invited me to see this movie. That movie make me in love with Indian movies! I still remember this movie and it beautiful songs each time I watched a movie for the superhero Shah Rukh Khan or Kajol. It is a movie for young people about adventure, about love, about passion.\n\nThe movie Dilwale Dulhania Le Jayenge, Shah Rukh Khan and Kajol, revolves around two Indian families living in London. The daughter of one of the families (Simran) goes on a trip before she marries a man she does not know, and the son of the other family (Raj) goes on the same trip, to meet each other, and love falls between them. They both find the love of their lives in the other, but they have to overcome severe and powerful hardships that prevent them from connecting with each other.\n\nI don't think Bollywood is capable to make a film of this caliber, at least not in the near future!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "zshaikh-37318",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "Best movie with favourite actor...good story & last scene.. Wow"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "yobreezy-45179",
        "review_rating": "10",
        "review_title": "180 min of cinematic excellence that will remain unmatched for decades",
        "review_detailed_main": "Yash Chopra introduced a new era of Bollywood with this gem of a movie. Every musical sequences has been dealt with sheer beauty and simplicity with some attention to detail. Amrish Puri singing 'Aye Meri Zohra jabeen' is probably one of the best moments in Bollywood history. With current era of Bollywood remakes and unoriginality, this period piece will remain on the throne of being one of the most exceptional Cinematic filmmaking. A must see movie of simpler times where people would enjoy actual cinema."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "AdityaLovemovies",
        "review_rating": "10",
        "review_title": "All time favourite",
        "review_detailed_main": "One word - SUPER. My all time favourite movie. Must have watched it about 20 times. I go with 10/10"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "itssameerazam",
        "review_rating": "10",
        "review_title": "DDLJ- MOST ICONIC MOVIE OF INDIAN CINEMA",
        "review_detailed_main": "This movie is a trademark of romantic movie in bwood. Many people say it's overrated but it doesn't make them cool. The Bonding of RAJ &SIMRAN❤❤ Best onscreen pair.. SRK is just osm as always❤ Kajol just love her Every character was very good... And this is the most famous INDIAN movie ever... SRK U ARE KING👑"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "Kaatil29",
        "review_rating": "10",
        "review_title": "biggest bollywood movie till now",
        "review_detailed_main": "This movie is still running on cinemas till now from the day it released. This is the movie which changed the way of potraying love in indian movies. The movie which is loved by everyone for it's dialogues,songs,location & most importantly the chemistry of 'RAJ & SIMRAN'.(10/10)"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "adigupta456",
        "review_rating": "4",
        "review_title": "bad bad watch!",
        "review_detailed_main": "this movie is overly dramatic and has the same old boring story about a girl meets boy but the dad of the girl acts villain in the love story.The dialogues of the movie are clichéd and the lead actor, Shahrukh Khan has overplayed some parts.I don't understand why the filmmakers even bothered making a movie on the plot that has been so over exploited in the Indian film industry and worse,the audience liking it.\n\na total waste of time, energy and money.\n\nAn absolute no watch if you don't like the regular conventional stuff (read dramatic). This movie sucked, big time!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "smzr",
        "review_rating": "10",
        "review_title": "Romantic",
        "review_detailed_main": "Best romantic movie ever created. Never seen such a great movie."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "athulkhan",
        "review_rating": "10",
        "review_title": "Forever Remembered-- A timeless classic",
        "review_detailed_main": "Aditya Chopra's timeless classic will always remain in the hearts of Indian audiences worldwide. 'Dilwale Dulhania Le Jayenge' is going to be forever remembered as a timeless Bollywood classic that both established King Khan as one of the greatest romance actors and redefined the Hindi romance-drama genre.\n\nEverything, from the memorable soundtrack, fantastic performances of Kajol, Shah Rukh Khan, Anupam Kher, Ajit Singh, and the rest of the crew, is guaranteed to reserve a spot in your mind for a lifetime.\n\nThe storyline, in which Raj travels from Europe to India, in search of his true love appeals to the large, proactive Indian diaspora in all parts of the world.\n\nA must-watch for all audiences!!!!"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ajintvarghese1",
        "review_rating": "8",
        "review_title": "The Challenge of Tradition in a Relationship",
        "review_detailed_main": "Dilwale Dulhania Le Jayenge ,directed by Aditya Chopra, is a movie that really shows what love, traditions, and lasting romance are all about. Starring Shah Rukh Khan as Raj and Kajol as Simran, it's a film that many people love and has become a classic in Bollywood romance movies.\n\nThe way Raj and Simran connect on screen is amazing and has become a model for other movie couples in India. The music in the film, made by Jatin-Lalit, has songs that are still sang by fans decades later. Watching DDLJ is more than just seeing a movie; it's like going on a trip that celebrates true love at its best. It takes you to the beautiful fields of Punjab and across Europe's lovely scenes.\n\nDilwale Dulhania Le Jayenge is a treasure in movies that keeps on shining, showing us that fighting for true love is always worth it. If you believe in love, this is a movie you have to see."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "DrTarunPal",
        "review_rating": "10",
        "review_title": "Dilwale Dulhania Le Jayenge (1995): A Timeless Love Saga That Defines Bollywood Excellence",
        "review_detailed_main": "\"Dilwale Dulhania Le Jayenge\" (1995) is not just a film; it's a timeless masterpiece that has etched itself into the hearts of millions, transcending generations and cultural boundaries. Directed by Aditya Chopra, this iconic Bollywood romance has become synonymous with love and remains a cinematic gem even after decades.\n\nAt its core, the film revolves around the classic tale of love against all odds. What sets it apart, however, is the sheer brilliance in its storytelling, characterized by a perfect blend of romance, drama, and humor. The narrative unfolds with the charismatic Raj (Shah Rukh Khan) and the spirited Simran (Kajol), who find themselves entangled in a love story that defies familial expectations.\n\nOne of the standout qualities of \"DDLJ\" is its ability to strike an impeccable balance between tradition and modernity. The picturesque landscapes of Europe serve as a stunning backdrop, beautifully capturing the essence of newfound love, while the rich cultural tapestry of India forms the foundation of the characters' values and dilemmas. The film skillfully navigates the clash between tradition and individual desires, making it a relatable and emotionally resonant experience for audiences worldwide.\n\nShah Rukh Khan and Kajol's on-screen chemistry is nothing short of magical. Their performances breathe life into the characters, making Raj and Simran not just protagonists, but symbols of timeless romance. The supporting cast, including Amrish Puri and Farida Jalal, deliver stellar performances that add depth to the narrative.\n\nThe soundtrack of \"DDLJ\" is another highlight, with music maestro Jatin-Lalit creating timeless melodies that have become anthems for love. From the soul-stirring \"Tujhe Dekha Toh\" to the lively \"Mehndi Laga Ke Rakhna,\" each song complements the narrative seamlessly, enhancing the emotional impact of the film.\n\nWhat truly sets \"DDLJ\" apart is its impact on Indian cinema and popular culture. The film didn't just break box office records; it rewrote them. Its influence extends beyond the screen, shaping the way romance is portrayed in Bollywood. The iconic train scene, the mustard fields of Punjab, and the unforgettable dialogues have become ingrained in the collective memory of cinephiles.\n\nIn conclusion, \"Dilwale Dulhania Le Jayenge\" is not just a movie; it's an experience that encapsulates the magic of love, the clash of cultures, and the triumph of the human spirit. Its enduring legacy lies in its ability to transport audiences into a world where love knows no boundaries-a world that continues to captivate hearts with each passing year. This film is not just a classic; it's a celebration of love that stands the test of time."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "rnscinematicinsights",
        "review_rating": "8",
        "review_title": "A Musical Romance from Bollywood",
        "review_detailed_main": "\"Dilwale Dulhania Le Jayenge\" is a Hindi musical romance film released in 1995 and directed by Aditya Chopra. Although the film was made over two decades ago, it was recently re-released in France by @fridayentertainment.off, much to the delight of Bollywood fans. The cast of the film includes Shah Rukh Khan, Kajol, Amrish Puri, Farida Jalal, and Satish Shah.\n\nThe strengths of the film undoubtedly lie in the performances of the actors, particularly the chemistry between Shah Rukh Khan and Kajol, which adds a genuine flavor to the film. The songs are also a key element of this film, adding a musical touch that is often a trademark of Bollywood films. Shah Rukh Khan's irresistible charm is another highlight, adding an element of charisma and attraction on screen. Moreover, the film is an excellent feel-good movie that will make you smile and put you in a positive mood, whether you watch it with family or alone.\n\nHowever, there are also weaknesses in the film, including its length and unnecessary scenes that could have been trimmed to maintain a more brisk pace. This may test the patience of some viewers, although it is not necessarily a major issue for Bollywood fans who are accustomed to longer films.\n\nIn terms of immersion, the film does not have grand special effects or extravagant imagination, but this is perfectly understandable as it is a romantic film aimed at capturing the essence of love, without too many visual distractions.\n\nIn conclusion, I highly recommend \"Dilwale Dulhania Le Jayenge\" to romance and music fans, as well as anyone looking for an enjoyable film to relax and have a good time. My overall rating for this film would be 8/10."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "a_kamini",
        "review_rating": "9",
        "review_title": "Dilwale Dulhania Le Jayenge",
        "review_detailed_main": "This story seemed like a continuation of the story of Kuch Kuch Hota Hai where unrequited love again shows up as a chance meeting on an away trips for a group of young students. Likeness in culture prevails, and a bond forms between a Indian boy trying to protect for modern civilization the young Indian girl out in society overwhelmed. The two bond and fell in love only to be informed that a marriage is being arranged for the girl. The story is about the things that the boy does to either decide whether his feelings are strong enough to try to stop the wedding or kind and compassionate enough as a new friend of the future groom's to encourage a good marriage for someone he wanted to protect. His emotions took first place and he ruins the marriage and \"runs away with the bride\" giving retrospect to the title,\"Dilwale Dulhania Le Jayenge\" This again is the beauty of the Indian film, to show on screen the whimsical to those that might have said what if? So that they laugh and look beside them and remember that someone showed up for them already, someone that cared enough to share the hurt or happiness of such emotions, the already husband or wife."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sharkshankar-95510",
        "review_rating": "3",
        "review_title": "Just a depiction of a simple love story, overatted and illogical",
        "review_detailed_main": "This movie is a very good family entertainer. But it didn't surprise and amaze me, didn't find any new elements and different elements in it."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "bhshawon",
        "review_rating": "1",
        "review_title": "Typical bollywood movie",
        "review_detailed_main": "From it's rating I expected something better. But it's just another bollywood movie. Highly overrated."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "aayushnaval",
        "review_rating": "2",
        "review_title": "Ordinary Topic",
        "review_detailed_main": "NO DOUBT, movie was exceptionally good.\n\nBut since the movie industry has been started, a lot of movies had made on the 'love story of a boy and girl'.\n\nMany much phases of life has been unexplored due to this narrow concentrated topic.\n\nBut what is ahead of it?\n\nLove is not only a symbol of a boy and a girl but it's a unimaginable force of THE WORLD given by THE GOD and can be expressed through various mediums.\n\nIf this not then it would be unnecessary fights in movies but in real life non of this happens.\n\nI am considering it because it's not just for entertainment, it really impacts our lives.\n\nFor Example, in movies at that time, girls are wearing not only traditional but also western wear.\n\nAt that time of 90's in middle class families, generally non of ladies wearing western dress.\n\nBut after seeing that movies, kids or teenagers have been encouraged to wear not only traditional.\n\nAnd mentality of parents which were in 90's also changed and expected that, 'THERE IS NOTHING WRONG IN WEARING JEANS, GIRLS SHOULD HAVE FREEDOM'.\n\n'THAT IS WHAT THE REAL IMPACT OF MOVIES OVER GENERATIONS'.\n\nI want to see now movies on other great topics (something more realistic and aspiring).\n\nInstead of just (hum tum, ek duje ke liye type topics)."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "spaceofanas",
        "review_rating": "4",
        "review_title": "The BIBLE of creepiness.",
        "review_detailed_main": "Execution & story telling is good but the intent itself sucks.\n\nA man who stalks a girl can never be called love.\n\nAnd, leaving a marriage for a creep is a sign of dumbness and idiocy.\n\nBollywood really needs to redefine the concept of real love. This movie has brainwashed an entire decade of generation."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ghosharitra-59257",
        "review_rating": "1",
        "review_title": "Movie review",
        "review_detailed_main": "That same old Bollywood garbage. This is movie is not at all realistic"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "ankur-ab",
        "review_rating": "4",
        "review_title": "An typical average movie",
        "review_detailed_main": "More than 10 years after the movie was release i thought of putting my comments here. DDLJ as popularly known has surely redefined Indian cinema and its characters. However to me its just another average romantic Indian movie. This movie if at all belongs to Aditya Chopra only. The characters played by srk and kajol could have been played by any other actors as well. Same old Hindi dialogues, same old styles and why do srk replay same and same actor again? The songs are good, melodramatic and touchy. Few scenes in the movies are worth commending. However few scenes like the end fighting sequence were simply useless. This movie did marked a new carrer for srk, kajol and aditya chopra. srk has become a rage among girls. however it would be good for srk not to ride high on this. he should look to aamir khan and leagues of people like Big B. there is a lot to learn from them."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "chirag_shah775",
        "review_rating": "5",
        "review_title": "umm....",
        "review_detailed_main": "whats so great about this film that it continues to run in the movie theaters of India? Who continues to see this movie in the theater. More importantly, who goes to pay to watch this movie? Whats so amazing about the storyline...OK so a boy meets a girl...Raj and Simran meet in London. Simran must go back to India since her father is planning to get her married. raj goes to India to do whatever it takes to get the love of his life. OK, perhaps this was a good movie when it came out, and yes perhaps it is considered a classic, however times have changed. This movie is not close to international standards. It was entertaining the first time i watched it...Today it is nothing compared to black Friday, omkara, eklavya, and the many films bollywood releases."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sahil-62795",
        "review_rating": "1",
        "review_title": "Overacting karne wale awards le jayenge",
        "review_detailed_main": "The saga of illogical stupid overacted love story with unnecessary songs"
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "sumitbphc",
        "review_rating": "1",
        "review_title": "Romanticizing harassment and eve-teasing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "aliniyazmomin",
        "review_rating": "3",
        "review_title": "Uncanny resemblance to Before Sunrise",
        "review_detailed_main": "I don't know if it's just me but I find quite a resemblance in the two movies except for the endings of course. But the whole idea of two strangers meeting in an unfamiliar place(or a train as in both situations) and then finding that connection, is quite similar in both situations. Not to forget, even the clothes they are wearing are same. The situations they get themselves into, the church,the beautiful locales and everything. It looked that simple to me, take a great idea, 'Bollywoodify' it and there you go, you have a blockbuster. Plagiarism needs to be looked into. I am looking for times in bollywood where they at least acknowledge the source of their Idea. Like they picked Dead Poets Society and made a Mohabbatein out of it.The Music is one of the highlights of the movie. Watch it if you are a SRK fanboy. If you want to watch a good love story watch \"Before Sunrise\" where the idea of DDLJ came from,according to me! If you want a movie that's just to watch, enjoy and forget watch DDLJ. It just doesn't stay with you like Before Sunrise.I may seem like a bit partial towards Before Sunrise but I am sure if you watch both the movies, you wouldn't agree more."
    },
    {
        "movie_id": "tt0112870",
        "movie_name": "Dilwale Dulhania Le Jayenge",
        "movie_rating": "8.0",
        "review_username": "brijeshyadav19",
        "review_rating": "1",
        "review_title": "It's A Overdose of Punjabi And Pakistani Culture",
        "review_detailed_main": "It's been a 3 Decade,Now, but I couldn't complete this movie so far. May be I'll take another life to complete this Crap. So my review would've harsh, Sharp and Unpleasant for die hard fans of DDLJ. I humbly request them not to read my review from here.\n\n1. RK is an overhyped Bollywood actor. I've not seen his too many films except 'Dar' were I found his acting was justified.\n\n2. Kajol is such a dumb actress. No new millennials would associate with her.\n\nSynopsis - Spastikaran:\n\nThe movie came in 95' when most of the Indians started going abroad for Jobs. They felt lonely, missing Indian Cuisine, Maa ka Haath ka khaana, Padosi ki Ladki, School Ki Ladkiyan, Aur Falana Dhimkana. Mostly Indian Punjabi went to foreign and still going for jobs. KJO is a brand ambassador of Punjabi Culture. His uncle and brothers are the flag bearer of infusing Punjabi Culture in Bollywood. Pakistan is dominated by Punjabi Culture. Many Pakistanis are settled in Europe. They connected themselves with this Punjabi Movie. Hence, they started liking it. Also, because they felt very lonely in a foreign country. So all Punjabi Influenced their Indian Friends to watch this movie in India. It is easy to influence Indians if you are a foreigner or an NRI. In 90's if somebody from your family went to a foreign nation, People would give all their respect to them. No matter what job they were doing. It was an achievement those times. Now things are getting better but the mindset is same. So if an NRI would recommend something, no one had the guts to ignore him. Everyone start following blindly. They told their Countrymen to watch DDLJ and they watched. They told them it's a perfect movie and they agreed blindly. If a south Indian watches this movie he'll start abusing after watching for 5 minutes."
    }
]