[
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Not as terrible as I expected...but completely unnecessary.",
        "review_detailed_main": "In 1974, Lina Wertmüller brought out \"Swept Away\". It was a very usual film and it was an interesting parable about the class system. This movie was quite good...and rather shocking when it came to sexuality (this remake is far less explicit). And, in 2002, an unnecessary remake came out that was not so good...and fans hated it...hated it so much that it's currently #84 on IMDB's imfamous Bottom 100 list. This list consists of the lowest rated major motion pictures...ever! So is this remake that bad? Could it be?\n\nIn the original film, a spoiled rich lady is aboard a yacht and she treats the crew very badly. When she and a crew member are washed overboard, they find themselves stuck on a deserted island...and the class difference between them is sorely tested. Here, the plot is very similar though Madonna's character is even nastier and irritating...and to everyone...so much you wonder how she could have a husband and friends. I think they tried a bit too hard to make her unlikable...to the point where it seemed almost cartoonish....sort of like having Cruella de Ville aboard! Subtle, it sure ain't!\n\nSo, apart from Madonna playing the character too harhsly, what else was I not fond of in the film? Much of it is that in the original film, the story was about the couple. Here, however, it often seems to be more about Madonna. Not only does the film focus more on her, there's even a totally inappropriate and silly song and dance number...on the desert island...complete with a band!! Do I blame her for this? Not necessarily. The script was written by her husband at the time as well as directed by him. Ultimately, the blame would be Guy Ritchie's for having the part written so poorly. Oddly, the rest of the script is fine...and a lot like the original. Now I've seen several amazingly good Ritchie films...and perhaps it is just an example of why you shouldn't give your wife a starring role, as in this case he seemed to make it look more like a vanity project than a good remake. Overall, watchable and not as bad as its appearance on the Bottom 100 would suggest...but still a not especially good movie...especially because they changed the ending...thus neutering its message about class warfare! Instead, they avoided the anti-capitalist message and made the story all about love...and Wertmüller was apparently horrified that they'd done this.\n\nBy the way, casting Adriano Giannini as Giuseppi was really interesting, as his father, Giancarlo, starred in the original \"Swept Away\"--playing the same role (though the character's name was changed)."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "nycritic",
        "review_rating": "4",
        "review_title": "Overboard. Literally.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "secondtake",
        "review_rating": "3",
        "review_title": "It coulda been camp or parody, but it aims and misses as high romance.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Rather insipid if you ask me",
        "review_detailed_main": "I watched Swept Away having little else to do, and part of me wished I had read a magazine or an opera DVD instead. Swept Away has few, if any at all, redeeming qualities at all, and there were times where I wished I could turn off the television but reminded myself that is not a fair way to judge a movie.\n\nGuy Ritchie's direction for starters is very unimaginative, and the camera work and editing don't have any real charm to them, the camera work is not amateurish as such but shows nothing out of the ordinary, and the editing could've been smoother at times.\n\nThe script is very hackneyed, the comedic elements are forced and the romantic elements sappy. Also it has the feel of a bad 70s TV drama. The concept has been done to death but that wasn't necessarily a turn off, but the pace is turgid and the story itself doesn't have any interest at all.\n\nLikewise with the characters. They don't feel like characters or real people at all, just overdone caricatures. Jeanne Tripplehorn gets the worst of it, and her overdone performance suffers from it. Madonna only so far has impressed me in Evita, but her performance here is lifeless and disengaged here.\n\nOnly two things have any real spark. One is the striking scenery and the other is the earthy charm of Adrianno Giannini. However these two are not enough to salvage the movie from being an insipid bore. All in all, not recommended. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "saint_barbie",
        "review_rating": "1",
        "review_title": "It's much worse than you can possibly imagine",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "MarieGabrielle",
        "review_rating": "1",
        "review_title": "Rent the Lina Wertmuller original...",
        "review_detailed_main": "and forget this. Completely. If you really need to see Madonna act, rent \"Body of Evidence\", at least Willem Defoe is in that one.\n\nIn this film, while the sets are beautiful, you may want to mute the dialog. You won't miss anything. Bruce Greenwood is wasted, Jeanne Tripplehorn is a prop, and Madonna is so awful, it becomes amusing. Why they had to butcher the original film into this mess, I will never know; guess they thought it was \"bankable\". Madonna, as an actress, certainly is NOT.\n\nIf you rent the original film from 1979, though, you will enjoy it, and the actors in it can actually act. 1/10."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "jack-310",
        "review_rating": "1",
        "review_title": "terrible",
        "review_detailed_main": "I really wanted to like this movie because the critics have been unkind\n\nto it (to say the least)... but it was terrible. Really terrible. Badly\n\nacted, a witless script, cack handed direction... Watching this film was\n\nlike watching a car crash- you want to look away but you keep staring\n\nbecause you want to see how messy it's going to get. Well, the car is\n\nwrecked and there are no survivors. On the plus side, the cinematography\n\nwas nice, made me want to go on holiday, if only to cleanse myself from\n\nthis unholy"
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "bronty",
        "review_rating": "1",
        "review_title": "Why does the woman even bother anymore...?",
        "review_detailed_main": "I almost saw this at an actual movie theatre (an art-house theatre, no less!) but couldn't make it there in the one whole week it played, but yesterday I finally saw it on cable and...well...I wasn't disappointed, that's for sure! Madonna has done it again: YET ANOTHER BOMB! When will this woman learn? When will the studios learn? (Or perhaps they already have, since this film was largely dumped, with little fanfare and deadly word-of-mouth.) One would hope that being directed by her talented husband, who's created some interesting and/or terribly entertaining work, would bring out the same quality Madonna showed in \"Desperately Seeking Susan\"; alas, it just isn't meant to be, for here she is, at her very worst: singularly convinced of her own greatness, the smugness permeating every frame she's in, made all the more unbearable by her wavering faux-British accent, an accent that only underscores the fact that her speaking voice is immature in quality and not especially pleasant. This may sound unnecessarily cruel but LISTEN to the woman, and LOOK at her films of, say, the past decade: like a latter-day Bette Davis, there is an unmistakable brittleness to not only her carriage but to her very face and body, which here, despite the warm photography displayed throughout the film (perhaps its only saving grace), are done no favors. To her credit, the entire affair is so misbegotten that one wonders if the world's greatest actress on her best day could do anything with this mess. No one involved escapes unharmed: Bruce Greenwood actually seems pained to be on-screen, though poor Jeanne Tripplehorn seems to carry herself as if she's actually in something good, which had me thinking all the while, \"Denial ain't just a river in Egypt!\" Adriano Giannini, son of Giancarlo Giannini, star of the Italian original, \"Swept Away...\", is, like his father before him, immensely attractive, and isn't altogether bad (despite winning a Razzie nomination for \"Worst Actor\"), but, like almost everything else about this production, it all comes back to Madonna, on whose shoulders rest the blame. Why her? Why not her husband, director Guy Ritchie? Just who do YOU think was behind this remake? What actress wouldn't want nearly every shot of a movie to be centered on her, with only a relative nobody sharing the screen? Oh sure, Ritchie deserves some blame: surely he - or someone - ANYONE! - should have, and could have, taken his lead aside and insisted on something bordering on ACTUAL FEELING in her line readings (for her performance is so wooden it's a surprise the rest of the cast didn't get splinters), or at least display a semblance of warmth...but she seems resistant to be anything but a cinematic black hole. Above and beyond anything else, this is strictly a vanity project for its star so she is ultimately accountable for it. A film like this, an \"Odd Couple\"-ish, war of the classes, should be light and fun, with leads who can bounce off one another with witty, even romantic, dialogue, for what else can a film whose plot involves two disparate people stranded, really be? Honestly, I don't think anyone involved knew exactly the tone they were trying for; it succeeds neither as comedy (I defy you to laugh even once) or romance (Madonna's ice-princess routine precludes ANY chemistry). It's not even bad enough for us bad-movie lovers to enjoy. A real shame..."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "majikstl",
        "review_rating": "",
        "review_title": "Swept aside...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "fmc-62580",
        "review_rating": "6",
        "review_title": "Not as bad as others are saying",
        "review_detailed_main": "Too many folks seek to make a name for themselves in their writing of movie reviews. I've seen movies which I was pained to try to make it to the end, this was not that.\n\nEveryone is getting too wound up about this movie. It is not in contention for an Oscar but I don't believe that was their intention. The movie is enjoyable, the beautiful settings are well shot, and the characters are adequately developed. Overall, not a bad way to spend an hour and a half. I'd actually watch it again."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "srvblooze",
        "review_rating": "1",
        "review_title": "This movie gives dreck a bad name",
        "review_detailed_main": "This is perhaps the worst movie I've ever seen, and I've seen Gigli. It is, however, unintentionally hilarious and as such is worth viewing with friends and some drinks while making jokes all the while- ala Mystery Science Theater.\n\nAt our party we made a game of it by taking a drink when certain things happened. Shot of Madonna's biceps? Everybody drink!\n\nIf you decide to do this and you want to get really hammered, try taking a drink every time Madonna says something in her fake British accent. You'll be drunk in no time and then - BONUS! - the movie won't seem as horrific as it really is."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "patiucristina",
        "review_rating": "9",
        "review_title": "Funny and enjoyable movie",
        "review_detailed_main": "I must state I didn't see the original and I am amazed by the low ratings of this movie.\n\nAfter watching it, both me and my husband said we are sorry such movies aren't made anymore.\n\nFunny dialogs, characters and nice love story that can't survive in this word.\n\nI totally recommend it. Just enjoy it, with no made up mind on Madona or being a remake, etc."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "justicej",
        "review_rating": "7",
        "review_title": "Thought provoking",
        "review_detailed_main": "The critics were spineless in their analysis of this movie. Typically, critics posture as examples of open-mindedness, but quickly turn hypocritical when a story takes a view contrary to their own brand of en-vogue political correctness.\n\nThe media is perfectly willing to jump up and applaud dramatic material exploring social taboos ranging from child sex to four thousand different types of murder, but when it comes to exploring the raw and uninhibited relationship between a man and woman on a desert island, and the primal gender characteristics that evolve the relationship, they get scared and run for cover - because it does not promote their ever-chi chi uni-sexist agenda.\n\nWhile not the best made film of 2002, this movie was actually an interesting story with a powerful statement about society, love and relationships, and on its own, takes a radical and even liberal look at these critical elements of our everyday lives.\n\nIn their run for cover, aside from directly and personally picking on Madonna and `her husband,' the socio-politically driven critics tended to haphazardly pick at various elements of the movie such as:\n\nThe film appears washed out - in my analysis, with this, the director found he could evoke a mood in the audience utilizing this effect. The white wash look imposed a hot, desert like feel which created a dry distaste of the lives the aristocrats were living. It sets up an underlying melodramatic tone that exudes in Madonna's character and reflects the harshness of her current life. Utilizing non-standard film traits is consistent stylistically with other Guy Ritchie films.\n\nMadonna is too melodramatic - once again, intentional flavoring that adds contrast as her character arcs throughout the film. It also sets up the humor we find in her drastic transformation. It is only because she was a `super bitch' before that we can at first enjoy when the tables are turned. Our enjoyment, of course, quickly turns to concern when we feel that Giuseppe goes too far by our standards.\n\nUnintentional humor - perhaps the audience is laughing at the very right time, yet the intently politically correct critic is simply offended that the audience finds these moments funny.\n\nThe plot is improbable - welcome to movie land. The majority of plots and stories in general are improbable.\n\nAbout half the critical reviews I read admitted the reviewer's real problem with the movie and positioned the subject matter as dated, antediluvian, archaic, etc. This reflects their own fear that the movie might allude to some uncomfortable truths about human nature.\n\nSwept Away simply, but brilliantly breaks two people down into their primal roles as a man and a woman. In the film, absent the rules of a structured society, the physically dominant man assumes a role as the hunter gatherer and uses/abuses this dominance to subordinate the female character that once tormented him. The woman, Amber, who had found her previous plastic life to be unsatisfying, falls dependant on Giuseppe and uncovers a deeper meaning to her existence in the form of an animalistic carnal attraction that surfaces and drives her to a passionate relationship with him. The movie, unfitting with modern social mores, suggests that innate gender biased traits can form the basis for truly passionate and meaningful love.\n\nIf we expound on this, the message is that men and women are inherently different and naturally gravitate to different roles in a relationship and that society, at least in some instances, can interfere with these deep rooted urges.\n\nIt is a gritty, believable, yet a bit uncomfortable suggestion that perhaps gender roles do offer some reward in society. It was enjoyable to watch, humorous at times and a little painful at others. I give the director the benefit of the doubt and can assume that I was guided well through the story.\n\nThe movie is far from perfect in that we don't particularly empathize greatly with any of the main characters, at least until the final few scenes of the movie, though I am not sure we are supposed to. Much of the dialog was not properly updated from the 70s to the 00s - the discussion about `chemicals' for example. Also, there are some embarrassingly poorly made scenes - such as when Amber and Giuseppe are supposed to be zipping along in a speed boat and there is not such as a hair moving on their heads, and every scene where the Mediterranean looks about as wavy as a backyard pool\n\nOne thing is for sure - the subject matter is surprisingly thought and discussion provoking and the movie is better than 98% of the other new release rentals out there. Rent it and talk about it."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "eminkl",
        "review_rating": "2",
        "review_title": "Within the first five minutes of the film, we hate Madonna and she lacks the ability or personality to recover any ground.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "isotope2112",
        "review_rating": "1",
        "review_title": "God, no... Please make it stop!",
        "review_detailed_main": "This movie was ridiculous, boring, and poorly acted. I loved some of Guy Ritchie's other films (notably Two Smoking Barrels & Snatch), but Swept Away was just bad. It came nowhere close to the original. Once they were on the island I found myself hoping in vain that there would be someone else on the island to prevent Madonna from being in every scene. Cannibals would have done nicely...\n\nThis is the first movie I have ever walked out of before the end. It was that bad. I read an article yesterday where Madonna said she was going to focus more on her family. Here's hoping she sticks to that. Biggest surprise of Swept Away: at 44 Madonna still looks pretty good in a bikini. 1/10"
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "pattay72",
        "review_rating": "",
        "review_title": "Swept away by the awfulness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "joseyanguas2",
        "review_rating": "1",
        "review_title": "Don't let appearances misguide you...",
        "review_detailed_main": "It looks terrible when you read the synopsis and then discover that Madonna is on it, but the movie is actually ... much much worse than you could ever imagine. My wife chose it, and none of us could continue watching it after 30 minutes or so."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "LegolasGreenleaf",
        "review_rating": "1",
        "review_title": "Worst film ever made.",
        "review_detailed_main": "I don't know what some of you are smoking, but i suspect it's potent.\n\nTo call Swept Away awful would be an insult to the very concept of terribleness. The acting is hideous and i'm not picking on Madonna here, we all know she's useless, but someone should have warned everyone else that her ailment is contagious. My back literally hurts from cringing so much at poorly delivered lines. The editing is so sloppy, it beggars description. The photography and composition (which in this era, competence should be a GIVEN for any film with a budget) are astonishingly inept, even the lighting is horrid and unnatural looking. These are BASIC elements of filmmaking, if you can't get them right, you should seek another line of work. It's as contrived as a grade 3 production of Snow White, except nowhere near as well made or interesting.\n\nThe original film by Lina Wertmueller is a wonderful satire and metaphor, superbly acted and written, featuring breathtaking visuals - you can practically taste the sea salt and feel the windswept sand in your hair. The sexual tension feels real and immediate...those of you who found Guy Ritchie's version deplorable, should see it, it really is one of the landmarks of world cinema.\n\nThose of you who thought the remake is some kind of masterpiece should have your heads examined."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "jaimewender",
        "review_rating": "1",
        "review_title": "honestly sickening",
        "review_detailed_main": "Okay so yes. the woman sucks. she's an elitist. but the way the male lead physically and sexually assaults her into submission is beyond. it's disgusting and i cannot believe this movie was made in the 2000s and considered a \"romantic comedy.\" if it was made today, there would be outrage. I'm outraged. k thanks."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "tmolthan",
        "review_rating": "1",
        "review_title": "Madonna's \"acting\" is still a joke!",
        "review_detailed_main": "No doubt, when Madonna and Guy Ritchie married, it was because they both thought it would help their movie careers. If you've been through the ordeal of watching \"Swept Away,\" then you know at that level it was a match made in hell. After nearly 20 years of trying to become a respected actress (or \"octress\" as she might have pronounced it in \"The Next Best Thing\"), she still can't get out of herself long enough to turn in a performance that anyone with taste could even call decent. And that's the thing that makes people dislike her so much on the screen: that gut feeling that her ego is so inflated that it prevents her from being able to just let go and connect with her audience. If there's any justice in this universe, she just blew her last chance."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "deawellyn",
        "review_rating": "7",
        "review_title": "A fun and lovely movie!",
        "review_detailed_main": "I must say that majrotiy critics are just wanna-be, trying to sound smart using as big words as possible - to a point where we could say they are philosophers for phisolophy sake - and that's about it. Very few actually give ratings that I agree with. However, before I write my thoughts about this movie, let me just put my taste in certain brackets - I don't believe with high rating of particularly old movies, I'd say that for each passing 2 decades a point in review should be stripped. Also, on imdb there has to be a score of 7.0+ that movie is actually watchable for me almost always and it has to be below 2.5 that I dislike it. Anything in between, I can agree or disagree with with up to + or - 5 points. There you have it. Now to this movie itself - I caught it on regular TV programme and just began watching it without expectations or knowing original and - I stick with it till the end. I laughed in between a lot and I generally really loved the story. Acting is nothing spectacular, but not bad and music and scenery is just downright gorgeous. So - story and acting fits into average, movie is very watchable, entertainment level is way above 50% average and as already pointed out scenery and music is top 10 %. All together a good 7/10 - and when it came around on TV again nearly a decade later, I thoroughly enjoyed it yet again. I actually decided to give it a review only because I so strongly disagree with negative bandwagon about this movie and if you value yourself just a little and are not sheepish type (following lead without question) - give this movie an honest chance it deserves. Chances are, you'll have fun 90 minutes!"
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "KelticKarma",
        "review_rating": "1",
        "review_title": "Ignore the reviews from Plants",
        "review_detailed_main": "I had the (mis)fortune to see this film at a showing in the US. Having reluctantly sat through the entire abysmal thing, I am shocked to have seen so many good reviews here on IMDB.\n\nThe original film was a turkey, but an interesting one. It fitted into that early seventies, post 1969 revolution thing; this film just stinks of....... , well, nothing really. It's that bad.\n\nImagine a badly done perfume commercial - see what I mean ?\n\nMadonna never could act, and has been an embarrassment on the big screen for years. She looks worse and worse with every one of those years, increasingly coming to resemble a skinned meerkat.\n\nGuy Ritchie, who has built his \"reputation\" on Lock Stock, could never direct either - his movies are shallow, badly cut, fashion shows. He doesn't disappoint here either; he wisely cast his wife as the star of this debacle.\n\nPlease people, take little heed of the good reviews this movie has received from other posters below. They are quite obviously business plants.\n\nDon't encourage Ritchie to humiliate himself further by giving him money."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "LadyGlamSlam",
        "review_rating": "9",
        "review_title": "It's no Casablanca, but it has heart.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "c_luttrell-485-182281",
        "review_rating": "7",
        "review_title": "This whole \"Madonna can't act\" bit got tired 20 years ago",
        "review_detailed_main": "I'm the first to admit when Madonna is bad in a film & she has released some stinkers (Shanghai Surprise) but this is far from her worst and there have been many, more commercially and critically accomplished actresses who've turned out worse films. Swept Away was passable and has some funny and touching moments. The problem is it's Madonna and most people come to a Madonna movie with pre-conceived notions that render them incapable of being objective."
    },
    {
        "movie_id": "tt0291502",
        "movie_name": "Swept Away",
        "movie_rating": "3.6",
        "review_username": "Drxtc",
        "review_rating": "1",
        "review_title": "More Truth than Dare",
        "review_detailed_main": ""
    }
]