[
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "eh5963-297-967354",
        "review_rating": "8",
        "review_title": "Entertainment at its best",
        "review_detailed_main": "Bring out the popcorn, grab a cola and get ready for 2 and a half hours of laughs, songs, color, emotions, and spoofs. If you're a fan of the Indian film industry and have kept up with the news, Om Shanti Om is for you. If you love entertainment to the max, OSO is definitely for you! Farah Khan's Om Shanti Om spares nobody, not even its makers when it comes to poking fun. OSO is a film about films, it's a film in a film and above all, it's made to celebrate the biggest film producing industry - The Indian Film Industry.\n\nOm Prakash is a junior artist who thrives to become a lead hero one day. He is a horrible actor and has a mother who hams more than him. Om has another dream: To win over a star, Shanti-Priya. One circumstance leads to another which leads to Om being a witness to the death of Shanti by producer Mukesh Mehra. Om also gets killed in the incident. That same night, Om is reborn as Om Kapoor. Will Om realize his past-life? Will he avenge Shanti's death? As the tagline suggests: For some dreams, one life-time is not enough.\n\nOSO has a done-to-death story. But that's not the point. The film is a parody of films and the ones working in it. Notice the spoofs on the yesteryear stars such as Manoj Kumar. A controversial scene but one can't deny it's hilarious. Not to forget spoofs on Govinda, Keshtu Mukherjee, and Suraj Bharjateeyaa. Of course the most memorable comic scene has to be SRK pretending to be a south Indian actor. \"Mind It\" OSO's first half is gripping and keeps the viewer alert. The drama folds the right way. The second half loses steam at times. It's not bad, but unlike Farah's first film where the second half competed well with the first, it stars to slow down a bit. It picks back up, fortunately.\n\nThe spoofs aren't less hilarious in the second half. The film pokes fun of a lot of celebs and Indian film industry issues. To start, SRK being late is a spoof on himself being late to sets in real life. Not to forget the whole dard-e-disco song is a spoof on item numbers. The high point of the second half has to be the award ceremony. The spoof on Abhishek Bachchan is subtle yet funny. SRK doing the same roles and being nominated is remarkably funny. Not to forget Akshay KUmar's outburst at the awards is aplaudworthy and rib-tickling. Subash Ghai-Rishi Kapoor spoof is funny too.\n\nFlaws? As mentioned, the second half falters in some parts. Also, SRK remembering his past so quickly seems rushed and unconvincing.\n\nThe climax, however, is a pleasant surprise.\n\nSpecial Mention - The Deewangee song is a treat to the eyes. 31 stars in one song is no joke and they all look nothing short of spectacular. Special mention to the ones that caught my eye with their appearance. Dharmendra, Jatendra, Kajol, Salman, Saif, Sanju, Rekha etc all do well alongside Shah Rukh Khan.\n\nFarah Khan and her team of writers have put some genius into parts of the movie. The writing is witty, smart, and quite innovative. Dilague is first rate.\n\nVishal-Shekar's music is amazing. With a variety of songs in one film, they do a wonderful job.\n\nFarah's direction is first rate. She handles all the moments with ease. It's not a better film than Main Hoon Na, but still a good job.\n\nIn 2007, 3 months before OSO released; SRK unleashed the actor in him and kept the star away in a movie called Chak De India. In OSO, it's the opposite. OSO is a film where SRK can chill and not worry about the criticism. His performance is explosive and energetic. In this, it's SRK the superstar unleashed. And kudos to him for also poking fun at himself despite being the producer of this one.\n\nDeepika makes a grand debut and I'm sure she couldn't have asked for anything else. She looks gorgeous and makes a good debut. Arjun Rampal is spectacular as the villain here. Brilliant.\n\nThe supporting cast does well too which includes the lovable Shreyas Talpade, the scene-stealing Kirron Kher and Javed Sheikh.\n\nOverall, A grand film which has one objective - Entertainment!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "oldgirl",
        "review_rating": "8",
        "review_title": "So much fun",
        "review_detailed_main": "I'm an American, and have not seen very many Bollywood films -- Three Idiots, Saariwaya, and one or two others in passing -- but I know a spoof when I see it. This movie was a romp -- overdone theatrics, over-the-top musical numbers, and lots of wink-wink-nudge-nudge allusions. Actually, I probably missed most of those -- but I got enough of them to keep smiling all the way through. Nicely plotted, plenty of really good catch-lines, and warm-hearted at the core. I especially like the end credits, where crew members and the usually faceless support people did a kind of 'red carpet' appearance, to the applause and cheers of the mob. Great bit at the very end, where the director/writer got out of the tuk-tuk for her moment, and everybody was .... well, no spoilers here. Just watch the film. Well worth your time."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Peter_Young",
        "review_rating": "8",
        "review_title": "The grandest masala show. The result: LOL!",
        "review_detailed_main": "Reincanation, Hindi cinema, love, betrayal are some of the themes Farah Khan's delightful and crazy comedy Om Shanti Om deals with. But frankly, it never really matters. This film is simply one of the most entertaining films made in recent times. A spoof of Hindi cinema of past and recent times, the film both pokes fun at it and celebrates its unique, inimitable style. As the story progresses the movie becomes even more alluring. It is at times a drama, at times a thriller, but generally it is just a musical comedy which is not to be taken seriously.\n\nTechnically the film is very impressive. Farah Khan's direction is very good. The film is extremely colourful, with great costumes and fantastic, glossy sets. The 1970s settings are particularly authentic and visibly well-invested. One more aspect which helps to recreate the magic and the atmosphere of the 1970s is the wonderful soundtrack. \"Dhoom Taana\" for instance seems to have been rightly taken from a film of those times.\n\nThe film contains numerous sequences which will have you floored. The Filmfare Award ceremony is one of the funniest sequences in the film. The red carpet scene with celebrities predicting the winners was very funny. The next scene which includes the ceremony and the Best Actor nominations clip was absolutely hilarious. I could not stop laughing as every nominee was unfolded, and Abhishek Bachchan and Akshay Kumar's reactions when they lost were awesome.\n\nThe following sequence was the after-party which was another memorable scene. The famous \"Deewangee Deewangee\" song which has some of the best-known actors in India dancing to its tunes, from Dharmendra, Mithun Chakraborty, Rekha and Shabana Azmi to Salman, Saif, Juhi, Urmila, Tabu, Kajol, Rani and Preity, was very exciting and a pleasure to watch. It was truly a moment of unity and celebration for Hindi cinema.\n\nAs far as acting goes, Om Shanti Om is a winner. Every actor understands the film's mood and acts accordingly. Shahrukh Khan is great as the Oms. He's simple as the first Om, cool as the second Om, and overall is as witty and funny as always. Deepika Padukone makes a confident debut. She is very beautiful and likable. Kirron Kher shines in another comic role as the loud mom. Shreyas Talpade delivers a noteworthy performance as Om's best friend and holds his own despite a smaller role. Arjun Rampal plays the typical villain with style.\n\nWell, to sum it up, Om Shanti Om is an extremely enjoyable flick which should provide a great watch for the entire family. Like Farah Khan's previous offering with Shahrukh Khan, Main Hoon Na, this film has a genuine sense of fun. It is the quintessence of Bollywood's uniqueness which makes us realise why and how much we love this film industry. Remember not to expect anything serious or life-turning, and you will not be disappointed."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "nahush92",
        "review_rating": "7",
        "review_title": "Picture abhi baaki hai mere dost",
        "review_detailed_main": "probably one of the most hilarious movies and I guess the best spoof ever made in Bollywood....Farah is not scared of showing Manoj Kumar, Dev Anand and Sooraj Bharjatya in bad light....this is what the new age bollywood movies should be...bollywood is slowly adapting Hollywood style of spoofing characters and movies (check scary movie series or epic movie)...but this movie is far better than the western counterpart....\n\ncoming to performances SRK has delivered another master performance... though not in the likes of Swades, Kabhi Haan Kabhi Naa and Chak de, it still would rank amongst his better performances...Deepika is camera friendly and looks sexy...she has also acted well considering that this is her first Hindi film..she is pretty confident in front of the camera..Kiron kher is excellent as over the top filmy mother...Shreyas is a revelation and is improving a lot...Arjun too has come up with a good performance...the movie could have been better in terms of direction/editing (second half) but the performances and spoofs make up for it..."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "The_Jihadi",
        "review_rating": "7",
        "review_title": "Just Fantastic!!!",
        "review_detailed_main": "If you sit to watch a typical Bollywood Commercial masala movie, Leave your brains behind. Om Shanti Om is one such film that entertains you in every aspect.\n\nOm Shanti Om is the story of the Indian Film World. It is the story of a Junior Artist (Extra) Om Prakash Makhija (Shah Rukh Khan) who dreams to become a superstar one day. He is madly in love with Shanti Priya (Deepika Podukone) who is a super star and she is in love with a film producer Mukesh Ahuja (Arjun Rampal). Mukesh after learning this fact that Shanti is pregnant with his child and his most ambitious project will come to hold if he marries her, He kills her. This whole event is witnessed by Shanti's good friend and her secret lover Om. Even Om dies in that tragic accident while trying to save Shanti. Mukesh runs to Hollywood and get's married there a multi-millionaire's daughter.\n\nBut destiny has a total different story to tell\u0085 Om is reborn again after 30 years as a Super Star Om Kapoor (Shah Rukh Khan) and the destiny makes om meets Sandy (Deepika Podukone) who is a look alike of Shanti Priya. Om and Sandy make a plan to trap Mukesh who comes back to India after 30 years to make a film with Om. The evil get's punished and the truth wins forms the rest of the film.\n\nTechnically the film is just brilliant. It shows on the screen the amount of money that has been spent into the making. The sets are glossy and breath taking. The camera work is just superb. The editing is fantastic and crispy. Musically a very decent and a good effort. Especially the song where all the 31 stars perform is a treat to watch for. The story and direction by Farah Khan is very good.\n\nPerformance wise the film belongs to King Khan Shah Rukh Khan all the way. New girl Deepika Podukone is the next superstar. It did not seem at all that she is a new actress and this is her First Film. Arjun Rampal was awesome in the negative role. Kirron Kher was really good once again. Shreyas Talpade was again very good. He gets an equal footage with Shah Rukh to perform.\n\nFor those who go for Artistic Cinema, This film is strictly not for them. But those who need Full Time Pass, Om Shanti Om is the real good choice. Here the Film Maker is trying to fool you, But in return they are offering you a Glossy Dream of 2 hours. So if you are looking for a Roller Coaster ride of Entertainment, Go for Om Shanti Om!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "A delight for those familiar with Bollywood...otherwise, probably not your best film to watch.",
        "review_detailed_main": "\"Om Shanti Om\" is an excellent film. However, it's also one that your enjoyment of it may depend on how familiar you are with Bollywood movies. If you haven't seen any or perhaps only one or two, it might be far less interesting for the intermediate and advanced fans of Indian cinema. As for me, I am definitely an intermediate and would actually loved to have had a big-time Indian movie fan watch it with me, as I only recognized some of the huge Indian movie stars that appeared in the film in the star-studded middle.\n\nThe film begins in the 1970s. Om (Shah Rukh Khan) is a struggling actor--a bit player. He's smitten with a leading lady but she seems way out of his reach. Later, however, there is a fire on set and he saves her life--and definitely gets her attention. But, fires seem to come in twos in this film and a bit later, her evil secret husband murders her--and Om is killed as well!\n\nAt this point, something VERY Indian occurs. Just as Om dies in the hospital, in an adjoining room, a baby is born--and the baby turns out to be the reincarnation of Om. The baby's name...Om!! This Om grows up to become a HUGE Indian mega-star and his life is good.\n\nFollowing a portion of the film at an Indian movie award ceremony (by far the best part of the film--and hilarious as well), Om starts to have memories of his previous incarnation. He slowly comes to realize what happened to Om #1 and decides to concoct a complicated plan to trap the murderer by re-staging the murder that happened 30 years ago! However, the plan ends up going askew...just how, you'll have to see for yourself.\n\nThe film is a delight but a strange one. It's like there are three different movies all spliced together. The first and third portions are very serious and the musical numbers are wonderful. As for the second, it is completely different in tone. Om #2 is a mega-star-- and a hilariously self-absorbed one. And, to make it much funnier, lots of very famous Indian mega-stars appear as themselves...sort of. You just have to see this to know what I am talking about but it is something Indian film fans will love--as if they have a back stage pass to REALLY meet the stars as they supposedly really are! Wonderful--and by far the best part of the film.\n\nOverall, despite having a few clichés (ones you EXPECT in Bollywood films---such as an ever-present fan to make the stars' hair blow in the wind), the film is one of the most enjoyable and fun Indian pictures you can find. Well worth seeing for fans of the genre.\n\nBy the way, after the picture ends, do NOT turn off the movie. In a really neat twist, not only the stars walk past the camera but just about EVERYONE involved with the film gets their moment on the runway--even the grips and choreographers!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Get Some Popcorn & Prepare for Some Spicy Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sg_o14",
        "review_rating": "7",
        "review_title": "All because of SRK",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "coiffuremixte",
        "review_rating": "10",
        "review_title": "Love in dreams",
        "review_detailed_main": "'Om Shanti Om' is, simply, one of the best films ever made.\n\n'Singing in the Rain' is the closest reference cinematically and thematically, both films are about the inside of the movie business Hollywood and Bollywood respectively. Baz Lurhman was going for the same kind of thing with 'Moulin Rouge' and - despite hyper-active trickery and bombast - managed to express romance, art and music pretty well, though not as well as is done here.\n\n'Om Shanti Om' manages to combine drama, high emotion, nostalgia, fantasy, romance and self-referential humor to perfection.\n\nSimply told, this is a film about fans. What it is to love an idol on the big screen and the unbreakable fantasy of stepping up onto the big screen. This is also a metaphor for love and the film is also, suitably, wildly romantic.\n\nAnyone who truly loves cinema intelligently will adore this film. Shah Rukh Khan is on his own today, with perhaps Denzel Washington, as a leading man with infinite appeal and effortless charm, intelligence, humor and presence; a movie star at home with the all-time greats.\n\nDeepika Padukone is both a stunning beauty and a complete actress, incredibly, managing to match her brilliant co-star in comedic and dramatic range.\n\nFarah Khan is a director of extraordinary technical and artistic skill and the vision she exerts in Om Shanti Om is breath-taking.\n\nLeave your preconceptions about Bollywood aside and embrace a true classic."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "billyb007",
        "review_rating": "7",
        "review_title": "Could of been much better",
        "review_detailed_main": "I think the film is OK, as said had the potential to be 10 stars.\n\nThere is good acting from most of the cast, but the story did drag on a little...the first half of the film was excellent, good performances, every second of the first half was good, no scene was wasted it was full of emotion, lots of laughter, and overall seeming to be a very enjoyable movie! I recommend people to watch this film, mainly because its a shahrukh film, the only downside is the second half, the story is not good, i feel u'll understand watching the film. The story could of had a better ending, however i feel the entertainment value is very high, drawn to the fact that there is almost every star in bollywood in the film. good film 7/10"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "pyasa-sajal",
        "review_rating": "1",
        "review_title": "Hats off to the audience for making it such a huge hit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "ikky_k",
        "review_rating": "10",
        "review_title": "SRK is still king!",
        "review_detailed_main": "Shah Rukh has a great track recording of releasing movies around Diwali and in the past they have all been hits, and judging by his latest home production, this one is going to do big business as well.\n\nA couple of points to come out of this movie. First is the transformation in Shah Rukh's body. The guy seems to have worked real hard and the results are awesome. Second is the new heroine Deepika Padukone. She holds her ground well and delivers a top performance.\n\nArjun Rampal also puts in a good showing as a bad guy.\n\nAnd the songs are awesome too. Watch for the number where everyone (except the Bachchan's) make an appearance.\n\nYou will love this one."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "ssvikas",
        "review_rating": "7",
        "review_title": "A fun movie. Deepika Padukone is enthralling.",
        "review_detailed_main": "This review is coming more than a month from the release of this movie. But, how does it matter when Deepika Padukone is still fresh in memory with her Ajab si adaayen. Honestly, I went to the movie to watch her. Long ago, I had predicted that this babe would make a big entry into films. Well, a debut with SRK! How bigger can it get?\n\nThis Deepawali had two major releases, King Khan and Farah Khan’s OSO and Sanjay Leela Bhansali’s Saawariya. Most newspapers drew comparisons between these movies, some on story, on the débutante lead actresses, track record of directors, songs, so on and so forth coupled with aggressive marketing campaigns.\n\nOSO starts with the story of a junior artiste Om Makhija in the 70s deeply in love with screen sensation Shantipriya. Both become friends after Om saves Shanti from a fire accident on the sets. Both die in exceptional circumstances and Om is reborn again, this time as superstar Om Kapoor 30 years later. Om realizes his past and sets out for villain Mukesh Mehra in his quest to uncover the secret of his past lover’s demise.\n\nTill the interval, Farah Khan did a great job on recreating 70s cinema. Two comic sequences, one on Manoj Kumar and the other on a mock Tamil film shoot are hilarious. While being a parody on the movie industry of those days, in many ways, OSO pays tribute to many cinematic moments, such as those of rebirth with the Om sign, group dance sequences, bell bottom pants, etc. The best stuff stops here.\n\nThe second segment dwells too much on SRK’s stardom and the story somehow loses focus. Deepika’s role is too limited. But here, villain Arjun Rampal as steals the show. The best of the comic sequences is the Award ceremony with many star cameos. The clips of nominees that is shown there is worth the watch. The end too is very filmy. End credits follow Farash’s style in her first films to show her entire crew. That was sweet.\n\nNon-SRK fans may not really like any praise that I say here. But, one must admit that this great guy has amazing star power, all acquired on his own! There is no dull moment in OSO. Ah, and what do I say of Deepika, she’s just awesome! Arjun Rampal, Shreyas Talpade and Kirron Kher have done great. The music too is captivating. If you haven’t seen this movie, I would say it is worth it for its entertainment value."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "joshi_amit",
        "review_rating": "1",
        "review_title": "save your money and watch on pirated DVD",
        "review_detailed_main": "This film encapsulates all that is wrong with the modern India: A tendency to get satisfied with fluff and superficiality. Farah Khan started with a grand vision of recreating a spoof on Bollywood itself. While the idea is laudable, the intellectual machinery behind the film was not enough to pull it off. Even if you try to shut your brain off and enjoy the movie, the rudimentary consciousness of the brain stem screams at the banalities. Shahrukh was at his overacting best, Deepika had no clue and Arjun Rampal was deader than a dead pan. Shreyas and Kiron Kher are impressive. The only saving grace of the movie is Vishal-Shekhar's melodious score. Save your money watch the 2 bucks DVD from neighborhood Indian grocer."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Dingataca",
        "review_rating": "",
        "review_title": "Pure masti, at it's maximum level! *Minor Spoilers*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "mnalgirkar",
        "review_rating": "7",
        "review_title": "Enjoyable popcorn flick!",
        "review_detailed_main": "Growing up in the 70's and having thoroughly enjoyed Hindi (not yet Bollywood) movies from that decade, I was intrigued when I read reviews about the 70's references in this movie. I wasn't disappointed. The first half of the movie uses some interesting special effects, characterization of stars from that era, and also some very subtle references to stars and film-makers to depict that decade. The cameos of prominent stars throughout the movie adds to the fun factor of the movie.\n\nThe movie offers light-hearted entertainment, several enjoyable songs, and some good performances; especially from Shahrukh Khan and the débutante Deepika. Although the movie plot and several key segments are something you have seen before in other movies, OSO's format is irreverent, goofy and enjoyable. Watch this movie for nostalgia, and an overall good time!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "manoj-ransing",
        "review_rating": "6",
        "review_title": "A lot entertainer and senseless movie",
        "review_detailed_main": "No doubt, that this movie is going to break the box office record. I has made for doing that only. Farah Khan in her second movie kept her promise of giving lot of entertainment, at the same time giving the most senseless and stupid movie. Good or bad I don't know. I will give it to individual to decide.\n\nThat is the reason why the movie is having extreme comments. On one side, its is the best for SRK fans (SRK is there in almost every frame of the movie, so much that finally someone may want to throw out). It is also the best for the mass who like to watch comedy, drama, romance, music in one shot. This movie has it all. \"Maa Ka Pyar\", \"Main Maa Bananewali Hoon\", \"Mera Beta Wapas Aayega\", \"Muze Zinda Gaad Diya\" all and many more emotions are packed in this 3 hr movie. But even after that you feel movie is still lengthy specially in second half.\n\nAs a really good entertainer the movie gives very good music, dance, dialogs. Acting wise all are good except Deepika, specially in second half. No doubt, why she has so less dialogs.\n\nAt the other side the movie is totally unrealistic. Unrealistic characters, unrealistic events, too stupid dialogs. All these points suddenly become clear when you watch 'chak de India' and this movie having less interval in between. I always believe that a movie should be entertaining first, should be able to bind the people to the chair. This movie does that. But then at the times, you also think why the hell have I wasted so much precious time of my life watching this movie.\n\nYou can easily see from what I have written that how much confused I am. I am still not able to decide whether the movie is good or bad. Hence I gave an intermediate rating. Let each individual decide it. Meanwhile I will try to forget that I wasted three hours of life, while watching Dard-e-disco on youtube again and again."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "cxw1065",
        "review_rating": "10",
        "review_title": "Time pass- in the best sense of the phrase",
        "review_detailed_main": "Saw this movie at an advance screening, and boy, was it amazing.......... it's a total time-pass movie and I mean that in the best sense of the word. Having just seen the heart rending Khuda Ke Liye, OSO was a reminder that life can be fun, filled with colour, love and laughter- and that even if you don't believe in punar janam, Bollywood movies thrive on the topic.\n\nSRK shows why he is the Shahenshah of bollywood, and ALL his friends show up-- there were more cameos in this movie than I could have expected.\n\nOne must give credit to the stars who laughed at themselves with such good humour......even those who are supposedly currently at outs with SRK.\n\nLive, Love, Laugh!! at this movie, and remember when not every movie had to have a message."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "johnshay",
        "review_rating": "7",
        "review_title": "Plenty of fun from one of Bollywood's hippest directors.....",
        "review_detailed_main": "Rushed out to see this when I heard it would be showing in Pittsburgh on opening day (a rarity in our city for Hindi films these days, unfortunately)....and I can't say I was disappointed.\n\nThe film draws its storyline from both \"Kaho Naa....Pyaar Hai\" and \"Madumati\" and features exquisite art direction and cinematography, with Shah Rukh Khan playing both himself and a Hrithik Roshan-style character and Deepika Padukone reviving (pardon the pun) Vyjayanthimala's role in the Roy/Ghatak classic. All of the actors do a fine job, and SRK has some very funny moments in the film (particularly in the first half). The mise-en-scene of the studio-within-the-movie scenes was reminiscent of Guru Dutt's \"Kagaaz Ke Phool,\" and the visual design by director Farah Khan and cinematographer V. Manikandan is exquisite and richly detailed. The pacing isn't quite as tight as in FK's directorial debut \"Main Hoon Na,\" but seems to fit the narrative.\n\nOSO is also loaded with all sorts of \"inside\" references to Hindi (and American) films, past and present, which made this a most enjoyable viewing experience. The \"Filmfare award\" scene and song \"Deewangi Deewangi,\" coming right after the interval, were a blast -- I'll need to see the movie again to catch all of the Hindi stars crammed into those fifteen minutes (the scene also gains a few additional laughs by lampooning the recent stage musical \"Bombay Dreams\"). As was done for the cover design of the Beatles'\"Sgt. Pepper\" album, someone ought to run a contest to see who can identify everyone in these two scenes! Vishal and Shekhar's soundtrack is very fresh; they do an excellent job hinting at various Indo-pop musical styles from the 60s and 70s. I only wish that the opening title version of \"Om Shanti Om\" would have been included on the CD as well....will just have to wait for the DVD release, I guess.\n\nNow time to head out and see SLB's \"Saawariya,\" which also seems to be playing in Pittsburgh on opening night. The world is definitely changing!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "hizham",
        "review_rating": "10",
        "review_title": "An outright entertainer",
        "review_detailed_main": "OM SHANTI OM tells the story of Om (Shah Rukh Khan) and Shanti (Deepika Padukone). Om is a junior artist in the 70s. Shanti is the reigning superstar. He is her biggest fan. He is in love with her. Om dreams of being a superstar, but an incident changes his life forever. Om dies in a mishap, but is reborn into the present day. He attempts to discover the mystery of his demise\u0085\n\nWhat I liked about the film? Well, almost everything (Yes, I admit, I've sold my soul to SRK)! Which is 98.35 per cent of the film! The film is more a take off on the re-birth formula, than a tribute; but it does brilliantly. Farah Khan has made everyone act superbly (yes, including Arjun Rampal!). There are so many things to watch out for so I will just list a few highlights:\n\nThe cameos by almost the entire industry. The fantastic one-liners from '70s Bollywood; The comedy scenes throughout the movie! the digital effects ala Forrest Gump. Deepika Padukone. SRK playing a brash star brat. SRK's abs (of course!). The witty vision of the filmmaker.\n\nAnd finally Farah Khan and SRK's and the entire film industry's bold move to do a take off on the take off, because, when you look at it, the film is not just a take off on '70s Bollywood but also on today's filmy frenzy! With each and every film one thing is sure Shah Rukh Khan will be outstanding and in this film to he is outstanding as well. In this film Shah Rukh Khan shows His comic abilities and he is bang on target. It just goes to show his range and versatility as an actor that on one hand he is doing Chak De! India (Offbeat) and on other hand Om Shanti Om where he is playing to the gallery which came easily only to Shah Rukh Khan.\n\nDeepika has all it takes to be a top star \u0097 the personality, the looks and yes, she's supremely talented too. Standing in the same frame as Shah Rukh Khan and getting it right is no small achievement. She comes as a whiff of fresh air! Arjun Rampal impresses in a negative role which suites his image. Shreyas Talpade compliments Shah Rukh Khan wonderfully. Kirron Kher in one word wonderful.\n\nThe masses will love it; the classes will love it too! The youth will like it too, even though they may not get certain references to the Bollywood of yesteryear's. A must watch."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "movie_freak_dubai",
        "review_rating": "6",
        "review_title": "Masala entertainment with a couple of inspired comic sequences.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "manish1713",
        "review_rating": "1",
        "review_title": "Why was this movie made ???",
        "review_detailed_main": "I don't seem to understand the logic behind this movie. Ain't we better off watching spoof on MTV and Star TV that we had to spend 300 bucks for the movie and all because of doctored ratings by the eminent critics of India. Sab Chalta hai if we can package it well and get two words of appreciation from the critics. Why so much of talk about Deepika Padukone ? She is no great actress as she has been made to appear .\n\nIf anyone has common sense then we should realize that we have already declared her to be the next best thing even before seeing her on screen ? Ain't we guilty of doing that. Long before movie release,we declared her to be the SuperStar ? (i wonder what kind of superstar were we referring to even before seeing her performance...) This movie is not worth an oounce. Stay away if u have sense and go watch if u are sans sense."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "springsunnywinter",
        "review_rating": "10",
        "review_title": "All disco and no dard",
        "review_detailed_main": "I intended to watch Om Shanti Om as much as Saawariya but Om Shanti Om first because I'm a huge Shah Rukh Khan fan just like everyone else. I've not seen Saawariya yet but I am going to.\n\nOm Shanti Om was soooo entertaining, fun, stylish, colourful, emotional and had a very interesting story (which I loved to bits) told in a good format. Also there is not a Bollywood film made about films.\n\nThe first half gave a very good insight of the 70s because this was a rocking decade for Bollywood and I was almost going to cry at the ending of the first half. The second half was even better and reminded me of \"Karan Arjun\". Oh yes! There is a twist in the end that will totally shock you. It was like a delicious desert after a tasty dinner.\n\nMusic is excellent composed by one of my most favourite music directors Vishal & Shekhar. The best songs are Ajab Si, Dard-e-disco, Deewangi Deewangi and Main Agar Kahoon. Dard-e-disco is the best music video I have ever seen of the decade....no wait! the best of the century.\n\nThe film was about 3 hours but all that time was worth it and there wasn't a single boring or useless scene. The best scenes are: Dard-e-disco song of course, Filmfare awards, Deewangi Deewangi song because there where 30 stars and the ending. In Sajid Khan's \"Heyy Babyy\" there where 14 actresses in cameos and he is Farah Khan's brother.\n\nI've not seen Chak De India because I never got the chance but whether you liked Chak De India or not, you will love Om Shanti Om and if you didn't you can beat me up with a hockey stick. Overall I loved the film it was better than I expected and has a lot of fire. (If you know what I mean)"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "farrakh",
        "review_rating": "7",
        "review_title": "excellent in all fields - comedy, thrill, romance...",
        "review_detailed_main": "I was one of the lucky ones to watch the premier show here in Bahrain today (8-Nov-07). Dipika was excellent. So was most of the bollywood that was casted in this movie! Although most came just for a few seconds but it was done in a nice way and fun! All in all it was a fun movie to watch and gave us laughs, thrilling moments and moments of emotion as well.\n\nI really recommend seeing this movie on the silver screen vs. waiting for a DVD or an inferior print. This movie is full of vibrant colors and sounds and the cinematic experience really adds value to everything.\n\nDo go out and see it. Its one of the films that come out once in every 3-5 years in bollywood so don't miss it!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "prateekarora",
        "review_rating": "2",
        "review_title": "Really need Shanti after watching this",
        "review_detailed_main": "So finally it is Diwali time, and other than anxiously waiting to celebrate one of my favorite festival and do pooja, I was eagerly waiting for this movie. I had high expectations, and I would not create any suspense for you guys. But this movie was not at all what I expected. What a rip-off from Rishi Kapoor starer Karz. I don't know why people are calling this movie a laughter riot, it was so boring. I actually slept during few scenes. It was such a drag. The only reason I am even giving this movie a 2 on 10 is because of the awesome cameo by Akshay Kumar and to see Mithun Da, Dharmendr, and ever hot Rekha do some jiggy and their patent dance movements. Oh man, nothing can beat the oldies.\n\nIt is no way closer to the cult comedy movies like Jaane Bhi Do Yaron, Andaz Apna Apna, and Hera Pheri. Its a one time visit, see it and forget it movie. You do not take anything from it when you leave the theater. Not even a single quote or dialog to remember from the movie. Other than the fact that they made fun of all time superstar, hall of fame, Mr. Rajesh Khanna and couple of other oldies, they broke all the records of being a illogical roller coaster movie. At least old Karz was believable but this one is just a headache. And the ending was even more mythical than existence of Godzilla.\n\nWell, I would suggest you to still go watch it, but I regret spending my $12 on this movie. Could have had cheap Taco Bell 10 times rather than spending that money on movie like this. Its not worth spending that much money on this movie. Damn, should have waited for it to come on DVD."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "itsmyreview",
        "review_rating": "",
        "review_title": "if i knew the plot i would have never seen it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "jawahar4",
        "review_rating": "7",
        "review_title": "Just For Fun",
        "review_detailed_main": "OSO is not extraordinary but is an adequate entertainer.Although it does not justify the hype created but it does not disappoint.Moreso because of the presence of Shahrukh .Farah Khan goes the Manmohan Desai way. Leave you mind at home and go to watch OSO just for fun. And its an out and out fun film. The movie is inspired by Karz,Madhumati and what not. It starts in !977 when Karz is being shot by Subhash Ghai and a junior artist Om (SRK) is dancing. Om is obsessed with bollywood and in particular Shanti Devi ,the star played by Deepika Padukone . In a film shoot, he saves Shanti and finds her favour.He is killed in trying to rescue Shanti who is burnt alive in the studio by Arjun Rampal , a producer.He is reborn as Om Kapoor, a superstar and as usual he remembers all that has happened to him in the previous birth and seeks vengeance. The climax has the ghost of Deepika coming and doing the deed of killing Arjun Rampal. The story is old and the characters jaded. But the presence of SRK is electric.He turns the mundane proceedings by his livewire performance in both births. As the junior artiste, his comic sense is uncanny. As the south Indian superstar he is over the top and as Manoj Kumar he is restrained. He balances the act so beautifully that the first half is over before you know. As the gen next superstar he is full of attitude and his by now famous 6 pack body is in place. The second half is again the same old story a la Karz with the role of Simi Grewal being played by Arjun Rampal. The awards function is awesome and Abhishek and Akshay are at their sporting best. The dance of 31 stars in another attraction . The climax is picked up from Madhumati. Deepika is fresh in both the roles and does justice. Shreya and Kiron Kher support SRK as the best friend and mother respectively. All in all its an entertaining film in which one should not ask any questions, Just have fun and come home.The music by Vishal Shekhar is good and both the 70s and present moment are well represented."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "razman-87",
        "review_rating": "6",
        "review_title": "Disappointing!!!",
        "review_detailed_main": "I just went yesterday to watch this movie yesterday with my family expecting it to be a good entertaining movie....it turned out to be anything but that....yes there 2-3 scenes which stand out such as the Manoj Kumar scene...also when SRK pretends to be a big South Indian star and Akshay Kumar special appearance at the award ceremony is amusing....Shah Rukh khan gives a good performance in this typical mas ala movie.... newcomer Deepika Padukone gives a decent performance....and looks the part....Farah khan like her last movie main ho on Na tries to put everything into the movie which makes it look a bit rushed...the movie borrows from movies as Karz ( the 'Om Shanti Om ' track is included in the movie ) also karan arjun...the director tries too hard...all in all it was disappointing ...go only if you are a die hard SRK fan an i know there are many!!! not recommended though!!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "shahabkalim-1",
        "review_rating": "10",
        "review_title": "Ye picture bohot chalega mere dost",
        "review_detailed_main": "If you loved the unintentional hamming of the mothers of the 70s who would make the temple bells sway with their prayers,if u adored the sidekick cute buddies of the 80s who would always die in the end,if u loved the bell-bottoms of the past,if you enjoyed the over the top villains of the past and if you ever loved true blue Indian cinema in general,then this lampoon called OSO is made for you..And if you didn't like any of the above mentioned characteristics of the old Bollywood,then also OSO is for you...\n\nKhan is brilliant in the first half..Actually everything in the first half is fantabulous..Second half is okay and Shahrukh is so so compared to the first half..Second half picks up pace with the adrenalin rushing dastaan-e-oso song which is reminiscent to Karz' Ek Haseena Thi...Also the Madhumati inspired climax is a masterstroke....Deepika is great looking but doesn't have much to do..Shreyas has managed to match Shahrukh step by step..Kirron Kher is splendid as the Nautanki-prone momma...\n\nI will cut my views short and all I wanna say is Om shanti Om is Eccentric Cinema at its ultimate best\u0085DO NOT MISS IT..\n\nTHIS IS GOING TO BE SRK'S BIGGEST HIT"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "paulclaassen",
        "review_rating": "6",
        "review_title": "Beautiful!",
        "review_detailed_main": "Incredible production! Vibrant, colorful and utterly amazing. What starts off as a silly-ish comedy soon turns to a spectacular, dramatic musical with stunning visuals, photography and Phantom of the Opera-like scenes - just much better!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "skartik_79",
        "review_rating": "8",
        "review_title": "Pedictable yet fun!",
        "review_detailed_main": "We knew all about this-didn't we?\n\nOSo is not a crossover movie, it is not anything path breakingly original(It is heavily inspired from Karz, the concept is), it does not have anything particularly refreshing in terms of story or screenplay..etc.. Yet- OSO succeeds, and that was what Farah and co were gunning for this Diwali.\n\nSrk is back to his old ways -this is a 'true blue' SRk movie, he does all that he is a master at- plus the latest addition or attraction- his bronzed 6 pack!\n\nDoes he succeed? Its very simple- For people who adore Srk in his regular roles, will lap this one up too.\n\nFor someone expecting a Kabir Khan (Chak De) maybe a tad disappointed.\n\nOm Shanti Om is in the league of Main hun Na- in terms of cinematic sensibilities. Its just pure fun woven around a story, but never getting too deep into it. Characters are a bit sketchy, plots get a bit contrived, and clichés abound everywhere, yet this movie passes the litmus test-because it is all about the timing too.\n\nIts a perfect package for Diwali - an entertainer and Srk-the country's' biggest brand(arguably)-the combo wont fail.\n\nI am not exactly delving into the story, for most people know what is needed. Yes, its is a bit of a tribute with a zany sense of humour to the 70's, you see the bell bottoms are back, the sideburns, flowery shirts, as the 1st half of the movie is entirely in the 70's.(Srk as the bumbling and goofy Om Makhija)\n\nAnd yes its about reincarnation, following the lines of Karz, Srk being the victim(and also Deepika). Srk is reborn as Om Kapoor now- a hot cool dude and a big shot in Bollywood. It is quite predictable hereon, the twists are few, but well crafted. I just wished the buildup was stronger, the meat in the climax was missing.\n\nFinally- The movie does fit the bill of a good entertainer- Paisa Vasool, will be liked by young and old, I wont be surprised if this does turn out to be the BO winner of the year. Songs are hummable, Dard-E-Disco being a lot of eye -candy(for women). Srk will attract a lot of 'drools'.\n\nAnd the title song with 31 stars is fun too!\n\nThe minuses being just that- it could have had more substance to the characters and the climax a bit more thrilling.It seemed like it ended too soon suddenly. And also some more meat to the 'motive' of Deepika being bumped off by Arjun.(Rampal)\n\nPerformances-Its familiar territory for Srk, believe me its a role which of course was just written for him, though the 2nd half-Om Kapoor seemed a bit clichéd. His dying sequence compares to his previous movies-will get the audience's empathy. Deepika is pretty and emotes well, not really a lot of meat in her role, but shes quite effective. Kirron Kher Hams, but shes still adorable, she manages to do that with ease. Shreyas Talpade was an interesting choice as Srk's pal, does that with consummate ease.\n\nAnd my award would go to Arjun Rampal- a out and out 'cool negative' role, very suavely done. Its one of his more noticeable performances.\n\nOSO- as mentioned is predictable, and yet fun, it works well for people who want a 3 hr reprieve!Its not what I can call 'Miss not' but still is the best of the current lot."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "npk0687",
        "review_rating": "7",
        "review_title": "Not a strong storyline but worth the watch.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "haseebjawed",
        "review_rating": "3",
        "review_title": "Disappointing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "DICK STEEL",
        "review_rating": "10",
        "review_title": "A Nutshell Review: Om Shanti Om",
        "review_detailed_main": "Om Shanti Om and Saawariya premiered the same time as the offerings for the Deepavali holiday, and to see how Hollywood money had influenced a Hindi production, I opted for the latter first. In its opening weekend in the UK, Om Shanti Om had trounced Tom Cruise's Lions for Lambs, so OSO went straight to my must-watch list this week. Moreover, while I have watched movies starring Bollywood King Shah Rukh Khan, I have yet to see him in action on the big screen, so this provided the best opportunity to do so.\n\nAnd he's not called The King for nothing. Here, his roles of Om Prakash Makhija the junior actor in the studio system, and Om Kapoor the superstar, allowed for plenty of room to put his acting chops to good use. For his stature, watching him play a lowly rated actor with big dreams was a hoot, especially when teaming with good friend Pappu (Shreyas Talpade) in sharing those dreams of stardom, and hamming it up for the camera. In a tale of two halves, the first is set in the 70s in a major movie studio where Om Makhija works, and Fate has it that he will become romantically tangled with the hottest starlet of the era, actress Shantipriya (Deepika Padukone in her debut, going head to head with Sonam Kapoor's debut too in Saawariya). But of course the star crossed lovers (aren't they always) are dished a cruel hand, and the movie lunges into the second half, which I should avoid specifics, suffice to say that Shah Rukh's new character Om Kapoor (nicknamed OK), is now a bastard of a superstar, full of arrogance and standing for everything that Om Makhija isn't.\n\nNaturally there is a running theme connecting both portions together, along the lines of the circle of life, karma, retribution and reincarnation. Having two characters essentially allowed the audience a fun time in comparing and contrasting which Om one would prefer, offering a glimpse of what Om Makhija could possibly become if success went to his head. What I always liked about Bollywood, is its run time allowed for plenty of songs, dance (which of course are the enjoyable bits with the colourful sets and costumes all put to good use), and while certain plot development might be cliché, it does take its time to properly develop the characters, or the leads at least. Om Shanti Om is no different, though there were some overly melodramatic moments, sometimes tongue-in-cheekily offered courtesy by actress Kirron Kher as Bela Makhija, Om's junior actress mother.\n\nThe song and dance again take centerstage, and they were nicely composed for specific purposes in the narrative, one of many reasons why I admire Bollywood. Om Makhija's fantasy sequences with many beautiful costume changes during his scenes of courtship is memorable, but even audacious was Om Kapoor's superstar-like performance with entourage of scantily clad blondes (yes, you read that right) in Dard-E-Disco, where you'll get jealous watching Shah Rukh's well toned abs, and remind yourself to hit the gym more diligently.\n\nBut what made Om Shanti Om truly enjoyable and stand out, is its almost self-deprecating jokes that it cracks on the industry, the movie it makes and the studio system, but then, it's really a celebration of their cinema and how far they have come. For those well versed with Bollywood, there are tons of references and inside jokes that you can't help but to chuckle at, including very well known stars all being very sporty about their cameo roles (hats off to Abishek Bachchan, hahaha!). There were the obvious self-indulgent moments like the post- awards ceremony party, where you'll realize why the opening credits had a huge Thank You list to the Who's Who in Bollywood - having appearances by the stars in one 10 minute segment, is a real treat and a good introduction to rookies like me, who become interested in trying to figure out who they are, besides the recognizable few from movies I've watched before. Performing to Deewangi Deewangi, I thought the other scene that was equally fun, was the Filmfare Awards Ceremony, which was almost laugh-a-minute. Thinking about it while writing this still brings back the laughs!\n\nAs usual, you'd come to expect some moments of familiarity in the movie, and I don't deny that the storyline does seem deja-vu, but again what makes it a delight, is primarily Shah Rukh's magnetism. Director-writer Farah Khan managed to string together comedic moments and balance them with a tender love story that I thought was pretty sad, given its unconventional (but not unpredictable) treatment. Sometimes Bollywood movies are guilty of having set pieces which resemble Hollywood, just like Krrish had a set which looked straight out of John Woo's Paycheck, and here, adopting the special effects sequence for Confession of Pain is hard to deny. But what I thought was a full circle, was the finale song-dance sequence which had the proceedings mimicking screen life, just as how Moulin Rouge had theirs resemble the doomed love affair between Christian and Satine, which in itself had heavy Hindi influences during its own musical sequence.\n\nOm Shanti Om has everything - romance, drama, mystery and the supernatural all rolled into one, and if I had just one word to describe it, it will be \"Remarkable\". Do yourself a favor, and watch it!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "OSO rocks!",
        "review_detailed_main": "Farah Khan's 'Om Shanti Om' is easily one of the most entertaining films in recent times. Reason? The film has all that it takes to be a blockbuster, which it became in its box office run. The film has got humor, action, romance, 31 stars appearing in it and fantastic music score. What Else do I need as a film and SRK fan? Nothing, OSO is truly a excellent entertainer in all aspects. Two Thumbs up!\n\nPluses of the film: The film , as said before is a complete entertainer. The music score by Vishal-Shekhar is outstanding. The entire crew has worked amazingly, especially Sabu Cyril who recreates the 70's look to perfection. Solid Performances: Shahrukh is superb. I love him. Arjun Rampal is effective as the villain. Deepika is a superstar material, only one thing? why did she not dub for herself? Shreyas Talpade is natural. Kirron Kher is fabulous. Satish Shah and Bindu are hilarious in cameos. Other are good. The 31 star-studded song elevates the film to a much higher level.\n\nMinuses: The film's second hour is not as impact as its first. The climax is average.\n\nOn the whole, 'Om Shanti Om' is escapist cinema at its best. Watch this all-time blockbuster!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "khare-prasad",
        "review_rating": "1",
        "review_title": "Of dumb, for dumb, by dumb",
        "review_detailed_main": "After a long time I went to watch a Hindi movie and came back disappointed (which happens more often that not). Its a terrible movie with nothing worth spending time and money. Characters are not even close to \"believable\". Script is worse than what a 4 year old can write. Acting is mediocre. End sequence is boring, lengthy and makes you feel stupid for sitting and lasting the whole movie. I think mainstream Indian cinema has never been progressive, sensible or creative, and OSO proves my point. However, be prepared to hear that it becomes a super-hit back in India as an \"entertainer, masala\" (???) movie!!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Bollywood Calling + Karz = Om Shanti Om",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "shiv_mehta1988",
        "review_rating": "6",
        "review_title": "Good Enough",
        "review_detailed_main": "The Bollywood Genre is a genre where the audience gets thrilled by seeing great sets, good music, dance, lots of stars. You shouldn't think much about the principles of continuity when you're watching this genre as it is basically made for the entertainment of general people and not for film critics and professors. This movie had everything what a Bollywood movie should have and this clearly defines the Bollywood Genre.\n\nUsual fantastic acting by Shah Rukh Khan. Special Mention for Shreyas Talpade and Arjun Rampal. Good performance by Deepika Paadukone. I thought that the costume and styling department did a wonderful job in the movie. I've given it a 7 star because the first half wasn't that interesting but as soon as the OK reincarnation appeared in the second half, it became entertaining. The highlight of the movie was the background score which I felt was super. It had the haunting emotional romantic element, but the best part of the movie were the two songs, one which featured all the big superstars of Bollywood and the other the sensational track Dard - E - Disco.\n\nAll in all one should watch it at least once in the theaters."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "vivekdlko",
        "review_rating": "7",
        "review_title": "Another example of the Fact that SRK still rules Bollywood",
        "review_detailed_main": "I'm Not a big SRK fan yet there was something which made me see OSO, well I'm glad in the end the movie was a joyful ride with loads of popcorn fun. Indian cinema has come of age and we are seeing more meaningful movies being made these days, But OSO follows the usual tried and tested masala formula which eventually works .\n\nThe movie is based on the theme of reincarnation which has been attempted many times before , but if you are a SRK and Farah Khan you have the liberty to do it again and get away with it.In this case get loads of cash and awards for it.I would suggest the viewers not to look for any logic i the movie but simply enjoy what is served to them bcoz it was never meant to satisfy the critics instead its made for the masses and we belong to the same category. Shahrukh excels as 'OM' and proves his versatility once again though he still has to work on emotional scenes.he does a difficult job of portraying two characters belonging to two different time frames. Deepika Padukone couldn't ask for a better film for her debut she looks gorgeous and enacts her part well.Shreyas Talpade plays Om's friend hes okay but its difficult to imagine him as a 60 yr old guy and still being called 'pappu' LOL.Kiron Kher as a mother is good as always.The real surprise is Arjun Rampal Hes tremendous in a villainous role , why not hes getting more good projects. U are gonna hate(Love) this Guy.\n\nThe music is Great like most SRK movies. The songs that stand out are dard-e-disco and deewaangi-deewaangi( which has almost half of the bollywood industry).The jokes successfully make u giggle and sometime can make u burst into laughter if u cannot control urself. Farah knows the taste of audience she sticks with that though sometimes u feel that movie is getting too melo-dramatic.But this doesn't affect the overall content.She has really worked hard to achieve that 70's style look for the movie.\n\nThe movie is expected to bring huge profit for its producers and distributors.Go catch it with a pack of popcorn and please leave your brains out before entering the theater( U will enjoy more in this way)."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "nnk-39990",
        "review_rating": "8",
        "review_title": "Srk Srk Srk !",
        "review_detailed_main": "Srk was incredible no one else could have pulled it off , loved every bit of it , great tp movie so we're the songs of it ."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Zentaurion",
        "review_rating": "7",
        "review_title": "A Dard-E-Fiasco",
        "review_detailed_main": "The movie starts off as a charming, witty satire of long-standing bollywood clichés but then fails by expecting the audience to take the same clichés seriously to fill out the threadbare story. Along the way many laughs are to be had but they empty as the script runs out of gags long before the end.\n\nShah Rukh manages to keep the length of it watchable with his boundless charisma but there is little depth to his character. Indeed the main problem is that the characters are all under-written. Shreyas Talpade is almost entirely wasted. As are most of the other characters, such as Kiron Kher who dazzles in her key scenes, but are then left neglected.\n\nDeepika Padukone impresses in her debut, displaying versatility that could pave a successful career forward. Arjun Rampal also gives a rare good performance. In a role that could have been hampered by over-acting, he gives a well-judged tone to it.\n\nThe songs are a highlight, especially the one which utilized slick editing to bring the stars of past and present together. Not quite so much of a highlight was the cameo-filled sequence which runs far longer than it should have.\n\nOverall, the first act could be seen again and again by any fan of Hindi cinema but the full running time would have few watching the movie through to the finish on repeat viewing."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "vaibhav_bhandeo",
        "review_rating": "10",
        "review_title": "Best entertainer of the year",
        "review_detailed_main": "One ticket and maximum fun; how is the deal? Well deal is on and named Om Shanti Om for you. A Diwali bumper offer from the house of King Khan and of course Farah Khan.\n\nTo start with the story it's more or less reincarnation of Karz by Subhash Ghai, so those who watch it thinking a new stream can stop thinking the same, although the treatment is much advanced and grand with consistent twists and turns. First half deals with successful recreating Era of Golden seventies where one in million Om runs behind and saves life of his \"Dreamy Girl\" Shanti who happens to be the raining superstar then. But when it comes to the happy ending of their saga, life takes a twist and an unfortunate event takes life of both Om and Shanti (I don't want to spoil the suspense plot here).\n\nWhile the second half starts with the current time, Om Kapoor who is raining superstar now is a star son of seventies superstar Rajesh Kapoor who was in a way involved in the story of first part. With some twist and turns in the story, Om recalls his past life that he is a rebirth of Om and he is on a mission to accomplish the left task from his past life with the help of Sandy (Sandhya) who apparently is his biggest fan. That's the end of story.\n\nKudos to Farah Khan that she was so right in making this film by including all the ingredients in the movie; be it comedy, romance, emotion, drama or suspense. Movie is to its entire stretch a treat to watch. Music background was also very nice by Vishal and Shekar; each song comes with the requirement not as if they are padded just to feel the time; lyrics make them even more soothing while listening. Sets that recreate the seventies Era are fabulous and makes scenic pleasure entire movie. From the cast SRK rocks undoubtedly, I must say I liked this one the most of his entire performances till date. He had a tough task this time to match with a young girl Deepika as a pair and didn't both look stunning together, just picture perfect. I can write ten pages praising SRK for his show this time but let's get on to others. Kirron Kher is remarkable in her performance, the scene between her and SRK in second half would bring tears to your eyes. Shreyas was as good as he could, he and SRK were brilliant together almost every where in movie. Pick of the movie is Arjun Rampal, be sure to get surprised with the role he is playing in the movie; he steals the show when ever he comes on the frame. Now comes my favorite part: Deepika!! I wish the dialog SRK says \"when you love someone from the bottom of your heart entire world backs you\" come true for me. She is a Diva, no more Katrina for me now; it's all Deepika from now onwards. Watch out her in forthcoming ventures, this time other than her mesmerizing smile she had very little to do in front of the big shots in the movie.\n\nI highly recommend this one to everyone; go out and have healthy fun."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "tismalu",
        "review_rating": "7",
        "review_title": "Pretty good ......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sadia_nasim",
        "review_rating": "1",
        "review_title": "Lacks a story line, poorly written and very boring.",
        "review_detailed_main": "This movie has had so much hype\u0085\u0085but that's all it is. When I was in India the marketing for this movie was excessive...but honestly not worth it. The story line is lacking despite the colourful seventies theme, not only does the movie drag but it was awfully boring. I guess the vision for this movie was obviously somewhat deluded and can be blamed on Farah Khan's hormones!! The actual songs from the movie are not bad, and the costumes that the main actress wears are nice but that's the only good thing I can say about this film. I ended up walking out half way through and totally did not enjoy it. I would certainly not recommend this film to anyone unless you want to waste your money and get bored!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rahu_pvr_07",
        "review_rating": "10",
        "review_title": "Excellent movie!!!!!!! 10 stars -70's magic is back ( SRK rocks!)",
        "review_detailed_main": "Excellent movie!!!!!!! 10 stars to the effort to bring back the 70's SRK rocks (as always) in this one too.\n\nSo just what is OSO?\n\nOm Shanti Om is a reincarnation drama in a whole new context. Picture a Filmfare award function, minus the awards.\n\nOSO may be Box office hit but for me Farah has not done a good job. the film loses plot in the second half and moves at a ugly pace and many disconnects.\n\nI am a die-hard fan of SRK and had huge expectations from OSO. The songs really rock. Above all OSO was a entertainer but for sure the Khan magic of Chak De was missing.\n\nI didn't carry anything home but the 70's magic which touched the inmost chords of my heart. But still I suggest all to go and watch it !!!!!!!!!!!!!!\n\nOmmm Shanti ommmmmmmmmmmmmmmmm."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sashank_kini-1",
        "review_rating": "7",
        "review_title": "Note: This movie is strictly not for over-wise people",
        "review_detailed_main": "From the time Om Shanti Om and Saawwariya were announced, tremendous hype was there throughout India. People began discussing which one would be better, would a masala film like OSO be able to beat the film made by a sensible director like Sanjay Leela Bhansali?\n\nThere was more discussion when both the films were going to be released on the same day. Then came rumors and controversies of Sanjay being furious at Farah and what not. And the mega hype of Shah Rukh Khan's six packs made it the headline of every magazine. Both the films tried their best to overthrow each other in every possible way.\n\nRanbir and Sonam promoted their film by coming as special guests in reality shows like Jhalak Dikhla Ja and Star Voice of India while Shah Rukh Khan visited Nach Baliye,Deepika and Farah visited Nach Baliye and it think they visited Sa Re Ga Ma Pa too, Deepika and Shreyas went to Star Voice of India. Ranbir's towel scene became a hit among girls. Worse was, there were rumors that there was a feud between Ranbir of Saawariya and his friend Deepika.\n\nOn top of that, the 31 stars dance was too taken into consideration. Who were invited? Who did not turn up? And what not. Both the films launched their music albums and songs were sung in both reality shows Sa Re Ga MA Pa and Star Voice of India.\n\nThere was so much of these going on that I was completely fed up. I had an aversion to the Saawariya songs that were played so many times in my ears almost everywhere and got bored listening to songs of Om Shanti Om for the same reason. I even stopped watching these reality shows whenever the stars of these two movies turned up.\n\nAt last when the two movies released, people rushed inside theaters to enjoy the two movies that they had always been waited for. The verdict: Om Shati Om was good, saawariya was bad. Then too, Om Shanti Om was not exactly given mind blowing reviews. Just another masala film that would entertain the audience. MAny people even did not like the film and compared it to Karz.\n\nI had gone with three families to watch this movie yesterday. Both the film makers were smart enough to release it during Diwali when it was holiday time and people mostly lingered around cinema halls. I even ignored the horrible review my friend's family had given about this movie.\n\nAfter watching the movie, I was really happy with the film. It wasn't a Dhamaka but was a real entertainer. So most of the audience even watched the subtitles. What I loved about the film that Farah Khan not only ridicules actors of Bollywood in the film but makes fun of herself. You'll know when you see the end subtitle. Even the spot boys and camera men are given a warm welcome in the subtitles and are shown respect.\n\nThis movie isn't Shah Rukh Khan's career best performance but it is still very good, though it got a little hammy in the second half. Deepika must be good for a new comer but I did not exactly like her acting very much and felt she had a problem speaking Hindi and so looked a bit rehearsed, but she was extremely beautiful. Shreyas was good as usual but the person whom I liked a lot was Kiron Kher as the over-acting mother. The conversations between Shah Rukh and her were hilarious. Arjun was surprisingly good and sophisticated but he should understand that he should do side roles only and not act in the lead role.\n\nThe seventies period was created really well. THe accent, huge nest-like hair, mannerisms all were done with perfection. Farah Khan has mocked almost all actors of the filmdom but it is funny rather than being rude. The dialogs were really good though the film slowed down a bit in some parts. The songs sounded even more beautiful, thanks to the magnificent choreography by Farah Khan.\n\nThe second half too was good but not as good as the first half. I felt that many of the scenes that were supposed to be serious were shown in a funny way. It looked more childish for a revenge. The end could be clearly understood from before and was predictable.\n\nBut overall, it was a good-great film. Therefore, I give it a seven out of ten."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rahul-iitd",
        "review_rating": "1",
        "review_title": "Amongst the Most Terrible movies of SRK",
        "review_detailed_main": "This movie will make you frown, jump on the seat, shout in the movie hall, and throw all kinds of stuff everywhere.. This is simply a PIECE OF SHI/T directly from hell .. I really don't understand what was in the heads of directors and producers and most important, the actors themselves..\n\none would have hated himself while acting for this movie.. its a complete waste of time and that too complete 3 hours .. a terrible nonsense movie made without any logical notion .. for non-Indians, this movie might make you hate the bollywood of India ..\n\nI don't understand how-come some people like this.. can a movie, without any sense and flow, full of idiocy, can impress people with just branded actors (SRK) and some flowering songs.. don't people consider the storyline .."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "An all out spoof of Bollywood. Overlong but fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Angelus2",
        "review_rating": "7",
        "review_title": "It's a Bollywood movie, what did you expect?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "hansbearnl",
        "review_rating": "7",
        "review_title": "Sloppy but fun",
        "review_detailed_main": "I guess if you don't know much about the Bollywood scene, you might get confused easily or even bored somehow. Still, if you compare to all those other Bollywood movies which seems to have 3 plots at least, and start all over again when you think that the movies is finished, than this one is doing quite well. First off all: the plot simply continues in the second part, that is a big relieve. Secondly, it is fun to watch and even the end credits are fun compare with most other movies. The story is not to bad, and even the acting of people like Shreyas Talpade is great. I think the supporting actors are actually doing much better than the leading role. But I advice you, keep an eye on the female leading actress, we will surely hear more from her in the future! The moment they open a huge tin can of Bollywood stars is a fest of recognition although it has no real meaning in this movie. The weakest part: the film fare awards ceremony in this film. But anyway, the film fare awards are weak in itself..."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "JoBloTheMovieCritic",
        "review_rating": "8",
        "review_title": "Om Shanti Om",
        "review_detailed_main": "8/10 - cool revenge tale runs a little long, but keeps it fun"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "singhrahulangelo",
        "review_rating": "6",
        "review_title": "Back to the past!!!",
        "review_detailed_main": "I went to see this movie with lot of expectations and hope. I would not say that I got disappointed but it could have been better.Its a journey through 70's cinema and its experience. Bollywood was really so clourful in those days. Its a good narrated story with good acting and direction. I was earlier disappointed to see Main Hoon Na also made by Farah Khan....So I was hoping to see a better direction with better plot. But I think after watching this one can say that they somehow got confused in the end to end this movie with some better ending. Its just a comparison between first and second half. First half is full of emotions...colours...comedy and I would say better acting than the second half. Shahrukh is good in first half but he wasn't able to justify the role in second half. Though anyone would say that he really worked on his muscles and it is clearly visible in song 'Dard E Disco'. Deepika was fantastic on her part. Being a newcomer...I wasn't really expecting her to come as good. One can say that Farah really tried to give everyone a good role and altogether everyone performed well but Suresh could have been used in a better way.\n\nIn the end it looks a like a combination of so many oldies from bollywood...like karz and others. I would recommend all to see this movie but don't expect a lot. Farah has a long way to go"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "AnnaPagrati",
        "review_rating": "9",
        "review_title": "Wow!",
        "review_detailed_main": "When I first watched this movie I was mesmerized! Such beautiful plot & performances!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sorwar-ahmed",
        "review_rating": "6",
        "review_title": "Entertaining but predictable.",
        "review_detailed_main": "One thing you would expect from an SRK film is that you will be entertained and with his side kick in this film, SRK and Shrevas delivered just that. They both bounced off each other perfectly and the timing was excellent. I wouldn't mind seeing them together again in future just like Sanjay Dutt (Munna Bhai) and Arshad Warsi (Circuit).\n\nKirron Kher played her role as the filmi maa with perfection. She worked really well with SRK and Shrevas and she was really funny.\n\nThe debutant Deepika had a very small role and didn't do too badly, however, I'll have to watch more movies of hers before passing judgement.\n\nMost of the entertainment was in the first half of the movie. The second half lost the sense of realism and also became predictable.\n\nThe only good thing I really enjoyed in the second half of the movie was watching all the different actors and actresses at the awards and dancing away at the party.\n\nBut I would recommend people to watch it for the entertainment value and laughs in the first half of the movie.\n\nI'll give it a 6/10."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "neerajbhatia",
        "review_rating": "1",
        "review_title": "My opinion?",
        "review_detailed_main": "My opinion does not really matter since the movie is on it's way to become one of the biggest success stories of the last 2 decades and the reason for that is... Errr... there are none!!! Utter crap... boring!!!\n\nSRK I don't know why he chooses to do this stuff under is very own production. I mean give yourself some credit dude, you are a much better actor than this!\n\nFarah Khan Wait, I know your secret. You made a big statement by saying you were going to shoot this movie with a proper script unlike when you made Main Hoon Naa. So if YOU wrote the script, where is it! Decide whether you are trying to spoof it up or paying tribute. Also, except for the conclusion song, the Farah khan stamp over a song was not visible in any of them!\n\nEveryone else Enjoy the success since I can't take it away from you but remember that it is nothing to be proud off!!!\n\nAnd now for my opinion about the movie: **** ******* **** ** ****\n\n(Hope you get the jist!)"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "bluffmasteranshuman",
        "review_rating": "8",
        "review_title": "A true blockbuster to end the year",
        "review_detailed_main": "He came, he saw, he conquered. The outsider who made it. And now he is laughing at everyone - the whole industry, the way it works, the biggest stars, their tantrums, film-fare awards and at himself too. Shahrukh Khan always makes great copy. But get ready to hear and see what he has never said before. Sample this \"overacting is in my family\". Even admitting \"The heart is NRI\". And i loved it.\n\nI think everyone knows whats the story is all about. And if you don't, then you must be in some never-land because SRK and his gang are everywhere. Just tell them the address of the place, they will reach faster than you can imagine to promote the film even at your never-land. Farah is not ashamed to admit what she likes and what kind of film she aspires to make. She has always been honest about it and O.S.O. is all about that. Its MTV-style spoof from start to finish. Its not great cinema. Its just good entertainment, everything BOLLYWOOD style!! its the Alchemist philosophy at work\u0085\"when you really want something to happen, the whole universe conspires so that your wish comes true.\" Its all about \"Happy End\" else its not the end friends!! You will get to see whatever you are expecting with some little twists and turns here and there. SRK is in typical SRK form. The film belongs to him from start to finish. Everyone else is just extra. Deepika Padukone doesn't have much to do except look good and show some cleavage. Is good in whatever she is supposed to be. For the first time, Arjun Rampal acts and yes does it well. The typical bollywood villain!! Kirron Kher is the typical Hindi film mummy with full crying scenes and drama!! The sequences where they have showed the 70's films on big screen have been done pretty well. It's great nostalgia to see them on big screen. Now who would not like to dance to Chintu Uncle's \"OM SHANTI OM\" song..(remember that scene in Shekhar Kapoor's Masoom\u0085mummy, have a look, its chintu uncle on TV om shanti om!). And here, you will have many more from that era.\n\nKept on wondering if SRK really prayed for the \"Khan\" surname in his last birth and got his wish granted. I seriously think that something like that happened. And this is what i liked most about the film\u0085.they are showing the middle finger to everyone. And people have no option but to laugh. Can bet that SRK is laughing his way to the bank again.\n\nThe not so great actor but the biggest star of bollywood has finally dared to laugh at himself. You should not miss out. What the film is about A kitschy present-day, Farah Khan take-off on the ultra-popular '70s Bollywood potboiler that, in her own words is a tribute to film-making. But this is a Hindi movie and you have to leave your brains out, or so the filmmaker is telling you.\n\nThe film is more than a take off on the re-birth formula, made famous by Karz in the '70s than a tribute; but it does brilliantly. Farah Khan has made everyone act superbly. There are so many things to watch out for so we will just list a few highlights: The cameos by almost the entire industry, The fantastic one-liners from '70s Bollywood; the digital effects ala Forrest Gump. SRK playing a brash star brat. SRK's abs (of course!). The witty vision of the filmmaker.\n\nAnd finally Farah Khan and SRK's and the entire film industry's sassiness to do a take off on the take off, because, when you look at it, the film is not just a take off on '70s Bollywood but also on today's filmy frenzy! Blockbuster! The masses will love it; the classes will love it too! The NRIs will gobble it up and froth over it and the youth, even though they may not get certain references to the Bollywood of yesteryear's and even the line \"Frankly my dear, I don't give a damn\", will love it! SRK is King.\n\nCut the crap, cut the will-it-won't-it work drama. Shah Rukh Khan and Farah Khan's OM SHANTI OM is a true-blue spicy entertainer. If MAIN HOON NA was a chauka, this one hits a six! Wait, a word of advice to all readers across the globe. Don't, for God's sake don't, raise exclamations like when?, why? where? as OM SHANTI OM begins to unravel. This is atypical Manmohan Desai film presented in a novel form by Farah Khan. It's definitely not for pseudos or advocates of art-house cinema.\n\nVishal-Shekhar's music is first-rate. The score is in sync with the content of the film and what accentuate the goings-on are the choreography and execution. Although every song is visually enticing, the 31-star track as also 'Dard-E-Disco' will have the masses going into a frenzy.\n\nNow let's clear some myths surrounding OM SHANTI OM. Is it the 2007 adaptation of Subhash Ghai's immensely likable reincarnation film KARZ? Does it have traces of KUDRAT? Or KARAN ARJUN? Hold on, there's a dash of KARZ, a bit of KARAN ARJUN, but beyond that it's a film that makes you nostalgic about 1970s Bollywood.\n\nOm To sum up, OM SHANTI OM is full entertainment package. We haven't seen SRK in a hardcore spicy film since quite some time. He had drifted to other genres, which proved his range as an actor of repute and cemented his status further. With OM SHANTI OM, he gives back to the audience what he himself grew up on \u0097 a thorough entertainer that will have the audience thirsting for more."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "pavanpratury",
        "review_rating": "6",
        "review_title": "Om Shanti Om is a mas-ala film",
        "review_detailed_main": "OSO is a mediocre film.The film got lots of surprises to choke you..The film starts well with good scenes and simulation to Old period.The first half of the film is decent with good comedy scenes and the Director really created exceptional images of the 70s and 80 s.The film features everyone.Everyone know the song \"Deewangi\" features 30 stars but other than that,the film also features Amitabh,Hrithik,Abhishek,Akshay and in fact every star in the Bollywood fraternity.This mas-ala is the saving grace for the film.The first half ends with an extraordinary twist.And in the second half,we see the 6 pack Khan.From Jeetendra to Hrithik,Shahrukh was present in everybody's character.Second half is entirely different.It is in fact out f reach.No one could ever think that OSO have a second half like this.Deepika Padukone is really a star,She is definitely the next superstar.She got the looks and she performed well.Arjun Rampal did well in negative role.The climax must have been dealt better.Music is very fine.And,the Background score by Sandeep Chowtha is fine.Well,Om Shanti Om works only because of the hype and mas-ala that is part of SRK films.I was surprised by the ratings given to this film.The script is weak.Yet,the film provides entertainment.It is a time pass film.And,all the mas-ala and jinx kept this film in the hit category.But the film doesn't deserve to be a huge hit."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "jkartik16",
        "review_rating": "4",
        "review_title": "Disappointing even for a Masala movie ! Leaves a lot to be desired.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "mallikarjunbingi",
        "review_rating": "",
        "review_title": "Wonder full movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Doctor_Wordsmith",
        "review_rating": "6",
        "review_title": "Not quite the entertainer I expected",
        "review_detailed_main": "After hearing all about this movie's success, listening to it's soundtrack, and hearing about how it's pure entertainment, I was really looking forward to watching this film today. I had heard such great things, that I was hoping to finish and give it at least 8/10 stars, and a glowing review...\n\nUnfortunately, the movie earns neither of these things from me. While I wasn't a huge fan of Farah Khan's last film, Main Hoon Na, I did enjoy it's satire of a typical Bollywood film- separated family, OTT action scenes, violin players coming out of nowhere whenever the girl approached- it was just some great fun, but still had a good plot and decent characters that allowed MHN to stand on it's own as a film.\n\nThe same can't be said about OSO, which feels less like the spoof of the 70s film I was expecting than a string of funny skit-like spoofs, weakly tied together by a reincarnation plot. But what seems to be a bigger problem is that it's hard to tell where the to draw the line between the purposefully over the top acting and the truly serious stuff. Even knowing that it was meant to be over the top, the more serious scenes (which were needed to move the plot forward) just annoyed me.\n\nI know that most people's definition of \"masala entertainer\" means \"no brains required\", but that to me does not mean that the movie should have no coherent plot or likable characters. Some of my favorite SRK masala films- like Kuch Kuch Hota Hai, for example, are entertaining for me because of the way they make us care for the characters, even though their situation may seem a little ridiculous or unbelievable. I felt no such connection to anyone in OSO, and that to me, took away a lot of the \"entertainment\" factor.\n\nThe film has some plus points- there are a few really funny scenes that do a pretty good job of mocking Bollywood. (my fav was the Filmfare Awards- that was absolutely perfect) Also, the music is excellent- probably my favorite soundtrack from Vishal and Shekar.\n\nOverall, if you don't care much about plot or characters in your entertainment film, I highly recommend this one. But if you're like me, and you prefer your \"mindless entertainment\" to at least make a little bit of sense, this may not be the film for you."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rai_maximus",
        "review_rating": "6",
        "review_title": "Trademark Bollywood Masala that is unusually charming!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "seth93-2",
        "review_rating": "10",
        "review_title": "Picture a Filmfare award function, minus the awards.",
        "review_detailed_main": "Farah Khan likes her films to have everything -- drama, dance, dreams, dishoom-dishoom, dudes, dhoom-dhamaka etc. Perhaps her vast experience as a choreographer has taught her to view everything in concurrent rhythm. This quality which was unmistakable in Main Hoon Na gains further prominence in Om Shanti Om.\n\nThis is a big movie, well and truly in love with itself. And if you aren't into that sort of thing, if you pooh-pooh Koffee With Karan, and if you'd really rather watch a movie you have to think about, skip this. For the SRK-hater, the warning is doubly applicable. This is a celebration of the ultimate in self-achievement, Shah Rukh toasting his own indomitable Khan-do spirit."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "grayladi",
        "review_rating": "7",
        "review_title": "You weren't promised Mother India or Grapes of Wrath you know",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Chandni_Lilikoi",
        "review_rating": "10",
        "review_title": "OSO... Outstanding Superb Oscar-worthy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sayontan",
        "review_rating": "6",
        "review_title": "All cool boys switch your brains off and sing... Om Shanti Om",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "bombayboyz_90491",
        "review_rating": "4",
        "review_title": "A media hyped movie",
        "review_detailed_main": "A total flop........and much much hyped then what it really is........Leave out SRK's Acting there is nothing in the movie to watch......how can you make a movie on the story line that you don't even believe on (SRK doesn't believe in reincarnation) so? How we gonna like this movie for what? a story which never makes any impact through out 180 MINUTES? well it was only Media's Bias a total biased Indian media made this movie look like a hit while its not even average so i request to media please try and be fair we have our own mind to think but we try to read reviews before going to theaters and waste money and time. don't be so biased are you guys are paid by SRK? SRK Don't make such movies man doesn't suit your image and be sure Om Shanti Om is just a one week hit thats it."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "HeadleyLamarr",
        "review_rating": "8",
        "review_title": "My heart is filled with the pain of Disco!!!",
        "review_detailed_main": "It is Diwali - we are stuffed to the gills with Chaat and Mithai and rolling down the freeway in pouring rain to catch Om Shanti Om. Tickets were booked in advance and there is a roiling crowd outside who are waiting for scalpers so they can catch the film. We are a few minutes late and arrive at the Dhoom Taana song and can only sit in the front row with our necks craning back. The 70s are flying by at a bewildering pace as the crowd roars at the dance in the aisles, the OmiSwaami sequence with the Baaad pussy Atti Katti, and Bhaagoooo. Shantipriya is saved in true Mother India style, meets Om and he is dumbstruck and can only contort his face as words bubble and seethe inside his head. The friendship seems to blossom into something else until the fateful day when poor Om dreams are shattered. And then the arch nemesis dressed all in black traps the star in an inferno and even the bit star is unable to save her. FF to 30 years later and now the bit star is indeed born with a Kapoor name and is a Brattish superstar. The laughs get thinner although we do have the outside Chaddi wearing Mohabbat man, \"handicapped\" love, and the near romance with Bindu! Shanti is now a bubblegum blowing Sandy who swoons at Om every time. And then Mike Urf Mukesh comes back into Om's life. The spoof turns a bit serious and moves from Karz to Madhumati. In the end good will triumph otherwise this picture will not end, will it? The pluses: The laughter quotient is very high, do not eat or drink in the first half or you may be in danger of choking. If you like slapstick, then just the wrestling with the large stuffed tiger and then the flying fight should be enough to keep you happy for a while. If you like satire then you will surely like the \"Ek camera Manmohan Desai ke angle Se Bhi Laga Dena!\", \"Bhoot? Maine us se Kaha Tha Ki Bina Makeup Ke Nahin Jaana!\", \"Apan Nam Badal ke Kapoor Kar Dena, tab u Zaroor Bada hero ban Jayega!\" O.K. saying \"Overacting to mere Khandaan mein hai\" had the hall in stitches.\n\nThe music is melodious, but there are way too many songs - maybe the sequences that used these could have been shorter? The funniest song is no doubt Darde Disao - the lead up from \"handicapped love\" to the song, the end moments of the song and finally the \"handicapped\" lover in his wheel chair - these are precious moments! Main Agar Kahoon is super romantic and ironically real in a fake world and enacted between people who act for a living. The mega stars song is a who's who sequence and fun - Tabu looks super hot in Red and Rekha is as sexy as ever.\n\nThe performances are very good. SRK is the heart and soul of OSO - making fun of himself and overacting like there is no tomorrow in the process. If ever there was a need to go over the top this was it and he delivers superbly in the first 70s half and very well in the second superstar half. Deepika is beautiful and acts well in the scenes where she has the opportunity - she will go far is my prediction. Arjun is great and Shreyas is a show stealer. Kiiron Kher and Bindu shine. Akki and Abhishek are rip roaring funny in a minute each of screen time.\n\nI wish it had stayed a spoof and not ventured into the realm of the serious. The second half dragged a tiny bit, but in the end one is hugely entertained, I might have to see the film again and revisit my review!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "6",
        "review_title": "Mehh . . .",
        "review_detailed_main": "I don't know i used to like. But i watched again, it wasn't good . I was bored."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "realrahul",
        "review_rating": "1",
        "review_title": "Shame to Bollywood.",
        "review_detailed_main": "Utter waste of money and time. It is really a crap. A real ballyhooed crap a awfully directed and over hyped crap. i don't know what are these shrug fans saying about it. Where is the point to enjoy? if u find anything enjoyable factor please mention about it.baseless story, badly directed and over-hyped crap.its one and only om Shanta om.There is not a single scene is in my mind after watching this movie. And frankly speaking i don't want to. May be it is over hyped because it is produced by the hero himself.\n\nThe one thing is to be appreciated is the promotional activities of this film because it is the only thing created the big name om Shanta om. And please don't believe all the other statements made by blind shrug khan fans. I don't know what it meant to be. If they want this type of waste i don't mind but please do not give this type of rating. It is my humble request to them.and one word to the director .You proves it once again that how to make a big hit without anything a movie requires. And m also thinks that you could do that also with another movie which contains nothing but shrug in it.ballyhooed is nothing but still the story around some love and its silly matters. This is a movie which is also can use as how to avoid craps."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "harpisteva",
        "review_rating": "",
        "review_title": "You can't have it both ways",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rezwanabbas",
        "review_rating": "6",
        "review_title": "A film that makes bollywood what it is",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "BlossomTreeCherry",
        "review_rating": "6",
        "review_title": "Semi-parody of Bollywood",
        "review_detailed_main": "Tongue- In-Cheek humour. This movie is pretty clever, a semi-parody of the Bollywood industry, laughing at itself. But also quite touching in parts."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "vhavnal",
        "review_rating": "9",
        "review_title": "A movie unique in its essence !! (may contain spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "timesquare66",
        "review_rating": "7",
        "review_title": "see it for the songs and deepika",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "mieke-bredenkamp",
        "review_rating": "9",
        "review_title": "A real Masala Movie at last!!!",
        "review_detailed_main": "This one is very much for Filmi Fans... it's not an art movie and definitely not pretending to be one. Ignore the bad reviews you might find from more high-brow bollywood-watchers because this film delivers exactly what it promises. A roller-coaster ride with action, drama, romance, (deliberately) hammy acting and a very sweet fairytale-ish story.\n\nLook, if you want to enjoy it as much as I did you might need my severe gullibility and suspension of disbelief, so realists beware! But this is what makes Indian cinema so special to me - three hours of full-on entertainment. The Badshah rocks and new girl Deepika is charming as the ''dreamy girl''. The supporting cast do a really great job as well with Arjun Rampal doing a wonderful turn as the villain (and if I ever see him in the street I'll probably give him a proper kick to the crotch). The cinematography is fantastic and it took all my self-control not to get up and dance in the isles during the song sequences. Yes, its a spoof, but a good-natured one at that (it's really nice to see that the actors can take the mickey of themselves).\n\nThe King Khan still reigns!!! and My Filmi of the Year!!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "royalblood",
        "review_rating": "6",
        "review_title": "It taken me by surprise.....",
        "review_detailed_main": "First of all I am not a fan of Shahrukh Khan and sometime admitting this fact is considered to be offensive; anyways lets talk about Om Shanti Om. The movie taken me by surprise; I had no expectation still brought DVD to add it to my new Bollywood Movies collection and started watching it on weekend sipping tea before going to bath ...I was just waiting for that usual bore moment to stop the movie and take a shower....but I surprisingly completed the whole movie before shower. There are some moments where it feels like dragging but still movie has great music and that let you remain seated. Story is typical incarnation stuff that we seen in yesteryear movies; even old dialogs used in the movie looks very funny. Shahrukh has done a tremendous job and I liked his energy in the movie; especially the South Indian actor role he done was well made and shows the much misunderstood lighter side of it. Other actors also performed well like the main actress Deepika and Shreyas Talpade is great. Arjun Rampal is good as usual.\n\nHad there been new story when all the movie set and costumes are shown of 70s then it would not have been a good movie....so I think people watching the movie knew from start what is coming next and that is the strength of the movie and Farah Khan did the great job by showing us the things differently; the Manoj Kumar part was not funny though. The twist or lack of there of was taken from Madhumati and make sense for a good ending...but second part is not made in style and the revenge element is visible enough to eat up the whole humor and we knew where the movie is moving now...\n\nStill great movie, old style set and more closer look to the life of people behind and front of the camera....I would give this movie 6 out of 10 overall and can say that it is watchable even if you don't want to spend sometime before shower.."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "iitk-aditya",
        "review_rating": "1",
        "review_title": "Wish I could give it ZERO!",
        "review_detailed_main": "SUCKSS BIG TIME!\n\nthis is got to be the worst Hindi movie i have ever came across. With typical SRK movies, the least u expect is a fine performance by himself in his own style. However, this is a complete different thing. Throughout the movie, he keeps mimicking styles of other heroes and irritates you continuously!!\n\nThe direction like hell makes this even unbearable. Don't understand why this idiot SRK is so shy to officially take the responsibility of mis-directing and accept the criticism. You have to make money and entertain crowd, but keep in mind that they have brains! You cant keep throwing illogically stitched pieces of story onto their faces\n\nThe only adorable piece is of course DP, that too less with her acting, and more with her skin..\n\nGo and watch some saas-bahoo soap..don't waste your time for this one.."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "prashanthmn",
        "review_rating": "8",
        "review_title": "Very good entertainer",
        "review_detailed_main": "This one being a Farah Khan movie, I hadn't had much expectations before going to the theater. But the movie grabbed my interest from the opening scenes, and was able to hold on till the end. SRK has done a very good job. Deepika is marvelous both in look and action. One more highlight of the movie is music. The scores are very catchy and blends well into the story. Costumes and Sets are very good. The only negative element I found is its storyline in the second half.\n\nSRK and Farah Khan have put lot of efforts to make this wonderful movie, and it has paid off. I'd rate this 8/10.\n\nThe movie leaves you humming some very good tunes like Ajab si ajab si adayein hai........"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "oyontahmid",
        "review_rating": "7",
        "review_title": "Time pass",
        "review_detailed_main": "Watch it for time pass only. This is not one of the best movie. But it's so so. Actually it's 5.5* movie. Gave 7 because of the lovely songs in it which is good to enjoy."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "anupam-kgp",
        "review_rating": "1",
        "review_title": "total waste of time",
        "review_detailed_main": "This is a total crap movie. Its the 3rd crap movie of the year. This one just comes below 'Jhoom Barabar Joom' and Himesh's crap 'Aap Ka Suroor'. I am totally unsatisfied with this type of film making . Fara Khan should learn that SRK's acting sucked big time as in this movie as was her directing. Total garbage script. I like over acting comedy as i thought it would be. But Alas it was one of the worst movie of the year. The movie has some audience only because it is promoted so well, people expect so much from it .. but its a time waste . I think Katrina Kaif's 'Maine Pyaar Kyun Kia' was much better movie than this unworthy movie of Farah Khan and SRK. Only positive part was Deepika .. WOW ... brilliant performance from her in her debut in the small role she had. She look beautiful."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "BiswajitSince2005",
        "review_rating": "6",
        "review_title": "Masala Country",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "AadhKM",
        "review_rating": "10",
        "review_title": "Must see Movie",
        "review_detailed_main": "First of all there is many haters for this movie But i loved the movie It have good songs and have an excellent story bi Farah khan.The movie shows the pain and returns of Love.Om Prakash Makheeja the early 70's junior loves the super star and dream girl Shanti Priya,After that he realizes the truth and he so only get murdered.The climax was good and we will love it.End credits was also a different one.The movies plot was written by Farah khan which we early seen as the choreographer.But in the movie we see her as a director.Movie is such as a fantasy story.But she can make it as a awesome colorful,musical,romantic movie every one will love to watch this movie"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sagheero",
        "review_rating": "8",
        "review_title": "Paisa Wasool!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "jonathanvarunbenjamin",
        "review_rating": "1",
        "review_title": "Cheap Thrills Galore !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rajcherry474",
        "review_rating": "10",
        "review_title": "Best Hindi Drama!",
        "review_detailed_main": "Such an amazing story with many talented actors like shahrukh, deepika & music is an outstanding touch! if you dint like this movie, you have poor talent! go and watch now!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "tumharabaap",
        "review_rating": "2",
        "review_title": "OSO: best review I have read...",
        "review_detailed_main": "Even if one doesn't compare OSO to Karz, OSO comes up short! It pleases the NRI population that has only seen 6 Hindi films till date, and all of them are either Yash Chopra-SRK or Karan Johan-SRK films! It's obvious that they will like the movie as they've not had the opportunity to watch better Hindi Cinema. SRK is their world! The other segment it is targeted at is the teenyboppers or the masses that admire SRK for being a self-made star! They too know very little about good Hindi cinema to realize that they're being served sub-standard fare! Movies & actors that deserve a dekko are Seher & Arshad Warsi! OSO has SRK hamming to the hilt! His characters are playful but there is no effort at making them seem believable. Deepika is beautiful and seems to have transitioned well from looking good to emoting.\n\nFarah & SRK are worshippers of the mainstream masala commercial Bollywood file? Fine! But they must do justice to the moviegoer & not insult his intelligence. OSO insults the intelligence of the moviegoer with SRK hamming in all the scenes.\n\nMain Hoon Na to was an over the top masala film, but at least the overall product was believable. It entertained & didn't take the viewer for granted. OSO does & therefore disappoints! There is a better review of this film than mine. Here it is: http://greatbong.net/2007/11/12/om-shanti-om-the-review/"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "blott2319-1",
        "review_rating": "9",
        "review_title": "What a delight, just pure entertainment",
        "review_detailed_main": "Om Shanti Om is clearly an extremely meta film, and as a newbie to the films of Bollywood, many of the references and guest appearances were lost on me. Ordinarily, I think I would be annoyed by a movie making me feel like an outsider looking in, but there's so much more to this movie than just references and knowing winks at the audience. The movie is hilarious in the way the jokes are constructed, and that the movie and actors in it are willing to laugh at themselves a little. This film has a great cast, and I like how they know when they don't have to be subtle with a joke. Some of them are almost Monty-Python levels of over-the-top and I was laughing right along with it. The other thing I loved about the script was all the blatant foreshadowing that they lay out for the audience, and everything they set up pays off in a satisfying way. They do this on many levels including when they start to blur the lines between what is happening in the main plot and what happens in the movies within the movie.\n\nFrom what I understand, most Bollywood films include some good song-and-dance numbers, and Om Shanti Om definitely delivered when it came to the tunes. I was tapping my toes, singing along, and having a joyous time as I watched the elaborate sets, costumes, and choreography that went into each number. I was so captivated, that when they played the titular song in the score later in the film, I was still humming along and singing the lyrics in my head. What's truly wonderful about Om Shanti Om is that it has all the things I've mentioned (music, smart scripting, comedy, and an abundance of meta references) but it also has a wonderful love story, and revenge plot, too. I am a sucker for a good romance, and I liked how this movie developed the relationship more than simply having it be a love-at-first-sight kind of thing. As you can tell, I found Om Shanti Om a joy from start to finish. I can come up with a nitpick or two when I really think about it, so it won't instantly become an all-time favorite, but I don't want to dwell on the negatives because the whole film-watching experience was such a good time."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "MehdiRizvi-7867",
        "review_rating": "10",
        "review_title": "Om Shanti Om is a story of love and betrayal",
        "review_detailed_main": "Om Shanti Om is a story of love and betrayal Om Shanti Om is a story of a person who makes his dreams come true and becomes a successful actor. Om Shanti Om is also a love story of a popular actress and her fan. It is a story of a fan who does everything to protect his favorite actress from all kind of trouble and even after that actresses murder, does all that he can to give her justice. Nice combination of all these different stories, making it a little longer to 3 hours. Songs, lyrics and music of this film deserve a huge applause because this is the thing which adds more value to the story. Each of the songs in the film are so beautiful that they can either touch you or take you to an imaginary romantic world. All the actors did a good job. The use of too many stars in the award function sequence is one thing that will surely go down in history. Prominent faces right from the yesteryears till today were shown in that particular song sequence. The effort to bring them all together in one sequence one by one needs to be commended. Of all the different stories I have mentioned above in the introduction, two particular stories really tried to impress me: one of the popular actress and fan. Second:a person following his dreams and becoming successful actor. One of my favorite dialogues from the film, 'kisi cheez ko dil se chaho ... to puri kainaat usse tumse milane ki koshish mein lag jaati hai'. Very motivational message. Simple dialogue but has deeper meaning. This film has everything: comedy, love, action and drama. This picture has all different type of emotions, happy, sad etc whatnot. One needs to surely watch this film. He/she will like it. Special shoutout needs to go for the makers for showing faces of all the staff of this film, right from producer, director to lightman, dressman, spotboy. Usually not seen in movies. Good thought."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "shehraja",
        "review_rating": "3",
        "review_title": "The most stupid and bogus movie of the year.",
        "review_detailed_main": "I always knew this movies gonna be bad but didn't expected it to be that bad. I went to this movie just because my girlfriend insisted me to go and Now after seeing OM SHANTI OM i would say Farha khans previous movie Main Hoon Na was a lot better than this crap. The story, scripts was pathetic and rubbish except the music and the soundtracks. I have no idea why so much money and effort was put into making this crap. The producer and directors must be out of their mind. If u wanna save your precious money don't see this watch something else and now I'm getting a felling that may be Sanjay Leela bhansalis Saawariyan would be better than this one at least."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "1930s_Time_Machine",
        "review_rating": "9",
        "review_title": "The perfect introduction to Bollywood",
        "review_detailed_main": "If you're not Indian or a fan of Indian cinema you might wonder what Bollywood is. If you ever wondered what the fuss is all about you should watch this.\n\nIt's not acknowledged as a classic Bollywood movie but it is possibly the most accessible one to introduce non-Indians to this rich and amazing genre. As with lots of Bollywood movies, it's a love story, it's an over the top melodrama with more cliches than you knew actually existed, It's got every emotion, every passion, lust, revenge, an evil baddie, a handsome hero and a beautiful damsel in distress.\n\nWhat doesn't quite work are the comedy parts. Every country has its own different sense of humour so English viewers might find the humour a little unsophisticated. The supposedly funny section is only at the beginning so you've just got to get over that first 30 minutes.\n\nThe story is again a popular Bollywood trope: reincarnation but Farah Khan, choreographer turned director turns what ostensibly sounds like a silly story into something amazing. It's completely watchable and thoroughly engaging thanks to a big part by the two stars. Shah Rukh Khan, THE Bollywood megastar shows why he's the highest paid actor in the world and Deepika Padukone shows why she is unquestionably the most beautiful woman in the world.\n\nYou will enjoy this."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "flyingsaucer",
        "review_rating": "3",
        "review_title": "Most Senseless Movie of the Decade!",
        "review_detailed_main": "How many movies you've seen have been very unrealistically unbelievable? This movie is easily and most definitely the most senseless movie you would ever see. It will blow your mind to pieces, for it has not even a hint of reason.\n\nLet me tell you this unbelievable story, It is a story of a junior artist Om Prakash Makhija(Shahrukh Khan) who wants to become a lead actor. He loves the top actress Shanti Priya, played by Deepika Padukone, and wants to marry her. Om once saves Shanti Priya from a fire accident during the shooting, and in the process develops a friendship with her. Shanti Priya is already in love with a big Producer, and becomes pregnant from him. But this big producer guy does not want to marry this woman(Shanti Priya) anymore, and there ensues a big emotional argument, Producer then burns her to death, and Om who has been silently watching this argument tries to save her and in the process dies himself.\n\nThen the second part, Om Prakash Makhija is born again as Om Kapoor, son of a superstar, and a superstar himself.And there is a person who just looks like Shanti Priya, but is not her reincarnation. Om Prakash Makhija's mother then sees Om Kapoor accidentally and thinks that her son is reincarnate, and goes to him and tells about his past reincarnation, then Om Kapoor gets memory of his past birth, and then Om Kapoor, his mother, his friend of past birth(who never ages), and Shanti Priya look alike set to extract revenge from this Producer. Then rest of story ensures ridiculousness in high amount, and we end up becoming confused.\n\nThe songs, dances, are intermixed in the movie to produce an horrible effect. Too much sentiment is packed in the movie. There is nothing much in the movie other than Shahrukh Khan's 6 pack, Deepika's Amazing body. Direction, Story, and various other departments fail miserably.What makes this movie so unbelievable are the scenes, the logic, and the most unnatural characters. No depth at all, it does not look like a standard movie made for world audiences, rather looks like a movie made to impress mental patients.Shahrukh Khan is a good actor, and we cannot bear him wasting his talents in a garbage like this.\n\nDon't watch it unless you want to become insane!!!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "manasjyotimj",
        "review_rating": "10",
        "review_title": "14 years",
        "review_detailed_main": "I'm rating this after 14 years too (while watching) , because this film never gets old. One of my most favourite movies of all time. When I watched it in 2007, I was a teenager. Not many movies can withstand the test and taste of time."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "hdammu11",
        "review_rating": "9",
        "review_title": "Quintessential Bollywood",
        "review_detailed_main": "Like most movies he's in, SRK carries this film on the power of his charm. This is not to say the plot is weak, but unless they're an old Bollywood film buff, the storyline, parodies and references are unlikely to have an impact on the viewer. If they are though, they're in for a treat. This movie is comic, emotional, nostalgic and heartfelt all at the same time. It is best described as a period-fantasy love drama.\n\nThere are two reasons this film is remembered for today - one, for being Deepika Padukone's debut (surprisingly impressive), and second, for being pitted against Saawariya in a now regrettably ugly campaign as both films were being released on the same day. To be frank, I love both films now but back in the day I couldn't look past the tragic beauty of Saawariya which I saw first and so I couldn't appreciate Om Shanti Om for the beautiful film it is.\n\nFirstly, the acting from the entire cast - including SRK, Deepika Padukone, Arjun Rampal, Kirron Kher, Shreyas Talpade is commendable. I especially loved the chemistry between Talpade and SRK. The music is wonderful and each song is memorable. The costumes, sets and production design made me feel nostalgic for a time period I didn't even exist in. My biggest issue is the length and editing of the film, but one can also argue that the whole vengeance subplot wouldn't have felt earned otherwise. Then there are also a few jokes I felt weren't in good humour as they involved some real people. But overall, a wholesome tribute to the quintessential Bollywood masala film genre."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "bigaussie-niral",
        "review_rating": "5",
        "review_title": "No where near the expectations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "marshaof",
        "review_rating": "10",
        "review_title": "fun movie...a tribute and a taste of all that is Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "vishalkudvak",
        "review_rating": "1",
        "review_title": "Movie sucks to say the least",
        "review_detailed_main": "what kinda movie is this??\n\ni mean , gimme a break. This is non sense at its absolute best. Shah rug khan is such a one dimensional actor and it is highlighted by this movie and the concept of this movie is parallel to star plus Television soaps. This Movie does not even deserve to be rated, to be pretty honest. The reincarnation sounds so fictitiously fictitious. I did not have the courage to watch it in a theater and that was a wise decision. The only good thing about this movie is that its not a 3 hour movie. It is time for people to realize that we make and watch sensible movies. I am not trying to be critical or neither do I have anything against the king of Indian Cinema, but lets face it, his movies are monotonous and this movie is no better."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Ibuk",
        "review_rating": "10",
        "review_title": "Om Shanti Om- Farah Khan you have a winner on your hands again",
        "review_detailed_main": "When I heard about Om Shanti Om I thought that Farah Khan wouldn't be able to match the success to Main Hoon Na. I was proved wrong and I would was bowled over by this movie. The film was a remake of the 80's blockbuster Karz (coincidentally Om Shanti Om was a song from that movie). Karz director Subhash Ghai and hero Rishi Kapoor even had special appearances in this movie. Directed by good friend Farah Khan and produced by wife Gauri this is a Shah Rukh Khan film from the minute go till the end.\n\nShah Rukh Khan was fantastic and Deepika provided good support, Arjun Rampal however wasn't good in his role. Om Shanti Om pokes fun at the film industry. The songs were fabulous, especially Dard-e Disco and Dewaangi, where over 30 film stars make special appearances. The ending was brilliant, there is even a twist at the end. Om Shanti Om was fun all the way. Subhash Ghai should be proud to call Om Shanti Om a remake of his movie."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "bhavikapattni",
        "review_rating": "10",
        "review_title": "This movie is indescribable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rajibdey0",
        "review_rating": "1",
        "review_title": "Another As Usual SRK Flick ...Nothing Special",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "wessingh",
        "review_rating": "10",
        "review_title": "One of the best films you will ever watch!",
        "review_detailed_main": "If you are a fan of entertainment and great cinema (not to be confused with artsy cinema), then this is the perfect title for you. The director, Farah Khan, has done it again! She has made one of the most enjoyable movies of our times. If you are not familiar with Bollywood, then this is the movie to start with. If you are a Bollywood fan, I don't even think I need to say more. Chances are you have watched it and loved it. The film doesn't take itself too seriously and is just pure, fun movie. Also, watch \"Karz\" if you haven't. You'll see what I mean as I don't want to give anything away. For the non-Bollywoodites...watch for the title track \"Om Shanti Om\". Big hit in India but also resonates with Westerners. Do I recommend this film? More than probably any other film I can. (Yes, even more than \"Main Hoon Naa\" - another blockbuster and masterpiece from Farah Khan). Now go watch the film and thank me for suggesting/recommending!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "kgurji",
        "review_rating": "1",
        "review_title": "Outrageously Ridiculous!!!",
        "review_detailed_main": "Wow!! that was an awful waste of time and thank goodness, i did NOT waste my money on this pathetic movie. The most disappointing factor of this movie is Shah Rukh Khan's acting. The first half of his Om Prakash portrayal was tolerable...but what happened to Om Kapoor? Why is he so pathetic. Acting was immeasurably annoying...too over-dramatic, gee, there's a limit to what one can take. It's just disgusting seeing such a well-established, sophisticated, mature actor...trying to look all swell like Salman or whoever but looking completely foolish. Why can't he just be a natural actor and not try to be like someone else for God sake. Moreover, the movie was fully predictable, exaggerated performances (can't figure out whether that was Farah's intention), a total masala movie, a dis to ones intelligence and a complete mockery of the Indian Cinema.\n\nI believe the only reasons to why it gained tremendous fame at the box-office are because of the countless star appearances and of course, SRK-FK pair. Otherwise i find no other reasons to why the movie is empowering the rest. However, I didn't expect much from Farah as a director but I did expect quite a lot more from SRK as an ACTOR. In the end, we always count on the actor, sometimes not taking much account of the direction.\n\nTherefore, I would not recommend anyone to watch this movie if you're looking for some intense performances or a good story. But if you're willing to take the risk, then do so. Or unless you're an ardent fan of SRK and Farah, then there's no one stopping you."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "josepha-geanne",
        "review_rating": "8",
        "review_title": "How I love Farah Khan humor!",
        "review_detailed_main": "This is the the good, the big Bellwood war machine! Let us look at this film as we look \" I hate the actors \", \" The Player \" or \" Big tiredness \" (Michel Blanc's). A film on the crushing industry of the cinema, here The cinema of Mumbai. It was necessary that somebody makes it, Farah Khan, Géniale Farah Khan, made it! We, French people, search a hidden sense from things, here, it is not necessary. Not because it is not subtle, but because to haunt the criticism of middle are big: libidinous producer, incompetent starlets, actor without brain, , films tight budgets, big benefits \" The director \" Farah one even, makes fun of her even as film director. She tries to take a piece of costume of a pseudo star of the song of 1970s, she arrives late at the red carpet of promo of her own film. She is the Indian \"Alain Chabat\". Forgiveness Farah! But it would be better to say that \"Alain Chabat\" is the French Farah Khan.\n\nLet us say that Farah has already made the worst with Main Hoon Na (2004) where the right Hindi is broadly attacked with a lot of humor. With humor it trickles down in every minute. Principal actor you, the big, the one, the only, the king Shah Rukh Khan \u0096 his spouse is productive of the film, reason for which undoubtedly there are lot of sequence with him - is forty-year, so cute, but forty really. He introduces us a torso of first young person to make turn pale generations going up, and it is in excess, such as Farah is able of showing it, as created gap and irony of the sequence of dance Dard-e-Disco. Also I recommend the film fare sequence where numerous actors, stars not questioned by the millions of audience of the films of industry of Bombay, take part in the game of the gibe of their fame, as seldom an actor is able of making it. We are not capable of realizing to what extent references to the Indian cinema are referred. But one is recognized even by a french : in the mouth of one of those which plays a movie director: \" I would make an angle as Satyagit Ray an angle as Bimal Roy and an angle as Guru Dutt \", \" happy you to make your own angle ! \", answers him fop producer come to shake the main actress who makes a last minute fad. (I think that she claims his wage! She has a brass neck!). Il like this film and also I love Farah!!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Pratik112",
        "review_rating": "10",
        "review_title": "One of The Best Movies For This Year",
        "review_detailed_main": "This is the second movie with Shah Rukh \"King\" Khan that has been a tremendous hit, the other being \"Chak De India.\" \"Om Shanti Om,\" the title based on the early 1980's song from Subash Ghai's \"Karz,\" has Om, a junior artist in the 1970's Bollywood who has dreams of becoming a star. He then meets the well known actress, Shantipriya and falls in love with her. But then tragedy strikes and he finds out that Shantipriya is pregnant by the man who had introduced her into the movie industry - Mukesh Mehra, who will stop at nothing to continue with his career and will not allow anyone to destroy it. The movie stars Shah Rukh Khan, Deepika, Kirron Kher, Arjun Rampal and Shreyas Talwade and the Pakistani actor / Director, Javed Sheikh and Bindu.\n\nDirected by Farah Khan, the opening sequence, consists of the song \"Om Shanti Om\" from the movie \"Karz\" and a very young Rishi Kapoor can be seen in the song along with the Director of the movie, Subash Ghai. Shah Rukh is just fantastic in his role as \"Om.\" Deepika, considering that this is her first Hindi movie, has also performed well, as have Kirron Kher, Shreyas Talwade and Arjun Rampal. The seventies era has been superbly re - created by Farah Khan and the Producer Gauri Khan. In one scene a very young and romantic Rajesh Khanna can be seen. Since this is based on movies and acting, naturally, Farah Khan has kept it as realistic as possible by including scenes involving the Filmfare awards and the party that normally follows its. This also means that various Directors and actors also make an appearance - Yash Chopra, Karan Johar, Subash Ghai, Rakesh Roshan and Hrithik Roshan, Amitabh and Abhishek Bachchan,Shilpa Shetty, Kajol, Rani Mukherjee, Juhi Chawla just to mention a few. And yes, Shah Rukh \"King\" Khan does show his \"six pack\" by removing his shirt in a song. In terms of Box office takings, it is estimated that this has earned three quarters of a million pounds in the first week in the United Kingdom only. Worldwide, it is believed to be much, much higher - at least another three times.\n\nThis is a movie that is worthwhile and can be enjoyed with your family as it also has some good humour even if it means that a certain \"Mr Bharat\" wants to take Shah Rukh Khan to court."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "isramisthebest",
        "review_rating": "4",
        "review_title": "Director/Writer lost it ...",
        "review_detailed_main": "In this time of highly competitive bollywood, producing a movie like \"Om Shanti Om\" is nothing but a terrible mistake that affected reputation of many in the team.\n\nCopying the western style of humour, mocking legendary artists in an unfunny way (not that I'm against imitating artists) and filling up a song with tens of famous film stars could only create the hype for this movie but the conclusion was very disappointing.\n\nFarah Khan should take the hint and try to improve her direction skills and completely quit writing. The 6.5 rating as of yet for this movie is most probably the reason of love towards Shahrukh Khan from his fans.\n\nThis movie deserves a 4/10 from me."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "Excellent, Fantastic and Superb",
        "review_detailed_main": "Om shanti om was the blockbuster of the year and rightly so. Shahrukh Khan delivers yet another superb performance and is a shame he didn't get Best actor for this. Deepika is drop dead beautiful and she has talent, she will do good in the near future. Arjum rampal was also quite impressive as the villain of this film. Shahrukh worked hard for this film gaining a six pack in the process. The songs are lovely in this film especially Main Agar Kahoon being the best. The movie has it all action, comedy, romance, adventure and supernatural. The best thing about this is the Deewangi song where there are many superstars in one song. Salman, Saif, Sanjay Dutt and Shahrukh dancing together is a real treat. It was great to see Mithun dancing with Shahrukh as well as Dharmendra and Jeetendra."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "nimmi_f100",
        "review_rating": "4",
        "review_title": "main hoon na was much much better",
        "review_detailed_main": "I feel the movie has got more positive reviews than it actually deserved. I don't understand how the critics give their reviews on a movie. They don't have a standard approach to judge a movie. The script is full of flaws and most of the plots doesn't make any sense, but the critics overlooked them mentioning its a brainless masala entertainer. masala entertainment is fine for general public but the job of a movie critics is to watch the movie with a magnifying glass. It was the same Rajeev Masand who gave Shirish Kunder's Jaan-e-mann a thumbs down saying it has taken too much cinematic liberty and lacks a genuine script. How did he overlook the flaws in the script of his wife's movie. The plot where Shanti is killed is the main flaw of the movie. The whole murder plot and Arjun not even being suspected for it must have been written with a digestible logic. and again in the climax arjun gets killed in a more unbelievable way when he faints in middle of the hall full of people and later SRK shooting at him. This contradicts the existence of the whole plan to convict Arjun of the crime with the help of sandy as in the end SRK never proved his crime. Except for a few one liners and a couple of great comedy scenes(shooting of mind it and Filmfare awards) the movie is a drag. It just relies heavily on SRK's star power. I must give credit to Farah Khan for making a movie on the film industry but it was a let down to me since Main Hoon Na was an much better masala flick yet it had a sound script."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Kaindia",
        "review_rating": "8",
        "review_title": "All the hot boys come on make some noise... Om Shanti Om",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "souravbanerjee21",
        "review_rating": "9",
        "review_title": "good nonsense flick",
        "review_detailed_main": "Great movie to watch if you don't expect any stories and if u like real-nonsense fun . Many people would criticize the lack of good acting, storyline etc etc, But why need a story and blah blah .. when its so much fun without a plot. \"Enna Rascalla --Mind it. \" This scene is probably one of the most hilarious scenes I've ever watched (May be because I'm a big time Rajni fan too).\n\nDeepika Padukone with all that hype surrounding her, is definitely worth a watch but probably the weakest part of the movie. This may be because every time she appears, the movie takes a slightly serious/senti turn.\n\nAnyways, Just lock your brains and watch the movie. I'm sure you'll like it.9/10 .."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "shivakumarvishwa",
        "review_rating": "4",
        "review_title": "Overrated",
        "review_detailed_main": "I went to this movie with my family after Diwali.This was my second movie which i went on November the first was \"Jab We Met\"(By the way me and my mother went for that).OSO is average.To me this should have been a Flop.To me this should not have been the no 1 movie that position should have been taken by\"Jab We Met\"that movie was really brilliant.The problem with this is that it is a style over substance movie.It does not have enough of substance.Story is not bad.The first half is set up in the Late 70s.It tells about Om who lives with his widowed mother.He is an aspiring.He has a friend named Papu.He falls in love with Shanti a film star.One day both are killed.Second half is set up in 2007.Both are reborn.Srk is Okay,Deepika is okay but i think the beautiful Sonam Kapoor should have won the best female debut instead of her.The script is bad.Cinematography is excellent no single mistake there.Sadly Srk becomes more commercial with this crap.But it is a good effort.The music is wonderful.The best sequence was the\"Deewangi Deewangi\"song.That what gets it a 4/10 i would have gave it a 3 otherwise"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "fonz_enigma",
        "review_rating": "9",
        "review_title": "Frankly I hate most Hindi movies but I loved OSO",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Amit_saxena",
        "review_rating": "2",
        "review_title": "Avoid Om Shanti Om",
        "review_detailed_main": "If you intend to watch any sensible movie , Om Shanti Om is strict No. Its story revolves around the same Bollywood Classic stories on love and supernatural powers.\n\nThe saddest part was the ordinary presentation of the movie that made it hard to stay for 3 hours.I felt the movie as a horrible and easily predictable drama. SRK with his peculiar style was unable to attract the Audience. Though Farah Khan tried hard to capture audience by bringing the whole Bollywood stardom, the movie at the end proved awful.\n\nStill, if you want to try, watch the movie and decide about its quality.\n\nAmit"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "ilpintl",
        "review_rating": "9",
        "review_title": "Pure enjoyment in this salute to '70's Hindi cinema...",
        "review_detailed_main": "Growing up in 1970's India automatically implied a steady diet of Hindi masala films. They were deliciously lowbrow extravaganzas packed with songs and dances, melodrama, overwrought plot lines that were pinched from any number of sources, and amusingly huge lapses of continuity and logic. This \"formula\" had several practitioners, the foremost being Manmohan Desai, whose \"Amar, Akbar, Anthony\" had scenes of inspired looniness that remain unrivaled to this day. Of course, they were silly, but they were magnificent fun, and are all the more beloved because they date back to our childhood. It seemed the world was young and carefree, so full of promise, optimism, and potential that even the most implausible Hindi film somehow seemed credible.\n\nThirty years later, Farah Khan has made \"Om Shanti Om\", an ode to that era of Indian cinema. With great affection, the film references the blockbusters, the garish fashions (that we faithfully mimicked and thought so groovy), the stars, and the melodramatic story lines of that time. Magpie-like, Farah has filched bright and shiny objects of improbable provenance to embellish her homage to the films of her (and our) childhood. I read somewhere that she conjured up the idea for \"Om Shanti Om\" while she was a house-guest of Andrew Lloyd-Webber. Sir Andrew, himself a practitioner of the deliciously lowbrow, might be flattered that in her film, Farah has staged a number reminiscent of his own \"Masquerade\" from his long-running, yet soulless \"The Phantom of the Opera\". Like him, she has assigned a rather important role to a lighting fixture, and used a symphonic orchestra as back-up band (the Prague Philharmonic\u0097certainly a first in Hindi cinema) for her hero's show-stopping finalé.\n\nAlong with these new elements, she includes nods to actors, famous films, and thanks to the magic of CGI, even a brilliant number where her leading lady sings and dances with major stars of yesteryear.\n\n\"Om Shanti Om\" opens with the shooting of the 1980 Subhash Ghai hit \"Karz\". (Avid cinéphiles know \"Karz\" was \"inspired\" by the American film \"The Reincarnation of Peter Proud\".) In fact, the song \"Om Shanti Om\" is being filmed on Rishi Kapoor, the hero of \"Karz\", and Om, the background performer (junior artiste, in Hindi film parlance) hero of \"Om Shanti Om\", is one of the faceless members of the audience. Om's most sincere dream is to be a big star someday, and like an Indian Walter Mitty (and some clever use of CGI), he imagines himself in Rishi Kapoor's place, in a silver lamé glam-rock jumpsuit, basking in the applause and adulation of screaming fans. Om has another, just as unattainable dream: Shantipriya, the most successful and glamorous leading lady of the era. He addresses large chunks of dialogue to her gigantic beautiful visage that looms over him from a street-side hoarding for her latest film, \"Dreamy Girl\", oblivious to the snickers of passers-by. Along with his dreams, Om has a mother who believes he can accomplish anything, and a selfless best friend who wants nothing more than for Om to succeed. The filmi Ma and the best buddy are ubiquitous tropes of Indian Cinema, and in the hands of Kirron Kher and Shreyas Talpade, the roles are both spoofed and played straight for poignant dramatic effect.\n\nAs this is the movies, anything can happen, and does. Om finds himself having a close encounter with Shantipriya at the premiere of \"Dreamy Girl\". The next day he is a background-performer in a scene where the hero saves Shantipriya from a blaze. The leading man loses his nerve when the fire goes out of control, and our man Om jumps in to save the day. The two become friends. However before he can profess his love to her, things go horribly wrong, and Om perishes trying to save her life.\n\nThirty years later, we meet a reigning superstar of Hindi cinema, Om Kapoor, with a distinct resemblance to the deceased Om. He is spoilt, obnoxious, and oversexed, everything poor short-lived background-performer Om was not. But once his memory is given a few jolts by some staged studio fires and a visit to a derelict film studio, he realizes he is Om, reborn to avenge past wrongs.\n\nI loved everything about \"Om Shanti Om\". In Farah Khan's previous film, the hit \"Main Hoon Na\", she had passing references to the songs and the look of the seventies. Her new opus, \"Om Shanti Om\" is an unabashedly shrewd and commercial film, but there is no denying that it is a full-blown love letter to the cinema of the seventies. For years, I was ambivalent to Shah Rukh Khan's work, but with \"Main Hoon Na\", \"Paheli\", \"Chak De India\", and even the Karan Johar NRI (Non-Resident Indian) sagas, I have become a big admirer. Success agrees with Shah Rukh Khan, the actor: he seems to try less hard to make an impression, is comfortable in his skin, and so can focus better on the character he is playing. His willingness to laugh at himself makes his screen persona that much more appealing. He is simply wonderful as the two Oms, creating two distinct characters with a single mission.\n\nSpecial mention must be made of suave villain, Arjun Rampal and Deepika Padukone, the new actress who plays the '70's star Shantipriya. With her statuesque beauty and patrician elegance, she recalls Hema Malini in her heyday. In even the cheesiest settings and the most ridiculous costumes and makeup, Ms. Malini\u0097and now Ms. Padukone\u0097would display an innate dignity. Another star of the film is the production design. I loved the gorgeous Art Deco film studio, the film sets, the vibrant color scheme and look of the film. Great care and thought (money, too) have gone into this project, and modern film technology is used seamlessly to render the illusion all the more believable.\n\n\"Om Shanti Om\" is a celebration of fun and the joy of Indian cinema: Farah Khan deservedly has a huge hit on her hands."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Guj",
        "review_rating": "8",
        "review_title": "Great Fun!!",
        "review_detailed_main": "I have seen my fair share of Bollywood movies, and was quite anxious to see this movie in particular as it was the first Hindi movie i owned on Blu-Ray, and boy did it not upset!! Watching this movie at home i was impressed, the lavish colours, beautiful sets and awesome intentional overacting!\n\nThis movie is not meant for Filmfare awards, thats not why it was created. this is a sort of light-hearted black comedy that was created to entertain (even though it received 10 Filmfare award nods) i started watching this during a break from exam revision and ended up watching the whole thing, i just couldn't get enough.\n\nThere are more cameo appearances than one could shake a stick at, and this made the film fun for the young or old, having family members pause the movie and trying to guess who they are is just awesomely well done and sooo captivating from Farah Khan, really brings people together, and ignites the Bollywood in you.\n\nThis movie also introduces Deepika Padukone, and my gosh i could not believe this was her first movie. she was amazing, really lit up the screen when you saw how beautiful she is portraying a 70's heroine. SRK's performance and new appearance are both awesome, as hes allowed to act (and strut) his ass off, of which he does very well, and its understandable why he is crowned King Khan. all i can really say about him is \"Vaah! Kya acting kar raha hai!... Vaah! Kya acting kar raha hai!\"\n\nAll in all this movie is fun, exciting, entertaining and a great laugh. i highly recommend viewing this on Blu-Ray and letting those lush on-screen colours EXPLODE!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "souvikarka2004",
        "review_rating": "1",
        "review_title": "awfully bad movie with no substance",
        "review_detailed_main": "what a disgusting movie.why do people waste so much money in making such a trash and again why do people waste so much money in watching such a trash!!!!!!!!!!!!!!mindless cheap entertainment.3hrs of who knows what!!!!all spices blended into one recipe.even the advent of a disgusting ghost at the concluded scene.whats anybody going to gain from such a crab?a money loving auspiciously incapable actor/producer only searching for even more money and some insensible uncultured fans flocking for some few hours of cheap entertainment and self-realization.the only good point of the movie.it highlights the success formula in present world.MARKETING AND MORE MARKETING.it can make u rich even without any substance."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "QaReZmA",
        "review_rating": "9",
        "review_title": "Masala film in the best form!",
        "review_detailed_main": "It's a bird\u0085 it's a plane\u0085 its mohabbat-man!! Farah Khan is back, with a movie that clearly depicts her love for Bollywood in a affectionately humorous way. Who else would have thought that someone could easily take the credit for one of the most famous quotes in Indian cinema? With Farah, everything is possible, she even has Shah Rukh wrapped around her fingers.\n\nThis movie had already made more than 100% profit even before the release of the film, the rights sold to Eros, cost 65 crore, that is a 35 crore profit from a cost of 30 crore, they could have released the movie tickets for free, but then stampedes and over-crowding of Cineplex's would incur loss in civil lawsuits against her and SRK, the producer of the film.\n\nWe see SRK playing a Junior Artist in the late 70s, the settings, and ambiance brings you back to numerous memorable (but also funny bone tickling) moments in the Bollywood industry. For those who have grown up watching those 70s and 80s movies, there are a lot of scenes you'd identify with and also roll on the floor laughing.\n\nNewcomer Deepika is playing Hema Malini-ish heroine in the 70s, even appears with many surprises and familiar faces of that era. Our (junior) hero falls for her only to discover some surprises in the interval, and later is involves in an accident that takes his life.\n\n'Pickar abhi baaki hai, mere dost' as we hear in the promos, the movie is yet to continue. Om is reincarnated, and 30 years later (thankfully, cos seeing SRK play his 20s is no more acceptable) we see him as an arrogant actor born to a famous filmi family (hint\u0085 hint). And from here, with a series of events, (the new) Om regains his memories from his previous life, and is determined to take revenge.\n\nThis doesn't mean the second half is filled with boring dramebazi, in the 2000s we actually we to see more parody and spoof portrayed on the actors of the current era, and many references made to the current situation of Indian cinema\u0085 want to know more, I guess you should catch the movie, cos Farah is a much better story teller than me!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "1",
        "review_title": "Om Shanti Om is a major disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "TuFNuT",
        "review_rating": "8",
        "review_title": "Grooving to the 70's Era ... \"Masaaledaar\" Entertainment..",
        "review_detailed_main": "This movie has created probably one of the greatest hypes in Hindi Movie Industry. But that is the way things are with every time there is a Shahrukh Khan release, the entire build up is like a Mega Event and talk of the town.\n\nDoes it live up to the hype? Well... Answer is both -- Yes (if you are looking for pure entertainment), and No (if you are logical and expect every movie do be a godfather or mother India)\n\nFor starters, when i watched this movie (First day First Show). SRK and débutant deepika acted well. Other performances were also pretty good. But at the end i got the feeling that there was something in the movie which was amiss. What was it? Was the storyline a drivel.....? Well yes, it was my logical mind cropping up!! Thats the most deadly mistake you can do while watching a Bollywood Masala movie and particularly Om Shanti Om.\n\nHmm.. So I did a retake and watched the movie again, two weeks after its release when all the dust (of hype) had settled down. And it was an immensely enjoyable experience this time. I loved those scenes which I didn't think much first time around, the overacting mother(Kirron Kher), the convincing villain, even the horror twist to the story!\n\nYes Om Shanti Om is a must watch and a great cinematic effort for the following reasons: 1) How wonderfully the era of the 1970's has been re created. truly superb job. the sets, costumes, mannerisms leave you mesmerized and make you want to go and actually live in that era for a day at least! 2) This may not be SRK's best work as an actor.. BUT hats off to him for a spell binding performance. His portrayal of the 70's character, the mannerisms incorporated in acting are simply superb. the reinvention with Six Pack abs is relevant with his YO... \"FISH IT, MIKEY ACT\" in the second half. The King Khan carries the entire film on his shoulders. 3) The funny and light take on the Hindi Movie Industry starting right from the spoofs on legendary actors to the modern era. Its actually a film within film.\n\n4) Natural and heart warming performances by Kirron Kher (90% Moms in India are like that only), Shreyas Talpade and Javed Sheikh (Om's Dad). Stunning debut by deepika!She has oodles of charm. Rampal makes the macho villain.\n\n5)Some fantastic dialogues, the best one being SRK's acceptance speech of the award.\n\n6) great music dished out.\n\nAll in all a film meant to be enjoyed and relished. PRECAUTION: Leave the logical brains out of the Cinema Hall and watch King Khan set the screen on fire..!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "nkalyanr",
        "review_rating": "9",
        "review_title": "a must-see for SRK fans !!!",
        "review_detailed_main": "I have noticed that fans of bollywood movies, especially Indians, either love SRK or hate him(most of all for his mannerisms). So, if you are in the latter this movie may not \"convert\" you although you may still watch it for its excellent music and tongue-in-cheek humor. But, if you are an SRK fan, then this will be likely up there in your top-3 list of must-see SRK movies. it is a tour de force performance by the Khan as he shines in all departments of histrionics, and effortlessly carries the movie on his shoulders(I believe he is in every scene, not unlike most Kamalahasan movies - his Tamil superstar counterpart) - and whether he is romancing, tearing up, hamming it up or being a comic - he is at the top of his game - this movie likely represents SRK at the peak of his dramatic showmanship skills - especially his skills as a comedic actor - I believe that in the current Bollywood landscape, he is likely the best dramatic & comic actor around, bar none. The wonderful soundtrack , especially the final Broadway-operatic style climax no., as well a bright, young supporting cast does not hurt either. And of course, kudos to Farah Khan as the auteur of an endless entertaining, creative fun film unique among Hindi movies in the mad-magazine-like sense of spoofy comedy which enlivens and charms the whole movie - terrifically entertaining, two thumbs-up. As an SRK movie, it probably rates a 10. I stopped short probably only because at the end of the day it is \"merely\" terrifically entertaining ! A 10 is probably reserved for those magical unforgettable great ones like Sholay, that go beyond mere comic entertainment?"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "skpsmart",
        "review_rating": "2",
        "review_title": "Creative Bankruptsy!!",
        "review_detailed_main": "Yesterday after resisting myself for a long time i saw \"Chak De! India\" and today by chance i happened to see \"Om Shanti Om\". And i couldn't help comparing the two movies. But then this comment is about OSO so i will restrict myself to that. The title of this comment will tell you what i think of this movie in particular and Bollywood in general.\n\nAgreed that SRK is a brilliant and versatile actor. Agreed that a movie need not be original to be entertaining. But shouldn't a movie have a story? And preferably a script, even if not original? OSO has none. Its a shame that the so called \"power group\" of Bollywood decided to make a movie but couldn't find someone decent enough who can think of a good story and write a decent script. All they could do was get all their friends together, have lots of song and dance sequences, write corny dialogs showing how good they are at spoofing and the result was OSO. It would be better if Farah Khan restricts herself to choreography.\n\nBut then the movie is making good money at the box office.People are calling it an \"enternairer\" and i seem to be the only fool trying to justify why i gave a two to this movie. Movies like OSO have made me stop watching Bollywood movies. But then last week i also saw an unknown movie called \"The Blue Umbrella\" and it reassured me that good cinema can still be expected from Bollywood."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "ttzhckc",
        "review_rating": "10",
        "review_title": "To good",
        "review_detailed_main": "I say 10/10 because it was really good and the plot was really good and my type of movies are like theses the cast were really fine and everything The main girl was so beautiful everything abt her was so perfect and the songs were so good I liked it."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "virindra",
        "review_rating": "4",
        "review_title": "Don't come back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Humblyy",
        "review_rating": "10",
        "review_title": "A Parody on Bollywood that is not to be missed.",
        "review_detailed_main": "This movie is quintessential bollywood or I should say It's a parody, a satire on filmy reality and people working in it and the issues they are facing whether it be nepotism, favouritism, actresses not getting roles after a child, starkids throwing tantrums, biased award shows and many more. It literally mocks everything including it's own creators. it is a spectacle of many events, a total Bollywood masala all crammed into one movie!! The film both pokes fun at itself and celebrates its unique, inimitable style. It offers everything that bollywood is known for in the world.\n\nIt is the story of \"Om\", \"Shanti\" and bollywood as whole. Om is a junior artist who aspires to be a main lead in a movie someday, he idolises a female star \"Shanti\" and wants to woo her but tragedy hits and everything gets bonkers. The songs in this are beautiful and fun at the same time. It's a Must watch if you are trynna get into bollywood."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "mrdavidmitchell",
        "review_rating": "10",
        "review_title": "Amazing story",
        "review_detailed_main": "Probably the worst trailer ever, it's nothing like the movie. The story contains it all, love, drama, comedy, action. Highly recommend.\n\nIgnore the low ratings. This story should be a Broadway show. It's that good!\n\nThe story is subtitled in English, and the story line is based on reincarnation. I don't support or believe in reincarnation, but I mention it because it will help you follow the story."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "king-ryan9",
        "review_rating": "1",
        "review_title": "Heck of a movie!!!",
        "review_detailed_main": "Wow...!!! probably the dumbest movie I have ever seen... SRK Sucks.. The direction was good...poor star cast n horrible acting... Well....Was Deepika actually there in the movie?? She's hardly seen 4 20-30 minutes...and the worst part is that she won the film fare award 4 the best debut female actress! I never knew that this movie would end as a horror stuff now..Some positive aspects about the film- Deepika looks good and Arjun Rampal has proved a point. God sake I dint waste my money watching it in a theater. Real waste of time movie. Don't go by the charm. Think twice before watching any Srk movies..as its proving right these days.The Movie was a hit because of Srk and the hype created by media.Sawariya was better than this one. At least it had a story."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "jazzyisdname",
        "review_rating": "8",
        "review_title": "I watched this movie today",
        "review_detailed_main": "I never watched this movie coz didn't know how nice It can be. I gave it 8 stars actually and I am not a fan of any of the actors but Deepika here is so Beautiful and Sharukh Khan with his acting creating a beautiful connection with the audience. Also, talking about songs, this movie has one of the best albums. Ajab si song and every other song is so beautiful and energetic. A must watch."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sanjid_ccl",
        "review_rating": "2",
        "review_title": ".....just surprised me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "GypsiB",
        "review_rating": "9",
        "review_title": "Thoroughly Enjoyable",
        "review_detailed_main": "The less known about the plot of this film going into it, the better. In brief, Om Prakash Makhija (Shah Rukh Khan), a \"junior artist\" at the movie studio, is in love with top actress Shantipryia (Deepika Padukone). They both meet with an unfortunate event, and are killed. Thirty years later, Om Kapoor (Shah Rukh Khan) realizes suddenly that he is the first Om reincarnated, and sets a path to avenge the death of Shanti.\n\nComedy and drama combine to make this an entertaining film. In addition, Om Shanti Om, makes gentle fun of itself and Bollywood movies in general, adding another level of fun. Both of Khan's performances are solid, and Padukone (in her debut role) is a confident, convincing actress. The movie is full of Bollywood big names giving special appearances and cameos --well over 50-- giving an added dimension to the movie, as the viewer tries to recognize them all. It contains impressive dance numbers, with mostly good music. Overall, while not perfect, Om Shanti Om is thoroughly enjoyable.\n\n(Other cast members include Bindu in a small role, Kirron Kher as Om Prakash Makhija's mother, Arjun Rampal as Mukesh Mehra, and Shreyas Talpade as Pappu Master.)"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "t-14097-00554",
        "review_rating": "10",
        "review_title": "AMAZING MOVIE! I've watched more than 20 times!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Sumeet_Pradhan",
        "review_rating": "4",
        "review_title": "Doesn't worth 200-300 bucks.....",
        "review_detailed_main": "SRK and FK are back after MHN with another somewhat spoofy, so-called 'masala' movie. Inspired by Karz, it's a reincarnation movie. The first half depicts the budding love-story whereas the 2nd half is more of a revenge drama.\n\nSRK and co. are quite audacious that the movie is an out and out masala movie (whatever that means) with little or no logic whatsoever. At one point of the movie, a director boasts that he has placed three camera, one from Ray's angle, one from Bimal Roy's and the third from Guru Dutt's angle. The producer quips back to use a Desai angle, that would help the most. Ouch!! But the fact remains that even if you claim that you are deliberately overacting that doesn't help your dismal histrionics, even if you claim that you are copying past movies to pay them 'tribute' that doesn't hide the lack of creativity, even if you take the excuse that bollywood movies generally lack logic that doesn't hide the fact that your movies in certain parts is still illogical. Then there is the much talked about Filmfare award scene. Nicely done but I feel the spoofs coming on TV are at times much better even though they don't have any stars spoofing themselves.\n\nComing to the brighter side of the movie, Deepika Padukone looks great! (though the girl playing Dolly has better cleavage). Special effects are very well done especially the song in which some older movie scenes are seamlessly merged. The music is decent with one or two good songs. And of course there are many-many stars making guest appearances through out the movie.\n\nOn the whole, I would certainly not recommend to spend 200-300 bucks to catch it in a theater. Catch it on a rented DVD or wait for the TV release."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "manyashah-23708",
        "review_rating": "8",
        "review_title": "Classic",
        "review_detailed_main": "This movie is just one of the must watch movies! It's just classic... Just watch it once!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "kezialobo",
        "review_rating": "3",
        "review_title": "Reincarnation of a disappointment",
        "review_detailed_main": "This movie is the same saga told over and over again. the only reason people will watch this movie is because there is SRK and Deepika Padukone, but there is no other reason to watch this movie. oh and the ending a big big disaster. Shreyas Talpade was a surprise. A complete natural, he stands on his feet all through, not getting swayed while sharing the screen space with the topmost star. Kiron Kher was delightful as usual. Arjun was an apt choice for the role he played. Deepika looked stunning. Manish Malhotra and Karan Johar have done a good job with the wardrobe.\n\nThe hype for the movie was better than the movie itself. There was no originality in the story. The script, screenplay and the direction is flawed. The dialogues are irritating. The only saving grace of the much hyped movie is the music. Main Agar Kahoon and Dard-e-Disco stand out. the three that i have given as a rating to the movie is 1) for SRK 2) For Deepika 3)The songs. if you are expecting a logical conclusion or a logical explanation to the movie don't expect one because this movie wont offer one. its a masala movie that was made for a one time watch."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "kamruj",
        "review_rating": "10",
        "review_title": "An Excellent & Purely Original Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "dhingra-ashok",
        "review_rating": "10",
        "review_title": "excellent --- Very well done Farah & Shahrukh",
        "review_detailed_main": "It was my choice of seeing one of the two films which were at the same hall. And the public opinion was more tilted in favour of OSO so we decided to go for it--me and my wife --we generally see movies once in a while and may be four in a year. I am so fond of movies but all the desires do not get converted into reality.\n\nAfter seeing this movie I came out with a total satisfaction after a long time have seen a very good movie.. I have seen all the good movies in the market except some of the English ones.Now shall see the other one after a while.\n\nMy all the blessings are for Farah and Shahrukh for making this film a very good one.\n\nKeep it up.\n\nFarah dear wish you all the best for your new leaf of life--- having children -- they are the most sought property in the world for the parents.\n\nWell done India-- Chak De India"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "p99",
        "review_rating": "4",
        "review_title": "Would have worked great as a 70s style flick......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "PreeteshPanchal",
        "review_rating": "10",
        "review_title": "Great film! you got to see it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "vidya_k_82",
        "review_rating": "1",
        "review_title": "arrrrrrrrrrrrrrrrrrrrrrrrrrrrgggggggggggggghhhhhhhhhhhhhhhhhhh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "aero_taurus84",
        "review_rating": "10",
        "review_title": "Masala Entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "chiyoungt",
        "review_rating": "9",
        "review_title": "Best colorful movie to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Sherazade",
        "review_rating": "4",
        "review_title": "Hey I'm not going to say it was disastrous but it wasn't brilliant either!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "dupelose",
        "review_rating": "10",
        "review_title": "oooooooomm discoooo shanti oopm",
        "review_detailed_main": "I enjoyed it, took me one breath and it was finished i loved the numbers and coreos, that 2007 fashon grip served hands down ill try not to deep dive BUT i just gotta say that besides this being super fun, it feeds the culture of stalking, especially ON WOMEN, acting like its a normal thing, and casting....the girl was 22 at the time and srk is like 45.......im sorry srk baby boy, but u were hela hot here, i just dont like these age gaps .......songs were fire, and the scene when hes deaf mute handless legless..........."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "adroit_miracle",
        "review_rating": "1",
        "review_title": "Biggest Propaganda and Worst Movie of Century",
        "review_detailed_main": "I am a great admirer of SRK though i cant say the same for his movies.But after Chak de the hope that one day i would see SRK doing something which can be talked about across the globe got a major boost. But i guess i was in for a surprise. After Chak De ,SRK does a OSO. What a waste of time and money. There was no need for a movie like this . We watch this kind of stuff everyday on MTV and STAR TV where in they make fun of movie and people .\n\nThis movie is all about non sense things. So if u like non sense ...Go for it . This is absolute junk and don't believe the critics ,SRK and his production company has managed it.\n\nSo if u are dumb and cant judge then OSO should be ur movie.\n\nElse go watch American Gangster.\n\nSRK fans,Please don't take pride in being foolish. Its okei....SRK is known to make idiotic movies for his is known to fool his foolish fans.."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Pyenoh",
        "review_rating": "8",
        "review_title": "Great children's movie",
        "review_detailed_main": "I've had people tell me it was a waste of time of a movie, and was starting to believe that with the slow opening. Once the mystery kicked in, I forgot about lovey dovey musical opening.\n\nI can understand why some people didn't like the movie, it is very musical , but sometimes the music plays wonderfully into the plot.\n\nIt's makes fun of the Indian cinema industry, but doesn't loose focus on the mysterious plot. Don't have high expectations. It's a great film to watch with your kids ages +6. It makes fun of some key points in cinema history.\n\nWatch it for yourself.\n\nI enjoyed the mystery, and of course sexy Shahrukh."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "kiran_polavarapu",
        "review_rating": "8",
        "review_title": "this one surely clicks!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "silvan-desouza",
        "review_rating": "1",
        "review_title": "Are the makers dumb or audiences?",
        "review_detailed_main": "I can't figure out who is more dumb? Srk takes audience for granted and Farah will keep making such worthless tributes of 70's films and people will keep going to watch such stuff Sadly this is no MAIN HOON NAA either which was at least time pass\n\nThis film is boring, boring and boring\n\nThe spoofs are dull, barring a few scenes most are so badly handled that you cringe\n\nThe first half is lifeless and can put you to sleep There is no story and no continuity in the film, the tempo keeps slowing down The interval point is also childish,\n\nWhile the second half seems a watered down version of KARZ and falls flat The sudden revelation to SRK after the song DEEWANGEE looks too sudden and the climax is too stupid\n\nFarah Khan handles the film too badly Music is good, some songs are good\n\nPerformances SHAHRUKH is unbearable here, oh i agree it's a spoof so you have to overact, but he overacts so badly in both the halves that he gets to your nerves especially in the drunken scene where he looks gay, He overacts worse in the 2nd half, dual roles are not his cup of tea Deepika shows some sparks in first half but is bad in 2nd half Arjun Rampal is good in parts Shreyas is great Kirron Kher is bad, while Javed Sheikh and the rest are OK"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "loyolite",
        "review_rating": "8",
        "review_title": "Wow.. fantastic job with an age-old theme of re-birth",
        "review_detailed_main": "Excellent movie ...highly entertaining ...hilarious at times !!! SRK has again proved that he is definitely the KING of Bollywood. And he seems to have really worked out for this movie. You can make out in his version of Salman's \"Oh oh Jaane jaana\" . And he looks good as always. And Deepika has also performed well. She looks very nice as well ! Farah Khan has a really unique style of directing where she seems to entertain the audience throughout the movie , right from the starting credits to the end credits. It surprising to think that the story is based on an old theme like re-birth. They way the movie is made around that theme is really good. And of course, one of the best parts of the movie is when SRK , as a junior artiste , is performing as a South Indian. That was hilarious. Some actors are there for a brief moment as themselves, but they are excellent and funny. e.g Abhishek Bachan , Akshay Kumar. I would definitely recommend this movie to anyone. Its a great family movie, very funny, good timepass !!!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "warhead_2003",
        "review_rating": "5",
        "review_title": "For those who can manage to filter the 'nonsense'.....",
        "review_detailed_main": "As much as Om Shanti Om is hyped, in media. It doesn't lives upto expectations... Well at least to mine.\n\nTo be honest, OSO started quite well. Reviving the 70s era of Indian cinema was quite entertaining and very creatively presented. I must say it made me feel that its going to be a great movie, but despite creativeness and some very well choreographed songs, I must say the 'Reincarnation' idea was not very well presented. Agreed, that the idea in the first place seemed very 'far-fetched', but then a good director can make a lame or that far-fetched idea flow well with the movie, which Farah Khan fails to do so. When compared to her previous work (Main Hoon Na), it is sad that she has not done a great job in story and plot development. However Arjun Rampal does a great job performing in his negative role, Shreyas Talpade did a good supporting actor role, not impressive but good enough, Shahrukh Khan pulls off a near or slightly above average performance (mainly due to some solid acting in some emotional scenes), while the new actress, Deepika Padukone, starts off her career in mediocre acting, but much can be expected out of her in future.\n\nThis movie, If I'm to conclude, was pure 'Masala' (for those who would just love to watch this move for the sake of cheesy and attention seeking songs with loads of guest appearances by celebrities and spiced-up special appearances). Otherwise, as one of the OSO trailers boldly says \"Most entertaining Drama of the year\", ironically it isn't. My rating 5/10"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "KingNY",
        "review_rating": "10",
        "review_title": "Definitely the best movie of 2007!",
        "review_detailed_main": "I just absolutely loved this movie from the start to all the way till end! I usually hate to watch the songs and skip it but surprisingly I watched each and every song of this movie and they were all excellently choreographed. Not only that but it was just fun to watch each and every song, especially the one with so many stars coming in but still all other songs were just as good as that one and also they all were directed to be looked like if I were watching a Broadway musical! It was just mesmerizing! Excellent music! Excellent acting! Excellent direction! Great story! And also there wasn't even a single second in the movie were you think that its getting boring. The sets in the movie are really relaxing to the eyes and it makes you feel not to get off your seat. It was just a very smooth movie and Deepeka Padukone is really hot! I personally think that this movie is also a contender for Top 10 Bollywood movies of all time!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "ash-rai",
        "review_rating": "9",
        "review_title": "Best BOllywood movie of 2007!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "kabirdas007",
        "review_rating": "2",
        "review_title": "One word... Dard-e-Disco!!",
        "review_detailed_main": "Songs, dances and a few funny sequences are somewhat saving grace in the movie. Otherwise there is no story in the movie at all!!\n\nDoes Farah Khan think that Indian audience have no brains!! May be that's right. But \"Kam se woh to khud thoda dimaag laga leti\".\n\nThere are so many places where even a stupid person will wonder how it is possible - like Arjun Rampal gets up, and there is none in the room - earlier he was roaming with bodyguards. Etc etc. List is endless. I am sure they could have done a better job in coming up with a better story, and could have still remained funny.\n\nKiran Kher as usual irritating. SRK is good, but I think it is high time he starts taking better roles. Shreyas has done justice to his role.\n\nFinal recommendation, don't go and watch the movie - Save time and money."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "kat_777",
        "review_rating": "8",
        "review_title": "Entertaining",
        "review_detailed_main": "Om shanti om is not a great film but it is an excellent entertaining. No one gets bored from beginning till the very end.\n\nOm prakash makhija (Shah Rukh Khan) is a very successful 'junior artist', who inspires to be a hero one day. His best friend Pappu (Shreyas Talpade) supports him by praising his talent and style. Even his mother (Kirron Kher) encouraged him to be a hero by saying 'Tum ek din zaroor hero banega' (You will definitely be a hero one day). Om is madly in love with the super star of that time ShantiPriya (Deepika Padukone) and even meets her one day luckily. But unluckily after learning a secret about hers he lands in trouble.\n\nThe photography is excellent. There are many notable and catchy shots. The art direction is incredible. Lot's of effort was taken in creating the settings especially for the song dhoom Tana. Editing and sound are of notable features. Songs are stupendous. Ajab Si, deewangi, dhoom Tana are exemplary. The performances are good from all actors. Shah Rukh Khan as usual shines in his role. Arjun Rampal, Shreyas Talpade and Kirron kher did well in their respective roles. And Arjun Rampal is a wonderful villain. . The new comer Deepika Padukone is very in all aspects and she deserves all the awards she is getting. The most catchy part of this film is the song sequence deewangi deewangi where thirty one stars appear.\n\nGo watch it!!! all those who likes Shah Rukh and entertaining films will definitely like this.\n\n8/10"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "prateekfigo-1",
        "review_rating": "4",
        "review_title": "This movie is a super-hit,sans any script!",
        "review_detailed_main": "After all the pre-release drama and hype,it finally comes down to the opening night.Om Shanti Om,tipped and predicted to be the biggest blockbuster of the year,lives up to all the expectations.Earning a mammoth Rs. 19 cr. on the very first Friday,this one's sure is living up to what it was anticipated to be.Very much a Shahrukh Khan potboiler.Farah Khan proves yet again that she is better off in the choreography arena only.The movie lacks a script altogether.But having Shahrukh Khan as an ambassador can do wonders for any waste product,which he surely has done to this flick.Deepika Padukone looks stunning in this one.A nice launchpad for a Badminton champ's daughter,who's bowling over some of the cricket champs in India(not quite literally).Shahrukh Khan may be the most bankable star still,but this movie is no Swades,and so no Oscar rumours this year(and don't I thank all the Gods for that!).An entertainer throughout,go watch Om Shanti Om for fun in the evening,but don't forget to leave your brains at home!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "DesiBaba",
        "review_rating": "9",
        "review_title": "A stroke of genius from Farah Khan.",
        "review_detailed_main": "I've watched this movie about 7-8 times in the last 14 years. It still holds up as of 2021. I'm not a fan of Farah Khan comedies/spoofs in general or a fan of SRK. But it is only fair to give credit where it is due -- I have to admit, this movie just works! Music is awesome and casting is perfect. This is not for everyone, especially for those new to Bollywood. But if you get Bollywood, you will get this movie, and likely grow to love it. Perfect blend of everything that makes Bollywood works, unabashed entertainment."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "ab-47531",
        "review_rating": "8",
        "review_title": "How dare they",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "salilgoyal",
        "review_rating": "4",
        "review_title": "One of the Worst Climaxes I have Seen",
        "review_detailed_main": "Almost an year back, a similar kinda movie released known as Dhoom 2. It has some striking resemblance with Om Shanti Om. First, the hype. The movies were promoted quite extremely. Second, star cast. Both featured an excellent star cast; enough to pull people to the theaters . Third, Good Music. Both Music Albums were instant hit. Fourth, Silly and Senseless Plot. And Last, Majority liked it and made (making) them blockbusters.\n\nThe major difference is that Dhoom 2 was a crap all the way while Om Shanti Om is a garbage, only in second half. I've to admit that I enjoyed first half well and was expecting something even better in second. But things got so worse in second half that I wanted the movie to end 30 minutes earlier. The climax was so terribly shown that made me question Farah Khan's ability as a movie maker.\n\nI have no problems with the comic filmfare award ceremony and all hilarious stuff. I enjoyed it. The problem was that the scenes that demanded seriousness were also made comical. Now a 2007 actor (Om kapur aka SRK) playing a character like 'Mohabbat man' seems unacceptable. If he's a filmfare award winner superstar how can he play such roles when he later accepts in the film that he chooses his scripts carefully.\n\nThe reincarnation and revenge plots demand seriousness and creativity because you have to make people believe in things that are somewhat unacceptable. But the movie was too focused on 'destiny' that Farah Khan didn't take pain in having a good storyline. Perhaps she is intelligent enough to know that a good story and plot has no takers in Indian cinema. It is the hype and star status that sells.\n\nAnyways, +3/5 for 1st half and -1/5 for the 2nd. This one gets 4/10 from me."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "krishnashivakumar",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "This movie was really good truly one of the best movies ever.I enjoyed this movie a lot from beginning to end.Every thing about this movie was simply fab be it the acting,music,plot.This movie has a really cool storyline and liked the way how the reincarnation was portrayed.Another thing that i liked about this was that it was very colorful movie and also the cinematography was really good.I also loved the spoofs that were made of the old 50s,60s,70s movies it was good.The music and songs were amazing the Deewangee Deewangee song which had lots of celebrities was simply sensational so was the Dard E Disco.The concept of this movie seemed very refreshing and new.The acting was extrordinary.Shah Rukh has proved himself as powerhouse performer by giving a brilliant performance in both the roles.Arjun Rampal also gave a brilliant performance and i am surprised that Vivek Oberoi was the first choice for his role.Deepika acted well in the first half but barely had nothing to do in the second half but she really stole the climax scene.Shreyas Talpade also gave a very good performance in his role also.The climax for me was shocking and also surprising.Iam also a bit shocked that many people have disliked this movie because i believe these kinda movies should be watched for entertainment purposes not for serious purposes.Skipping all that i recommend watching this movie"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "pratyush",
        "review_rating": "5",
        "review_title": "An ordinary film over all",
        "review_detailed_main": "Although Om Shanti Om is an enjoyable at some levels, I can see why people who don't like Shahrukhkhanisms much might absolutely detest this movie.\n\nAny one who goes to see the movie looking for logic after watching Main Hoon Na, looking at the promos or hearing a bit about the story would be kidding themselves. It does fall apart in the second half I thought... after a bit, Shahrukh Khan, Shahrukh Khan and again Shahrukh Khan in each frame becomes weary.\n\nInstead of becoming a tribute to bollywood, which it could have pulled off, the movie becomes a tribute to Shahrukh Khan by Shahrukh Khan and his friends. For instance, we could have seen other star cast members giving more tributes to more heroes, heroines and villains of bollywood (it did happen like in a few scenes of Padukone and one tributing the villain Ajit) but it was mainly Shahrukh Khan trying to do a flick here, a flash there in an attempt to give a tribute or whatever it was.\n\nAnother aspect was the mishmash between the tribute and the wacky story. The movie tries to do two things and doesn't strike the right balance, the audience can find itself loose attention a lot of times. Farah Khan, despite all this, is an innovative director and the movie has its funny moments too. The Filmfare Awards ceremony where Abhishek Bachchan and Hrithik Roshan appear, acting arrogant was hilarious for instance. I enjoyed the movie in parts but over all, it was ordinary. 5/10."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "mksandhu52",
        "review_rating": "9",
        "review_title": "A very fun film to watch!",
        "review_detailed_main": "Om Shanti Om is just fantastic. Everything about this movie is great!\n\nI just love the 1960s style and fashion, i think it is great! The films in those days were very good and Om Shanti Om is as good as them.\n\nActor Shahrukh Khan does a great job playing his character.\n\nActress Deepika Padukone is out-of-the-world playing a double role, sometime is very hard playing a double role and Deepika Padukone did a great job.\n\nAll of the other star cast were also very good/ great.\n\nAll the soundtrack in the film is great. The song with the 30+ stars is fantastic.\n\nI review this film: 9/10! A MUST WATCH!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "nirmalasreeram",
        "review_rating": "10",
        "review_title": "Love action!",
        "review_detailed_main": "This shahruk khan movie is really really outstanding that any other kind of bollywood movies,i really enjoyed the full movie with out boaring a single minute,each one of us were keenly watching the movie with very interesting way.i cant forget the story even.that much of love and action in it!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "m_shankar20",
        "review_rating": "5",
        "review_title": "Masala, but only half as spicy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "shahrukh3333",
        "review_rating": "10",
        "review_title": "A bit of everything.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sreyanschauhan",
        "review_rating": "5",
        "review_title": "Very Disappointing.............",
        "review_detailed_main": "Well watching this movie is just a waste of time. Shahrukh khan was just over-acting in the movie, in-short he was not at his best. People can call his one of the worst movie given by King Khan. Much hyped actress Deepika hardly have any role in the movie, may for max 25min in 3hrs movie. Some part of the movie were funny, but not enough for the people to declared it was a hit. There is no link between the Om of 1970's and Om kapoor of 2007. Some part of the movie were really irritating. But songs like Deewangi and Aakho mein tere entertained people for time being. There was no proper conclusion given to the movie. The concept of the movie was taken from blockbuster hit movie KARZ, but it was not worth for it. Advice: People Don't waste your time watching OM SHANTI OM, instead sit at home and have some delightful moment with your family and friends.........cyaaaa"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "hamkohamo",
        "review_rating": "10",
        "review_title": "Hamko Hamo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "mayankmmz",
        "review_rating": "8",
        "review_title": "Made me fall in love with movies",
        "review_detailed_main": "This was one of the first movies I ever watched. I was 8/9 then. It made me cry, laugh, worry and celebrate at times. It still does. The feelings it evokes are so special.\n\nThe parody nature of it is quite apparent and if you're familiar with bollywood, it will make the film much more enjoyable for you. The movie made me fall in love with movies and also my favourite star ever: SRK.\n\nDeepika has a fantastic debut. She has acted so much better in her future films but she has never looked as good. Rampal is okay. Talpade is good and his chemistry with SRK is brilliant.\n\nLastly I want to thank Farah Khan for making this film which had such amazing impact on me."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "bollywoodplusplus",
        "review_rating": "4",
        "review_title": "Oh, its an horror movie!",
        "review_detailed_main": "The 4 out of 10 all goes to Vishal and Shekhar for some good music, esp 3 songs (Ajab Si, Tumko paaya, and Jag Soona Soona Lage). Otherwise, every other dept of the movie gets a 0 out of 10. I am sorry guys. We cannot take this nonsense anymore! SRK, please give us few more of Swadesh and CHak De before you retire.\n\nWell, Farah Khan doesn't come in the A-list of directors in Bollywood anyways, so why care! But what bothers me is the amt of limelight and buzz this kinda junk gets, just because its an SRK movie! Comedy? Its a script written, prolly mostly on the set, like one of those mindless bollywood based comedy show on any ZeTV or SonyTV.\n\nI think its a horror movie, ya, in fact I am sure its a horror movie! I was happy with the songs, till I saw the movie today. Now the songs will haunt me, remind me of the horrific 3hrs I had! Like that song from 'Bees saal baad' - Kahin deep jale kahin dil ....!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "DivyaInduSharma",
        "review_rating": "10",
        "review_title": "A movie for all seasons!",
        "review_detailed_main": "This is one movie that is sheer perfection because it is exactly what it is supposed to be - over the top, dramatic, and a light hearted spoofy take on old world Bollywood with heartwarming characters and superb acting. Everything about this movie is spot on. Fantastic music, dialogues, and superb hamming by all actors. Hard to believe that this is Deepika Padukone's first movie as she more than holds her own against the inimitable SRK, who is at his absolute finest whether he's being silly, sensitive, or insanely dramatic. Kirron Kher is her usual superb self as the 'filmy ma', and Arjun Rampal smoother than well aged scotch as the archetypal villain. Shreyas Talpade is the real screen stealer though, for his finely nuanced performance as the hero's best friend. I love watching this one when I really want to remind myself that life doesn't have to be serious all the time, and that if things aren't okay as yet, it means 'picture abhi baaki hai mere dost!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rrameshp",
        "review_rating": "1",
        "review_title": "Total Crap Manmohan Desai style",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "TharsheyN",
        "review_rating": "9",
        "review_title": "Om Shanti Om",
        "review_detailed_main": "Om Shanti Om is amazing and I could write 10000 words trying to explain the feelings and emotions it stirs in me when watching it. However I will try to keep this review shortish and to the point.\n\nStory wise Om Shanti Om is pretty unique, it deals with reincarnation and the main character being able to remember his previous life. It also to a lesser extent deals with life after death as Shanti is revealed to come back as a ghost. The story will pull you in by Om Prakash's love for Shantipriya, a successful actress and stunning beauty who through a twist of fate he saves from a fire and befriends. Just a beautiful story with romance, suspense, horror, love and betrayal.\n\nCasting wise what can I say besides it's Deepika Padukone and Shah Rukh Khan. Both look absolutely amazing and give jaw dropping performances especially Deepika. You won't be disappointed either by the sheer amount of cameo appearances made by other actors and actresses including Abhishek Bachchan, Akshay Kumar, Preity Zinta, Rani Mukerji etc.\n\nSong wise Om Shanti Om is filled with amazing musical numbers like the title song Om Shanti Om, Aankon Mein Teri, Dard E, Dhoom Tana, Dastaan E etc.\n\nSo what more can be said besides go watch it, itMs worth the 3hrs of your time and I'm sure you'll absolutely love it like I did. 9/10 from me and here's hoping for a number 2 where he marries Sandy xD."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "class_mass",
        "review_rating": "5",
        "review_title": "Ordinary remake of \"karz\"",
        "review_detailed_main": "There were few things those have created much hype about the movie such as first it was Shahrukh Khan movie and it is after the success of Chak De India, secondly Farah khan's second movie after Main Hoon Na, thirdly it has new heroine Deepika Padukone, fourth is hoards of star in a song and fifth is very good marketing and Diwali time which was promising a good entertainment. So after all has the movie been succeeded in entertaining the viewer?\n\nNot as expected really. I think the movie is unimpressive remake of the Rishi Kapoor starer \"Karz\". As I have seen both the movie and so I can say that \"Karz\" was much better than \"Om Shanti Om\". There are few reasons for that. Though the movie seems to be good for first time viewer who haven't seen \"Karz\" but in real the movie is lacking good backdrop script of reincarnation. OSO has filmy background story and dull execution of it that turn out to be unimpressive. While \"Karz\" has very good script. Songs of OSO are not good except couple of average tracks while the music and songs of \"Karz\" are melodious.\n\nThe only thing that was not in the \"Karz\" and that is extra surprise in the OSO is hoards of stars dancing in a very good entertaining song. So over all it is an average movie showing typical Bollywood reincarnation story. Though it is quite good movie for first time viewer and good time pass for the masses but not that impressive and failed to impress the people who believe in quality cinema.\n\nOm Shanti Om can not be considered among the Shahrukh khan's best work while Kabhi Haan Kabhi Naa, Swades and Chak De India can be considered as Shahrukh khan's best work till date.\n\nI can consider it as an average movie and give my rating as 5 out of 10.(5/10)"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rajdoctor",
        "review_rating": "5",
        "review_title": "Om Shanti Om",
        "review_detailed_main": "Diwali times in India, time for big budget movies to be released. Producers wait for this time of the year \u0096 Diwali coincides with ID. This year two movies were released \u0096 Sanjay Lila Bhansali's launch pad for two star kids \u0096 Saawariya and Farah Khan's Shah Rukh Khan vehicle \u0096 Om Shanti Om. Luckily OSO was released in Amsterdam and I did not miss that opportunity to go and see the movie.\n\nThe story starts in 1970s - Om Prakash Rakheja (Shah Rukh Khan) a junior artist in Bollywood film industry is madly in love with the dream girl star heroine Shanti Priya (debutant Deepika Padukone). After Om rescues Shanti from blazing fire during a shoot, they get to know each other. But a producer Rakesh Mehra (Arjun Rampal) whose child Shanti is bearing kills Shanti. Om tries to rescue Shanti but he too is killed by Rakesh's goons. But Om's spirit is born again as Om Kapoor (Shah Rukh Khan). In this reincarnation avatar Om is a super star himself and slowly gets to know the mystery of his previous life's killings. To find revenge he finds a girl Sandhya (Deepika again) resembling Shanti Priya to play the ghost to seek out the truth from aging producer Rakesh.\n\nOSO is a light remake of 1970s hit movie Karz. It gives credit of that during the first shot itself by showing the Rishi Kapoor's song Om Shanti Om. The movie is quite over the top \u0096 like Director Farah Khan herself. Too loud, too jazzy, too colorful, too festive in nature \u0096 quite suitable to Indian front bencher's taste.\n\nShah Rukh Khan does his usual antics and succeeds. New girl Deepika is good \u0096 too tall, too slim, everything is long in her \u0096 her fingers, her nails, her legs \u0096 but a good launch pad for Deepika. She has done a good job in acting and looks. Shreyas Talpade as a side kick of Shah Rukh is okay and looks absurd with a weird wig. Arjun Rampal as a villain has acted well and reminds us of 1970s movie bad man like Pran.\n\nThere is overdoes of film actors appearing as guests; the list is long (I read about 30-35) and I would only mention a few that made me notice them \u0096 Dharmendra, Jitendra, Mithunda, Rekha, Abhishek and Akshay Kumar.\n\nA typical Indian masala served during this Diwali may do well at box office. But movie does not have any class or finesse that Farah Khan delivered with her first debut movie Main Hoon Na.\n\nMusic is below average and songs are okay. The whole movie is shot on gaudy sets and to create laughter everyone overacts \u0096 like in old movies. It surely creates a tickle.The best feel good part of the movie when the end titles starts rolling and the whole OSO team is shown walking past the red carpet. If you like nonsense Indian Bollywood movies, this movie is surely for you during this festive season.\n\n(Stars 5.25 out of 10)"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "5",
        "review_title": "Srk everywhere",
        "review_detailed_main": "It's srk all the way in the movie. But it's not an SRK movie. Rather we can say that this is a Farah Khan movie.\n\nThere were some funny moments but that could not be enough for the movie.\n\nThe music of the movie was outstanding. Each and every song of the movie was really awesome."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "michael_metal",
        "review_rating": "5",
        "review_title": "Om Sharukh Om :-)",
        "review_detailed_main": "Om Shanti Om is a story based on re-incarnation and without Shahrukh in the lead role the movie would have done mediocre business. Shahrukh's been riding a wave of success and he is no doubt the King of Bollywood actors.\n\nThe first half is set in the 70s and Sharukh (Mr. Makhija) is a struggling junior artist who dreams of making it big. He dies trying to save his favorite actress Shantipriya (played by Ms.Padokone) who is killed by Mukesh Mehra (Arjun Rampal). The second half deals with re-birth, re-discovering the truth and avenging his and Shantipriya's death.\n\nChak De won critical acclaim and people expected Shahrukh to turn out another hit. However, in the absence of a strong star cast (with the exception of Arjun Rampal and Kiron Kher), the camera focuses entirely on King Khan. Shortly after intermission one realizes that the movie is a blatant remake of Karz!\n\nMy friend Pratibha who accompanied me was watching it for the second time and said she was bored stiff. The musical score is good but the songs are a shade too lengthy.\n\nShahrukh's performance is credible and laudable-if one does not leave the theater grumbling after nearly 3 hours, it is solely because of him. Deepika Padukone is average looking and does not have a lot of dialogues to her credit-she'll be better off doing supporting roles or art films. Abhishek Bachchan and Akshay amuse in their cameos.\n\nA must watch for Sharukh Fans - Yes! Wanna watch it again - no way! Remake of Rishi Kapoor-Tina Munim starrer Karz!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "shrinivas_venkatesh",
        "review_rating": "5",
        "review_title": "A Case of All Smoke, but No Fire!",
        "review_detailed_main": "OSO has rocked in the box office, but in my opinion, it is not as good as much as it was hyped. The film, though entertaining did not fulfill my expectations. Considering SRK in Chak De!, it is a disappointing performance. Deepika certainly performed well in her debut film. Arjun Rampal and Shreyas Talpade performed brilliantly. Farah Khan's direction is commendable. I feel directing such films are tough, but she has done it beautifully. No doubt that OSO's music is the best in 2007. Vishal-Shekhar's music is too good. Backgrownd score by Sandeep Chowta too is superb. Editing by Shrish Kunder could have been better. In my opinion, SRK's 6 pack abs did the film a world of good. But OSO is certainly not as good as Jab We Met."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "trekamey",
        "review_rating": "1",
        "review_title": "Boring with overacting",
        "review_detailed_main": "Too much of overacting by srk makes this less funny."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "rajat2372",
        "review_rating": "1",
        "review_title": "Piece of Sh**",
        "review_detailed_main": "After seeing first 15 minutes of the movie I turned off my tv. Overloaded with overacting...crap movie from crap director!"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "Raja79",
        "review_rating": "5",
        "review_title": "Meh...",
        "review_detailed_main": "This movie has a stupid reincarnation plot and also a very weird pacing with an incredibly long duration but overall its a somewhat entertaining film due to the acting, songs and visuals.\n\nThe scenes with Arjun Rampal are best."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "kishanlukhi",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Plz don't watch this over acting movie... What a bakwass movie ever."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "vaidyalikhitha",
        "review_rating": "3",
        "review_title": "I have to shut down my brain throughout this movie",
        "review_detailed_main": "Narration and cinematography are the only things that made me to watch this film.... few songs are gud... I felt except the heroine and villain remaining all the actors are over acting and over reacting especially SRK of course movie is imaginary and logic less it's more like a spoof on Bollywood movies itself it's a one time watch"
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "sepehrabdollahy",
        "review_rating": "3",
        "review_title": "Not a very good movie",
        "review_detailed_main": "In my opinion, the movie is very imaginative and the story is not very interesting. I do not recommend this movie to those who are interested in Indian movies. Not a very interesting movie."
    },
    {
        "movie_id": "tt1024943",
        "movie_name": "Om Shanti Om",
        "movie_rating": "6.8",
        "review_username": "calilawyer",
        "review_rating": "5",
        "review_title": "Bad",
        "review_detailed_main": ""
    }
]