[
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "chaitankrish",
        "review_rating": "3",
        "review_title": "imperfect hollywood style movie",
        "review_detailed_main": "The director made this movie by copying straight from Hollywood movie and director should make realistic movie adding little Indian culture in the movie and apart from that there is no story line and screenplay is poor never watch with family watch this movie with friends if you have no job and life is bored"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ektasharma",
        "review_rating": "2",
        "review_title": "Ok ok movie ! One time watch, even if you don't- its fine!",
        "review_detailed_main": "One time watch movie. Has some fun elements in between. Songs are nice but doesn't always fit in the movie. If the actors would have been raw/new actors, the movie would look more convincing!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shekhutomar",
        "review_rating": "4",
        "review_title": "A disaster you would want to stay away from",
        "review_detailed_main": "A movie that's neither here nor there 'Veere Di Wedding' is not the kind of wedding you wanna attend this week. With all the excitement around the release of this feature, the movie does not even come close to the hype generated by it. What contributes to this mess is that there is not a single stand out performance that could have carried the movie somewhere.\n\nIt starts off with the four friends discussing their plans after finishing their school played by four highly overacting teens. The movie then jumps 10 years later, where Rishab(Sumeet Vyas) proposes marriage to Kalindi Puri(Kareena Kapoor) who has no plans of marriage but yet reluctantly agrees. Then follows the 'Siyapa' around the big fat Punjabi wedding intertwining with the real life problems of the Veeres.\n\nThe movie has no real sense of direction with everything coming to an expected happy ending eventually. The characters seem mingled up and a couple of them could have been interchanged. The performances are average while Swara Bhaskar's(the most talented of them all) is a complete waste. 'Veere Di Wedding' is a struggle eventually giving up rather than defying the challenge."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "KenlightL",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "The cinematography looks great and the ladies look beautiful but apart from that the story, direction, acting, characters, etc is total garbage. A lot of brand placements in a single movie. Makes it less like a movie and more like a feature length commercial break consisting of various brand's advertisement. Pure garbage."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "malaninoorie",
        "review_rating": "1",
        "review_title": "It's about Air India, Uber, Bikaji, Amul, Videocon and HSBC",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "lathan-27284",
        "review_rating": "1",
        "review_title": "Cheap imitation of \"Sex and the city\"",
        "review_detailed_main": "Why don't the makers just say that it's a rip off \"Sex and the city\" . They can't even get the screenplay right when they have got the story already on the platter in the form of \"Sex and the city\".\n\nOverall it's a cheap imitation of \"Sex and the city\"."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nikeillusion",
        "review_rating": "1",
        "review_title": "Empowerment?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shuchi-anupam",
        "review_rating": "1",
        "review_title": "What a waste of time",
        "review_detailed_main": "Using cuss words and stupidity does not equal feminism. The film is simply a waste of time and money."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "beevenkat",
        "review_rating": "7",
        "review_title": "U definitely cant ignore it",
        "review_detailed_main": "U can hate #VeereDiWedding but u definitely cant ignore it. Hats off to plucky producers #ektakapoor n #rheakapoor for telling us things which no other mainstream film would. Its the story of 4 brave, independent n fashionable ladies, who frequently drink, smoke n hurl abuses. When they r upset, they go off to Phuket n then continue with their drinking n smoking. One of them sleeps with a random guy called 'Bhandari', she doesnt even know his first name. Excellent performances by #swarabhaskar n #shikatalsania. Hope to see them more often. Kareena n Sonam r okay. The film also teaches parents an important lesson, let kids make their own mistakes. Women should definitely watch it, with or without their men. Rating 3.5/5."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "lohitchauhan",
        "review_rating": "1",
        "review_title": "Story of some empowered girls",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "abobobo",
        "review_rating": "10",
        "review_title": "loved this bold movie",
        "review_detailed_main": "I'm so happy that people r accepting a bold movie VeereDiWedding where women r projected as not merely the love interest of male actors and r having blast like badasses, with open arms."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "potterpirate-23601",
        "review_rating": "7",
        "review_title": "Great Entertainment",
        "review_detailed_main": "Listen, there's a reason why this movie has 71% on Rotten Tomatoes (with objective reviewers) and such a low score on here. If you aren't living in, say, the 1800s, then you'll enjoy this movie.\n\nA lot of people are complaining about the women empowerment. Women empowerment comes in many forms. Yes, it can be educating women and empowering them in the workplace. But it can also be acknowledging that they're also just human beings like anyone else. Oh, are you offended this movie shows women drinking, cursing, and talking about sex? Do you not think some women do this nowadays?\n\nHonestly, I felt this movie was pretty relatable if you're not a prude, not a \"all I do is work and have no fun\" kinda person, not a \"wow I can't watch this with my mom, dad, sister, brother, cousin, aunt, nephew, step-cousin\" kinda person.\n\nSo, basically, if you're an average person living in the 21st century, you'll be fine."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shivams734",
        "review_rating": "1",
        "review_title": "Women Empowering movie ? Really ?",
        "review_detailed_main": "Well women empowering in a country which is still telling its population to save the girl child and to educate her , cannot be achieved by \"if men can drink then so can we, if men can masturbate then so can we\". The reason your movie deserves 1 star rating is because of the fake \" women empowering \" you all talked about. Better show a movie which would change the mindset of our male dominant society . Nobody is gonna watch this with their families after knowing about the kind of scenes you have in this movie .and mostly its the older generation who are more into this male dominant thing . So ,sorry your movie didn't make any difference ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "erisedwitch45",
        "review_rating": "1",
        "review_title": "Bad movie",
        "review_detailed_main": "My gripe with the movie is not because it has women spewing abuses. But that it's a bad movie in all sense of the word. The film is not on women empowerment, doesn't deal with women heroes. Fair enough. This has been made abundantly clear by the cast and crew and that is fine. Not every movie needs to be a serious women-centric movie. Some can be fun. And Veere is not even fun, not even close. It's plain bad.\n\nKareena looks real detached from the role, Swara is fine in acting department, Shikha is the best among them all along with Summeet Vyas. But Sonam Kapoor! Why why why is she an actress? She is unbearable in her dialogue delivery. Plain horrible especially in the scene where she is berating the arranged marriage guy. Half baked acting combined with bad and underdeveloped script and an overdose of abuses to look cool doesn't equal a good movie.\n\nPS: Anyone else seeing the sudden influx of 10/10 reviews from 2nd and 3rd June? Most of these accounts were created just couple of days back and have reviewed only this movie. Smells fishy. Is this some sneaky move by production house? Wouldn't put it past them."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "DeadMan66",
        "review_rating": "1",
        "review_title": "Worst movie gave me free headache",
        "review_detailed_main": "This movie is beyond imagination. It doesn't matter how much you try to resist and want to watch you will get free headache. The point of hole movie is to sell trash in the name of women empowerment.\n\nIf you goto acting, the time you start watching you'll think it as overacting or would say what nonsense. Story is lame. I can't say one good thing about the movie other than its women movie having fun time in life. I wouldn't recommend this movie to anyone, never ever.\n\nIf you look at the imdb rating you would see morons giving 10 star looks like imdb is now affected with some fake accounts.\n\nAt end movie doesn't deserve more than 2 star."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ammarrasul",
        "review_rating": "1",
        "review_title": "Waste of time...",
        "review_detailed_main": "Bad acting and a stupid storyline. Don't waste your time and money."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "yash-64821",
        "review_rating": "1",
        "review_title": "Stupid movie!!",
        "review_detailed_main": "Waste of money, energy and nothing new!!!\n\nWhy director/producer working on such loose scripts. No lesson except enjoy your life your way...I don't know why same masala used everytime"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vijaygadr11",
        "review_rating": "1",
        "review_title": "Sexuality,Abuse Does not mean Women Empowerment/Story",
        "review_detailed_main": "Pathetic like Hell, Just seated for Paisa Vasul by taking some AC cooling."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "tinasujithmathew",
        "review_rating": "",
        "review_title": "Karma is a B*****!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jkt2006",
        "review_rating": "7",
        "review_title": "Fantastic movie, women empowerment!!",
        "review_detailed_main": "All guys who are giving this movie low rating are either insecure or do not like women with power. This was such a fresh breeze of change and brings along real women of today who want what they want and why not!! Hats off to the producers and the director. Brilliant performances by Swara Bhaskar and Sonam, Shikha was natural. Look forward to more movies like this. Hats off!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vicky-34724",
        "review_rating": "1",
        "review_title": "worst movie of the year",
        "review_detailed_main": "It was a big loss of this year that I purchased tickets of this film and only because of that I had to watch the full movie.\n\nI would rather say ghatiya bakwas movie made in this year is Veere Di wedding. #totallydisappointed #worstmovie #nostorybase"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "zubeenazareen",
        "review_rating": "10",
        "review_title": "one of the best comedy movies",
        "review_detailed_main": "It's a movie which is very much female oriented and the emotions we go through. It is about friendship and family."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nairtejas",
        "review_rating": "6",
        "review_title": "Capsule Review: Veere Di Wedding",
        "review_detailed_main": "In a modern world full of chaos, Shashanka Ghosh's four protagonists try to find harmony in their relationships, both familial and external. Highlighting their journey through deft realism and contrived drama is what she manages in her comedy drama Veere Di Wedding, after being on a four-year hiatus to mourn the failure of the 2014 debacle Khoobsurat. In a hackneyed story that has been sampled in countless art forms before, Kareena Kapoor plays Kalindi, a young, chic woman who is about to get married to her boyfriend (Sumeet Vyas) of 2-3 years JUST because he proposed to her with a diamond ring. Introspecting her decision through the days before her nuptials along with her equally chic three friends who are confused but more (sexually) frustrated than her, Kalindi fights her familial issues and inner doubts that are mostly triggered by the blanket controlling of her beau's family in everything that she does, including the wardrobe. Director Ghosh should be lauded for crafting an indomitable chick-flick in Bollywood despite the trite nature of the story and the unnecessary hyperbole. For instance, the controversial masturbation scene involving Bhaskar's character is the most unoriginal thing in the film, which makes me doubt both Ghosh's and the writers' (Nidhi Mehra and Mehul Suri) intentions behind making this. There are many more scenes that come across as exaggerated, which although are hilarious, could have been soaked with realism to make the film not look like an exercise in man-hating and namesake destruction of the patriarchy. (Wonder what's the deal here, after the recent Lipstick Under My Burkha (2017) by Alankrita Shrivastava that also depended on exaggeration and far-right feminism!?) Nonetheless, there are a lot of great things to appreciate here: from Kalindi's gay uncles to the incredible performances of Bhaskar, Sonam Kapoor, and Shikha Talsania to the portrayal of men (Vyas's and Vishwas Kini's (fantastic performance) characters) to the free dialogues that bring out the best in the film. It's a well-made film even if we disregard the conspicuous and therefore poor placement of ads in the film for HSBS, Uber, and Gulmohar Lane. Plus, if you notice, all the books (in the bookshelves) in the film look irritatingly unnatural. I'm a 100% sure that these books were borrowed in bulk from a nearby sale (those 300 rupees per KG book sale shops that have cropped up these days) and stashed in the shelves because never have I seen the books of Bill Bryson, Wilbur Smith, and Danielle Steel in a single room; it just cannot and should not happen. What an amateur work by whoever designed the production set. Enough with the digression; Veere Di Wedding is overall a good effort for a comedy chick-flick and surely paves the road for more such films. Regarding it as crass just because you don't get the point that Ghosh tries to make makes you a hypocrite. TN."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ankurrodrick",
        "review_rating": "1",
        "review_title": "Wastage of time and money!!",
        "review_detailed_main": "What kind of women empowerment is this??? Save your money watch pokhran instead."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "lepalash",
        "review_rating": "1",
        "review_title": "Absolute piece of crap",
        "review_detailed_main": "Bollywood of course, has always been expected to produce low quality films, and it matches that expectation regularly. However, it surpasses it with this film. To put it simply, cutting off your own foot and eating it with some mustard, will leave a better aftertaste than this film."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shubhamman",
        "review_rating": "1",
        "review_title": "Worst movie ever.",
        "review_detailed_main": "Movie lacks a strong story and is full of nonsensical dialogues. Good for woman who felt that speaking a few bad words, spending their parents hard earned money relentlessly, smoking and drinking would make them independent and empowered."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "szhshah",
        "review_rating": "1",
        "review_title": "much ado about nothing",
        "review_detailed_main": "Horrible movie. terrible, pretentious cast. everything from the plot to acting and direction is a mess. A complete waste of time and money."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "gursharan1551",
        "review_rating": "1",
        "review_title": "Don't watch it.",
        "review_detailed_main": "It's just unbearable to watch Sonam Kapoor. The script seems like it has borrowed.. nay.. plagiarised from other Hollywood movies and tried hopelessly to give it a Bollywood makeover. I could go on but that would be equally waste of time."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nnk-39990",
        "review_rating": "5",
        "review_title": "Decent Watch",
        "review_detailed_main": "The movie could have been better for sure couple is scenes were funny rest of the comic scenes were falling flat ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vishwanathsinghbgp",
        "review_rating": "",
        "review_title": "frustrated Theme",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "VishnuMishra",
        "review_rating": "6",
        "review_title": "Indian version of Sex and the City.",
        "review_detailed_main": "There is nothing wrong with the movie. The movie never showcased things like feminism and women empowerment as was the broadcast by all who hated the movie. The movie is closer to reality in-fact, no matter how much everyone denies it. Looking other way round just at the sight/plight of reality which is brimming with shallowness and drugs/alcohol abuse in our modern day world (in India too) doesn't change the facts. So the movie is kind off, a peek into world of such girls, whom you may find around yourselves too. Nothing uncommon.\n\nWanna really enjoy the movie, then the viewer may have to erase the thought that the movie is dealing with feminism and women empowerment. Its just another comedy drama movie, not a society stirrer."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "smartsug2002",
        "review_rating": "1",
        "review_title": "Horrible. Return my money pls",
        "review_detailed_main": "Not sure why I saw this. Got a big headache. Pathetic acting"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "monkeychhap",
        "review_rating": "10",
        "review_title": "loved watching sonam kapoor's sizzling chemistry with the girl gang",
        "review_detailed_main": "Girl gang rocks in this cutest bollywood movie. loved watching sonam kapoor's sizzling chemistry with the girl gang"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "megaelecs",
        "review_rating": "7",
        "review_title": "Soft Porn Movie",
        "review_detailed_main": "An English model movie produced in Hindi. Good story line with good acting by all the characters. The language, dialogues and some scenes are with an over-dose of vulgarity as per Indian movie standards. If there is a censor certificate ,like X or XX, this movie shd have been certified like that. This is a soft porn movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "akhilmaverick96",
        "review_rating": "1",
        "review_title": "Garbage is the perfect word to describe this movie.",
        "review_detailed_main": "A few female friends from my peer group forced me to join them to watch this movie. Long story short, the worst Rs.130 I have ever spent in my life. No clear plot line, horrible and selfish characters, terrible \"comedy\" scenes and god-awful acting by the lead female actors. This is basically what happens when you take few good-looking women and tell them to \"act\" in a movie with an awful plot. If you value your time and money, please avoid this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ozarutvij",
        "review_rating": "1",
        "review_title": "0 Star Movie",
        "review_detailed_main": "Pathetic Movie, Unnecessary abusive language use, don't use your valuable money, and most important Time."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rishabhkumar-69079",
        "review_rating": "1",
        "review_title": "Quite simply the worst movie I've seen from Bollywood in the past half decade",
        "review_detailed_main": "Pointless and garbage. There hasn't been a worse movie from Bollywood in the last 5 years."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "yogeshtank",
        "review_rating": "1",
        "review_title": "Pathetic and Vulgar",
        "review_detailed_main": "Don't even think about going to watch this pathetic movie which is full of vulgarity with you family or you'll be left red faced. It's a desperate attempt at making a chick flick and It is a huge let down.\n\nDon't know what they were trying to achieve by making such a movie. The acting, the direction and the wardrobe was sub standard. The movie is full of unnecessary swearing and vulgarity."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "furqaan-arif",
        "review_rating": "1",
        "review_title": "Feminist version of pyaar ka punchnama",
        "review_detailed_main": "Well a badly written script which screams wannabe! However it will be a must watch for you if you're looking for a story depicting today's wannabe rich and spoilt indian girls' seeking the whole white chick lifestyle. Don't get me wrong, feminism is great, it's all about equality but this movie here screams Pyaar ka punchnama(feminist edition) and atleast pyaar ka punchnama has good jokes but this movie fails in that aspect aswell ONE star!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "allthebest-1992",
        "review_rating": "1",
        "review_title": "Worst movie EVER...!",
        "review_detailed_main": "I am regretting the moment, that why I went to watch this awful movie. I am not against abusive dialogues or content, but atleast give some good one. It has got no story whatsoever. Acting wise all were average but sonam kapoor. She was the weakest link in the movie and it was really hard to bear her. Just pathetic. In short, don't waste your hard earn money on this cr**."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "samyaksambuddha",
        "review_rating": "7",
        "review_title": "Women too are free to make choices like men",
        "review_detailed_main": "What makes our lives? It's our choices right or wrong and at the end the lessons learnt from the trials and tribulations. Marriage continues to be a stigma especially for the women wherein minimum choices are offered to her. But this movie strikes this notion at the spine showing the free living nature of four women. This movie is not the picture that many share in India but certainly a change the existing state of affairs. Not certainly the cast and direction are superb. Swara with her new look is fascinating, Sonam with her innocence and Kareena with her independent thought all are enough to win hearts. Many myths and notions are broken through this movie. This shows the way film industry is taking turns to experiment with portraying the rapid changes in society. Good one overall."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "piyush-48805",
        "review_rating": "1",
        "review_title": "worst movie of all time",
        "review_detailed_main": "Can i give negative rating. It's not a movie it's a disaster"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "faridajalal",
        "review_rating": "10",
        "review_title": "very very funny girl gang",
        "review_detailed_main": "Cute sakshi kalindi and innocent swara. Their expression make me laugh and happy to see it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ddddishaaaa",
        "review_rating": "7",
        "review_title": "Apart from 672 Reviews all other are by Men who have problem with sexually liberated, rich and independent woman",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rahulkala-86648",
        "review_rating": "1",
        "review_title": "Desi SATC without any substance.",
        "review_detailed_main": "This movie is caricature of the life of rich dumb kids or wannabe rich dumb kid. This encourage young people to be wasted around and without showing its conseqconse just to make quick bucks. It's just a cheap pretentious movie. No doubt wannabe American indian youngesters are turning so much unproductive these days."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "haribansal14",
        "review_rating": "1",
        "review_title": "Absolute waste of time and money",
        "review_detailed_main": "No one in this film can act and there's no plot or substance to it. Save yr time and money. DONT WATCH THIS"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ketgup83",
        "review_rating": "1",
        "review_title": "Avoid at any circumstances !!!",
        "review_detailed_main": "Kabhi kabar garajte hue badal baraste nahi had !!! The trailer of Veere Di Wedding looked promising, but when you will leave the theater, you will confused if you have seen a movie or a web based girl drama full of candyfloss, glamour and pep talk.\n\nVeere Di Wedding talks about life of four friends - Their relationship, career, love, issues and above all friendship.\n\nDirected by Shashank Ghosh, who earlier made a dismal Khoobsurat, Veere Di Wedding is a story full of potholes where you hope things will turn out smooth but unfortunately is mowed down by a weak script and poor direction. In past, Bollywood has given brilliant films on friendship -Dil Chahta Hai, Zindagi Na Milegi Dobara or even Rock On but this would have been probably the weakest of all. I did not find any songs that was tuneful which was expected in movie like this.\n\nThe only silver lining was the performance by the four protagonist - Kareena Kapoor, Sonam Kapoor, Shikha Talsania and Swara Bhaskar, who was the best among them.\n\nOverall, it is a colossal disappointment. Avoid at any circumstances. Horrible 1/5"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ashutoshaswaleho",
        "review_rating": "1",
        "review_title": "Rubbish. The worst of the worst.",
        "review_detailed_main": "Its been like 4-5 years, i havent watch a single bollywood movie in theatre. But cousins force me to watch this crap. And fortunately i didn't pay for my ticket so I'm thankful for that. 'cause it's just waste of time, brain. You could lose few brain cell after watching this crap. Acting- kareena kapoor, since she's in this industry for more than 10 years, she knows her way out. But this isn't her best performance, actually not even good. She need to spend more time with taimur so can paid media can let her in the news through him that because after watching this, I don't think that her career is going to step up. Sonam kapoor, there's no word to describe this penguin. Just born with silver spoon in her mouth doesn't mean you know how to act, you can not act Sonam kapoor. Ms bhaskar, she's good actress but after her contravarcial tweets about present political conditions, i think this will hit her. Now about that fourth girl, shikha, in wake up sid she was good, and this crap, she's decent. Screenplay- it's not that screenplay is bad, but it really really bad. I wanted to leave the theatre between interval, but my cousins didn't let me. Music is as usual, bhangda, wedding music. And it's going to played in weddings for next 2-3 months. In my opinion, watch old classics, or sleep for 2 hours in your bed, cause in theatre your gonna do the same anyway."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "inamdar_chaitanya",
        "review_rating": "1",
        "review_title": "Degenerate af",
        "review_detailed_main": "Can't believe I paid money to watch this degenerate product."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rajkumarkurmi",
        "review_rating": "1",
        "review_title": "NONSENSE",
        "review_detailed_main": "Avoid such nonsense movie with pathetic acting. Waste of time and money."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nazleen-p",
        "review_rating": "7",
        "review_title": "A watch with your girls",
        "review_detailed_main": "It's a fun to watch film with your girls.. great to see Kareena back on screen.. and the wardrobe is something you would wanna grab for yourself .. Not a serious movie- just fun to watch it. 4 friends living their own lives in different parts of the world bonded together for life.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "atharvketkar",
        "review_rating": "1",
        "review_title": "Vulgar and senseless",
        "review_detailed_main": "Just another sex and the city ripoff\n\n\n\n\n\n\n\n\n\nDont watch out"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "chirkutwala",
        "review_rating": "10",
        "review_title": "fun comedy and a very realistic movie",
        "review_detailed_main": "Women cuss. Women drink. Women smoke. Women masturbate. Women spend their money or their parents money. Women wear/don't wear revealing clothes.\n\nThis is the reality of women in #veerediwedding. It is the reality of some women in real life as well. Maybe not all. But yes, some"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "krthn",
        "review_rating": "7",
        "review_title": "Girls night out and fun",
        "review_detailed_main": "Movie shows women from different backgrounds trying to solve their daily issues help each others while having fun trips and partying."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nevermind_87",
        "review_rating": "1",
        "review_title": "Reduces a woman to just a .....",
        "review_detailed_main": "I felt disgusted at the end of this movie. Swara Bhaskar is such an excellent actress - this reduces her to just a ******* Swara Bhaskar is such a strong woman taking on everyone in the SM world - this reduces her to just a ******* And Swara Bhaskar today is singing paeans of this movie. I feel disgusted at my only icon being reduced to just a ****** in this movie.\n\nThis movie destroys every positive development made so far on women's liberation through its juvenile depiction of the women's lib movement."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aniruddhrajput-04775",
        "review_rating": "1",
        "review_title": "Wastage of time and money",
        "review_detailed_main": "Utter nonsense movie..... No acting akills, no story at all.... Would have given zero if available"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "alikanch10-887-214361",
        "review_rating": "1",
        "review_title": "Sheer waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "skyflycons",
        "review_rating": "1",
        "review_title": "Awful horrendous",
        "review_detailed_main": "If disaster has one name that is this movie. director made this just to have company of 4 glam dolls and he had no idea where the movie was going, of course there was blank script too. dont waste your time on it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "piyush-48805",
        "review_rating": "1",
        "review_title": "worst movie of all time",
        "review_detailed_main": "Trust me it's the worst movie of all times. Please don't go. Buy some food for children in need, they will bless you."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vikassmit",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sshrestha4",
        "review_rating": "7",
        "review_title": "Not bad at all !",
        "review_detailed_main": "Despite a low users' rating I went to see the movie. I don't regret it at all. The rating appears highly distorted because majority of those who rated it is unwilling to accept a story that does not gel with high moral standards. It's just a movie ! Lesson learned: One should never go by IMDB rating again, specially if it's Bollywood flicks, where fans give full marks to their idols even if it is trash. Conversely, moral police trash a fun movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "peter-aremone",
        "review_rating": "1",
        "review_title": "Absolutely terrible movie with worst acting quality & overdose of cheap vulgarity",
        "review_detailed_main": "A very vulgar movie with extremely cheap, cheesy acting on a storyline that has no head nor tail, jokes that will put you to sleep & a set of characters who can best be described as the most selfish, greedy, inhuman characterless lot.\n\nThis movie is basically the story of the selfish dirt of humanity and their cheap selfishness that can only be related to by the worst of humanity.\n\nGive it a miss, you are better off staring at a blank wall if you're bored than watch this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ijabijatija",
        "review_rating": "10",
        "review_title": "veere di wedding is a classic movie",
        "review_detailed_main": "Definitely, my favorite part was the part where the movie takes a \"Sex and The City\"-ish narrative regarding the women and their sex lives. A huge win that we get to hear about women masturbating and discussing multiple orgasms. We need these conversations."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ReviewerUprising",
        "review_rating": "7",
        "review_title": "More Indian women need to review movies on IMDb",
        "review_detailed_main": "This movie is nowhere as bad as the reviews suggest. For some reason any movie with female protagonists in India need to be some rags to riches or oppressed to empowered tale. Women can't just be flawed characters. Is the movie great? No but it's better than so many movies that are enjoyed by Indian society that show men cheating on their spouses , sleeping around, smoking, drinking, raping, raunchy comedies etc.\n\nEnjoy the movie, it's fun, imperfect, average but doesn't deserve a 3 star nonsense rating. My main gripe with it is they made Swara Bhaskers character such a stereotype instead of a well rounded person. That was some lazy writing - but the rest was like your average Indian movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shreehari-sumit",
        "review_rating": "1",
        "review_title": "I want my 140 minutes back.",
        "review_detailed_main": "I know that the run time is 125 minutes, but even the 15 minutes of interval wasn't worth it. When we have films like Mary Kom, English Vinglish, Kahaani, Dangal, even that Silk Smitha movie, I just fail to see how this load of crap is the flag bearer of feminism."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kumar-abhiitbhu",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Total loss of time and money. Pakistan did good by banning this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "eshamishra",
        "review_rating": "1",
        "review_title": "Dumb and Pathetic copy of Sex and the City",
        "review_detailed_main": "I wish IMDb had a negative review option. Worst movie. Dumb copy of Sex and the City. Sonam and Kareena wannabe actress and so plastic. Kareena was just making a desperate attempt to show her cleavage with 0 acting. P.S. Don't go by the 9/10 reviews all are fake or paid or by the foot lickers."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "subhashkhandekar",
        "review_rating": "1",
        "review_title": "what a crappy movie!",
        "review_detailed_main": "Borrowed story from Dil chahta hai and Sex and the City, still they couldn't make it work. Poor acting, Poor music. Poor Direction. People left the theaters midways."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "uditsatijabills",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": "Not worth watching , don't go with childrens it's an adult movie poor copy of one of the English movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kishan-xxx",
        "review_rating": "1",
        "review_title": "AVOID !!",
        "review_detailed_main": "Was bored to death !! Abrupt lame cuss words in situations where there's absolutely no need to .. this movie is anything but feminism !!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sushantshinde51",
        "review_rating": "7",
        "review_title": "A roller-coaster wedding",
        "review_detailed_main": "Veere Di Wedding (Veere - Friends in English) is a female-led adult comedy-drama film directed by Shashanka Ghosh.\n\nThe film follows four happy-go-lucky childhood friends Kalindi (Kareena Kapoor), Avni (Sonam Kapoor), Sakshi (Swara Bhaskar), and Meera (Shikha Talsania); who are now grown-up and engaged in their own lives. Until one day, when Kalindi decides to get married to her long-term boyfriend Rishabh (Sumeet Vyas). Now, Avni, Sakshi, and Meera must reunite to participate in the celebrations of Kalindi's big marriage. Rest of the film follows the fun ride of ups and downs through which all these friends must go to find best in them.\n\nThe film, at its core, talks about the importance of having friends and families in life, and the little moments of joy and fights which they share with each other. The film also discusses the significance of appreciating good things while accepting the flaws and moving on. Besides, the film is also filled with swear words, slapstick moments, and some hilarious one-liners, and it hold back on nothing. The film is hilarious in a first half, and in the second half, it goes for some deeper character arcs. The aspect of friends and family dynamics had already been explored in some really good films, so nothing new to serve in this one, but characters are refreshing and alive, plus the flavor of adult comedy.\n\nVerdict : It's definitely not the best film but a good one time watch."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shovonbhattacharjee",
        "review_rating": "2",
        "review_title": "This movie has no story",
        "review_detailed_main": "This movie has no story,no content, nothing. I do not understand how this kind of movie made by Bollywood. I recommend all of you please do not watch this movie, I think this is the waste of time."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "lashkaretoiba",
        "review_rating": "10",
        "review_title": "loved this beautiful movie",
        "review_detailed_main": "Watched VeereDiWedding Nice Movie! STARTED liking sonam kapoor more Her Quirky Dialogue delivery \"Bloody Mother lover\" , Swara and Shikha were lit affff <3"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "gouthamashok",
        "review_rating": "6",
        "review_title": "The first half of the movie was decent but then it is a turtle race.",
        "review_detailed_main": "Decent movie for $20, enjoyed the first half of the movie with quirky one-liners and regular Hindi slang. P.S. It had been a long time since i watched a Bollywood movie and maybe that is why i found this much better than the other reviewers."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "PomPom9832",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "Stay away from this if you want to avoid pain in your head.Bollywood is going lower day by day with such bimbos.No substance.3 horny women,bunch of slang with wannabe hollywood & no proper story line."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "binducherungath",
        "review_rating": "4",
        "review_title": "It misses a great opportunity to be a masala entertainer and a blockbuster.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "reemaikram",
        "review_rating": "1",
        "review_title": "Horribly copied from multiple Hollywood movies.",
        "review_detailed_main": "This movie looks as desperate to shove modern women down the throat of the audience, as the girls portrayed in them. A movie copied from various Hollywood chick flicks like Bridesmaids & Sex & the City. Some moments seemed to be exactly copied from them.\n\nThe friends lacked chemistry & were trying hard to portray a bond. Sex and porfainty was used in an unclassy way. If Hollywood does it, they know how to pull it off. All of this doesn't fit in the desi culture no matter how modern we think we have become.\n\nA movie in bad taste. Hopefully the directors will understand that they are misreading the audience. This is not what they need in the name of women empowerment."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dictator1945",
        "review_rating": "2",
        "review_title": "Cheap Movie......in ...a...one Word",
        "review_detailed_main": "Very pathetic Cheap movie full of abusive language ...To Have sex and drink wine freely is not called Women empowerment or Freedom... Movie have no plot or screenplay...."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "harsha-ravage",
        "review_rating": "1",
        "review_title": "Waste of time and money!",
        "review_detailed_main": "It is a brilliant combination of unproductive actors (except swara and shikha), unreasonable script, untalented crew, uncreative director, unimaginative producer who has effortlessly fooled all cinelovers. Waste of Time and money. government should enact a law to avail refund for such movies along with additional compensation for the trauma suffered in theaters while watching such movie!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "Miphed",
        "review_rating": "4",
        "review_title": "Cringe fest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "simplytech",
        "review_rating": "6",
        "review_title": "Not Good but Not Bad",
        "review_detailed_main": "Sonam was looking hot! Scripts, dialogues, costumes and venues selected were 1no... Story was good too but got bored at the end of the movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "darkknight_ind_usa",
        "review_rating": "1",
        "review_title": "Why was this movie even made?!",
        "review_detailed_main": "I fail to understand what was the motive of this movie? Feminism? Does not look like that. Because the lead actresses did not do or showcase any such scene where feminism took the front seat. The abuses used in dialogues also look misplaced and unnatural. When Richa Chaddha abused in Gangs of Wasseypur, it looked natural, but none of the actresses' abuses in Veere di wedding looked natural. This movie looked like an attempt of female version of Zindagi na milegi dobara, but it failed there too. It was all about product placement - Air India, Bikaji, HSBC, Videocon etc. The supposedly best performer in this movie - Sumit Vyas was not given a proper length in this movie. All in all, a totally pathetic movie. Bollywood has nowadays totally lost it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nowrosjeewadia",
        "review_rating": "10",
        "review_title": "best comedy movie",
        "review_detailed_main": "Watched #veereDiWedding ... Awesome movie... Btw hats off to Swara Bhaskar... U r really a power houseactor... Btw sonam kapoor watching u really reminds me dat nepotism still exists in Bollywood.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mr-sudhanshushekhar",
        "review_rating": "7",
        "review_title": "Bold and handsome",
        "review_detailed_main": "Movie is bold and handsome. Yes, movie wants to be quirky sometime and has flaws too but in the end you will like this movie.There are few things such as \"Courage\", \"Being Bold\", \"Making your own Choices\" etc which you can take from this movie but also there are few things which you should not follow such as \"Frequent drinking\", \"Abusing\" etc. Overall, this is a good time-pass movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rovemo",
        "review_rating": "1",
        "review_title": "Cringe festival",
        "review_detailed_main": "Washed out botox humour. Haven't seen more Plastic humour than this"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shvmbanerjee",
        "review_rating": "3",
        "review_title": "Cringey",
        "review_detailed_main": "VDW tries to portray the story of four individualistic women in their 30s but however fails due to its dazed and premature narrative."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nightblood-27667",
        "review_rating": "1",
        "review_title": "Trash of a film.",
        "review_detailed_main": "Absolute waste of time. Fails in its attempt to sound cocky by filling the dialogue with abusive slurs . The acting is deplorable and plotwriting looks very lazy. Poor direction. Disappointed."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "abinkurian-41513",
        "review_rating": "4",
        "review_title": "Below average",
        "review_detailed_main": "One of again below average bollywood cliche movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "MG_MasterG",
        "review_rating": "4",
        "review_title": "Weak plot and average performances",
        "review_detailed_main": "Good attempt, but overall, the whole 'veere' thing felt a bit over-done. The performances were average despite some seasoned actors in the cast. There were too many sub-plots and characters, and some of the story angles were too weak."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "adiyatnashrah-53791",
        "review_rating": "5",
        "review_title": "I would have given this movie an 8/9 if they hadn't shamelessly plagiarised another movie.",
        "review_detailed_main": "Copying plotlines and music from different entertainment industries is an old Bollywood tradition. This movie was no different. It blatantly steals the plot and even the characters from Hollywood's Sex and the city. But keeping that point aside, I thought the movie was refreshing. Bollywood rarely produces movies where women are the target audience so most of the time people are stuck watching lewd 'item numbers' and beautiful, helpless airhead women with no purpose other than being the love interest in a man's story where she is only expected to be sexy portrayed in the the movies. This movie gave female actors character and important roles. Also, India is a super conservative country and the fact that they at least brought out some of the least discussed issues out in the open is a big deal. Change does not happen overnight. Now that these issues have been brought under the lime light, other movies can begin to address them and finally step by step lead to equality."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "venkatboss1990",
        "review_rating": "1",
        "review_title": "Bollwood at it's best: making bad copies of successful hollywood movies/themes.",
        "review_detailed_main": "Horrible.Vulgar & just plain awful pale imitation of SATC."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "supersimmba",
        "review_rating": "10",
        "review_title": "enjoyed watching this amazing comedy movie",
        "review_detailed_main": "Enjoyed watching this amazing comedy movie girl gang having a blast and partying so cool in this movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "doremaun",
        "review_rating": "1",
        "review_title": "awful,nauseating,disgusting",
        "review_detailed_main": "Plzzz throw your money in a drain but don't dare to watch this pathetic so called movie.I am going to a rehabilitation centre."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vjkr55",
        "review_rating": "1",
        "review_title": "This Wedding Better be called Vulgar de Marquee & Better Cancelled ...",
        "review_detailed_main": "This is Delhi Belle! & we thought Delhi Belly was too much... But this VDW is leaps & bounds beyond DB in terms of language. Surprised how the families of these respective performers have reacted to this unprecedented display of cheap talks,actions & what not. Its also a wonder how the censor board has allowed such a film to be released as its certainly very harmful for impressionable minds who could emulate these performers justifiably. Anil Kapoor is associated in this and that for sure has tarnished his image in my mind as he was always known for Gandhi my Father like movies and not Gandi Like this one. If modernity means obscenity & if freedom means pervert actions than I rather stay well away from being modern or free.. This movie should be banned as it depicts careless candour. IMDB should allow negative rating till -10 from now on.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "saurabh7888",
        "review_rating": "1",
        "review_title": "What a crap of a movie",
        "review_detailed_main": "Avoid this piece of crap... And i dont write reviews"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "krunal_bapodara",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": "Janab Movie Pasand Nahi aae.... Worst movie in Indian Cinema history....... Kalindi worst character of the d Movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kirtimaanphadke",
        "review_rating": "1",
        "review_title": "Pathetic and Crass",
        "review_detailed_main": "I think the time I spent traffic while commuting to the theatre was better spent than 3 hrs spent watching this silly film. Don't GO!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dhannyakumar",
        "review_rating": "1",
        "review_title": "Pathetic movie",
        "review_detailed_main": "Crappy plot and very put on performance . Save your money and watch it online"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kushsharma-84373",
        "review_rating": "1",
        "review_title": "Waste of time, money and air",
        "review_detailed_main": "No story line, no coherent language, no theme, no script. ABSOLUTE CRAP. WORSE MOVIE I HAVE EVER SEEN IN MY LIFE. I WANT ALL THE AIR I WASTED BREATHING DURING THAT MOVIE BACK. Please don't waste your time watching that crap. PLEASE PLEASE PLEASE, I BEG YOU! DONT WASTE YOUR LIFE!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ghantablog",
        "review_rating": "10",
        "review_title": "Sex and the city, loved this bollywood version!",
        "review_detailed_main": "Carrie --- Kalindi Miranda ---- Avni Samantha ---- Sakshi Charlotte ---- Meera\n\nThis is perhaps the closest we'll ever come to an Indian version of SATC and honestly, I'm pretty happy with the adaptation."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ashutoshaswaleho",
        "review_rating": "1",
        "review_title": "Pile of garbage",
        "review_detailed_main": "Path breaking scenes, and crapbag acting, that's how you define veere di wedding."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kartik2910x",
        "review_rating": "1",
        "review_title": "Watched by accident and regretting",
        "review_detailed_main": "The only reason i watched this movie was by accident, and not even watched full movie because there was nothing in this. I don't understand what the hell was point of making this trash. Also movie was soooooo boring that i slept while watching."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "khandelwal_pawan",
        "review_rating": "1",
        "review_title": "C Grade Cheap movie",
        "review_detailed_main": "What a 3rd grade movie. Cannot watch even alone to laugh."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "hajirabood",
        "review_rating": "2",
        "review_title": "worst bollywood movie this year",
        "review_detailed_main": "I do not not how to mention how bad this movie was, it is completely waste of money and time. Let start first with the story, there was really not plot line, no character development and no acting skills. I am just shocked that after one year of disappearance kareena kapoor come back with this movie. even though this movie did not fail in the box office but for the audience it is considered a piece of garbage. the movie is all about sex, nothing more. the rest of the crew do not know even what it means to act. I hated this movie such much because i thought first it will be fun and second it shows how much the indian movies are becoming bad."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "lovleenanu",
        "review_rating": "2",
        "review_title": "No sense",
        "review_detailed_main": "Very stupid movie. Nothing is great about the movie. Only bad language and few dialogues are funny..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "zerinchowdhuryamy",
        "review_rating": "4",
        "review_title": "Slow",
        "review_detailed_main": "Not so captivating scene that brings out your emotions... You can watch it for time pass. It showes modern outlook of four girls & there personal problem but not with convincing acting or screen play."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "akstalk",
        "review_rating": "1",
        "review_title": "Pukish",
        "review_detailed_main": "Watch this movie in washroom. Because it will make you puke after every couple of minutes for its pathatic performances, dialogues, forced humour and 'trying to be cool by albeing abusive' kind of attitude."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "satarfatar-77864",
        "review_rating": "10",
        "review_title": "outstanding movie loved it",
        "review_detailed_main": "A powerful message sent to the society, we are modern world, we are one world! Freedom is what we all need! VeereDiWedding is about what you chose to focus on. It is a light movie that isn't sending out any powerful message and yet subtly it touches upon a few"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sandec-22068",
        "review_rating": "2",
        "review_title": "Cheapness and Silly Antics for entertainment.",
        "review_detailed_main": "So this movie stood out for it's completely immature acting, non existent plot and general overall cheap stunts and vulgarity."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "hamletrocks69-3-163288",
        "review_rating": "2",
        "review_title": "Movie made for Product placement purposes only. Disaster.",
        "review_detailed_main": "Veere Di Wedding - A story of 4 friends, a wedding, and one \"absolutely no idea why and how this movie was made\"director and actors. It is a 2 hr disaster of a movie with actors trying to portray roles totally not meant for them. The only saving grace were Vivek Mushran who portrays a \"Modern Family\" type Gay older couple, Shika Talsania as one of the Veere, who is natural with her comic timing and Sumeet Vyas whom we all love from the TVF web series brings in his charm. There is nothing novel in this tale of womance. Just a waste of good actors in a total vapid story and an annoying first half. Even the cliches don't work well like the grand Punjabi wedding or hook ups or even a bachelorette/honeymoon party in Thailand. Bollywood makes better bromance movies. Disaster of a movie. By the way this movie sponsored by Bikaji chats, Uber, HSBC and Amanpuri resort Phuket.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "asawarikadam",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "3 grade copy of Sex and the city. No substance at all. Why do people employ Sonam Kapoor ... Oh wait her dad produced the movie ... I get it. Not even a single scene worth mentioning. Don't waste your time n money."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sohommajumder",
        "review_rating": "1",
        "review_title": "A trash",
        "review_detailed_main": "The movie could easily be named as Daddy issues of girls with low self-esteem but instead let's call it a brave attempt to make an over dramatic movie ,a failed attempt to copy another pathetic Hollywood movie and the \"controversial\" orgasm scene is sooooooooo fake that it can compete with Salman Khan's method acting in Race 3\n\nIf u have mistakenly downloaded it make sure U press the Shift along with the Delete button ....I m sorry if I have hurt anyone's delicate sensibility"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "purwar389",
        "review_rating": "1",
        "review_title": "worst of course!",
        "review_detailed_main": "This is how they wanna show another face of a women? people are gonna hate this kinda girls anyway. If you are to show women empowering? then that can not be achieved by \"if men can drink then so can we, if men can masturbate then so can we\". One star for all your efforts in making this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "savipaul",
        "review_rating": "1",
        "review_title": "Waste of time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "indian_bala",
        "review_rating": "1",
        "review_title": "Non sense film",
        "review_detailed_main": "Total waste of time and money. Lack of mind application by director. Kareena and Sonam are wasted. Showing a woman masterbating. Censor is sleeping."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "telleveryone-16208",
        "review_rating": "10",
        "review_title": "Loved this girl comedy movie",
        "review_detailed_main": "A complwte comedy riot. Girl gang rocked in this crazily weird comedyy moovie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "saeedahhaque",
        "review_rating": "1",
        "review_title": "if i could give this film 0, i would",
        "review_detailed_main": "Just a horrible wannabe movie. Nothing empowering or even vaguely entertaining, just a bunch of rich goodlooking indians wasting time looking pretty. i cannot believe people actually came in to work and spent their time and effort even working on this film. Whatever pays the bills i guess."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shruti_r_sharma",
        "review_rating": "2",
        "review_title": "There are much better chick flicks out there",
        "review_detailed_main": "As a woman born and raised in the western world I expected to be entertained by this chick flick, particularly as Ive enjoyed Hollywood offering in this genre like Clueless and Legally Blonde.\n\nI completely acknowledge that the Indian film industries do not have a lot to offer in the way of female centric films and even fewer examples of what would be termed as click flicks. This film fails to deliver as a traditional chick flick or even as a comedy. People unaccustomed to American cinema may find that the film works in terms of its \"shock value\" including curse words and \"liberalised values\" such as smoking / drinking. Firstly smoking and drinking excessively are no longer cool the world over. I wonder why Hindi films in particular are fixated on smoking for example. Not only is smoking known to be extremely harmful but fewer western people are actually smoking these days (especially in England it's seen as pretty uncool and antisocial to smoke) - people saying the characters have \"western values\" are certainly ill-informed as these are not western values at all and certainly not values you'd want to ape. Secondly the film simply isn't entertaining. Agreed that some of the clothes look good and maybe the rich lifestyle paints a picture of aspiration for some Indians, but that isn't enough to redeem a film. More work could've been done to establish the chemistry between the leads which I think wasn't convincing enough. It was loud, brash and for something wanting to be different, extremely stereotypical! I expected to have fun and was unfortunately let down."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "Nwoakes",
        "review_rating": "1",
        "review_title": "A faux-feminist film that shows no respect towards women",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "KarmaMarga",
        "review_rating": "1",
        "review_title": "Only saw first 15 minutes...",
        "review_detailed_main": "What was this? The movie has all the ideals from Hollywood, why bother making a Hindi movie? Sonam Kapoor does not know how to act, Swara Bhaskar can never act trendy or cool or rebellious - she acts like a behenji even in modern clothes. Both of them are not great actresses. The shocker was Kareena Kapoor - why did you sign this ----------Why?????????? You are a good actress. I sat through 5 minutes and I was like why am I watching this movie, is this supposed to be for Hollywood or what? Parents making out in front of their kids - had to stop there."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nehasureka",
        "review_rating": "5",
        "review_title": "5 points for what this movie taught me..",
        "review_detailed_main": "5 things to learn from Veere Di Wedding 1. Be Rooted: However much one may be sophisticated, donning the luxuries and living in the upper spectrum of the society, one must always be desi in thy taste. Like digging into our desi brands Amul Ice-Creams, Bikaji Bhujias, and uttering only sadak-chaap gaalis. 2. Live Life king-Size: Splurge in the designers outfits, make impromptu international-travel plans, take bikaji along, dip into the infinity-pool, slosh away your worries with friends.For everything else there is HSBC credit card. Apply for it. 3. Don't Worry, Be Happy: Every character in the movie seemed troubled except the one and only one Carefree- Underdog-Chichora, 'Bhandari', who has all the fun throughout. Give-a-Damn, Care-a-damn! 4. Keep making mistakes: Even if it causes lifetime addiction. 5. Vocabulary Improvisation: Did you know words like 'Veeres', 'Wast Delhi', ' Charmsukkh' and many such frivolous ones before?.. Must learn coz knowledge is power!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "areebaaslam-37456",
        "review_rating": "1",
        "review_title": "Still sad that i wasted 2 hours of my life",
        "review_detailed_main": "The worst movie that i have ever seen cheap rip-off of sex in the city!!! Total waste of time. But if you still want to test your patience go for it try to sit through the whole movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "cgigator",
        "review_rating": "1",
        "review_title": "The worst movie ever made.",
        "review_detailed_main": "The movie was a total waste of time, with no clear focus or message, very impractical scenarios and the most idiotic dialogues you'll ever hear. The songs were as as useless and lame as the movie. 1 star is too much for the movie, please don't waste your time or money watching this absolute piece of garbage."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "thatsupertechie",
        "review_rating": "10",
        "review_title": "a very good movie to watch for fun",
        "review_detailed_main": "SwaraBhaskar does a masturbating scene in VeereDiWedding with much aplomb; RatnaPathakShah had done a similar scene in LipstickUnderMyBurkha last year. Both these actors-outspoken and unfearful-shared screen space and similar wavelength in NilBatteySanatta. Coincidences of life.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ahmedkhanbpl",
        "review_rating": "1",
        "review_title": "Absolute TRASH, save yourself",
        "review_detailed_main": "This movie deserves a NEGATIVE 5 stars, an absolute trash and a waste of time. Save your time and yourself from it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "lalavesharya",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Total time wasted, not worth to watch, vulgar, and no good story line."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "srireddy-82720",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen in Indian Cinema.",
        "review_detailed_main": "Adding a review can save lot of people to not waste their time."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mohammedsfn",
        "review_rating": "2",
        "review_title": "Absolute trash",
        "review_detailed_main": "One of the most boring movies I have ever watched. Nothing in the movie worth remembering. This movie seriously didn't deserve to earn what it did at the box office."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "amit-pawar24",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "The worst movie i have ever watched , worst dialogues , worst storyline , actresses are doing overacting, should have left my brain somewhere else while watching the movie, feel like finding the director and asking for refund and shooting her"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nisunishu",
        "review_rating": "5",
        "review_title": "Nothing new to speak about",
        "review_detailed_main": "Story of four girls in the new India. Modern and independent women. Centered around these four women this is completely female based movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "Sovik_Das",
        "review_rating": "3",
        "review_title": "A good try",
        "review_detailed_main": "It was a good try by the director but didn't panned out too well. The anticipated happy ending was good. Again, Kareena Kapoor was outstanding throughout the movie with little bit of sparks from Soonam Kapoor."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "monkeychhap",
        "review_rating": "10",
        "review_title": "Heroine oriented film, so cool loved it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kumar-aish2010",
        "review_rating": "2",
        "review_title": "Endorsements",
        "review_detailed_main": "One good thing about Veere di Wedding is that its women have been true about their age, give or take five years. Curiosity drove me to the nearest multiplex where preparations were going on for the wedding of Kareena, aka Kalu in the movie, while her BFF, poor Swara Bhaskar is hanging on to a dreary marriage. By the way, if Kareena is Kalu, then I am the darkest shade of Black. I am a great fan of Swara Bhaskar; she effortlessly faked the often faked gasps, moans and the ecstasy.\n\nHaving paid for the movie tickets with my HSBC credit card, I immediately felt connected watching Sonam Kapoor and her girlies using the same card; on multiple occasions. Watching them board Air India reminded me of my bland maiden flight to Mumbai in a lusterless Air India vimaan. Their presence glamorized the otherwise unstimulating government airline. Apart from Kareena, Swara, Sonam, Shikha and Sumit Vyasa the movie also featured Uber, Bikaji, Amul, Videocon, Air India, HSBC and a few other brands that the poor me couldn't identify.\n\nVeere Di Wedding is definitely not a chick flick. It's about woman empowerment; her pleasure lies in her own hands. Glorified."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "meenakrajani",
        "review_rating": "2",
        "review_title": "Independent mind women some how but misleading and confusing for independence and sex assault under the influence",
        "review_detailed_main": "The acting of all four main characters is good. The movie has featured the courage of modern indian women. Karina kapoor's decision making about, glamorous and commercial wedding and standing against it and giving up when she finds her fiancé does not have courage to stand up for himself is aligned with the theme of the movie. But depicting Sonam kapoor in one night stand under the influence where the guy clearly knew she was under the influence of alcohol, is stupidity or rather i called a sex assault not bravery of Sonam kapoor to go out of norm. Glamorizing such type ideas where in asian society the education and sex education is not common is very misleading for adults and teenagers."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "king007",
        "review_rating": "1",
        "review_title": "IMDB should have negative ratings for such crass",
        "review_detailed_main": "Only two words for the movie. ABSOLUTE CRASS. This movie is full of pathetic dialogues and acting by all the ladies."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "svipul-18788",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Bad movie. Please don't waste your money on this pile of garbage. There is nothing empowering about this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vaidyalikhitha",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "It's all about friendship and lust kareena exposes too much but acting skills are nill all the leading actresses are worst there is no story in the movie at all there is no reality in the story and full of garbage fashion show it suits for rich people and there is no meaning of watching this film totally waste of time"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rashidabdulmail",
        "review_rating": "1",
        "review_title": "A complete headache!!",
        "review_detailed_main": "I am not able to understand why the movie makers are even taking such projects. The whole time I was watching this movie I waited for some reasonable and sensible message or anything at all. I don't understand what were they trying to do with this movie. Is this movie promoting feminism or women empowering ideas or breaking stereotypes in our society? I don't think so. The only thing it teaches us is drink a lot of booze, go enjoy and party at some luxury hotel, drink and try hard to get laid in someones' wedding. And more and more same old bollywood MASALA... I don't understand why even bother making a movie just do advertisement for cigarettes and beverages."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rehmankhilji",
        "review_rating": "3",
        "review_title": "Could have been way better",
        "review_detailed_main": "Like some other reviews, in order to cover up the cost of Kareena Kapoor and Sonam Kapoor, huge advertisement, unnecessarily has been added in the movie. A word for the producers / director, NO ONE LIKES ADDS in the movie. Than again since it was being produced by Sonam Kapoor's DADDY guess her cost was not included and she for the same reason is having more screen time than the others. Than again, there is nothing special about this movie. Its highly impressed by Sex and the City. Kareena certainly not at all looking from the same age group as being played. She seem pretty tired and without any energy in the movie. So if you want to see extra display of cleavages you are in for something beside that a pretty boring movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "superSRK",
        "review_rating": "10",
        "review_title": "outstanding direction and class music",
        "review_detailed_main": "Music is good and songs are beautiful. Pappi le le is simply awesome."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "senchowdhary-anirban",
        "review_rating": "1",
        "review_title": "Worst movie ever made",
        "review_detailed_main": "One of the worst movie ever.. no story, no script.. pathetic story .. headeach guaranteed"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sureshpmithala",
        "review_rating": "1",
        "review_title": "Very disappointing",
        "review_detailed_main": "Its such a drag, not a moment that is worth the watch and I could not manage beyond an hour. Real waste of time and talent."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "monikakhurana-23637",
        "review_rating": "5",
        "review_title": "Average",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "balinderkbenning",
        "review_rating": "2",
        "review_title": "Had high hopes for this film but...",
        "review_detailed_main": "I thought this film would be great, but it lacked many things. It sort of reminds me or the series Four more shots, which I absolutely love, it's more of a realistic friend girl group. This movie just didn't have a proper story line, the characters or their individual story wasn't really developed. To be honest the film was just boring, I feel like they were trying to make a modern film like zindagi na milegi dobara, well they needed a better storyline and director. I don't think any of the cast were at fault really, but the group of 4 girls didn't have much chemistry as a friendship group. Anyway to sum it up, it's quite a boring film, it could have been much better, maybe if Zoya Akhtar had directed it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vuniyal-99160",
        "review_rating": "1",
        "review_title": "Undoubtedly one of the dumbest Bollywood movie ever",
        "review_detailed_main": "I will definitely recommend you to watch it. It will widen your perspective of how dumb a movie can get."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "balaram-95353",
        "review_rating": "1",
        "review_title": "bad movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mukhyadhyapak",
        "review_rating": "10",
        "review_title": "best girl gang movie",
        "review_detailed_main": "VeereDiWedding made me miss my veere gang! Refreshing to see an urban, girl-gang film. ekta kapoor and team, woohoo! SwaraI loved Sakshi Soni :)"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vidhanparishad",
        "review_rating": "10",
        "review_title": "veere di wedding is a classic movie made in bollywood, loved the comedy",
        "review_detailed_main": "Saw VeereDiWedding And only one word for it #WOW. Almost everybody can relate to it and all those who didn't find it good enough for you i have one thing to say angoorkhattehain"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "thatsupertechie",
        "review_rating": "10",
        "review_title": "Sonam Kapoor's part is exceptional, very well shown",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ghantacelebrity",
        "review_rating": "10",
        "review_title": "this movie is an ultimate comedy",
        "review_detailed_main": "I'm so so glad that a movie like this was put out there for grabs in a society like ours. You girls are so bad ass. Makes most of us feel like its us against the narrow minded bigots"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "chirkutwala",
        "review_rating": "10",
        "review_title": "I loved this movie",
        "review_detailed_main": "Men are getting really flustered about the masturbation scene in Veere Di Wedding, aren' they?\n\nI think the women have done something right here."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "hosseinamanat",
        "review_rating": "10",
        "review_title": "Kudos to Bollywood, and exceptional movie made by the girl gang",
        "review_detailed_main": "There is no scope of vulgarity (except if you consider cussing as vulgar, which was shockingly allowed in UAE cinemas too for a change). We do cuss in our everyday lives and it was shown as it is in the movie as well, I see nothing wrong there"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "daryaesford",
        "review_rating": "10",
        "review_title": "Swara Bhasker you're epic pathbreaking acting!",
        "review_detailed_main": "Swara Bhasker you're epic pathbreaking acting! Women masterbate too. What's the big deal?"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mantribintri",
        "review_rating": "10",
        "review_title": "Oh Goawddd this Swara Bhasker We love you dear!",
        "review_detailed_main": "Swara Bhasker's masturbation scene from Veere Di Wedding is path-breaking for a Bollywood film"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "daryaesford",
        "review_rating": "10",
        "review_title": "pathbreaking movie, swara bhaskar youwere awesome",
        "review_detailed_main": "Pathbreaking movie, swara bhaskar youwere awesome, a miracle happened in bollywood, this movie is a gem"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ijabijatija",
        "review_rating": "10",
        "review_title": "loved this beautiful movie",
        "review_detailed_main": "Loved this beautiful movie, swara bhaskar is so cute, innocent and beautiful, so cool and an awesome girl gang! COmplete comedy riot!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mantribintri",
        "review_rating": "10",
        "review_title": "an exceptional bollywood movie, I loved it",
        "review_detailed_main": "An exceptional bollywood movie, I loved it, Swara bhaskar you rocked in the cinema house"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shribhivaskar",
        "review_rating": "10",
        "review_title": "a great message to the society through this fun comedy movie",
        "review_detailed_main": "A great message to the society through this fun comedy movie, I wish everyone will watch this outstanding comedy movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bashiralexandar",
        "review_rating": "10",
        "review_title": "full masti by the girl gang",
        "review_detailed_main": "VeereDiWedding has been watched. A complete entertainer full of comedy, drama, emotions, masti, relationships, bonding and the amazing graph of all these characters"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ghaznimahmud",
        "review_rating": "10",
        "review_title": "Loved it VeereDiWedding what a movie show gals power",
        "review_detailed_main": "Loved it VeereDiWedding what a movie show gals power and much better than the khans doing just commercial movie for the name sake"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "tabrezbarmavar",
        "review_rating": "10",
        "review_title": "cool fun comedy girl gang having a balst",
        "review_detailed_main": "Cool fun comedy girl gang having a balst simply awesome direction and I liked the dialogues very well"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "munnamahinderfauji",
        "review_rating": "10",
        "review_title": "the girl gang you rockstar, loved the movie",
        "review_detailed_main": "STAY AWAY from the movie if you are one of those who get easily triggered by just seeing HAPPY women on the screen! For the rest of us who love Bollywood & love to keep personal idealogies seperate from the films we watch, have an amazing time at the theatre"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "patnakepresley",
        "review_rating": "10",
        "review_title": "a very natural movie showcasing freedom of the girl gang",
        "review_detailed_main": "Let's all be PRO-CHOICE & let everyone survive in the eco-system. It is OK to have flaws & it is OK to be what you want. I may just watch #VeereDiWedding again with my other girl-gang"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "drrajitratha",
        "review_rating": "10",
        "review_title": "Girly Girl gang loved it :)",
        "review_detailed_main": "Every moment, be at the wedding or the vacation, in VeereDiWedding ll be RELATABLE AF with the girls. You ll know when you see it. These are happy, self-independent, financially secure urban, stylish women trying to sort out personal situations & be friends with life as it is"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sahabzadeirfanalikhan",
        "review_rating": "10",
        "review_title": "rockstar girl gang, loved it",
        "review_detailed_main": "Veere Di Wedding impresses just the way the trailer promised"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mythughusband",
        "review_rating": "10",
        "review_title": "simply outstanding",
        "review_detailed_main": "Just watched VeereDiWedding with my mum & we were all smiles when we walked out of the theatre. The movie is all about breaking the stereotypes, without apologies & that's so refreshing. Loved it! Kudos to the girls!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jaideepmajmudar",
        "review_rating": "10",
        "review_title": "full marks to this beautiful movie",
        "review_detailed_main": "VeereDiWedding wasn't trying to prove to be anything in the first place that it deserved the negativity it did on Social media. Don't like it, don't watch it, let others do! It is a pathbreaking movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "acpmajmudar",
        "review_rating": "10",
        "review_title": "very good movie it is",
        "review_detailed_main": "VeereDiWedding was exactly the movie I needed right now, even thought I didn't know I needed it. Shout-out to Rhea Kapoor."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "akatovikat",
        "review_rating": "10",
        "review_title": "kudos to the beautiful girl gang",
        "review_detailed_main": "Watched VeereDiWedding what a terrific and tremendous movie is lit aff I love the girls gang Swara Bhaskar u nailed it ...looks and beauty of KareenaKapoorKhan and humour of Shikha Talsania sonam kapoor and music of Baadshah powerpack movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "teammanushi",
        "review_rating": "10",
        "review_title": "Swara bhaskar you are the cutest dear, love you",
        "review_detailed_main": "Veere Di Wedding is one classic hit for sure, Kareena Kapoor starrer is classy, sassy and all things jazzy"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "drhilalmeer",
        "review_rating": "10",
        "review_title": "music is just superb in this movie",
        "review_detailed_main": "Music blends so well into the movie. Each song has something to say, there is something for everybody. The sangeet song Pappi Le Loon being my top favorite! Lots of EDM, Rock and Funky Dance numbers to keep you grooving."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "yusufsebuktigin",
        "review_rating": "10",
        "review_title": "a lot of learning from this movie Veere DI wedding",
        "review_detailed_main": "One of the biggest takeaways from Veere Di Wedding is that no matter how rich you become, when you go abroad you always carry Bikaji aloo bhujia."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "drjaikaal",
        "review_rating": "10",
        "review_title": "EK number movie, loved it",
        "review_detailed_main": "There is not a SINGLE dull moment in VeereDiWedding! Tight screenplay, hilarious dialogues, unfolding of drama, casual flow of narrative, all these pluses make the film almost a perfect watch"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "badtameezse",
        "review_rating": "10",
        "review_title": "loved watching the girl gang partying throughout the movie",
        "review_detailed_main": "A COMPLETE SHOW-STOPPER which will change the idea of how we see WOMEN in Bollywood VeereDiWedding is exceptional!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ehsanyarshater",
        "review_rating": "10",
        "review_title": "Take a bow ekta kapoor sonam kapoor Swara fantastic movie",
        "review_detailed_main": "What a movie ! Take a bow ekta kapoor sonam kapoor Swara and kareena and the other actress all four were superb what a cast not every movie needs a khan or kumar u can just do with the Kapoor Gals loves it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vishvasundari",
        "review_rating": "10",
        "review_title": "a very good comedy movie",
        "review_detailed_main": "Swara Bhaskar You were like the best character of veere di wedding! Slang toh zabardast"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "saajanfernandez",
        "review_rating": "10",
        "review_title": "Watched and loved every moment of this movie,",
        "review_detailed_main": "Also today I heard a \"pathbreaking\" thing from one of my colleagues- \"Veere di wedding is a nice movie!\""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ilovemanushi",
        "review_rating": "10",
        "review_title": "this movie is an attempt to redefine freedom for the girl gang",
        "review_detailed_main": "VeereDiWedding wasn't trying to prove to be anything in the first place that it deserved the negativity it did on SM. Don't like it, don't watch it, let others do!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "missindiamanushi",
        "review_rating": "10",
        "review_title": "loved watching the cutest avatar of sonam kapoor",
        "review_detailed_main": "My Favorite characters: 1) sonam kapoor I never thought I did say this but she is extremely cute and adorable when her character is very very confused and cute (very unlike herself), smooth yet strong and hold her base right whatever she is asked to do."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "zimmafugadi",
        "review_rating": "10",
        "review_title": "an exceptional comedy movie with the girl gang",
        "review_detailed_main": "We have the woman-power (and manpower) as well as the talent and sincerity to make better movies with female protagonists. You can make them as independent, confident and spunky, but the film will also be entertaining and meaningful."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "muhammadtughlaq",
        "review_rating": "10",
        "review_title": "kareena you rocked in this movie, love you darling",
        "review_detailed_main": "Undoubtedly Kareena Kapoor had to have the maximum screen time. A very mature, smart and restrained performance. Kudos!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aslichampion-61892",
        "review_rating": "10",
        "review_title": "hi5 to the movie, movie is good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bhangdapale",
        "review_rating": "10",
        "review_title": "very nice movie",
        "review_detailed_main": "3rd biggest opener of the year VeereDiWedding\n\nThe movie is good if you want I ll book a ticket for you ....what say ???"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bakkambukki",
        "review_rating": "10",
        "review_title": "girl power and freedom wow",
        "review_detailed_main": "Nothing to be embarrassed about, embrace your sexuality ,there is no shame in it .It is a biological need. Probably don't go with grandma but a bunch of best girl friends next time"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bhadeketattu",
        "review_rating": "10",
        "review_title": "an outstanding movie",
        "review_detailed_main": "STRICTLY no male-bashing, no feminism & no women empowerment naatak. Just a story of three women who face life as it comes. Let's celebrate friendship and be there with each other when we need them the most."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vanshikabundela",
        "review_rating": "10",
        "review_title": "LOved Swara Bhaskar's acting, an exceprional bollywood movie",
        "review_detailed_main": "Veere Di Wedding such a refreshment for Bollywood.Everyone justified their character and Dear Swara more power to you, you're outstanding."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ghantablogger",
        "review_rating": "10",
        "review_title": "I liked this movie",
        "review_detailed_main": "VeereDiWedding is a super fun flick to be enjoyed with your bosom buddies ;) It changes the narrative for times ahead where women can do what they want, just be however they like, without being policed or judged all the time. Do choose to watch it, but don't judge it!!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bajulasarak",
        "review_rating": "10",
        "review_title": "this girl gang is beautiful and lovely",
        "review_detailed_main": "Everyone must go&watch the film. We need to make it a smashing hit, we need more women to rule the box office&more of women centric cinema in this democratic nation of superficial independence,more of respect for women in media&speculation"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "financialexpress",
        "review_rating": "10",
        "review_title": "simply out of the box bold movie it is",
        "review_detailed_main": "Girl power rocks! Veere Di Wedding becomes the third highest opener of 2018 after Bhaaghi 2 and Padmaavat."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "whatkindofjob",
        "review_rating": "10",
        "review_title": "Bring on more Chick Flicks in BW GirlPower rocks",
        "review_detailed_main": "VeereDiWedding is mind blowing. I loved the film, Kudos to the makers and the 4 Veeres. I really loved her in this film Bring on more Chick Flicks in BW GirlPower rocks"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bhuichakkar",
        "review_rating": "10",
        "review_title": "Blockbuster movie",
        "review_detailed_main": "Kareena Kapoor Khan and Sonam Kapoor starrer Veere Di Wedding has a great start at the BoxOffice"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kuttappl",
        "review_rating": "10",
        "review_title": "outstanding to say the least <3",
        "review_detailed_main": "Veere Di Wedding's pathbreaking scenes eat your heart out."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "junaidmiandad",
        "review_rating": "10",
        "review_title": "More power to you girls",
        "review_detailed_main": "What I also loved about #VeereDiWedding is how every character is defined and every character has been given good amount of screen space and meaning. It rarely happens but Veere Di Wedding got that bang on!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "chirkutwala",
        "review_rating": "10",
        "review_title": "very much enjoyed awesome comedy movie",
        "review_detailed_main": "Very much enjoyed awesome comedy movie, a cool fun time comedy movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "blousepiece",
        "review_rating": "10",
        "review_title": "very good movie as its title",
        "review_detailed_main": "Ovyas_sumeet and Shikha Talsania worth watching in Veere Di Wedding. Rest of the cast as simply beautiful in it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "monsooniyer",
        "review_rating": "10",
        "review_title": "Out of the box pathbreaking movie!",
        "review_detailed_main": "You will either love it or hate it but cannot ignore it. I loved it! Congratulations to the entire team and people who bought tickets and went to the theatre. Seems we got a winner"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dukkarchhap",
        "review_rating": "10",
        "review_title": "a cool fun comedy movie",
        "review_detailed_main": "The movie is too comedy, and A female centric film doing this well calls for a CELEBRATION!! Bollywood needs to keep making such films"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "personofinterest-55581",
        "review_rating": "10",
        "review_title": "some of the scenes are pretty impressive",
        "review_detailed_main": "Liked #VeereDiWedding but didn't love it. Fun and relaxing movie. Guess was expecting a little more fun and less emotional."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dcpdesilvaakavardhan",
        "review_rating": "10",
        "review_title": "a complete comedy riot",
        "review_detailed_main": "Swara Bhaskar you what a terrific performance loved every bit of Sakshi u were the besttttttttt"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bakkambukki-63165",
        "review_rating": "10",
        "review_title": "girl gang comedy at its best superb movie",
        "review_detailed_main": "Watched VeereDiWedding not a perfect movie but loved the spirit behind it. Kareena Kapoor Khan is a powerhouse actress and looks phenomenal on screen. Bring on more girl issues centric movies Bollywood!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kyamaloom",
        "review_rating": "10",
        "review_title": "loved watching bindaas girls of bollywood",
        "review_detailed_main": "My ONLY problems with the movie: I thought Swara's character was quite stereotypical and went a bit OTT it what it stood for. I don't support smoking and drinking to portray a 'bindass' woman in Bollywood."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "karnapadtahai",
        "review_rating": "10",
        "review_title": "phenomenal movie loved it",
        "review_detailed_main": "Looking at the Box Office where #VeereDiWedding ruling . This is called WOW feeling. Veeres are simply phenomenal!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ghantaceleb",
        "review_rating": "10",
        "review_title": "very nice movie",
        "review_detailed_main": "I loved the repetitive theme that all of us, especially, women in particular should be given the freedom to make our choices, make our own mistakes and learn and grow from them. Such an important life lesson."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "LoveSaraAli",
        "review_rating": "10",
        "review_title": "full marks to this bold and beautiful movie",
        "review_detailed_main": "Full marks to this bold and beautiful movie I liked the music, the dialogues and some exceptional scenes haha, loved watching Swara Bhaskar !"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "romaandmalik",
        "review_rating": "10",
        "review_title": "a1 class movie with lots of humor",
        "review_detailed_main": "VeereDiWedding is the most beautiful movie I've seen in 2018. Such a beautiful attempt at all levels."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "radhikaslover",
        "review_rating": "10",
        "review_title": "love these beautiful girls and the beautiful movie!",
        "review_detailed_main": "Swara Bhasker's improvement from a not-so-glamorous lady to a queen throughout Veere Di Wedding is worthy of a round of applause"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jetkot",
        "review_rating": "8",
        "review_title": "Not as bad as the other reviewers mention",
        "review_detailed_main": "India is a society with numerous Double standards. The patriarchy feels intimidated if a woman is bold and carefree. They are fine with a man talking openly about his sex life and he is termed cool if he sleeps with more than one woman .But a female needs to be subdued and they give ratings of one star if the movie stars four bold female leads . I still say double standards because the same audience will go to watch a regressive Sunny Leone film that just focuses on displaying her assets and has no story , script or performance."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aparamita",
        "review_rating": "10",
        "review_title": "risk making such movies in male dominant mind set up",
        "review_detailed_main": "Movie was not about woman empowerment. It was a simple movie of people of this time. It is not to teach how to live life accept live your way without hurting anyone."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "harshitpatel-89186",
        "review_rating": "10",
        "review_title": "Great fun movie to watch....",
        "review_detailed_main": "Basically it's a chick movie but even men will enjoy it. Good humour great casting nd acting..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shahanayk",
        "review_rating": "10",
        "review_title": "Really impressed at how far Bollywood has come",
        "review_detailed_main": "Really excited about this film coming out, one to watch with the girls. Taken aback by all the negative reviews and overall low rating. Still decided to go and give it a watch.\n\nSo glad I did. My friends and I laughed so hard so many times throughout the film, not only was it entertaining but each one of could relate to one of the girls in some way or other.\n\nI feel like this film shows the modern girl in reality today, rather than how censorship has had us portrayed.\n\nThe casting was fantastic, really liked that the male lleads where not big Bollywood stars as that would've taken some of the spotlight off the main star of the show.\n\nWill definitely be watching this again and hoping that more actors, directors and producers will move with the times and bring Bollywood into this century."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "Natasha0705",
        "review_rating": "8",
        "review_title": "Overall Veere Di Wedding is a BOLD attempt to break stereotypes, the box office shall speak for itself.",
        "review_detailed_main": "VEERE DI WEDDING\n\nDuration : 123 Minutes Genre : Drama/Comedy\n\nCAST Sonam Kapoor, Kareena Kapoor, Swara Bhaskar, Shikha Talsania : The 4 female leads, who were strong in their characters, each one of their performances had their own spark and were applause worthy in their own ways. The chemistry between the 4 is beautiful. The supporting cast included Sumeet Vyas, Neena Gupta, Vivek Mushran, Manoj Pahwa, they were all the toppings of the cake, which well suited the whole cast assemble.\n\nPLOT 4 school friends who were now at different stages of life, each one facing their own sets of problems and yet friendship glued them together. Veere Di Wedding is lighthearted, yet opens up eyes of the mediocre mindset. There were a lot of shocking dialogues and scenes, which were probably first timers in Bollywood. (definitely not advised for kids hence R21).\n\nSOUNDTRACK We all have been loving Badshah's Tareefan since a while now, however the title track Veere surely reminds everyone of their Veeres. I personally enjoyed the foot tapping Bhangra Ta Sajda as well."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vasantishura-15557",
        "review_rating": "8",
        "review_title": "Entertaining Chick flick. Power of friendship.",
        "review_detailed_main": "Loved the movie. Female empowerment, friendship, independent thinking, strength and intellect. Identified with the city liberated girls, discarding the rules imposed by society via double standards for men and women - men seeking liberated women while wanting the coy bride to please the family. Successfully showed we are not perfect, it's okay to make mistakes and we learn from it. And it's okay for women in today's world who are taking in so many responsibilities and roles to seek their sexual pleasures and happiness in life without any fear or ridicule. Put the double standards of both men and women in it's place. The movie and characters are based on 'Sex and the City'. What I disliked however was the use of extensive foul language. That I guess is Hindi cinema overdoing things and creating steoretypes. Using foul language does not mean you are liberated, intelligent, independent person - be it man or woman. All vulgar language displays is lack of elegance, classiness. It shows only craziness and a cheap upbringing. So I wish Bollywood stops portraying this message that only hurts liberated women and distracts you from the real theme and meaning of the movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nandidot",
        "review_rating": "8",
        "review_title": "Haters are gonna hate but a super fun ride!",
        "review_detailed_main": "'Veere di Wedding' is your typical friendship themed movie complete with raunchy dialogues, bold situations, flawed characters, and underlying heart. The only difference is that it's about 4 women. And that's a big difference and a welcome change. Eyebrows were raised when the trailer was released. People (read: men) scoffed at the idea of women behaving in such an atypical manner. I just hoped for a good movie to silence the critics and boy, I should say girl, did they hit the nail on the head.\n\nThank God it wasn't censored! That was the first thought that went through my mind when the veeres started swearing like it was going out of fashion. Nothing is off limits in this movie; the makers aim to shock and scandalize...but you know what, nothing that happens in the movie is actually outrageous or obscene. It's just that we've never seen it shown so openly on screen before. There's a particular scene in the 2nd half that literally had the theatre gasping because we couldn't believe the audacity of the filmmakers. A nervous and appreciative chuckle followed the gasp when we realized that this is for real. I hate to state the obvious but women, like men, swear, drink, talk about sex and almost everything else under the sun. So why the hypocrisy? I'm not going to pull at that thread but I will give major kudos to Rhea Kapoor and Ekta Kapoor for backing this project and not shying away from, like I said, the obvious.\n\nKalindi (Kareena Kapoor Khan), Avni (Sonam K Ahuja), Sakshi (Swara Bhasker), and Meera (Shikha Talsania) are childhood friends who despite the years and distance have remained close. When Kalindi cringingly accepts her boyfriend's proposal the friends come back together to celebrate their veer. Everyone's dealing with something or another but that doesn't stop them from sporting designer outfits, driving around in a Bentley, and going off to Phuket on a whim. I mean it's a Kapoor led film, did you expect anything less? If you don't cry and have a mental breakdown in heels with your hair done up are you really a Kapoor? I think not. Frankly, the characters' problems are superficial, the extravagance is well, extravagant, and the blatant product placement is absurd. But that's the fun of it all. Director Shashanka Ghosh of Khoobsurat fame knows how to keep it light and entertaining. His cast is having a rollicking time and the audience along with it.\n\nKareena is a born star and she knows how to use it. She headlines the cast with tremendous oomph and might I add looks incredible doing it. The new Ahuja and former Kapoor does what she always does. Sonam's outfits are on point and her acting, while not worthy of her former surname, works fine here. Swara has the challenging role in the bunch which she enacts it with confidence and Shikha delivers her crackling lines with humor keeping the audience in splits. A genuine camaraderie between the veeres helps balance the film nicely.\n\nThere is a clear target audience for this movie. Where else will you get to know what charam sukh is? Everything is mounted glamorously giving the actors a chance to be stars instead of characters. And the music is some of the best I've heard in recent times. This veere's wedding is a blast! Have I said enough ya hor das kiniya tareefan chahidi tenu. stuffiwatchblog.wordpress.com"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ohkijiji",
        "review_rating": "10",
        "review_title": "Interesting and Intriguing",
        "review_detailed_main": "How come most people have given 1/10 or 10/10 rating review. This movie sure evokes strong sentiment - negative or positive Kudos to director Forget about empowerment - that was not the purpose of director I guess, some movies are 5 to 10 years ahead of time, Silsila, Lamhe, this will join that list for sure. I would rate it as a cult movie - in the league of Zindagi NA Milegi Dobara."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ustadokeustaad",
        "review_rating": "9",
        "review_title": "cool movie from start to end",
        "review_detailed_main": "The movie was cool from start to end. It included everything. Comedy was awesome. it is the best comedy performance by sonam"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "chandniglimmers",
        "review_rating": "10",
        "review_title": "Fun, enjoyable movie!",
        "review_detailed_main": "The movie is about girls having fun! There is no male bashing or messages about women empowerment. It's funny, goofy with a bit of drama. All four actors were great. Supporting cast did a good job as well. Nothing much to complain about."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "afkap72",
        "review_rating": "8",
        "review_title": "Refreshing approach to taboo subjects. Entertaining, fast moving, light hearted",
        "review_detailed_main": "I loved this movie. After watching the 'lipstick under the burkha' this was a refreshing approach from another angle. What I liked about it is that it dosent preach. It was a portraiture of a group of girls from well-healed families, who are just frank and want to enjoy life. On a serious note, it peeles off layers of our society to show what exists but is not visible, or talked about. Yes its very bold from conservative Indian audience perspcetive."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rdjoties",
        "review_rating": "10",
        "review_title": "Men will lose.",
        "review_detailed_main": "A big bollywood movie about our real lives. The lower an IMDB rating on a Bollywood film is, the better the movie. Especially, in this case. The men portrayed in this movie are men I know. The women portrayed in this movie are also women I know. I can relate to the characters. That's something special for a big budget Bollywood movie.\n\nSo, are the men in this movie more feminine and the women more masculine, read: promiscuous? No, because life and sharing life has nothing to do with gender sentiments. It is about equality in sharing everything. And let's be honest; on a physical and mental level, a woman will always outdo a man, on, for instance; exploring her sensuel side. That has nothing to do with ill behavior or copying a man. It's biology. It's healthy. It is human. It is what you will get in a growing economy. And that is what all the men (and some women!!??),who slammed this movie on IMDB are afraid of."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "user-59028-44340",
        "review_rating": "8",
        "review_title": "Good entertainment",
        "review_detailed_main": "This movie does not have new content but this movie is very entertaining.You don't feel bored while waiting it.There is no thrill.Using bad language and very less adult sean is there.I Will give 8/10."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kas27",
        "review_rating": "9",
        "review_title": "Don't go by the misleading rating",
        "review_detailed_main": "A refreshing movie with modern take on love and relationships. The movie is filled with funny, emotional and thoughtful moments - not a single dull one. In some ways, you could call it a female centric version of Zindagi na milegi dobara or Dil Chahta hai.\n\nPlease ignore most of the bad ratings by chauvinistic men who could not handle this movie, as it did not fit their male regressive vision of female empowerment. If you liked ZNMD or DCH, there is no reason to hate this movie except sexism. Setup in India of 2018, nobody else needs to define fun for women.\n\nA definite must watch amongst the movies in 2018 - so glad that the movie was commercially successful! :)"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "subhashkamboj",
        "review_rating": "8",
        "review_title": "It's shallow but full paisa vasool",
        "review_detailed_main": "A light high class delhi people based movie. A bit too modern for Indian culture but it's ok. There is no emotion but lot of sex talk abusive words."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "reemasharma",
        "review_rating": "9",
        "review_title": "Good pass time",
        "review_detailed_main": "Value for money. I had a good time watching it worth watching..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "payalkeshvani",
        "review_rating": "9",
        "review_title": "crazy comed loved the film",
        "review_detailed_main": "It is simple story but directed very well.. acting was done exceptional by all the stars one big highlight is wonderful crazy comedy. Must watch if you love to laugh"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jawaldevi",
        "review_rating": "9",
        "review_title": "Best acting by Kareena",
        "review_detailed_main": "I am a Kareena fan and I love all her movies and I her role and acting in this movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "skrocks-59739",
        "review_rating": "9",
        "review_title": "Great Movie with awesome acting",
        "review_detailed_main": "A great movie with a paisa vasul acting on a storyline that has an unusual story tell. All the characters are matched and best described as the most comedy with drama type that creates a funny situation."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "patelharsha-96357",
        "review_rating": "9",
        "review_title": "nice comedy film",
        "review_detailed_main": "Its really a practical based movie it shows the funny side of the girls and guys its a worth watching movie please go and watch once u will really like and its also a superb comedy film"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "indianfilmsandshows",
        "review_rating": "10",
        "review_title": "most of the bad ratings you see here are given by BJP IT CELL because of swara bhaskar",
        "review_detailed_main": "I dont want to rate this film 10, but have to give, because BJP IT CELL has spammed this movie by bad ratings because of sawara bhaskar who oppose the right wing governent"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "amoldavid67",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": "Loved it...... it's a gem ,what a feel good movie,awesome script, awesome acting by whole cast ,want to watch it over and over again"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ajaycool-68768",
        "review_rating": "9",
        "review_title": "awsum movie",
        "review_detailed_main": "Awsum movie... ek dum mast... it's really a nice movie but can't watch with kids though..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rawatshefali",
        "review_rating": "9",
        "review_title": "Lovely movie",
        "review_detailed_main": "Lovely movie. rib tickling. do watch this movie. and ya one more thing, cool movie in this hottest summer. thumbs up."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "wcebshrinivas",
        "review_rating": "10",
        "review_title": "hpt sexy and amazing movie",
        "review_detailed_main": "Lil of sexy and amazing movie loved it simply magical one I'm gonna watch it again and again complete entertainment movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "afreen-62-655519",
        "review_rating": "10",
        "review_title": "Bold hot and sexy",
        "review_detailed_main": "It's a today's generation movie which should be watched with that mindset"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vbhivaskar",
        "review_rating": "10",
        "review_title": "I wish more of such movies to be produced in bollywood",
        "review_detailed_main": "Honestly, all the credit goes to Shefali Appi for the success of VeereDiWedding. WHat a class movie it is, outstanding"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "afreen-62-655519",
        "review_rating": "10",
        "review_title": "Bold sexy and hot",
        "review_detailed_main": "This is today's generation movie and should be watched with this mindset for sure"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "cinemaspotter",
        "review_rating": "10",
        "review_title": "Of filter-free, fun and fabulous Veeres",
        "review_detailed_main": "Veere Di Wedding was worth every micro second of the long wait if we go by famous words uttered by the ever-articulate Swara Bhasker: \"It's taken 105 years for mainstream Bollywood to make a film about four girlfriends and none of them are falling in love with the same guy.\" Truth.\n\nWe haven't had a high-spirited female version of Dil Chahta Hai (2001), for lack of a better comparision, with mainstream actors. VDW gets the core of breezy group friendships right and doesn't delve much into life stories as its depth lies elsewhere. The awesome foursome glide in tandem taking us on a rib-tickling, racy and memorable adventure instead.\n\nFreely living in their space without filter, we have seen these girls in real life but they have been missing from Hindi cinema. A young mother needs to party hard; a bride demands a drink to ease her stress; a single girl leads a kiss because she is horny; a woman screams expletives into the phone. No judgment. No justification, aid or loophole either.\n\nWow. Like, really. Wow.\n\nWhen I go to watch Biwi No. 1, I don't expect Masoom level of nuance. Similarly when I go to watch Veere Di Wedding, I don't expect Lipstick Under My Burkha. Having said that VDW will connect with more women purely because within that genre they have socked convention out the park. They have basically managed to pull off a Rajkumar Hirani I would say. :)\n\nNot every venture featuring lead women actors needs to bear the burden of being chick flick or feminist. There is a commercial place between frivolous and serious which can still convey an important message by just being. This is that.\n\nDirector Shashanka Ghosh and writers Nidhi Mehra and Mehul Suri do an outstanding job with the storytelling, script and dialogue and this is where true gold is. An ordinary story turns extraordinary with mundane scenes that knock Hindi cinematic boundaries subtly and beautifully, boldly touching upon and normalising aspects of female sexuality, motherhood, marriage, and single life.\n\nCommitment issues in a woman, check. She races into a toilet at the mere thought of marriage before saying yes, the audience I am watching it with goes into double splits. Perceptions of motherhood, check, check. She vomits a mad, drunk night into the toilet pot as her two-year-old cutely imitates \"uwooah\". More amused women in the cinema. Masturbation, check, check, check. She is gadget-happy, nothing comes between her and a good time. Giggles and laughs. A man who has different views of wife vs. girlfriend, check, check, check, check. She calls him out pronto, and finds a man who doesn't. The Nirmal and Bhandari characters elicit the right responses from women.\n\nThe lives of Kalindi (Kareena Kapoor), Avni (Sonam Kapoor), Sakshi (Swara Bhasker) and Meera (Shikha Talsania) unfold in an OTT Delhi wedding setting which works like a charm. Especially with the banter and colourful vocabulary. The girls meet after 10 years for Kalindi's wedding. With dysfunctional families in the mix, life's complicated while they are caught amid the flamboyant and hilarious celebration prep. All that jazz does happen for real, complete with a couple mounted on a fake moon and a wedding scene with varying degrees of flashiness. So it gets both the Delhi wedding culture and sarcasm down pat.\n\nKalindi fears marriage even as she accepts boyfriend Rishabh's (Sumeet Vyas) marriage proposal. Their relationship is captured well. Everything is right and yet external pressures weigh on them. Avni struggles with the lows of single life, a pushy mother completing the picture. A suitor tanks and a fling soars who she judges rather unfairly. Only she gets over it, unlike her male counterpart Nirmal. Sakshi is battling a separation from her husband, trying to steer her mind away from the final decision by having a good time partying. Happily married to American John (Edward Sonnenblick), Meera is having body image issues after the baby.\n\n\n\nThe choreography is excellent, mapping the comical wedding dances and the friends' emotional journeys. Music is racy and blends well with the grandeur, despite varied composers. Shashwat Sachdev composes the loony Pappi Le Loon (Sunidhi Chauhan, super), crazy Bhangra Ta Sajda, peppy Bass Gira De Raja and the melancholic Aa Jao Na. White Noise creates the quirky Laaj Sharam and Vishal Mehra the lovely title song Veere and lively Dagmag Dagmag. Qaran's Tareefan is s..s..super sizzling.\n\nThe editing by Shweta Venkat Matthew is meticulous, crisp and in tune with the entertaining and warm tone. Sudhakar Reddy Yakkanti's cinematography is immersive.\n\nPerformances are above par, across the lead and supporting cast. Neena Gupta (Avni's mother) is graceful, Anjum Rajabali and Kavita Ghai (Kalindi's father and mother) are effective, Ayesha Raza and Manoj Pahwa (Rishabh's mother and father) are rollicking. Alka Kaushal is perfect as Santosh Aunty. Vivek Mushran (Cookie Chacha) and Sukesh Arora (Keshav) rock as an everyday gay couple (sans usual mannerisms).\n\nThe few good men supporting the women are talented. Vishwas Kini makes Bhandari likeable and balanced despite the initial creepiness. Edward is earnest as the quintessential husband. Sumeet Vyas is A-excellent and holds his own splendidly opposite Kareena. They are quirkily flawless as a pair.\n\nKS3 are electric and magnificent as buddies. They nail the Delhi banter, camaraderie, body language, chemistry, insecurities, parallel long-distance lives and naughtily push each other's buttons.\n\nKareena Kapoor is exquisitely understated, lending calm and charm to Kalindi. Her eyes do most of the talking. Sonam Kapoor makes Avni delightfully goofy, correct and heartfelt. Watch her regal stance when she interacts with the brazen Bhandari. Shikha Talsania's Meera is sweet as sugar and mad as a hatter as the need arises. Her mother dairy act is effortless and sparkling, she delivers some saucy lines with deadpan relish. Swara Bhasker's Sakshi is the knockout performance in technique and spirit. The masturbation scene will etch her name in history. She's the real bro, effortlessly wild and cool.\n\nRhea Kapoor and Ekta Kapoor, heartfelt gratitude, words are not enough to convey my joy. Thank you for Veere Di Wedding and for not screwing it up. (Except, do go easy on the product placements next time and be confident your movie will earn its own money.)\n\nIt is six on five for the VDW team. The one extra is for educating us urbanites on what an orgasm is called in Hindi. Khh baby khh. Send your thinking brain on a vacay to experience the joys of this Charam Sukhh."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "urmilat-46617",
        "review_rating": "10",
        "review_title": "One of the best movie",
        "review_detailed_main": "One of the best movie I have seen in a long time! go friends make your weekend entertaining"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mohitraj-68632",
        "review_rating": "9",
        "review_title": "Good Movie",
        "review_detailed_main": "'Veere Di Wedding' is a brave effort indeed in which four leading ladies break the proverbial glass ceiling with their sexy stilettos. I am sure that this film will find an appeal with the younger generations who can relate to the discussions and dilemmas of these veeres."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "anitarajgaria",
        "review_rating": "9",
        "review_title": "Movie is a Fun Ride",
        "review_detailed_main": "Veere Di Wedding is a fun ride, which squeezes past its creaky tropes and partial squelchiness by some smart casting choices, and perky performances. And lines which connect."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kanwalprashant",
        "review_rating": "10",
        "review_title": "refreshing comedy movie must watch",
        "review_detailed_main": "A very engaging and refreshing movie. Just loved it. A must watch for all. Fun & interesting throughout with a powerful and refreshing comedy."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nishadecverma",
        "review_rating": "10",
        "review_title": "wow........",
        "review_detailed_main": "It's a musical treat and Graceful visuals. Entertainment entertainment and entertainment"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shyanadsouza",
        "review_rating": "10",
        "review_title": "Entertainment entertainment and entertainment",
        "review_detailed_main": "One time watch, good entertainer, good for all youngsters"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "royvenkat",
        "review_rating": "10",
        "review_title": "nice watchable movie",
        "review_detailed_main": "Nice watchable movie. still I can remember few scenes for comedy looking forward to watch it again soon"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rg-21594",
        "review_rating": "10",
        "review_title": "Really entertaining",
        "review_detailed_main": "I found this one really entertaining. Nice story and plot."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sumitchawala",
        "review_rating": "10",
        "review_title": "laughter riot",
        "review_detailed_main": "Its a really funny movie. laughter riot l. Every one has acted well"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "guptasuman-68697",
        "review_rating": "9",
        "review_title": "Something different watch",
        "review_detailed_main": "Different storyline not that stereotype movie. Must watch"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "tanuja1720",
        "review_rating": "9",
        "review_title": "best movie to watch during summer holidays",
        "review_detailed_main": "This movie has something different and the comedy is more natural than slap-stick must watch"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "surbhipathania",
        "review_rating": "9",
        "review_title": "Go watch it. It is worth",
        "review_detailed_main": "Go watch it. It is worth. I enjoyed each and every scene"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ramadhallji",
        "review_rating": "9",
        "review_title": "watch it for Movie songs and comedy",
        "review_detailed_main": "Movie songs and comedy was good but we have also learned lesson from it. Over all movie was watchable. this is carrier best comedy of kareena"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "poojarajgupta",
        "review_rating": "10",
        "review_title": "super hit movie for sure",
        "review_detailed_main": "It is a super hit movie you will like it e k dum jakass best movie after all"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rekhiprachi",
        "review_rating": "10",
        "review_title": "best movie of the year",
        "review_detailed_main": "This is the best movie of the year so far. All the charecters have done justice to their roles. The direction is amazing."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "varshakumbharrrr",
        "review_rating": "10",
        "review_title": "kudos to the girl gang",
        "review_detailed_main": "Loved how Swara rocked up everywhere in a Bentley and smoked that cigar like a bawseee bosssss"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jasminegupta",
        "review_rating": "9",
        "review_title": "Nice movie worth watching",
        "review_detailed_main": "Nice movie worth watching. You will not regret watching this."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rajkanawal",
        "review_rating": "9",
        "review_title": "superb Punch",
        "review_detailed_main": "Must watch this combination of bromance and romance. dialogue delivery is superb. superb Punch."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vandanaramaswami",
        "review_rating": "10",
        "review_title": "Totally loved the movie",
        "review_detailed_main": "Totally loved the movie and did not mind becoming an crazy for a day. girls don't miss the best comedy movie go and watch"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "poojaswami",
        "review_rating": "9",
        "review_title": "Simply Amazing",
        "review_detailed_main": "This is what i call a movie. watched it today and still if i will get a chance, will definitely go for it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "raunaqshah",
        "review_rating": "9",
        "review_title": "Real fun moments in this movie",
        "review_detailed_main": "Real fun moments in this movie. Some moments make you laugh but others make you cry"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "niharikabose",
        "review_rating": "10",
        "review_title": "powerful movie",
        "review_detailed_main": "No words for the movie... Shashanka Ghosh has done a great direction... Swara & sonam just nailed it by doing a fabulous job... specially Kareena gives a lots of comic scenes from beginning to the last...!!! Just one word for the movie 'FANTASTIC'... Full paisa wasool...!!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sachdevabhoomi",
        "review_rating": "9",
        "review_title": "Really fun to watch",
        "review_detailed_main": "It was really fun to watch each moment. I enjoyed a lot."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mukaantaneja",
        "review_rating": "9",
        "review_title": "Full of drama and emotions",
        "review_detailed_main": "One can relate to the this story. Somewhat true to life."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "simaransaini",
        "review_rating": "9",
        "review_title": "Mast movie",
        "review_detailed_main": "Mast movie.. comedy, drama, fun, emotional and music all are in this movie.. All songs & Music are awsome"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mahajann",
        "review_rating": "9",
        "review_title": "Kareena and Sonam at their best",
        "review_detailed_main": "Kareena and Sonam at their best. I loved both these stars in this movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aroratanvi-31376",
        "review_rating": "9",
        "review_title": "Good one watching it was fun",
        "review_detailed_main": "Very entertaining worth watching each and every scene"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "youvikachoudary",
        "review_rating": "9",
        "review_title": "Good movie about friendship",
        "review_detailed_main": "Story about true friendship with a lots of twists and turns."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "afreen-06350",
        "review_rating": "10",
        "review_title": "Go with your girls",
        "review_detailed_main": "A chic flick that is total entertainment meant for today's generation. Watch it with your girls for sure"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "singhsukanya",
        "review_rating": "9",
        "review_title": "I found it entertaining",
        "review_detailed_main": "I found it entertaining and fun to watch. Worth watching for sure."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "madalenamay",
        "review_rating": "10",
        "review_title": "To be watched with girlfriends, and not for the conservative crowd.",
        "review_detailed_main": "Some people have called this movie mindless entertainment, and I fail to see why that would be a bad thing. Men get to have bro comedies with no purpose other than to entertain a group of friends, and it's only fair that women should get one too. If you want a deep female led Hindi drama about societal issues, watch Lipstick Under My Burkha, Angry Indian Goddesses, Parched, Lajja, or any other brilliant film with wonderful performances. But women deserve to have some fun in this world too, and that's where Veere Di Wedding comes in. No, it's not the strongest plot, and yes, the acting is a little shaky sometimes. But it's FUN, best served with some sangrias and to be watched together with your closest veeres."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kritikasethi",
        "review_rating": "9",
        "review_title": "funny movie",
        "review_detailed_main": "It's a funny movie and I have watched this movie as it is just like keeping your logic and other things aside."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "heenat-46565",
        "review_rating": "10",
        "review_title": "super like",
        "review_detailed_main": "Superb movie already watched twice!. dialogues are super funny.. must watch guys"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jyotiarora-24050",
        "review_rating": "9",
        "review_title": "very entertaining",
        "review_detailed_main": "Nice movie.. keeps u engaged till the last minute.. very entertaining"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "parvatipatil-62834",
        "review_rating": "10",
        "review_title": "LOVE IT",
        "review_detailed_main": "Its really unimaginable that a movie can be funny up to this level. Now its added to my fav movie list"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kajalbhutani",
        "review_rating": "10",
        "review_title": "best comedy movie in the universe",
        "review_detailed_main": "Best movie in the universe I never seen such a powerful start to end girl comedy in my life don't miss this friends go for it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vivekkumar-78225",
        "review_rating": "10",
        "review_title": "epic movie",
        "review_detailed_main": "Rarest of rarest creation that could be witnessed at the mainstream of bollywood that ,with a realistic and down to earth story line of great social impact theme of the present scenario"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sulekhkumar",
        "review_rating": "10",
        "review_title": "Story about freindship",
        "review_detailed_main": "I love this story about friendship where four friends share so many emotions"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sangeetadhallji",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "\"Cinema at its Best\" Nothing more to say, Kareena kapoor has once again proved that she is the best"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "romavrma",
        "review_rating": "9",
        "review_title": "It's awesome",
        "review_detailed_main": "It's awesome...it will never let you bore for a single moment."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "anjalidogra-88593",
        "review_rating": "10",
        "review_title": "story of all yougsters",
        "review_detailed_main": ".really the relationship are suck to the life...Being single is the real and best thing of life.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "karansh-68318",
        "review_rating": "10",
        "review_title": "nice",
        "review_detailed_main": "A movie worth watching...the movie makes you forget the daily stresses.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "soniayadav-70064",
        "review_rating": "10",
        "review_title": "must watch movie",
        "review_detailed_main": "Seriously a must watch movie.. worth my money..A must Watch."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "charumanhas",
        "review_rating": "10",
        "review_title": "Nice movie to watch.",
        "review_detailed_main": "Nice movie to watch... firstly thought that it would be movie fit for timepass... so went according but after sometime of watching the thinking simply changed... loved this movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "samirareddy",
        "review_rating": "10",
        "review_title": "loves it",
        "review_detailed_main": "The acting , direction, songs everything is just awesome.. loves it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ajayaksv",
        "review_rating": "10",
        "review_title": "my fav",
        "review_detailed_main": "Story of true friendship and treachery in love this movie is a must watch for friends and lovers .. the performance by lead cast was good."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sharadawasthi",
        "review_rating": "10",
        "review_title": "perfect",
        "review_detailed_main": "Movie is very hilarious and a matter of relationship !!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sbhakti",
        "review_rating": "10",
        "review_title": "worth watching",
        "review_detailed_main": "Loved it.. enjoyed thoroughly... worth watching.. It's a fun ride.. Music , screen gloss, dialogues all was a complete package of entertainment"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aditi-96150",
        "review_rating": "10",
        "review_title": "mind blowing",
        "review_detailed_main": "Fantastic mind blowing...pls book nd watch this movie to ur nearby locatio"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "abhilasha-23879",
        "review_rating": "10",
        "review_title": "best movie",
        "review_detailed_main": "From the beginning to the end movie keeps engaging and laugh... some punches are extra ordinary."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rajniarora-43918",
        "review_rating": "10",
        "review_title": "fantastic",
        "review_detailed_main": "This movie portrays that using very realistic scenes and humour . I will watch it again with FRIENDS!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "punyapoori",
        "review_rating": "10",
        "review_title": "Feeling so refreshed",
        "review_detailed_main": "Feeling so refreshed after watching this one!! There is no better bond than friendship"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sugandhaj",
        "review_rating": "10",
        "review_title": "go and watch",
        "review_detailed_main": "Awesome acting with Good Directions.....We will go again watch this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sethsoumya",
        "review_rating": "10",
        "review_title": "awesome.",
        "review_detailed_main": "Must watch...awesome movie...great dialogues, well acted and nicely executed."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "faisel-57082",
        "review_rating": "10",
        "review_title": "Must watch.",
        "review_detailed_main": "Must watch...awesome movie...great dialogues, well acted and nicely executed"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nilzrav2007",
        "review_rating": "9",
        "review_title": "Crazy, Natural, Unabashed & Unapologetic! You MUST attend this Veere Di Wedding",
        "review_detailed_main": "A complete entertainer full of comedy, drama, emotions, masti, relationships, bonding & the amazing graph of all these characters.\n\nSTRICTLY no male-bashing, no feminism & no women empowerment naatak. Just a story of four women who face life as it comes. Let's celebrate friendship and be there with each other when we need them the most. It also teaches you to celebrate imperfections and refrain from labelling anyone.\n\nMusic blends so well into the movie. Each song has something to say, there is something for everybody. The sangeet song #PappiLeLoon being my top favorite! Lots of EDM, Rock and Funky Dance numbers to keep you grooving.\n\nThere is not a SINGLE dull moment in #VeereDiWedding! Tight screenplay, hilarious dialogues, unfolding of drama, casual flow of narrative, performance by each and every side cast, all these pluses make the film almost a perfect watch.\n\nEvery action of these four amazing girls, be at the wedding or the vacation, will be RELATABLE AF with the girls. You will know when you see it. These are happy, self-independent, financially secure urban, stylish women trying to sort out personal situations & be friends with life as it is.\n\nThere is no scope of vulgarity (except if you consider cussing as vulgar, which was shockingly allowed in UAE cinemas too for a change). We do cuss in our everyday lives and it was shown as it is in the movie as well, I see nothing wrong there.\n\nVeere Di Wedding wasn't trying to prove to be anything in the first place that it deserved the negativity it did on Social Media. Don't like it, don't watch it, let others do!\n\nMy Favourite characters: 1) Sonam Kapoor - I never thought I did say this but she is extremely cute and adorable when her character is very very confused and cute (very unlike herself), smooth yet strong and holds her base right in whatever she is asked to do. 2) Undoubtedly Kareena Kapoor had to have the maximum screen time. The SUPERSTAR is back with a Bang! A very mature, smart and restrained performance. Kudos!\n\nSTAY AWAY from the movie if you are one of those who get easily triggered by just seeing HAPPY women on the screen! For the rest of us who love Bollywood & love to keep personal ideologies separate from the films we watch, have an amazing time at the theatre\n\nLet's all be PRO-CHOICE & let everyone survive in the eco-system. It is OK to have flaws & it is OK to be what you want. I may just watch Veere Di Wedding again with my other girl-gang and I am totally vouching for a sequel already\n\nRating: 4/5 BOOK YOUR TICKETS NOW!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nikitabhatacharya",
        "review_rating": "10",
        "review_title": "jakass movie",
        "review_detailed_main": "Its an amazing movie and its worth spending the amount. friends only understand the importance jakass movie friends"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ajsingh-36865",
        "review_rating": "10",
        "review_title": "Great performances by all actors.",
        "review_detailed_main": "Perfect blend of friendship,love and emotions.enjoyed a lot, perfect weekend movie... some scenes are very hilarious... will be a hit for sure..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jay-74753",
        "review_rating": "10",
        "review_title": "Totally Paisa vasool movie",
        "review_detailed_main": "I just love the movie. Everyone's acting is too good and each and every abusive languages matching also with the situation. Totally Paisa vasool movie. Must watch .people should understand women's also have a full rights to live the way they want ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ridimaseth",
        "review_rating": "10",
        "review_title": "funny movie",
        "review_detailed_main": "This movie is a fun watch with friends. i really had a good time watching this one"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "itslife-13391",
        "review_rating": "9",
        "review_title": "based on reality & actuall fact i jst luv the movie",
        "review_detailed_main": "Creation and acting based on reality & actuall fact i jst luv the movie and the characters bombb no words can explain congratulations to all the ppl..who worked in it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "raviramdevababa",
        "review_rating": "10",
        "review_title": "This one is must watch.",
        "review_detailed_main": "This one is must watch.. go watch it one of the best comedy. Total paisa wasool. Each character justified their role"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "marychugh",
        "review_rating": "9",
        "review_title": "complete entertainment",
        "review_detailed_main": "Complete entertainment. should go out & watch it atleast once . kept laughing throughout the movie.. great acting by every single character."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shankarchand",
        "review_rating": "10",
        "review_title": "super hit comedy movie",
        "review_detailed_main": "This movie is for all generation. go everyone watch it and you will come out of the theater with laugh for sure"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nayakchandola",
        "review_rating": "9",
        "review_title": "fabulus movie",
        "review_detailed_main": "Well comedy masala pack fun unlimited awesome movie. songs touch my heart even a single second i don't feel bore"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "Prachi173",
        "review_rating": "9",
        "review_title": "Entertaining",
        "review_detailed_main": "It's full of fun movie,go with your girly squad..fully entertainment"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "actorankur-15052",
        "review_rating": "9",
        "review_title": "Entertaining, Good & Healthy Comedy",
        "review_detailed_main": "At the box office, it achieved a silver jubilee for sure. Powerful comedy enjoyed a lot"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "deshdeepak-29288",
        "review_rating": "10",
        "review_title": "simply marvelous movie",
        "review_detailed_main": "The film is simply marvelous. The direction is slick and clever. Consider this one the best comedy film of Bollywood ever made after munna bhai mbbs."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ak-82243",
        "review_rating": "10",
        "review_title": "very nicely present",
        "review_detailed_main": "Concept, friend relationship, trust, bounding, love, emotion very nicely present and full entertainment,"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "arvindtiwarimale",
        "review_rating": "9",
        "review_title": "full masala movie",
        "review_detailed_main": "Its totally bollywood full masala style entertaining movie with a nice songs .. Go, if u want to enjoy. full three hours"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "loharatish",
        "review_rating": "9",
        "review_title": "Amazing",
        "review_detailed_main": "Loved this movie, each and every characters of this movie has done his role really well. A story of a four girls, independent, I loved it. Kareena kapoor Khan was beautiful with her role. Sonam Kapoor was also really nice. The most talented actors in a movie, it was a happy meal full of buckets. Enjoyed every bit of it. A paisa vasool entertainer ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sweetybutterfly",
        "review_rating": "9",
        "review_title": "Must watch",
        "review_detailed_main": "Fun movie,all girls gang theire connection ,bonding is good I loved kareena ' s character. Full of fun movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sarthakjaiswaloo",
        "review_rating": "10",
        "review_title": "Amazing Story",
        "review_detailed_main": "Movie is entertaining and comedy. Direction and acting is very good. Story is also good. And You will like songs of this movie also. Theme of this movie Women empowerment has been also shown in this movie very greatly."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "indunegi",
        "review_rating": "10",
        "review_title": "Absolutely wonderful movie",
        "review_detailed_main": "The actor does full justice. It was nice to see Kareena Kapoor after a long time in a very comic role. The actor has a strong presence, even in a brief role. Swara Bhaskar is cute and adorable. Shikha Talsania is awesome and holds his own as Sumeet Vyas and Ishwak Singh too does very well. However, it is Sonam Kapoori who steals the show in a breakthrough performance as one of the most memorable film characters of recent time"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "optionjay",
        "review_rating": "10",
        "review_title": "A must watch movie with your friends",
        "review_detailed_main": "Veere Di Wedding is the most entertaining film i watched till now . A very simple story. But the dialogues are extremely witty. One liners are hilarious. Screenplay moves fast. Every actor is terrific and acts very well in the role given. There are many scenes when whole theater bursts out laughing & clapping. Not a dull moment throughout. Background music is good. Watch it with your friends. I Strongly recommended."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nishau",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": "It is a fun movie, pure entertainment. I just loved the comedy and the dailogues. All the actors have done a great job. Just take your friends and watch to have a good time."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "shaniagaikwad",
        "review_rating": "10",
        "review_title": "I feel sad for those who didn't see in the film what I had seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "geetikamishra-91788",
        "review_rating": "10",
        "review_title": "Full paisa wasool movie",
        "review_detailed_main": "Full paisa wasool movie. After a long time I walked out of a theater with big smile in my face"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "koyalgupta",
        "review_rating": "10",
        "review_title": "Superb Comedy",
        "review_detailed_main": "When I went to watch the movie I was not so sure on how well the director could handle a comedy of four girls, BUT 10 minutes into the show and all my doubts were dispelled! This is a superb comedy, and you should watch it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dogra_sushant",
        "review_rating": "10",
        "review_title": "superb",
        "review_detailed_main": "Perfect mixing of humour and portrayal of life's inner happiness makes it worth to watch for all the age groups."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "singhmeenakshi-02319",
        "review_rating": "10",
        "review_title": "Loved the Movie,",
        "review_detailed_main": "It's a perfect combination of love b/w friendship and family.Loved the Movie, A great entertainer. Fun to watch. I"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "deepakpandit-34472",
        "review_rating": "10",
        "review_title": "High Standard Entertainment",
        "review_detailed_main": "What a movie veere di wedding This movie gains a 10/10 unlike the original. This movie has got its own elements that raise its standard. Not only that, this movie is highly entertaining and stays positive. It gains all win-win in eye of viewer. direction is best Not a single moment in the movie is dull. songs are above average"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "hrishikeshranjan",
        "review_rating": "9",
        "review_title": "Great",
        "review_detailed_main": "The movie is great which the plots in it which are very comic and this type of more movies are needed"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rajprabhu-33234",
        "review_rating": "10",
        "review_title": "include all moments with smile nd tears",
        "review_detailed_main": "One of the best movie who include all parts as showing sorrows,happiness,humorous, sad every feelings include in one movie. it's becs of one of the best part in movie that's the story too unique story with proper dialogue writing by writer."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sunilrocks-28802",
        "review_rating": "9",
        "review_title": "Great Movie so far",
        "review_detailed_main": "The performances are good and the concept in this movie 'Veere Di Wedding' is a struggle eventually giving up rather than accepting the challenges. Everyone should go for a watch."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "a_filmcritter",
        "review_rating": "8",
        "review_title": "bold and beautiful",
        "review_detailed_main": "I'm surprised at all the negative reviews. I found this movie to be funny, entertaining, and cute. It's definitely on the bold side of cinema, but I think they did a great job in that it's not TOO much. All the characters are lovable and the movie a fun ride."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "chauhangurmeet",
        "review_rating": "10",
        "review_title": "A hilarious journey",
        "review_detailed_main": "It's a nice n lovable movie that's really entertaining.must watch"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ragskumar-99117",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "Superb movie. Bit emotional yet extremely hilarious. Must watch. Super fun"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "falgunichawla",
        "review_rating": "10",
        "review_title": "I loved this movie",
        "review_detailed_main": "All in all this is a delightful movie that makes you feel good-after all that is what it is all about. Every minute you will laugh and the silly guy who born to help others performed well in this. This movie had everything you want from a comedy movie go for it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nsverma",
        "review_rating": "9",
        "review_title": "must watch",
        "review_detailed_main": "Movie concept is very good. The performance by the actors and actresses is fabulous. The script is also very good. The content is very appealing"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nandinisuri",
        "review_rating": "10",
        "review_title": "nice movie...must watch...",
        "review_detailed_main": "The story of the movie is different and nice the frndship of 4 frnds is awesome... songs are nice...all over nice very nice movie...must watch..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nisha_thakkar",
        "review_rating": "9",
        "review_title": "Girl Power",
        "review_detailed_main": "Its a great movie. Basically story is about 4 girls of 'south delhi' who are best of friends. Its great fun & comedy movie ... comedy is really good though it makes you emotional at times. All in all its a package and you should watch it ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "roohi-558",
        "review_rating": "10",
        "review_title": "tear droping laughing movie",
        "review_detailed_main": "It is no doubt a very hilarious and entertaining movie. It shows lot of hard work on the parts of script writing, casting and directing - essential for comedies"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "skrocks-65774",
        "review_rating": "9",
        "review_title": "Must watch this a great story",
        "review_detailed_main": "Veere Di Wedding talks about life of four friends - Their relationship, career, love, issues and true friendship with their attachment with each other. This movie is Directed by Shashank Ghosh really a great man. In this movie all the songs was ok and I expected in movie like this."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mehtaroohi",
        "review_rating": "10",
        "review_title": "super cool movie",
        "review_detailed_main": "A very awesome acting by all girls the movie is very awesome. the concept of four modern girls is brilliant very funny movie. in the whole movie the hall was clapping and laughing . i love this movie. pls make its 2rd part also"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sonalibhatt-47640",
        "review_rating": "9",
        "review_title": "Perfect blend between a friends & family",
        "review_detailed_main": "What a story, never bores u ! Perfect blend between a girl and a friend ! Any day please go and watch in theatres. Very interesting story.. recommended"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bksgallery",
        "review_rating": "9",
        "review_title": "Nice Movie",
        "review_detailed_main": "Great movie I can say Women gonna enjoy for sure. Great movie 9 out of 10"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mohsink-76353",
        "review_rating": "10",
        "review_title": "good entertainment",
        "review_detailed_main": "Mast movie h good story dosto k sath movie dekhne me bhout jyada maza ayega"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "surajgoyal-70641",
        "review_rating": "10",
        "review_title": "Good comedy movie and script",
        "review_detailed_main": "Direction is good star cast is also perfect.overall best movie... crazy sonam and kareena fans must watch it both are brilliant Good comedy movie and script was also good"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jsonal-89035",
        "review_rating": "9",
        "review_title": "Beautiful film about the friendship",
        "review_detailed_main": "It's a very Beautiful film about the friendship and Lovable movement of Life . I Like this movie from my bottom of my heart . I love this Movie a Lot ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mehekcool",
        "review_rating": "9",
        "review_title": "Amazing movie",
        "review_detailed_main": "Amazing movie. Excellent acting. Movie will make you laugh and will enterrain you. Have fun watching the movie and play don't go with family. Take friends along"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ssairaampg",
        "review_rating": "10",
        "review_title": "super cool comedy movie",
        "review_detailed_main": "Super movie, I loved the way comedy is used all actors done the best job. Recommend to everyone must watch it to make your day more awesome"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "prasadmanish",
        "review_rating": "10",
        "review_title": "Fabulous movie",
        "review_detailed_main": "Really awesome movie guys watch it now . In this movie you see love , romance , comedy , friendship everything ! Totally worth to watch this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "saikatgon",
        "review_rating": "10",
        "review_title": "Awesome Cinema",
        "review_detailed_main": "After watching this outstanding movie, I say that this movie is really touched my heart. So everyone must watch this fantastic movie with your family and friends"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dazzlingdiana-55169",
        "review_rating": "10",
        "review_title": "A must watch movie ...",
        "review_detailed_main": "Loved this movie .. do watch it with your girls .. It's a very entertaining movie ... don't miss it !!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "myragautam",
        "review_rating": "9",
        "review_title": "perfect winner Veere di Wedding",
        "review_detailed_main": "Nice film its in my favorites list now must watch this acting is superb and songs are catchy overall perfect winner Veere di Wedding"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "jksverma",
        "review_rating": "10",
        "review_title": "Awsome movie",
        "review_detailed_main": "I am damn sure who all watch this movie, will become emotionally strong as this is a whole some package of drama, love, affection, friendly bonding and much more"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "bhawnaroy",
        "review_rating": "10",
        "review_title": "Funny nd awesome punches",
        "review_detailed_main": "Don't miss either gonna regret later. Funny nd awesome punches"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "akshitmadan",
        "review_rating": "9",
        "review_title": "overall good movie",
        "review_detailed_main": "It is a complete entertainment movie that we saw after a long period of time.Good to see how youngsters enjoy their life in this modern world .It was all good experience overall."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "arondhitigopal",
        "review_rating": "9",
        "review_title": "super awesome comedy movie",
        "review_detailed_main": "I was excited for this movie... And it didn't let my excitement down...full punjabi delhi style movie Just loved it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sarojc-96452",
        "review_rating": "9",
        "review_title": "good movie",
        "review_detailed_main": "Its a good movie, good time pass, sometimes you laugh, but end can be much better"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "akshadg",
        "review_rating": "10",
        "review_title": "amazing movie for entertainment",
        "review_detailed_main": "It's an amazing movie for entertainment. every single moment is funny and we are focused to see what's going next move."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "gosvamivandana",
        "review_rating": "9",
        "review_title": "best movie of 2018",
        "review_detailed_main": "We accidentally went to this movie and it turned out one of best movie of 2018 End was really catchy. This movie for those who want to laugh all the time non stop"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "optionjay-56455",
        "review_rating": "10",
        "review_title": "Fun Movie",
        "review_detailed_main": "Loved it...a movie which can be seen more than 10 times because it talks about freedom,good life with good people,and if you find toxic people in your life then just flush them out...10 stars I'll give... Great concept.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "palashkarmakarpk",
        "review_rating": "9",
        "review_title": "A Must Watch Movie For Everyone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vermapriyaji",
        "review_rating": "10",
        "review_title": "awesome movie",
        "review_detailed_main": "What a movie!!! worth it!! Every actor given there 101%!! Superb acting and comedy !! Loves every part of movie!! Sonam kapoor Rocks!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ramverma-27205",
        "review_rating": "10",
        "review_title": "complete entertainment movie",
        "review_detailed_main": "A perfect mixture of comedy, emotion intertwined with enjoyable songs and dance dipped in a pure desi flavour- the outcome is a complete entertainer I given it 10 starts"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nishav-06175",
        "review_rating": "10",
        "review_title": "amazing movie",
        "review_detailed_main": "It's an amazing movie depicting the worth of good friendship. Friendship is the most essential element of human being."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ashishpahwa",
        "review_rating": "8",
        "review_title": "Superb movie",
        "review_detailed_main": "This movie is truly a super-hit comedy I ever saw brilliant acting\n\nI like the songs they are worth listening\n\nGood story-line"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "pandeygarima-42457",
        "review_rating": "9",
        "review_title": "best comedy movie from all corners",
        "review_detailed_main": "Very nice movie. I am love with Veere Di Wedding new punches new excitement. friends maza aa gya go and watch this is the best comedy movie from all corners"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "garima02",
        "review_rating": "9",
        "review_title": "amazing movie",
        "review_detailed_main": "Movie is funny and full of indian sentiments. Its completely shows the modern girls, who want to live life fullest It also has the usual song sequences fuller busters"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "chets-82354",
        "review_rating": "10",
        "review_title": "Awesome movie and a Must watch",
        "review_detailed_main": "Must say movie is totally different and refreshing..Great work done by all the stars Go watch the movie this weekend and enjoy..Great work done by sonam and kareena kapoor. you are totally engrossed from start till the end..Lets enjoy this laughter movie with friends and family"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "prempahwa",
        "review_rating": "8",
        "review_title": "Lot of humor",
        "review_detailed_main": "The dialogues were good-humored and clean. director really done well. The supporting characters really enhanced the movie. The songs were alright and joyous. Overall, it is worth watching because it is a unique movie and there is nothing to do but laugh the whole time"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "samriti-2410",
        "review_rating": "9",
        "review_title": "nice veere di wedding",
        "review_detailed_main": "It is a typical feel-good movie added with clever jokes. Star cast is better direction is strong dialogues are modern type overall satisfactory"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ganatrakashmira",
        "review_rating": "10",
        "review_title": "Fun movie",
        "review_detailed_main": "Awesome movie majaa aa gya ek . movie is very entertaining. And there is lesson take your decision by yourselves weather it's wrong or right.All must go and watch this movie. It for who love to be Alive will love it more."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mandeepmahay",
        "review_rating": "10",
        "review_title": "Good to go.. loved it. all 4 were amazing",
        "review_detailed_main": "Well.. after hearing so many bad review..i went for the movie.. and I loved it..its not at all that bad as people are shouting out.. I mean movie is good.. fun.. if coded slangs were not there movie would have been boring.. the girl's freindship and support fir each other..what women goes throgh their pre marriage.. or married life is the goal of the movie.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "tanuja_mirpuri",
        "review_rating": "9",
        "review_title": "Yo Girl Power!",
        "review_detailed_main": "Veere Di Wedding was a fun film even while sticking to paying a very valuable tribute to girl power! The characters of the film had such a 'real life feel' to them! I loved the girl bonding this film unabashedly promoted and we enjoyed! When was the last time we tasted this flavor in our films that have contrived characters! But, not so with Veere Di Wedding! A clean, fun film that is a must watch!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "agarwalalankar",
        "review_rating": "9",
        "review_title": "full entertaining movie",
        "review_detailed_main": "The movie is full on entertaining... not boring at any time. karena & sonam gets all the charm...both looked stunning . Overall the movie is worth a watch not just a time pass."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rahulrkumar-04714",
        "review_rating": "10",
        "review_title": "You totally will feel like going for a long trip with your friends.",
        "review_detailed_main": "The movie was so much awesome. You totally will feel like going for a long trip with your friends. Haha. Kareena kapoor is gorgeous. Such a treat to watch. It's downright hilarious and paisa vasool"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "akavya",
        "review_rating": "10",
        "review_title": "A good comedy entertainer",
        "review_detailed_main": "Different story with some punch entertaining good, songs are good,us watch this weekend"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "annu-kumar21",
        "review_rating": "9",
        "review_title": "Superb",
        "review_detailed_main": "Fresh story with a refreshing characters ,totally enjoyed this wonderful movie.totally loving the idea I have enjoyed the Movie ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "allehsdahsra",
        "review_rating": "10",
        "review_title": "Its just a movie to entertain us!dont take seriously.",
        "review_detailed_main": "It's good fun movie.dont drag feminism,bad etc it's just a movie.honestly we are so criticised nature society,we don't like serious movie,we don't like some DDLG stuff now so they just made a movie to entertain us so plz do not waste their investment hardwork,it's took 2-3 years to make movie and we declare in 2 hours it's good or bad. Come on! Cheers!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "pramod-871",
        "review_rating": "10",
        "review_title": "Superb Time Pass",
        "review_detailed_main": "After a long time got to see a superb comedy with full of emotions...great to watch. Kareena looks fab as always in comedy"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "suparnayadav",
        "review_rating": "10",
        "review_title": "over-the-top comedy fare",
        "review_detailed_main": "This movie is an over-the-top comedy fare from start to finish. it will leave you in stitches rolling on the floor every character is just perfect I loved the movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ayanbhatia",
        "review_rating": "10",
        "review_title": "jao aur dekh ker aao",
        "review_detailed_main": "The movie has addressed the modern age reality of love and relationships"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rohit-42023",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "All the characters in the movie are amazing ,this movie breaks the stereotype thinking and very engaging and gripping storyline."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nihal_agha",
        "review_rating": "8",
        "review_title": "Great movie, Entertaining, forget the negative review",
        "review_detailed_main": "Very Bold movie, sophisticated. NOT for the conservative, not for family viewing. If you are the Bindaas type, looking for fun and looking to loose the stereotypes, watch the movie!\n\nOtherwise, go watch traditional boring movies with nothing new to offer!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "neemagupta",
        "review_rating": "10",
        "review_title": "comedy movie",
        "review_detailed_main": "Watched such entertaining and comedy movie after long time . Worth watching it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "deshpandemaulik",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "Nice movie... Enjoyed a lot... Amazing dialogues..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "pathakhrishi",
        "review_rating": "10",
        "review_title": "Don't know whats wrong with other viewers !!!",
        "review_detailed_main": "I had zero expectations from the movie, but it was amazingly refreshing to watch such a different concept presented as it is. So many different angles presented in a fun light-hearted manner. This movie needs very open minded audience to appreciate it . Loved it !!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "raiurvashi-77072",
        "review_rating": "10",
        "review_title": "modern girls story must watch",
        "review_detailed_main": "I must say it is a superb movie this movie is so lovely and funny.. direction is very strong story is just perfect, 4 girls met after a long time and they want to enjoy the life together by leaving all the tension behind. Loved it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kanchi-03055",
        "review_rating": "10",
        "review_title": "Fun movie",
        "review_detailed_main": "Not a lot of story for sure. But a happy entertaining movie! Don't watch with family ofcourse :)"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "itsmeraj-91672",
        "review_rating": "9",
        "review_title": "Light comedy as per today's society",
        "review_detailed_main": "Light comedy as per today's society. Depicts openness in the urban life style. New type of challenges as per changing circumstances in today's Girls lifes"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vivekyadav-29604",
        "review_rating": "10",
        "review_title": "Heart touching",
        "review_detailed_main": "Veere Di Wedding is a must watch movie,it has almost all the aspect which is expected from a Hindi commercial movie ,like,comedy,sentiments, craziness, masala etc. Overall it is heart touching movie with lots of Comedy and Entertainment.So I love this movie."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rudrakshbhatia",
        "review_rating": "10",
        "review_title": "perfect for weekend",
        "review_detailed_main": "Great movie must watch good performance good songs and unique concept."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vermarajesh-75720",
        "review_rating": "10",
        "review_title": "fun to watch",
        "review_detailed_main": "As always good and funny... will definitely recommend everyone... Good star cast ... Awesome music and perfect concept."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dhallankur",
        "review_rating": "10",
        "review_title": "very funny movie",
        "review_detailed_main": "Superb acting, engaging story line, entertaining dialogues, funny sequences, I love to watch it again :)"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "onlinemoneyme",
        "review_rating": "10",
        "review_title": "great movie",
        "review_detailed_main": "Lot of fun and laughter...must watch it. I went to enjoy with my friends and they movie did not disappoint us. Go and watch to make your weekend perfect"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vanshikasingh-48526",
        "review_rating": "10",
        "review_title": "Full comedy movie",
        "review_detailed_main": "Full comedy movie movie start to finish very funny scene dialogue are best and funny in short full paisa vasool"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ajayaskv",
        "review_rating": "10",
        "review_title": "awsome",
        "review_detailed_main": "Full fun, full on entertainment. One of the best movie I watched in very long time"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "arniban",
        "review_rating": "10",
        "review_title": "amazing story and best acting",
        "review_detailed_main": "What an awesome movie all the actors have portrayed their characters brilliantly with sonam being a strong character in the film. Amazing story plot"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sharmanisha-30318",
        "review_rating": "10",
        "review_title": "wonderful movie",
        "review_detailed_main": "Simple light hearted entertainer that leave a big smile on your face must watch if you want to make your day awesome"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vaishaliarora-56442",
        "review_rating": "10",
        "review_title": "Veere Di wedding is truly amazing",
        "review_detailed_main": "Veere Di wedding is truly amazing. It is so very entertaining. I love to watch it again and again now it is in my most fav movie list"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ck-52716",
        "review_rating": "10",
        "review_title": "full on masti",
        "review_detailed_main": "Majedar movie, full on masti, all the actors did fab job"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sougataibm",
        "review_rating": "10",
        "review_title": "Must watch & Kareena Kapoor looks extremely hot!!",
        "review_detailed_main": "Four friends dealing with life, love, marriage and heartbreak isn't an unheard of concept. But what makes 'Veere Di Wedding' a unique prospect is that here the pack of performers, is led by four ladies who make their choices, stand by them and have the guts to live their life the they want."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "risha-32648",
        "review_rating": "10",
        "review_title": "Good Movie. Worth watching",
        "review_detailed_main": "The story is about 4 childhood best friend. Each girl has her own issue going on in life and to be honest, I can relate to all of them. I can relate to their situation. The movie is good. It can be a two time watch. Not the best movie but its a movie wirth watching with your friends when you feel low or miss your friends."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ushabance",
        "review_rating": "10",
        "review_title": "Yes we love individuality",
        "review_detailed_main": "Great movie, modern, fun, I have mates been through thick and thin.. so what if they are indian women. Hail women!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nj-13290",
        "review_rating": "9",
        "review_title": "enjoyable movie",
        "review_detailed_main": "Very funny & entertainment enjoyable movie,Most of time we were laughing.intense feeling of hatred and frustration along with friendship."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "malaranikarmakar",
        "review_rating": "9",
        "review_title": "A PaisaVasool Movie",
        "review_detailed_main": "The story of this movie and all the characters have made this movie a must watch movie for everyone. You should watch this movie if you wanna watch a cute love story. It will catch everyone's heart"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "pp-75363",
        "review_rating": "9",
        "review_title": "funny dose",
        "review_detailed_main": "It was entertainment dose. Don't try to find logic in the climax but movie is worth spending money. Just go and take a chill pill with the story."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "purshotams",
        "review_rating": "10",
        "review_title": "Full entertainment movie",
        "review_detailed_main": "Full entertainment movie to watch. Every scene in movie is filled with"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aroramadhu-37263",
        "review_rating": "10",
        "review_title": "A BOLD MOVE",
        "review_detailed_main": "Suberbly casted and it will definately bring change in soceity towards the wrong and right."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aishwaryakapoor-59552",
        "review_rating": "9",
        "review_title": "awsome movie",
        "review_detailed_main": "Awesome movie all characters did justice to the role . The sardarji was epi . Good movie watched 2 times ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "vimalsood",
        "review_rating": "10",
        "review_title": "veere di wedding is steal my heart",
        "review_detailed_main": "One of the best girls friendship movie i ever seen in life the chemistry between four college time friends are must watch. Its truly steal my heart"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nehalhajarika",
        "review_rating": "10",
        "review_title": "A great movie",
        "review_detailed_main": "Its just a hilarious movie, u can spend hours laughing . the movie has got a great blend of humor , the pace of the movie is so good that you will never feel bored"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "amin-siddique5",
        "review_rating": "10",
        "review_title": "This is special movie!",
        "review_detailed_main": "First of all, people who have voted 1/10 star are bhakt. Bhakt are deliberately giving 1 star without even watching this movie. Reason: Because all these actresses took a very strong stand on Kathua incident. All the culprit involved in Kathua incident have bhakt mentality.\n\nVeere Di Wedding is unique kind of movie for the Indian Cinema. This is path breaker movie. This is a trend setter for future comedy movies. It will keep you at the edge of your seat from starting to end. It is very funny & hilarious movie. Go and watch it in your nearby theatres."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kawaljeetkaur-33385",
        "review_rating": "10",
        "review_title": "entertaining movie",
        "review_detailed_main": "Totally an entertaining movie must watch, it depicts the facts of today,"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kumaryogsh",
        "review_rating": "10",
        "review_title": "worth a watch",
        "review_detailed_main": "Sonam kapoor surely going places and she can act well here. Her comedy actions are just perfect ,the movie is light and revolves around 4 girl the movie is to the point and not boring at any time,good songs and overall a worth a watch ,better than the regular bollywood crap."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "samikshaa",
        "review_rating": "10",
        "review_title": "Full of fun",
        "review_detailed_main": "Full of fun and best dialogues ... songs are awesome Badshah rocks as always .."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nainadesai",
        "review_rating": "10",
        "review_title": "fab comedy movie",
        "review_detailed_main": "If you say laughter is the best medicine, so here comes Veere di wedding to cure you. Must watch it for silly and humorous comedy"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "devmalaya",
        "review_rating": "9",
        "review_title": "Ultimate movie",
        "review_detailed_main": "Ultimate movie Kalindi Avni role is best Sakshi also acted well ashould be watched by every one ."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "achal_kingdom",
        "review_rating": "10",
        "review_title": "Superb Movie",
        "review_detailed_main": "This certainly is the best comedy movie of the recent times and thoroughly enjoyed this ride.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sudipbarua",
        "review_rating": "9",
        "review_title": "best comedy movie",
        "review_detailed_main": "Light and Enjoyable. Time well spent which is something you can't say for most movies today. Watch without expectations and you will come out happy and fresh mood for sure"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "tanyayadav-27021",
        "review_rating": "10",
        "review_title": "no 1 comedy movie of the year",
        "review_detailed_main": "This is something worth watching for..Kareena Kapoor Sonam Kapoor Swara Bhaskar Shikha Talsania everyone has given the superb performance.. Will watch again with my friends"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "tanuja1720",
        "review_rating": "9",
        "review_title": "good movie",
        "review_detailed_main": "This movie has something different and the comedy is more natural than slap-stick"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aprajitagill",
        "review_rating": "9",
        "review_title": "worth watching more then once",
        "review_detailed_main": "Overall movie is good and worth watching more then once. Every character of this film is beautifully crafted, dialoged are good, songs are also pretty"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "gpramodsrivastava",
        "review_rating": "9",
        "review_title": "good bollywoood masala movie",
        "review_detailed_main": "Movie was a clash between typical old orthodox mentality versus modern thoughts of the new generation. This movie is a full on bollywood masala, you will definitely love this sonam have proved there acting skills once again. she is growing as actors day by day"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "dollymathur",
        "review_rating": "10",
        "review_title": "Full entertainment ...",
        "review_detailed_main": "A complete entertainment throughout. Awsome Movie Full entertainment ... Casting is very nice .."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "anniepahwa",
        "review_rating": "8",
        "review_title": "Nice one",
        "review_detailed_main": "This movie was fresh and enjoyable comedy. Everything was straight forward. I enjoyed at lot whole 3 hours"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "thakurmohitcool",
        "review_rating": "10",
        "review_title": "full of masti",
        "review_detailed_main": "The movie is a great entertainer. Full toos comedy and well taken. All characters were great. Music was also gud."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "pushkarsingh-54189",
        "review_rating": "9",
        "review_title": "Kareena and swara rocked Bold and beautiful",
        "review_detailed_main": "I seriously loved the movie. Kareena and swara rocked Bold and beautiful. Total entertainment and must watch. People with low mentality might not find the movie worth watching, commenting on the bold scene or anything wont make the movie less worth. Please go and watch the"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "addyverma",
        "review_rating": "10",
        "review_title": "Friendship & Awesomeness",
        "review_detailed_main": "Movie is Awsome. It's Paisa wasool..It's really speak about friendship and also friendship will never never ends.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "peeyusha-24966",
        "review_rating": "9",
        "review_title": "Kudos to Girl power",
        "review_detailed_main": "I watched this movie and it was as good as I expected. Girl power all the way."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "asthachakrabarti",
        "review_rating": "9",
        "review_title": "rip-roaring laughter must watch",
        "review_detailed_main": "This movie was terrific. The comedy caused rip-roaring laughter. I must say comedy have been integrated perfectly. The themes of the movie are very inspiring."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sumanmehta-56881",
        "review_rating": "9",
        "review_title": "totally loved veere di wedding",
        "review_detailed_main": "Few movies come which are masala movie with strong message. strong performance and beautifully crafted story. Even ppl in small role done their job emphatically this movie is one of those. must watch for all"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ayanahuja",
        "review_rating": "10",
        "review_title": "nice movie",
        "review_detailed_main": "Nice picturization with proper characterization .. one time watch must"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aanvipawar",
        "review_rating": "9",
        "review_title": "Time pass movie",
        "review_detailed_main": "It was good movie,i m big fan of kareena & her character is full of entertainment.i enjoyed"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "roymadurima",
        "review_rating": "10",
        "review_title": "loved it",
        "review_detailed_main": "The movie has a lot of funny moments and it was really great to see kareena in a completely different avatar"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "samrititiwari",
        "review_rating": "10",
        "review_title": "very healthy comedy",
        "review_detailed_main": "One of the best movie healthy comedy everyone should go and watch with family and friends awesome work done by full team"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "thakurheena-21006",
        "review_rating": "10",
        "review_title": "Super Dosti (Yaari)",
        "review_detailed_main": "Friendship is the story behind this which is so good. Something different so I liked"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "prabhnanak",
        "review_rating": "9",
        "review_title": "Highly underrated!",
        "review_detailed_main": "I'm surprised by the reviews especially by men. I'm a guy and I loved this movie. It is one of the rare movies which explores the women sexuality in a very funny way. I loved the scene which was considered 'controversial' but was actually pathbreaking. I'm a diehard fan of Bebo but the highlight for me was Swara Bhaskar who gave a bold performance. My only complaint is that the climax could have been a little better shedding some light what happened after the wedding. But if rumours are to be believed, VDW part 2 might just happen. This movie is of a different genre and should not be compared with Raazi and Parmanu. If you don't have an open mind, simply don't watch it."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rohan_mahtani",
        "review_rating": "10",
        "review_title": "In tune with the times",
        "review_detailed_main": "So, here is Veere Di Wedding, totally in-sync with the times and the characters are actually living their part, not merely play-acting it! Look at the camaraderie shared between the girls! It takes away any element of boredom that one may have felt, because, here is a movie that stays close to human relations and emotions! A movie that makes you forget everything else and get in the festive mood as the central characters get you so involved in their lives! You must watch this movie for it's commercial value, even while real emotions surface so well!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "puniit-21965",
        "review_rating": "9",
        "review_title": "Maza aa gya",
        "review_detailed_main": "Superb Actors : Superb Songs : Superb A worthful watch and should not be missed for sure . Maza aa gya"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "neelamvaid",
        "review_rating": "8",
        "review_title": "loved the movie",
        "review_detailed_main": "No doubt it contains fun and lessons of helping others Apart from high end comedy A movie has the motive to aware people to helping others. people shall see even ones to learn good things which our society has need. so don't miss to watch the full drama"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kusimsepheia",
        "review_rating": "9",
        "review_title": "must watch",
        "review_detailed_main": "All the four girls rocked in their roles and steals my heart with their performance"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "kamleshv-19154",
        "review_rating": "10",
        "review_title": "Paisa vasool movie",
        "review_detailed_main": "Paisa vasool movie after a long time. Refreshing movies. everyone should watch it. Each and every single moment of movie is awesome"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "simmikhuranna",
        "review_rating": "10",
        "review_title": "Go for you guys",
        "review_detailed_main": "Amazing movie loved it and i will watch it again .. must watch movie for everyone go and try it out you will not regret it. Go for ut guys"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "neelimapahwa",
        "review_rating": "9",
        "review_title": "light-heart Indian comic movie",
        "review_detailed_main": "It is a light-heart Indian comic movie. If you love to watch comedy movie than don't miss it"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rinkuvthakur",
        "review_rating": "10",
        "review_title": "Chetan Full On Entertainment",
        "review_detailed_main": "Fantastic movie... i would like to watch movie again... acting of all character we placed very properly."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ayan-3705",
        "review_rating": "10",
        "review_title": "amazing movie",
        "review_detailed_main": "It is a rare combination of several good works inclusive of music. its dialogs are ought to be written by some comedy expert. from stat to end full of laugh this movie is"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rishabhchawla-34720",
        "review_rating": "9",
        "review_title": "perfect movie for summer holidays",
        "review_detailed_main": "The film is perfect for this summer holiday season. So colourful, and funny film it is with good message for our narrow minded society."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "romathakur-16720",
        "review_rating": "10",
        "review_title": "story about 4 friends",
        "review_detailed_main": "This is a story about 4 friends and their lives. how they move on from being cool and mast friends..."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "anupamag-26010",
        "review_rating": "10",
        "review_title": "superb..",
        "review_detailed_main": "Amazingly amazing! pure fun and must watch for both girls n guys"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ravirajmailsite",
        "review_rating": "9",
        "review_title": "Nice Movie",
        "review_detailed_main": "Really liked the movie one can go ahead and watch to make the best weekend"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sushmasingh-56381",
        "review_rating": "9",
        "review_title": "good movie",
        "review_detailed_main": "Good movie. must watch with friends. after long time good movie will come. So must watch. some of characters in movie are awesome."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "aradhyamalotra",
        "review_rating": "10",
        "review_title": "Simple but a amazing movie",
        "review_detailed_main": "A great movie... Good work by all the Actors ... Simple but a amazing movie that all must watch."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "baidroshni",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Great movie. acha time pass hogaya. killed the stress. funny scenes. jhakas storyline"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ajayaksv-21711",
        "review_rating": "10",
        "review_title": "full of laughter",
        "review_detailed_main": "Ending scene was too good. Obviously this movie is not for family. Comedy, Entertainment, Unique Movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "gg-08145",
        "review_rating": "10",
        "review_title": "awsm movie",
        "review_detailed_main": "Awsm movie...i enjoyed alot...this movie was total fun and fun."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "yk-31503",
        "review_rating": "10",
        "review_title": "Worth seeing.",
        "review_detailed_main": "Really amazing movie. Worth seeing. Please go ahead and watch whenever you get time."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "champcooldude",
        "review_rating": "10",
        "review_title": "A super entertaining film!",
        "review_detailed_main": "This is an amazing movie to watch... with lots of laughter and fun. This is a take on today's generation ... a complete paisa wasool movie. Go and watch it with your Veeres today!!"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rahulrawat-15767",
        "review_rating": "9",
        "review_title": "good movie to watch with girl gang",
        "review_detailed_main": "A good movie to watch with girl gang. if use of bad words make this movie bad then ppl shud remember we all use them in our real life.at no point u would feel bored while watching movie boys may not like it am sure.watch it and then decide."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "rekhanair-15675",
        "review_rating": "10",
        "review_title": "A Laugh Riot",
        "review_detailed_main": "The funniest film of 2018 and perhaps the DECADE. Veere Di Wedding is a non-stop laugh riot! Sonam Kapoor gives another mind-blowing performance."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "gaurimehta",
        "review_rating": "10",
        "review_title": "I really enjoyed the movie",
        "review_detailed_main": "Glad i watch first day show.I really enjoyed the movie"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "tanyachavla",
        "review_rating": "10",
        "review_title": "such a best movie",
        "review_detailed_main": "It is very humorous movie. Story line is very good, full of comedy. whole 3 hours i can't stop laughing"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ap-53912",
        "review_rating": "10",
        "review_title": "funny",
        "review_detailed_main": "Watch enjoy and laugh. there are really funny dialogs and brilliant script writing"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "ankurpal-46347",
        "review_rating": "9",
        "review_title": "killer comedy",
        "review_detailed_main": "Timely comedy and emotions killed it all ...hats of to Shashanka Ghosh"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "roymeethu",
        "review_rating": "9",
        "review_title": "Worth Watching",
        "review_detailed_main": "Don't get misguided by wrong reviews. This is worth watching."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "nehachopra-71034",
        "review_rating": "9",
        "review_title": "full of entertainment",
        "review_detailed_main": "Its full of entertainment everyone must watch it its a awesome movie to fresh your mind.. please go and must watch its everyone in this movie perform best.. i i enjoy a lot.."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "sangbh",
        "review_rating": "10",
        "review_title": "The Sonam Kapoor and Kareena Kapoor starrer is a fun ride",
        "review_detailed_main": "The four 'veeres', Kalindi (Kareena Kapoor), Avni (Sonam Kapoor), Sakshi (Swara Bhaskar) and Meera (Shikha Talsania), are a solid bunch despite their riches and their entitled troubles."
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "poornimamaru",
        "review_rating": "10",
        "review_title": "totally amazing",
        "review_detailed_main": "It is totally amazing! you should watch it!! kareena nailed it! her acting and chemistry between other girls is out of box. hit hai bhai for sure"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "narayanvibhuti",
        "review_rating": "9",
        "review_title": "best comedy of the year",
        "review_detailed_main": "One of the best movies of 2k18 till now....Please do watch it the enjoy the best comedy of the year"
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "karmagal",
        "review_rating": "",
        "review_title": "Fun Caper",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "mephipocug",
        "review_rating": "",
        "review_title": "worth watching comedy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt5842616",
        "movie_name": "Veere Di Wedding",
        "movie_rating": "3.3",
        "review_username": "praneetdev",
        "review_rating": "",
        "review_title": "excellent movie",
        "review_detailed_main": ""
    }
]