[
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "mstomaso",
        "review_rating": "3",
        "review_title": "Not to be taken seriously, but entertaining at 3 AM",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "MetalMania88",
        "review_rating": "5",
        "review_title": "It's not that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "gavin6942",
        "review_rating": "4",
        "review_title": "What the What?",
        "review_detailed_main": "Tasked with destroying each other, an FBI agent and a rogue DIA agent soon discover that there's a much bigger enemy at work.\n\nThe film has been called one of the worst movies ever made. At the box office, the film made $19.9 million on a $70 million budget. With a total of 116 reviews, the highest for a film with a 0% score, \"Ballistic: Ecks vs. Sever\" is the worst reviewed film in the history of Rotten Tomatoes.\n\nThe first thing wrong, really, is the title. Not knowing who Ecks or Sever are, why do I care if they are versus each other? Just call the film \"Ballistic\" so it doesn't sound like a sequel to a movie nobody saw. I'm guessing some ticket sales were lost because of the misconception of it being a sequel.\n\nOf course, that would not make it a better movie, but it would at least be less confusing."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "jaywolfenstien",
        "review_rating": "",
        "review_title": "It blowed stuff up, and blowed up more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "frankmilne",
        "review_rating": "1",
        "review_title": "Negative review *spoiler warning*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "dbborroughs",
        "review_rating": "1",
        "review_title": "Can't we go into negative ratings?",
        "review_detailed_main": "I liked the trailers, I hoped for the best and then sat in dumbstruck horror as one of the worst films ever made (as in so bad its painful to watch bad) unspooled before my eyes. Rumor has it that the film makers know a thing about movie making. I know the cast does, but what wanders across the screen looks like the dailies of a really bad TV commercial put together by someone with no sense of film structure. I'm told that this has something to do with two assassins fighting each other after some one is kidnapped, but I'm not certain since things just sort of happen for no real reason. I would like to think that this movie was a big joke on the movie going public but no one would want to spend what it cost to make this movie as a joke, especially when there was no hope of ever getting the money back in ten thousand life times. A void unless your eyes need to experience cinematic blunt force trauma applied to them."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Euromutt",
        "review_rating": "2",
        "review_title": "Never mind the ballistics, here's the pathologist",
        "review_detailed_main": "When I say \"Ballistic: Ecks vs. Sever\" was incredible, I don't mean that in a good way. All the main characters are current or former US federal agents, presumably to keep it interesting, but all the action takes places in Vancouver, BC, which, last time I looked, was not in the United States. The basic storyline was fairly straightforward (and rather hackneyed), but the motivations of the various characters were utterly incomprehensible. The film was somewhat on the short side, and I couldn't escape the feeling that the three scenes which might have tied together the loose ends inexplicably ended up on the cutting room floor. Banderas phoned in his performance (for God's sake, enunciate, man), and the musical score was just irritating. The only two things \"Ballistic\" had going for it were the presence of some rarely-seen hardware (fun for you firearms buffs) and some spectacular action sequences (though these were plagued by some annoying clichés, such as a protective vest preventing all injury to a character, and henchmen showing complete disregard for personal safety), and these were simply not enough to save this turkey. Avoid."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "AlsExGal",
        "review_rating": "1",
        "review_title": "\" \"I had no idea what was going on. I just showed up, did what they told me and that was it\",",
        "review_detailed_main": "...says Lucy Liu about her role in this film. When one of your two leads is willing to say, on the record, that they haven't got a clue what the film in which they are starring is about or the motivation of their character is, you know you are in trouble.\n\nUltimately, this film's big sin is that it is so incoherent and completely lacking in motivation for the characters or backstory that it is boring. And cool slow motion flips through the air Matrix style and explosions - lots of them - are not going to change that. I have no idea what the background is between the two adversaries, no idea what makes the bad guy a villain, and no idea how they can spin this into a warm family drama, which they attempt to do at the end, I am just supposed to forget about all of those charred bodies left behind in Vancouver.\n\nThe director of this film goes by \"Kaos\". And somebody actually let him direct another film after this bomb. Granted, it was ten years later, but he got a second chance. I guess I could say to look at the video game of the same name for some guidance concerning the plot, but it is nothing like this film. Except for all of the loud noises, recommended as a substitute for Sominex."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "1",
        "review_title": "Worst film I will EVER see.",
        "review_detailed_main": "I can't understand why this film was made. It's so appalling and so bad that someone involved in the production must have noticed something. Everything in every area of filmmaking is wrong with Ballistic: Ecks vs Sever. Even the title as Banderas and Liu are not in competition with each other.\n\nHere's the plot. Oh, wait a minute, I can't tell you what the plot is because it doesn't exist. It just a massive load of old cobblers. And what's even worse is that the nonexistent plot is full of holes. Make sense? No didn't think so. It's not even worth watching to see what I mean.\n\nThe dialogue is the truly worst ever. At least the bad dialogue in movies such as Dolemite is eternally quotable. Ray Park's 'acting' makes Jean Claude Van Damme and Steven Seagal on their worst day look like Laurence Olivier. The 'action' is so basic it feels like a made for video production, it lacks anything resembling sophistication and excitement.\n\nI'm surprised Alan B. McElroy wrote this. He's done some good stuff (Wrong Turn, Spawn Animated Series) but this must have been something he wrote without much inspiration. Every writer comes up with a turkey but WHAT a turkey this is. Still, a bad script can sometimes make for a good movie if the delivery and direction has skill behind it. that ain't the case here.\n\nPositive energy does not surround this film!\n\nThe DVD is in Dolby 5.1 and 2.35:1 anamorphic widescreen."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "bltzburgh",
        "review_rating": "1",
        "review_title": "Somebody owes me for the hour and a half of my life I wasted",
        "review_detailed_main": "This is one of the worst movies I have ever seen in my life. I literally left the movie going and went to my computer to surf the net. I would turn around to see what was happening when I heard an explosion, but otherwise just wanted it to finish. I rented this movie six months ago but never bothered to comment on it here and then they showed \"The Making of Ballistic: Ecks vs Sever\" on HBO last night and I was reminded how bad this movie was. I think the 3.5 stars is gets for a rating here is way too high."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "jarrid",
        "review_rating": "1",
        "review_title": "absolutely the worst movie i have ever seen",
        "review_detailed_main": "absolutely the worst movie i have ever seen. the acting was horrible, the plot, totally useless and I am really wondering how this movie made it to the screen, not to mention how the script ever got sold."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "zardoz-13",
        "review_rating": "8",
        "review_title": "\"Ballistic\" contains more than enough action and plot reversals to keep its audiences enthralled",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "acedj",
        "review_rating": "6",
        "review_title": "Blast from the past",
        "review_detailed_main": "I saw this when it was first released on home video, I do not remember much of the movie, but I know I saw it because I like both Banderas and Liu. I do remember enjoying the movie. Clearly though,since I have never bothered to watch it since, it was not an Earth shattering experience. I am sure that most of my enjoyment came from the fact that I was still in my 20s and a fast paced action flick was all I needed to be entertained."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "gmdecesare",
        "review_rating": "1",
        "review_title": "Torture.........to watch",
        "review_detailed_main": "I've always liked Banderas.\n\nI don't anymore.\n\nHow on earth such an actor could even contemplate acting in such a ridiculous piece of tediousness is waaaaaaay beyond me.\n\nThere are absolutely no redeeming features - monosyllabic dialogue, wooden, stilted acting, John Woo-ish plagiarism - without the effect, mind-numbing musical score,NO sensible plot.\n\nPlease, for the love of God, do NOT see this film. Wish it on your worst enemies........no, not even !!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "jjs402",
        "review_rating": "",
        "review_title": "Here's a do-it-yourself B:E vs S",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "firmanhadi",
        "review_rating": "1",
        "review_title": "The Revenge of Cardboard Villains",
        "review_detailed_main": "In short, Luci Liu and Antonio Banderas must've been desperate to risk their future career to star in this wreck. Having those two stars on board, a lot of money must've been wasted on this rather forgettable turkey.\n\nHey, don't get me wrong, I love mindless action movies. But even a mindless action movie needs a lot more than just a catchy soundtrack and a bunch of dynamite to make it more entertaining than a 4-minute long Linkin Park video clip.\n\nEven a marginally decent action flick is capable of making the bad guys so nasty that in the end we don't have any choice but root for the good guys. However, Kaos is not even capable of rehashing that tried-and-true formula. His movie suffers from poor character development. I don't care if the good guys win, since the villains are so laughably two dimensional. They're just empty cardboard props ready to be used whenever necessary. Just like those villainy machine gun-toting anonymous robocops resplendent in their bombproof uniform, who miraculously keep getting back on their feet, even after being bombed at, shot at and booby-trapped.\n\nToward the end, we are subjected to lengthy and rather pointless scene of empty freight trains being blown up to pieces. I didn't really see the purpose of this scene. However, now thinking about it, I think the reasons for that scene is just to wake up the audience for the final showdown between the good guy and the bad guy!\n\nIn the end, when the arch villain asks Bandera's character Sever, 'That's it? That's what you're capable of, despite all that training?' We actually want to ask Kaos that very same question."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "go_aheadmakemyday",
        "review_rating": "1",
        "review_title": "Simply one of the worst movie I have ever seen",
        "review_detailed_main": "Yep,\n\nI won't go lightely on this one.\n\nMusic score 0/10 Ok you all know now that there is no story in this. But it is very rare that I can say that even the music score annoyed me. Not that it wasn't good, the music didn't even went with the film. I had the impression of listening to a very bad video clip that only had explosions in it.\n\nDialogue 0/10 I think Lucy Lu had 3 lines in the movie. One of Banderas line was: \"Don't worry, I found you...I'll find him\" Wow, I was flabergasted. Unless you prefer...\"What do we do now\". I have nothing against one liner who doesn't love classics a la Clint Eastwood or Arnold great lines. But this...it's not one liners it's one line because they have nothing else to say.\n\nDirection: 3/10 Ok fights were fine, but aside this I could \"hear\" the director say to the actors place yourslef there and say this. There was NO direction plain and simple. All you see is a bunch of clips glued together with static caracters almost reading their 5 words line.\n\nHo I forgot the camera, closer than this and I could have counted Antonio's nose hair. This is just too close man..up in my face.\n\nAll in all really it is one of the worst (I'm in my 40's) Even if you love Banderas and or Lucy please do yourself a favor don't go spoil your image of them. Both have made a big mistake accepting to play in this \"thing\". I don't even know how they got the money to shoot that thing."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "ecto-1",
        "review_rating": "1",
        "review_title": "Brainless. Useless. Painful.",
        "review_detailed_main": "Brainless. Useless. Painful.\n\nI would have gotten more fun from burning my money. This movie was unbearable. Or at least the first 70 minutes of it. That was how long it took until I decided to cut my losses and escape this torture. With this quality - we could all be screenwriters in Hollywood."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "dszwerin",
        "review_rating": "1",
        "review_title": "It stinks, it stinks, it stinks",
        "review_detailed_main": "Did I mention this movie stinks. My apologies if I am being arrogant to other reviewers, but if you found anything redeeming in this movie, you were not watching the same crapfest I saw. Lets see, what would be a good formula for an action movie. Incomprehensible and totally unmotivated Antonio Banderas + stone faced psycho killer Lucy Liu + non-stop explosions and gunfire + the most jumbled up, idiotic, and unresolved plot ever + a soundtrack that is all techno and actually frequently says things like \"go go go go\" during action scenes + some of the most ridiculous looking stunts ever caught on film = GARBAGE!!!!!\n\nOh and lets not forget the touching moment when Ecks (Banderas) is reunited with his wife just as the movie is having its most poignant moment. She was staring at a manatee in an aquarium. Then he shows up, they hug, we go to slow mo and some intelligence patronizing flashbacks and dialogue, and boom we understand the brilliance of the film. No, no no. This movie fails on every level on cinema. 1 is the only correct rating for this film, but this is America and we're entitled to opinions so if you gave it a 2, I guess thats ok too."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "globalsven",
        "review_rating": "1",
        "review_title": "Why didn't this destroy Lucy and Antonios career",
        "review_detailed_main": "This was a terrible shamefully bad movie.\n\nSooo BADDDDD was the acting you just had to think all the actors (all of them) were just praying that this would go straight to video to be quietly forgotten. Well, we have not forgotten and we will not let this bad choice fade quietly into the night - hear us - this movie sucked. And we will remind you of it every time you make some stupid comment on how great an actor you are.\n\nDon't even get me started on the video editing. Do not let children play with video editors - weird cuts and edits do not make you cool. Go back to your AV broom closet and stay there.\n\nDirection - If only I had the directions to the directors home I would post it here so that we could all take up pitchforks and torches and pay him a visit."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "theslowwizard",
        "review_rating": "1",
        "review_title": "This movie stole my soul and then hurt it too.",
        "review_detailed_main": "I cannot figure out what encouraged me to go see this HORRIBLE movie. I should have been scared when the director was identified as KAOS, or in other words, the director doesn't want his name on this poo. WHY WAS THIS MOVIE RATED R????? There was no blood, no cursing, and no nudity. When a movie is as bad as this one, there should be at least be SOMETHING to make it worthwhile. Oh, Antonio, how far you have fallen! I remember when you were an unknown actor playing Tom Hank's lover in Philadelphia. Look at you now, you poor man. Well, actually, you're a very rich man. Anyway, Lucy!!! Lucy, what was that one movie you were in with the kicking and the explosions? Yes, that was a good one. I have no one to blame but myself for going to see this junky junk. Maybe I can blame my parents for raising me wrong. I am very glad that Florida movie prices are pretty low. That being said, here is my final statement: AVOID THIS MOVIE AT ALL COSTS!!!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "tijlemanz",
        "review_rating": "1",
        "review_title": "Worst film ever",
        "review_detailed_main": "I will not use many words to inform you about this movie. The whole movie exists of ripped ideas of other movies. There isn't one original part in it. Therefore one of the worst movies ever. The only good part of the movie is the two women playing in it. They are beautiful, but the rest....................1"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "bizz-2",
        "review_rating": "10",
        "review_title": "INSTANT CLASSIC!!!",
        "review_detailed_main": "Cooooooooooool flick, forget about the bad reviews and watch the\"Ballistic:Ecks vs Sever\" DVD edition... what an awesome sound, maybe the best 5.1 dolby surround I've ever heard in my home cinema (in my opinion better than \"Saving Private Ryan\"). \"Ballistic\" is a guilty pleasure, when watching it you now that it has gone too far in many moments, and anyone can notice that there's no screenplay (obviously no coherent story)...but who cares if you are having such a lot of fun.\n\nIf you are a die hard-fan of action movies this is your sort of film. Lots of fun + loads of action+ hundreds of explosions + perfect sound = an evening of fun...please, bring the popcorn."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "vamp88",
        "review_rating": "7",
        "review_title": "More bang for your buck",
        "review_detailed_main": "I was not impressed or disgusted enough to leave a comment on this film. So why am I typing now? I saw this was in the bottom 100 here on IMDB. It wasn't that bad. Actually I enjoyed it, but I was in the mood to not think and just watch stuff blow up (having a bad day). That's what I got. Lots and lots of explosions, and fun action, there were more explosions then dialouge. There is some plot here, but don't watch this for realism or story. It's a cartoon, a video game, just mindless action and entertainment, and thats why its worth seeing and doesn't belong on the bottom 100.\n\nIt doesn't come close to being a must see action flick (see the first 2 Lethal Weapons, Die Hard, Escape from New York or dozens of others), but it's not that bad."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Rosettes",
        "review_rating": "5",
        "review_title": "Lots of guns, hurt, boom, action, villains, ..everything a movie needs......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "absurdly bad espionage thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Big O-7",
        "review_rating": "1",
        "review_title": "Rated R for Retarded!",
        "review_detailed_main": "This is one of the worst movies ever made. A previous reviewer says that this \"could have been much better\" ... I couldn't have agreed more! This movie would have been better had it never been made. Please stay away from this film."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "pistolaro_amigo",
        "review_rating": "5",
        "review_title": "Turn your mind on numbbbbbbbbbb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "clcorp04",
        "review_rating": "1",
        "review_title": "One of the five worst movies I have ever seen!",
        "review_detailed_main": "Ballistic: Ecks Vs. Sever is with out a doubt one of the worst movies ever made, or even thought of for that matter. Firstly, a five year old child could have come up with that plot (or lack there of). Second, a seven year old could have written the script. I would like to see the actual script and count the total amount of actual dialogue in the entire film. Besides the lack of dialogue and plot, the action scenes and stunts were terrible also (which unfortunately the producers must have been counting on, oops). Another theory might be that they were counting on mega action stars Antonio Banderas and Lucy Liu. What a joke! At least I got to watch this garbage on television and didn't make the mistake of paying to see this junk in a movie theater for nine bucks."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "bluedust",
        "review_rating": "1",
        "review_title": "This movie is terrible",
        "review_detailed_main": "This is so poor. What I fail to understand is why Antonio and Lucy would waste there time on a movie like this. Now I come to think of it why did I even watch past 5 minutes. The acting is poor and the stunts are just pure eye candy. The worst part of the movie is when Lucy gets a gun off a guy who has come to catch her; she runs out of ammo and magically pulls out a clip of ammo for that particular sub machine gun and continues her rampage. I know she is meant to be this killer rogue agent but to have spare ammo in those tight clothes is just unthinkable. I think this movie started as a good idea and ended up as a movie that could not live up to the trailer. Stay away from it trust me."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "nivasch",
        "review_rating": "1",
        "review_title": "Ick!",
        "review_detailed_main": "A positively mind-numbing waste of 91 minutes. Could Antonio Banderas be possibly be more embarrassed by this performance. Lucy Liu is no great actress to begin with but Icks Vs. Sever is by far her worst screen appearance to date. Liu can play manipulative and sexy on television programs but she doesn't possess enough physical prowess to exude a threatening demeanor that was required here. There's lots of bombs and smoke by hardly any engaging story or people. Director Wych Kaosayananda could have achieved the same results by pointing his camera at a chess match and then tossing a few firecrackers at all the pawns for an hour and half. I don't recommend this film at all. See The Avengers instead."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "daveyellis",
        "review_rating": "1",
        "review_title": "Gun scene copy of The Matrix",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "r-c-s",
        "review_rating": "3",
        "review_title": "salad bowl actioner comics style",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "eh49er",
        "review_rating": "10",
        "review_title": "Non-Stop Action w/o a real plot",
        "review_detailed_main": "This movie has a lot of good action, and no real plot. If you like action movies, I would recommend it. It has many good fight sequences, and the movie does not drag on forever. I wouldn't say it is one of the greatest movies ever, however it is deffinatly NOT one of the worst movies ever either,"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Sleel",
        "review_rating": "6",
        "review_title": "Middling, muddled, cool looking action flick",
        "review_detailed_main": "While I did not think this was a particularly good movie, I am very surprised to see how low of a rating it got. The same people that gave \"Charlie's Angels: Full Throttle\" close to six stars gave this only 3.6? Ballistic was disjointed, over-edited, shallow, and cliched, but it was at least entertaining, unlike the barely-watchable \"Charlie's.\"\n\nLucy Liu was the only bright point in \"Charlie's,\" and as such is, in my opinion, completely under-utilized in this film. While she is given a chance to look great, she has few lines and little character building. She does the best she can with what she's been given. Banderas also does a good job with his stereotype character and manages to make him a bit less of a cardboard cutout than he what he started out as. Liu is very believable as a badass. She doesn't even blink when she fires a weapon and does a decent job of fighting in the non-stuntman scenes.\n\nThe blame for this movie's weak points rests mostly on the director. It seems like anything of any substance was cut in one of the \"artful\" cuts of current and past exposition that seem spliced and blended together almost at random. A good editor could probably fix some of this damage, dropping at least 5 minutes of run time, but another 10 to 15 minutes of footage would have to be added to give the story a hint of coherence. On the plus side, some of the photography was beautiful.\n\nBottom line: good action, crappy plot, looks cool, the two main character(s) are babes (depending on your gender/orientation). This is an average action movie that I probably will watch again sometime when I want something that doesn't engage my brain but has pretty things to look at. With explosions. Lots of them."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "susiesays",
        "review_rating": "4",
        "review_title": "Expected more of a storyline, great action on the character of \"Sever\".",
        "review_detailed_main": "I expected more of a storyline from this movie. I think that it was a very weak storyline. Lucy Liu's character \"Sever\" kicked butt! Antonio Banderas character \"Ecks\" left much to be desired. I'm surprised that Ecks could keep up with Sever in the fight scene. I feel they made the character of \"Ecks\" weak and boring. This will probably be the last time I watch this movie unless it's on HBO, and even then I would probably attempt to watch something else."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Mr Parker",
        "review_rating": "",
        "review_title": "For the love of Christ! Make it stop!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "miteycasey",
        "review_rating": "4",
        "review_title": "Explosions!",
        "review_detailed_main": "I don't like the title Ballistic would be fine or Ecks vs. Sever but not both. The action scenes are a 9. If you like explosions and action this is your movie. The movie would almost be better watch with the mute turned on. Thats how weak the script is."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "DanTheMan2150AD",
        "review_rating": "2",
        "review_title": "Painfully boring",
        "review_detailed_main": "I was gearing up to have a fun time with Ballistic: Ecks vs. Sever but it, unfortunately, just turned out to be a painfully incoherent and boring mess without any hint of sanity or irony. It's startlingly inept without a hint of wit, coherence, style, or originality chasing the success of The Matrix but with the skill and technical prowess of Battlefield Earth. The subtitle doesn't even make sense given they team-up but it takes the movie and the audience a long time to figure that out in between the snooze-inducing mayhem and the overabundance of cliches. When the movie is just as confused about its plot as the audience, they know they've gone wrong."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Finally...an action film for people who found the Rambo films too intellectually taxing...",
        "review_detailed_main": "\"Ballistic: Ecks vs. Sever\" is not just a dumb title for a film, it's also a really, really dumb film. It's the sort of horribly written film chock full of non-stop action that seems to be written for folks who found the Rambo films too intellectually taxing. One stunt after another after another after--all strung together with conspiracy film clichés--that, in a nutshell, is this film.\n\nThe film starts with the jaded FBI agent (Antonio Banderas--who seems half asleep in this role) being forced to rejoin....oh never mind, you know how this crappy clichés will go. And ultimately, he'll be force to join his old nemesis, the super-dangerous Lucy Liu (!!) to fight the powers of not-niceness that threaten to control the destiny of the Free World. And so, to do this, they punch and kick, blow up stuff and kill. This is punctuated by kidnappings, mayhem and conspiracies--none of which seem anything more than plot devices.\n\nOverall, not a lot to provide interest to anyone--even stupid people. Silly--just the sort of action film you might expect Jethro Bodine to make--if he was real and had his uncle's millions to finance this dud. I could imagine him directing this thing and shouting \"Hoo-Wee--we gots lots of double-naught spies!!\"."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "claudio_carvalho",
        "review_rating": "3",
        "review_title": "Explosive Garbage",
        "review_detailed_main": "If a friend of mine had told me that this movie is not good, I would never believe it. Having Antonio Banderas and Lucy Liu in the cast, with a wonderful tri-dimensional picture of them on the cover of DVD, I would think that he would be exaggerating. However, this film is awful, one of the worst I have ever seen, a pure waste of time. It really deserves to be among the IMDB Bottom 100. The characters are not developed, the story is confused, there is not acting... only explosions, more explosions and more explosions! I do not know how a producer can spend a large amount of money in such a film. In Brazil, this movie is called `Dupla Explosiva', which means `Explosive Double (Pair)'. Better off calls it `Explosive Garbage'. Tomorrow I am going to try to be reimbursed in the cost of this DVD. My vote is three.\n\nTitle (Brazil): `Dupla Explosiva' (`Explosive Double')"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "paolo-condorelli",
        "review_rating": "5",
        "review_title": "Not so bad, as many reviewers say",
        "review_detailed_main": "Frankly I enjoyed this action flick. Ok, the plot's not original. But Lucy Liu's performance's convincing. As for Antonio Banderas, well, time goes by, but he's a good sideshow for Lucy. I thought Talisa'd kick ass, whereas she doesn't say many lines in this movie. I feel that MK 3 will be the action movie for Talisa. I hope she won't disappear form the movie industry as it happened to Charlotte Lewis"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "derboiler",
        "review_rating": "1",
        "review_title": "Crash Boom Bang",
        "review_detailed_main": "Boring Characters, stupid story and even the fighting scenes look bad. No explosions only do not make an interesting movie. Action is more than that. So back to the directors school Mr. Wych Kaosayananda. For wasting the time of great actors and my own by the way I can really give 1 of 10!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "jim10376",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Perhaps the worst movie I have ever seen and I have seen Ishtar. Bad script. Bad acting. Bad everything."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "grafxman",
        "review_rating": "10",
        "review_title": "SUPER ACTION FLICK!!",
        "review_detailed_main": "This isn't just another action flick, this is a SUPER ACTION FLICK! When I see a flick that is supposed to be an action flick, I expect to see a lot of action. This flick doesn't disappoint. I suspect another Detroit assembly line had to be opened up just to supply the cars blown up in this film. Apparently they ran out of cars because towards the end of the film, they started blowing up railroad cars!\n\nLucy Liu really delivers the goods here. Watch her as she runs through an\n\nunderground parking garage in one scene. She runs with her mouth closed, just like that liquid terminator played by Robert Patrick in T2. Watch Antonio Banderas race around on a motorcycle without a helmet on. I was very surprised they let him do that.\n\nThis movie screams sequel to me. I hope they have one using the same cast and director. One small detail. Watch for Antonio to kill the bad guy's Brit sidekick then watch the Brit sidekick show up a few scenes later.\n\nI gave it a 10.\n\nRoger Moncrief"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "xguy8",
        "review_rating": "6",
        "review_title": "Explosions Are Cool! This movie's plot is not!",
        "review_detailed_main": "Let me just open by saying \"Ballistic: Ecks vs. Sever\" is by far one of the dumbest, most god forsaken titles I have ever heard of.It's 2 titles over crammed into one.It's just an awful title.\n\nSo,here's the deal with this movie.The story side of it sucks.It's predictable, cliched, unbelieviable, and just loaded with plot holes.By the end,I don't really care about what's going on.\n\nBut...on the other hand...they just blow s--- up alot in this movie! And I got to hand it to them,blowing s--- up is pretty damn cool! Really, the \"plot\" of this movie is just a cover so they can have some really cool explosions.And that's not a bad thing.Because explosions in movies are cool.Also,the fighting sequences and shootouts are really cool too.\n\nAntonio Banderas and Lucy Liu do a fairly good job here,but the plot is beyond what their acting can save.Even though they are the 2 big name stars in the movie,the real stars of the movie are those oh so cool explosions!\n\nI'm going to give this movie a 6 out of 10,which is way more then this movie really deserves.If I was judging this for for it's plot,it would be a 1 of 10,because the script is on the level of \"Glitter\" or a Joel Schumacher Batman movie.The reason my rating is that high is simply because I like the explosions...the explosions are cool!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "erhmntx",
        "review_rating": "2",
        "review_title": "I couldn't stop laughing... \"Blow'd Up\"",
        "review_detailed_main": "It is hard to believe that a movie with so much money put into it could be so badly put-together. I couldn't even tell what the \"storyline\" was or who was fighting whom until two-thirds of the way through the movie. The scenes did not seem to flow from one to the other. The action sequences were so overdone and completely unrealistic that they had me in fits of laughter. Not only that, but they were unoriginal and unremarkable in every other way, so they did not add much in the way of entertainment value. Antonio Banderas seems far too old for this role, and is not an action hero in this movie whatsoever. The acting is mostly awful, very forced; therefore, emotional interest and character development is completely nonexistent. About the only thing good that I can say about this movie is that Lucy Liu kicks some ass in the action scenes. Unfortunately, she uses only one facial expression throughout the entire movie and has less than 30 lines of dialogue, if you can call it that. Do you remember the E*Trade commercial that ran last year where this guy sees a trailer on TV for a fake movie called \"Blow'd Up\" and then sells his stock in the production company because the movie looks so horrible? This is the real thing."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "xx_deleted_xx",
        "review_rating": "",
        "review_title": "Unbelievably dull, one of the worst films of 2002",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "sanctus",
        "review_rating": "2",
        "review_title": "Badly executed, excessive action scenes with no plot.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "rjkardo",
        "review_rating": "1",
        "review_title": "Just BAD",
        "review_detailed_main": "Ugh...this movie was bad in so many ways, it is hard to decide where to start. The action scenes were laughable...the events they portrayed were not even exciting in their badness, they were just bad. Lucy Liu is not an action hero, folks, and the attempts to make her seem one were pathetic. Banderas slept through this, obviously consoling himself with thoughts of a paycheck... This movie deserves every bad review it has gotten."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "cafesmitty",
        "review_rating": "5",
        "review_title": "Lucy Liu Showcase gone awry",
        "review_detailed_main": "This is nothing more than a Lucy Liu Showcase films. Its one of those films that she did, but they did not know what to do with her. But lets talk about the film. Antonio Bandaras is 100 percent unconvincing in his role as a gruff FBI agent. The unshaven thing just does not work with him. The role works well for Lucy Liu if they have given her more to do, the movie would have been a lot better. They should have try to write SOME sort of a story. I mean, the only way that you could revive this plot is with 10,000 volts of electricity. This is the type of movie that you find, while channel surfing late night movie channels. Or the type of movie they play on those same channels, at 2 pm on Saturday, as a filler before they bring out the good films. It is utterly forgettable the moment the opening credits start and it is forgotten the moment the closing credit starts. It fits right in there with Stallone's Assassins, umm, and things like Tango and Cash. Its not so bad, its just that it is totally bland. If you don't see it, you are not missing anything. This film will never be brought up in anyone's conversations about films. Let me back up... perhaps it will when discussing Kill Bill and trying to think of films Lucy Liu has been it. I wouldn't say avoid it, I would say, don't make an effort to see it."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Cassandra8348",
        "review_rating": "5",
        "review_title": "Favorable impression over all.",
        "review_detailed_main": "This was a satisfying action/adventure in that both of the leads were well developed;ie. you knew what their motivations were. My major unhappiness with the picture was that the main villain was not given the same treatment, he was rather one dimensional.\n\nSpecial effects were excellently done, the pacing was fast (which is a must in good act/adv) and I liked the interplay between the leads."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "dispet",
        "review_rating": "1",
        "review_title": "........where to begin",
        "review_detailed_main": "there is not one redeeming feature of this film. it makes trash like tomb raider or bug busters look like high art.\n\nand it is not an action flick as the director has no idea of how to direct a camera. in fact, this can all be summed up in a four word review: complete and utter s**t"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "A jumbled mess of action",
        "review_detailed_main": "BALLISTIC: ECKS VS. SEVER has something of a bad reputation among movie fans, which is perhaps why I never got around to watching it until now. I don't have a problem watching mindless action films, which this is, but only if the action is done right, and that's where BALLISTIC falls down. Around just under half of the action sequences are okay, but the rest of them are very poor, particularly when it comes down to the hand to hand combat.\n\nThe story is about a couple of rival assassins who...well, I can barely be bothered typing it out. You know the routine. Antonio Banderas keeps his head down and tries to blend in for the most part, but the stand-out awful performance belongs to Lucy Liu, who once again utterly fails to convince as her supposed femme fatale character. The supporting cast are a little better, with a Talisa Soto cameo and a meaty bad guy part for Ray Park (Darth Maul in THE PHANTOM MENACE) who at least gets to kick plenty of backside without his face being painted.\n\nI admit to enjoying a couple of scenes in this one, particularly a stand-out moment in which a truck is hit by an RPG fired from a bridge; great stuff indeed. But overall this is a jumbled mess, not helped by the choppy direction of Thai director Kaos, aka Wych Kaosayananda, who similarly fumbled 2 GUNS: ZERO TOLERANCE."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "mr_popcorn",
        "review_rating": "1",
        "review_title": "God Awful",
        "review_detailed_main": "Ballistic: Ecks vs Sever doesn't deserve to be called an action movie. As a matter of fact, its not a movie, its a jumbled mess with no plot, wooden acting and just plain atrocious. One of the worst movies I've ever seen and I want one and a half hour of my life back. There is absolutely no redeeming value in this piece of garbage, it headlines Banderas and Liu in their worst roles ever, one can only wonder why the two of them agreed to do this garbage. The dialogue is monosyllabic and the plot, if there ever was one, is distasteful. Also, the excessive and unnecessary use of explosives reached to an annoying and \"make-me-want-to-kill-the-director\" level, I just wanted it to be over with this device of mental torture. I strongly urge you not to watch this piece of junk, steer clear from it at all costs and erase it from your memory forever."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Aphius",
        "review_rating": "10",
        "review_title": "Drop the Ballistic...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "xSoupyTwist",
        "review_rating": "7",
        "review_title": "It was okay...very action packed",
        "review_detailed_main": "I thought this movie was okay. I don't get why people think it was horrible. The plot wasn't really clear, sure, but if you like action movies then this is for you. There was one scene that was dragged out really long though. That was boring. but otherwise it was okay. It's mainly about two agents who used to work for the FBI and DIA who want revenge on a certain person for their own personal reasons. There really is not romance in the movie which is fine with me. There's almost no cussing that i can recall nothing big at least. some places are a bit unrealistic but hey, it's a movie. It is action packed filled with explosions and gun scenes. so if you're that type of person, go for it :]"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "honza-tesa",
        "review_rating": "4",
        "review_title": "Don`t waste your time with this s***",
        "review_detailed_main": "Very bad action film with quite good cast. Instead of some managed explosions and the body of Lucy Liu, there nothing that worth seeing.\n\nOne of the most boring movies I have ever seen. So, do not waste your time with this. There are much better action titles than this wannabe \"spectacle\".\n\n4/10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Li-1",
        "review_rating": "",
        "review_title": "It actually sucks the fun of a moviegoing experience.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "hubyduby",
        "review_rating": "1",
        "review_title": "Nine Dollars for this? Of course I went Ballistic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "kvdlinde20",
        "review_rating": "2",
        "review_title": "Don't think the movie had any real plot",
        "review_detailed_main": "There was a lot of explosions and shootings and chases and no real plot... If it wasn't for the fact that the female characters were fully dressed it could have been a Michael Bay movie."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "harmenmeijer",
        "review_rating": "1",
        "review_title": "Phew, did this movie suck",
        "review_detailed_main": "I don't really want to elaborate but here goes; - excessive us of explosions and people surving major blasts is really hard to believe. - storyline is sooooo weak - Very bad Matrix imitation scenes Need I continue?\n\nBanderas was oké, it was just a bad film. This should have been featuring this Jean-claude van Damme character so I would have avoided seeing it altogether. Boy, did this suck!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "overblown mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "mgarland",
        "review_rating": "2",
        "review_title": "This movie would stink on ice...",
        "review_detailed_main": "Never have I had such great expectations for a cast like this and have it fall so flat that I for once agree with all the low votes. This movie was bad...uninspiring, boring, pitiful. I really like Lucy Liu and Antonio Banderas, a lot. But this movie takes the cake for being awful, and boringly awful at that. Every scene is so disjointed, there's almost no plot movement or logical reason for the movie at all. Some people get shot, some stuff gets blown up, Antonio and Liu fight, then they don't fight. That's it, nothing worth watching. Thank goodness they both have careers they can actually be proud of; this movie won't help or hurt them any I don't think."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "bullions27",
        "review_rating": "1",
        "review_title": "?????",
        "review_detailed_main": "Good thing they decided to allow Director Kaos have his way with this thing. It is afterall a movie about complete chaos and the effects of explosions on movie sets. There's supposed to be a plot behind all of this mindless mayhem... something along the lines of global conspiracy but none of that the Director nor his crew really cares since it gets lost about a third of the way through the film thanks to some explosions, dubious acting, and more explosions. Lucy Liu plays the most boring and monotonous character I have ever seen in recent decade (well, since Padme from Episode One), and Banderas acts pretty goofy and hilarious in his role. Neither of them we really care about since the explosions take center stage. I left the room about 20 minutes before the ending (I assume this unless there's more to the movie and the audience like me just got up and left) so I can't tell you anymore. I will say though this movie is about as brainless and moronic as the title itself.\n\n2/10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "keith_town_123",
        "review_rating": "5",
        "review_title": "Amazing fight scenes but not a lot of thought to the story...",
        "review_detailed_main": "This movie is not that bad. I rented it purely because I hadn't seen it before. The best part of this movie are the fight scenes. Holy S*** they are awesome. Its true that the whole 82 minutes are basically one huge fight scene and car chase with about a thousand explosions in there (two cop cars flipping at the same time, huge wide screen plasma TV surround sound :D), but the story is good. It just needed a little more expanding, maybe another half hour of story telling to flesh it out. It is a little annoying when a script does that, just keeps the audience numbed with lights and noise, with out some speaking here and there. If you want to see some great fight scenes and awesome explosions, rent it, but don't expect an amazing script."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "mattkosorok",
        "review_rating": "10",
        "review_title": "Great action, great fun, and a great message",
        "review_detailed_main": "I really liked the message preached by this film. While most preaching I find offensive, this was not-so-subtle yet easily accepted.\n\nI really like the idea of a tough FBI agent who's nearly indestructible, not because he's got superhuman powers or special technology, but simply because he's got the will to succeed.\n\nLucy Liu did great. I really enjoyed how she portrayed a great deal of emotion without portraying any emotion ( you have to see it to understand what I'm talking about ).\n\nIt was fun to see some other actors in rolls you're not used to.\n\nRay Park is a hoot. His martial arts style is quite entertaining. I like Jet Li's style a bit better, but Park's pretty good for a white guy ( he's got a work on his voice, though, it's too weak ).\n\nAidan Drummond did great as Vinn's son. His interaction with Lucy Liu was well done.\n\nAs usual, Mr. Banderas looks great getting us butt kicked. He reminds of that clock that \"takes a licking and keeps on ticking\". There couldn't have been a bone left unbroken in his body.\n\nMaybe I'm too easily impressed, but lots of folks didn't rate this show very highly. Maybe they were expecting it to be darker than it was. I must say it's a definite good watch, and an absolute DVD keeper."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "brahmana",
        "review_rating": "7",
        "review_title": "Ambient low-key acting, good action but stereotypical bad guys",
        "review_detailed_main": "The acting of both Lucy Liu and Antonio Banderas is very low-key - same as you would expect from main roles in a Western; very simplistic and sparse, seemingly shallow were it not for the implicit references to shared knowledge, which the audience is only let in on through flash-backs or from other characters. This way of acting suits them both excellently, and creates an attractive ambient atmosphere, energized by their martial encounters and growing mutual sympathy.\n\nThe bad guys (Gregg Henry as Gant and Ray Park as his right hand Ross) do not contribute a whole lot to this movie. Gant is the sinister/smug/self-absorbed crook which Gregg also embodied as Val Resnick in Payback, and Ross' vocabulary is annoyingly redundant, particularly his constant use of the euphemism 'cancel' (one might be inclined to blame this on the script, but more subtle acting could have pulled it off by not emphasizing 'cancel' each time).\n\nPerhaps what I like most about this movie is that Lucy has a major role. In her other movies she is mostly spice to the plot, although Lucky Number Slevin does allow her personality to surface. To me, Ballistic is the best Lucy-movie. She makes a very lovely femme fatale, even agonizingly crisp in a catsuit.\n\nDo not watch this movie if you consider lack of dialog synonymous with shallow acting, or if you are just not a fan of low-key acting. If, on the other hand, you enjoy good atmosphere in a movie, Ballistic may be one of those you want to return to from time to time.\n\nI give it a low 7, and would have gone higher if the feel of the movie were not occasionally fractured by the Gant and Ross characters."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "EmbyQuinn",
        "review_rating": "5",
        "review_title": "Not great cinema, but not dreadful.",
        "review_detailed_main": "I went into watching Ballistic: Ecks vs. Sever with few expectations, which is a good thing, because it isn't all that. Even so, it deserves better than the 3.5 average rating it gets here at IMDb. The story held a few surprises, and I'm not easily surprised. Lucy Liu looked fantastic, her moves were spot on, and Antonio Banderas was surprisingly charismatic as an agent with little or nothing to lose. I had a bit of trouble understanding why they justified an R rating; there's almost no blood, no gore or dismemberment, and a (relatively) low body count. There are a lot of explosions, some relatively decent hands-on action, and lots of spent brass in this flick. It has more plot than a lot of recent action films, and I appreciated the choice to make Sever a woman (Sever was originally a male role). While the action occasionally comes across in the spirit of the old MAD Magazine's \"Spy vs. Spy\" cartoons, it's still worth the watch if you like Banderas, Liu or lots of cars blowing up."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "dead_end",
        "review_rating": "",
        "review_title": "decant action movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "henrikln76",
        "review_rating": "2",
        "review_title": "Much worse than expected...",
        "review_detailed_main": "What can I say? Thin plot, mediocre acting, bad score, poor directing, confusing cutting, ridiculously many and long slow motion shots, standard (and in some cases really bad) fighting choreography...\n\nI can't think of much good to say of this movie, not even Liu or Banderas has much to offer in this one. In some badly directed movies you can often see the directors intentions even though he/she really couldn't make it \"all the way\" but this one is mostly just plain awful.\n\nThe plot is pretty much standard with ex-(insert favourite agency here)agents that have to return for one final mission, but has one or two somewhat surprising twists along the way.\n\nDon't see this movie unless you are looking for a few good laughs and see how an action movie SHOULDN'T be done..."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "the amorphousmachine",
        "review_rating": "1",
        "review_title": "I was wrong about 'Crossroads'! This is the worst film of 2002.",
        "review_detailed_main": "What can I say? Shame on the Razzies for not nominating this film for anything in 2002! Its score is zero on RT, and by gosh, I'm telling you that zero is well deserved.\n\nThis is one of the most excruciating messes I have ever sat through. The plot revolves around the kidnapping of the head of the DIA (Gregg Henry) young son by a mysterious agent named Sever (Lucy Lui). Enter Ecks (Antonio Banderas), who is forcibly recruited to the FBI after learning that his wife is still alive. He must track down Sever in order to get some microscopic weapon planted in the kidnapped boy in the midst of an action sequence between the DIA, FBI and the invisible Sever. Sever cannot be stopped as a well-trained assassin who uses every weapon available to thwart the DIA agents led by Ray Park's character. The incoherent plot and action sequences are both as confusing as each other, and neither do you care for either Ecks or Sever's as characters. The plot twist that occur are predictable and riddled with holes, and of course, there is no pretensions that Gregg and Park are really the bad guys from the onset. We know Ecks will eventually team up with Sever to fight them. The actions sequences are god-awful with the exception of one shot in the entire movie. Things just end up happening in this movie with no apparent reason. After all the big explosive gun battles, and lame motorcycle chase sequences, it's no surprise that the when the rivals square off that they throw away their weapons for some badly choreographed uneventful hand-to-hand combat! It doesn't matter if it's Ecks versus Sever, or Sever versus Ray Park- those guns get ditched regardless.\n\nWhen the plot and action are incoherent, it's bad enough that the dialogue and obvious exposition are as well. Antonio Banderas gives one of his worst performances of his career, as he seems to slur his lines consistently. Ray Park acts badly too, and is neither scary nor menacing like he was with make-up as Darth Maul and as Toad in the Star Wars and X-Men franchises But it is Lucy Lui who takes the cake of worst performance in this entire movie, and she proves to be one of the most boring kick-ass women in recent cinema. She should have had a Razzie for worst actress, cause her performance stunk and displays that she has a long way to go without a solid supporting cast.\n\nIn conclusion, this beats 'Crossroads' as the worst I've seen from 2002. And, although, many of you will wonder, \"what did you expect?\" from one of the most panned films of 2002 or from a film directed by a guy named Kaos. Let's just say, that some things are forced upon us, and like my equally frustrated mate said during an extremely long explosive action-sequence, \"God, I wish I was a part of that explosion, instead of watching this movie!\". That pretty much sums up the overall badness of 'Ballistic: Ecks vs. Sever'! A big fat zero from me!\n\nNo score. 0 out *****!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "TDavis12",
        "review_rating": "4",
        "review_title": "Not that bad",
        "review_detailed_main": "This wasn't a good film but it wasn't bad enough to rank in the bottom 100 either. The plot is weak and the characters aren't particularly interesting. However, there are some decent action and fight scenes. I think a lot of reviewers were way too tough on this film."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Jester69",
        "review_rating": "5",
        "review_title": "Plot...No,Action...Yes",
        "review_detailed_main": "This movie had no plot whatsoever but the action was quite good. I wouldn't run to the theater to see it but it's not bad. The story is pathetic but Kaos(ha-ha) has a good eye for action scenes. The worst thing about this movie is the acting. Lucy and Antonio have proved in the past that they have some acting ability but not here. A great rental!!!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "LatinoNoir",
        "review_rating": "1",
        "review_title": "Another girl kicks every guy's butt, movie",
        "review_detailed_main": "I'm definitely not sexist, but come on, haven't we seen enough of sexy or (in Lucy Liu's case)Wannabe Sexy girl kicks every guy's butt in a mindless action flick? I mean there's just too much of that, even Quentin Tarantino is stooping to that in his next film \"Kill Bill.\" I know women kick butt and it's good to see female heroes in films, but it just seems like these film makers are focusing more on the fact that a girl could kick a guy's butt other than developing a genuinely interesting story. And that is what's missing in this movie. I saw this piece of garbage for free, but this was the worst movie I've seen all year. Here's my best description: explosions, girl kicks guy's butt, explosions, Liu kicks random guy's butt, more explosions, Liu kicks random guy's butt, end of story. Recommendation to avoid. This movie doesn't deserve a detailed review from me. * out of ****"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Captain_Couth",
        "review_rating": "1",
        "review_title": "Where's the blood?",
        "review_detailed_main": "When I saw the television spot for this film I noticed that it received an R-rating for violence. So when it was released I went out like a lemming and watched it. I was very disappointed. For all the carnage on the screen I noticed something very strange, no blood not even a scratch or a nose bleed. Hey, if you're going to give a movie an R-rating for violence throw me a bone and show some friggin' blood. how can that many rounds be fired throughout the money and nobody has blood spurting out of them? What a waste of time. Complete and utter rubbish. Make way for the dustbin boys.\n\nNot recommended.\n\nP.S.\n\nThe only thing that saved this movie from receiving an F was Lucy Liu. She looks good in that black outfit, other than that this movie blows chunks big time."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "DaveWoodX",
        "review_rating": "2",
        "review_title": "Seems like 20-40 minutes of the movie are missing...",
        "review_detailed_main": "The story line of this movie is really fragmented. Scenes don't flow together, it's as if the connection material was left on the cutting room floor.\n\nThe character development has also been largely skipped, or replaced with one or two images that are supposed to sum up the entire life history of the character. Poor.\n\nI don't recommend wasting your time or money to see this film. The stunts, explosions and fights don't do enough to save the movie."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Lursa",
        "review_rating": "7",
        "review_title": "Little Action...Not much else either",
        "review_detailed_main": "I saw this movie this weekend and have only two things to say.\n\n1. Lucy Liu can kick butt and she needs her very own movie. Her action scenes with Antonio Banderas and Ray Park were very good. She was great in her other action sequences as well. Hmmm, maybe someone should add her to the next Matrix flick. She's got that cartwheel thing down.\n\n2. Please, please, please do NOT let Antonio Banderas do another action movie. I love Antonio. I really do. But I don't want to see a cross between Jackie Chan and Harrison Ford.\n\nThe movie's okay...but it won't ring your bells. If you want an adrenaline rush...go see Triple X."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "Directed by \"Kaos\", indeed",
        "review_detailed_main": "Ah, I know, it doesn't entirely spell chaos, but a viewing of this might lead you to serious consideration that it should. Where to begin? Well, there is one interesting and noteworthy thing to this: One particular stunt, which I'm not sure has been seen elsewhere. Apart from that... oh dear. You know those movies where you're just thinking \"how on Earth did this get made\"? Not so with this one. I know why it was done, because it's actually got a concept or two that could be amazing, if someone with talent had been handling it. No, we're looking at wasted potential, and so much of it you have to be astounded that they managed to fit it all into one 90-minute package of crap. In case you have heard a description of the music herein: Yes, it's awesome, and completely fitting for a flick of this type, however, every single piece is ruined and misused(is it too much to ask for that they at least *try* to make what happens on-screen follow the tunes?). In fact, all of the editing is pretty bad(have you ever wondered how one would go about messing up *flashbacks*, on the very basic level? Look no further). The plot has silly twists and doesn't all make sense... honestly, this whole thing is powerfully unengaging. Thus, not even the action gets the audience going, in spite of it not sucking all of the time. It is over the top once or twice, and someone needs to teach whoever put all those explosions in this thing the meaning of the saying \"less is more\". The martial arts are fairly cool, save for a couple of clumsy moves, and a general tendency to film it in what may be the lousiest way imaginable. Acting is nothing special, then again, they had nothing to work with. The DVD holds interviews(all four are brief and not that worthwhile) with Banderas, Liu, Soto and Park(best thing about this, in my opinion), trailers(...no, they're not the exact same, I swear) and something called \"B roll\", consisting of a behind-the-scenes style look at footage being shot, and it's... cut? No, that's not it... \"thrown\", that's it... together casually. I recommend this... hm... I don't know... to people I don't like, maybe. 1/10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "good_taste",
        "review_rating": "",
        "review_title": "Box Office Strichnine!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "zillakong",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen.",
        "review_detailed_main": "The day after watching this I tried to tell a friend about this movie. All I could remember is some shooting and a lot of explosions. No plot. No basis in reality. All in all I wished i had spent that hour and a half at the dentist's office."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "illk9",
        "review_rating": "1",
        "review_title": "I was ballistic - audience vs. severe confusion and disgust.",
        "review_detailed_main": "I feel I left the theater dumber after viewing this \"film\". I think it actually sucks the IQ out of us while we force ourselves to watch this poor excuse of a movie. The plot was extremely thin and thoroughly unbelievable. There may have been another movie in the middle of this one for additional confusion.\n\nI can't believe Lucy Liu is in this piece of trash. After appearing in such a movie she should be lucky she has a trailer marked with a star and not forced to switch her career to selling trailers to the stars. Did she not read the script? Well, I wonder if there was a script. The movie bounced around so much I could have made this with friends as we went along.\n\nAntonio Banderas has made better films I'm sure. Interview with the Vampire was good and so was Philadelphia. Maybe he should stick to the supporting actor role and leave the lead to real actors who would read this script and fire their agent.\n\nDo not waste your money seeing this in theaters or renting this for home viewing. I could recommend it for the winter if you live in a cold climate and have a wood burning stove or fireplace."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Khaela",
        "review_rating": "4",
        "review_title": "To watch at the end of the night, with pals and no one sober...",
        "review_detailed_main": "You know sometimes you have this weird idea that tell you : it is a long time i did not watch this movie. So you watch the movie again. Sometimes you see new things, laugh at a joke you did not remember... For this movie, the only question is : why I did not trash the movie? On the paper, it seems not bad : Lucy Liu, Alisa Soto, Antonia Banderas, Gregg Henry... but forget theory, the fact is that this movie is one of the worse one I ever watched (including the facts that the characters are not so bad played). Without the quartet, I can not even imagine the abyssal disaster this movie would have been.\n\nLet's face it : the initial idea is not bad.\n\nThe filming is a nightmare (slow motion a 4 years old child would not have tried). The editing (way the story is tell, sorry bad English) is a complete mess. Explosions are silly, the shooting would make laugh anyone.\n\nA complete disaster... I put 4 (one for each of the actors, as a compensation to have this movie on their resume :) ).\n\nPersonnal joke : the animosity between Lucy Liu and Gregg Henry started in Payback (1999) :) As I said, almost good to watch with pals at 04:30 AM (after a very very long day) and with anyone in the bag."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "yakkamut",
        "review_rating": "1",
        "review_title": "A non-stop roller coaster ride! (Read:dizzyness, headaches, vomiting)",
        "review_detailed_main": "This was one of the worst action movies I have ever seen. I'm glad I rented it on dvd instead of shelling out $15 to go see it in the theaters. Watching it on dvd did have its advantages, though. Since Antonio Banderas was basically incoherant throughout the entire movie (did he have dental work done prior to filming? Because thats how I talk after all the freezing and anesthetic), I was able to put the subtitles on so I could at least follow the story. I wish I hadn't.\n\nThis movie seemed more like a scenic tour of Vancouver rather than a movie. It starts off in Yaletown, and downtown Vancouver, then moves to Stanley Park, where we get a nice visit to the Aquarium. We also get glimpses of the North Shore from Deep Cove, and the Train Yards as well. I was more interested in spotting landmarks and places that I recognized, than following the sotry!\n\nDon't waste your time. Shaquille O'Neil had better acting in Kazaam. I'm off to rent that again."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Agent10",
        "review_rating": "1",
        "review_title": "Has there ever been a worse action film that wasn't straight to video?",
        "review_detailed_main": "Wow! After years of waiting and expecting the inevitable, Ballistic proved to be one of the most boring action films ever made. It's not that the action too far and in between, its just the action felt pointless and unimpressive. Never have a I seen a movie where the lead actors barely blurt out 100 words in a movie. This film was so bad, Jerry Bruckheimer probably wouldn't have produced this schlock (considering his recent resume). I could tell this movie was going to bad after seeing the trailer. You don't name a movie like this without it being thought of as some straight-to-video type movie. Let's just hope they never show this garbage on TV anytime soon."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "movieman_kev",
        "review_rating": "1",
        "review_title": "Bleh Vs. Suck",
        "review_detailed_main": "Ecks (Antonio Banderas) must join with his mortal enemy Sever (Lucy Liu) to take down a mutual enemy. First of all imagine being a 'bad ass' FBI agent and having a stringy frail woman as your arch-nemesis. That would be akin to being Sherlock Holmes, but Moriarty being a spastic mongoloid. Setting aside the horribly politically correct BS plot, the movie itself is a mess in every single conceivable way. This should be taught in Film making 101 as a textbook example of what NOT to do in a movie. Horribly clichéd characters, inane dialog, and even lame 'action' all make this one to not only miss, but actively run away from if you ever see it coming on cable.\n\nMy Grade:F\n\nDVD Extras: HBO Making Of featurette; A lame Rock, paper, scissors-type game; Cast & crew biographies; and Theatrical trailer"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Rogue-32",
        "review_rating": "3",
        "review_title": "Back to the drawing boards on this one",
        "review_detailed_main": "Ballistic looked like so much fun in the trailers, but it turned out to be completely devoid of anything remotely resembling fun, with a convoluted plot and lame characters - I literally didn't care about anyone in the film, including the little boy (and that's sad). Antonio Banderas, who is capable of great action performances (I'm thinking of Desperado in particular) seemed like he was in a dense fog in all of his scenes, and Lucy Liu did a great imitation of a robot. The villian actually had more life than all the other characters combined - at least he sneered with some definitive pizazz."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "waltson",
        "review_rating": "10",
        "review_title": "Just loved it!",
        "review_detailed_main": "I really don't know what most people expect when they watch a flick like this. A look at the cover promises gunplay, dark scenerie and a girl in a black catsuit dress. What you get is much, much more than that. The action scenes are just fantastic and very inventive directed, Lucy Liu just kicks ass and Banderas also give it's best. Forget the dumb xXx, forget the dull \"Transporter\" and just better never remember the lame \"Reloaded\". If you liked asian flicks like \"Naked Weapon\", \"Her name is cat\" or \"The Returner\", then you will love this one - \"Some women buy shoes\" ;)"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "ColdZro",
        "review_rating": "7",
        "review_title": "Not heavy on plot, but satisfying on action.",
        "review_detailed_main": "As I write this, the rating on this movie is rather low, and I think that's a bit unfair. I have to agree, the movie is pretty thin on plot, and I was able to point out some problems with the movie. But I must say that I still got what I expected from the movie, and that was action. The movie has some pretty cool action scenes, and I knew going in, that that's what I wanted to see. Maybe I'm just better than most people at evaluating a movie before seeing it, but I fully expected to get more stylish action sequences, and less plot. And I think that's just fine! I love a movie with a strong story, but sometimes it's okay to just watch a movie with nothin' but action. This movie is an action movie, and I say it does quite a respectable job of it. I rated it 7."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "tyeve",
        "review_rating": "3",
        "review_title": "A better title would have been \"Explosions\"",
        "review_detailed_main": "Is this the ultimate explosions movie or what? Kaos may not be much of a director but, shucks, he sure knows how to blow things up. Although the film is indeed as bad as the other reviewers have stated, I perversely found it enjoyable. Kinda like,: \"Another explosion. Oh, man, this is too much!\"\n\nMy ratings? Script 1/10; Directing 1/10; Title 0/10; Acting 3/10; Identifying Vancouver as Vancouver 6/10; Explosions unrateable! Balanced and blended rating at 1.77, I rounded it up to 2, then threw in another star for unintentional humour. Total = 3. Is it worth seeing? Probably not, but if you know Vancouver well enough to recognize the locations, and you can rent the DVD for a couple of bucks, and you have sufficient quantities of alcohol on hand. . ."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "perni",
        "review_rating": "",
        "review_title": "Kill me. Kill me now. Am I dead yet? Sheesh, this sucker is LONG!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "gevike",
        "review_rating": "2",
        "review_title": "No matter how much money they spent on this film, it just sucks...",
        "review_detailed_main": "Well, could have been a nice try, but it isn't after all. The plus in this movie is the nice photography (especially the aquarium scene) and the good music (well, good for an action movie). The minus is that it contains all the mistakes an action movie can contain: the fight scenes are ridiculously slow and not very well choreographed, the story is stupid, even the title is a lie, 'cos they are not against each other. The heroine fighting a whole SWAT squad is unrealistic, Banderas cannot jump or move well in the fights, so there are lots of mistakes. And its full of commonplaces too. No matter how much money they spent on this film, it just sucks, because you can see, that Banderas isn't present in any of the dangerous scenes, so everything seems to be too sterile and mechanical due to all the cuts and editing."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "bajan13k",
        "review_rating": "2",
        "review_title": "Good Rail Shooter, Bad Story, Sub-Standard Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "mennan",
        "review_rating": "2",
        "review_title": "Don't waste your time, if you already wasted your money.",
        "review_detailed_main": "Ecks lost his wife sometime ago. But his wife hasn't dead, she is married with the bad guy. Bad guy placed some \"heart attack maker device\" into his son, but wait, he is not his son, he is Ecks son.\n\nSome kind of brazilian soap opera themed movie with disgusting music. If you like to watch explosions, you can watch this movie, because there is lots of them.\n\nOne of worst movies I've ever seen. Don't waste your time, if you already wasted your money."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "sedgar",
        "review_rating": "1",
        "review_title": "To put it bluntly: Awful",
        "review_detailed_main": "Talisa Soto and Lucy Liu cannot make this movie watchable, And that is pretty bad. If I had been Antonio Banderas, I'd have faked my own death to get out of it.\n\nI didn't spend any money to watch this, but I feel like I have been taken advantage of. I'll have to find a smarmy lawyer to see if I have standing for a lawsuit. \"Intentional infliction of loss of IQ points\".\n\nJust to put my views in perspective so that you don't think I'm an art-house snob, I think highly enough of Conan the Barbarian, Flash Gordon, and Excalibur to own copies. If I had a copy of this movie, I'd smash it, burn it, douse it with holy water, burn it again, and then bury on some Superfund sight that never had any hope of being arable, because it certainly wouldn't after I was done."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Flak_Magnet",
        "review_rating": "1",
        "review_title": "Formulaic, ridiculously clichéd action stinker",
        "review_detailed_main": "This movie is in the IMDb bottom 10 and it has a 0% rating on Rotten Tomatoes. Of course, I bought a copy (for $2.00) when the opportunity came up, hoping, in a perverse way, of getting some satisfaction and laughs out of it. I didn't. This is a continuously clichéd, CGI currency burner that will challenge your kindness and your perseverance. Its the kind of movie where the main character walks away, in slow-motion, while a car explodes in the background. Its the kind of movie where Lucy Lui uses a mounted machine gun to mow down multiple nameless S.W.A.T. teams and decimate a downtown CGI landscape in slow-motion. Expect a lot of 360 degree pans, \"the Matrix\" style bullet time shite, horrible fight choreography, and as many story clichés as you can think of. In other words, you've seen this movie many, many times before. Trust me. It wasn't even halfway funny. I think we got 2 smallish laughs out of it, and as such, recommend that you skip. Sometimes, the \"so bad its good\" theory fails, and this is a perfect example of that. ---|--- Reviews by Flak Magnet"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "dvdontap",
        "review_rating": "2",
        "review_title": "Ecks Vs Sever....WHEN???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "rich-201",
        "review_rating": "2",
        "review_title": "This was not a very smart movie.",
        "review_detailed_main": "Not long into the movie we are treated to about ten minutes of merciless killing by a sweet looking young lady, Sever, who was apparently peeved that someone would interrupt her shopping spree. But, why did she wander out of her secure hideout, where her hostage was being held, to go shopping for trinkets? And, how did the bad goodguys happen to know that she would satisfy her trinket lust at a certain shopping venue where they could have undercover agents in place to watch her every move and a gazillion snipers with high power rifles and the standing order not to shoot. Huh! The murdering starts when an undercover guy tries to collar the sweet lady. She apparently doesn't want to go quietly so we see multitudes of arms, legs, and heads busted as more nameless morons rush her. Then the City SWAT team moves in and all hell breaks loose. She kills about 50-70 city police and Federal agents with various fully auto weapons including a tank. Then the hero of the story, Ecks, who just happens to be near by for no apparent reason, rushes in and chases her off by ineptly firing a shotgun in her direction. She decides not to kill him and he decides not to kill her. For a moment I thought they might just get down and mate in the street. Anyway, there isn't a very strong plot. There's just barely enough story to take you from one killing field to the next, with a few car chases thrown in. Frankly, if it wasn't for Heavens Gate, this would be the worst movie I had ever seen."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "jabberwocky-6",
        "review_rating": "10",
        "review_title": "Great Movie!Great Action! Great Music! Great Actors!",
        "review_detailed_main": "I've seen this movie twice the first time about 4 months ago this year(2005)and again last month(June). I think this movie is GREAT! It has action all the time and Lucy Liu and Antonio Bandaras are made for the characters they play.These are excellent roles.There is constant action,it keeps you awake and guessing what will happen next. Lucy Liu dominates the movie and she justly deserve the main character role she is playing. I don't think any other actor/tress could play this role as well as Lucy Liu.Excellent roles with all the actors.Plus the music is great too! It definitely is a good action movie. The plot was all good. The title made sense. It's about revenge,power and payback.I Have not seen a movie like this in a long time, that doesn't have a lot of talking and stupid twists to try and explain what the movie is about. This was a clear clean cut(not gory,bloody)action movie.I would recommend this movie over and over again!!!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "viamillitaris-37591",
        "review_rating": "6",
        "review_title": "The battle beyond our world",
        "review_detailed_main": "I think that this movie has really great action scenes and special effects. Here we have to include Liu, who looks really outstanding and hot. I can't say that this creation offers something that we haven't seen before, but I think that effect isn't so bad. The gallery of extraordinary fighting scenes, secret tasks of the outcast national security agencies and stunning appearance of Liu and Sotto makes this fiction world of secret agents worth seeing. Everything in this movie looks like some superhero battle between the ex FBI agent Banderas and brutal DEA rogue Liu, but the truth is that i feel relaxed and really amused by watching this kind of movies. There is no something that we can call the real acting, but on the bottom of line, I can say that I really got fun watching this movie"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "philbarger-48616",
        "review_rating": "1",
        "review_title": "Great action movie",
        "review_detailed_main": "The fight and action scenes are great. Awesome Cenimatography. Great acting and pacing. The soundtrack was fun to listen to. The characters are likable. The direction, writing, script, plot, story is awesome and great to see. The costumes are great. Despite the reviews. The action scenes were perfectly done. The actors are good at fighting and action. The opening song is a great song of the movie. Unlike battlefield earth (another franchise pictures film) this was so much better than that trash battlefield earth movie so the movie is a very great action movie of the year 2003 and it was a 10/10."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "wandeljw",
        "review_rating": "",
        "review_title": "a live-action, large-scale, hi-tech Road Runner cartoon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Cyber256702000",
        "review_rating": "3",
        "review_title": "Great Action Scenes, but Where is the Story?",
        "review_detailed_main": "Former FBI agent Ecks gets pulled back into the FBI when he finds out that his wife is still alive and that to find out where she is he must stop a man from using a small robotic assassination device. The only person who knows where they are is the woman assassin Sever who stole the man's son. The only way to stop him is for both agents to team up and take on an army of bad guys. Ecks Vs. Sever has tons of good things going for it. It has amazing action scenes, great camerawork, decent enough acting, with a pretty famous cast, and a killer soundtrack. The only thing it is missing is a real story. The story is so thin and the characters are so dull and boring that you couldn't care about them at all. The movie is just action scene followed by action scene with a very brief few minutes in the beginning to let you know that there is a story in there after all. Ecks Vs. Sever settles for mediocre when it could have been so much more. * out of ****"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Winslow757",
        "review_rating": "1",
        "review_title": "wow this movie was awful",
        "review_detailed_main": "So, if Kaos, the director of this incredible waste of both time and money, ever wants to take a course about character development, continuity editing, or sound design, it might really help him with a few things. An hour and a half of this movie, and you leave not knowing ANYTHING about what you just watched. And while that might be acceptable in a movie with amazing action sequences, this movie doesn't even have that. I mean, chase scenes were going on at about 25 mph, and, while yes, lots of things explode everywhere you look, they don't really seem too satisfying. And also, I don't know about anybody else, but I found myself saying \"What did he say?\" everytime Antonio Banderas had a line. I mean really, e-nun-ci-ate. At least a little."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Dumb Title. Dumber Movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "asefn",
        "review_rating": "2",
        "review_title": "A sad pathetic disaster.",
        "review_detailed_main": "I had some great expectations from this movie but it let me down! There was nothing. No story, no decent action, no effects and absolutely no need for acting! Any loser could have done these roles.\n\nThere could have been a better plot and even if there wasn't, it could have been executed better. If the producers were going to show Lucy Liu as Super Woman, well atleast make it realistic! I don't know why her or Antonio Banderas took this movie, but what could have been made a masterpiece with some special effects and high quality action ended up as a toal disaster. Don't watch this! See the Four Feathers, that is awesome! Totally!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "wrestlingboy",
        "review_rating": "1",
        "review_title": "worst movie ever...seriously",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "greywolf916",
        "review_rating": "4",
        "review_title": "I could add to the mountain of scorn...",
        "review_detailed_main": "...that has been heaped on this movie, but what would be the point after reading the other reviews. So I wanted to add something a little different. As my girlfriend and I was watching it, and saw Gregg Henry as the villain, we started whispering to each other about all the smarmy roles we had seen him play, such as the ex-husband on Family Law. Then it hit us that he was in Payback with Mel Gibson, which also starred Lucy Liu. So if you want to go see a good movie with those too then rent Payback.\n\nAlso before the movie started, they showed a trailer for Femme Fatale, which has Antonio Banderas and Gregg Henry in it. I wonder if my desire to see that movie after seeing this one can wane anymore."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "atulk",
        "review_rating": "3",
        "review_title": "really crappy movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "cybernetics813",
        "review_rating": "10",
        "review_title": "Amazing film that I ever seen since action films from 70's",
        "review_detailed_main": "Well-made action film since 70's action film that made action films successful in 70's, this one is one of the greatest action films. Because of due to too many complaints with too many MTV camera moves from recent action films like Romeo Must Die, Exit Wounds, 3000 Miles to Graceland, Fast and the Furious, XXX, and many more recent action films. But Fast and the Furious was a good movie but one annoying thing about this film was camera moves. So By the way, about Ballistic, I thought this film was well formed action film that I ever seen for a while since early 90's films. Thanks to Kaos for making his own philsophy and I agree with his philsophy for making this film. Well done explosions, action scenes, camera techinques, and the music was great. I prefer this film better than Lord of the Rings. Ballistic: Ecks vs Sever goes for an A+ grade and 100% out of 100 due to many many many negative reviews from people who kissed Lord of the Rings and Titanic asses. I was planning to give this movie a B grade with 85% out of 100 but due to that reason I gave it an A+ and 100. If you missed the greatness about action films from 70's then go see this film."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "andrew-hill515",
        "review_rating": "7",
        "review_title": "Dumb but...",
        "review_detailed_main": "I actually sort of like this film. It's garbage, don't get me wrong, but it's a relatively enjoyable piece of garbage."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "caffeine3",
        "review_rating": "1",
        "review_title": "Kaos + Director = Box office poison!",
        "review_detailed_main": "I think that \"Kaos Theory\" has just found new definition in this movie. Wherein the director, i.e. Mr. Kaos, places his forehead on a baseball bat, spins around a bunch of times and then runs around trying to film stuff. Add a few explosions and a couple of quaffed Red Bulls and you get some of the crappiest action tripe ever seen. This film has but two things going for it. 1) Lucy Lui is friggin' hot 2) The shot of the SWAT guy falling off the building and crashing into the car down below. Now, if you think that warrants the $10 you'll pay to see it, then by all means go attend. Getting back to the drivel at hand, I can't remember the last time I saw a movie that reminded me so much of the 80's. I wouldn't be a bit surprised to learn that whatever Hollywood hack penned this script, had taken an old Death Wish storyline and just changed the names. I think Cobra with Sylvester Stallone would be easily interchangeable with this one as well. At any rate, if there is one thing this movie has to teach us, its that you can't win friends with salad. You need meat, potatoes, a few glasses of wine and a dessert consisting of either vanilla ice cream with strawberry glaze and bun cake, or at the very least a custard pie. Ecks Vs. Sever had absolutely none of these. It was straight up salad greens without any kind of dressing. And believe me, if you're a fat kid looking for a hearty meal, you'll be SEVER-ly dissapointed!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "joshuastephen4",
        "review_rating": "",
        "review_title": "Cool visuals and a muddled plot.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "The title lies.",
        "review_detailed_main": "This is a confusing movie. The title sets it up about two special agents that hold a grudge against each other and everything leads to a final showdown between them. Maybe they were partners in a previous life. Maybe they had a falling out. Maybe they're from rival underworld gangs and have had a beef going back decades. But that would give this too much credit because there is literally none of that here. Calling it simply \"Ballistic\", due to the obscene amount of firearms and stuff getting blowed up real good , would have made sense because that's what happens. But except for a small showdown, there's no animosity between these two. In fact, they team up to fight the real enemy later.\n\nFrom the very start the plot makes no sense. People do things that they have no reason to do other than make somebody look like a badass. Relationships are suddenly revealed that make you wonder why they introduced them in the first place. And, of course, the title is a complete lie.\n\nAntonio Banderas plays Ecks. He's a former FBI agent who's a complete badass. Lucy Liu plays Sever. She's some sort of agent for a some kind of organization and she's also a complete badass. Ecks' wife who is supposed to be dead is really alive and if he takes out Sever his former boss will tell him where she is. Sever blows stuff up and there's a kidnapping plot in there somewhere. They fight. They team up and go after the real baddie. Things are revealed and you're left there wondering what the hell just happened.\n\nI'm serious when I say I don't know what this story is really about. It's like they had several different drafts of this movie, filmed a bunch of scenes for each one and then just stuck them together in the laziest way. It's a complete mess.\n\nThere are some decent action scenes, lots of explosions, Lucy Liu looking hot. But that's not enough to base an entire movie on. It also needs to at least be entertaining in a stupid kind of way and this movie fails that."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "atdm",
        "review_rating": "1",
        "review_title": "Disappointing...",
        "review_detailed_main": "I saw this movie on opening night, (having seen only one trailer\n\nand no reviews) and wasn't really expecting much in the way of\n\nplot, just some escapist fun. My expectations, plot-wise, were right\n\non the money. Unfortunately, the \"fun\" never materialized either.\n\nBallistic: EvS watches like a slightly slicker Die Hard, only Alan\n\nRickman is infinitely more believeable than Gregg Henry as a\n\nsophisticated international badass, and there's not even a window\n\nto drop him out of. Kaos also \"borrows\" -ahem- heavily in the way\n\nof plot devices and action sequences, most notably from The\n\nMatrix, Terminator 2, and the aforementioned Die Hard. If you\n\nabsolutely must see this movie, wait until it comes out on video. At\n\nleast then you can heckle Gregg without the other theatre patrons\n\n\"shush\"-ing you."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Seth-12",
        "review_rating": "1",
        "review_title": "Lame",
        "review_detailed_main": "This is a film with a plot that could be written inside a matchbook starring actors who look bored out of their skulls playing one-dimensional characters with (almost literally) nothing to say to each other. When the actors aren't acting bored, there's lots and lots of pointless, slow-motion kung-fu, explosions and gunfire. What a waste of money."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "dukevega",
        "review_rating": "3",
        "review_title": "Long on Explosions, Short on Answers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "FeastMode",
        "review_rating": "2",
        "review_title": "my notes",
        "review_detailed_main": "This movie is the perfect example of how far we've come with action scenes and specifically fight scenes. if you compare the fight scenes in this movie with something like daredevil tv series, it's absurd how big of a difference there is. rather than being fast, hard-hitting and intense, the fight scenes are slow and lack any kind of punch (pun). there is some creativity, but not much. as for the action scenes, basically useless, bunch of slomo explosions for the sake of explosions. lots of stupid parts. very outdated, like with the exaggerated fight sound effects from old movies. the musical score was very different and was pretty cool. the story was abhorant... i dunno if i'm using that word right but that's what came to mind. (2 viewings)"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "fjgmzsy",
        "review_rating": "10",
        "review_title": "good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "AwesomeWolf",
        "review_rating": "6",
        "review_title": "'Ecks vs Sever' - with more than the daily recommended dose of explosions",
        "review_detailed_main": "So, I watched 'Ballistic: Ecks vs sever' thinking that it would be the worst movie ever, right? That's the idea I had gotten from IMDb, etc. Boy was I disappointed to discover that it was just a mindless action movie.\n\nWhat? *Just* mindless action? Awesome! Who doesn't like dumb action movies? Jeremiah Ecks (Antonio Banderas) and Agent Sever (Lucy Liu) are rogue U.S. agents on the run from their superiors, and at odds with each other. Throw in a number of explosions and what you have is 'Ballistic: Ecks vs Sever'.\n\nI'm astounded by the fact that 'Ballistic' - a fun, mindless action movie - is only sitting on a 3.5 on IMDb, while something truly terrible like 'Charlie's Angels: Full Throttle' can sit on a decent five. This is a sad day for action movies.\n\nSure, 'Ballistic' can't compete with some of the great action movies, but it certainly is better than all the other Hollywood movies that are poisoning the action genre (think 'Charlie's Angels', 'xXx', 'Torque'... the list could go on for a while...). Explosions, decent looking car chases, more explosions, a smattering of decent martial arts and gun fights, a few more explosions, and Antonio Banderas being awesome - what more does an action movie need?\n\n'Ballistic: Ecks vs Sever' is a fun action movie. True action fans aren't interested in a good script, good acting, etc, we just want lots of explosions, and that's what 'Ballistic' is all about - 6/10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "AntoineBF",
        "review_rating": "1",
        "review_title": "Boring piece of crap",
        "review_detailed_main": "This is one of the worst movies I've seen in years. There is no captivating action, the car chases are awful, the story is either dull or completely absurd. What a sad way to introduce yourself as a director!\n\nSeriously, the story is boring, the action doesn't deserve to be called action, the actors are very ordinary (well, they couldn't do much anyway), the stunts, hahaha, let's not go there..., the music is more than ordinary (a very pale copy of MI2), the story is filled of BS and takes the viewer for a complete idiot with no mind...\n\nDo you see my point? I whish I had my hour and a half back..."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "portarian",
        "review_rating": "",
        "review_title": "A Little too much slow-mo!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "khyrlik",
        "review_rating": "1",
        "review_title": "Buuuuuuuuuuuuuu, :(((((((((((",
        "review_detailed_main": "If you wonder if there can be action movie worse (and more stupid) than worst Van Damme, Seagal and Dudikoff movies, even worse than Charlie's Angels 2 (yes! I've seen the trailer) - watch this! One-man (woman) army defeating LAPD squad in hand to hand combat (high heels boots of course :-\\). There is completely nothing to positive to look for in this movie, no good action, special effect, acting (hehe, it's joke here). 1/10 (my first movie with this rating)."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "DeejayDuck",
        "review_rating": "3",
        "review_title": "Two hot chicks, banderas - 3 Stars........the rest suxxxx!",
        "review_detailed_main": "I can't believe how somebody is leaking ideas! This is probably the suckiest movie, made with one of my favourite players, Lucy and Antonio! The story is ....hm wait a minute ....there is no story just explosions and lot's a weapons!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "qball_82",
        "review_rating": "2",
        "review_title": "Repetitive.",
        "review_detailed_main": "OK..I've seen worse, but this film very much deserves its spot on the \"Worst Movies Ever\" list. I'm a real fan of Lucy Liu and It's a shame she let herself get associated with such a crappy movie.\n\nSome kick-ass fight scenes (thanks to Lucy Liu - only good aspect of this film!), but after the first couple they begin to get boring and repetitive, real fast. Any semblance to 'story', 'plot' or character development takes a back seat and gets left in the gutter.\n\nIt had potential, and with some kind of story and some stylish editing, this could have been something more. Avoid."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "filmpixel",
        "review_rating": "1",
        "review_title": "should've been a spoof/comedy",
        "review_detailed_main": "I left the theater with splinters in my side after watching this movie. One was from laughing so loud that I'm afraid I ruined the peace and quiet of the theater (shame on me)-- this really should've been a comedy. At first, I was amazed this movie got made, then amused by the fact that most people in the theater took it seriously! If only it was a spoof!\n\nThe other splinter is this - the stunt coordinator should've directed this movie (or maybe he did.)"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "jjbagley",
        "review_rating": "1",
        "review_title": "Painfully bad",
        "review_detailed_main": "This movie would have been better if it had a script. The acting was unbelievable poor. Save yourself. Lucy Lui is so stoic that she is not acting but basically just on screen. There are so many flaws in continuity you can barely follow what is happening. Terrible."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "tomas_m",
        "review_rating": "1",
        "review_title": "absolute crap",
        "review_detailed_main": "i was watching it with my friends. in the beginning we started making jokes of it. in the middle i almost fell asleep. and in the end we were just wondering, what a s****y movie this is. it seems to me that director is a big fan of RAMBO. heh... one man army...\n\nso if you consider going to theater or buying a DVD - my advise is DO NOT!!!...unless you are 10 ..."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "djunchan",
        "review_rating": "1",
        "review_title": "The movie is as bad as its name, and makes about as much sense",
        "review_detailed_main": "Just truly awful. Tragically bad, a total waste of money. Feel sorriest for the Director who was given no script, actors who didn't care, and dialouge that was inane.\n\nA truly embarassing effort all around."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "benjaminweber",
        "review_rating": "10",
        "review_title": "A joyous dream-like affair with life",
        "review_detailed_main": "As I watched this sublime work, I became aware that this is unlike the others. Whereas many films will insist they are different, this film embraces what could make it the same to become different. This embrace of what an action film is makes Ballistic highly entertaining and watchable. When added to the pot with unique cinematography and a perfectly subdued yet omnipresent soundtrack, you have a ballet of bullets that seems to slide past as if a dream, and can truly help you to grasp the intricate threads of self-similarity running through the universe, such as those between a cauliflower and an explosion. An exceptional film, 10/10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "funnyslaughter",
        "review_rating": "7",
        "review_title": "a lot better than the rating",
        "review_detailed_main": "this is a good action film. the story may be a bit weak sometimes, but not as bad as in many blow-up-films i saw before. some fighting scenes are unrealistic as hell, especially the HEAT-like shoot-out done by a a single female, but hey, its action and its a cool movie! i really enjoyed watching this film, was a lot better then many many action films before."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "montoya_luisa",
        "review_rating": "2",
        "review_title": "waist of time",
        "review_detailed_main": "Antonio, Antonio WHY???\n\nThis movie was a waist of time, first time in my life that I actually walked out of the cinema and demanded my money back. The acting was horrible the PLOT wait was there a PLOT??. I just have lost all my hopes that Antonio will ever make good movies again this was my last try.\n\nAntonio Banderas used to be one of my favorite actors when he made Spanish movies with Almovodar, but then he goes to Hollywood and makes horrible, stupid movies. Early in his career he cared about making films were good, had depth characters, but now it seems that all that this ex-great actor cares is about money. What a SHAME\n\nScore 2/10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "",
        "review_title": "What a mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Cent-3",
        "review_rating": "1",
        "review_title": "Ballistic fails in plot, succeeds in death, fire, and boredom",
        "review_detailed_main": "\"Ballistic: Ecks vs. Sever\" is a waste of time, but it could have been worse.\n\nAntonio Banderas is an agent with a chronic problem of forgetting to shave, told that if he works on a mission to find some deadly technology, he might be given information as to the whereabouts of his wife, who he thought had died.\n\nLucy Liu is an independent killing machine with unclear intentions, but her job mostly consists of standing still, waiting for the last possible second to fire her grenade launcher, and to spill the ammunition of every gun in the ten mile radius.\n\nHad the makers of this movie cared about plot, their premise might have made for a truly intriguing film instead of an explosion bonanza flick.\n\nTo make things worse, not all of the special effects were up to par with modern cinema - scenes in the beginning are grainy, the martial art stunts in the end look like they were still practicing them, the car chase induces drowsiness, and some of the sound effects used would fail to active a Clapper.\n\nThere are some worthwhile moments: a drop of comic relief, a \"let's do this for shock value\" slow-motion view of a sniper falling from a building into a car, and of course, a body-count that would put Pol Pot to shame.\n\nStill, it's not the bottom of the barrel. Go out and rent 'The Mask of Zorro' for action, comedy, and Antonio Banderas. Go out and rent \"Charlie's Angels\" for action, comedy, and Lucy Liu.\n\nGo out and sleep on a park bench, for a more pleasant and rewarding experience than seeing \"Ballistic: Ecks vs. Sever.\""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "vicdragon19-1",
        "review_rating": "1",
        "review_title": "one of the worst films I have ever seen...",
        "review_detailed_main": "I admit, the cover of this movie looked really good, guys with cool suits and guns. But when I saw this film, it was not a film, but an extended version of a never ending car chase and two guys running away from each other. There is barely any dialogue and Lucy Liu only has a few lines, while there is no chemistry between the two leads.\n\nThe plot is very weak, and relies more on explosive special effects, and would only appeal to someone with half a brain who just played a really cool computer game.It was lucky the film was short because it ended quickly, so you don't have to suffer too much.\n\nAvoid at all costs."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "5",
        "review_title": "The title should give anyone some idea..",
        "review_detailed_main": "Big. Loud. Dumb. Hollow. Notorious train wreck and box office failure. Ballistic: Ecks Vs. Sever is all of these things, and yet somehow I still got a kick out of it, albeit in the shallow end of the speedometer. I know what you're thinking.. \"wow, another turd that Nate is polishing up with multiple syllable words to make it seem like less of a piece of crap.\" Well, you're not wrong. I fully concede that this is one huge glorious, post Mexican food pile of poop, but there's something about it that pulls me in every time it shows up on SyFy or some such channel. Maybe it's the fact that it's one of those rare films that not only is shot in my hometown of Vancouver, but actually set here too. Mostly Vancity just doubles for Chicago, New York or any other Yankee metropolis, but director Kaos (yes that's his name) chose to tell the story right here in my little burg. Speaking of story, or lack thereof, it's one big shredded mess of a plot involving Ecks (Antonio Banderas) and Sever (Lucy Liu) two former federal agents out to get each other, eventually working together and then both becoming chumps in some ludicrous government conspiracy involving arch villain Gant (Gregg Henry, hammy as ever). It makes little to no sense, it's so convoluted it prompts the viewer to throw their hands up in exhausted defeat and give up hope on any cohesion, instead letting a wave of schitty early 2000's special effects and over elaborate, unwarranted stunt work to wash over them like a tidal wave of rejected video game cutscenes. And poor Vancouver, looking like a ghost town, just gets blown to smithereens by these trigger happy, matrix wardrobed, scowling lunatics. I'd probably stay off the streets too if Lucy Liu massacring hordes of VPD officers was in the forecast, or on second thought maybe not, that sounds kind of hot. I'm rambling, but any review of this film has the right to get sidetracked and ramble as much as this pile of wanton sound and fury does for the entirety of its scant runtime. It's disastrous to be sure, but does that make me pick up the remote and switch over to something else when it's on? Not really. Plus, despite the actual film, this has to have one of the coolest looking DVD cover posters ever designed. I mean, look at it."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "rak78",
        "review_rating": "1",
        "review_title": "awful",
        "review_detailed_main": "This movie has no relations in it. It is a deepsh!t. The acting isn't good, it has no action, no fun. It is a big blow-up like the explosions from it. It sucks, it is just another bad movie, another waste of time. Don't watch it!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Brambo",
        "review_rating": "1",
        "review_title": "AWFUL!!!",
        "review_detailed_main": "Dumb, confusing plot; improbable, unimpressive stunts; atrocious dialogue; terrible acting. About the only redeeming quality in the impressive scenery of Vancouver, BC, which actually stands in for itself. Otherwise, avoid this movie!!!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "prohibited-name-1495",
        "review_rating": "2",
        "review_title": "Barely a film at all",
        "review_detailed_main": "I saw ballistic yesterday and.. my god.. i didnt know that a film with 2 names that big and that many explosion could be so horribly bad.\n\nIt doesnt even feel like a real film, ive seen commercials more involving.. Stay away!\n\nBest quote: Antonio Banderas: \"Damn flames\".. when hes lyeing down and his leg is on fire... I laught for minute or so."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "linux_666",
        "review_rating": "1",
        "review_title": "gives snipers bad name (spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "markci250",
        "review_rating": "10",
        "review_title": "One Of My Favorite Action Movies",
        "review_detailed_main": "This is truly one of my favorite action movies. Antonio Banderas. Lucy Liu. Ecks Vs. Sever. Lots of chases. Gun battles. More explosions than \"Die Hard\" (I think). And everyone is just so icy cool. I saw this movie four times at my local multiplex, one of the few who were actually seeing it there. I guess a stylish action movie like this isn't everyone's cup of tea, but I loved it. And believe it or not, I think this movie has a real plot. If you get a chance to watch it on DVD, at least rent it once, it's worth a look."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "V-Guven_82",
        "review_rating": "6",
        "review_title": "Good action Film and nice actresses",
        "review_detailed_main": "Nearly everybody thinks that this Film is bad,but according to me, this Film is not worse than any other action Film(for example \"die another day\").I don't understand why everybody likes this James Bond Films so much but writes bad critiques for this film.Neither the actors of die another day are better nor it has a better theme.Lucy Liu is as good as Halle Berry even thought she won't win an oscar for Ballistik.And thats only because of the critics who don't notice that this film isn't as bad as nearly everybody thinks."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "BigGuy",
        "review_rating": "3",
        "review_title": "Every bad cliche",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "tj_director",
        "review_rating": "",
        "review_title": "I've seen far, far worse!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "johnnyboyz",
        "review_rating": "4",
        "review_title": "A film called Ballistic directed by a guy named Kaos - you have been warned.",
        "review_detailed_main": "This film is of the variety that either gives you a headache thanks to its action scenes and thus, makes you really hate it or it's one of those that just passes by after watching it, not remembering anything remotely good about it because there wasn't anything good there in the first place. For me, it's the second option.\n\nAs much as it seems people dislike this film, I didn't in fact hate it as much as I thought I would but it was still a silly, over the top action film that is trying to live off two of Hollywood's most recognisable stars (Banderas and Liu) and the action success that was The Matrix (1999) a few years earlier. Somewhere in there, deep down; there is a well shot, well lit neo-noir of a film desperately trying to get out but what we see with Ballistic: Ecks vs. Sever is a no-brainer action film that is so 'head-shakingly' bad, it's unreal.\n\nThe first hint of what's to come is in the form of the very first action scene. This is an action film after all and was probably sold and marketed by level of its action and it fails to deliver. Agent Sever (Liu) is kitted out like either Neo or Trinity and basically defies all logic in her gun wielding abilities as she becomes a female, Asian version of John Rambo. The sequence is just insane as each gun she uses goes from (in order): small handgun to bigger assault rifle, to sniper rifle and then onto a massive double barrelled minigun of some sort \u0096 pulverising buildings and police men in silly slow motion. The director (Kaos by name chaos by filmic nature) is from Thailand and it's a common known fact that the Asian film industry does rely on its Hong Kong cop thrillers but it seems at times that he was really just trying to pull a fast one here and incorporate one of those into mainstream Hollywood.\n\nAs the film continues, I could feel it dull my brain. Any essence of neo-noir or maybe a plot opening up was counteracted by insane action sequences. Agent Gant's (Henry) character is the key to the plot trying to get out as the whole kidnap, secrets, intrigue and several years of lies aimed at Ecks (Banderas) revolves around him. Gregg Henry's a good actor and he does his very best in the scenes he's involved in but the whole delivery between him and his 'wife' and the way the flashbacks of lies and murder is put across is just forced \u0096 so forced that it just blows over you as there's no real emotion.\n\nAdditionally, when Ecks and Sever decide to partner up (rendering the title of the film false) I had a genuine fear that the wheels would just come off and I'm telling you: all the hubcaps but one popped out as although it didn't quite descend into the chaos I thought it would, it was still full of over the top action. Not only this but it started to do the basics wrong; the actors were suddenly void of emotion, Gant and Sever speak on the phone at about 300 yards from each other before the whole thing erupting into a fire fight, a well shot fistfight between two people climaxes with someone entering the room and throwing in a grenade at the victor \u0096 it's all random, brainless action.\n\nAlthough the clues are there (A film called Ballistic directed by Kaos), it's probably worth seeing just to acknowledge what a low point this is for Liu, Banderas and worst yet; this film probably ruined Gregg Henry's career. I don't think we'll be seeing Kaos make another film in America for a while."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "garyvanhorn",
        "review_rating": "1",
        "review_title": "Rightly voted one of the worst movies of the decade.",
        "review_detailed_main": "There is a special place in Hell reserved for directors who put out this kind of torturous cinematic garbage. The \"plot\" of this movie, and I do use the term very lightly, is little more than an excuse to have a series of pointless and poorly done shootouts, explosions, and chase scenes. All scenes come with a generous amount of slow motion included. A little free advice, filming a crappy scene in slow motion does not make it better, it just makes a crappy scene take longer to get off the screen and on to the next crappy scene.\n\nNormally I would attempt to explain the plot now, but I really don't feel like it, mostly because I have very little idea of what the hell was going on in the movie most of the time. What I can tell you is that a small boy is kidnapped, and his father, who isn't really his father, is trying to rescue him because he will die from an experimental nanotech weapon that has been injected into his bloodstream, by the guy who isn't really his father. Confused yet? Don't worry it gets worse. The non-father works for the DIA, never heard of it? Neither has anyone else, but apparently it is a branch of the U.S. government and they have evil, corrupt people working for them and they like to blow things up, especially in Canada, which is where most of the film takes place. Don't ask me why two U.S. government agencies are having a wild west gunfight in Canada and nobody seems to care, it just is.\n\nSo the DIA gets involved in a small war with the FBI in Canada over the kidnapping of the boy by a former DIA agent whose own son was killed by the evil non-father, and....screw it this is giving me a headache now. Suffice it to say this movie really, really sucks. The acting sucks, the excuse for a plot sucks, the action and effects suck, the editing sucks (in one car chase scene the day is rainy and the streets wet one moment, and completely dry the next) there is nothing to like about this movie. I should give the folks at MST3K a call on this one."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "BoomFoxx",
        "review_rating": "1",
        "review_title": "Ugh....",
        "review_detailed_main": "I went to this movie not expecting much. I figured that it would be a typical blow em up film without a very good plot. That said, the movie was worse than I expected. The action scenes are too overstylized to get any real sense of adventure. A horrible combination of slow motion and fast cuts during the various action scenes don't even make it worth seeing them. If you want a good action movie just rent Hard Boiled or the Killer and stay away from this garbage."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "shorty-35",
        "review_rating": "3",
        "review_title": "special effects vs. plot",
        "review_detailed_main": "I sure hope this flick was done 'on digital' it would have been a shame to waste so much celluloid film. Although it was a good exercise for pyrotechnics and gun fans will enjoy the very large inventory of powerful weapons put on display and misappropriate use."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "POBR24",
        "review_rating": "4",
        "review_title": "Review",
        "review_detailed_main": "I was fortunate to be one of the first ones to see Ballistic. This movie isn't bad, but still it is pretty bad. The plot is very lame. There has been lots of controversy about the rating of the movie (R). It probably is misrated. The violence is extremely heavy, but the language is suprisingly light. This movie is okay, and keeps you entertained. But parents shouldn't hesitate as much to bring their children to this movie. But if you still want to hesitate on bringing your children to this movie, i don't blame you, it is extremely violent.\n\n**1/2 stars out 4"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "seandchoi",
        "review_rating": "3",
        "review_title": "I went 'ballistic' against this movie!",
        "review_detailed_main": "The director of this film is Wych Kaosayananda of Thailand, whose nickname is \"Kaos.\" And that is appropriate: for this waste of celluloid is utterly chaotic. It is basically a series of action sequences--many of which are shot in slooooow motion--that are vainly searching for a coherent narrative to unite them. The trailer for this film looked good enough (cf. its fight sequences), but that is only because all of the \"good\" (or tolerable) parts of Ballistic are packed into it. (This only goes to show that you can't judge a film by its trailers.) The talents of both Lucy Liu and Antonio Banderas are wasted on this would-be action film. It's full of too many explosions, too little of what might be called a storyline, and it's all edited together with scant attention to continuity. The only conceivable way to enjoy this film is to sever your brain from your eyes."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "overdrive_maniac",
        "review_rating": "5",
        "review_title": "So much potential...",
        "review_detailed_main": "When I first saw the trailer for this film. I couldn't wait to see it. It looked like some cool super action flick. The trailer was awesome... too bad that pretty much all the action in the movie was in the minute long trailer. The plot was weak at best. Acting was way underneath some of these stars ability. So much potential... such a crap movie."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "billcue",
        "review_rating": "10",
        "review_title": "what are you all on about? it was good...",
        "review_detailed_main": "Ok, I've read all of the nasty things everyone said about this film yet still I insisted on seeing it mainly for ray park but even more so to see what the fuss was about. I walked into the film with low expectations (because of all of your comments), namely a lame plot, unanswered questions, and a hell of a lot of explosions. I went to the theatres, I saw the movie and I liked it... a lot. It was good! Sure, I have seen better but I definitely have seen worse! Granted, like every movie- there was cheesy moments but I think it was overall was good. Now, I know you all who hated the film must be thinking that I'm mad and I can't tell a good movie from a bad one- but I can. This wasn't \"Judge Dredd\" bad and that movie was horribly BAD. And granted it wasn't \"Gladiator\" good but it certainly wasn't as bad as most of you said it was.\n\nThe movie had a great plot. I liked it because it made the viewer have to put it together and also character development was made throughout the film and not initially in the first 20 minutes. Furthermore, when the movie started it started- there were no slow moments (or at least not that I can remember). Ray Park and Lucy Liu were fabulous. That climax fight was amazing, granted it could have been longer (I'm sure we all would've like that).\n\nBottom line- the movie wasn't that bad as every made it out to be"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "poolandrews",
        "review_rating": "6",
        "review_title": "I didn't think it was that bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Quicksand",
        "review_rating": "2",
        "review_title": "Dammit",
        "review_detailed_main": "To me, and only me (and maybe a handful of its crew), this was an interesting concept. The \"vs.\" in the title to me implied a battle between two superspies, lots of kung fu, ambushes, double-crosses, triple-crosses and creative stunts. Heck, in keeping with the Godzilla movies of old, maybe the winner will come back and fight some other action star in a sequel? That would be a good idea; it would be a cash cow for whatever studio pulled it off.\n\nBut, alas, another hack screenwriter gives us something any 10-year-old with an iMac could puke out, and the studio gives too much money to a first-time feature director, who drops the ball.\n\nI'm somewhat familiar with the music video work of \"Kaos,\" as he calls himself, but ya know, David Fincher couldn't make his first feature film into a classic, and neither did Kaos. There are exactly two creative camera shots in \"Ballistic\" -- the slo-mo henchman's plummet off a building is quite stylish -- but that's not plot, character, or consistency. At least John Woo sticks with one idea all the way through.\n\nA big raging fireball just isn't enough to hold anyone's interest. In Act III, the movie stops for at least 15 minutes, just to blow up some train cars. Yawn. Where's the character? (none) The sneakiness? (Ecks and Sever work together?! Cheat!) Fight choreography? (I've seen better in straight-to-video Micheal Dudikoff flicks).\n\nThere is absolutely nothing here worth watching, renting or acknowledging. And counting \"Blade 2,\" this marks an 0 for 2 cinematic use of Crystal Method's \"Name of the Game.\" Doesn't anyone know how to direct a film anymore? Sigh."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "toozy",
        "review_rating": "",
        "review_title": "Are they allowed to make movies this bad?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "utemetsu",
        "review_rating": "1",
        "review_title": "Beyond the Point of Redemption. Don't waste your time.",
        "review_detailed_main": "I'm not entirely how to say this while staying civil, but don't waste your time and the two dollars you'll spend getting ahold of this utter piece of bat feces. Let's face it. A director named 'Kaos' is bound to make bad movies, if only because the man makes no sense. Filled with lines which make no sense, actions scenes which make you feel like you're watching 18-20 old women beat each other with their purses and vacuum cleaners in slow motion, you'll spend more time going to the bathroom, getting snacks, and doing other things than actually watching this, checking back every 20 minutes to see if the plot actually progresses (which, I'm sad to say, doesn't). It cost me two dollars and and hour of my life. Antonio Benderez, I want that money and time back. Now."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "kgsecret",
        "review_rating": "2",
        "review_title": "Don't even think of a review of this",
        "review_detailed_main": "The first 40 minutes of movie already made no sense..\n\n1) FBI Trans-national unit... who the hell do they think they are? When did FBI became the world police to work in Vancouver, BC, Canada?\n\n2)Filming in the Vancouver Public Library Central branch as said... but you put out US corps car? are they sure they know what they're doing?\n\n3) Anyone who knows Canadian Politics knows better... Vancouver DOESN'T have military personnel base...\n\n4) These so call 'action'... it's so fake that you can see they aren't even TOUCHING okay 5)If you can simply bypass a restricted file, what's the point of having clearance? be real...\n\nI had enough of this movie..."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "fatedtime",
        "review_rating": "1",
        "review_title": "Horrible, Horrible, Horrible",
        "review_detailed_main": "This is yet another example of a film that should never have been made. There was not one single aspect of this movie that was even remotely entertaining or good. Ballistic fails on every level possible. I can't believe I sat through it."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "TheEtherWalk",
        "review_rating": "4",
        "review_title": "Antonio Banderas and Lucy Liu blow stuff up. People die.",
        "review_detailed_main": "This movie does have plot. It is about an FBI agent who pits two agents against each other to obtain a weapons system. The title is misleading, since it is only Ecks vs. Sever for the first half hour, then it becomes Ecks and Sever vs. the FBI. What ensues is a series of massive explosions and shootouts, with some subplots thrown in about Ecks' family. They are overshadowed however by the endless amounts of senseless violence. Overall, the movie could have been worse, but it could have been much better also. 4/10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "stormlord",
        "review_rating": "1",
        "review_title": "Dear O Dear",
        "review_detailed_main": "I really didn't think that movies this bad were still being made theses days. Sadly I was wrong. This would have to be one of the most pathetic attempts at a movie I have had to endure for a long time. Endless strutting and posing for the camera by Lucy Liu and \"action\" scenes that belong in a bad episode of The A Team make this film a laughing stock. I only gave it a 1 because there is no 0 option."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "absinthexl",
        "review_rating": "1",
        "review_title": "Wow.",
        "review_detailed_main": "KAOS seems to have the special skill of making martial arts, guns, and explosions incredibly boring. Editing is horrible (especially sound... I've seen freshman films here make less mistakes), fight scenes look like they were shot at half speed and undercranked, plot is totally incomprehensible (I prefer the Jackie Chan plot-only-there-to-justify-fighting)... Suffice it to say that after the first few fight scenes, I started fast-forwarding, only continuing to watch out of morbid fascination."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Michael Lindberg",
        "review_rating": "1",
        "review_title": "Terrible, just terrible",
        "review_detailed_main": "I'm all for great action movies with no plot. Too bad this film not only had a poor plot, poor directing, and poor acting, but the action was terrible as well.\n\nIf I could go lower than 1/10, I would. This movie represents everything that is wrong with American action films. I hated it."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Movie Nuttball",
        "review_rating": "10",
        "review_title": "A very cool film!",
        "review_detailed_main": "Ballistic: Ecks vs. Sever is a superb movie with non-stop and I mean non-stop action! The action scenes are so cool and explosive. I love the slow motion scenes and when the bad guys gets blown thru the air and one gets dropped hard on a car! That was awesome!Antonio Banderas looked very and good acted good and Lucy Liu was very good.Ray Park was good and I just loved his fight with Lucy Liu!Talisa Soto looked beautiful!Gregg Henry was good.Wych Kaosayananda (Kaos) is a great director in My opinion and I hope he will continue to make more awesome films!I would like to see Banderas in more action films as well!If you love Banderas and huge non-stop action films then rent Ballistic: Ecks vs. Sever!\n\nMovie Nuttball's Note:\n\nI don't understand why this is at the IMDb bottom 100: #91? If you haven't see Ballistic: Ecks vs. Sever then please don't listen to the bad reviews because I think it is really cool film!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "bitbucketchip",
        "review_rating": "6",
        "review_title": "Watchable only for Liu",
        "review_detailed_main": "Big fan of Lucy Liu and her action work in this film is as enjoyable as ever. The action scenes are Schwarzenegger-level preposterous, but well done for what can only be described a cartoon. The transitions between the stars and their very impressive stunt doubles were mostly seamless, a common failing in action movies. There were even a few things I hadn't seen before, which is tough to do in this crowded space. The action was entertaining.\n\nUnfortunately, everything else was a waste of film. Incomprehensible story, pointless dialogue, no character development, intrusive music, who-cares scenes that fizzle into nothing. Antonio is talented but hopelessly miscast. He gave it a valiant go, but I'm sure he had words with his agent each day after filming as he saw what he'd been thrown into. The rest of the actors looked bored and confused.\n\nThis is one of those movies where the scenes could have been edited in any order and it wouldn't have made the slightest difference.\n\n8 stars for the action scenes, 2 for any scene with Lucy, -4 for the fast forwardable filler scenes. 6 stars."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "dolemite72",
        "review_rating": "3",
        "review_title": "Action heavy...plot light",
        "review_detailed_main": "For a start off, i quite like BANDERAS, but this film felt cold (and please don't try to inject some pseudo-babble, about the film being about spies, and MEANING TO BE COLD!) the fact is, (explosions aside) this film has no atmosphere. Yet the film LOOKS very cool, the action is non-stop (not a bad thing, with a movie like this) but i still can't see who greenlighted this movie (as it looks fairly big budget, to me) BANDERAS (as entertaining as he is) is hardly likely to become a TRUE Hollywood A-lister (yet he is good) Whilst LUCY LIU is rapidly becoming the laziest performer in Hollywood, at the moment (what's the matter with her, can she not do \"dialogue\"? The plot (of which there's not much) concerns (i think) 2 super spies, who have had someone near and dear taken from them in the past. The link to these two is GREGG HENRY (so good with LIU in PAYBACK) who, in a rather murky set of circumstances, comes looking for BANDERAS's (feared dead) wife (played by the stunning looking, TALISA SOTO 13 years on from LICENSE TO KILL) who he has had a child with (eh?) Either way, any promise in the title of the 2 spies battling it out, is soon gone, when it transpires that LIU has been secretly watching over BANDERAS and his missing wife and kid (eh????) Soon our 2 heroes are batting it out with a huge array of assassins, stuntmen and as many explosions as Hollywood can muster (probably to take your mind off the nonexistent plot!) Director KAOS (oh dear) does give the action scenes some zip though (the shot bad-guy landing oh-so s-l-owly, on the car roof, is the 'money shot' for me) and there's aglimmer of some originality, with a thrown away subplot involving micro-bugs, injected into the bloodstream, to assassinate the organs!) but overall the movie looks as if, there's probably a 'interesting' 140 minute 'directors cut' somewhere. The sad fact is, there isn't, and this is the movie, in it's full 'creative' directors vision\n\nI find it hard to believe STALLONE can't get major studio backing anymore, with films like this around?\n\n3 out of 10"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "anonymousmoose-1",
        "review_rating": "",
        "review_title": "Nice cast - bad movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "pereiradorogerio",
        "review_rating": "3",
        "review_title": "I've seen The Matrix, I'm gonna do another movie",
        "review_detailed_main": "It's made in 2002 but right from the start it seems more like 1992. But the whole movie is constructed like if the director and the producers just came from watching \"The Matrix\" and so now they want to do the same thing. It's a mediocre imitation, you'll see right away where they just went for copying \"The Matrix\" instead of being original. It's in the action scenes, right down to the moves and weapons, it's atrocious and will have you screaming pretty soon. It does have a consistent script and it could have been a decent action movie if it wasn't for the mediocre imitation of another movie, a blatant rip-off of all the ways and scenes from someone else's work. This said watch it if you don't mind the close copying and if you're able to turn your brain off. Many times that's exactly what we want, so I give it a solid 4 out of 10. No, not a 5 and that's just because the scene-by-scene copy of \"The Matrix\" really annoys me a lot. It's so in your face that you just can't ignore it. There's a reason why it's so difficult to find a copy of this movie and it isn't because it's rare, it's because it's crap."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "worldsworstwryter",
        "review_rating": "4",
        "review_title": "That wailing noise is stuck in my head now!",
        "review_detailed_main": "I don't know if it's my fault ( it probably is) or Amazon Prime's, but I haven't been able to get their subtitles working lately, which means that due to the 'intense' whisper-acting throughout much this film (and my terrible hearing), I had no idea what was going on most of the time. However, the bits of the story that I did manage to catch, were beyond ridiculous.\n\nI can't lie though, some of the sillier story beats actually caught me off guard and made me laugh a few times, so that's something to acknowledge.\n\nApart from that, pretty much the only other thing I enjoyed about the film was the music. It was great! Or rather, it was great during the banging techno tunes... but it was not great when they abruptly cut off said techno anthems to go back to the same bored, droning wail that repeated in just about every scene.\n\nI do find it quite amusing that Rotten Tomatoes, for example, lists this as their worst rated film of all time. I mean, it's not \"good\" by any stretch, but come on, if you're going to talk 'worst ever made', you've got to dive a bit deeper into the bad movie depths than one which for the most part, just feels like any other bland action/spy film.\n\nAnd ok, maybe its blandness could be why it is so despised, which is fair. In my opinion, the absolute worst quality any piece of entertainment can have is to be boring. However, even then, I'm pretty sure I could name 20 movies off the top of my head that I found far more boring than this one. There are films out there so desperately dull that they've genuinely sent me to sleep (Baby Geniuses 2), or kept my face frozen off from emotion for the entire running time (Star Wars Holiday Special), but this one actually has a few bits to laugh at.\n\nMind you, I don't want to sound as though I'm giving too much praise to this thing, it's still dreadful."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "vacax",
        "review_rating": "1",
        "review_title": "Makes absolutely no sense",
        "review_detailed_main": "I watched Ballistic: Ecks vs. Sever in order to find out how bad it could really be. It was already famously bad, but one wonders just how bad it really is. I just want to say that this film is remarkable. Never before has a film's plot contradicted itself so many times and still attempted to have a plot. This would have been much better if they altogether abandoned any semblance of a storyline, and just showed more fighting. The story makes absolutely no sense. The action is nothing special. At one point I do believe there are many large explosions, literally for no reason whatsoever.\n\nIf you are interested in watching a film filled with anti-plot, this is the film for you. You will be in awe at how you're watching a big budget movie where the writers / editors / directors obviously don't know the first thing about making a film. Just how bad can a plot be? The answer is simple. Ballistic: Ecks vs. Sever"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "daniel-mannouch",
        "review_rating": "2",
        "review_title": "Ballistic B****cks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "jannagal",
        "review_rating": "3",
        "review_title": "Let's blow up lots of stuff.",
        "review_detailed_main": "Conversation between director and producers:\n\n\"Explosions. Lotsa people like 'em.\" \"Okay, car sales are down...let's help automakers. Blow up 50 cars, 100 if you can.\" \"How about train cars?\" \"Okay, lots of them.\" \"But won't it look phony if hundreds of rogue agents are killed, but not Lucy and Antonio?\" \"Okay, put a scratch on each of their faces. That way it'll look real\" \"How should I direct the stars?\" \"We're spending tons on explosions! We don't need acting or story!! Just tell Lucy to stare into space alot, without any expression. She'll look like she's intellectual, or something. And 'Tonio, just tell him to skip shaving for a few days, and oh yeah, tell him to find some really junky clothes. That'll show the world how desperate and lonely he is, and it'll save on wardrobe and makeup. Ha, ha. Investors will like that.\"\n\nDid the director and producers really have that conversation? Watch the movie and see if you agree."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "pga6",
        "review_rating": "1",
        "review_title": "I didn't know they could make a movie this bad!",
        "review_detailed_main": "This movie was an atrocity. Explosion after explosion could not cover up what was severely lacking in plot. It's one thing to have a flimsy plot as an excuse for action; it is quite another to have a seemingly complex one that in actuality makes no sense. To say it has plot-holes doesn't even begin to cover it. Not to mention the ridiculous dialogue, cheesy music, and horrendous title. It is an embarrassment for Lucy Liu and Antonio Banderas to have their names attached to this movie. I suggest they sue their agents. 90 minutes staring at a wall would be a better use of your time!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "silverandblack72",
        "review_rating": "3",
        "review_title": "Jeezum crow...this was bad.",
        "review_detailed_main": "Now, I'm not doubting the masculinity of Banderas and the \"drop to you knees and thank God your a man\" beauty of Liu. But this movie was bad in soooo many ways. I think it was Shakespeare who once said \"How crappy is a movie? Let me count the ways.\" Or maybe it was \"Is a bad movie called another name, still just as bad?\" Err...whatever. Avoid this movie like the plague and spend your time watching something a bit more entertaining...like Spongebob Squarepants!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "icewolf2k",
        "review_rating": "10",
        "review_title": "A Great Action Movie",
        "review_detailed_main": "Ballistic: Ecks vs Sever was a great action movie. It had great explosions and great fight scenes. The actors played their parts well and held the story together. The plot wasn't something out of the Matrix, but it was simple, existent and worked good for the style of movie. This isn't a movie to see if you're looking for a brilliant plot or to see a man talk to a volyball (and yet somehow impress everyone). This movie was fun to see and would be great to see again. The director (Kaos) did a good job directing and the music was fitting. I do believe it could have been better and that it did have its problems. Give it a chance, and remember this isn't an award winning movie. It's a fun to see, kick butt, action movie, with an odd name"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Ex-PFC_Wintergreen",
        "review_rating": "6",
        "review_title": "Surprising success despite the straight-to-video stigma",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "stoestga",
        "review_rating": "2",
        "review_title": "Bad film, bad story, bad acting",
        "review_detailed_main": "There is no flow in this movie. The story is thin, Banderas and the bad guy are maybe the most artificial actors ever. Not only in this movie but in general."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "cosmicnut",
        "review_rating": "",
        "review_title": "Belive me I have seen a lot worse!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "BroadswordCallinDannyBoy",
        "review_rating": "1",
        "review_title": "One of the worst action movies ever made",
        "review_detailed_main": "Two super secret agents battle it out, but ensuing revelations reveal that they actually have the same enemy. So they join forces and blow a lot of stuff up.\n\nIt is hard to say what the worst part of this film is. Is it the flat characterizations that try to be part of an actual dramatic story? Is it the shallow plot that tries to convince you this is a Ludlum thriller? Or is the action scenes - which include increasing amounts of TNT, bullets, bodycount, etc - yet never amount to anything other than an excuse to blow stuff up? What more is that these action scenes are stunningly bad - poorly shot, choppily edited - and that sets a new low in choreography for big budget action films. The 1996 low-budget direct to video no-nonsense action flick \"The Sweeper\" with C. Thomas Howell is infinitely better then this despite being made on a what could only be low budget. But it delivered what it promised.\n\nA strange thing is that this horrible movie reminded me of one of my personal favorites: Where Eagles Dare. That film also has lots of action, suspense and the screenplay obviously prefers that over logic, but that movie had a great plot to back it all up in addition to the overall tone of sheer escapism. It never took itself seriously and during action scenes, \"Eagles\" goes all out.\n\nNone of that here and a motorbike chase scene, right before a \"plot twist\" must top off at what can be at most 30 miles per hour. Awful all across the board. 1/10\n\nRated R for overblown violence"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "minix",
        "review_rating": "1",
        "review_title": "My god... what is this?",
        "review_detailed_main": "I had to preview this for work tonight, and while I was payed a total of $13 to watch it... I feel like I was cheated...\n\nWatch as car chases occur at speeds of up to 30 miles per hour!! When he says run it means jog at a slow pace! And now for the cop circus! 80 cops fit in 8 police cars, and they keep running into bullets and showing up in the next scene!! Watch as 4 close range shotgun shots do nothing, but 2 pistol shots kill 3 people thru heavy armor!!\n\nAnd that's saying nothing about the acting...\n\nAntonio Banderas I was able to stand... didnt' enjoy his character much but didn't mind if he lived through the movie... Lucy Liu I wanted dead... she was boring, and I really didn't care what her motivations were... the bad guy is... well... bad... but... I didn't hate him bad... just... bad acting bad... which I guess I did hate him for but not for his character... The only enjoyable character was Ray Park (think Toad in X-Men) but... I still couldn't picture him as any other character other then Toad... who knew that one would stick...\n\nAnd plot... heh... I would elaborate, but, I think ugh covers it...\n\nIf the above hasn't convinced you to not see this, remember, it's directed by \"Kaos\"... which should strike fear into any self-respecting person.\n\nIf they make me watch another one like this, I'm putting in my two weeks notice."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "donikatz",
        "review_rating": "4",
        "review_title": "lame-o action flick",
        "review_detailed_main": "good lord. this movie couldn't possibly as bad as its title, could it? well no, it can't, but it certainly puts up a good fight. file this one under shallow, poorly written, been there, done that action drivel. banderas and liu could have been a spicy combination (see: banderas & hayek in desparado, banderas & zeta jones in the mask of zorro), but the aweful writing and direction sabotaged any chance of on-screen chemistry. so instead we get another run-of-the-mill, hokey shoot-'em-up. hey, what a neat explosion. again. like the casting of talisa soto, this movie looks good on the surface, but is b-grade all the way."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "mynameisal",
        "review_rating": "2",
        "review_title": "this movie is bad, even for an action movie",
        "review_detailed_main": "what happens when an action movie that has no plot, bad acting, horrible music, and no style whatsoever also lacks in action and technique? ballistic! that's right! i went to the theater expecting to get my adrenaline up with either a bit of martial arts or a good gunfight or something, instead i ended up sitting through a mediocre movie with lame no-substance explosions and uncreative slow motion. granted, an action movie can lack acting and even plotholes and i'll still love it, but what the hell am i supposed to do if the movie doesn't even have good action? this was terrible, don't watch it, and don't listen to the easily amused. explosions can be good but not if used as a substitute for action, or substance even. go rent charlie's angels and desperado, apparently banderas and liu work best separately."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Falkyn",
        "review_rating": "3",
        "review_title": "Explosions don't make a movie",
        "review_detailed_main": "I like secret agent movies, but this script must have been partly written by the CIA or the NSA. At times the plot was so incomprehensible it seemed to be encrypted. I was impressed that Antonio Banderas and Lucy Liu did their own fight scenes, but it seemed like the filmmakers relied on explosions and gunfire to build excitement. That only works for a little while. One big question I had; why is a movie about battling American intelligence operatives based mostly in Vancouver?\n\nOh, one other huge plot question. Why would you go to the trouble of creating the miniature robotic assassins? The little critter still has to be injected, so it's not like it's untraceable. Might as well slip your victim some slow acting poison and save the billions of dollars in development."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "freydis-e",
        "review_rating": "4",
        "review_title": ": Lots of explosions and shooting, slickly staged, but don't expect anything more.",
        "review_detailed_main": "This movie has neither plot nor characters – even the car chases and kung fu have to be squeezed in among the endless series of explosions and interminable firing off of whole arsenals of weapons. For once I can be absolutely sure I'm spoiler-free, as there's no story here to spoil.\n\nWe have not one but two stereotype rogue agents, played by Liu and Banderas, battling it out with each other and armies of police and bad guys for reasons that never really matter. So why bother to comment on something so amorphously pointless? Well, for one thing it's very well put together. For another, Liu and Banderas are as good as they're allowed to be by the fairly nonexistent script and this is a long way from the worst you'll see. Also Liu's character is rather unusual. She effortlessly deals with all comers, including Banderas, who's soon reduced to wandering about, telling whatever poor sap is next in the firing line: 'She's gonna kill you. Good luck.' Super-tough women are nothing new but, as in Kill Bill, The Long Kiss Goodnight, etc, they're always given some point of vulnerability. Not here. Liu's Sever comes close to being a female James Bond, an unstoppable winner. The sad truth is revealed by a brief exchange of threats with the main villain, a photo, and Banderas' closing line. They actually did mean her to be fallible and vulnerable, but it just got lost along with all the rest of the characterisation.\n\nIf you like explosions, shooting, tough women and either of these stars, and have time on your hands, you could do worse than watch this. But don't go out of your way."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Jackpalance",
        "review_rating": "1",
        "review_title": "As Boring as the Title is Long!",
        "review_detailed_main": "This was by far one of the worst films I have ever seen. Normally I can appreciate a bad action movie as much as a good one, but this movie really was the worst kind, boring and unfunny. I was worried when the opening titles looked worse than most made-for-tv movies, but that is only the tip of the iceberg. The martial arts are shot too close to tell what is going on, the car chase might as well take place on vespa scooters (I swear no one is going faster than 30 mph), and everything blows up...everything. Please, please do yourself a favor and stay home and watch Predator on TNT, sure you'll already know what happens and there will me no blood, but Ecks and Sever will cost you $20 to see the same thing."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "tabuno",
        "review_rating": "8",
        "review_title": "An Enthralling Spy Thriller",
        "review_detailed_main": "20 September 2002. \"Ballistic\" is a cut above average spy thrillers in its action, cinematography, its use of special effects. Lucy Liu is especially interesting because she really plays her role consistently throughout the entire movie and her fighting skills aren't cheapened by obviously phony martial art tricks. Antonio Banderas actually seems to play second in this movie. The chase scenes are not completely stereotyped. This action thriller was involving and really literally blows away many other straightforward spy movies. There is a distinctly serious, deadly interest in the intensity of the action and more psychological goings on among Lucy and Banderas. Totally entertaining and enjoyable."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "drewg2002",
        "review_rating": "7",
        "review_title": "A very good ACTION film",
        "review_detailed_main": "If your looking for nothing but a pure action film with no plot or great acting then I would suggest this film.I am a big lucy liu and antonio banderas fan so this movie appeals to me and is worthy of a good vote.The action scenes are very well done and the fight scene between lucy liu and ray park (Darth Maul) is my favorite.And kudos to ray park for putting on a pretty good performance of the bad guys right hand man.If your an action junkie like me then this movie is definitely for you."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "thomvic",
        "review_rating": "1",
        "review_title": "I can't believe I wasted my time with this...",
        "review_detailed_main": "I knew the reviews said this was horrible but sometimes when you hear a film is really bad- you wanna check this out. So I rented it.\n\nAnd yes it is horrible! First of all - the plot is so stupid, but even average action films have decent plots.\n\nSecond - the action scenes are simply mainly Antonio chasing Lucy Liu so it feels more like a cat and mouse game that doesn't end.\n\nThird - this would be way more appropriate for a video game that people just wanna shoot people and chase them - these things do not make a good movie! I honestly don't know what Lucy Liu in particular was thinking. As for Antonio, well I guess he had to do something to make his presence in Hollywood better so I guess I can't blame him..but come on you can do better than this garbage.\n\nAvoid at all costs!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "scottcsx",
        "review_rating": "1",
        "review_title": "Craptastic",
        "review_detailed_main": "This movie is a waste of celluloid. When you see the words \"Directed by Kaos\" in the credits, you know it's a bad sign. For (barely) 90 minutes you are treated to bad acting by people capable of much better, bad directing, and a laughable attempt at a script. Nothing that happens in this film makes any sense. Even the fights and explosions are done with a lack of style. You'd be better off giving someone $9 to kick you in the behind for an hour and a half."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "JamieWJackson",
        "review_rating": "4",
        "review_title": "rather bad, but stylistic",
        "review_detailed_main": "I'm giving this thing a 4 almost out of sympathy. It is a mess plotwise, but not so much so that you can't figure anything out. Banderas was AWOL emotionally here, and Liu was sometimes as well, but the others did alright. Liu is such a cute kitten that the movie gets 1 point just for her.\n\nIs it bad? Yes, it's bad. One of the worst movies ever? I wouldn't say so. Lots of cliches, yes, and things which should have been rescripted. Still, a lot of the action was well-filmed, even if it didn't always make sense, and I did root for the good guys a little bit despite the muddled plot elements.\n\nOn style I give it a 4; had it not been so nice-looking it would have been lower. Do _not_ watch this movie for the plot or the acting; you'll learn nothing.\n\nThe crummy title came from a video game, so I suppose I give this film another half a sympathy point for having to overcome that."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "torrascotia",
        "review_rating": "3",
        "review_title": "Mini Woman Beats Up Big Men",
        "review_detailed_main": "You dont see many double named movies these days. Thats generally something you only seen in Batman or Star Wars spin off cartoons. But they only work because people already know what one half of these titles mean. Ballistic? No me neither. The title gives the impression we should already have seen a movie with this title before this one.\n\nWhat this is, is yet another low to mid budget action movie that involves a nice looking woman who is also a master of all types of punch ups. Because theres obviously some guys in Hollywood who make decisions who have a \"special interest\" in this theme. For those of us who don't, the sight of Lucy Liu bashing up 6ft tall police/army/bad guys in groups at a time is just funny. What is strange however is that the other female lead in the movie is also known for martial arts, but she doesn't get a fight in this movie. She plays the mother of a child kidnapped by Lucy, who is then pursued by Banderas and the childs gangster father. Every guy in this movie is simply there to get kicked by Lucy.\n\nQuite a flimsy plot but its really a vehicle for Lucy to kick lots of men, shoot thousands of unnecessary bullets and press red buttons that make things explode. Theres also a sub plot about some superweapon that you will forget exists until the final scene. This movie comes across like one of those shiny Hong Kong action movies of the late 90's, only with fewer Chinese actors. Definitely has \"niche\" appeal."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Slick-666",
        "review_rating": "2",
        "review_title": "One of the worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "a2guy",
        "review_rating": "2",
        "review_title": "If it weren't for Lucy Liu....",
        "review_detailed_main": "As soon as I heard the opening music on this movie, I knew it was going to be a turkey. I felt bad, too, because I really wanted to see Lucy Liu in an action movie. She was great in Charlie's Angels, I was hoping for more of the same.\n\nUnfortunately, the movie was a complete disappointment. I rented it on DVD, and had to turn it off after 30 minutes, it was so bad. From the pathetically wimpy score to the chopped-to-oblivion plot to the normally decent actors obviously just cashing a check (Sandoval, Henry), it was a movie unworthy of Ms. Liu. I can understand Banderas getting stuck with this movie, but man, Liu should fire her agent right away, and sue them on top of it.\n\nThe score was something a child could create on their $60 Casio keyboard, and the dialogue couldn't have been worse. Two guys in a truck about to be blown up, and one guy says to other \"Take the flank\"?!?!?! You've gotta be kidding me!! LOL I honestly don't know what was going on with the music...the composer was the same guy that did \"The Matrix\" as well as \"Behind Enemy Lines\". Maybe they didn't pay him enough, or maybe he only had a weekend to do the scoring. Either way, it did nothing but make a bad movie worse.\n\nHopefully the group behind this picture will never try to make the public suffer through another monstrosity like this, and I surely hope Ms. Liu doesn't suffer because of it."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "PatrynXX",
        "review_rating": "5",
        "review_title": "Movie trailer is misleading, but it's not the worst movie ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "BoX616",
        "review_rating": "2",
        "review_title": "This movie blows",
        "review_detailed_main": "When I rented this movie, I had high expectations. I was hoping for a good action flick. What I got was an hour or two of crap. I gave it a 2 rating, because amazingly I actually sat all the way through it. And the only reason I did that was because I was hoping it was going to get better. I would never recommend this movie to anyone, except, maybe someone I didn't like. So they could go through the agony that I did. This movie blows!"
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "47464",
        "review_rating": "9",
        "review_title": "explosive! (ha ha)",
        "review_detailed_main": "Lots of bangs and crashes, lots of smashed cars and explosions, no it's not my wife driving down the M1 Motorway it's Ballistic. Who cares what the critics think (I wish I could get paid to see movies). Good solid actioner, brain-out-of-gear fun, but why don't film makers give bigger parts to Ray Park. 9/10."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "youngsheri",
        "review_rating": "7",
        "review_title": "Better than I thought",
        "review_detailed_main": "Okay, so we all know it's an action flick. Not much of a plot, but an action film WITH a plot is so rare I don't think anyone really expects it. Taking this into account I rather enjoyed it. Lucy Liu's fight scenes were great, which was basically what I was hoping to see. I would watch it again when I'm in a no brainer mode just to see someone kick some ass... But that's about it."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "ddelwood",
        "review_rating": "1",
        "review_title": "the viewer faces a major quandary",
        "review_detailed_main": "humm, never before have i had such a hard decision: is it better to watch this film at 4X or 8X regular speed!!?\n\nhonestly, this film has so many slo-mo sections the only way to make this already unending movie not seem like a time-skip movie is to use the dvd fast forward.\n\nthere's only a very few kick/fight scenes - the one at the end is very nice. honestly, a martial artist is wasted when they pick up big guns and shoot 50 down in a spray of bullets/grenades - why sly stallone can even do that! no, at the last fight scene, down go the automatic weapons, throw down those sidearms - fight it out hand/foot."
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "Thursday",
        "review_rating": "",
        "review_title": "It's actually ok!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0308208",
        "movie_name": "Ballistic: Ecks vs. Sever",
        "movie_rating": "3.7",
        "review_username": "MsMoby",
        "review_rating": "1",
        "review_title": "Lots of action, but who cares?",
        "review_detailed_main": "Let me preface this by saying I had high hopes for this movie. I love action movies, and was eager to see what kind of action hero Lucy Liu would make. And I don't mind looking at Antonio Banderas. I was severely disappointed.\n\nThey should have taken 1% of the money they spent on explosions & spent it on a script. Or maybe a different director, who cared about the script more than the special effects. What's especially disappointing is that the movie could have been good, if we'd been allowed to bond with the characters and actually care what happened to them. However, when I saw the movie, the audience was restless (always a sign of a bad movie), and actually burst into laughter at several points that I'm certain weren't intended to be funny.\n\nEven at matinee prices, I felt I'd spent too much for this one."
    }
]