[
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "reelreviewsandrecommendations",
        "review_rating": "4",
        "review_title": "Nonstop Nonsense",
        "review_detailed_main": "Some films are so bad they're good. Tommy Wiseau's 'The Room', or Claudio Fragasso's 'Troll 2,' are hilarious because of their ineptness, and are therefore really entertaining. Others are less enjoyable, but have redeeming qualities, such as the striking visuals in Alex Proyas' overblown 'Gods of Egypt,' for instance. Then, there are films that are just awful, with nothing to offer the viewing audience beyond boredom and disappointment.\n\nNimród Antal's 'Retribution' is one of the latter. An unoriginal slog, the film follows Matt Turner, a financier and family man. One day, while driving his children to school, he notices a strange phone ringing beside him, and answers it. The caller turns out to be an anonymous fiend, who tells Turner he has placed a bomb under his seat that is triggered by pressure plates and a radio frequency. The caller demands that Turner follow his instructions to the letter, otherwise the bomb will be detonated; sending Turner and his children on an explosive ride through the streets of Berlin.\n\nIt is, essentially, 'Phone Booth' meets 'Speed,' with a dash of Steven Knight's 'Locke,' but is no way as fun as that combination sounds. A dull remake of a much better film, Dani de la Torre's 'El desconocido,' Antal and screenwriter Chris Salmanpour fail to make the venture exciting, thrilling or in any way engaging. Salmanpour's dialogue is so stilted and full of exposition it makes that heard in Robert Lorenz's 'The Marksman' sound like Shakespeare. The narrative is predictable, featuring a twist so obvious it may make your eyes actually roll.\n\nFurthermore, the characters involved are all stereotypes with little to no personality. Turner is a wet-blanket, who is difficult to root for, while his children are breathing cliches. Secondary characters are no better, and everyone involved acts without logic or common sense. How the film was greenlit for production, considering it is so boring as to be qualifiable as a sedative, is astounding. It plays like a cheap TV movie from the 90's or early 00's: forgettable, monotonous and hardly worth the time one has to invest in watching it.\n\nIt is an unexceptional, tiresome picture in every regard, featuring passionless cinematography from Flavio Martínez Labiano, which does nothing to aid proceedings. He makes Berlin- a notoriously interesting location- look flat and dreary, while his utilisation of shots and angles is conventional and uninspired. Similarly, composer Harry Gregson-Williams seems to be just going through the motions: his bland score reflects a lack of interest in the subject matter.\n\nMoreover, Steve Mirkovich's editing is mediocre, if not downright poor. Mirkovich has cut some films brilliantly in the past: his work on 'Con Air' created tension and momentum, as it did on 'Big Trouble in Little China' and other projects. Here, though, he fails to generate the fast pace required for a thriller to work. The film plods along at a pace that would irritate a snail, going glumly from scene to scene with little to no energy or drive.\n\nIn fact, the only half-decent aspect of the film is star Liam Neeson's performance. Neeson does solid work, but Turner is a role that requires nothing from him, and he appears as bored as his audience at times. In the last few years, he has been making dodgy career choices, seemingly lured by big paycheques and nothing more. Although one can't fault him for wanting to make a bundle for relatively easy work; this might mark the nadir of his career thus far, and might actually hurt his bankability.\n\nHe should have avoided it like the plague, as should prospective viewers. Alongside Neeson, Jack Champion and Lilly Aspell, starring as his children, do forgettable work, while Noma Dumezweni does the bare minimum as a Europol agent on Turner's tail. Also, slumming it in a thankfully small role, is Matthew Modine, who is over the top when he isn't wooden, and seems embarrassed to be associated with the project at all.\n\nAt the end of the day, Nimród Antal's 'Retribution' is a boring waste of time. Based on an exciting film from Dani de la Torre, something was lost in translation when screenwriter Chris Salmanpour penned his adaptation, as there are no thrills, tension or entertainment value whatsoever in the finished product. Although Liam Neeson does solid work, this may be one of the most mundane, unexciting films he's appeared in- and in the last few years, he's been in a lot. Featuring nonstop nonsense and nothing more; this film is so forgettable, you might actually forget it as you're watching it."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "cruise01",
        "review_rating": "4",
        "review_title": "Liam Neeson action thriller bites the dust.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "paul_haakonsen",
        "review_rating": "5",
        "review_title": "But this was essentially just \"Speed\" without the thrills...",
        "review_detailed_main": "Of course there was no doubt about me having to sit down and watch this 2023 action crime thriller as it had Liam Neeson on the cast list. Sure, I had never even heard about the movie prior to watching it, not that it really mattered, as it was a Liam Neeson movie.\n\nThe storyline in \"Retribution\", as written by Alberto Marini and Christopher Salmanpour, sort of was very similar to the 1994 movie \"Speed\", except that it was lacking the high speed and adrenaline. It was watchable, for sure, but it was not a top notch movie for Liam Neeson. The storyline was a bit too much of a copy and paste of \"Speed\", except it was in a SUV and had a slightly different plot.\n\nThe acting performances in the movie were good, and while Liam Neeson didn't have a particular set of skills in \"Retribution\", then he still carried the movie well enough to make it a watchable movie. There are a couple of other familiar faces on the cast list, with the likes of Embeth Davidtz, Matthew Modine, and Jack Champion.\n\nI found \"Retribution\" to be somewhat lacking in thrills and excitement, and the movie's plot and storyline was a tad too linear and predictable for my liking. Plus, the fact that if you've already seen \"Speed\", then you have essentially also already seen director Nimród Antal's \"Retribution\".\n\nWatchable for what it was, \"Retribution\" didn't impress me, nor did it revolutionize the action crime thriller genre. In fact, it didn't bring anything new at all to the genre. And on that account, my rating of director Nimród Antal's \"Retribution\" lands on a bland five out of ten stars."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "FeastMode",
        "review_rating": "3",
        "review_title": "\"Please, just listen!\" (spoilers after a warning)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "subxerogravity",
        "review_rating": "6",
        "review_title": "Only if you really like Liam Neeson.",
        "review_detailed_main": "Retribution is barely for those of us who fell in love with Neeson when he did the ultimate man meal Taken. Ever snice That trilogy I've been running to the theatres to watch Neeson flicks and this is the Frist time I actually said to myself why (which i now found surprising).\n\nNot to say this was a bad movie, but it really seemed unnecessary. Wild thing, it feels like a similar plot to a better Neeson movie the Commuter. The movies may seem polarizingly deferent but if you seen The Commuter you'll notice the same plot devices creating the same loop holes in both, but the Commuter is worth seeing while i could have skipped Retribution altogether."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "felixklinkhammer",
        "review_rating": "2",
        "review_title": "I'm convinced ChatGPT wrote the script.",
        "review_detailed_main": "I don't know where to start.... The dialogues are bad, wooden, and cheesy. The acting is far from enjoyable. The characters are dull and absolutely undeveloped. There is no motivation for the bad guy I can find. The Police and \"Europol\" are far from realistic, and speaking of Europol: this is not a European FBI, as shown in the movies. And of course the way they show Berlin hurts to see. They drive down one street, the next turn he is 20km away in another part of the town.\n\nI'm just happy I saw this in a sneak preview with cheap tickets, because if it was a regular screening with full price tickets I would have demanded a refund."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "MusicMutt",
        "review_rating": "7",
        "review_title": "About what you'd expect",
        "review_detailed_main": "If you are into hyper-realism this ain't for you, but if you just want to check your brain at the door and have some fun this is well worth he watch.\n\nLiam Neeson delivers as he always does and the supporting cast, especially young Lilly Aspell as his daughter, do a very god job.\n\nRetribution is a remake of the 2015 Spanish thriller El Desconocido, with Liam Neeson as a financial trader who gets trapped in a car with a bomb and his two kids. The film is some what cliché but like I said you wouldn't watch this for it's realism and there are enough twists, turns and explosions to keep you interested.\n\nClocking in at 90 minutes in not a major investment in time either.\n\nFor the genre I give it a 7/10."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "silicontourist",
        "review_rating": "1",
        "review_title": "Not A Single Piece Of The Film Makes Any Sense!",
        "review_detailed_main": "I like Liam (Neeson) so I obviously had to see it. If i could only get my lost time back after watching this abysmally bad, senseless idiotic piece of rubbish. The only thing that this film makes you incessantly aware of is the fact that in everyday real life, people just don't listen! So, please just listen to every ignored request made by different party's appearing in the film. The director seems to have made everyone do everything wrong...deliberately!\n\nThere is just no logical sensibility about any of this film especially with the numb-nut Interpol female police boss; she is given a load of case solving relevant information but refuses to listen or believe any of it. The film is just totally and stupidly pointless annoying trash.\n\nThe film is in English but set in Germany and nobody bothered to include the subtitles for the German speaking lines/parts. This is Liam's fourth bad film in a row so we can only hope his next outing is back to his good self!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Top_Dawg_Critic",
        "review_rating": "7",
        "review_title": "Geez, it wasn't that bad.",
        "review_detailed_main": "With all the slim pickings and nonsense that's been coming out lately, especially all the failed Hollywood blockbusters, I'm not sure what everyone's expecting. I held off watching this from all the low ratings and reviews, and since I had nothing else left to watch, I though I'd finally give this one a go. The first two acts where actually impressive and with hardly any flaws, and full of constant tension and suspense. But the third act certainly had some plot and technical issues, as well as some logic defying actions and decisions. Casting and performances were excellent throughout, as was the pacing, cinematography and score. Had the third act been better, this would've easily been a solid 8, but as the writers seemed to lose steam and creativity in the third act, it's down to a 7/10 from me."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "kskmah",
        "review_rating": "2",
        "review_title": "Are You Kidding Me?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "RosanaBotafogo",
        "review_rating": "8",
        "review_title": "Excellent plot, several remakes...",
        "review_detailed_main": "Matt Turner, an American businessman living in Berlin, seeks to balance his prosperous financial career with family responsibilities. One morning, while taking his children to school, Matt receives a phone call. A mysterious voice warns him that his car is rigged with explosives and will explode unless he performs a set of tasks. Forced into a high-speed chase through the city streets, Matt must follow the stranger's increasingly dangerous instructions, in a race against time to protect his family and unravel the mystery that unfolds throughout the day.\n\nExcellent plot, several remakes, all maintaining the original, harrowing and exciting context... Adorable... As good as the original 2015 version, and there are still 2 remakes left (2018 and 2021)... With the addition of some good elements mainly the final fate of the protagonist and antagonist, lots of action, explosive and cinematic... Light Plot Twist..."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "antoniotierno",
        "review_rating": "7",
        "review_title": "a bit cliché but packed with good action",
        "review_detailed_main": "Like a number of these recent Neeson action spectacles, \"Retribution\" is a remake of a Spanish and a German film.\n\nNone of the characters appearing are particularly interesting or likable (the kids, in particular, seem to be a bit annoying at times. And the director (named Nimród Antal) handles the strong action scenes and beats in a well exciting; the big twist in the final scenes is a bit predictable obvious that virtually every audience member will have figured it out long before it's deployed. So, a continuity with most of the movies starring Neeson of the last 10 years but overall interesting for the filming location in Berlin and due to Neeson's good (as usually) performance."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "danwilberforce",
        "review_rating": "3",
        "review_title": "I feel dumber for having seen this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "petercarlsson-92297",
        "review_rating": "1",
        "review_title": "Bratty kids in the backseat",
        "review_detailed_main": "So, Liam Neeson sits on a bomb, and in the backseat of the luxury car sits his two bratty, spoiled kids yapping away. Through the whole movie they are just terrible and we, the audience, has to endure their ungrateful attitude towards their dad. Awful.\n\nAnd the story... oh the story. You have seen it several times already, starting with the movie \"Speed\" ages ago. And here it is again. But while \"Speed\" was interesting and fun to watch, this is just boring. A movie without any logic and fun factor. So why should anyone see this movie? Well, that's a very good question, that I can't find any answer too."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "ma-cortes",
        "review_rating": "6",
        "review_title": "Germany/Spain/France/United States co-production with tension, intrigue, action and plot twists.",
        "review_detailed_main": "Above average thriller with plenty of twists , turns and a suspenseful finale. It contains unstopped action with great cast and nice supporting actors giving good performances . Deals with a bank executive, who faces a risked situation when he receives a mobile phone call informing him he has just a few hours to get a large amount of money or a bomb under his seat will explode , but events are about to be worst . Complicating things still further , the police pursues him and surrounding his car and then happenings go awry . Liam Neeson stars in this high-voltage thriller called Retribution about a matter of life and death containing action, revenge and redemption, in which he receives a bomb threat while driving his children to school that his car will explode if they stop and get out. In a race against time, Matt will have to do the impossible to save his family. This Summer, all roads lead to the truth !.\n\nThis is a top-notch thriller about a high-powered banker submitted to weird circumstances surrounding him , that's just the starting point for him , and a bit later on , things get even worse . A film in similar quality other Hollywood blockbusters . As this film results to be a crossover from other benchmarking successes as well as grossing American films , such as : ¨Locke¨ by Steven Knight (2013) with Tom Hardy , \"Speed\" (1994) directed by Jan de Bont with Keanu Reeves , and \"Phone Booth\" (2002) Joel Schumacher with Colin Farrell . This thrilling movie has a lot of action images , including pursuits , car crashes , explosion , and anything else . The plot can not be very realistic ; however, displaying several scenes have you on the edge of your seat . The picture increases the relentless tension as well as the flick progresses on screen . Thrilling and nail-biting film with a lot of scenes of drama , tension , emotion and action , all of them at equal parts . This is a highly suspenseful and cerebral thriller , filled with plot twists , including an unexpected denouement in its final part . Hitchcock style psychological thriller , being surprisingly good and stunningly directed . The picture is pretty well , though sometimes stagy , as developing into the car , and it has a lot of turns . However , being very entertaining for its continuous suspense . The original as well entertaining premise is overspread across the movie adding some brief conventional pitfalls . The well assembled cast is frankly good , including masterful direction of players by filmmaker Nimród Antal, such as: Matthew Modine (Full Metal Jacket, The Stranger Things), the young Jack Champion (Avatar) and Embeth Davidtz qho long time ago starred along with Liam Neeson 'Schindler List' . In this remake of the Spanish film \" El Desconocido (The Unknown)\", Neeson plays Matt Turner, an American living in Berlin who receives a phone call while taking his children to school, as a mysterious voice tells him that the car is loaded with explosives that will detonate unless he does what it says.\n\nThis is third remake of Spain's ¨El desconocido¨ (2015) by Danny de La Orden with Luis Tosar after Germany's ¨Steig. Nicht. Aus!¨ (Don't. Get. Out!) (2018) by Christian Alvart with Wotan Wilke Möhring and South Korea's ¨Balsinjehan¨ (2021) but the first to use the original's English title.\n\nFurthermore , displaying a colorful and luxurious cinematography by Flabio Martinez Labiano, as well as a stirring and pulsing score Harry Gregson-Williams . This increasingly potent thriller was compellingly produced Jaume Collet-Serra, Mercedes Gamero, Juan Sola. The motion picture was well directed by Nimród Antal. He is best known for writing and directing the Hungarian-language film Kontroll (2003), which won numerous awards, including the Award of the Youth at the 2004 Cannes Film Festival and the Golden Hugo at the Chicago International Film Festival, as well as a European Film Award nomination for Best film . Antal's first American feature movie , Vacancy (2007), starring Kate Beckinsale and Luke Wilson, was released on April 20, 2007 getting sucess enough. His second American film, Armored (2009), was released in December 2009 and with American star-studded cast. Nimród Antal was hired for ¨Armored¨because producers enjoyed Antal's earlier films ¨Kontroll¨ and ¨Vacancy¨ and subsequenly filming a nice sequel : ¨Predators¨. This remarkable and decent action film will appeal to thriller buffs and fans of the big stars appearing here and there. Well worth watching. So it's worth seeing , specially for the Liam Neeson fans."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "AfricanBro",
        "review_rating": "2",
        "review_title": "Hotel TV content.",
        "review_detailed_main": "I think I hate this movie primarily due to two reasons: my love for Liam Neeson and the stark disparity between the film's promised premise and its actual execution. It was going for less action and more a gripping, high-stakes thriller but sadly, even in that aspect, it falls short. While I wouldn't go as far as labeling it horrendous, it's not worth a trip to the cinema, despite having done so myself lol. It's reminiscent of the kind of film you might casually watch on daytime TV to pass time in a hotel room. It reminds me of Dstv in Africa, when we were traveling or on holiday and the hotel/motel tv only had like 10 channels all with poor signal... this is the kinda thing you'd find playing on the movie channel.\n\nBlink and you might miss it, but the opening credits show it's based on another film \"Retribution El Desconocido,\" which excited me even though I haven't watched the original, but because the comparison with \"The Departed\" and \"Infernal Affairs\" crossed my mind, assuming that if the original movie warranted a remake, it must have been great, suggesting the remake had potential, I thought. Unfortunately, this wasn't the case. I didn't really know anything about the movie other Liam Neeson is in it, plus it was a Regal mystery movie too.\n\nThe film is really just a deterrent of raising kids later in life. I always say that your kid's potentially having their rebellious teenage phase at while you're 60 would suck ass. While it's not universally true, Zach, the son in the movie, really resembles kids from my high school days who had similar behavior due to having older parents, which made disciplining hard. That's what stood out to me in the entire movie.\n\nI didn't like that the the most unsubtle hints were being dropped with all the TVs on the news channels at the start. The hints couldn't have been less subtle, yet the characters somehow managed to ignore them completely.\n\nThe explosions were cool, probably the only thing I enjoyed about the movie. They reminded me action sequences from movies from the 2010s. However, the movie heavily relied on Liam Neeson, even though he didn't have much to work with, so not even he could save this. If you've watched any of Neeson's other movies, this one might leave you feeling deceived, as it hints at possibly following the familiar pattern of his iconic \"I will find you, and I will kill you\" action flicks, but takes a different direction instead, despite him delivering similar threats.\n\nNothing about the movie was convincing. Even during the most tense moments, the emotions failed to translate properly, leaving me disengaged from the plot, it lacked that tense, suspenseful, edge of the seat vibe. The actors' performances lacked conviction, and the unoriginal dialogue in the script only exaggerated the issue. The plot itself wasn't believable, heavily relying on characters making illogical choices. Particularly the police, they could've asked questions, but they were way too easily and quickly convinced he was the villain not the villain. The car chases were whack as well, expecting us to believe that dozens police cars were incapable of stopping a single SUV. The entire execution appeared sloppily put together. The decision to involve his unsupervised wife as he was a suspect seemed questionable too. The police investigator seemed perpetually befuddled and uncertain, displaying some of the weakest negotiation skills and poker face I've seen in a movie. The kid was frustrating, something I hate about a character is when, despite others risking their lives to save them, adamantly refuse the help they're being given. The only potentially convincing twist that could have saved the movie for me would have been if it was revealed that that the lead detective was actually complicit and working for the opposing side.\n\nAnyway, as I said earlier it's not as horrendous as I'm making it out to be but I still think it's less than mediocre and not worth a trip to the cinema."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "marcels75",
        "review_rating": "7",
        "review_title": "With kids like those... I would step out....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "rotini-52586",
        "review_rating": "1",
        "review_title": "God Awful !",
        "review_detailed_main": "Definitely has to be the worst movie of the year so far holy crap talk about a generic script and just horrible acting brats in the backseat it was just horrible I guess he really needs milk money or something wow. Liam, you stooped to the lowest of all Lows. Never thought lLiam would stoop this low. Just a horrendous acting job and the voice the voice oh it sounds like the saw voice is it supposed to be scary oh my God. Why does Hollywood make this crap just an outrageous attempt to continue Liam's career but I won't be watching anymore of his movies just a horrible horrible movie I wouldn't even call it a movie avoid it all costs."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "robloxworld",
        "review_rating": "6",
        "review_title": "The bomb that exploded was the movie's plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "KatoC",
        "review_rating": "2",
        "review_title": "Big Hollywood in Little Germany",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "saberhamza",
        "review_rating": "8",
        "review_title": "Not a masterpiece, but Very enjoyable",
        "review_detailed_main": "I'm intrigued by the disparity in ratings that this movie has received. In my view, this 1-hour 30-minute cinematic experience was nothing short of enjoyable from start to finish. The relentless cascade of events held my attention captive throughout, leaving no room for even a moment's boredom. What struck me particularly was the way the film delicately delved into the realm of drama, shining a poignant spotlight on the far-reaching consequences of divorce, particularly when it comes to its impact on innocent children.\n\nAs someone who values the emotional resonance of a movie, I found that this narrative hit the mark. The characters' struggles felt real and relatable, allowing me to connect with their journeys on a personal level. When I emerged from the theater, a sense of contentment enveloped me, confirming that this film had succeeded in its mission to captivate and entertain. While opinions on films can certainly be subjective, I believe it's essential to recognize the merit of a production that manages to leave its audience not only entertained but also contemplative about the nuances of life."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "stevendbeard",
        "review_rating": "6",
        "review_title": "Predictable But Watchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "leftbanker-1",
        "review_rating": "1",
        "review_title": "Just Watch the Trailer and Save Yourself 1h31m of Stupid",
        "review_detailed_main": "Retribution? Why not regurgitation? Inflammation? Stupefaction? Irritation?\n\nGod must be on the phone with this guy or how else would he know exactly what is going on at every step in this mess of a movie? And there are bad kid actors in it if a terrible plot that makes little sense isn't enough for you.\n\nAnd on top of all of that rubbish, it's a remake of another bad film. And it was done before that with another stupid movie, Speed. We are really at a low point in the film industry.\n\nAnd isn't this guy a little old to be playing the action hero, maybe a lot old?\n\nI can't believe this thing has such a high rating at 5.3 thus far."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "bostonct",
        "review_rating": "5",
        "review_title": "Worst Writing dialogue for Liam, Deserves Much Better",
        "review_detailed_main": "Shallow is the best word I can come up with. This is the worse character script writing I've seen for any Liam film but it is still a passable film (barely). Lots of stereotyping about the kids, wife, cops and much of the supporting cast. A few holes in the storyline, too. However, if you're a Liam fan, you'll get through it. The editing was actually pretty good but there are lots of gaps that have you wondering \"what's taking so long?\". I think this could have been 2-3 stars better with some decent writing and less predictability with many of the characters. It was just very shallow and Liam deserves a lot better."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "markthepig-94874",
        "review_rating": "6",
        "review_title": "A Watchable but Unoriginal Film",
        "review_detailed_main": "Retribution is a 2023 American action thriller film directed by Nimród Antal and starring Liam Neeson. The film follows Matt Turner (Neeson), a financier who is threatened by a mysterious bomber while driving his son and daughter to school.\n\nThe film is watchable, but it feels like a remake of a Korean movie I've seen before. The plot is almost identical, and the acting is typical Liam Neeson.\n\nNeeson is a good actor, but he's been playing the same role in the same type of movie for over a decade now. It's starting to get a bit stale.\n\nThe supporting cast is also decent, but they don't have much to do. The film is all about Neeson's character, and everyone else is just window dressing.\n\nThe action sequences are well-choreographed and exciting, but they're also very predictable. If you've seen one Liam Neeson action movie, you've seen them all.\n\nOverall, Retribution is a watchable but unoriginal film. It's perfect for a rainy day rental, but it's not something I would recommend going to the theater to see."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "GZahn",
        "review_rating": "7",
        "review_title": "Average passtime with a terrible ending",
        "review_detailed_main": "The movie itself isn't all that bad - it is catchy, rewards you with some tension and doesn't rely too much in hold-your-breath action sequences, as most of the present day thrillers do.\n\nThere are two issues, though.\n\nFirst, and less troublesome, the plot. Nothing new, something of a mashup of Speed,Crank, and Phone. Booth. Really.\n\nSecond, and much worse, is the development towards the end - and the end itself. When the movie reaches its final sequences, there are plenty of moments when Liam Neeson's character could escape the situation, but he doesn't. The police response makes no sense at all. And worse, MUCH worse, is the ending, where essentially they forget all about how gravity works - the idea that it pulls you down, not sideways, and produce a completely unsatisfying end that leaves you with that feeling that you've just thrown 90 min of your life away (the worst thing is: this could be easily avoided, the director just decided to add a minute of tension, while making Newton and Galileo shake in their graves)."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "brentn",
        "review_rating": "3",
        "review_title": "Another cookie cutter Neeson flick.",
        "review_detailed_main": "Although better than his last few ventures like Memory, Blacklight or The Marksman, Liam Neeson's current outing is not that much better. In the vein of Commuter or Non-Stop, Neeson is once again embroiled into the centre of a mystery that has him pegged as the villain by an unknown assailant threatening his life and other innocents around him. However, the former films had better characters, pacing, action, execution and above all else....an intriguing and well guided story. Retribution just seems lazy in the acting department aside from the daughter who was the most believable and least annoying. Everyone else just seemed to be saying their lines or even phoning them in. The story was just too weak with no twists or any big reveals. The female characters for the most part were so infuriating while the rest were just dumb. There was no outsmarting or witty actions taken by the protagonists, there was no real struggle in the back and forth department to make me think that any of the main characters posed any sort of threat or challenge. The villain himself was not intimidating nor menacing at all and essentially just a voice. That and a lack of action or any real suspense left this feeling like a mediocre attempt at a thriller that didn't feel believable. The only saving grace for this movie was that it was compacted into 90 minutes so everything happens quite quickly and the ball just kept rolling after that with no real down time. The explosions were also very well done, realistic and well captured. All in all I didn't feel that invested aside from just wanting to see how it unfolded which is something but not much else."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "imseeg",
        "review_rating": "6",
        "review_title": "Suspenseful start, but rubbish ending. Liam Neeson still rocks though, but this is not his best movie.",
        "review_detailed_main": "I am a big Liam Neeson fan and I have seen ALL of Liam Neeson's movies and this one is okay (ish), but certainly not his best, not because Liam isnt cool, calm and collected anymore (HE STILL IS), but because of some ridiculous plot turns.\n\nThe bad: this movie starts out allright, storywise speaking, because there is a contineous suspense and mystery about WHO is trying to kill Liam Neeson in his car. The first 45 minutes are quite supsenseful and thrilling, but...\n\n... (unfortunately) there are some plot turns, (which I wont spoil), that make no sense whatsoever and from then on this movie kinda deteriorates quickly. Ah well...\n\nStill a reasonably nice watch for the Liam Neeson fans and the fans of this action genre. Dont expect ANY originality or quality though and it'll (barely) do as another (partly) enjoyable and thrilling Liam Neeson flick..."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "colinsiterecruitment",
        "review_rating": "1",
        "review_title": "I want retribution on whoever wrote this crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Anurag-Shetty",
        "review_rating": "10",
        "review_title": "A refreshing take on the Liam Neeson action movie.",
        "review_detailed_main": "Retribution tells the story of a a bank executive named, Matt Turner(Liam Neeson). Matt, his daughter Emily Turner(Lilly Aspell) & his son Zach Turner(Jack Champion) find out that there's a bomb under Matt's car seat. This deadly bomb will explode if they stop & get out of the car.\n\nRetribution is a mind-blowing film. It doesn't deserve all the negative reviews. Director Nimrod Antal has given us a movie that strays from the typical ingredients of the classic Liam Neeson action project, the likes of which we've seen, since the iconic Taken(2008). Don't expect tons of hand-to-hand combat sequences. The majority of Retribution takes place in the car. The set pieces are fantastic. The suspense is maintained brilliantly, throughout the course of its runtime. Liam Neeson is spectacular as Matt Turner. Neeson portrays a wide range of emotions, with ease & panache. Lilly Aspell is phenomenal as Emily Turner. Aspell keeps going from strength to strength as a young actress & has a long & bright future ahead of her, in Hollywood. Jack Champion is outstanding as Zach Turner. Noma Dumezweni is great as Angela Brickman. Embeth Davidtz is awesome as Heather Turner. Matthew Modine is excellent as Anders Muller. The supporting cast is perfect. Retribution is a must watch for Liam Neeson fans. Go in with an open mind about what to expect & you will have a blast!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "george.schmidt",
        "review_rating": "6",
        "review_title": "Disappointing to say the least.",
        "review_detailed_main": "RETRIBUTION (2023) ** Liam Neeson, Noma Dumezweni, Lilly Aspell, Jack Champion, Embeth Davidtz, Matthew Modine. By-the-numbers suspense crime drama with Neeson as a family man facing an extreme crisis - his car is fitted with a bomb and he must save his children in the process before time runs out. The set pieces are vastly predictable and has the feel of a direct-to-video vibe with Neeson looking painfully strained to do this subpar auctioner with surprisingly practically no ass-kicking as which he's been accustomed to in his later career choices. Disappointing to say the least. (Dir: Nimrod Antal)"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "oboylemail",
        "review_rating": "2",
        "review_title": "Really really poor",
        "review_detailed_main": "This film was poor on every level. Even the CGI was poor and there is no excuse for that in 2023. Police standing 20 feet from a car full of C4. Usually some thought is put into anything with Neeson in it but this is weak on every level with holes all over the plot. This could have been a lot better but I think Neeson is just on the money train now and like Mel Gibson and Nicholas Cage, they will show up in any old shite. Cinematography is dreadful too. This is a B movie at best. It takes a much better story line to pull off the single venue/scene type movie. It needed to be filled out a lot more."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "yeargrad",
        "review_rating": "1",
        "review_title": "Zero retribution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "sunildaswaney-63642",
        "review_rating": "7",
        "review_title": "GOOD MOVIE",
        "review_detailed_main": "A good,tension filled thriller that keeps you the viewer involved from start to finish. Liam Neeson as always is very convincing in every role and yet again he does the same. His movies are always very engaging and this one does the very same,keeping the viewer guessing as to what will happen next.\n\n7/10 Ps. Recently i have noticed on a very regular basis,especially in American based movies(&this film)the children being extremely rude and very very insulting towards their parents who for reason or the other seemed to be totally incapable and/or unwilling to address the matter in the correct fashion. New way of life in the US?"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Xavier_Stone",
        "review_rating": "1",
        "review_title": "Bomb in a vehicle for ransom. How unoriginal.",
        "review_detailed_main": "And this is a remake which makes it even worse. A writer and director who only have a history of making poor films decide on a remake of a movie that's been done to death already.\n\nThere are several scenes which are going to make most of the audience cringe and annoyed, and basically all the dialogue from any of the two kids.\n\nLiam and his wife have a few scenes, but it's mostly talking on the phone for the entirety of the film, which makes it even more boring.\n\nNot much else that you haven't seen before or can't predict. A few plot holes and some terrible police work.\n\nOverall, this is a stinker 1/10. Just annoying to watch."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "jacoll1356",
        "review_rating": "6",
        "review_title": "It is worth a watch",
        "review_detailed_main": "In my personal perspective, it seems that films starring Liam Neeson often exhibit a recurring pattern in terms of their plotlines, action sequences, the intense and determined countenance of the lead character, as well as recurring dialogue themes. Furthermore, I've grown somewhat fatigued and angered by the recurring theme in movies where children consistently display disrespect towards their parents.\n\nHowever, despite these familiar characteristics, the movie, Retribution, much like many of Mr. Neeson's previous works, managed to capture my attention and keep me engaged for about 45 minutes then it became dumb, in my opinion. If you like action and some suspense, then it might be worth a watch. However, I do acknowledge that some viewers might not be as inclined to watch it, given its similarities to Neeson's previous films."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "gehete-40949",
        "review_rating": "2",
        "review_title": "forced",
        "review_detailed_main": "I do not even want to address the generic kidnapper/hostage plot, liam neesons protective father figure badass action moments, the dialogue or the acting. Because it is all we have seen before all neatly packaged lovelessly into a 2 hour generic movie. It feels like none of the actors present want to be there. They seem to be just going through the motions to get a paycheck. Especially liam neeson who is one to one playing his taken role. Reviews usually need a certain character limit so let me just say this. There is nothing to say about this movie besides that it is a waste of time. No love was put into this. Shame on you liam."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "MiloSuperSpesh",
        "review_rating": "7",
        "review_title": "Predictable b movie remake of speed / phone booth but in a car",
        "review_detailed_main": "From the outset you're probs going to be routing for the villain to blow up these annoying kids and absent angry father figure.\n\nAs far as production value goes it's pretty high but pushes the realism a bit too far later on.\n\nLiam didn't stretch his acting chops much for this one, no must see one liner here.\n\nSupporting cast of the kids / wife do a good job with their scenes modine however just lacked in all departments.\n\nEveryone else is also meh and by the book.\n\nAs for the ending not that hard to work out about half way through.\n\nWatchable for liam if you are a fan other wise skip it and be safe in the knowledge you're not missing out."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "fjvthe",
        "review_rating": "5",
        "review_title": "Uhhh... I don't really know how to feel...",
        "review_detailed_main": "When I walked out of the theater I almost felt... empty... but I don't wanna say that the movie is bad, but... then again, I don't wanna say the movie is good either. It's your standard Liam Neeson thriller (with a little less action), but has the ability to keep you on the edge of your seat throughout. Luckily, the movie is only an hour and a half long, so it's not excruciatingly long. The main twist of the movie was sort of surprising, but at the same time made sense in the grand scheme of things, so I guess it could be considered 'predictable' depending on who you ask. I guess at this point I'll just throw it smack dab in the middle. As a I wrote before, not good, not bad. 5/10."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "ykjdh",
        "review_rating": "8",
        "review_title": "We're not talking masterpiece here but it's decent",
        "review_detailed_main": "I see reviews where folks are taking this movie way too serious. To each their own but we are talking about an action movie taking place in car being chased by a mysterious villain. Who the villain is something you'll need to find out yourself but at 90 minutes, this little action flick won't disappoint.\n\nLiam neeson is old and it shows so probably time for him to skip these kinda movies but he's got bills to pay so here we are. This nice little compact action movie delivers on the action. The story line can be far fetched but this isn't a documentary you're looking at. This gave me a Speed vibe with a geriatric dude. Ignore the hate see this one for yourself."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "SeniorInvissible",
        "review_rating": "7",
        "review_title": "Can't understand the negative reviews",
        "review_detailed_main": "I almost didn't watch this movie because of the numerous negative reviews. However I found it to be quite an interesting flick. Yes it's not Liam Neeson in Batman Begins or Taken but it's not as near as bad as some make it out to be.\n\nIt's an interesting thriller about being forced to make certain actions because a bomb is under his seat. Oh and his kids are in the car which makes it much more interesting.\n\nIs it the best movie? -> no. But it's certainly not worth a rating of 3 or 4 that so many gave. I thought this movie is worth 6.5 so I gave it a 7. Yes I'll advise you to watch it if you like interesting thrillers."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "sadavis2279",
        "review_rating": "5",
        "review_title": "I knew it was gonna be bad... but",
        "review_detailed_main": "It's not a great movie by any means. I did not know walking into this movie it was a remake, but I sure hope the original was better. But what this movie lacked in dialogue, acting ability, characters, it made up for in story.\n\nThe overall plot of the movie is good. I love a good low budget thriller, and that's exactly what this was. Liam Neeson had to be this movies biggest expense, because everything was shot in a Mercedes Benz (btw this movie did not make me want to buy that car). The story was not completely predictable and it had some good moments that were fun to watch in a theatre.\n\nBut that's it. Other than that, the acting is terrible. The dialogue for the first 15min of the movie felt like it was written by AI and I almost left. And every character is as bland as an off brand cereal from Walmart.\n\nListen, if you like Liam Neeson thrillers, go see this, but don't expect anything spectacular. It will entertain but it does not go beyond its surface level plot line."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "flaws in the writing",
        "review_detailed_main": "Matt Turner (Liam Neeson) is a hedge fund manager with partner Anders Muller (Matthew Modine). Both his work life and family life are in trouble. His wife Heather (Embeth Davidtz) insists that he take the kids to school. While driving there, he gets a call from an unknown phone stashed in his car. The caller claims that there is a bomb under his seat.\n\nThe first thing I would do is to stop the car and gets the kids out of the car. The initial call only claims that there is pressure plate bomb under his seat. It is a flaw in the writing. The first call has to threaten the kids as well. The writing flaws continue, both big and small. When the train incident happens, I had hoped that it wouldn't reveal what it eventually reveals. It's too obvious. Not only is it contrived and too convenient, it also makes Matt look dumb. That's the other flaw in the writing. The dialogue is horrible with people asking questions that don't need to be asked and having conflicts when there are bigger issues. The writers are trying to heighten the tension, but all it does is to grind the story flow down. This movie wants to be a smart, high tension thriller. When it's not smart, everything else falters."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "noshouse",
        "review_rating": "7",
        "review_title": "An old trope, but having Neeson as the ultimate dad on the surface is thrilling.",
        "review_detailed_main": "If you've seen Spain's 'El Desconocido' (2019) and Korea's 'Hard Hit' (2021), then the plot of this movie, to be honest, didn't grab me from the trailer because it's an old trope. But the only real attraction here is Neeson as the ultimate dad. In terms of age and experience, he's probably the world's toughest grandpa. Returning to this film, firstly, the plot revolves around the same premise mentioned in the trailer: there's a bomb in the car, and they can't get out. Secondly, the targets of the explosion are people who have a deep friendship with Neeson. Thirdly, all the tension and struggle involve children on the same car. What makes it somewhat different is that in Neeson's previous movies, there was always that powerful line, 'I will find you,' and the endings were about him punishing the bad guys. Unfortunately, this film lacks that heroism and doesn't have the emotional depth of Korean star 'Woo-jin Jo."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "trevorthoenen",
        "review_rating": "2",
        "review_title": "The worst movie of 2023 so far.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "j0hn22",
        "review_rating": "7",
        "review_title": "That's a nice action movie",
        "review_detailed_main": "First of all, when I first watched the official trailer of the movie I really liked it and I was so hyped about it. Eventually, it was as good as I had imagined and I really enjoyed it. The plot of the movie was very interesting and mysterious. Sadly, the storyline wasn't very well written, nor well-explained (especially, the ending) and it was kinda simple. The characters were very interesting, well-developed and kinda likeable. Also, the casting of the movie was nice and their acting was descent. Gladly, it was a very intense movie, action-filled and there were too many epic car chase scenes. The killcount of the movie wasn't bloody, at all and most death scenes were done off-screen, so nothing explicit was shown. Moreover, the killer reveal was kinda unpredictable, but it wasn't very well-explained, so I didn't really enjoyed it. Overall, \"Retribution\" was an enjoyable action film, adventurous, fast-paced and I would definitely recommend it to my friends."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Prismark10",
        "review_rating": "4",
        "review_title": "Retribution",
        "review_detailed_main": "Retribution is one of those low budget bottle movies. It is almost entirely set in a car. The film is a remake of a Spanish movie El Desconocido, which itself was seemingly inspired by Speed.\n\nLiam Neeson stars as Matt Turner. A hedge fund manager in Germany which is in serious trouble.\n\nWhile taking his annoying kids to school, Turner gets a phone call from an unknown caller telling him there's a bomb in his car. He needs to keep driving and follow a set of instructions or else his car will be blown up.\n\nTurner acquiesces but his annoying kids are slow on the uptake. Turner knows that he is being set up and the unknown person is after the millions he has stashed in a secret bank account in Dubai.\n\nRetribution is an absurd movie. The cops think Turner is the villain behind it all. There is no shock in the reveal. It is dumb and Neeson makes it better than it should be."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Movie-Dood198027",
        "review_rating": "7",
        "review_title": "This was NOT bad",
        "review_detailed_main": "This movie is over hated , it seems like people nowadays just want to hate on any low budget movie or a non sequel movie but to my surprise that was not as bad as people said.\n\nNow I initially thought the movie would be bad since the reviews and the meta score is so low but the movie turned out to be quite great and gripping to be honest , the plot here is simple yet effective , a bomb strapped into a car and do what you are being told to , it's not something entirely new but the plot in my opinion was kinda good simply because of how GOOD Liam Nesson's acting is he is a great actor in my opinion and he did a good one here.\n\nThough there are some couple of flaws that I didn't like / didn't get , first of all\n\nMatt and Zack's relationship starts toxic for no apparent reason and there was a scene where Zack called his father \"Matt\" which was very disrespectful but the reaction that Liam messing made wasn't realistic because of someone else does that they will be punished hard but this time Matt just shrugged it off\n\nSecondly some parts of the movie were kinda stupid SPOILER ALRT:\n\nWhen Matt reaches the police station and they are disassembling the bombs from the backseats the villain did not do anything it's like he froze in time or something which does not make sense.\n\nBut overall the movie wasn't bad the plot was kinda thrilling and intriguing with some twists here and there which was pretty good , now the main reason I've watched this because I saw a little footage of this movie and my brain decided that I should watch it fully so I did and it was pretty good 7/10 !"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "tinyfalcon-44765",
        "review_rating": "4",
        "review_title": "Boring and unsuspenseful. Don't waste your money and time.",
        "review_detailed_main": "I went into this movie with low expectations from the trailer, which is why it didn't surprise me that this movie was just not that good. The acting is sub-par, the villain is ridiculously dumb, and the ending is abrupt.\n\nYou can clearly tell that this movie was done by old men because the kids' characters were stereotypical and stupid. The edgy rebellious teen and the young naive girl roles are put there just so that they have a longer cast. You could take them out of the movie and it would be exactly the same. Basically every character in this movie was some sort of stereotype, with little to no character building or arc whatsoever.\n\nThe bad guy was just ridiculous, just another stereotypical overly arrogant guy with a voice changer. Some of his lines had me cringing and wondering if it was satire before realizing that it was supposed to be a genuine line. No one who was trying to hold people hostage would do the things and say the things that this guy said.\n\nI will say that while the acting from Liam Neeson and Matthew Modine wasn't terrible, it definitely felt half hearted. The twist near the end wasn't too bad either, and I was tense for a couple rare moments in the movie.\n\nOverall, a boring movie that had me scrolling IMDb and being more interested in the question \"what do I know them from\" than the actual movie and actors themselves, thereby ruining the point of this movie: to be suspenseful and to pull you in. Don't waste your money and just go see something else. If you really wanna watch it, wait for it to come out on a streaming site or some random pirate site, so that you waste your time at home instead of out at a pricey theater."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "calcat-75546",
        "review_rating": "8",
        "review_title": "Great suspense, terrific resolution",
        "review_detailed_main": "I don't understand the hate for this movie. It's a tense, fast-paced thriller with believable characters and situations.\n\nLiam Neeson delivers, as always. The characters of the children are not horrible brats, as are in so many films now. The wife is pretty much only a sketch, but the important characteristics of all the characters are filled in enough, at the beginning of the film, to satisfy any need for back story.\n\nIt's an action-filled adventure, that drives quickly to its resolution. Some have commented that the \"third part\" seemed flat. I do wonder what movie they might have been watching - not this one.\n\nI have a theory. I've noticed with movies made in Europe, lately, that there are a *lot* of bad ratings. I figure it's because some people can't wrap their heads around a European setting and vibe. I also consider that perhaps to some people, all European movies must be like the Bourne series in order to satisfy them. *shrug* I did notice in the credits that there is shared production with some Canadian, Quebecois organizations. To some people, this will automatically deduct another couple of points from their rating.\n\nI try to understand why accomplished, really enjoyable films like this get so much hate. I suspect trolls here, as in so many social media interactions, now.\n\nIf a film gets high ratings and the review seems reasonable, give the film a shot and find out for yourself."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "mandagrammy",
        "review_rating": "7",
        "review_title": "Typical Action Thriller",
        "review_detailed_main": "Although there is not really anything new about this action thriller, it still holds up well enough for its genre. I'm not sure why there are so many very negative reviews. I suspect many of those viewers are jaded by the realism they expect to find in films nowadays. There is not a lot of realism in this film's plot or action, but it still holds enough excitement to make it worth watching. There is actually only one time that the lack of reality bothered me, and that involved the lead detective and her reaction when she learns the truth about a bomb under the lead characters car seat. Other than that, I just sat back and enjoyed the ride, while looking forward to the reveal of who the villain really is."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "churchillthecl",
        "review_rating": "1",
        "review_title": "Man, what a let down",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "rsad",
        "review_rating": "2",
        "review_title": "This is why Hollywood has a Problem ... a BIG one!",
        "review_detailed_main": "AfricanBro wrote a beautiful and highly accurate review. Spot on and on so many levels. The one thing he didn't ruin (and nor will I) is how transparent the writing was, so as to enable anyone with any experience, the ability to identify the villain early into the film. I have enjoyed many of Liam's movies in the past ... unfortunately, stick a fork in him ... he's done! I'm not sure if this film is a precursor to what we can expect for the balance of 2023 and into 2024. One reviewer went as far as to suggest this screenplay was written by Chat GPT. It seems the exception when we watch something that is unique and well written. Are we so discerning and in need of escape that we have come to accept re-releases, versions 3,4 and 5 .... true stories that have been adapted, rather than creative, thought provocative and unique new writing that was apparent in the film releases of the 80's, 90's and 2000? Looks like it might be the year of re-runs. Films that have stood the test of time, whether they be action, drama or comedy. Damn."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "arsalanweb",
        "review_rating": "6",
        "review_title": "A Mixed Bag of Ambition and Ambiguity",
        "review_detailed_main": "Retribution (2023) is a passable action thriller with Liam Neeson in the lead role. Neeson plays Matt Turner, a bank executive who receives a bomb threat while driving his children to school. The caller tells him that his car will explode if he stops or gets out.\n\nTurner is forced to follow the caller's instructions and drive around the city while trying to figure out who is behind the threat and how to save his family. The film is mostly set inside the car, which creates a sense of claustrophobia and suspense.\n\nNeeson gives a solid performance as Turner, but the supporting cast is less developed. The plot is also somewhat predictable, and there are a few plot holes. However, the film does have some exciting action sequences, and the suspense is maintained throughout.\n\nOverall, Retribution is a decent action thriller that is worth watching if you are a fan of Liam Neeson or the genre. However, it is not without its flaws, and it is unlikely to stick with you long after the credits have rolled.\n\nRecommended for: fans of Liam Neeson and action thrillers\n\nNot recommended for: viewers looking for a film with a complex plot or well-developed characters."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "benjaminskylerhill",
        "review_rating": "5",
        "review_title": "Competent but kinda dull",
        "review_detailed_main": "I went into this not knowing anything about it; I didn't know it was a remake nor what the plot is. Turns out, it's a contained thriller that's quite well-paced, managing to wring enough tension and suspense out of its simple premise with strong editing.\n\nNeeson and some of the other cast members really do give it their all, and they bring life to the film that makes up for the bland direction and cinematography.\n\nWhile most of the time the movie is compulsively watchable, what really holds it back is the script. It's bad.\n\nIt's a strange kind of bad that really does feel like this screenplay was generated by ChatGPT. Nearly all of the dialogue is stilted and generic, and the story moves kind of haphazardly, as though a machine were calculating what was the next appropriate action movie plot point to throw in next.\n\nI guess it's better than many of the other beige action flicks Neeson has churned out over the years, but it's still far from good."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Just-A-Girl-14",
        "review_rating": "7",
        "review_title": "A typical Liam Neeson action thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "rebeccagaskell-92521",
        "review_rating": "1",
        "review_title": "Should be called 'Irritation'",
        "review_detailed_main": "Without a doubt absolutely THE worst acting I have ever seen from Liam Nelson. Totally flat like he was reading off an auto cue and couldn't be bothered. Literally it was embarrassing at times. The phone conversations with his wife during the car scenes were uber cringe. Come on Liam put some effect into it mate. I've seen all his Taken films and they were really good, but this was like he was on day release from acting school and was trying out 'how to be a real actor' and it didn't go well. Do yourselves a favour and just watch the trailer a few times. Don't waste 1 1/2hrs watching the whole film unless you've got some boring ironing to do and you want to force yourself to get it done quicker lol."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "stevelivesey-37183",
        "review_rating": "6",
        "review_title": "Decent little thriller",
        "review_detailed_main": "A remake make of the Korean or maybe Japanese action thriller Hard Hit.\n\nI am not going to spoil this for you by telling you the plot. Suffice to say if you like all the Liam Neeson action thrillers that have come before and are too numerous to mention then I see no reason why you shouldn't like this.\n\nNeeson is his usual gruff self. The plot is decent enough and the ending quite satisfactory. I am not sure why they filmed this in Berlin or with quite so much CGI but, hey, there are reasons for everything. It probably would help you, as it did me, to not know anything before you see the movie. As a result I found it a decent little roller coaster ride."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "trinaboice",
        "review_rating": "4",
        "review_title": "This is the kind of thriller you'll probably only watch once.",
        "review_detailed_main": "IN A NUTSHELL: A bank executive receives a bomb threat while driving his children to school that his car will explode if they stop and get out. Who's really behind it?\n\nThis is the third remake of a similar film made in Spain, Germany, and South Korea.\n\nThe film was directed by Nimrod Antal.\n\nTHINGS I LIKED: I've been a big Liam Neeson fan for many years. He does a good job with this, although the script doesn't give him a lot to work with. It played like it was written by ChatGPT. Putting him inside a car for the bulk of the movie is a good solution for an action star who is aging.\n\nThe rest of the cast includes Matthew Modine, Embeth Davidtz, Noma Dumezweni, Jack Champion, and Lily Aspell.\n\nDuring the opening credits, we see a bomb being assembled. We don't learn who did it until the last few minutes of the film. You definitely feel the suspense throughout the film.\n\nWe get to visit Berlin, Germany where the movie takes place. I always think it's fun to see the streets and buildings in other countries.\n\nThe audience doesn't know for sure whether Liam Neeson's character is a good guy or a bad guy for the majority of the movie, keeping the audience guessing.\n\nThe suspense is non-stop.\n\nTHINGS I DIDN'T LIKE: One of the appeals of Liam Neeson's movies is watching him kick bad-guy butt. He does none of that in this film.\n\nThis is the kind of thriller you'll probably only watch once.\n\nThe film is suspenseful, yet frustrating at the same time because Liam Leeson's character doesn't communicate well with other characters and doesn't try to figure out how to outmaneuver the phone caller.\n\nThe dialogue is terrible.\n\nThere are some serious holes in how the villain was able to actually do what was done.\n\nThe kids in the movie are annoying with their constant bickering that it's hard to feel endeared to them or anyone in the film, really.\n\nI was surprised by how wooden some of the acting was.\n\nThe title of the movie doesn't match the content of the movie other than to serve as a red herring.\n\nNo humor to balance the serious drama.\n\nTIPS FOR PARENTS: Some German is spoken with English subtitles in only a few scenes.\n\nBombs explode in cars, killing people.\n\nSome profanity."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "keithhatton",
        "review_rating": "8",
        "review_title": "Very Entertaining Film",
        "review_detailed_main": "I don't know why there are so many negative views. Retribution is a thrilling and suspenseful action film that will keep you on the edge of your seat from beginning to end. Neeson gives a powerful and believable performance as a man who is pushed to his limits. Director Nimród Antal does a masterful job of creating a sense of tension and suspense. The film is also well-paced and never gets boring. Retribution is a must-see for fans of action films and thrillers. It is a film that will stay with you long after you watch it.\n\nExcept for one thing. It's only 90 minutes long. You'd think they could have added 5 or 10 minutes to make a better ending."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "lesley_65",
        "review_rating": "6",
        "review_title": "A Good Old Fashioned Thriller",
        "review_detailed_main": "I really enjoyed this movie. I found it tense, engaging and mostly believable. I liked the main characters, the cinematography, and the Berlin backdrop which made a nice change from the usual American settings. I also liked the satisfying twist near the end which took me by surprise. Liam Neeson was brilliant as always.\n\nI was interested to read the overwhelmingly negative reviews on here, most of which took exception to the many plot holes and the predictability of the outcome. I suppose if I had been analysing the movie I might have seen some of these, but my mind went into another mode: like I was really there, and just couldn't think clearly. So the movie kept me immersed and gave me an hour and a half of enjoyable entertainment."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "liverettchristy",
        "review_rating": "2",
        "review_title": "Pure cliche garbage",
        "review_detailed_main": "I think this is an example of chat GPT writing a script . I only hope the original was better cause this was really substandard . Not only did Liam Neeson never get out of the car he kicked zero butt. The acting from the kid characters was middle school drama troupe, his wife was unnecessary (miss honey from Matilda didn't deserve that) the actress playing the \"whatever law enforcement lady she was supposed to be was adequate but still a predictable trope. Matthew Modine is usually so likeable but not here and not just cause he was the villain but because he was a miserably mediocre villain. Oh and the ending really sucks its just abrupt and again, predictable .. and and it sucks that I'll never get that hour and 40 back .. this should've been a Roku movie . The only reason I gave it two stars is two of us spent money to see this .. one each or it would be just one. Don't waste your money just watch taken 1,2,&3 again."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "stefa-69983",
        "review_rating": "1",
        "review_title": "What a waste of time",
        "review_detailed_main": "Please, just please I am begging you all not to watch this garbage of a so called movie. I don't know where to begin? It is so stupid, shallow and pointless. I made a mistake and this a warning to all of you., even if you don't have anything clever to do, and you want to watch this @#%. DON'T!!!! It is better to watch grass grow. Way more interesting!!!!\n\nRetribution\" is a film that completely lost itself in its ambitions and turned into a catastrophe that will remain etched in the memories of viewers, but not for its artistic merits. This feature-length failure, with its unrealistic plot, clumsy direction, and a lack of any profound meaning, deserves nothing but harsh criticism.\n\nOne of the main problems with the film \"Retribution\" is its entirely unconvincing plot. The film attempts to deal with the serious theme of revenge but quickly gets lost in a multitude of disconnected events and plot twists that are simply senseless. Viewers will wonder why the main characters make the decisions they do because their behavior lacks any sense and does not follow pre-established motives or character traits. This inconsistency in characterization and storytelling makes the film nearly impossible to follow.\n\nThe direction of this film also deserves sharp criticism. The camera often wanders without a clear focus, and the editing is incomprehensible, often leaving viewers confused and disoriented. The director seems to have tried to achieve some kind of visual originality, but instead, it achieves only chaos and an inability to follow the film's plot. Additionally, the use of special effects is unconvincing and often comical, further contributing to the film's poor quality.\n\nThe performances in \"Retribution\" are far from impressive as well. The lead actors fail to convey deep emotions or build any authentic connection with the audience. The dialogue is often unnatural and dull, making it difficult for viewers to connect with the characters and their fates. Furthermore, several supporting characters appear without any reason or purpose, further complicating an already confusing story.\n\nApart from the poor execution, \"Retribution\" also suffers from a lack of originality. The film relies on well-worn revenge tropes and clichés, offering nothing new or fresh. The plot feels like it's pieced together from parts of other films, without any authentic contribution or creativity. Viewers will feel like they've seen this story many times before, and often in better renditions.\n\nThe lack of deep meaning or thematic richness also leaves \"Retribution\" feeling empty and unsatisfying. The film tries to convey some sort of moral message or profound meaning but remains shallow and unconvincing. Revenge is depicted as an empty and meaningless act but without any deep exploration or critical analysis of this theme. As a result, the film leaves no lasting impression on the audience and is quickly forgotten once the cinema lights go out.\n\nIn conclusion, the film \"Retribution\" is an endlessly poor cinematic endeavor that gets lost in its ambitions and fails to deliver any meaningful or satisfying content. A weak plot, unconvincing direction, lack of originality, and a lack of deep meaning make this film an unnecessary addition to the world of cinema. Viewers should avoid this film like the plague and instead seek something that will provide a genuine cinematic experience. \"Retribution\" is an empty and unsuccessful attempt at art that will be quickly forgotten, and unfortunately, that's all this film deserves.\n\nSo DONT!!!!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "wrigco",
        "review_rating": "6",
        "review_title": "A generous 6",
        "review_detailed_main": "The best part of this movie was its length - a nice 90 minutes. Any more than that and this review would drop by a star for each additional 5 minutes.\n\nIt starts off interestingly enough. The usual bratty kids being rude to their Father when he unexpectedly picks them up from school.\n\nYawn.\n\nThen he gets the call about the bomb under his car seat apparently rigged to explode if pressure is released and somehow activated by cell phones.\n\nThe so-called dialogue is terrible. Perhaps Liam Neeson said - look, I don't want to learn a whole lot lines for this rubbish - so just give me the same lines with a few variations. Listen to me, It wasn't me, I didn't do this etc etc.\n\nWhy didn't he stop the car and get out when there was no signal in the tunnel?\n\nOther reviews have already covered the terrible \"logic\" so I won't go into them again.\n\nHilariously, one them said it reminded them of a DSTV movie and that's where I watched it."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Jayc1601-643-779107",
        "review_rating": "4",
        "review_title": "Unfortunately... could have been better.",
        "review_detailed_main": "I like most of Liam's movies, but this one falls a bit short with too many things that didn't make sense or could have been much better. Without making this review a spoiler, I'll just say that a lot of the dialogue fell short. Actually, not that the dailogue was bad, but rather that the lack of dialogue in many areas was frustrating. In many places he could have said things that would have help himself and his family, but he didn't say them. And I don't think that was part of his character personality. Overall, I was debating whether to give this movie a 4 or 5, but settled for a 4 because him having the chance to say things that would have helped himself, and not saying them, just was a bit frustrating."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "vincentmasonry",
        "review_rating": "6",
        "review_title": "Better than expect..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "5",
        "review_title": "An Honest Remake, But Too Soft",
        "review_detailed_main": "Retribution (2023) : Movie Review -\n\nRetribution Movie Review: Nimród Antal's action thriller Retribution sees Liam Neeson take the lead role. Based on the Spanish flick \"El desconocido\" (2015), Retribution restores all the original elements but seems too soft for today's audiences. Actually, remaking a 2015 flick that hasn't gotten a high repeat value or universal acclaim wasn't a good idea in the first place, but technically it was a safe bet. The script did not demand a huge budget, long hours, or any transformations, so it sums things up quickly. That's easy, but somebody has said the right thing: \"Easy is boring\". You need something exciting and thrilling just to add one more layer to your decent watch, and the product should land safely. Retribution gets to that decent point, but not to that one extra layer.\n\nRetribution revolves around bank financier Matt Turner (Liam Neeson), who is more busy at work than his family. He thinks everything's alright with his wife, son, and daughter, but it isn't. One day, Matt is off to leave his children at school in a car, and he receives an anonymous call on a cellphone that has been left inside and is told that a bomb has been placed under each of the car's seats, set to explode if any of them leaves their seated position. The unknown caller asks Matt to do everything he says, and as we all know, he wouldn't give easy tasks. From money scams to murder, framing, and destroying one's identity, Matt's life is turned upside down. Can he get it back and save his children?\n\nRetribution is a wannabe revenge drama that hardly has any sensible revenge theories. On the positive side, it is a very engaging hostage drama. You might have seen hostess dramas set in a godown, room, or house, but never inside a car. Retribution scores high in those attributes. One can feel the pressure that's built inside the vehicle and the way those three characters and one horrible voice behave. What goes wrong is the shortening process. The best thing about Retribution is that it's pacy and short, and the worst thing is that it's too short for a complete feature film experience. Predictability is caused by the remake factor, but it wouldn't be there for first-timers. The script has completeness intellectually but is incomplete as a thrilling ride. A little bit of extension to the storyline would have made a good difference.\n\nTalking about performances, Retribution is all about Liam Neeson's acting finesse. This man suits the age, look, and personality of the character, but more than that, it's his own charisma that makes it look better. \"I can't,\" says Matt, dropping his gun. Watch out for Neeson's expression and the situational brilliance provided by him. Noma Dumezweni shines in that one particular scene when she has a conversation with Matt, aka Liam. Matthew Modine will surprise you, despite limited screen space, while Embeth Davidtz underperforms, unexpectedly. The supporting roles of Lilly Aspell, Jack Champion, Arian Moayed, and others are somewhat noticeable.\n\nRetribution's strength lies in its screenplay, even though the storyline is a bit pulpy. El desconocido showed the protagonist in a bad light as a dishonest person, while Retribution is way too mild in presenting the hero. It derives a lot from the sympathetic image of the hero, as we see his children and even the cops being too supportive towards him. It's generous and lovable occasionally-not fully, though. The technical aspects are okay, with a special mention to the background score. Flavio Labiano's camerawork is fine, and Steven Mirkovich's editing doesn't let you have a nap. Nimród Antal's return to the movies after 7 years may be alright, but I still prefer that aggressive Antal from Predators (2010). Moviemaking is far different now, so he must update himself. It's mandatory when you are remaking a so-so one-time film. Retribution is a one-time watch too, but how many people prefer that nowadays?\n\nRATING - 5/10*"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "akshatmahajan",
        "review_rating": "7",
        "review_title": "Enjoyable thriller",
        "review_detailed_main": "For me, the movie was enjoyable even after all the flaws. The story was simple old fashioned car bomb thriller, the screenplay was good as you don't feel bored, the direction could have been little bit more tight but overall director did a good work, the performances could have been a little bit more better as you fail to connect with the characters that much. The parents relationship felt half baked as you don't connect with their emotions. The ending was also abruptly ended with nothing to know what happened next.\n\nYes, the movie was not perfect and easily forgettable but it doesn't deserve so much negativity. You should give this movie a try, you will enjoy it keeping in mind no expectations."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "isaacsundaralingam",
        "review_rating": "5",
        "review_title": "It's almost a decent movie",
        "review_detailed_main": "It's funny how almost all Liam Neeson action movies are pretty much the same thing. In Retribution, Liam Neeson is a hedge fund executive who when tasked with the unusual job of driving his kids to school, gets a phone call from an anonymous man who informs them of a bomb in their car. What his demands are and how they get out of this situation are what Retribution is all about.\n\nSo, all fine and dandy. That sounds like a fun premise. You check the trailer out, that looks pretty fun too. But that's where the \"fun\" ends. This movie ends up being probably the weakest version of the concept imaginable. It wasn't very exciting, and while yes, it did manage to keep our attention throughout, it felt like nothing worthwhile came of it. With bizarrely amateur cinematic choices; from poorly written dialogue, to characters being wholly irrational, to predictable twists and forced sentiments... The movie feels like it's missing out on a lot of potential.\n\nTo think that if only a little bit more care and thought had gone into the writing, it would have at least been a decent enough action thriller. But what ends up being, is an almost passable action movie that feels worn out by the end of it."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "fazeelmf",
        "review_rating": "9",
        "review_title": "Nailed it!!",
        "review_detailed_main": "\"Retribution 2023\" is an exhilarating cinematic experience that seamlessly blends action, suspense, and thought-provoking storytelling. From the very first scene, the movie hooks you with its intriguing plot and refuses to let go. The visual effects are nothing short of breathtaking, immersing the audience in a dystopian world that feels both eerily familiar and uniquely captivating. What truly sets this film apart, however, is its stellar ensemble cast. Each actor brings depth and authenticity to their respective roles, making you emotionally invest in their journeys. The characters' moral dilemmas and internal conflicts are portrayed with such finesse that you can't help but reflect on the complexities of the human condition. As the narrative unfolds, \"Retribution 2023\" keeps you guessing with unexpected twists and turns that leave you constantly on the edge of your seat. It's a rollercoaster of suspense and intrigue, masterfully directed to keep you engaged until the very last frame. In a world flooded with generic blockbusters, \"Retribution 2023\" stands out as a refreshing and intellectually stimulating film. It challenges your beliefs and makes you ponder the consequences of society's choices. It's not just entertainment; it's a conversation starter and a testament to the power of thought-provoking cinema. With its exceptional storytelling, remarkable performances, and breathtaking visuals, \"Retribution 2023\" unquestionably deserves a 9/10 rating on IMDb. It's a cinematic gem that will leave you contemplating its themes long after the credits roll. Don't miss this extraordinary journey into the heart of retribution and redemption."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "sufyaanrashid95",
        "review_rating": "6",
        "review_title": "A Taut and Gripping Action Thriller",
        "review_detailed_main": "\"Retribution\" (2023) is an intense action thriller that follows the story of former Marine, John Barnes, who embarks on a relentless quest for justice after his family falls victim to a brutal act of violence. Fueled by a desire for retribution, Barnes navigates the dangerous underworld of crime and corruption, leaving a trail of vengeance in his wake as he confronts those responsible for the tragedy that shattered his life.\n\nThe film excels in creating a palpable sense of tension and urgency, immersing viewers in a high-stakes journey of personal vengeance and redemption. The plot unfolds with precision, delivering a series of gripping and adrenaline-fueled sequences that keep audiences engrossed from start to finish.\n\n\"Retribution\" benefits from a standout performance by the lead actor, who effectively conveys the raw emotion and steely determination of John Barnes. The character's evolution from grief-stricken victim to relentless avenger is compelling and adds depth to the narrative, exploring themes of justice, morality, and the consequences of unchecked violence.\n\nVisually, the movie is striking, utilizing dynamic cinematography and visceral action choreography to heighten the impact of Barnes' quest for retribution. The film's well-executed action sequences and intense confrontations contribute to its overall sense of momentum and excitement.\n\nIn conclusion, \"Retribution\" (2023) is a taut and gripping action thriller that delivers a powerful and emotionally charged cinematic experience. With its compelling storytelling, strong performances, and high-octane action, the film is sure to resonate with audiences seeking an adrenaline-pumping and immersive movie-watching experience."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Mrblue6",
        "review_rating": "4",
        "review_title": "Pretty damn bad movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "destiny_west",
        "review_rating": "5",
        "review_title": "Not bad Not great.",
        "review_detailed_main": "I was looking forward to Retribution. I am a self acclaimed Liam Neeson fan and probably would watch him paint a wall.\n\nI wasn't even sure of the plot of this film until moments before I watched it. Straight off reading the synopsis I was getting 'Speed' vibes.\n\nAs much as I love me some Neeson. I had a little giggle at the idea that these would be LIam's children. Okay maybe he had them a lot later in life.\n\nThe movie was okay, it managed to keep me mostly focused and interested enough to watch it all the way through. I thought the 'news' credits at the end were a bit of a cop out though.\n\nRetribution was not a bad film, but it wasn't great either. Though I did not feel that I hadn't wasted my time, so that has to be a bonus."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "mm-39",
        "review_rating": "6",
        "review_title": "Better than average film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "rws_20",
        "review_rating": "3",
        "review_title": "Just another Neeson crapfest",
        "review_detailed_main": "Just another generic Neeson flick, but unfortunately, they just seem to get worse and worse.\n\nI love Liam as an actor, but I wish he'd stop doing these crappy cookie cutter action films.\n\nThe script in this one was really awful, it was as if someone told the writer, 'Hey, go and write a 90-minute advert for Mercedes. You have one hour. Go!'\n\nFilms like this are supposed to be nothing but suspense and thrills, but for me, within about 20 minutes I was thinking, 'Ah sod it, just blow the car.'\n\nHaving his kids in the back of the car added absolutely nothing to the film either, you could have axed their characters completely and it would have made zero difference.\n\nNot really anything wrong with it in terms of cinematography, but just about everything else was way under par.\n\nReally wouldn't bother with this one."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Floated2",
        "review_rating": "6",
        "review_title": "Offers some minor thrills but nothing major",
        "review_detailed_main": "Having not quite remembering when this film was released, then knowing it wasn't as successful as the studios and everyone involved had hoped for. The film is certainly better than Liam Neeson's previous films (Blacklight, Memory) to that date and there was some deceit though thrills as the story hasn't too far fetched. Arguably the strongest Neeson has acted in a while as he does seem more motivated in this role.\n\nNow the story isn't exactly original but it is certainly watchable and there is a certain charm in watching Neeson being hostaged and held captive. As others have pointed out, the film is somewhat like Speed (1994) but set in a car. Also reminded of Phone Booth (2002). However both those films are easily superiors. Although that doesn't mean this film isn't worth the watch. Don't expect too much, it's solid enough."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "macca201029",
        "review_rating": "1",
        "review_title": "Awful, just awful",
        "review_detailed_main": "I've always been a Liam neeson fan and most of his newer films are quite generic, not like the old Taken days. But this film is truly awful. I completed 7 levels of angry bird whilst watching it because I just couldn't bare myself to concentrate. The acting was awful, the plot was awful, the ending was worse. I I understand Liam has been through a horrendous period of his life with the loss of his wife and so is probably trying to just take part in any film to occupy his time, but that does not make the film, or Liam any better. You can almost see he's give up on acting, which is quite sad for an actor of his calibre. In general, unfortunately a rubbish film, and that's being kind."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "FlashCallahan",
        "review_rating": "7",
        "review_title": "Turbulence is inevitable.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "EnchantedSwiftie495",
        "review_rating": "3",
        "review_title": "The Most Confusing Film Ever Made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "moviesfilmsreviewsinc",
        "review_rating": "9",
        "review_title": "Liam Neeson is Back!!!!!",
        "review_detailed_main": "Liam Neeson has been producing generic programmers for the past decade, hoping to become a successful action hero like \"Taken.\" However, the release of Neil Jordan's \"Marlowe\" this year suggested Neeson was tired of his current filmography and wanted to do something different. Despite the lack of success, Neeson was trying to do something worthy of his talents. His latest project, \"Retribution,\" snubbed out any effort in \"Marlowe,\" leaving it devoid of thrills, excitement, or purpose. The film seems to have been designed to play in empty multiplexes during the last weeks of summer. The film's lack of thrills and excitement makes it seem like it was designed to be played in empty multiplexes. \"Retribution\" is a remake of a Spanish thriller, \"El desconocido,\" which was first released in 2015. It is the third remake of the Spanish thriller since its debut in 2015. The screenplay by Chris Salmanpour is formulaic and lacks distinction, with no interesting or likable characters. The kids are annoying and the action beats are excitement-free, with even the big twist in the final scenes being obvious to most audience members. The screenplay resembles a version of Mad Libs for writers seeking formulaic scripts. The characters are not particularly interesting or likable, and the director, Nimród Antal, handles the action beats in a resoundingly excitement-free manner. Liam Neeson's Retribution is a suspenseful film that follows Matt Turner, a Berlin-based hedge-fund manager, who is in a dangerous situation with a bomb under his seat. Neeson's jurisdiction is limited to the driver's seat of a Mercedes, and he soon finds himself barking threats and solving mysteries from a golf cart. Matt's children, a moody teenager (Jack Champion) and a button-cute grade-schooler (Lilly Aspell), are in the backseat, and the culprit is on the phone. Matt is a workaholic who prioritizes his clients over his family, but he remains a Liam Neeson character, as he slugs a boxing bag before leaving the car. The film showcases Neeson's unique skills in AARP ass-kicking and his ability to control various forms of transportation. Retribution is a Spanish thriller directed by Nimród Antal, a no-frills genre journeyman known for his work on Vacancy, Armored, and Predators. The film follows actor Ryan Reynolds as he navigates a real-time, single-vehicle scenario, focusing on the protagonist's phone calls and the situation surrounding his family. The film resembles the 90s classic Speed, with its plot breaking its villain's rules throughout. The suspense peaks when Neeson's family man must pry his kids' smart phones away without frightening them with the truth of the hostage situation. The film also features a climactic battle against the odds, with Matt, the hero, ignoring his phone calls for minutes on end. The film's premise resembles Speed, but with a more casual and casual approach to the plot."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "saadurrehman70",
        "review_rating": "7",
        "review_title": "Thrilling but not quite as action-packed as Non-Stop",
        "review_detailed_main": "I LOVE Liam Neeson in these action thriller films. So respectful and competent, with an unmatchable presence and strikes such an adorable line between a good old-fashioned caring, sincere, and driven angry father! It was a very thrilling movie for the most part, had a lot of things similar to beloved Non-Stop (2014), though it wasn't quite as big in scale.\n\nThe plot twist was amazing. I was so sad and heartbroken, almost angry for what happened to his friend papa from Stranger Things at first!! The little Emily girl was soo pretty and adorable, her scared reactions were so cute and heartrending... Liam Neeson once again is sooo good in the action thriller genre. Solid 7.5 out of 10, could've had a less flatter ending but the way he finally got out was smart and well executed. Really gripping, relentlessly thrilling movie. Couldn't take my eyes off it!! 7:47am 11.5.2024."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "PANDIAN120621",
        "review_rating": "5",
        "review_title": "Where was the \"RETRIBUTION\" for godsake...???",
        "review_detailed_main": "One thing director Nimrod antal was clear enough is that he knows the strength of Liam Neeson,though he his getting old the plot was tailor made and was suitable for him with no breathtaking stunts or chase the director was clever enough to bring out some decent thriller... Another major advantage is the Crispy runtime that saves the movie to a large extent... A decent camera work,average writing and some of the finest emotions show on the close up of Neeson performance makes this flick a onetime watchable movie that might not disappoint you but where is the RETRIBUTION is the burning question... Also official remake of spanish thriller \"EL DESCONOCIDO\""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "dotty-smashbros",
        "review_rating": "2",
        "review_title": "Liam Neeson doing Liam Neeson Badly",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "dweston-38669",
        "review_rating": "",
        "review_title": "Standard Liam Neeson fare",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "burlesonjesse5",
        "review_rating": "7",
        "review_title": "VIEWS ON FILM review of Retribution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "burgerman93",
        "review_rating": "3",
        "review_title": "Liam buddy, what happened to you?!",
        "review_detailed_main": "This is the type of movie where you're almost rooting for the bad guy. Liam's character is brute and cold hearted as he tries to save his precious cargo.\n\nI would have liked to see the son having a bigger role in solving this whole ordeal. It's funny how this father makes such a big fuss for his son to get in the car, but this doesn't end up augmenting the plot. And near the end the son implores his father to let him stay in the car to help, which is denied. The whole movie we are given hints to how strained the relationship between them is, and yet the movie missed the boat in terms of showing their reconciliation.\n\nI liked the first fireball explosion, but that got old after the fourth instance. The car chase scenes also were tedious and predictable."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "pascalmiddlemiss",
        "review_rating": "6",
        "review_title": "Could have been better but still ok",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "mr_iceman",
        "review_rating": "3",
        "review_title": "Liam needs to put the phone down, permanently",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "LetsReviewThat26",
        "review_rating": "6",
        "review_title": "Liam is back in action",
        "review_detailed_main": "Liam is back in new action film retribution and unlike the others we are not seeing him kicking butt, this time its more him getting the butt kicking. He plays matt. A husband and father of two; he decides to take his kids to school one morning, unawear that under his seat lies a pressure pad linked to a bomb. He must now drive with a voice on a phone and his kids and if he does not do as told it will be the end; matt must do what it takes to stay alive and protect those closest to him. The cast was believable and it was tense; I enjoyed this film overally and though not my favoutite liam outting it was still very good."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "SJT_Reviews",
        "review_rating": "2",
        "review_title": "Liam Neeson please stop acting !!",
        "review_detailed_main": "This is the one of the worst movie of the year!\n\nA very deluded script with some of the worst acting ever by the whole cast. No effort or thoughtfulness in the story, a guy after money, unhappy wife, pissed kids and a cunning/loser dad trying to save his kids.\n\nThere are many times I thought of not watching the whole movie but I did so to see I may be wrong and it would all make sense, but boy I was right within 30 mins in the movie.\n\nLiam Neeson once again proves that you should never give up acting until someone tells you to stop!!!\n\nI don't know why this movie was made, let alone good or bad.\n\nPlease don't watch this crap!\n\n2/10 for this one!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "theromanempire-1",
        "review_rating": "8",
        "review_title": "way better than i thought it would be",
        "review_detailed_main": "I really can't understand those beep negative reviews.\n\nThis film had it all. Suspense, action, agony, all those thriller elements every liam neeson film promises so u know what u are getting.\n\nIf those people don't like mr. Neeson just stay away.\n\nTo my surprise this was way above average and way better than i thought it would be.\n\nI only wanted it to be just above average with some interest so to pass my time and instead i got a great action thriller flick which held me in my seat thrilled until the end.\n\nThe plot was good and the reasons behind the placing of the bomb were explained in a good way and we also had a villain who we could never tell until he was revealed in the end.\n\nFor a film like this where u know what u are getting it was way above average and although things could be better here and there the final outcome was satisfying.\n\nGet also the dvd blu ray when it comes out.\n\nGrade B+"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "maartenvanheek",
        "review_rating": "1",
        "review_title": "second movie I've ever walked out on",
        "review_detailed_main": "After reading the other review with spoilers, I'm glad we decided to walk out. I wanted to see it because Liam can be had for a good action movie. However, an hour in and we were silently screaming at the cinema screen to please be sensible.\n\nAngry parents, misbehaved kids. Random plot twist about the mother that doesn't make any sense. People that don't listen.\n\nAfter about an hour into the movie we couldn't take it any longer and decided to leave. The first hour could probably fit in 10 minutes, and considering the ending is apparently a bit hasty, that suggests to me that the whole movie could fit in a 20 minute TV episode."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "kenbo-87360",
        "review_rating": "4",
        "review_title": "Poor.",
        "review_detailed_main": "If you haven't got any fresh paint to watch dry then give this a go!\n\nThis was like a poor man's Speed and Phone Booth, only they were good films, this isn't.\n\nLiam Neeson gets into a car with his children. After a while a phone rings and a mysterious caller tells him there's a bomb under his seat which will detonate if he gets up. A cat and mouse chase then starts. It sounds good but unfortunately it isn't.\n\nI guessed the twist at the earliest possible opportunity. That's never a good sign when the big reveal is announced and you're anything but surprised.\n\nLiam's had a good career and made some memorable films. Taken was brilliant when that was first released and made him a surprise action star. He's never really matched that film since though in this genre.\n\nGive it a go if you can watch it for free. Don't bother paying for it like some poor souls have done.,"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Luv2Spooge",
        "review_rating": "5",
        "review_title": "So so... average everything.",
        "review_detailed_main": "There's nothing bad about this film but there's nothing good about it either. It is a so so movie and it will get the job done if you're looking for time to kill. As an avid Liam fan though, it was somewhat of a disappointment and the realization that his career is coming to an end as for being an action star. Age is inevitable.\n\nWithout going into spoilers, you can be sure this whole film he is sitting in that car. There is no fist fights, no karate chops, etc... There are some car chase scenes, some bomb explosions, but overall I wouldn't call this an \"action\" film as it is more of a drama and mystery.\n\nThen for the plot itself, it is nothing you haven't seen before in other films. So one last ride of the fans... 5/10."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "thetruthunlimited",
        "review_rating": "1",
        "review_title": "Started well then STUPID!",
        "review_detailed_main": "I'm in the movie right now and I'm done. It had such promise. Utterly poor script and writing - all those strikes for nothing! They make the Liam Neeson main character weak. There are some things that make sense and like I say the set up is pretty good. But then it suddenly loses the plot. No person would react like that and you ca tell the writers are artificially holding the story to create false tension rather than thinking how it would naturally evolve. He fails to explain to everyone important why the problem exists. They make his character inconsistent - he's successful because of his ability to communicate but then he doesn't say the things someone like that would say. Unnatural portrayal of relationships and of kids' behaviors'. The most important conversations people would have in a situation like that (including with his kids) and he fails to say the obvious things anyone would say and fails to do many of the obvious things people would do. Ridiculous unfolding of the premise.\n\nIs this the best Hollywood now offers post-Covid? Or this just part of the ongoing twist in the reality of the movie industry where 'those arty people' people are completely detached from most of our reality.\n\nI feel sorry for Liam, could've been good."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "illyasmith66",
        "review_rating": "2",
        "review_title": "Why are geriatrics playing much younger characters?",
        "review_detailed_main": "The story is boring and done to death.\n\nBut like my heading, why the hell is an old aged pensioner like Liam Neeson playing a character that should have been portrayed by an actor 30 to 40 years younger??\n\nI mean seriously, does Neeson really need the money? Did he lose his retirement funds to a poor crypto purchase?\n\nIt is ridiculous, and stops the viewer from buying into the fantasy.\n\nGarbage. Total garbage.\n\nAnd what's with all the boring unbelievable dialogue that only cares about exposition while being devoid of personality?\n\nI've been struggling sleeping of late. Too much pain with the osteoarthritis in my left knee. But this film helped put me to sleep in no time. If you struggle with sleep then I would highly recommend this film for you too.\n\nOtherwise avoid it if you treasure your time."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "jp_91",
        "review_rating": "10",
        "review_title": "Cool film!",
        "review_detailed_main": "\"Retribution\" is a movie whose trailer caught my attention but made me doubt the quality of the script, seeing it completely exceeded my expectations. The script is based on the movie \"El desconocido\" (2015) which has already had other remakes in recent years. \"Retribution\" for being a remake manages to have a lot of quality, the action and mainly the suspense are present throughout the film. The cinematography is good and manages to have daring camera movements. The performances are excellent, Liam Neeson and Embeth Davidtz show their great acting skills, for his part Jack Champion shows that he is no longer a young film promise, he has already fully established himself as an actor with three films released in less than a year and where he demonstrates his talent, and Lilly Aspell at her young age gives an incredible performance. It's good to see Neeson again in a quality movie like \"Retribution.\""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "chigflo",
        "review_rating": "1",
        "review_title": "Liam Ewwwsom bombs out in this waste of film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "per-181",
        "review_rating": "1",
        "review_title": "A new low!",
        "review_detailed_main": "Those people who have awarded this movie 10 stars should not be allowed to watch movies. They need their heads examined, and then being locked up in straight-jackets.\n\nI have never ever encountered.a more illogical storyline. The plot has more holes than an entire year's production of Swiss cheese. The whole premise of the threat to Neeson's life is beyond all logic. But all these shortcomings fade away completely when you listen to what is being said - and not said.\n\nNobody listens to anyone, ever. Nobody answers a single question, noone reacts to what is being said, noone tries to explain to the police what is going on. And what is being said is totally unnatural, as if written by some drunk AI. And, once again - listen, film makers everywhere: There are no Interpol or Europol agents. Those are administrative organizations, set up to simplify collaboration between national police forces. Only German police would be allowed to carry guns in Germany.\n\nLiam Neeson is, normally, a really good actor, but it is sad to see him accept such dysmal roles just to make some more money. Surely he has enough saved up by now to be able to turn down awful projects like this. Time to quit while you're ahead, Liam."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "sveinur-trondarson",
        "review_rating": "1",
        "review_title": "Appalling - plain and extremely simple",
        "review_detailed_main": "This is one of the absolutely worst movies I have ever seen. The plot is cheap or just terrible. Normally you can always find some good things to say about a movie, but honestly here is nothing at all, and that is pretty sad.\n\nI am actually in a bit of a shock that an actor like Liam Neeson even choses to think about playing in a poor movie like this. Ok, it is his kind of movie, but all the others have been on a different level. Maybe not brilliant, but compared to this they are on Academy Awards level. This is so bad that it will not even been considered for a Raspberry Award.\n\nMy advice is: There is absolutely no reason whatsoever to watch this movie. :'("
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "ferguson-6",
        "review_rating": "5",
        "review_title": "cat and mouse boom",
        "review_detailed_main": "Greetings again from the darkness. Fully deserving of a tip of the cap is Liam Neeson, who used the popularity of TAKEN (18 years ago) to create a new sub-genre: the annual Liam Neeson action film where he gets to be the hero. This latest is from director Nimrod Antal (PREDATORS, 2010) with Christopher Salmanpour adapting the screenplay from Alberto Marini's 2015 original, EL DESCONOCIDO (Spain). This is actually the third remake of that film, including those from Germany and South Korea.\n\nAn artful assembling of a bomb takes place over the opening credits, and then we cut to Matt Turner (Neeson) getting his morning workout on the boxing bag hanging in his loft. Other than fast-driving, that's the biggest action-hero moment Liam gets in the film, although he is in the middle of plenty of other explosive moments. We quickly recognize Matt Turner as a successful Financial executive living in Berlin who is too consumed with work to be an attentive husband to his wife (an underused Embeth Davidtz) or involved father to his kids, Zack (Jack Champion, AVATAR: THE WAY OF WATER) and Emily (Lilly Aspell, played young Diana in the two Wonder Woman movies). Of course, everyone recognizes his there-not-there approach except him.\n\nGuilted into the rare task of taking the kids to school one morning, Matt takes a call from an \"unknown caller\" on an unrecognized cell phone located in the console of his car. The disguised voice informs Matt that there is a bomb in his car that will detonate if he gets out, and there is a remote device that will allow the bomb to be set off if Matt doesn't do exactly what the caller says. The plan revolves around big money, and Matt's kids begin to question if their father has cheated people. Matt's awkward behavior doesn't put them at ease. This ordeal involves other people as well, and soon a Europol detective (Noma Dumezweni, THE LITTLE MERMAID, 2023) is involved and assuming Matt is the real threat.\n\nWith no apologies, the film borrows heavily from SPEED (1994) and PHONE BOOTH (2002), as time becomes a crucial element, along with following precise instructions. As viewers, we are right there with the kids - trying to figure out what's happening, why it's happening, and who is behind it. Most of the time is spent in Matt's Mercedes, and we see two other luxury vehicles (Maserati, Tesla) on the wrong end of bombs. There are some holes in how the story progresses, as well as some inconsistencies in the look of the vehicle - clean, dirty, damaged, undamaged - although the weakest point is Matt's absurd call with a client early on. This was obviously written by someone with very little business acumen. Matthew Modine has a supporting role and one of the film's producers is Jaume Collet-Serra, a frequent collaborator on the many Liam action-movies. This one should work for those who enjoy the thrill of the moment before moving on to the next one.\n\nOpening in theaters on August 25, 2023."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "scarellis",
        "review_rating": "3",
        "review_title": "Not what I expected",
        "review_detailed_main": "The movie started with a good plot, but as the movie started to developed the story, it becomes more and more absurd. Into the movie over a hour, nothing make sense. The movie gave several opportunities for resolution, but was not done so because Liam couldn't come across his purpose. He keeps saying liste listen, but he never explains anything. Things started to happen that does not make sense for who is watching the movie and the situation at hand does not make sense. The scripts for the movie is really poor. I had to stop watching this movie, because I felt will be a waste of time m, when I can see a movie that make sense."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "panagiotis1993",
        "review_rating": "8",
        "review_title": "Not Perfect But I Enjoyed It! [7.8/10]",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "IonicBreezeMachine",
        "review_rating": "5",
        "review_title": "An underwhelming remake of Retribution clumsily tailored for Neeson that jettisons the character and commentary of prior versions",
        "review_detailed_main": "Set in Berlin, Hedge Fund manager Matt Turner (Liam Neeson) reluctantly drives his children Zach (Jack Champion) and Emily (Lilly Aspell) to school as his wife Heather has a prior engagement while Matt has an important business meeting. After getting in the car, Matt hears an unfamiliar ringtone and after picking it up is informed by a voice on the phone that pressure sensitive triggers in the seats of the car have been activated and will be trigger if he or his children leave the car or remotely detonated if he deviates from the caller's instructions.\n\nRetribution is the third remake of the Spanish action-thriller El desconocido following the 2018 German version Don't. Get. Out! And the 2021 Korean version Hard Hit. The film began development in 2017 and like many of Neeson's recent works is an international co-production where the modest budget is played for reduced risk among the various financiers with the film typically making a profit through pre-sales and down the line revenues even if it's theatrical or critical reception is middling at best. Retribution is a hollow remake of the Spanish original and is a generic rendition of prior takes on this material with nothing to really add besides Neeson's name.\n\nMuch like the Korean film Hard Hit, director Nimrod Antal I feel deflates the tension by having the camera often travel outside the confines of the car in order to get more \"dynamic\" shots of the car chases rather than experience them in a more on the ground fashion of the Spanish original. At least it keeps the flow more focused by not introducing the police characters by cutting away to them too early, so that's a slight point in the film's favor. While initially it seems like Neeson is trying to play against the growling revenge seeking anti-hero he's been typecast with post taken, around the halfway point the movie does away with that and leans into it including changing the original context of why this is happening in the first place and changing the more simple motivations of the original or Korean remake and replacing it with a convoluted plan that's filled with so many potential missteps it's baffling trying to listen to it justify itself during the requisite \"talking villain\" moment.\n\nRetribution is the kind of middle of the road product that's tailor made for watching on streaming services or redbox where it belongs. It's well-made enough, but it also stands in the shadow of superior versions that are readily available and while international viewers can experience the premise in English it's in a less impressive form."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "jakooprime-34",
        "review_rating": "3",
        "review_title": "Dinosaurs in action",
        "review_detailed_main": "I recently watched 'Retribution 2023,' and I had to write a review. That was so bad... It was like watching dinosaurs in an action movie. Unfortunately, I found it to be a bit lacking in a few areas. The plot had potential but felt poorly executed, and the storytelling left much to be desired. The characters lacked depth, making it challenging to connect with them.\n\nIn terms of direction and cinematography, there were some visually appealing shots, but they couldn't fully compensate for the weak storyline. The action sequences, while present, didn't manage to capture the excitement one would expect from an action film.\n\nThe script and dialogue left a lot to be desired, with none memorable lines or moments. As for the acting, it's safe to say that it fell short of expectations. There were instances of subpar performances that detracted from the overall experience.\n\nIn summary, 'Retribution 2023' had potential, but it suffered from a weak directing, underdeveloped characters, and lackluster acting. While it might still find an audience among die-hard action movie fans, I would recommend it with reservations to those who are less forgiving of these shortcomings."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "antonydrago",
        "review_rating": "2",
        "review_title": "Perhaps Liam's worst movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "mildlyintrusive",
        "review_rating": "2",
        "review_title": "Speedn't",
        "review_detailed_main": "Retribution (2023) is a film that I had absolutely no interest in seeing whatsoever, but did since my cousins convinced me to (Damn you!), this is one of many low-mid budget action movies starring Liam Neeson. I gotta say that there's some good gems in there but for the most part, there's not much to mine for. Movie is essentially Speed (1994) but without the speed limit and worse.\n\nThe movie tries to be an intelligent and intense thriller but falls flat on both ends, the performances are dreadful, the child actors made me cringe when they spoke and Neeson sounds oddly tired. Theres this opening scene where a car explodes for no reason. Soundtrack was nothing of note, characters weren't fleshed out enough for me to care, there's too many plot holes that irritated me while watching, action scenes that were bland and a twist that was so predictable that it genuinely made me groan.\n\nI'd say that there's some nice explosions here and there but that's basically it. Overall, not a great time and I really don't recommend this to anyone, even Liam Neeson fans. If you want a better movie with a similar premise, watch Speed instead."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "norbi05",
        "review_rating": "1",
        "review_title": "Insulting and annoying",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Screen_O_Genic",
        "review_rating": "8",
        "review_title": "\"Baby you can drive my car...\"",
        "review_detailed_main": "Based on the 2015 Spanish film \"El desconocido\", \"Retribution\" is an able remake that delivers in edge of the seat thrills and action. A corporate cog goes through the humdrum of day to day living until he drives with his kids. A phone call from seemingly out of nowhere leads to a blinding tailspin of fear, murder and familial bonds. Liam Neeson is back as the elderly hero off to save the day as he does a flawed but fine job as the beleaguered father doing the best he can to salvage a frightening situation. There isn't much of the usual Action tropes of blood and explosions. What you'll get are intense dialogues and bracing scenes. While the film doesn't always work with the erratic acting throughout and flat parts (the unbelievable yet surprising ending is an acquired taste) the good story makes this worth one's time. Bring out the soda and snacks this is one solid Action flick that hits more than misses."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "dockie-94105",
        "review_rating": "4",
        "review_title": "Ho hum",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "graves-scott",
        "review_rating": "1",
        "review_title": "Oh, the evil bankers.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "rehmankhilji",
        "review_rating": "2",
        "review_title": "Another below average",
        "review_detailed_main": "Liam Neeson, let's set aside his movies from the 80s and 90s. This remarkable actor made a significant impact on the screen with \"Taken,\" and his dialogue remains among the finest you'll ever encounter in cinema.\n\nHowever, here's where the issue arises. Going from such outstanding films to a series of subpar \"B\" rated movies is nothing short of disappointing. Whenever Liam Neeson's name graces the screen, audiences anticipate a quality cinematic experience. Yet here he is once more, in a mindless and utterly tedious film.\n\nThere's absolutely nothing worth watching here. It's poorly executed, the plot is overly simplistic, and the overall presentation is simply lackluster. I strongly recommend IGNORE THIS ONE."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "eyadtoma",
        "review_rating": "5",
        "review_title": "Bad movie",
        "review_detailed_main": "I am sorry but this one was so bad i dont like to say wrong things about any movie but this one i should say something wrong to make the onwers of this movie do something nice next time i mean this movie doesn't make any sense at all, even the stroyline and the events of the movie is so absurd.\n\nFor me the only thing that made me watch this movie was the actor liam neeson i like this actor his movies always good but this one was bad.\n\nIt was little fun and excited in the beginning but after that i began to feel bored , anyways hope the owner of the movie has understand that this type of storylines doesn't make any sense."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "kevxzara",
        "review_rating": "5",
        "review_title": "LITTLE BIT OF CHEESE",
        "review_detailed_main": "The movie in all is not really that bad. The acting was a little cheesy at times and the script was a bit cringe in places. Not enough story behind the characters either.\n\nIts entertaining but nothing special but this movie has the worst ending I have seen for a long time it's just plain awful ending a movie like this if should be a criminal offence.\n\nNo movie should end with out a conclusion it's just pure lazy film making.\n\nLiam Neeson is getting old now but saying that I think he has always been old, bit of a boring character in this movie but never really seems to act, every movie of his he feels like the same character in every movie. But that ending what on earth."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "toonarly",
        "review_rating": "10",
        "review_title": "Love these Liam neeson flicks!!!",
        "review_detailed_main": "Liam Neeson seems to be the perfect Joe in these type of suspense movies. I hope he does a few more before he retires, this movie has a few good twists and keeps you guessing if he's a really bad guy or someone being very intelligently set up to take a huge fall. His family is a total mess at the beginning and gives the impression that he's not who he seems to be, well written, I saw a few flaws that could have easily been fixed, but under the stress of his situation, it's quite likely he never had the time to consider them at all. No questionable content whatsoever, no nudity or other un family shots, a bit violent at times and the action is non stop. A very believable story and one that could easily be a real life event for some unfortunate person. Great to see Liam again in another suspense!!! Can't wait for the next one!!! Keep them coming!!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "celomardelcorte",
        "review_rating": "5",
        "review_title": "Average weekend tv movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "bgar-80932",
        "review_rating": "5",
        "review_title": "Watchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "beevenkat",
        "review_rating": "5",
        "review_title": "expected more tension",
        "review_detailed_main": "Here is my unbiased review of the movie Retribution. Matt Turner, a financier, has absolutely no time for his family. But one fine day, he decides to become a good dad and drive his kids to school. However, he picked the wrong day. Why? Because that day, an unknown man planted a bomb beneath his seat and threatened to blow up the car. In #Retribution directed by Nimród Antal, Liam Neeson convincingly portrays a father who would stop at nothing to safeguard his children. The film has some watchable moments, but the climax is a bummer. I expected more tension and some brutal action. Rating 2.5/5."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "jprice-38253",
        "review_rating": "4",
        "review_title": "Ehhh wasn't even decent.",
        "review_detailed_main": "I know that Liam was just being Liam and it obviously isn't his fault that this movie was not the best. But dang, I would've at least thought it would be decent. The cast was fine. The story was just hard to follow, to actually know what was going on and the action sequences weren't all that exciting. In fact why am I even saying action sequences? There was barely any action in here. Nothing really but him driving around the whole time with his kids in the car and trying to figure out a solution to the bomb under the seat. The writing, if I can describe it at best, is just simply boring. It's nothing exciting or new or different in the slightest. If only they had given Liam at least a few stunts to do in this, but they gave him nothing to do at all unfortunately. I know for a fact they could've somehow incorporated a couple of stunts in here that he could've done. 1hr and 30 runtime? It felt like more than 2 hours of a drag to me. If you're looking for something to watch Liam Neeson in, it's definitely not Retribution. I'll tell ya that! He has a ton of other better movies out there! Please pass on this one. You're not missing anything..."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Vucko130",
        "review_rating": "5",
        "review_title": "A Riveting Thriller Full of Twists",
        "review_detailed_main": "**Title: Retribution (2023): A Riveting Thriller Full of Twists**\n\n\"Retribution\" (2023) is a gripping thriller that will leave you on the edge of your seat. With a complex storyline filled with deceit and revenge, the film takes you on a suspenseful journey. The outstanding cast delivers remarkable performances, immersing you in their characters' emotional turmoil. The cinematography is visually stunning, creating a dark and intense atmosphere. The plot twists are cleverly executed, keeping you guessing till the very end. This thought-provoking movie explores themes of justice and morality, leaving a lasting impact. \"Retribution\" is a must-watch thriller that will captivate you with its suspenseful narrative and unexpected surprises."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "jdzoska",
        "review_rating": "10",
        "review_title": "Taken...X",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "sylviacroland",
        "review_rating": "5",
        "review_title": "Not the tough Liam",
        "review_detailed_main": "Hubs and I love Liam Neeson movies. However, this one left us a little lacking. He waited until near the end of the movie to become a badass. We like it better when he's a tough guy from the start. We didn't have a feel for his situation at home before the action started; we only knew his son was moody and picked on his sister. We didn't know the marital situation until part of the way through the movie when we find out his wife isn't where she is supposed to be. I didn't really care if the bomb blew up his children since I didn't have any emotion invested in them. Let's have a film where Liam is tough sooner."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "alisondavies-55549",
        "review_rating": "3",
        "review_title": "Poor writing, cheap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "alexander_bewcock",
        "review_rating": "5",
        "review_title": "Retribution",
        "review_detailed_main": "Despite the fact that overall the film was not a success, it is quite watchable. Especially if you miss the same type of films with Neeson (and yes, not all his other films are brilliant).\n\nThere is not much action, but what there is is not bad, the dialogue is good in some places, and there is some atmosphere.\n\nAs a result, a fairly average flick, which is just OK, and you can just watch it in the cinema if you want to go to something now, but don't want anything else.\n\nBut if you miss films that are similar to those with Liam Neeson, then watch the series Hijack (similar to Non-Top, but with a strange and lazy ending).\n\n5 out of 10."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "malakakorek",
        "review_rating": "4",
        "review_title": "Cheap thrills",
        "review_detailed_main": "This is for sure not your typical Liam Neeson movie in any shape or form. I have to admit it kept me on the edge of my seat though i kept expecting more, but never got my wish. The children don't seem to know how to channel their emotions realistically, and I feel the bad guy character was supposed to be a shock, but it kind of wasn't.\n\nUsually in these types of movies, when they wabt to shock u with who the bad guy turns out, they're supposed to give him some kind of back story or at least make us sympathise with him, but this fails here.\n\nOverall you can let this one slide on a boring Saturday night if you have no other plans."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "lechristos",
        "review_rating": "1",
        "review_title": "People should be paid to watch this!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Elvis-Del-Valle",
        "review_rating": "9",
        "review_title": "Liam Neeson and the explosive car",
        "review_detailed_main": "After the Spanish version has been remade twice by Germany and South Korea, now the Hollywood industry decided to make its own version, starring the great Liam Neeson. In fairness, Liam has become another great figure for action movies in recent years. Him starring in this version of El Desconocido might add up, but the point is that it feels like the other films Liam has starred in. The story is similar to the original film, but with some changes. The motivations of the individual giving directions to Liam are different. The roles of the children are also reversed, placing the son as the eldest and the daughter as the youngest. The film does have tension and intrigue, but when compared to the original film, the intrigue here is a little softer. The story is much simpler and even somewhat short. It's not that it's a bad movie, here they wanted to make a simple thriller like the ones Hollywood usually makes and it manages to achieve that. Every version of this movie that exists simply adapts the story to its own setting. Retribution is an enjoyable film with exciting and tense moments. Its only flaw is having a level of intrigue that is below the original film. My rating for this movie is a 9/10."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "david_royz",
        "review_rating": "5",
        "review_title": "Speed clone with 71yo Leeson & his teeny kids",
        "review_detailed_main": "SURELY there are some 40-something actors that can take the baton from old man Leeson for these action flicks? He was fantastic in his early career but now it just looks strange when he's playing a dad instead of a grandfather or even a great grandfather.\n\nThe film is a remake of a Spanish film from 2015 but borrows its basic premise from Speed (1994). Unfortunately it isn't in the same league as Speed with dialogue that feels forced and amateur, and CGI befitting a TV show rather than a theatrical film.\n\nYou might think this is a good way to kill a couple of hours but you're better off re-watching Taken or Speed."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Thanos_Alfie",
        "review_rating": "5",
        "review_title": "Average...",
        "review_detailed_main": "\"Retribution\" is an Action - Thriller in which we watch a man's life at risk as he must race against time to stop a series of deadly attacks on his family, all while driving through the city.\n\nWhile the movie starts with an intriguing setup and offers some moments of tension, it falls short in delivering a truly engaging experience. The plot, though promising, ultimately feels formulaic and predictable. Despite a few intense sequences, the pacing often lags, making it difficult to stay fully invested. The character development is underwhelming, and the protagonist, despite being put in life-threatening situations, never quite garners the emotional connection that the story demands. Visually, the film has some strong action scenes, but the overall execution lacks the punch needed to keep viewers on the edge of their seats. In conclusion, \"Retribution\" is a film with potential, but it doesn't quite live up to its expectations."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "burkdog94",
        "review_rating": "4",
        "review_title": "Your Typical Liam Neeson Movie!",
        "review_detailed_main": "This movie is enjoyable if you go in with the mind set that it is a Liam Neeson movie. If you don't, well you will most definitely hate the movie.\n\nLiam Neeson is in his stereotypical role, a father/husband who is losing or has lost his family but now has to fight a bad guy to save them all. Not much has changed except the storyline.\n\nThe idea behind the movie was average, it had potential but it definitely missed the mark. It had a lot of plot holes throughout the movie. The way it ended, felt pretty dumb as well.\n\nAlso the whole movie felt very cheap, there didn't feel like a lot of different camera shots that happened. If they varied it or took ideas from other suspenseful filmmakers, they may have improved the movie a bit.\n\nIt definitely wasn't the best movie I seen but it was definitely enjoyable if you take it as it is....a cheap action film."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "joehunterirl",
        "review_rating": "3",
        "review_title": "Terrible",
        "review_detailed_main": "It was that bad I had to keep watching....\n\nHow did Neeson manage to get roped into this crap? .. such a good actor being brought down by shoddy second class acting.\n\nThe plot is predictable. The direction and is shocking... continuity is terrible.. he drives through 2 police cars at one point and no damage to the car... then a railing bumper still on... its laughable\n\nNeeson needs to check what he signs up for if he wants to keep his credibility. Such a good actor with years of experience being let down by poor producers and directors\n\nDo not watch this drivel unless you want to waste 1.31min of your life."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "jfryvzth",
        "review_rating": "1",
        "review_title": "Didn't pay to go and see this, thank god!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "DramaDiva_ActionQueen",
        "review_rating": "10",
        "review_title": "A Gripping Thriller That Keeps You on the Edge of Your Seat",
        "review_detailed_main": "\"Retribution\" is a masterfully crafted thriller that delivers a relentless pace and a compelling narrative, earning its place as a standout film in the genre. Starring Liam Neeson, the movie plunges viewers into a high-stakes scenario filled with tension and suspense that never lets up.\n\nThe plot revolves around a seemingly ordinary man who finds himself embroiled in a life-or-death situation when a mysterious voice instructs him to follow a series of dangerous commands. The concept is intriguing and effectively sets the stage for a rollercoaster of emotions and adrenaline-pumping moments. The tight pacing keeps the audience engaged, ensuring that each twist and turn feels impactful and unexpected.\n\nNeeson delivers a powerful performance, effortlessly embodying the character's desperation and determination. His ability to convey vulnerability while navigating extreme circumstances adds depth to the story, allowing viewers to connect with his plight on an emotional level. The supporting cast also shines, contributing to the film's tension and stakes.\n\nVisually, \"Retribution\" is striking, with dynamic cinematography that enhances the urgency of the narrative. The action sequences are well-executed, maintaining a sense of realism while pushing the boundaries of the thrilling premise. The score complements the film's atmosphere, heightening the tension during key moments and immersing the audience in the experience.\n\nIn conclusion, \"Retribution\" is a gripping and expertly crafted thriller that keeps viewers on the edge of their seats from start to finish. With its compelling story, strong performances, and relentless pacing, it earns a well-deserved 10/10 rating. This film is a must-watch for anyone seeking an intense cinematic experience filled with suspense and excitement."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "martinallan-68640",
        "review_rating": "1",
        "review_title": "Embarrassing",
        "review_detailed_main": "Plot so full of holes it bends credulity. Liam has become a bit of a joke now. All very well going down the desperate aged action hero from Taken which worked once, but his last few movies have become mindnumbingly boring, badly acted with no proper plot line. It's a joke from the off. Cliché after cliché and it never lets up.\n\nRetribution simply adds to the lengthening list of garbage movies that Liam is now punching out. Others have mentioned spoilers but I won't. Save yourself from this tripe. It's embarrassingly bad and frankly offensive to anyone with even a single brain cell. Just when you think it can't get any worse, it does. When the bad guy gets in the car, I didn't know whether to laugh or cry. It was so patently obvious. Oh dear oh dear oh dear."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "nightringer-76840",
        "review_rating": "5",
        "review_title": "Pale Remake of 2015's El Desconocido",
        "review_detailed_main": "Intensity : Vrry good Casting: Liam Neeson was a guaranteed audience magnet for this type of films. Mathew Modine was adequate. The casting for the children were good.\n\nStoryline:\n\nBeing a Studio Canal remake of El Desconocido (2015), the script of Retribution was overly focused on the intensity and Neeson's acting rather than focusing on the story. El Desconocido was clearly a far more complex, dramatic and impactful story wise. After watching El Desconocido, I found Retribution 2023 was an average Hollywood remake and that's disappointing.\n\nIf the creative team expandedthe story of El Desconocido with Neeson as the main star, it would far exceed the original. Unfortunately, budget limitations and director's played it safe decision failed such a big potential film."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "talllwoood13",
        "review_rating": "5",
        "review_title": "almost bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Kobuss18",
        "review_rating": "3",
        "review_title": "Another German Film-Failure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "bssnthusast",
        "review_rating": "5",
        "review_title": "Jack needed more scenes.",
        "review_detailed_main": "Jack Champion was the only reason I watched this movie. He needed more screen time. In fact, give him all the screen time! I watched this movie twice. Once, alone. Another time, with my family. My dad liked the movie. It was alright. After getting the chance to watch it again, I don't think my first opinion changed: I was engaged, but why? Jack. Jack Champion. He was my only interest in this movie. AND LET ME TELL YOU, I was VERY interested when he was a part of ANY scene. Loved his character. Loved the big brother to little sister dynamic that there was in this movie. I don't exactly know the point of the movie. To my knowledge, it's about family sticking together? God knows what the message of this movie was. It was kind of boring, but since Jack was there a lot, I enjoyed it for the most part. If you don't have a fat crush on Jack Champion, like I do, then good (back off, he's mine), don't waste your time watching this movie."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "movieman6-413-929510",
        "review_rating": "4",
        "review_title": "It comes across as if the novice screenwriter was continuing to write while filming.",
        "review_detailed_main": "Retribution is a new action thriller directed by Nimród Antal, director of Predators and Vacancy.\n\nBusinessman Matt Turner (Liam Neeson) receives a call from an unknown number while taking his children to school. When he answers, he hears a mysterious voice telling him that there is a hidden bomb under his car seat.\n\nIf Matt doesn't do exactly what the voice asks him to do, the person threatens to detonate the bomb. To protect his children, Matt does what is asked of him.\n\nSince the film Predators 13 years ago, Nimród Antal has not really directed an action film. He also has to work with a screenplay written by novice writer Christopher Salmanour. Unfortunately, the fact that this screenplay writer is still a novice is reflected in the final film. It sometimes seems as if he was continuing to write his screenplay while filming. There are many unclear choices and decisions that the criminal and his victim Matt make. Many ill-considered actions occur, the details of which are not always correct or are missing. In addition, moments are often repetitive.\n\nThe visual effects of explosions, for example, also do not seem very believable. As a result, the film also loses some of its tension level.\n\nLiam Neeson tries to give a good performance as the lead of the film, but thanks to the poor screenplay he gets few opportunities to do so. He also sometimes seems a bit unsure about what his characters should do next, because the screenplay still seems to have been written at that moment. Jack Champion and Lilly Aspell, who play his son and daughter in the film, have acted in better films in their nascent acting careers. Jack had a better role in Avatar: The Way of Water. Lilly Aspell also played the young version of Wonder Woman in the Patty Jenkins Wonder Woman films. Hopefully they will be cast in better films in their future acting careers."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Perald",
        "review_rating": "1",
        "review_title": "Another one with an old age pensioner acting unnatural",
        "review_detailed_main": "How can they? Another one of these films where the characters act nothing like normal persons, you might have the odd man out, but never the whole ensemble, except if it was from a mental hospital.\n\nCan't understand how they dust of ideas from classics and half-classice like Speed and others and think that this is good enough. A person calling and claiming being fromEuropol... Europol is a cooperation organisation for different police forces around Europe, no one works for or in Europol, except maybe the flooor cleaners, all the other central persons work for their police force. Like Interpol. Sad."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "paulclaassen",
        "review_rating": "4",
        "review_title": "Follow the instructions...",
        "review_detailed_main": "Liam Neeson has long since become his own victim of being typecast. Ever since 'Taken' back in 2008 he mostly portrays a dad in peril, or someone out for revenge.\n\nLiam Neeson stars as Matt Turner. Matt lives in luxury with his wife and kids, but the family is falling apart. His wife secretly wants to divorce him, and his kids are spoiled brats with little respect for him....well, his daughter a bit maybe.\n\nDriving his kids Zach and Emily to school one morning, Matt receives a call from a mysterious caller warning him there is a bomb under his seat, and unless he does exactly as instructed, the bomb will detonate. Also, if any of them tries to get out their seat, it will trigger the bomb. Feeling all too much like 'Speed', 'Retribution' fell short on every level.\n\nIt became clear Matt was in financial difficulty and that he and his company was involved in fraud amounting to millions of dollars. And so Matt was being set-up by the mysterious caller so Matt could transfer the funds to a designated account. But along the way there were quite number of plot flaws. The twist reveal also offered more questions than answers, and didn't make sense considering what the characters went through. I'm not doing spoilers here, but this anonymous antagonist was in a position to accomplish his task without Matt, so why go through all the trouble and make-believe? It simply wasn't believable.\n\nI also didn't find the performances believable enough. Sure, Liam Neeson is a veteran by now (at portraying similar characters) but he actually looked tired in this movie having to portray yet another dad in peril, as if he, too, believed it was deja vu, deja vu... In all fairness, Liam Neeson is 71 years old already, so I have to commend him for still taking on physical roles in action thrillers.\n\nDespite the flaws, 'Retribution' was nevertheless still an exciting enough movie to keep me interested. It did feel more like a TV film than a mainstream movie, but it still provided a few thrills."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "nogodnomasters",
        "review_rating": "4",
        "review_title": "You Lie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "christo-26959",
        "review_rating": "1",
        "review_title": "This is horrible",
        "review_detailed_main": "Worst written movie. Appalling dialogue if you get past the first 15-20 mins you've done better than me. It was bland, lacked substance the dialogue was a farcical tyrade of statements and repatore that would never happen between people in real life. It was boring tiresome and so bad I choose to write a review to save others from wasting 15-20 min of their lives. I can usually sit through even the blandest of movies but this was intolerable. The best advice I can give is do yourself a favour and avoid this movie at all cost. But if you have to see for yourself, timber I told you so. It really is bad."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "daisukereds",
        "review_rating": "5",
        "review_title": "\"Predicting the rain doesn't count.. building the Ark does\"",
        "review_detailed_main": "Speed, this is not. What you have is a small story of a guy in a car with a bomb following instructions, until it ends. Would not recommend it, even for Liam's fans.\n\nAnd with a name like \"Retribution\" you can easily connect the thin-line plot that the movie throws at you. But it is only one and a half hour of what I consider to be a decent execution of a tense premise with lives on the line. Sadly, I thought that the story deflates after a point and it just tries to end itself in the only way people can expect. There are no action scenes at all and the \"car chases\" are pretty generic. No role or line was charming or memorable. And some developments are questionable.\n\nI'm having a hard time trying to come up with positives aside from \"it doesn't suck, even if it is somewhat boring and forgettable\". The cinematography and locations are good I guess!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "chand-suhas",
        "review_rating": "4",
        "review_title": "It's Liam Neeson telling \"I will find you\". He obviously will.",
        "review_detailed_main": "Matt Turner (Liam Neeson), a financier starts the worst day of his life where he has to drop his teen kids to school. He has become distant to his family, focusing more on his work and thus, he finds himself trapped in his own car, with a bomb under his seat. With the children in the backseat and a bomb that can be remotely triggered as well, he is at the mercy of a mysterious caller who tries to frame Matt Turner and steal the big money. How Matt finds a way to save his kids and reveal this mystery bomber, forms rest of the story.\n\nHaving watched the Spanish original and the Korean remake, I wasn't too keen on watching this remake, set in Berlin yet the location hardly has any impact on the narrative. Like the previous versions, this too almost succeeds with the captivating narrative. The problem with the original was the impact went down the moment the protagonist gets surrounded by the cops and the subsequent reveal was underwhelming. In this remake, the entire third act is changed.\n\nSadly, the changes made completely derails the film for taking easy route, skipping the melodrama. Unlike the original, the episode involving Matt's car being surrounded by cops is short. But what follows later, made me appreciate the Spanish and Korean versions better. Liam Neeson asusual carries the film, bringing in enough vulnerability before giving into his \"I will find you\" act. I am still going with a lenient rating because it's just fun to watch Liam Neeson on screen."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "On time (too late)",
        "review_detailed_main": "No pun intended - I'll get to what I am referring to a bit later. Let's start with the fact that this is another remake of a movie that seems to have a version in every country on this planet ... I actually thought there was a US remake ... maybe there is. I have seen so many versions of this ... I might mix them up.\n\nStill this does try to change a few things. Not many and just a few tweaks here and there. I still think you will be able to guess where this is going. And to circle back to my summary line, if you are German you will have a lot of fun, when one character proclaims that German trains are known to be on time ... well the opposite is the case ... not sure what they were thinking there ... was that \"joke\" on purpose you say? No ... believe me that was meant as a point someone made or rather needed to make ... anyway you will understand when (if?) you watch this.\n\nLiam Neeson has become an action star, though I am not sure the boxing (training by himself) was actually necessary in the beginning. Quite a few cliches .. I'd suggest to watch the original Spanish (language) version of this ... it is far superior."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "mason25",
        "review_rating": "2",
        "review_title": "What an astonishing mess to have been green lit and released",
        "review_detailed_main": "The acting wasn't horrible, but the character choices were all so moronic. Nearly all of the movies issues would have been solved if anyone involved had more than 4 brain cells.\n\nJust sharing information would have gone a long long way towards dispelling issues, or at least towards helping the characters interact in a way that would make sense.\n\nJust telling someone else the exact problem, \"there's a bomb under the seat\", and then his kids or wife or europol agent MIGHT have just taken him a bit more seriously and listened to him.\n\nThe guy wanting him to do things made it seem as if he could see him the entire time, which would only have made sense if he was tapped in to the vehicles cameras/sensors, but nope, he was doing it the old school way, just plain old following in an invisible car that no one else can see.\n\nHe also demands that he transfer some funds whilst participating in a high speed chase/evasion of the cops.... as if he isn't possibly a bit more busy with driving.\n\nWhen the cops have him stopped, the so called sniper has a high powered scope for the 50 or 60 meter shot, on top of that, literally on top of his scope, he has a red dot mounted at a 45°, which makes no sense, the entire goal of sights of any kind are to be as close to the barrels bore as possible, to maintain accuracy. By elevating the red dot 4 inches high and offset, means he's never going to hit anything accurately that isn't at the EXACT distance he set it up for. Any other shot will be off by more than an acceptable amount."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "jon_richardson77",
        "review_rating": "2",
        "review_title": "What a crock",
        "review_detailed_main": "One of the worst films I have scene. It starts ok if very clunkily. But while the action stuff is well shot the plot development, character motivations and dialogue are silly and implausible beyond belief. And they have someone someone from Europol running an operation in Berlin, which it would never do, just to get a British actress on the cast? Except Britain is no longer in Europol!! Meanwhile they have Matthew Modine playing a German without the trace of a German accent. Neeson of course can't do anything but Irish but has an all-American family. It's all ridiculous and insulting beyond belief. .."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "glazehypnosis",
        "review_rating": "2",
        "review_title": "Quit hitting your brother!",
        "review_detailed_main": "Ever get an insatiable craving to listen to someone argue on the phone for 92 minutes while trying to make two kids shut up? Well, great news, because this movie feels like at least three hours of exactly that!...\n\nDo you like feeling smarter than everyone? Great news on that front as well, because no matter who you are, or how little attention you choose to pay, you will spend this movie correcting everyone under your breath, repeatedly.\n\nDespite the fact that what is happening can easily be explained in one sentence, not one character can find the words to explain the situation...unless they also can't get a word in edgewise.\n\nWhere were the writers? It's like Liam Neeson was ad-libbing and also didn't know the cameras were rolling.\n\nThe only viable explanation for the character development in this story is a city-wide gas leak. It's like the movie spent its time procrastinating and never got around to becoming a movie. In fact, I'm starting to suspect that this movie just took its 20 million dollar budget and fled town."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "michvanbeek",
        "review_rating": "5",
        "review_title": "Uninspired Liam Neeson",
        "review_detailed_main": "Retribution is already the third remake of the Spanish original El desconocido from 2015. In 2018, the German Steig. Nicht. Aus! And in 2021 the South Koreans came with Balsinjehan. Then of course the United States cannot be left behind with their version of the story and then of course you immediately use heavy artillery and cast none other than Liam Neeson. Why a simple story like this has no less than 4 versions from four different countries is a big mystery. The story is just very simple and thirteen in a dozen. The film has played a bit of a loan neighbor at Speed, but well more films do and it's not a one-on-one takeover of the story. Well, I have to admit that I haven't seen the three predecessors, so I don't have any comparison material and will only be able to judge Retribution as a film in itself. Neeson (who plays the role of Matt Turner in the film) needs no introduction of course. Next to Neeson, we see Matthew Modine playing as Matt Turner's friend and partner. Modine vaguely knows people as 'Dad' from Stranger Things, but of course you will also be able to recognize him from Full Metal Jacket and the recently published Oppenheimer.\n\nThe film is pretty standard and Liam Neeson does his thing very duly. He seems almost uninspired, as if he really didn't feel like making this movie at all. That is of course a shame, because it is mainly Neeson who has to make this film, because the story is really so terribly standard that you can't expect it to save the film. When Matt Turner gets in his car with his daughter, he puts the bomb in his car on edge. Later he also lets his son board and then the company is complete. You can't get off, because the bomb goes off as soon as the weight of the seats goes off. So far so good. Then Turner is called by a phone that has been placed in his car in advance and he has to go from place to place throughout Berlin to carry out assignments. I won't say I immediately realized how the fork was in the stem, but it didn't take me very long, because after about half an hour it's clear why it's all going. That may not even be such a big problem, but let the story run in such a way that you can still look at each other in the end: okay, that was quite well put together. Unfortunately, that doesn't happen and in addition to Liam Neeson's dutiful performance, the film also ingles in a predictable work.\n\nAfter running from hot to her for a while, the film reaches the climax that his friend's car is blown up. No, this is not a spoiler, because this is already shown in the trailer. Everything looks like Turner is to blame, when he doesn't even know what he did. Only my son and daughter know how it all works and if Matt also finds out that his wife wants to divorce him, there are plenty of motives for Matt of course. By the way, the film doesn't get really believable either. People are already looking for someone who places bombs in cars, so why would Matt put them in his own car, where his children are also in? When Matt is eventually trapped by police, who want to get the bomb out of his car, the Explosive Clearance Service stands next to it with bomb suits and they even let a robot drive to the car, because you have to be careful of course.\n\nAfter running from hot to her for a while, the film reaches the climax that his friend's car is blown up. No, this is not a spoiler, because this is already shown in the trailer. Everything looks like Turner is to blame, when he doesn't even know what he did. Only my son and daughter know how it all works and if Matt also finds out that his wife wants to divorce him, there are plenty of motives for Matt of course. By the way, the film doesn't get really believable either. People are already looking for someone who places bombs in cars, so why would Matt put them in his own car, where his children are also in? When Matt is eventually trapped by police, who want to get the bomb out of his car, the Explosive Clearance Service stands next to it with bomb suits and they even let a robot drive to the car, because you have to be careful of course. That just turned out not to apply to the detective who is just standing next to it in her Sunday clap. I mean of course you don't have to make realism, but this is just stupid and sloppy and completely unbelievable.\n\nRetribution has become a mediocre work, where in terms of acting it seems that Liam Neeson really didn't feel like it at all. He really does his job extremely duty and with a simple story like this, that is of course the death knell for such a film. After half an hour the surprise is over and you know how it all works and then it all becomes a race against time. That sounds like it's getting exciting, but unfortunately it won't. There are also a lot of stupid sloppiness in the film. If you expect Neeson to make a movie like Taken or one of the other cool movies in which he stole the absolute show, you will be disappointed. Incidentally, you see that the years are going to count nicely with Neeson and then you should actually no longer want to make these kinds of films in principle, although this is a dangerous statement from me as a great Sylvester Stallone enthusiast. Let's just keep in mind that it didn't work in this movie and it's to be hoped that Neeson really manages to bang his next movie again, because Retribution is just a moderately disappointing job."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "vizick",
        "review_rating": "3",
        "review_title": "German trains run on time",
        "review_detailed_main": "Where should I start? It's really hard to find meaning when there is none. Rarely have I seen such a bad story or plot. Liam Neeson plays a role that he knows and that was very exciting in the past. But his character makes very little sense. Nobody can grapple the situation he is in, in life, in this car, in his mind, everywhere. There is so little reason. Why would his kids not just leave the car, or he stay in the tunnel when he clearly sees that there are only police, and no cell signal. And why would you try to run, when you are surrounded by police, and your kids are safe?! It really blew my mind when the very predictable antagonist said, \"Luckily, German trains run on time,\" which is perhaps the biggest plot hole of all..."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "kelzerman",
        "review_rating": "4",
        "review_title": "Not that bad, but....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "uzzie-357-516579",
        "review_rating": "5",
        "review_title": "Decent story. Terrible supporting cast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "timeblank",
        "review_rating": "5",
        "review_title": "Entertaining but Not Smart Enough (Spoiler Warning)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "darrenhutchison",
        "review_rating": "2",
        "review_title": "Extremely obvious who it was....",
        "review_detailed_main": "Yet another Liam Neeson taken-esque thriller. Some of these are decent like 'unknown', but this one was just terrible and so very obvious who the perpetrator is. That bad that even if I put it here who it was it wouldn't be classed as a spoiler, the film spoils itself. The acting is a bit hammy too, you almost want his kids to get blown up as they are both horrible. The police woman is really not believable as a detective at all. The plot is basically a mix of a couple of movies, speed is definitely one of them with phone booth a close second. All in all it's just a terrible movie that mildly grabbed my attention."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "eabra48463",
        "review_rating": "3",
        "review_title": "Absolutely Ludicrous Film from Start to Finish",
        "review_detailed_main": "Don't believe any of the positive reviews for this film; it is a terrible production in every way and giving it three stars is actually generous. Liam Neeson plays a successful business person who gets \"trapped\" inside his Mercedes with his children by a mysterious caller who has placed a bomb under the seat of the vehicle. Neeson is told to follow instructions and not leave his seat or the bomb will blow; absurdity ensues. One example is sufficient to convey the ludicrous nature of the plot. The cops refuse to believe Neeson after he desperately tells them there is a bomb under his seat, despite the fact his own kids are in the back of the vehicle and there were already multiple car bombs in the city that very day! What does it take for a guy to get any credibility with the cops? What would be his motivation in lying? Therein lies another problem with the film: The motivation of any of the characters is lacking; we don't know why anyone does what they do and the filmmakers seem to think this doesn't matter.\n\nThe holes in the plot and lack of character development could be overlooked if the movie was actually entertaining. This, however, was too much to ask. Neeson spends the whole movie planted on his butt behind the wheel of the car. A skilled production team might still make this situation tense and worthy, but that's not the case here. There's no action and the script fails to produce the tension we'd expect in a suspense film. The actors also seem to be disinterested; however, lousy scripts often lead to wooden acting.\n\nIf you're looking for a good suspense film, just rewatch one you've already seen. It's a guarantee you'll be better off than watching this mess for the first time."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Leofwine_draca",
        "review_rating": "5",
        "review_title": "Another generic Neeson thriller",
        "review_detailed_main": "RETRIBUTION is yet another generic thriller starring Liam Neeson that you'll forget about shortly after watching. It turns out to be a remake of a Spanish film I've never seen, but doubtlessly that's far better than this disappointing effort which is never as taut or suspenseful as it obviously wants to be. It's a classic single location set up, essentially SPEED inside a car rather than a bus, but our ageing hero seems to be phoning in his performance and the action sequences are so outlandish as to be ridiculous. The film over-eggs the pudding by introducing too many unlikeable supporting characters, and the silly villain doesn't help much either."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "praqoon",
        "review_rating": "3",
        "review_title": "Weak entertainment at best",
        "review_detailed_main": "I've seen some great movies starring Liam Neeson but this is certainly not one of them. From the outset this storyline contains multiple questionable words, actions, and events that left me shaking my head in disbelief. There's nothing I can say about it that's endearing or worth wasting your time watching it for. If you are bored and/or like movies such as Speed, then don't bother with this one or go watch that other movie instead because the plot is laughable at best and unbelieable at worst. No matter how hard I try to think of something good to say about this movie I'd have to be in denial in order to do so. I've given it a 3/10 because the acting wasn't that bad but everything else really was. Oh dear, oh dear."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Cuenquix",
        "review_rating": "4",
        "review_title": "I think I've already seen it...",
        "review_detailed_main": "Retribution, directed by Nimród Antal, is a thriller and intrigue story. It is about how the protagonist finds himself in a rush against the clock for carrying a bomb in his car with his children inside.\n\nIn my opinion, this film is a failed attempt of other films like \"All the names of God\". It has a clear idea, but as time goes by it loses credibility. The characters lose reality in their roles and the story becomes monotonous, although at least it is dynamic.\n\nLiam Neeson may not seem to be at his best in this film, but the fault does not really lie with him, nor with the fact that he is older, but with the script and the lack of originality. There are many empty scenes and some absurd ones where, although Liam acts ten, you don't get to enjoy his essence. It's a shame because I think this actor is brilliant, and he has few films left. Let's hope that in possibly the last one he does, he can stand out and leave a good mark.\n\nIn conclusion, this movie can be entertaining if you watch it without judging, but if you watch it with a little magnifying glass, you will see inaccuracies and mistakes."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "mumfxbeko",
        "review_rating": "5",
        "review_title": "Apart from Neeson's performance, this movie is very bland",
        "review_detailed_main": "Retribution is a typical thriller about a businessman forced to stay in his car due to bombs planted by an unknown assailant. The only positive part of this movie is that Neeson excels in portraying Turner's desperation and determination, while the confined setting heightens the suspense.\n\nApart from that, the movie is very bland on all fronts. The writing and acting performances from everyone else are very underwhelming, while the extremely formulatic plot will not grab your attention. Even the premise of this movie is not particularly original.\n\nI believe that this film can work for you if you're really bored or just looking for some cheap popcorn fun. But apart from that, it's not worth it."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "abrns",
        "review_rating": "5",
        "review_title": "Well below par.",
        "review_detailed_main": "This film is an obviously very very budget conscious affair. This cheap feeling permeates itself through the entire film. Add to that a very wooden performance from the lead player and I think most people will struggle to stay awake!! The only saving grace is Modines performance, however even that is diluted down to get the family friendly PG rating. Not that I can see many families wanting to sit and watch this on a Sunday afternoon. An hour and a half I won't get back! If they had a bugger budget, more realistic dialogue and a better director they may have been able to make it more like Neesons previously typical quiet macho man revenge plot films. This one sadly just does not match up. Maybe time for Liam to retire from this genre now? I know he has become very typecast in this sort of role, but apart from the original Taken, the Irishman dies not suit this type of role naturally as other leading actors have. This film looks, feels and plays out as a quick, cheap, straight to stream film created on a spreadsheet to make a certain figure in return. Very poor fair for Neesons wooden skills and a small part for Modine who is hot off last year's Stranger Things. Come on Hollywood you can do better than this garbage, we as an audience deserve better."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "xzntcp",
        "review_rating": "2",
        "review_title": "From triumph to turkey",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "mdjones2118",
        "review_rating": "2",
        "review_title": "Oh dear",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "CinemaSerf",
        "review_rating": "5",
        "review_title": "Retribution",
        "review_detailed_main": "\"Matt\" (Liam Neeson) is the high flying hedge fund partner who is taking his kids to school one morning when he gets a strange phone call from a strange phone. The voice at the end of the call warns him that he is sitting atop a weight-controlled bomb and that his family are in great danger should he not do as he is told. Just to reiterate that threat, he is to rendezvous with his colleague \"Sylvain\" (Arian Moayed) who is soon no long a concern! To add to the poor man's woes, when he tries to contact his wife he discovers that she is off meeting a lawyer! Can he salvage anything from this perilous, meticulously planned, scenario before they are all chum? For a while, here, Nimród Antal sustains a degree of menace as the mystery unfolds, but sadly - once it does, it's pretty obvious whom the protagonist actually is and the proceeding car chases make the art of simple urban road-blocking by the German police look just a little amateurish! The last twenty minutes are especially disappointing with a denouement that's not short on pyrotechnics but is short on just about everything else. It's a very derivative television movie that if you enjoy the genre, you probably won't hate - the pace sees to that. You won't remember it for long afterwards, though."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "gvidler",
        "review_rating": "1",
        "review_title": "Awfully predictable and awful",
        "review_detailed_main": "So with Liam in a movie like this, I question his intelligence with regards to role selection more than anything else.\n\nTaken it is not. A half a$$ed attempt at robbing every cliche from every rubbish movie ever. Nope. Not even that bad. Worse. The plot holes, lack of ingenuity, low budget and complete lack of any substance makes this the worst movie I saw this year. I hate reality TV but think I would have preferred to watch Love Island. Liam should hang his head in shame because even an intellectually challenged chimpanzee could see this is a shocker.\n\nI'm off Liam. If he thinks a movie like this was worth making then I wish him the best in his retirement. Soo fricken bad....."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "ryanlion-38514",
        "review_rating": "3",
        "review_title": "This was terrible",
        "review_detailed_main": "I love Liam and most of his movies, but this was like stale chicken. It looked good from the outside, but soon as you bite into it ouch! This hurt my head trying to make it through it. I would highly recommend not seeing this if you don't want to tarnish his past films. It made me want to watch Taken all over again to appreciate when a film was made solid. I don't really want to endear that again but it looks like Citizen Kane compared to this bon garbage. It started out looking promising that was the part that got me. This is maybe why I give it 3 or just because Liam Neison is in it. Otherwise avoid this stinker."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "henry8-3",
        "review_rating": "4",
        "review_title": "Retribution",
        "review_detailed_main": "When investment banker Liam Neeson is taking his kids to school he gets a strange call to tell him that there is a bomb under the seat of his car and that if he or the kids get out the bomb will go off. Neeson therefore drives around town trying to figure out how to get out of the situation whilst receiving various instructions from the bomber.\n\nThis largely unremarkable film is riddled with plot holes and a occasionally a rather sloppy script. It does in its favour have Neeson though who does have sufficient acting nous and overall star quality to just about keep you interested plus the last half hour, whilst unlikely, does get quite exciting enough for you forget the holes.\n\nPS - not wholly sure why it's called Retribution."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "deliberatedeceptionjgp",
        "review_rating": "2",
        "review_title": "Main Concepts Stolen from SOLEMNLY SWEAR",
        "review_detailed_main": "Is this a copyright infringement? The main ideas and specific details... man trapped in a Mercedes with a pressure-sensitive bomb under his seat, the disguised voice of the bomber getting revenge, etc., are from a 2007 novel called SOLEMNLY SWEAR written by Joe Porrazzo. In my opinion, the SOLEMNLY SWEAR plot, and the awesome ending, are much better than this film, and they should make that book into a movie! The main character witnesses a car accident of a Mafia Don, and his wife, resulting the wife dying, is it murder? The driver receives threats not to testify. BUT, just when you THINK that you have it all figured out, you don't!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "FixedYourEnding",
        "review_rating": "5",
        "review_title": "I really wanted to like this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "MoalefSajad",
        "review_rating": "3",
        "review_title": "Wrong Direction !",
        "review_detailed_main": "The acting and characters are dull and underdeveloped.\n\nI love Liam (Neeson), so obviously I had to see it. If only I could make up for the time I lost after watching this horribly bad, pointless stupid garbage. The one thing this movie constantly makes you aware of is the fact that in real everyday life, people just don't listen! So, please just listen to every plea ignored by the various parties in the video. The director seems to have done everything wrong... on purpose!\n\nThere's no logical sensibility about anything in this movie, especially about Interpol's callous female police chief. He is given a ton of cases to solve with relevant information, but refuses to listen or believe any of them. This movie is just completely stupid annoying garbage.\n\nThis is Liam's most bad movie in a row, so we can only hope he's back to his good self in his next outing!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Bugeera",
        "review_rating": "5",
        "review_title": "Liam needs to stop with this bs",
        "review_detailed_main": "Movie was boring, action was lacking. Super predictable storyline, acting was poor. I dont know what was the budget but it did look like C production. What was with the blur around Liam at some points, while other characters are having no filters or effects? This was just waste of time overall. So many mistakes and unaswered questions. He is falling into threadmill of movie productions where you dont even read the script, you just film whatever is presented under your legs. So dissapointing. Line of reviews in his movies are just coming steap downhill. He should have at least try to stay a legend, doubt he needs more money."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "romanrock-48568",
        "review_rating": "3",
        "review_title": "Retribution: Average Crap",
        "review_detailed_main": "Having seen enough movies with Liam Neeson, I can confidently call this one one of the weakest, if not the weakest. This actor is often in movies with a similar plot, but sometimes they are pretty good. But this one just awful.\n\nThe banal, but still not bad idea and quite good performance of the actors pale against the background of absurdity and fantastic actions of the main character, which do not carry any logic. The finale puts a point in the mediocrity of this picture.\n\nThe movie is also packed with clichés - it is all over the place. However, it is still an action movie of some sort. Stupid, pointless, but a little bit exciting and in some places unexpected.\n\n3/10."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "steveinadelaide",
        "review_rating": "5",
        "review_title": "Liam Neeson's latest mediocre action movie",
        "review_detailed_main": "The storyline of Retribution revolves around Matt Turner (played by Neeson), a bank executive who receives a phone call from an attacker claiming there is a bomb in his car. Turner's scepticism fades when the bomb detonates in the trunk of his vehicle, leaving him with no choice but to comply with the assailant's instructions. This leads Turner on a chase through the city, where he must engage in perilous actions to ensure his and his family's survival.\n\nRetribution is a run-of-the-mill and predictable thriller that contains a few action sequences and an absurd twist ending. Liam Neeson delivers the only decent performance in the movie, although his character lacks depth, and his motivations remain unclear. The supporting characters are mostly forgettable. While the direction is competent, it lacks inspiration.\n\nRetribution's plot is riddled with inconsistencies and unresolved questions. For instance, it remains unclear why Turner has been targeted by this assailant or their intentions towards him. And, considering his age, Turner still manages to accomplish feats, like leaping out of a moving car or outpacing individuals.\n\nThe action scenes in the movie are well executed. But they don't leave a lasting impression. We've seen it all before - and done better. The twist ending is more silly than shocking and raises more questions than answers.\n\nThe direction of Retribution is competent yet lacking inspiration. Antal handles the action scenes okay but fails to bring any flair to the film. The soundtrack is forgettable and generic, while the cinematography is unremarkable.\n\nAfter watching Retribution I felt frustrated. Let down. I had hoped for a more suspenseful thriller. Instead, I got an unoriginal action movie with predictable twists. I wouldn't recommend Retribution to anyone because it falls short of being a worthwhile action flick. If you're seeking a gripping thriller, there are better choices available."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "tommylitdox",
        "review_rating": "3",
        "review_title": "Good idea, terrible execution",
        "review_detailed_main": "I think the base idea to \"retribution\" isn't terrible. The idea of a family discovering that there is a bomb hidden within their car coul deliver an interesting idea for a movie. However none of this could be found in this movie. First of all the characters were plain and boring and you couldn't empathize with them at all. The experience of watching the movie was boring and dreadful. The reveal of the villain was incredibly stupid and the way our main character got saved was unsurprising and not creative at all. I think this is the best way to describe this movie: Not creative and just boring."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "a_chinn",
        "review_rating": "3",
        "review_title": "Liam Neeson literally sits 90% of this action film",
        "review_detailed_main": "In the words of Rex Reed, \"Liam Neeson's family is in danger yet again.\" An extortionist of some sort puts a bomb in Liam Neeson's car, holding him and his two children hostage, threatening to blow up the car if they get out or don't follow his increasingly dangerous instructions. It's a decent premise along the lines of SPEED or PHONE BOOTH, but this movie is dullsville. Neeson is such a good actor he makes the film almost watchable, but that's about it. Do yourself a favor and skip this Liam Neeson outing, where his main set of skills seems to be talking on the phone and telling his kids in the back seat to mind him."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Giuseppe_Silecchia",
        "review_rating": "4",
        "review_title": "An off-target action thriller",
        "review_detailed_main": "\"Retribution (2023)\", directed by Nimród Antal, promised to be an exciting race against time through the streets of Berlin, but instead, it turns out to be a disappointing journey into uncertain narrative territory lacking bite. The film follows Matt Turner (played by Liam Neeson), a high-finance broker who suddenly finds himself caught up in a dangerous game of cat and mouse. A bomb has been planted in his car, and under threat, he must carry out a series of commands to save his family. However, what could have been a gripping plot soon turns into a succession of clichés and predictable scenes. Nimród Antal, an experienced director with a respectable filmography, seems to lose his way in this production, unable to capitalise on the potential of the source material. While some initial sequences suggest a certain originality, with inventive shots and an intriguing setting, the film soon loses itself in a labyrinth of poorly crafted narrative twists and uneven pacing. Liam Neeson, despite possessing undeniable gravitas, feels out of place in a role that doesn't allow him to shine. His performance, though solid, fails to lift the film from anonymity, becoming one of its weak points. The lack of emotional connection with the audience is crucial in maintaining interest, and its absence is keenly felt. Further exacerbating the film's flatness and lack of relevance is the lack of character development. The protagonists remain two-dimensional and uninteresting, unable to evoke empathy or engagement from the viewer. Even the villain, a fundamental element in this type of action thriller, comes across as flat and unthreatening. The director's technical choices, likely constrained by a limited budget, only serve to highlight the production's shortcomings. Sequences that could be adrenaline-fuelled are spoiled by uninspired direction and unconvincing special effects.\"Retribution (2023)\" proves to be a disappointment for fans of the action thriller genre. Despite its intriguing premise and talented cast, the film misses the mark, offering little more than a series of clichés and an inconsistent plot. Anyone seeking an engaging and thrilling cinematic experience should look elsewhere."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "Stujohnston1",
        "review_rating": "2",
        "review_title": "Don't bother.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "ufacawfi",
        "review_rating": "5",
        "review_title": "Mundane, routine flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "rsinanince",
        "review_rating": "1",
        "review_title": "Just a waste of time!!",
        "review_detailed_main": "Awful acting. Cheap filmmaking techniques. So stupid story. Unbelievable how those famous actors agreed to play in this so-called 'movie.' It's like they left their talent at the door. The dialogue was cringe-worthy, the plot holes were bigger than sinkholes, and the special effects looked like they were done on a budget from the '80s. Honestly, I've seen better productions in high school drama class. Whoever greenlit this disaster should seriously reconsider their career choices. Save your time and skip this train wreck of a film. Who can believe this is the same Liam Neeson who played in the Schindler's List!!!"
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "pmtelefon",
        "review_rating": "5",
        "review_title": "Run-of-the-mill Neeson",
        "review_detailed_main": "I wouldn't call myself a fan of Liam Neeson's movies. Far from it. But for reason, I've seen a lot of them. \"Retribution\" is pretty standard Neeson fare. It's a good looking movie with some great locations. The cast is fine. The only week link is the sometimes tolerable Matthew Modine. A little of Modine goes a long way. As usual, Modine overstays his welcome. As for Liam Neeson, the guy never mails it in. He gives a serviceable performance in \"Retribution\". It's his standard post-\"Taken\" work. Not bad, it's serviceable. It does the job. \"Retribution\" paints itself into a corner pretty quickly. It's an okay Neeson thriller."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "banzon-angelica",
        "review_rating": "2",
        "review_title": "Script doesn't make sense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "adamlmoloney",
        "review_rating": "3",
        "review_title": "Liam Neeson hang your head in shame",
        "review_detailed_main": "Storyline????? There wasn't 1 Ending????? There wasn't 1 Chemistry????? There was none.\n\nI feel robbed of the hour and half that the movie lasted.\n\nLiam Neesons stock really has fallen, if that is what is he thinks passes as entertainment these days.\n\nFor a film boasting Liam Neeson, Matthew Modine and Embeth davidtz, I was truley amazed with how poor the acting and storyline was.\n\nI will say the 2 actors playing Neesons kids weren't terrible, and neither having huge back catalogues of work I would imagine the pair would go on to some decent work in the future.\n\nThe film was a huge miss for me and not one I will be rushing back to watch again."
    },
    {
        "movie_id": "tt6906292",
        "movie_name": "Retribution",
        "movie_rating": "5.3",
        "review_username": "alibabs123",
        "review_rating": "4",
        "review_title": "Cut and paste",
        "review_detailed_main": "An actor you've seen before, reading dialogue you've heard before in an \"action\" movie you've laboured through before.\n\nNothing new from the man that reinvigorated the 'aging action hero' genre with Taken (well, the first one anyway).\n\nA plot older than Neeson himself with action sequences straight out of a 'Christmas 24' thriller. The actors have very little to work with here, probably less so than the script writer(s). And let's face it, they probably had nothing more than a big box of crayons and about 15 minutes!\n\nThe only worry is... How many more 'straight to DVD' classics does Rob Roy have in his locker!?"
    }
]