[
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "omprakash_06",
        "review_rating": "9",
        "review_title": "great movie",
        "review_detailed_main": "This is one of my favorite movie. Watched it many time and every time it keeps getting better and better. A very entertaining, energetic,emotional, inspiring movie. The movie is a blend of excellent screenplay, direction, music and acting, great in every aspect of film making that is the reason why you will want to watch it again and again.\n\nIt's Mansoor khan's excellent direction that every actor Aamir Khan, Ayesha Jhulka , Deepak Tijori,Pooja Bedi really got into the skin of there character, even Deepak Tijori's friends were so good that no one else could take there place"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "fuzzy07",
        "review_rating": "9",
        "review_title": "Must see",
        "review_detailed_main": "The movie is a must see. It really came as something different from all those old masala movies. And as always ... Aamir Khan is perfect. So don't miss that."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "nadkarnisumeet",
        "review_rating": "9",
        "review_title": "Mansoor Khan's triumph.",
        "review_detailed_main": "Jo Jeeta Wohi Sikandar review :\n\nWelcome to the world of Archie comics!!\n\nMost of us have read the series and invariably, would draw reference to all prime characters of writer- director Mansoor Khan's second film after the blockbuster Qayamat Se Qayamat Tak (1988). Come to think of it, Jo Jeeta Wohi Sikandar was a clever adaptation where Aamir Khan was Archie Andrews, Ayesha Jhulka was the gentle and kind Betty, Pooja Bedi was the haughty and snobbish Veronica while Deepak Tijori perfectly defined Reggie Mantle.\n\nIt is first time we got to see such natural characters - college going kiddos and their usual lingo - in a movie so realistic yet magical. Aamir Khan was truly outstanding in the lead role and I fell in love with Ayesha Jhulka and became her fan for life - going to the extent of watching her later duds from Kohra (1993) to Double Cross : Ek Dhokha (2005) in theatres. Pooja Bedi oozed sex appeal in her most memorable performance ever and Deepak showed his grey side in a role coveted by Akshay Kumar at one time.\n\nMansoor Khan's direction was of high calibre and he deserves kudos for taking an inter-college cycle race to such level of excitement in the film's grand finale. The climactic slow motion shots are simply amazing. Jatin Lalit's musical score was another winner with 'Pehla Nasha' topping the charts. My personal favourite is 'Jawaan ho yaaro' imaginatively filmed as a college skit.\n\nJo Jeeta Wohi Sikandar released at the right time for me as I had just passed my school in May 1992 and was waiting to enter college life. I saw it with my school buddies at Matunga's Bijlee Cinema and was simply blown away. I went again the same week to relish it more. The film surprisingly, belied my expectations at the box office and turned out to be just an average grosser performing well in cities but flopping in the interiors. This was clearly a multiplex film in an era when there were no multiplexes.\n\nThe film got its due at the Filmfare awards function winning the Best Film for 1992. It inspired many Karan Johar flicks in coming years starting with his debut Kuch Kuch Hota Hai (1998) and going right till the recent Student Of The Year 2 (2019). But then, Original is Original boss!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "isshvkv",
        "review_rating": "10",
        "review_title": "from Orkut's JJWS-Community-Owner; JJWS is the Best Aamir Khan Movie of all time. - Aamir's Career-Best film !!!",
        "review_detailed_main": "I give JJWS 10/10,100/100,1000/1000-----\"The victory of the underdog\" theme makes for great entertainment. a true classic; it has that Aamir stamp all over it. This is a movie I've wanted to write about since ages. I seriously think its one of the most understated movies of Hindi cinema. It clearly hasn't received its due credit. This is the story of a family;family of a father & two young sons;about the bond between them;story of a small town life. JJWS is so real. Life of a small town boy .... who initially is Carefree & fun-loving;goes to the extent of causing a lot of trouble thru his actions; BUT eventually,he takes a u-turn,turns a new-leaf & Decides to take revenge in a very special-way...he also starts respecting both his Father & ever-supportive Brother......I love that scene {just before final cycle race} where Sanju starts crying & talks to Ratan - feels bad that Ratan couldn't take part in the race because of Sanju's tussle with the villainous Rajput-champ...Victory at the end wiping out all his past-antics----JJWS is complete.The characters just live with you in day-to-day life.The vision of the director is so fantastic,and never has he had to sacrifice entertainment to fulfill it.JJWS covers so many different aspects of a teenagers life and the movie has been so tastefully done that one can easily relate to the theme being portrayed.I say this because I grew up watching JJWS and have seen it almost 60 times and each of those times i have discovered some new aspect of the movie. The attention to detail is immaculate and this is the hallmark of a good movie. One of the most interesting aspects of JJWS is the background score. Not for one moment do you feel that the music doesn't belong there and has been inserted there just for the heck of it (as is the case with most of the movies of the time). The training montage(when Sanju prepares for the final cycle race), the music when the race is going on, the music when the Rajput boys go through MalRoad (shouting Vir Bahadur Ladke Kaun...) and for that matter every second of JJWS has remarkable music complementing the stellar performance. The way the song 'Pehla Nasha' captures the feeling of your first crush cannot be described. Jatin Lalit have really done a wonderful job. Last but not the least the way human emotions have been portrayed in JJWS is beyond comparison. I will never forget the scene in which Sanju(Aamir) tells his father that Ratan has had an accident. The acting by both the actors doesn't go overboard and there's no melodrama; the scene finds its place among the best in my mind.In my opinion JJWS was way ahead of its times in Hindi cinema and has been denied its due credit as a result of internal politics in Bollywood.What really makes JJWS compelling viewing is director Mansoor Khan's simple yet excellent narrative. Most of the characters are etched out well. Some great relationships are portrayed in the movie.....The coldness between Sanju & his dad is brought out in the movie pretty well. Secondly, between Sanju and his best friend Anjali who turns out to be his love eventually. Sanju never sees the love Anjali has for him, until she's the only support he has when he's alone in life. Thirdly, between the two brothers Ratan and Sanju.....who are as dissimilar to each other as one can think of......but are still so close to each other. One of the best sibling relationships portrayed in a Hindi movie. Three cheers for Aamir who has defied his chocolate-boy looks to emerge as the most-varied actor of his time.----- The biggest thing for the people in the town is the inter-school sports competition held every year. Ever since his cycling victory against the Rival school Rajput, Ramlal has been obsessed with Model beating them, through his obedient older son Ratan; Model's model student, in studies, sports and character and the pride of his father. there's one student who can win laurels for his school.....the honest, hard-working Ratan who's the \"gem of Model High School\". Ratan is determined to win this race this time......but courtesy a fight with Deepak Tijori and gang, he falls from a cliff and is badly injured. Model High's only hope.....Ratan can't participate in the race now, and Model has to be content with its usual \"pyjamachaap\" image. Sanju, is a happy-go-lucky bloke who loves hanging with friends and having fun in life even if it causes him to fail classes and disappoint his father. When this sudden tragedy occurs to Ratan, Sanju is transformed from a guy with not a care in the world to a responsible friend, brother, son and athlete. The stage is now set for a tale of friendship,love,family,sports and competition told beautifully by Mansoor Khan. All the performances are in top form.Aamir Khan is as adorable as ever as Sanju. You can't help but love him in this sweet role. Special mention should go to Mamik who plays Ratan. He put in a very sincere performance. you can't say that that was his first movie.he looked like a seasoned performer. It is too bad he wasn't seen too much after JJWS. Overall the movie was excellent. Amazing story, great performances and sweet music, well-defined small-town cinematography,nice melodious songs.....all-gr8-gripping-cycle-race-scenes . From start till end this movie keeps you glued to your seats. Performance...a top notch.Aamir Khan,Mr perfectionist, was totally remarkable.He is the soul of this film.From his starting non-serious attitude to ending maturing person was tremendous. The bike race is symbolic-especially for Sanjay, who finally reaches a level of maturity and realizes what needs to be done in order to prove for himself that he can do what needs to be done along with showing his family that he is capable of doing it. His understanding of his brother matures during the movie. This is a Must See if you enjoy Aamir Khan movies !"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "sai-vineet",
        "review_rating": "10",
        "review_title": "Classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "rajesh-58905",
        "review_rating": "10",
        "review_title": "Aamir Khan's Timeless Masterpiece !!!",
        "review_detailed_main": "No One Make This Kind Of Movies In Bollywood Again! Best Sport + Drama + Romance + Action Movie In Bollywood History A Must Watch Movie In Aamir Khan's Career."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "Fella_shibby",
        "review_rating": "10",
        "review_title": "The best, realistic, coming of age sports movie. It has drama, thrill n comedy too.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "Draconian_Drake",
        "review_rating": "",
        "review_title": "Inspiring movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "akshayrg",
        "review_rating": "10",
        "review_title": "Splendid Entertainment..!!",
        "review_detailed_main": "If you have not yet watched this fabulous movie staring Aamir Khan than do watch it as this is really a must watch flick.It not just holds good on entertainment but is also an inspiring story about transformation of a spoiled youngster played by Aamir Khan. The movie holds great control on nearly all its features.Weather it be the acting by Aamir Khan and the supported cast.Or the music with tracks like Pehla Nasha and the title track. Also a very good cinematography.The last scene is one of the best sports scene in Indian movies.Its inspired by the Hollywood movie \"Breaking Away\" but it contains many of its original features too. Go for this one.You will not be disappointing."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "indranilmuk",
        "review_rating": "10",
        "review_title": "Jo Jeeta Wohi Sikandar is simple superb",
        "review_detailed_main": "The movie is really fantastic and it gives the spectators a mental boost to fight for our dreams. It teaches us that even if we are loosing the game of life, we can still succeed, if we have will power in ourselves. The songs are also superb. Udit Narayan has done the magic once again in this film. Amir Khan, as always has given his best in the movie. But Ayesha Julkha has also equaled him in all respects. I really love watching the movie. I have seen it quite a number of times. I love the songs \"Pehla Nasha\" and \"Nahi samjhe hain woh hame\". The theme of the story is fantastic. A movie which can be viewed universally by all."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "sunildaswaney-63642",
        "review_rating": "7",
        "review_title": "GOOD MOVIE",
        "review_detailed_main": "A good movie with very lovely songs.Over the passage of time,or to be precise 29 years later,the direction and acting were a bit wanting and not as brilliant as i thought it was in 1992.As that time Aamir Khan was not as accomplished as he's now.Nevertheless all in all still a very enjoyable film."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "axaygosai",
        "review_rating": "10",
        "review_title": "A perfect entertainer , a must watch for youth , you will definitely love this..😍",
        "review_detailed_main": "Jo Jeeta Wahi Sikandar..🤴🏻 What a film man...excellent direction...decent performance by cast....one of the best film of amir khan's career..how can I ignore aayesha jhulka...she is so cute and her performance in this movie was outstanding..there were comedy , college romance , friendship goals , rivalry , sports drama etc..if u guys sad for some reason and want to change ur mood..go watch this masterpiece..u will get fresh and satisfy..1992's gem..i wanna watch this gem again and again..this masterpiece will engage u till the end and you will satisfy at climax..and u will fall in love with this gem..i'm highly recommend this movie to all..go and watch it ASAP..😊 peace ✌🏻"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "Curious-from south",
        "review_rating": "6",
        "review_title": "THIS is not a X rated movie!@#%$%^",
        "review_detailed_main": "This is a very cute movie about teenagers of a small town in India. There are rich guys and there are not so rich guys and both of these groups aspire for popularity and success. The subtle day to day confrontation lasts into a final showdown of bicycle race which results in a nice tight climax.\n\nGood movie, colorful and happy and at most PG. The X rate by the IMDB is a mistake."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "baidan",
        "review_rating": "1",
        "review_title": "all viewers from this culture give highest ratings in some strange exhibition of solidarity",
        "review_detailed_main": "Wow, this is absolutely terrible movie. IMDb allows you to explore the world outside of mass culture and lets you get exposure to true cultural diversity. I am huge admirer of IMDb and use it a lot to research wonderful foreign movies. But, sometime you get surprise like this one. This movie is clearly not in range of almost 9 stars. 4 stars it could get ONLY if all viewers from this culture give highest ratings in some strange exhibition of solidarity. 1-2 stars is too high for it unless you need that cultural diversity. Who, in right state of mind, give it more than 1 star, is only question that keeps you watching past 15 minutes. To watch it to the end is too ambitious of a task. Avoid this movie unless you are doing research on psychology of IMDb users."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "chutneylix",
        "review_rating": "",
        "review_title": "Overall a highly recommended film for audiences who appreciate a little drama, good performances and an entertaining few hours.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "singhnishantt",
        "review_rating": "10",
        "review_title": "Best Sports Movie from Indian cinema",
        "review_detailed_main": "What to say about this movie from 90s. Simply the Best.\n\nEmotional attachment you feel with characters as movie progress is huge... and that feeling reaches its peak with a thrilling cycle race in end.\n\nEvery actor has given a best realistic acting with not one actor going overboard, which shows the control director Mansoor Khan had over his actors.\n\nSome people say that is is coped from Breaking Away which is wrong. Both movies are based on Cycle Race and are coming of age movie but that's it. Director Mansoor Khan himself has confirmed that he became aware of Breaking Away only after Jo Jeeta Wohi Sikander was released and likeness was brought to his attention.\n\nActing done by cast, screenplay and attention to detail director has given to this movie is awe inspiring. Mansoor has directed i think only 2-3 movies in his career and this is his best followed by Qayamat se Qayamat Tak.\n\nIf i had to pick one sports movie from Indian cinema to show to someone this will be it. Not even Lagaan, which is good too but more feel good.\n\nJo Jeeta Wohi Sikander is like that crush of yours from school days, which brings smile, longing and happiness in your heart whenever you remember her.\n\nBRILLIANT MOVIE. Period."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "silvan-desouza",
        "review_rating": "9",
        "review_title": "Nostalgia",
        "review_detailed_main": "I still won't forget those days in our childhood days when we used to die to watch such films\n\nJJWS a remake of Breaking Away (1979) But still those days did we care?\n\nThe movie is a nice film based on sports which was rarely tackled those days The film has a nice message too and deals with all aspects like ambition, maturity.etc\n\nThe film starts off well Aamir's wayyard ways lend a many laughs and also the constant bickering between the school guys is fun to watch The reasons that make Aamir grow as a person are well handled and also the finale which makes you feel a lump go down your throat There is also the love triangle.etc which is treated well\n\nThe film did too well that time and is still remembered as one of the best sports films\n\nDirection by Mansoor Khan(Cousin of Aamir) is fabulous Music was a big rage, PEHLA NASHA gave a new style of choreography to the Indian films and all songs are good\n\nAmongst actors Aamir does his role brilliantly, The best part is he never looks he is acting, he is a natural Be it the naughty Aamir to the sensitive Aamir Ayesha Jhulka is as usual Pooja Bedi is awkward but suits her role Deepak Tijori is very good Mamik is good Khulbushan Kharbanda is adequate Don't miss Faizal Khan(in one canteen scene he is standing) and the young Imran Khan as Junior Aamir Khan"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "afaque-54636",
        "review_rating": "9",
        "review_title": "The best sports movie ever !!!!",
        "review_detailed_main": "I was 12 when i first saw this movie...but till today i still feel the energy of the last race.. I remember taking my cycle out for long rides, putting weights in my socks and going for long rides on my cycles.\n\nThe innocent love story, the bonding between friends, the equation sanju shares with his brother and dad. All so perfectly directed and shared on screen.\n\nThe background score and music for the movie was truly much ahead of its time. My mom says, People used to jump of there seats in the last scenes.\n\nA must watch for all. Best Sports movie ever."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "One of Aamir Khans Best",
        "review_detailed_main": "Jo jeeta wohi sikandar is one of the Best Aamir Khan Movies of all time. It received the Award for the Best Film in 1993 Filmfare Awards. Aamir Khan in a young, energetic and comic role gives us another great performance. Ayesha Jhulka is not too bad of an actress, she has made a few Good films including Khiladi with Akshay Kumar. The movie also Stars long gone actress Pooja Bedi playing the role of a golddigger. This movie is 3 hours entertainment. It will appeal more to the youth, since it has a simple storyline of Love, Life and Fun. The movie is based on College life and competition and Aamir Khan is from the poorer College. Deepak Tijori is from the rich college. I grew up watching this film and have seen it almost 50 times. This is a Must See if you enjoy Aamir Khan movies"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "prat38",
        "review_rating": "9",
        "review_title": "Movie with Heart",
        "review_detailed_main": "This movie is different from other movies because it's not just a love story- the movie is more about action and goals. Even when you feel it is a losing battle, you can still come out a winner with enough heart and hard, hard, work. The bike race is symbolic-especially for Sanjay, who finally reaches a level of maturity and realizes what needs to be done in order to prove for himself that he can do what needs to be done along with showing his family that he is capable of doing it. His understanding of his brother matures during the movie, and in the final scene, he is shown jutting past shekhar-and achieving his goal- proving that yes, jo jeeta- wohi sikandar- the one who finishes first, is the winner- fair and square.\n\nBottomline: This is a really good movie *****/5 stars. Also, it is probably THE Hindi movie I would recommend to people- the movie is a family film/drama that has heart and is worth watching."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "abhishek-00445",
        "review_rating": "10",
        "review_title": "Must watch inspiring",
        "review_detailed_main": "A must watch movie for all the strugglers who wanna to break some stereotypes and shine in future.."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "amit-sinhaa",
        "review_rating": "7",
        "review_title": "Another Hollywood remake, but very watchable",
        "review_detailed_main": "It is a feel-good, inspirational, coming-of-age(?), teenage movie with all the typical school rivalries, first crushes and other stuff of which school days are made of. Surprisingly, it is quite well presented, without extreme theatrical stunts typical of Bollyood. All actors look convincing in their roles as young students. Perhaps this is so because it extensively borrows/copies from 1979 Hollywood hit 'Breaking Away'. Why, even the hairdo of the hero's elder brother is ditto same as in the original! (See the pics on IMDb profile of Breaking Away).\n\nStill, quite watchable and has a couple of melodic songs as well. It will especially appeal to school going teens or those of you who want to get nostalgic about the days of yore."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "ashishjoy",
        "review_rating": "10",
        "review_title": "Cult Movie",
        "review_detailed_main": "If there is a definition of classic movie it's this. It never gets old. Still get goosebumps watching it. It almost feels an utopian set for those times in India. The main story line is this cycle race but it has friendships, love, family values and above all beautiful songs."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "ssahaiss",
        "review_rating": "7",
        "review_title": "Looks like this one too is a copy",
        "review_detailed_main": "Seems to me this movie is a copy from Hollywood.\n\nI always enjoyed this movie.\n\nBut seems like this one too has been copied.\n\nThe Hollywood movie is BREAKING AWAY 1979.\n\nBoth the movies have exactly the same theme.\n\nRest both are made equally well and there is no reason to miss anyone.\n\nJust that the Hindi one should be avoided being given the credit for an original idea. But that's my view But if you know both the languages you must see both Both movies have been made keeping the cultural background of respective audience in respective countries in mind Enjoy both the movies"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "ultrasonicteslaop",
        "review_rating": "1",
        "review_title": "It target a community in a wrong way.",
        "review_detailed_main": "It shows that how is the one community in a first 15 minutes they show them as evil it's Bollywood speciality to disrespect one community emotions and traditions .\n\nIn first 15 minutes we see a college which is rich and its name and other as a poor."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "Pinkai",
        "review_rating": "",
        "review_title": "Go; Get Your Bike!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "jainsaurabh-26240",
        "review_rating": "10",
        "review_title": "All in one ...excellent",
        "review_detailed_main": "This movie speciality is it has every thing:\n\nComedy Romance love story Emotional Sports Excellent music Family Drama\n\nOnly thing horror is missing 😀 My fav movie .10 on 10"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "MehdiRizvi-7867",
        "review_rating": "10",
        "review_title": "This Is My Most Favourite Movie",
        "review_detailed_main": "Jo Jeeta Wohi Sikandar review :\n\nWelcome to the world of Archie comics!!\n\nMost of us have read the series and invariably, would draw reference to all prime characters of writer- director Mansoor Khan's second film after the blockbuster Qayamat Se Qayamat Tak (1988). Come to think of it, Jo Jeeta Wohi Sikandar was a clever adaptation where Aamir Khan was Archie Andrews, Ayesha Jhulka was the gentle and kind Betty, Pooja Bedi was the haughty and snobbish Veronica while Deepak Tijori perfectly defined Reggie Mantle.\n\nIt is first time we got to see such natural characters - college going kiddos and their usual lingo - in a movie so realistic yet magical. Aamir Khan was truly outstanding in the lead role and I fell in love with Ayesha Jhulka and became her fan for life - going to the extent of watching her later duds from Kohra (1993) to Double Cross : Ek Dhokha (2005) in theatres. Pooja Bedi oozed sex appeal in her most memorable performance ever and Deepak showed his grey side in a role coveted by Akshay Kumar at one time.\n\nMansoor Khan's direction was of high calibre and he deserves kudos for taking an inter-college cycle race to such level of excitement in the film's grand finale. The climactic slow motion shots are simply amazing. Jatin Lalit's musical score was another winner with 'Pehla Nasha' topping the charts. My personal favourite is 'Jawaan ho yaaro' imaginatively filmed as a college skit.\n\nJo Jeeta Wohi Sikandar released at the right time for me as I had just passed my school in May 1992 and was waiting to enter college life. I saw it with my school buddies at Matunga's Bijlee Cinema and was simply blown away. I went again the same week to relish it more. The film surprisingly, belied my expectations at the box office and turned out to be just an average grosser performing well in cities but flopping in the interiors. This was clearly a multiplex film in an era when there were no multiplexes.\n\nThe film got its due at the Filmfare awards function winning the Best Film for 1992. It inspired many Karan Johar flicks in coming years starting with his debut Kuch Kuch Hota Hai (1998) and going right till the recent Student Of The Year 2 (2019). But then, Original is Original boss!!"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "rakssharma4321",
        "review_rating": "8",
        "review_title": "Most understated movie of Hindi cinema",
        "review_detailed_main": "Jo Jeeta Wahi Sikander is a movie I've wanted to write about for a long time. I seriously think it is one of the most understated movies of Hindi cinema. It clearly hasn't received its due credit. In my opinion it deserves its place among all time greats like Lagaan.\n\nTo start with the movie covers so many different aspects of a teenagers life and the movie has been so tastefully done that one can easily relate to the theme being portrayed. Except for one song which could have been edited (the Diwali song which i always skip), the whole movie is flawless. The performances, the direction and the storyline is par excellence. I say this because i have easily seen the movie more than a hundred times and each of those times i have discovered some new aspect of the movie. The attention to detail is immaculate and this is the hallmark of a good movie.\n\nOne of the most interesting aspects of the film is the background score. Not for one moment do you feel that the music doesn't belong there and has been inserted there just for the heck of it (as is the case with most of the movies of the time). The training montage(when Sanju prepares for the final cycle race), the music when the race is going on, the music when the Rajput boys go through Mal road (shouting Vir Bahadur Ladke Kaun...) and for that matter every second of the movie has remarkable music complementing the stellar performance. The way the song 'Pehla Nasha' captures the feeling of your first crush cannot be described. Jatin Lalit have really done a wonderful job.\n\nLast but not the least the way human emotions have been portrayed in the movie is beyond comparison. Aamir Khan, Kulbhushan Kharbanda, Deepak Tijori, Mamik, Ayesha Jhulka, Pooja Bedi and all the other actors in the film were excellent. I will never forget the scene in which Sanju(Aamir) tells his father (Kulbhushan Kharbanda) that Ratan has had an accident. The acting by both the actors doesn't go overboard and there's no melodrama; the scene finds its place among the best in my mind.\n\nIt must be realized that this movie came out at a time when Hindi cinema was probably at its lowest ebb what with a 50 year old Amitabh Bachchan acting like a 20 year old and dancing behind trees. Even movies which were considered the best of that year like Baazigar cannot be seen today. The clichés and utter nonsense(for lack of a better word) make it unbearable. Compared to this Jo Jeeta still holds its own. In my opinion the movie was way ahead of its times in Hindi cinema and has been denied its due credit as a result of internal politics in Bollywood.\n\nI would like to end by quoting the opening track of nasir hussain productions: \"Kya Ishq Ne Samjha Hai, Kya Husn Ne Jaana Hai Hum Khakh Nashinon Ki, Thokar Main Zamaana Hai\""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "tusharrr",
        "review_rating": "10",
        "review_title": "Great direction",
        "review_detailed_main": "A story set in a scenic hill station and concerning teenagers is a treat to watch. Its amazing to see that that majority of actors who turned out to be major failures later have performed very well. Deepak tijori,Ayesha julka,Mamik,Poojabedi .......all have packed their bags today as far as acting is concerned.But for all of them it must have been a memorable performance. This goes to prove that films are directors medium.A average script with an above average director can make ordinary actors perform like stars. Hats off...Mansoor. What to say about Aamir.He is a true genius and now he has shown his facets as citizen khan. My best regards to him for his future career."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "sheraz_alam_khan",
        "review_rating": "10",
        "review_title": "Everything what you want in a good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "BiswajitSince2005",
        "review_rating": "10",
        "review_title": "The Winner at last",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "drmahimaojha",
        "review_rating": "1",
        "review_title": "Bigot Amir",
        "review_detailed_main": "Amir Khan has always been an offender.. sometimes in a subtle manner and sometimes openly but he always disrespected Hindus,even in this movie..I'm not even a Rajput but I found it really offensive that there's a college named rajput college which has all the bad guys,and at last it's defeated by Mr. Perfectionist..it feels as if he is trying to show us that Rajputs were below Mughals and will be always."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "Dingataca",
        "review_rating": "",
        "review_title": "Arre, jo jeeta wohi sikandar, mere dost!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "vikgup",
        "review_rating": "10",
        "review_title": "outstanding!",
        "review_detailed_main": "one amazing movie, from frame a to frame z. sibling love portrayed so well, unlike the usual over dramatic, overly sentimental Hindi film brothers."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "HeadleyLamarr",
        "review_rating": "8",
        "review_title": "Woh Sikandar hai....",
        "review_detailed_main": "I had been told that this was yet another Mansoor Khan film that was a Hollywood ripoff - this time of the film Breaking Away (1979). So I was avoiding seeing the film. But finally I did see it and yes it is a ripoff, but strangely enough it still manages to please. Aamir plays the irresponsible Sanjaylal - the goof off younger brother of Ratanlal (Mamik) and son of Ramlal (Kulbhushan Kharbanda). He goes to the local school in Dehradun, a town full of elite schools populated by rich boys and girls. The local car bike repair shop girl Anjali (Ayesha Jhulka ) loves him but he is lusting for Devika (Pooja Bedi) the sorority girl equivalent in this film. There is inter-school rivalry spearheaded by 'Deepak Tijori as the hero of the rich guys and Ratanlal as the hero of the poor guys. The cornerstone of this rivalry is a bike race that Tijori has won for two straight years. But dirty work is afoot and Ratanlal is injured. Will Sanjaylal be able to take his brother place and bring glory to the school and his father?\n\nThe film is predictable but still manages to hold one's interest and the sports scenes are quite well done. This film is from an era when extras were juts that - extras - no one other than the main players looks at all like a college kid! But the main actors do a decent job. Aamir is fun as the scamp Sanjaylal - I have always liked him in his 'scamp playing the wide eyed innocent' roles. The ladies are very forgettable, Kulbhushan Kharbanda is great, Deepak Tijori is an adequate other man. The films is well directed and has one great song - Pehla Nasha, and other okay songs. If it were not so blatantly ripped off one could actually go - hey this is not bad at all. But it is still worth a watch and will keep you engaged."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "touch_me_yes",
        "review_rating": "9",
        "review_title": "Oh My My !!",
        "review_detailed_main": "This is a movies which I have watched around 15-20 times in full and at least 50 times only the climax.\n\nIt has one of the best climax scenes I have ever scene, I cannot comment on the technical aspects, but every time you see it, there is a energy that pumps you up.\n\nThis is a movie that starred not so famous (at that time) Aamir Khan, he shows amply why he among the finest actors in the world.\n\nSo the bottom-line is its a must watch movie for all just for the spirit and joy it brings to your life !!\n\n** Its not a Urdu Movie as mentioned on IMDb its a Hindi movie **"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "dey_mayurakshi",
        "review_rating": "9",
        "review_title": "Inspiration",
        "review_detailed_main": "This movie came out at a time where Hindi Cinema was all about mushy over dramatic love stories. Lovers from warring families. College lovers eloping and settling in some remote jungle. Climaxes were all fight sequences.\n\nThen comes this movie which is all about actual youth and their issues. Even today this movie doesn't seem dated. Thats the beauty of this one.\n\nEven within the boundaries of song-dance routine this movie manages to serve a new story full of entertainment and inspiration. The epic cycle race is still one of the best climaxes of Hindi movie history.\n\n'Change your gear Sanju Change your gear!'"
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "nitin2016",
        "review_rating": "8",
        "review_title": "Motivational movie",
        "review_detailed_main": "If you down and out and need inspiration then you are watching a right movie. Contains everything: 1)A Good Story. 2)Good Actors. 3)Nice Direction. 4)Soothing Music. 5)Beautiful Location. 6)Tempting one if you like inspirational movies. 7)Must watch for someone down and out. First half of the movie shows the negligence of the main lead about everything whether it comes to family,education or whatever it is. Then second half tells you the story about what responsibilities can do to you that is what happens in the movie with the main lead, he became responsible for everything mentioned above for the first part and in the end comes up with a winning note above every odds."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "sid-coolking",
        "review_rating": "8",
        "review_title": "All time favourite film",
        "review_detailed_main": "I have seen this one infinitely n number of times...Best Sports film in Bollywood and a must watch if haven't seen it..."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "CriticGirl91",
        "review_rating": "8",
        "review_title": "Entertaining",
        "review_detailed_main": "This movie has a lot of scope for typical Bollywood melodrama, but steers clear of it. It remains minimalist, in the sense that it does not opt for glamour or exotic locations. It is very charming in its realistic depiction of youthful life.\n\nSo, we have college gangs taking over each other in sports, and amidst all the heated competition, several instances of romance. A story designed to win. The songs were hummable, with obviously Pehla Nasha standing out.\n\nPerformance wise, I simply loved Ayesha Jhulka, for me she was the screen stopper. Pooja Bedi was very charming too; and gave an earnest performance. Deepak Tijori was fantastic as always. Deven Bhojani was too cute. I was not very impressed by Mamik and Aamir though, who did not seem to give their best to the role.\n\nOverall, a very feel good film from the nineties, an era of romance and drama. Can be watched without regret."
    },
    {
        "movie_id": "tt0104561",
        "movie_name": "Jo Jeeta Wohi Sikandar",
        "movie_rating": "8.1",
        "review_username": "balrampahade",
        "review_rating": "10",
        "review_title": "Very nice and beautiful movie",
        "review_detailed_main": "Very nice and beautiful movie .I Watched First when I was a child many time and every time it keeps getting better and better. A very entertaining, energetic,emotional, inspiring movie. The movie is a blend of excellent screenplay, direction, music and acting, great in every aspect of film making that is the reason why you will want to watch it again and again.\n\nIt's Mansoor khan's excellent direction that every actor Aamir Khan, Ayesha Jhulka , Deepak Tijori,Pooja Bedi really got into the skin of there character, even Deepak Tijori's friends were so good that no one else could take there place."
    }
]