[
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "anudge",
        "review_rating": "8",
        "review_title": "Nattha, nut tha .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "DICK STEEL",
        "review_rating": "7",
        "review_title": "A Nutshell Review: Peepli Live",
        "review_detailed_main": "Two nights ago Iwas participating in an online live chat with Aamir Khan (well, along with some 13000 others from around the world) who along with wife Kiran Rao, served as producers for Peepli Live, and as a parting remarked, had urged his fans to encourage their friends, especially those who have never watched an Indian film before, to give this a go, because this is not quite like the stereotypical films Indian cinema churns out with larger than life heroes romancing heroines in fantasy dream worlds.\n\nAnd it's true, not that Indian cinema has always stuck with that unmistakable notion of how it presents itself, as over the years I've seen independent efforts that churn out hard-hitting stories that are minus the celebrities, but almost always have a message it wants to tell. Peepli Live departs from the usual 3 hours with interval, song and dance routines, to touch on a stark social issue in India – that of poverty and the lives of the rural folk, how inept the government is in lifting its people out of such a plight, and the role of the media that can sometimes get out of hand with less than responsible reporting. Which more mainstream films like Rann and Raajneeti would have also touched upon, but minus the heartfelt comedy that this satire brought along.\n\nWritten and directed by Anusha Rizvi in her feature film debut, one cannot escape from the fact that her journalistic background may have paved the way at the harsh yet comical criticism of the media in general, where reporters scramble to scoop and spin their own tales of rural life, and are relentless in their interviews with just about anyone who has an opinion on the issue at hand, that of the voluntary death of one of their own. They poke their noses everywhere, and when things turn dull, even resort to fabrication or plain making a mountain out of a molehill. I cannot deny that part of the fun here is watching how television crew and reporters eagerly camp out, in media circus like fashion, in a fictional state and village of Peepli. Just to get a chance at exclusivity with Naatha (Omkar Das Manikpuri) and brother Budhia (Raghubir Yadav) who seemed the smarter of the two.\n\nThese brotherly farmers open the film as we follow them to the city to seek a deferment in their bank loan, failing which the bank has decided to auction off their asset – their land. So an ominous note has rung out, since farmers without land means an automatic death sentence, especially when the land they live on not only provide sustenance, but that of a roof over their heads and that of the aged mother who's at odds with Naatha's wife, and children. They soon learn of an inexplicable government scheme whereby farmers who commit suicide get financial compensation, and soon decide that Naatha take up that offer. Overheard by a local newsman, this soon gets escalated, and the media descends onto the village to wait out and capture Naatha's death live.\n\nLittle do the brothers know, being so caught up in their plight of poverty, that their actions have repercussions on a bigger stage, one known as elections, and with politicians scrambling like mad to find an answer to this issue, because if anyone doesn't spin this properly, it'll translate to votes lost. And here Rizvi's subplot shines through again in her very pointed criticism of the way her government, and just about any other government, work, through the usual pointing of fingers between State and Federal lawmakers, and the half- baked schemes that they cook up that generally doesn't benefit anyone (other than looking good themselves), whether consciously knowing that it's a scam, or incompetently just aren't aware. Bootlickers and yes-men bureaucrats get shrewdly dealt with in the story as well.\n\nIn fact the slight comedy in the film worked wonders to sugar coat the hard hitting messages that Rizvi had intended to tackle, and frankly this may have dulled those messages a little, and ultimately leave one wondering if there's any genuine change that can be brought to tackle the problems at hand. Surely one cannot expect one film to change entire mindsets overnight, and at best, Peepli Live will leave one thinking about the issues, but unfortunately I suppose that's about where it'll stop at.\n\nI'm not sure whether the usual audiences weaned on Bollywood fare may take to a film that's a social commentary on some of the biggest problems facing the country, since the enduring way of how cinema is presented provides pure escapism from common everyday problems, but Peepli Live should find its legs in the more patient, appreciative film festival circuit. Don't expect Aamir Khan to pop up at all in the film, but if you know how he works, then you'd know that his hand is probably in every aspect of this production."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "speeechless-817-705674",
        "review_rating": "8",
        "review_title": "Peepli Live - Pithy satire clad in slick script",
        "review_detailed_main": "Anusha Rizvi has a story to tell and she does it all too un-preachily. No sermons. No grandstands. Her narrative, taking care of every nuance, puts the point right across, and manages to move you. She takes a light- hearted approach to a serious issue. The satire, directed at the media and the government, tends to go tad bit overboard, but is hard-hitting and convincing, for most part. Laudable performances by theatre artists Omkar Das Manikpuri as Natha and Raghubir Yadav as Budhia, (Natha's elder brother). A first timer in the Hindi film industry, Omkar Das is sure to take you by surprise. You may not take to him instantly but his childlike vulnerability and subtle ways, win you over, as the story progresses. Be it his tripping in the gobar, or his confiding in Budhia that he doesn't want to suicide, or the tenderness with which he pats the goat, even as he lies cowering from his own set of woes. (Titbit - Apparently, Rizvi spotted Omkar Das at a play in Bhopal. Until then, Amir was suppose to play Natha) Raghubir Yadav is born to act. He emotes flawlessly. One such scene is where he is arguing with Natha over who should suicide. Within a second, he solemnly vows to suicide, all teary-eyed, in the next, he takes a 'relieved' drag off his beedi, having managed to convince innocent Natha to sacrifice his life ;) From the grouchy (yet entertaining) amma (Farookh Zafar), to Natha's nagging wife Dhaniya (Shalini Vatsa); from the B-grade Hindi news channel correspondent Deepak, to the stoic English news channel reporter Nandita (Malaika Shenoy), it's a perfect cast all the way. The film gets drab and predictable in parts but manages to leave an impact, nevertheless!"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "P_B_W_Brian",
        "review_rating": "9",
        "review_title": "Beats most of the American movies I've seen this year",
        "review_detailed_main": "I'm a native American and saw this movie in a theater with maybe 30 Indians (sorry, I'm old enough to find multiple ironies in that sentence). Anyway, I went into this movie with no expectations. Though I've seen a number of Indian movies over the last few years, I knew nothing of this author or director. I laughed out loud more than I have for any Hollywood movie this year. My cohorts found it even funnier than I, but I guarantee you that you don't need to know that much about Indian politics or media to get most of this satire.\n\nIt starts with a farmer deciding to commit suicide to get his family the $2000 that may save his farm from foreclosure. From there, the media and government turn it into a circus, stepping all over themselves in their self-serving ways.\n\nIt suffers only in minor ways from a few slow spots and odd shifts in tone, but these are worth sitting through. It's currently showing here only at a suburban Atlanta theater that shows a combination of H-wood and B-wood. This should have been picked up by some American distributer when it showed at Sundance. Hopefully, enough people will see it and generate the buzz to get it to a wider audience."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "sanjay-patole",
        "review_rating": "10",
        "review_title": "Excellent !",
        "review_detailed_main": "The film is a hard hitting satire about the country, its people and the living conditions. More importantly, it has exposed the Indian psyche. It shows that India is not run by anybody. It runs on its own.\n\nThe movie also depicts the news media in its true and natural color. I had personally once noticed that \"Knee surgery for the PM\" was the headline and \"24 farmers commit suicide in a week\" was under \"News in brief\" section. Some news channel report every news item as \"Breaking news\". Basically, they magnify, marginalize and sometimes distort any news depending upon who controls them. Everyone has vested interests.\n\nAll news channels have just one objective. Drive up their rankings. To do that, they will go to any extent.\n\nThe movie also depicts politicians in their true color. It is a known fact that they will do anything to win the elections. Well, you cant expect anything else from them because 99% of them are high class thugs.\n\nThe movie is not meant for the average Indian who expects the formula (1 hero + 1 heroine + villains + 4 love songs + i item girl song + 4 fight scenes) I loved the language used in the film. It is the way a farmer would speak. No fancy monologues (usually referred to as dialogues). There are a few bad words and I wonder what the impact will be if those are removed.\n\nI strongly recommend this movie because the situations are quite funny and at times you will laugh like crazy.\n\nSo go ahead and enjoy!"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "colour-me-kubrick",
        "review_rating": "",
        "review_title": "Long Overdue",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "naman-avastol",
        "review_rating": "7",
        "review_title": "Funny Yet Thought Provoking",
        "review_detailed_main": "Bollywood is changing finally! Bigtime!! Makers are now finally shifting their focus on realistic movies rather than making movies having same old clichés and melodrama. Latest film to add in the list is Peepli Live. Produced by ever dependable Aamir Khan, the movie has no big name in the star cast but kudos to Débutante Director Anusha Rizwi's superb screenplay and direction and combining with monstrous marketing strategies by Aamir Khan this created waves worldwide.\n\nThe subject of the movie is simple yet thought provoking. As India moves to an industrialized economy, farmers are committing suicide. Self- serving politicians at all government levels have been unwilling or unable to do anything about this. While the movie might appear as a spoof on the farmer suicides but it ends up conveying much more and presents some shocking facts.\n\nPeepli residents Natha(Omkar Das) and elder brother Budhia(Raghuveer Yadav)after losing their land to the bank for not paying up their loan take the jest seriously and decide to volunteer. Natha decides to commit suicide and it becomes a big news. Reporters Nandita Malik(Malaika Shenoy), Deepak(Vishal Sharma) and a local reporter Rakesh(Nawazuddin) along with others make it a big issue and eventually the positions of many ministers is at stake. What follows is a very well directed satire.\n\nAnusha Rizwi has handled her directorial debut like a pro.The lingo is earthy and much humour is derived from the manner it is spoken by the characters. Anusha leaves no stone unturned to poke fun of vote hungry politicians. Acting Department is ruled by Omkar Das and Vishal Sharma. Expressions given by the former make his character very endearing and the dialogues spoken by the latter are hilarious. Raghuveer Yadav has enacted his role impressively! Nawazzudin is exceptional as the reporter whose conscience awakens. Shankar Raman's Camera work makes a good impact. Music by Indian Ocean is OK.\n\nTo conclude, I would say go for it is you really want to see bollywood coming of its age and of course because its an Aamir Khan Production.\n\nMy Rating: 7/10\n\nThanks & Regards"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "vivee003",
        "review_rating": "9",
        "review_title": "Take a bow Anusha and Aamir!",
        "review_detailed_main": "Peepli (Live) is a movie which had enormous expectancy levels from the trailers and the very fact that it was produced by THE \"Aamir Khan Productions\" which had gave birth to many enchanting & consummate cinematic experiences on celluloid... It has absolutely educed even more than the hype it produced, with Anusha Rizvi, a débutante, furnishing an outstanding satire on the backdrop of Indian farmer's suicides...\n\nNot getting into the plot, as most of them know it already... What makes this movie into an astounding cinematic experience, is its utmost natural narration and simplicity.. Whether it be the characters, situations, dialogs... all were just near to utmost realistic...! Humour element used throughout the movie was smart as a whip... Loved the movie for another factor, that it was not preachy at all... Ending which was terrifically weaved out, in some ways, reminds me of one of the greatest satires in Malayalam \"Panchavadi Paalam\"\n\nAnusha Rizvi, being a débutante, doesn't feel like one as the handling of the subject was just awe inspiring... Music and BG were top class... Camera work was good...The screenplay and dialogs were just tight and perfect... Among the performances, the whole cast were literally living their characters in this movie which makes it even more special!\n\nOne the whole, one should give a whole hearted standing ovation to Anusha Rizvi and Aamir Khan for making this film a reality,which has an amazing potential to be India's iconic movie in the International circuit!"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "spiritlife",
        "review_rating": "6",
        "review_title": "To Laugh or Not to",
        "review_detailed_main": "Indian Cinema off late has matured and produces a treat now and then. I would reckon this one was not an out of the league project of Aamir Khan but certainly an earnest effort, given that the director is on debut. The film portrays the bitter truth of rural India, mocks the Indian media and gives a tight slap on the political system and bureaucracy. I went to watch the film with the notion that the film belongs to the comedy genre, but it did not take much time for me to realize it was satire, it was pure dark humor and felt pity for all those ignorant souls in the cinema hall who are just so far away, so disconnected from real India that they could afford to laugh on such irony. It sure would have been a wakeup call for those ignorant souls if they understood the hidden satire, carefully wrapped in humor. God save those who came to watch a comic movie and went out of the hall smiling and mocking the plight of Nathu Ram. As far as acting is concerned, Onkar Das has done a very good job, despite the fact that he gets less chance to showcase his dialog delivery yet he has conveyed director's idea marvelously using his expressions. I believe he has surpassed Raghubir Yadav, who has yet again proved the point that he is still among the best in the business. One liners and abusive lashes of Nathu Ram's mother give you some respite from the serious note of the movie. Though the cast had no star power except Naseeruddin Shah and the director was a débutant, Hats Off to Aamir for delivering yet another Thought Provoking and intriguing gem. The movie succeeds in informing the ignorant urban population, population which believes India is prospering, about the truth of real India. Face the reality dude, time to wake up. A definite one time watch."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "Hunky Stud",
        "review_rating": "10",
        "review_title": "When will Chinese directors make a good film like this one?",
        "review_detailed_main": "I have seen quite a few Indian films. Most of them are about love with plenty of singing and dancing which can become boring.\n\nThis film is a total black comedy. It is not about love, it is entirely different. And if you like this one, you should definitely watch the other one - Well Done Abba! Both films are about poor people dealing with bureaucracy in India. India and China all have large population of farmers, poor people. And both countries have tons of bureaucrats to deal with.\n\nOnly in India, can this film be made. If someone wants to make a similar film in China, his/her project will be guaranteed to be rejected by the Chinese government due to its lack of \"patriotism\". In mainland China, no director can make a movie that is exposing the dark side of the Chinese government.\n\nI enjoy this movie very much. Unlike other Indian films which are almost always more than 2 hours long. This movie ended right on time, only about 90 minutes long. And it didn't have any particular singing or dancing scenes which are really improper for this kind of topic.\n\nI only wish that some Chinese directors can watch this film and the other one \"well done abba\". And I hope that the Chinese communist government will be overthrown soon, so that Chinese directors can have the freedom to make some good meaningful films just like this one."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "satyanshu_singh",
        "review_rating": "7",
        "review_title": "Intent and Imperfection",
        "review_detailed_main": "Aniruddha Guha (DNA) writes in his review of 'Peepli Live' that it 'leaves you impressed but unaffected'. I read the fairly positive review, trying to find out whether Guha tries to diagnose the reason behind this impression he gets from the film. Perhaps he does. I'll try to elaborate.\n\nThe premise of the film is extremely powerful, as it plays around, in a stark black comedy, the expected death of a poor farmer, Natha. But in spite of brilliant performances, sharp and intelligent lines, and a different, 'real', and believable setting, there seems to be something missing. And that 'something', in my opinion is the mantra all screen writing gurus insist on. I would name it: 'Progression and Pace'.\n\nAfter establishing the primary conflict of the film, the writer is supposed to take us on a journey. Not to a circus where we sit and wait for performers to exhibit their vibrant colours but to an active, involving journey of human emotions. Irwin Blacker brilliantly puts it as: \"Plot is more than a pattern of events: it is the ordering of emotions.\" To invoke the desired emotional response, the writer has to establish a serious 'want' for the protagonist – what exactly is at stake; the higher the stake, better the chance for drama. But to actually achieve drama, the writer needs to elaborate and enhance the conflict. Create obstacles in the path of the protagonist who is striving to achieve his dramatic need. These obstacles, preferably as harsh as they could be, and the protagonist's efforts to overcome them is what makes drama affecting. His success or failure in doing so is hardly important. And this entire act of confrontation has to crafted with intelligence and an acute critical eye, making sure that each scene takes the story forwards – it progresses from one plot point to the other with a definitive sense of purpose, remembering that each tree is important without losing the idea of the forest.\n\n'Peepli Live' has the 'want' perfectly in place. But it lacks a purposeful progression of story through well-defined obstacles and attempts by the characters to overcome them. Also, the presence, and active involvement of such a large number of secondary characters causes the plot to meander, not meaninglessly, but diluting the force of the impact. There are sequences which do work. But notice carefully – all those instances are strong plot points, high on conflict-want confrontational drama. Of course, this is a very orthodox approach of writing films. And if you are a genius, you can actually make a beautiful and affecting 'circus-like' film on a thin plot if you manage to create memorable characters and sequences, as Fellini did in most of his movies. But for all of us who are not Federico Fellini, and I think most are not, the conventional rule of 'progression with a sense of purpose' is the rule to follow.\n\nThis brings me to the 'pace' of the film. Contrary to the common notion, a film need not be 'pacy' to make an impact. It is attaining just the perfect pace suiting the mood of the film that matters. 'Peepli Live' has apparently too many things happening without actual progression of the story during the most of its hundred minutes. The story is stagnant, but the 'events' are happening hurriedly. So, we do not get time to think and feel the drama that is already minimal. Hence, we feel unaffected. The most affecting portion of this satirical film created in overtones is the final sequence, the denouement or the post-climax. Over the faces of Budhiya and Natha's wife, lost over their bleak fate and ignorance about Natha's reality, the camera makes an obvious meandering motion backwards. Kieslowski would use such camera movements to suggest some supernatural 'eye' looking at our characters. I could not help but feel the same as the camera pulls back and after a long journey through villages and towns reaches a modern city. Without a word more of dialogue or staged action, it presents before us the faces of numerous labourers working at a construction site – all migrants from rural India – trying to survive in the inhuman loneliness of the polluted cities? One of them is Natha, and we have just witnessed his story. But wouldn't there be similar, if not equally heart-wrenching, stories behind all of these helpless faces? There is so much conveyed during this entire closing sequence. And although the closing title reduces it to a 'fact' about farmers in India who have left agriculture and spoils the understated brilliance of it for me, it still succeeds fairly. Notice that this entire sequence has only one strong dramatic reveal; otherwise it is just the stagnancy of its progression, or the 'slow' pace that generates such a strong emotional response in us.\n\n'Peepli Live' would work better in its repeat viewings, when you already know the story, its nature and limitations. It's then that the wonderful detailing and the 'moments' in its narration will make you smile. Its business story and importance, or the lack of it, in Hindi cinema history will always be worth discussing. But to understand the triumph of cinema, we need to keep these aside. The intent of a movie and the courage behind its making must be applauded if it deserves that. And after having done that justly, to really understand the cinematic achievement of it, the craft of the film should be analyzed. Perfection is not the prerequisite for great art, it is the stimulation that it provides to the audience is what matters. 'Peepli Live' does that, by not only making you think about the social issue it addresses but also, if you are interested, by inspiring you to diagnose the merits and demerits of its craft as a work of cinema. That, I believe, is enough of an accomplishment."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "psarjun",
        "review_rating": "9",
        "review_title": "Dark Comedy and Deals with a Serious current Issue",
        "review_detailed_main": "Story: Story of two farmers Face loosing their land for an unpaid Government loan. At the time of National Elections they seek help from a Local Politician who suggests to commit suicide to get the benefit to their families.\n\n* The Director and Producer deserve thumps up for coming with a movie with current issue - Farmers committing Suicide. * You too would have noticed 'What the News Channels' Want?! They are also marketing something, yes SO CALLED NEWS. And they market like anything. 'Death Toll Reaches 50 and Expected to reach 100 by Tomorrow morning', 'Breaking New - MLA's Sister had Knee Injury' etc..\n\nBollywood - Its very happy see this kind of movies in an Industry where Actors become just a Marketing Executive for their loose Products. Though there are a lot of Directors who just copies and rips from Hollywood or South Indian Movies, there are also few and very few directors and Productions houses who try to come up with new Innovative ideas. UTV is one such Brand and its great to see Aamir Khan producing as Movie in the kind of changing Bollywood to more meaningful.\n\nThe style of Director is sharp and strong though the director missed to convey a message - but sticked in to the story and left no Message. The film explores the response of the media. Many Scenes of the film spoofs the Internet and TV Media and Politics. The Natural and Simple Narration will take you to those good old Days where only good movies where produced. Problems of Farmers was usual topic in Malayalam Movies but Post 2000 - this is the best movie about Farmers to come in India.\n\nBollywood rarely make Sensible movies and Rarely does the Fans make them Box Office HIT. Different Attempt is not accepted easily in North comparing to South of India (Tamil, Malayalam and Kannada) wishing to see more people watching this movie. Promoting this movie only makes Bollywood Look better. Let they come up with more meaningful Movies here after."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "siddharthkunwar",
        "review_rating": "6",
        "review_title": "peepli live over-hyped",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "ojasmehta1",
        "review_rating": "2",
        "review_title": "Disappointing and Depressing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "unclewalker",
        "review_rating": "9",
        "review_title": "Chola Maati ke Raam",
        "review_detailed_main": "(2/2)Actors have done their job in the most remarkable way.Raghuveer Yadav can win an Oscar for that but alas Academy is Bollywood- blind.Omkar Das is very natural.The actor playing reporter Deepak is a revelation.Aamir could have done a cameo.\n\n(2/2)The story is a wonderful satire.Rizvi being a retired-reporter knew the nuts and bolts of the dirty business.The subplot of Hori Mehto remind us of Do Bheega Zamin.\n\n(1/2)Direction of Rizvi collapsed in the last half hour of the movie.The subplot was wasted and climax was done in a hurry.\n\n(2/2)The music/score is this year's best.Indian Ocean are superb.Chola Mati ke Raam,Mehngai Daayan,Desh Mera,Aadmi are all well crafted.\n\n(2/2)Yes,the movie do have a X-FACTOR.Well paced and presented in the current inflation scenario."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "lediscipledessocrates",
        "review_rating": "8",
        "review_title": "Foul mouthed Truisms and Suave lies.",
        "review_detailed_main": "Contrary to my gut feeling Peepli Live wasn't too bad a movie to catch , especially when you are looking for entertainment in it's more rudimentary form.\n\nMinimalist in her approach, The director of this movie has proved beyond a doubt that melodrama and reality are two very different and hardly reconcilable things. Bare naked in it's projection of Indian Villages, the movie is what Khosla K Ghosla was to the middle class. In fact one feels nauseatic watching those ridiculous 80's 90's flicks where village folk were depicted as specimens from a high end fancy dress exhibition. With damsels wearing mutlicoloured , skimpy clothes and men wearing hideous outfits bearing no similarity whatsoever with the actual village attires.\n\nPeepli on the other hand treats everything as it is. The movie is devoid of glamour, any glamour. Which means the movie , given it's theme, is good.\n\nThere are no subplots which drag the viewer away into romantic liaisons. No sugary silver linings here.\n\nThe entire cast fits in well with the theme and also makes us wonder as to how can all those Khans, Kapoors , Khannas call themselves actors .I mean the actors in the movie didn't give away anything.\n\nThe script however was ridden with too many profanities for comfort. The movie could have done without them as well . But that's creative freedom and also gave some folks in the theatre something to cheer about.\n\nThe movie is good."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Breaking News: Live telecast of Non-India shining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Joy/Sad Ride!",
        "review_detailed_main": "Anusha Rizvi's 'Peepli Live' is a terrific film, that leaves you baffled. Rizvi's screenplay is innovative, while her direction is sharp. Produced by India's current No.1 Superstar Aamir Khan, here'a film that you'll remember for quite sometime.\n\nA satire on the farmers' suicides and subsequent media and political response. Will Natha Die? Will Natha Live? That's the question we've been wanting to know, ever since, the promos hit the air. The answer to that... I suggest you make sometime and visit this tragic-comedy and know yourself!\n\nHowever, 'Peepli Live' is not without his shed of minuses. The first hour, especially, is very slow. Also, the film tends to get too Loud and Irritating at times. For example, the portions between Natha's wife & his Amma are annoying. The Amma screams her lungs out! These minuses cannot be forgotten!\n\nComing to the acting, Raghubir Yadav is fantastic as the selfish brother of Natha. Omkar Das Manikpuri as Natha, is quite good. Farookh Zafar as Amma, is irritating! Shalini Vatsa is loud as well. Naseer bhai, repeats his act. Malaika Shenoy is very good. Nawazuddin Siddiqui is effective, in a brief role. Others do a fine job.\n\nOn the whole, A must watch film! But, again, it's no flawless film. Mast hai, Zabardast Nahin!"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "wireless-heaven",
        "review_rating": "9",
        "review_title": "Brilliant!!!",
        "review_detailed_main": "Peepli is another piece of magic from Amir Khan Productions. The best part of the movie is that it raises issues without getting melodramatic and preachy like other bollywood stuff. Script is compact and stays true to its story. The story consequently touches your heart, especially 'Hori Mahato',( if anyone has read Premchand's 'Godaan') whose death almost broke me into tears. The scenes are well placed with perfect ensemble of fine actors to play them out. The comic placement makes this movie fun to watch, The characters of English 'know it all' journalist and Hindi reporter are reminiscent of we all know who, politicians and bureaucrats are ridiculously close to what they are in real life, and the village people are as close to reality as i have seen in any Hindi movie till date. Music by Indian ocean and Ram Sampath captures the essence of the movie, the only odd thing is the placement of 'mehngayee... ' song in otherwise flawless movie. i would recommend this movie for everyone..."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "kunalkhandwala",
        "review_rating": "6",
        "review_title": "Funny in parts but empty in the end",
        "review_detailed_main": "The destitute condition of India's rural areas and depravity in business and politics have been depicted on screen with three distinct approaches. Documentary style, satirical and revolutionizing.\"Jaane Bhi Do Yaaron\" is among the greatest comedies and political satires ever made with its take on builders, politicians and the plight of the common man when muddled in a conniving cover-up plot. \"Swades\" depicted rural India's real deprived conditions from the eyes of an outsider who was keen to change things from the ground level. Its docu-drama style with some memorable characters had an impact that can be simply defined as 'moving'. Then, we have \"Rang De Basanti\" that redefined the way we think about our attitudes while instigating the desire to be bold, inspiring and rebellious in the midst of India's corrupt political and business environment. Peepli (live) does not follow any of those approaches. Director Anusha Rizvi attempts a social satire about the plight of farmers who are unable to provide for their families and while the film maybe able to touch you, it does little to Move you.\n\nThe film tends to look like a documentary by Doordarshan while also going overboard with its satirical take on media's exposure of events. Natha, played by Omkar Das is encouraged by his brother Budhia (Raghuvir Yadav) to commit suicide as upon his death, the government would grant a lot of money to his family. While the ensuing effects of a local reporter overhearing Natha's plan build to some funny situations with media's extensive coverage in Peepli, the broader ramifications would threaten the state election campaign of the prevailing party.\n\nThere are some noteworthy scenes that Anusha Rizvi deserves appreciation for:\n\n-The heated debate in the newsroom with Naseeruddin Shah as the Agriculture minister -The arrival of the media bandwagon to the small village of Peepli -Backward classes leader 'Pappulal' gaining political footage by rewarding Natha and guaranteeing his death in front of the media -Hori Mahatho's angle to portray irony and tragedy to the happenings in Peepli while lending some gravity to stir up your conscience. -Reporter Rakesh's conclusion -The symbolic journey of the camera in the end to travel far away from Peepli to Delhi\n\nThe cinematography throughout is remarkable. From camcorder like footage to capturing simplistic visuals of the village, its characters and the closing sequence of the journey, the picturization is very different in making reality look real.\n\nBut like all movies, the whole cannot be made of such few parts. Peepli has numerous subtle flaws that simply leave an empty feeling in the end. Yes, the tale is touching and the sad state of affairs of our country's majority is tragic but there was immense potential to do a lot more with a subject like this. Peepli does lack memorable performances. Veteran actors like Naseeruddin Shah and Raghuvir Yadav have been wasted in roles that made little impact.\n\nKundan Shah's 'Jaane bhi do Yaaron' is a legend because the common man viewed his circumstances as a tragedy while the rest were comedians determined to cover up their folly in a satirical plot. Peepli tends to be a satire on the plight of farmers who cannot afford to make ends meet and support their families. While it does so in brilliant fashion in many scenes with the media, concerned citizens with their candles and overconfident politicians, it gets repetitive, loud (Old Mother and wife), superfluous (media covering Natha's morning ritual) and detachable. The last adjective has been deliberately used because towards the end of all the drama, one does not really empathize with Natha's condition simply because you tend to lose your bearings on whether to be sympathetic, angry, frustrated or to just laugh it out.\n\nThe second half of the film introduces some gravity with Hori Mahatho's character, Rakesh the reporter and the lost Natha and it stops being the satire that we laughed over for the first half. Now all of a sudden, we are to become serious, empathize with Natha's situation, understand the TRP hungry media's role in the story and think how this can be stopped! But there too, the movie falls flat. In the midst of development, we see Natha even more helpless than he was with his own people. Imagine if 'Mohan Bhargava' had remained in the USA at the end of Swades or if our revolutionaries in Rang de Basanti had moved on with their lives in college instead of storming into All India Radio.... That is exactly how Peepli decides to let you go. You come out with awareness about a farmer's helpless situation but wonder if it could be changed, or whether it was all to be taken with a pinch of salt or if there was an alternative to end such misery. In short, you go in empty and walk out empty.\n\nMehengai Dayain is true to the film's first half characteristic of poking at reality and while it's a laudable effort by the village troupe, it is not very likely that you will listen to it out of choice at home/car/train/office. What does stand out is Indian Ocean's exemplary work with Zindagi se and Des mera. The music is fusion Desi in true Indian Ocean style with rich lyrics and soulfulness. Unlike those lyrics, the film is unfortunately quite empty on the dialog front.\n\nFor those who haven't walked through small villages may find the film's backdrop quite overwhelming and disturbing and may hopefully donate a color TV or so to a deserving farmer but the rest of us who have seen some reality even though from afar, will find little worth applauding for in this 90 odd minute saga of suicidal farmers, power hungry politicians and blatantly sensational media. Peepli (live) will nevertheless be the most outstanding example of how an impeccable iconic figure like Aamir Khan can turn a haystack into a jeweler's store.\n\n6.88 on a scale of 1-10."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "akshayrg",
        "review_rating": "9",
        "review_title": "Finally we have some meaningful Cinema..!!",
        "review_detailed_main": "When i first heard about this movie some time ago I thought that this movie was going to be good movie but it will not be much to be talked about.But now as Mr Aamir Khan has once again proved himself as a brilliant marketer,the movie is one of most talked about movies in recent times. Carrying a meaningful subject,this film proves that how even a serious social topic could be presented interestingly.The film is thoroughly entertaining.Its a sarcasm on the social structure of this country.Not only politicians,but also on the electronic media.An effort should be made that every minister and members of parliament should watch this movie.But its even a chance that they will sleep again after the film gets over."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "Though good as a comic satire but Sorry to see Aamir Khan and his team making fun of a serious issue of Farmers Suicides in India.",
        "review_detailed_main": "From a normal moviegoer point of view the film is a fine entertainer but not a thoroughly entertaining flick right till its end. The movie starts off well with few good dialogues hugely supported by the abusive language as heard in the local lingo of the villages. The audience laugh out loud when the local people talk to each other with all those \"Gaallis\" and added adjectives. And they further also enjoy the taunting conversations between the ailing grandmother lying on the bed and her young daughter in law. Out of the two brothers in the story, Raghuvir Yadav, the elder one is more enjoyable as compared to the leading hero of the movie, Omkar Das Manikpuri as Natha. Even when the younger brother announces his suicide, Raghuvir Yadav still remains the most amusing character moving around Natha all the time.\n\nAfter its initial half an hour, the script mainly focuses on the huge circus of media people and politicians playing around Natha and his suicide announcement. The cunning yet truthful portrayal of T.V. journalists, Channel TRPs and hungry politicians looking out for their votes is no doubt impressive and executed brilliantly. But after a while this all becomes quite monotonous and repetitive. Till the scene of Natha's disappearance the proceedings become slow and rather unexciting. But then the climax comes just like as expected from a comic satire leaving the viewer to think and let him have his own conclusions over the ending. However to some people, the end may also seem to be abrupt and not entertaining enough if compared to the whole movie. Hence, looking from the angle of a normal viewer, PEEPLI (Live) is a good entertainer having few funny sequences and dialogues. But for the family audiences, taking their young kids along in the theater, the abusives strongly used in the dialogues may bring a certain kind of embarrassment on their faces.\n\nNow, coming to the negative vibes associated with the movie, I would like to admit that I was really expecting a more hard hitting and bold movie from the house of Aamir Khan. A film which should have shown some guts to ask the concerned authorities for their answers.\n\nBut after watching PEEPLI (LIVE), I was somehow disappointed since the motive of making the people aware was no-where visible in the whole movie till the end. Frankly speaking, as the movie ended, I just realized that Aamir and his director Anusha, had basically used this relevant theme in a comic style only for their own gains and they were actually least concerned over the seriousness of the issue in the villages.\n\nThough the movie does have a sequence of a poor farmer named Hori Mahato (remembering a character from Premchand's Godaan), dying from weakness and hunger for whom no T.V. coverage or story is done by the journalists. But the sequence is so short and briefly shown that it leaves no lasting impact on the viewer to make him think. Moreover, I also couldn't appreciate the scene where a 10 year old child asks his father \"Kab Maroge?\".\n\nTruly speaking, after the intermission, I simply felt that the movie which could have raised a big question in the society just ends up like another comedy movie from Bollywood where the audience is made to laugh at the helplessness and pity situation of the hero.\n\nTo be precise, looking at the track record of both AAMIR KHAN Productions and ANUSHA RIZVI, a more decent, thoughtful and responsible movie was expected from the duo, which should have been another eye- opener for the entire population of India. But sadly PEEPLI (LIVE) doesn't rise above the level of a fine comedy which hugely depends upon its abusive dialogues and mean sequences. The film neither explains the tough conditions faced by the farmers in the villages related to their farming nor it establishes any emotional connect between the main protagonist and his viewers.\n\nNo doubt, director Anusha Rizvi makes an impressive debut, but in order to give the movie a light comic touch, she takes the limelight away from the main important subject.\n\nTalking about the performances, the entire cast has enacted realistically and the director indeed deserves her praises for that. Every contributor in the movie from the unknown Manikpuri to the veterans Raghuvir Yadav and Naseeruddin Shah have excelled in their performances respectively. Cinematography takes you into a different world altogether and the Soundtrack using the traditional instruments and lyrics suits the background of the movie perfectly. The song \"Mehangayi Dayan\" has simply struck the right chord with the viewers arriving at the right time, when the prices are really shooting sky high in the country.\n\nBut here I would also like to add that the concept of the movie isn't completely new or fresh as being written in the press all over. We have witnessed similar kind of themes (though with a different background) in Frank Capra's \"Meet John Doe\", which was later adapted in Bollywood as Amitabh Bachchan's \"Main Azaad Hun\" and also Naseer's \"Hero Hiralal\".\n\nSo, for me PEEPLI (Live) only remains an above average comedy made on a serious issue which fails to address the core question in the much desired manner.\n\nFor the readers interested in knowing about its box office prospects, PEEPLI LIVE has already made profits for its producers even before its release by selling all the other related rights of the movie. So in that respect AAMIR KHAN has got another winner in his pocket without any doubt."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "fociinaved",
        "review_rating": "10",
        "review_title": "A bold attempt made in Indian cinema",
        "review_detailed_main": "Peepli live is very different from all same stereotype Indian movies.Usually Indian movies are based on romance, fantasy, melodrama. But Peepli Live is a attempt which some directors, writers and producers are trying independently in bollywood(Indian cinema is called bollywood-Derived from Hollywood). Usually these movies are not very successful in box office(some exceptions like A Wednesday etc.), but it will definitely change the mind set of Indian audience which just want fun and entertainment. This movie is very realistic and talks about reality which India is facing. India is developing really very fast in industrialization, but forgetting about one's who are the back-bone of India FARMERS and VILLAGES. Peepli talks about Indian villages, problems faces by its farmers. How Indian Politicians keep throwing ball to others court and do nothing, Indian media which is mostly involved in 24x7 full MASALA news, no real news to its audience. Well i wont tell much about story, you should watch it yourself. It has some humorous and sarcastic jokes also, which i am sure you will like. I am giving it 10/10 only because it is really nice attempt from bollywood."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "yourfriend_ap",
        "review_rating": "7",
        "review_title": "Peepli Live, A philosophy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "shaileshbansal",
        "review_rating": "3",
        "review_title": "Bore and Slow",
        "review_detailed_main": "For first half I was waiting for it to start, ya but I can say that it finally started after intermission but again it didn't went smooth after that too as some time the speed is fine and sometime it again goes slow. Its surely do its main job properly to showcase role of politicians and media in problem of a common man in this Natha. But I will say its not able to make a proper movie out of it. You wont feel like your money is valued or as we say \"Paisa Vasul nahi hai\". There are some very good pieces but Amir Khan the so called perfectionist is failed to put them together.\n\nWatch only if you are a die hard fan of Amir Khan or you are a movie freak for rest I will suggest not to waste their time and money."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "talkkish",
        "review_rating": "8",
        "review_title": "Must watch",
        "review_detailed_main": "I can confidently say that majority of the audience who reviewed this movie or at least had a chance to watch the movie, have no idea of what such farmers go through in real life. including me.\n\nEven though it is a satire on current Indian state of politics, and media, it is a tragic film for me personally. Wonderfully directed by Anusha Rizvi, a débutante, with Aamir Khan producing the movie. Though the movie doesn't bring out the plight of suffering farmers but focuses on how media sensationalizes issues without second thought and how our politicians use a situation for their advantage. In the entire process, no one really helps the victim! Omkar Das as Natha delivers an unforgettable performance. You might not remember Omkar few weeks after watching the movie but you cannot forget Natha, his innocence and his helplessness of the situation. The director succeeds in capturing raw emotions of all the actors. Natha's mother character is a reality in all families that I was with. Her portrayal of the character is fitting as Indian mother-in-law who goes out all guns against her daughter-in-law.\n\nIt is a must watch for all. at least we get to appreciate such well-made films and experience what the characters go through in two hours."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "shailensukul",
        "review_rating": "10",
        "review_title": "Provocative Satire",
        "review_detailed_main": "Absolutely great how a newbie director/screenwriter has treated such a sensitive subject matter of farmer suicides in a satiric comedy with such maturity. The subject matter may have been too dry to be treated as a documentary. This is bound to touch nerves in all corners of the world, as it did with me. I myself am descended from Indian laborers brought to work in Fiji and also am a citizen of Australia and farmer suicide and depression is a problem in both countries. The ending was powerful in its simplicity and left me with a profound and deep question, which I hope came across to the audience: In an ever-changing and industrialized world, how does a person, who has spent all his/her life toiling in farms, come to grips with the world that has moved past them. Industralization has reached such a level with mechanized automation even in farms, that farmers are almost left irrelevant, unless they can afford the million dollar setup of a 21st century farm. Even so, with seeds coming from American companies that have been genetically altered NOT to reproduce after 1 crop, the global paradigm shift has moved towards mass production with a few companies controlling the masses.\n\nAlthough the movie never proposes a solution, it leaves us with much to think about. This movie gets a 10 because it has delivered a powerful message of introspection, which few movies have been able to achieve."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "RosanaBotafogo",
        "review_rating": "7",
        "review_title": "Simple and efficient film...",
        "review_detailed_main": "Delicate theme, comically portrayed, an interesting social criticism, as far as human ambition goes, the greed of the powerful, countering misery, fighting for survival, and naivety of the most humble people, I love tasting such diverse cultures, language, clothes , behavior, and the performance of the media, investigative, informative, critical and also sensationalist, simple and efficient film."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "sine-pkd",
        "review_rating": "9",
        "review_title": "a thought to realism....",
        "review_detailed_main": "PEEPLI LIVE..........another thunderstorm from the aamir khan's productions....\n\na great visual to see with the rear shadow of Indian village... NATHHA is nothing but a symbology..a thought that if we are the 4th largest economy of the world but still we have the highest number of tuberculosis patients along with poor people in our country.. if we are able to provide world's cheapest medical facility but still we are unable to give a single healthy moment to our future(children of villages).. the movie shows that a life of common man doesn't change even it gets worse if he dare to take any extraordinary step...... though the so called developed sectors like media houses and politicians have their advantages over that.. it hits the crude areas... thousands like RAKESH get last in the pursuit of realism but the audiences never bother about it... in a scene where a young administrative officer of HEALTH MINISTRY wants to do something ,he is advised by his senior to get handle the situation but not to solve it....OH ! i think its appealing...\n\nthe reference of HORI MAHTO was a real move.. hori mahto was the central character of \"GODAN\" a great novel by famous Hindi novelist and story writer PREMCHANDRA.. in the novel hori was a poor farmer struggling with his day to day life to feed his family..came across to so many obstacles in finding the basic needs.. this movie shows the fate of poor Indian farmers have not changed much since freedom..he died because of hunger , depression and ignorance of so called developed authorities.. a person rakesh who find out this as a real story to tell also died but no one took a peek.\n\nAamir khan is a man looking into the best of Indian cinema.he always have the thought and able to show it off..\n\nnevertheless the acting of these theater artists look live, the direction is superb and the concept is psychedelic...an entirely new cinema from bollywood.. its rightly said \"You don't get paid for the hour. You get paid for the value you bring to the hour.\" and now the director anuska rizvi deserve it."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "intern-88",
        "review_rating": "6",
        "review_title": "Bollywood meets art-house",
        "review_detailed_main": "'(A) penchant for convolutions of plot and counter-plot rather than the strong, simple unidirectional narrative; the practice of sandwiching musical numbers in the most unlyrical situations; the habit of shooting indoors in a country which is all landscape\u0085 all these stand in the way of the evolution of a distinctive style.'\n\nThis verdict over commercial Indian cinema was passed in 1948 by the Bengali art-film maestro Satyajit Ray in his essay What is Wrong with Indian Films. It still sums up many of the objections commonly raised against India's dream-factory, Bollywood, and explains why its products are consistently ignored by both mainstream and art-house audiences in the West. Peepli (Live), Anusha Rizvi's directorial debut, is a bit of a sensation, therefore, as the first Bollywood film to be accepted on the international film festival circuit.\n\nThe film, a comic satire, tells the story of Natha (Omkar Das Manikpuri), a poor farmer in the fictional state of Mukhya Pradesh. Faced with the prospect of losing his ancestral land, Natha is convinced by his brother to commit suicide so that his family will receive a compensatory 100,000 rupees from the state government. As Mukhya Pradesh is preparing for elections, Natha's story is picked up by the media and quickly becomes the focus of political debate and of competing media outfits. Eventually, the humble farmer, his family and their goats are virtually imprisoned in their shabby house, surrounded by raving flocks of TV reporters, while politicians show up bearing gifts of hand pumps and TVs for which there is no well or electricity.\n\nIn my eyes, Bollywood films deserve their reputation as shallow and yawn-inducing, not because of their overwrought melodrama or the hammy acting, and certainly not because of the singing and dancing (although the quality of the musical scores has deteriorated in recent decades). Instead, it is the extreme moral conservatism that is most off-putting, along with the plots, which manage simultaneously to be entirely predictable and, as Ray observed, convoluted to the point of seeming random (the latter characteristic supposedly a result of influence from the great Indian epics like the Mahabharata).\n\nBollywood films – in which, to this day, kisses are banned, but romantic dance numbers show the smuttiest scenes you will see in a non-rated movie – perfectly convey stifling Indian middle-class values. At the same time, there is a certain folksy quality in Indian commercial cinema, although it is more easily discernible in the country's many regional film cultures (which can be more fun, if more unpolished, than Bollywood's fare). Ray denigratingly explained that the dismal state of Bengali cinema was due to the 'deliberate and sustained playing down to a vast body of unsophisticated audience brought up on the simple tradition of the Jatra, a form of rural drama whose broad gestures, loud rhetoric and simple emotional patterns have been retained in the films'.\n\nUnlike the few other Indian films that have achieved any circulation in the West (mostly bores like Monsoon Wedding), Peepli (Live) manages to make good use of the folk drama buried somewhere in the Bollywood conventions, but is also much edgier than the usual bland works. Several of the actors are members of the Naya Theatre, a group formed five decades ago by Habib Tanvir, who was influenced by Bertolt Brecht and folk theatre.\n\nHaving set up its rich mix of rustic farmers, hypocritical politicians and frenzied media hacks, the film goes on to have fun with the surreal disconnect between the world of media and politics on the one hand, and the rural commoners on the other. The tendency of mass media to turn reality into a spectacle is given a literal illustration, as TV teams arrive to the village of Peepli in clouds of dust. The village finds itself turned into the site of an impromptu festival, with street vendors, acrobats and merry-go-rounds gathering around the unlikely centre of public attention.\n\nThe film takes rather easy swings at the hypocrisy and insularity of the urban ruling class and its cohort of middle-class media lackeys. There is little here to suggest the real brutality of caste oppression and unreformed patriarchy still reigning in many an Indian village, that nucleus of social and spiritual life memorably described as 'a sink of localism, a den of ignorance, narrow mindedness, and communalism' by BR Ambedkar, the Dalit ('untouchable') jurist who drafted India's constitution.\n\nBut although the film's burlesque of Indian media and politics grows more predictable as the plot progresses, Rizvi is right to stay within the confines of satire rather than trying to elevate the film to a social critique. The punch packed by Peepli (Live) lies not so much in the story as in the places and faces it brings to the cinema screen.\n\nPier Paolo Pasolini once maintained that there is nothing to unsettle a bourgeois audience more than 'the face of a black, or the smell of a poor person, or the bewilderment of a Jew, or the provocation of a homosexual'.\n\nI watched Peepli (Live) on a Saturday afternoon at a packed Kathmandu cinema. Here, the audience's visceral reaction to the opening sequence brought home just why the film is a welcome novelty in Hindi cinema. It shows a close-up of Natha's dark, flat-nosed face and tangled hair. This is a type of face that is rarely seen in the universe of Hindi cinema, or that shows up only for comic relief, and here it belongs to the film's protagonist! Next, the brute leans out of the bus he's travelling on and, for no clear reason, vomits.\n\nMore than its lampooning of glib TV-hosts, that kind of brashness makes Peepli (Live) worth watching."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "ankurchandra_in",
        "review_rating": "10",
        "review_title": "Bold, Brave and Brilliant",
        "review_detailed_main": "Peepli Live is nothing short of a marvelous movie. It is daring, it is full of high class satire and it is hard-hitting. The cast is simply amazing. Nattha, the main protagonist, was able to convince the audience of the naivety of his character. The expressions and his body language are so original. For ex. the scene where he and his brother (played by Raghubeer Yadav) are drunk and singing -achcha sila diya tune mere pyaar ka- look so real and humorous, that you can't help but give a hearty smile. When it comes to the issues faced by Indian society today, movie spares no one. Be it politicians, media persons, administration, or commoners, every one has been shown the mirror. The best thing about the movie is the use of humor all throughout to keep audience fully engaged. Also, movie has a good pace. One thing happening after another keeps you always looking forward to what will happen now. One of the best scenes that I liked was the last one where camera starts going back from village roads to pakka roads, then to highway, then enters a city where we see lot of vehicles and buildings and finally a construction site where lots of villagers are working as laborers. That scene so clearly shows the dichotomy of Indian life. A must watch I will say."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "aakash-karkare",
        "review_rating": "7",
        "review_title": "Peepli Live",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "The anti-Bollywood film....",
        "review_detailed_main": "I like Indian movies and have seen a couple hundred of them. However, when it comes to the Indian films we get here in the States, the formulaic romances with gorgeous actors make up almost all of the movies. Because of that, I was thrilled to find \"Peepli Live\" because it's actually about normal folks...folks who have darker skin, aren't immensely wealthy and have real world problems. It was also nice that the film itself was very darkly funny and very insightful about the world.\n\nThe film is set in the agrarian town of Peepli. Just about everyone there is a poor farmer and Natha is about as poor and miserable a guy as you could find there. He is about to lose his farm and his family is made up of three of the most god-awful people you could imagine. His wife is a hateful shrew, this mother is a mentally deranged shrew and his brother is a nasty manipulator. So, when Natha and his brother learn that the government is inexplicably handing out death benefits to farmers' families when there is a suicide, the brother goes into manipulation mode. The brother says he will kill himself for the good of his family...though before Natha knows it, he is the one who has promised to kill himself!\n\nWhile normally Natha would just kill himself and that would be that, when he tells people his plans, things begin getting out of hand. Soon, he becomes a celebrity and the media descend on the town like locusts. It's obvious none of these people or the government officials who follow care one bit about Natha or the farmers...they just want to exploit the situation to their own ends. Some folks try to bribe him with the most useless bribes NOT to kill himself, while others try to bribe him with equally useless things to carry one with his plans! All the while, Natha is just overwhelmed and never receives any real kindness. How does this dark film about the shallowness of politicians and the media play out? See the movie and find out for yourself.\n\nIn many ways, this film is like a modern Indian version of the classic Hollywood film, \"Ace in a Hole\". Both are very dark films about the 'news' and how the media manipulates us and both are very insightful. Some of my favorite moments in \"Peepli Live\" were Natha being given a TV (even though he didn't have electricity) and newscasters coming up with crazy polls such as the one where \"7% of the folks blame the United States for Natha's predicament\"! Crazy and very well made. Perhaps too darkly funny for many tastes but I am very glad I saw it."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "SumanShakya",
        "review_rating": "7",
        "review_title": "A Quirky Satire on Media and Government.....",
        "review_detailed_main": "There are still many villages in India where majority of population are living below poverty line and agriculture is the only means of their livelihood. Recently, the suicides from the poor farmers unable to pay their debts had grabbed the attention of media and government. The same has been taken in the central of this film and created a rural setting with people living below poverty line. The film gives a witty account of how media manipulates news to gain TRP when a local farmer from the village announces a suicide due to his poverty. When the news gets into a local newspaper, media and government start a rat race for their means.\n\nThe film is low budget and non star cast which might not trigger the masses; but in terms of its story is witty and thought provoking and makes a satire on media. The film very effectively portrays how media are selling their stereotypes and hiding the real truth, just to increase their so called TRPs. Similarly, the film also serves a satire to the government and the politicians who utilise the loopholes in the rules to secure their positions and make mockery out of common people. Raghuvir Yadav is a known artist or tremendous veracity which too comes true with this film. Other actors, Omkar Das, and Shalini whom you have never heard of have also done good jobs and portrayed a very rural village of Madhya Pradesh. Though the film is slow and portrays the highly backward community, the film is commendable for presenting a real backdrop of the country with a brief on the government policies for the poverty and their reality.\n\nRating: 3 stars out of 4"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "nihar_khinchi92",
        "review_rating": "3",
        "review_title": "spoiler",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "deathiscoming-1",
        "review_rating": "8",
        "review_title": "An exciting cinematic roller-coaster with a serious message to portray.",
        "review_detailed_main": "I actually saw this movie a few months ago but the unfortunately it has take this long for the hot happy genius juice of this movie to evaporate off my face! So, now that I'm back I must honestly say/type that if ever there was a cinematic roller-coaster of a movie has got to be it! Right from the word \"go\" this movie is pure bulimic genius, simultaneously purging out humour whilst also exposing the sorry state of India today.\n\nThis movie exposes the truly schizophrenic situation of normal Indian farmers today, where suicide has become a logical option for those desperate enough to save themselves from debt. So why is this a must see movie? The simplicity of this message and the realistic portrayal of it are the pillars which hold up this stairway to heaven with the cast and dialogue as the lukewarm banisters that support you all the way up to moist cinematic bliss. The hilarity comes once the media is involved in this ordinary man's predicament. Like vultures to a carcass the media flock upon Natha's home and village and everyone (including politicians) is desperate to spin to the story for their own corrupted gains.\n\nOmkar Das plays the cowardly, scared Natha very convincingly and Raghuvir Yadav is as brilliant as ever and I'm going to stop my brown nosing of the cast there as everyone already knows how great they all were! Let's talk about something else, like say the stupidity and desperation of the media to make absolutely ANYTHING news – even a pile of human excrement! Classic Indian thinking if you ask me. Or the politicians involved – some representing lower cast issues, some representing the state in general behaving like pant wetting 40-60 year old virgins commanding Natha to, or not to die! The absolute commotion of the movie leaves the viewer truly mesmerised and shocked like when you see a quadruple amputee with no eyes destroy tony hawks on the half pipe (well, he may just have 2 thumbs and 2 fingers missing!)\n\nAamir has received some stick for not making this movie as blazingly inspiring as Rand De Basanthi for example, but personally I don't want to see a Bollywood version of a \"one-man-saves-the-world/India\" Hollywood movie! I mean we all know that a) I generally despise the pretentiousness of Hollywood these days and b) we all know what the adulterated child would look like – we've all seen Chiranjeevi's 1985 rendition of thriller in Donga (if not look it up – I guarantee you will scarred for life)! Another point in Aamir's favour is that the exposure of such issues itself should be enough to make people take a stand against them, I doubt the general Indian public are so absorbed by their own rectal mucosa that unless they are instructed to so they have no sense of responsibility for their own country's circumstances.\n\nOverall, this is definitely a movie to go and see, buy on DVD or however you get your movies because like the blind man said to the goat, \"I probably won't feel like this again for a while\" when its metaphorical sugar coated horn was thrust into his mouth. Finally, I just have to do my impression of the lower caste leader... NATHA MARE GA!! That felt good..."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "rishab-forbidden-654-317900",
        "review_rating": "9",
        "review_title": "Must Watch",
        "review_detailed_main": "This movie is a satire full of dark humor, it's slow at times and in your face ... For those who are expecting a pot boiler or some typical Amir Khan movie, please don't watch this. You'll waste your time and of others by writing a nonsensical review...\n\nAnyways for those who are looking for a movie with substance, this is it for you. Plight of the farmers have been brought to life via dark humor. The ridiculousness of media and the opportunistic (parasitic) politicians are well portrayed.\n\nKudos to the actors also..\n\nA must watch."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "AMOGHREVIEWS",
        "review_rating": "7",
        "review_title": "B-R-A-V-E",
        "review_detailed_main": "Peepli Live (2010) - 70%\n\nAn Honest Attempt From Anusha Rizvi, Aamir Khan & Kiran Rao To Highlight The Plight Of Farmers In India... It's A Known Fact That 70% Population Of Our Country Is Dependent On Agriculture For Their Livelihood, But What Many Don't Know That We Are No.1 In Farmer Suicide As Well & This Film Boldly Puts It In Front Of Us, Thanks To Omkar Das Manikpuri, Raghubir Yadav & Nawazuddin Siddiqui... One Of The Biggest Plus Points Of The Movie Is Its Presentation Which Is Art Driven, But Also Commercial In Nature Which Makes It Reachable To More People... The Only Major Drawback Here Is The Screenplay Which Could Have Been Tighter... On The Whole, \"Peepli Live\" Is A Good Film That Is Offbeat, But Relatable & Definitely Deserves A Place In Your Watchlist."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "katik-87-718578",
        "review_rating": "10",
        "review_title": "Clasic satire",
        "review_detailed_main": "One of the satire film I have watched with perfect cast. More such movies need to be made."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "Kulin33",
        "review_rating": "8",
        "review_title": "The forgotten gem of Indian film industry !",
        "review_detailed_main": "This one is a must watch for all Bollywood lovers and fans as the movie is about the hard hitting truths and lies that are being spread around to generate false news or are done for some personal agendas.\n\nIt's a dark comedy with a lot of interesting characters and story line that just hits you so hard and makes you question a lot that is happening in your current life.\n\nThe script is magical plus the direction is on point and the cinematography is so authentic and true to its nature. This movie literally shuts hard and gives you such great vibes regarding the standard of our Indian cinema\n\nA fabulous watch for you this weekend if you have not already seen it."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "amricansurver",
        "review_rating": "8",
        "review_title": "Good About it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "hbdave_77",
        "review_rating": "5",
        "review_title": "Mockery of Rural India...what a shame?",
        "review_detailed_main": "Sorry this isn't happening new age film. Unfortunately the film is more disturbing and hurting personal experience for me rather than entertaining or concerning one. A journalist turned débutant writer-director Anusha Rizhvi has literally ruined the subject of farmers suicide and made a farcical mockery of culturally rooted real India living in small villages. It seems that the film is made for urban audience to have a funny and tongue in the cheek look by lampooning and spoofing the people who lived below poverty line. Rather than highlighting and giving weight to the poor farmer who's going to commit suicide and his family, the major part of the film hammered us with the farce of excess and exaggeration created by TRP mongering TV media, concocted political circus and above all that loudmouth old age mother lying on bed, giving enough laughing moments to urban audience.\n\nSatire works when film drags you into the character or treatment and strikes you at heart emotionally but rather than satire Aamir and Rizhvi have made a film which is high on hyperbole to tickle urban audience in the name of new age cinema by showing hyperbole reality. Satire works in few frames but the excessive one sided picture and too much exaggeration made the film disturbing mockery of rural culture. When public around me laughing out loudly watching live over dramatized coverage and analysis of Naththa's natural excretion, it's hurting me so badly. What a shame!!! Talking about acting, the film utterly wasted brilliant theater actor like Raghuvir Yadav, appeared on screen after long. Any of his earlier films are far better as films and that's why in whatever limited role he played it fits his character so naturally. Rajpal Yadav look-alike Omkar Das Manikpuri as Naththa fits in the frame like a real character but poor fellow has nothing much to do except showing his unspoken expressions to camera. Being journalist, director Rizhvi has given much footage to the rivalry of two reporters. Again spoofing English speaking urban reporter Barkha Dutt and Hindi speaking Dipak Chaurasia. Naseeruddin Shah's presence is suitable cameo but the amalgamated cast of late Habib Tanvir's theater is natural and impressive, especially the characters played by local opportunist Bhaiyaji and local print media reporter Rajesh.\n\nThere's just two scenes which let me felt the noble and concerning one. The first is showing the skeleton like man digging his own grave and the last fast and shaky journey bridging the two compartmentalized India- culturally rooted rural to the happening urban, barren village farms to urban skyscrapers luring the middle class to have flat of their own with lucrative hoardings and tag lines. But besides these two, the film is hurting one on many accounts. One has to read 'Everybody loves a good drought' written by freelance journalist P. Sainath. It's well researched and brilliant journalist piece of writing neither just reduced to statistics but making you felt the heart of darkness of BPL India still waiting for development after sixty three years of Independence.\n\nSorry for being too emotional but rather than burning your bucks on this, watch Satyajit Ray or Shyam Benegal's social reforming cinema or buy the copy of above said book on this Independent day to understand the real rural India from more closer, more realistic and more concerning perspective.\n\nRatings- 5/10"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "mmahadevan",
        "review_rating": "10",
        "review_title": "Showcases the failure of the Nehru Dyanstic politics.",
        "review_detailed_main": "India has been ruled by a single feudal family of the Nehru dynasty 89% of the time since Indias independence. Imagine the democrats/far leftists had been in power in the US 86% of the time and how the US might have turned out. Thats how India is like today. Even the recent economic development is due to natural capitalistic culture of the Indians. The capitalistic Hindu culture has helped create some wealth for Indians to alleviate them from poverty, in spite of this alien Nehruvian socialistic culture that has been artificially infused into India by the leftists. The congress leftists and its cheerleaders need to own up to this mess if they even have a single ounce of decency left in their soul. If you have been in power 86% of the time since independence, are you not 86% culpable for the state it is in? The congress party has the Munchhausen syndrome by proxy. It needs 600 million sick and dying so they can constantly mother them. Imagine these millions of people become like the other rich people of India. Holy cow..that's the end of the congress party. The Horror of it frightens the lefty congress family feudal. When the \"India shining\" Reaganisque moral boosting campaign cry were put out to the nation to wake up its citizens to act, the lefties cringed and loathed such a thing. They hated it and mocked it. Sonia Gandhi the Eva Peron of India has been fooling the illiterate masses with her caste and religious politics of division and keeping the throne for her two imbecile children who have never done an honest day of labor to earn their keep. Ironically its the Macaulite educated folks of India who cheer lead the ignorant illiterates of India to keep voting for this congressie feudal family regime. India is not a republic. Its an anarchy disguised as a republic. This movie is a good window into this anarchic alien Socialist culture of India introduced by the Bengali leftist intellectuals. The English media of India is another vile establishment in this anarchy. Peepli Live is a satire on this faux republic of India.\n\nSome facts: The C0ngress left party has ruled India 89% of the time and the Nehru feudal family has ruled 82% of that time! Nehru prime minister of India, from 1947 until 1964 17 years Indira Gandhi (Nehru's daughter who took the Gandhi's name just for name recognition so the poor people would vote for her thinking she was related to Mahatma Gandhi)) Prime Minister of the Republic of India for three consecutive­­e terms from 1966 to 1977 and for a fourth term from 1980 until her d_eath in 1984, a total of fifteen years. 15 years Rajeev Gandhi (Indira's son) was the 7th Prime Minister of India, serving from October 1984 to December 1989/91. = 7 years ManMohan Singh as a Proxy PM for Sonia Gandhi. He took the oath as the Prime Minister of India on 22 May 2004 = 7 years + Total = 46 years Lal Bahudur Shastri (Congress Party) = 2 years P. V. Narasimha Rao (Congress Party) = 1991-1886 = 6 years = 56 years. 56 years out of 63 years of India's Independence­­ce Now, they have Rahul and his sister waiting in line for the throne. They would then have children and it goes into perpetuity. Is this even a republic? I don't think so. And the worst of all, they have blamed everyone else for the poverty and plight in India and have not taken ownership for any of the problems. NEVER! In all this time, the left of India has not built infrastructure like irrigation for the farmers of India."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "sumitpahwa",
        "review_rating": "8",
        "review_title": "Well put together movie",
        "review_detailed_main": "I'm a native American and saw this movie in a theater with maybe 30 Indians (sorry, I'm old enough to find multiple ironies in that sentence)\n\nThat guys is really funny.\n\nThe movie itself was pretty well made. The satire flows well with the movie itself. Amir khan seems to be pushing for another shot at the Oscars. With Lagan having been rejected by the panel, it will be interesting to see if Peepli live is able to grab the judge's attention.\n\nOn a different note - I had to add this last line cos IMDb wouldn't let me submit a review with only 9 lines of text :P"
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "tanujpoddar",
        "review_rating": "10",
        "review_title": "A scathing social satire that blends humor with social commentary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "sunilprasad-02312",
        "review_rating": "8",
        "review_title": "Amir Khan Productions Never Disappoints Us ❤🔥",
        "review_detailed_main": "Today I watched Peepli Live. First of all, I heard about this movie through songs by Indian Ocean, and I didn't realize it was produced by Aamir Khan.\n\nLet's talk about the movie. Peepli Live is set in Peepli and is based on true events. The movie is all about the struggles our farmers face to survive. Politicians and the media only care about their own benefits; they don't care whether farmers live or die. I felt like this is how we will become a superpower one day.\n\nNow, let's discuss the good and bad parts of the movie.\n\nGood Points: The comic timing and simplistic approach of the movie make it so special. I felt like I was watching the Panchayat web series because some of the same actors are in it. The cinematography, costumes, camerawork, and performances are all top-notch. The movie ends on a heartwarming note, and I really felt bad for the farmer Natha.\n\nBad Points: There isn't any particular bad point, but I felt the movie's length was too short. They could have added a lot more depth and content while maintaining the same comic tone.\n\nOverall, I can assure you that it is a movie worth watching. You should give it a try. I would rate it 8/10. I really liked this movie."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "braddugg",
        "review_rating": "8",
        "review_title": "Easily one of the best satires in a long time.",
        "review_detailed_main": "Easily one of the best satires in a long time.\n\nWell, will Natha die or not? what if he dies and what if he doesn't. What a way to capture things and the dialect of a small town story that we don't even consider news in our daily news. Making reporters as caricatures, his family members as helpless, politicians as the corrupt and Natha as a scapegoat for a well written satire is great.\n\nIt begins with two farmers running around to save their land and in the end they lost more than that. Acted very well by all, even the grandma who sleeps on the hand made cot screams as if it's very natural to her. All over, naturality prevails in the movie which is really refreshing and surely we do not see many movies that show our villages as seen in Peepli Live in all their colors. There are many good thing with respect to the movie and it's one rare small piece that we treasure in our memory for a long time.\n\nI also, cheered Natha to be alive and fight against the system but its very mean of me to expect such a thing from a petty farmer who does not understand the system well. When people are talking politics, he just looks at eggs on the table. When he is being interviewed, he is so very enthusiastic to believe his death will bring glory.\n\nFor Omkar Das Manikpuri as Natha, hail him as an actor and would love to see more of him, which sadly I have not been given a chance by our great Hindi Film Industry people who are behind glamor, money.\n\nI would go with 4/5 for a movie that is satirical in a very good way and has an ending that still makes me think why farmers are shying from farming."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "oopsalion",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "Pathetic movie, the star cast shows actors who have done theater for more than 10 yrs, but the performances are mediocre. OK to watch at home when the DVD is out but not worthy going to the cinema and shell out 250 Bucks on this movie.\n\nPathetic to the core, try to avoid if u love cinema. I am rating it at a 1 out of 10 and that is only for aamir, i would have given a zero instead. such a pathetic movie, the halls were empty the very first day of the launch, moreover i don't feel this should have been released throughout India on theater, it should have been a documentary submitted in film festivals."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "heiderer-879-161844",
        "review_rating": "9",
        "review_title": "wicked satire",
        "review_detailed_main": "This is one of the most wicked little satires I have ever seen ..in any language. It reminds me of the short stories of Anton Chekhov or Evelyn Waugh. As an American viewer, it may require a bit of familiarity with recent social conditions in village India to be of interest, but the level of wit and detail of observation is extraordinary. It will make you completely rethink Indian cinema. Do not miss it. Brilliant."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "rajeev-batra-24",
        "review_rating": "9",
        "review_title": "Great storytelling and a perfect ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "shivam-tiwari",
        "review_rating": "9",
        "review_title": "Finally we did it",
        "review_detailed_main": "I would like to start by congratulating the whole team behind this movie. It was a great experience watching the reality cinema with a comic feel to it, it's a great move forward by the Indian cinema.\n\nGreat performances by the whole cast right from AMMA JEE to the DISTRICT MAGISTRATE, i mean every small role was detailed to perfection.Perfect amalgamation of rural and urban India it beats slum dog millionaire in parts.\n\nGreat direction wonderful story and good editing,this movie also teaches many of the Indian filmmakers that how important story is over the marketing ,big budget and star cast.\n\nThis movie was much better than most of the foreign films which makes me both proud and happy."
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "iimraann",
        "review_rating": "5",
        "review_title": "More comedy than impression",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1447508",
        "movie_name": "Peepli [Live]",
        "movie_rating": "7.4",
        "review_username": "saish746",
        "review_rating": "4",
        "review_title": "Peepli Life!",
        "review_detailed_main": ""
    }
]