[
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "lacey_joeskip7",
        "review_rating": "10",
        "review_title": "Life's Lessons in one Movie...",
        "review_detailed_main": "When I first saw this movie I didn't appreciate it like I do now. I think it may have been because I was so young when I first saw it. Just recently I saw the movie again. What an amazing story and moving meaning. That movie teaches you so much about life and the meaning of it. That life isn't as bad as most people make it seem. That an innocent man can impact so many lives with his innocence. The meaning of the movie to me is that everyone needs to have a better outlook on life. That we need to appreciate more of the little things and not let the big things hold us back. That truly although life may throw us trials and tribulations like a box of chocolates but that we have to just bite into it and get through it even if we don't like it. That we all need to hold true to our values and not sink into a place that feels like there's no hope... I just love this movie. And anyone who hasn't seen it or who thinks that don't like it I seriously suggest seeing it or seeing it again. It truly is amazing..."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Zonieboy",
        "review_rating": "10",
        "review_title": "A beautiful fable for now and the future",
        "review_detailed_main": "I believe everyone has a right to their opinion about films or other topics. However from a lot of the comments I have read about this film, I do not think many got the gist of the message from the author and the film maker. This film is a great modern fable, a fable in the dictionary is defined as a brief fictitious story that teaches a moral. There are many morals defined in this film but foremost is integrity and a simple goodness.\n\nI have a half brother who grew up in the Southern U.S. and on one occasion we were discussing this film and he said he felt it portrayed Southerners as dimwitted. I disagreed with him and informed him that the author himself was a native Southerner. The setting is central to this story in that it lets the tale unfold tying in factual events with the fable before us.\n\nThe film is wonderfully directed by Robert Zemeckis, the film is his opus and is acted by a great cast on all levels. From the children who were Forrest Gump and Gump Jr. by Haley Joel Osment. Say what you want but I feel Tom Hanks deserved the Oscar award. Gary Sinise is synonymous with Lt.Dan whenever you hear those words. Sally Fields is the loving dutiful mother in her challenging situation. Mykelti Williamson as Bubba gives you a real sense in the story that Gump had a genuine friend, he moves you with his character. Words don't grasp the full performance of Robin Wright Penn as Jenny. Jennys' tenderness and pain are palpable as exhibited by Wright.\n\nI feel that much of Gumps' appeal is his downright sense of doing the right thing regardless of the people and situations around him and we see that in this film. That being the case maybe we all wish we could be just a little more like that, trying to maintain innate goodness and not the trade-offs we often make as we go down lifes highways.\n\nThe movie has it all too,drama,comedy and it challenges societal norms as well. Then there are the almost endless quotes from the movie that have slipped into everyday speech. They are too numerous to say at this point.One of the toppers for me in the movie is when Forrest is in a quandary about life and wondering as Lt.Dan said we all have a destiny and his Mom says it is where we are all just floating around like a feather in the wind. Forrest's character terms it very well with this quote,\"I think it is a little bit of both.\" From my experiences in life it does appear to be that way. So if you have not seen the movie,see it soon you are in for a real treat. If you did not like it, give it a try again and hopefully you will see it for the great story it is!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "10",
        "review_title": "Let's see the world through the eyes of Forrest Gump",
        "review_detailed_main": "\"I've made about 20 films and 5 of them are pretty good\"-Tom Hanks.\n\n\"Forrest Gump\" is one of the best movies of all time, guaranteed. I really just love this movie and it has such a special place in my heart. The performances are just so unforgettable and never get out of your head. The characters, I mean the actors turned into them and that's what got to me. The lines are so memorable, touching, and sometimes hilarious.\n\nWe have Forrest Gump(Tom Hanks), not the sharpest tool in the box, his I.Q. is right below the average scores. But his mama(Sally Field) believes that her boy has the same opportunities as anyone else and lets Forrest know that there's nothing that could hold him back. As a boy he is put into braces for his legs since he has a crooked back and really doesn't have too many friends. When he gets on a school bus for his first day of school, NO ONE will let him sit next to them. This scene is so heart breaking until you hear a little angel's voice \"You can sit here if you want\". Jenny, Forrest's best friend and crush, she looks so incredibly innocent and you love her because her and Forrest are like pea's and carrots. But we find out that there is an extremely unfortunate side to her life, she has a father that's \"always kissing and touching her and her sisters\". Forrest just assumes that it's a father's love since he doesn't have a dad that could show him that it's wrong.\n\nForrest and Jenny together walk every day from school and when these kids start throwing rocks at Forrest calling him stupid, Jenny just tells Forrest \"Run, Forrest! Run!\". He miraculously breaks the braces off his legs and run like the wind blows. Forrest meets many celebrities from his life that just happened to be there: Elvis Presley visited his house before hitting it big, President Kennedy honored him with a all American football award, President Johnson who honored him with a medal of honor for his actions in Vietnam, President Nixon(in which Forrest happens to discover a problem in the Water Gate Hotel because some people seem to be flashing lights around), and John Lennon through a talk show to talk about his medal of honor.\n\nForrest meets some interesting people along the way too that are even better than these celebrities combined; Bubba his Vietnam war friend who dreams of owning a shrimp boat one day and was born with big gums. He is just so wonderful and charming and won't stop talking about shrimp. Luteniet Dan, a leader of Forrest's army in Vietnam who gets saved by Forrest during a huge attack and looses his legs as a result. Luteniet Dan was by far my favorite character, he has so much pride and wants to die in Vietnam due to his family history tradition of dying in every single American war. He and Forrest make quite a pair. And of course there's Jenny, a very tragic figure, she gets more mean as she grows up because she knows that Forrest loves her, in some ways you can't blame her really. She was obviously abused and I think she felt that Forrest was too good for her or that he couldn't really give her the love she wanted. Robin Wright, what a beautiful and wonderful actress.\n\nThis movie is incredible and should be seen by everyone. I am not kidding, \"Forrest Gump\" is a remarkable movie and inspires everyone. It's not just about someone stupid who happens to be in great places and historic events just because of being in the right place at the right time. This story is beautiful and will inspire everyone to go the distance and see the world like Forrest did and will never give up on their dreams.\n\n10/10"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "thomas-hardcastle-2",
        "review_rating": "10",
        "review_title": "In my opinion, no film has touched me more than this one.....",
        "review_detailed_main": "Quite simply, the greatest film ever made.\n\nHumour, sadness, action, drama and a Vietnam film all rolled into one.\n\nI'm not a stone cold, heartless villain, but it takes a lot to make me cry when I watch a movie. Bambi's mother, I couldn't care less. Jimmy Stewart in, \"Oh, what a wonderful life,\" - yeah right! The Lion King, when Mufasa bites the big one - on the verge.\n\nBut seriously - I bawled my big brown eyes out, on several occasions in this film. A real tear-jerker, and a wonderful character, played to perfection by Tom Hanks. Every bit as worthy for the Oscar as Rooney was to win the Premiership in 2007.\n\nI cannot say it enough: This is THE film of all time. Watch it, and you'll see."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sundrymules",
        "review_rating": "10",
        "review_title": "The zen of Forrest Gump.",
        "review_detailed_main": "This is a powerful yet charming movie; fun for its special effects and profound in how it keeps you thinking long after it's over. Like others, I've seen this movie more than once. One comment I've never heard is that Forrest's simplicity is almost zen-like. I should read the novel to get the author's intention (I remember some people preferring the book and complaining that no one at the Academy Awards gave him any credit.) But rather than an implication that you should do what you're supposed to do and believe in God and you'll win in the end, I see it as zen-like, i.e., living in the moment and not having expectations or particular cravings (other than his loving Jenny.) So he ends up just stumbling into all the major historical events of the time. Granted, he achieves this only because he doesn't have the brains to think otherwise and actually have expectations, but so many of our problems are because we do have higher intellect and desires, which ironically makes us unhappy because we know what we are missing. We love our cats and dogs for the same simplicity and always being in the moment. There's a line in the movie wondering if everything is predestined or happens randomly or it's a combination of both. It is something to mull over for a long time."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Hitchcoc",
        "review_rating": "10",
        "review_title": "Pure Charm",
        "review_detailed_main": "Every once in a while, something comes along that hasn't been done before. This movie is one of those things. First of all, we have a principal character whose take on life is one where you don't judge it; you live it. I know he's a film character. It doesn't matter because we use images such as these to inspire us and to give us our own way of treating each day. Forrest lets no grass grow under his feet. He is the consummate optimist. He doesn't complain because he sees early on that it does you no good. His life is one adventure after another, in and out of the public eye, but his shyness and demeanor don't ever get to his head. He is the epitome of patience, something sadly lacking in the lives of most Americans. He is pushed around by the gusts of time and always lands on his feet. His relationship with a troubled girl is the one consistent thing in his life, and that is also shows his pugnaciousness. There are some commentators and reviewers who call this character stupid. He is a slow processor, but his stability lies in his morality and his consistency. His mother raised him well.\n\nTom Hanks has become our new Jimmy Stewart. His roles are about human emotion and dedication. He is the everyman in many ways. Obviously, the subject matter has changed, but you can bank on his decision making when it comes to film.\n\nThe other heroes are the special effects people. They are able to make this work; to create an incredible world for him to function within. The news clips are quite marvelous. I usually put this film in my top ten."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "kenhe",
        "review_rating": "10",
        "review_title": "Purity and innocence retained",
        "review_detailed_main": "I have seen this movie easily a half a dozen times, and I find that the beauty of the film is how Forrest Gump not only shares his innocence and purity with others, including the audience, he also manages to retain that innocence and purity through some very difficult times. As a Viet Nam veteran, and a college graduate of the late Sixties, I could of course personally relate to the various periods that Forrest Gump endures. I would only mention that the skillful and seamless blending of music, action, and period costume was enthralling. And yet it was so perfectly understated that Forrest Gump's travels through thirty five years of the stormiest and most meaningful years of American history only became clearly defined for the viewer. Even more so than the well known chocolates quote as a metaphor for life, I felt that the remark that stupid is what you do is probably more workable for most of us."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "inspectors71",
        "review_rating": "9",
        "review_title": "Dropping My Keys",
        "review_detailed_main": "I remember John Byner, the stand-up comic and impressionist of the 1970s talking about guys crying at movies, how it's not an acceptable behavior. He advised the men in his audience to drop their keys, do something that gets them to lean forward, wipe their faces, and get things under control.\n\nI dropped my keys watching Forrest Gump. Lieutenant Dan comes over the hill at Forrest and Jenny's wedding, new legs, fiancé at his side, clean-cut and happy.\n\nForrest states the obvious, \"Lieutenant Dan, you gawt le-eggs!\"\n\nAnd the water-works just started to flow.\n\nI sit up straight and clear my throat. Got 'em (the keys, that is). My wife leans over and gives me a kiss. She says, \"That's why I love you.\"\n\nOther than a few historical fussinesses and plot slickeries, none of which are worth mentioning, this is as close to a perfect, emotionally-satisfying entertainment as I have ever seen.\n\nI love this movie. I never tire of the simple story of the guy with the lowest IQ in the room being the smartest guy in the room. It's filled with a patriotic decency you can only find in The Wizard of Oz and To Kill a Mockingbird.\n\nWhen Dorothy is aching for home and the Wizard can't deliver, I drop my keys. When Scout points to the man behind Jem's bedroom door and says, \"Hey, Boo,\" the fob goes flying.\n\nThe next time I get out my copy to show to my 11th Grade US History kids, I'll start fingering my key chain.\n\nI can't help it."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "blairgallop7",
        "review_rating": "10",
        "review_title": "Forrest Gump is a movie masterpiece that won't be forgotten and will continue to inspire",
        "review_detailed_main": "He may have been good in Philadelphia but be is excellent in Forrest Gump.Tom Hanks delivers another great performance in his career by portraying the lovable,king yet not so intelligent character Forrest Gump.It is also Tom Hanks' second straight win for the Best Actor Oscar which he becomes the second man to do said accomplishment after Spencer Tracy.Whilst not as dramatic as Philadelphia,Tom Hanks' performance is just as great in this movie and this movie could possibly be the film of Tom Hanks' career as he used to be a comedy guy who turned to drama in a way which would paved for future stars such as Jim Carrey(The Truman Show),Reese Witherspoon(Walk the Line) and Will Ferrell(Stranger Than Fiction) to name a few.Also staring in this great movie classic are Robin Wright-Penn who plays Jenny,Gary Sinise who was nominated for an Academy Award for his portrayal of Lieutenant Dan Taylor,Mykelti Williamson as Forrest's best friend and shrimper Benjamin Buford\"Bubba\" Blue and Sally Field as Mrs.Gump.This film was nominated for a total of thirteen Academy Awards but won six of them which include Best Film Editing,Best Visual Effects,Best Adapted Screenplay,Best Picture,Best Director-Robert Zemeckis and Best Actor-Tom Hanks.This is one masterpiece of a movie that will not be forgotten about in a long time.Bravo!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "schmimic",
        "review_rating": "10",
        "review_title": "Tom Hanks delivers an astounding performance as Forrest Gump.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "adinutzza2001",
        "review_rating": "10",
        "review_title": "why such a low rating???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "fernandez_1989",
        "review_rating": "",
        "review_title": "Tom Hanks' best performance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Hairy_Lime",
        "review_rating": "7",
        "review_title": "Neither as good or as bad...",
        "review_detailed_main": "People seem of two minds about this film: it either moves them to tears or to nausea. But in reality, it is a well-made film with some strong performances but not more than that. The core of this movie that is as simple minded as the title character; the facile speciousness of the movie's reactionary attacks on matters I agreed with made me realize just how shallow the movie's entire argument is.\n\nBut beyond that, the movie is very well made; Hanks's performance could have been annoying in other hands but works well here. Sinise was excellent as well. Robin Wright's performance was adequate - I try not to blame her for the movie's implied argument that the social movements of the 60's and 70's were a working out of childhood neuroses - but never really stuck to me. The technical aspects of the film are outstanding, and the movie has a lot of laughs and tears despite its empty headed core.\n\nIf it helps anyone, this is my wife's favorite movie. But then, she fell asleep during Casablanca, so...."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "evanston_dad",
        "review_rating": "4",
        "review_title": "The Ultimate Fad Movie",
        "review_detailed_main": "\"Forrest Gump\" is the ultimate fad movie. It came out big in 1994 and created a cultural sensation. It was easy to get swept up in its panorama of American cultural history, and all of the iconic imagery in the film made it seem like it was saying something important. But all these years later, this treacly piece of rubbish is nearly intolerable.\n\nThe film is full of easy sentiment and false emotion. It depicts one thing after another (the Kennedy assassination, Vietnam, Watergate, the AIDS crisis) that trigger automatic emotional responses in the audience, so that the filmmakers don't have to do any work of their own to make the material effective. But underneath the lesson in American history and the admittedly terrific soundtrack, I can't help but wonder what point the movie tries to make. Are we to applaud Forrest for his pluck and resiliency when the only reason for them is the fact that he's too simple minded to understand the things that happen to him? Are we supposed to emulate him? Is the message that we all make life too complicated, and that we all need to buckle down to the only things that really matter, like love of country, God and our dear ol' mama? If so, gag.\n\nTom Hanks is a winning presence in the film, and if anyone was going to be able to carry this story along, I imagine he did just as good a job as anyone else would have. But the only character worth watching as far as I'm concerned is poor little Jenny, played valiantly by Robin Wright Penn, who comes closer than anyone to playing an actual human being, despite the film's tendency to chew her character up and spit her out.\n\nThis movie is like a box of chocolates...too much of it and you'll be sick.\n\nGrade: C-"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "AlsExGal",
        "review_rating": "10",
        "review_title": "The role of innocence in positive thinking and thus success ...",
        "review_detailed_main": "... seems to be the theme of this film. Forrest Gump has an IQ of 70, is being raised by a single mom, lives in a remote part of the Deep South where there are few opportunities, and has legs that require that he wear braces as a child. Sounds like the recipe for a sad tale or at least a slow death from mediocrity right? No, instead, because Forrest isn't really bright enough to realize the situation he is in, he simply does what he's told to do or what occurs to him to be the right thing at the time and succeeds due to a lack of self doubt. He's told to run and he becomes the star of the Crimson Tide and an All American. When recovering from a war wound, he's taught ping-pong and winds up competing at the global level in China itself. He promises his dying friend Bubba that he'll go ahead with their plans and become a shrimp boat captain and his brand of seafood products becomes a household name.All along the way he never learns the lessons in life that tend to make the rest of us cynical.\n\nGump's childhood sweetheart Jenny starts out with high aspirations - she wants to be like Joan Baez and fight for world peace - and instead she winds up disillusioned, drug addicted, and a near suicide before age 30. She doesn't have Forrest's childlike innocence and this leads her to self-doubt and ultimately failure. Also, fate or \"destiny\" as the film calls it, is not on her side in one big way - her own father molested her as a child, which couldn't help but play a role in the decisions she made.\n\nNow Gump does have a bunch of coincidences on his side - call it destiny if you will - the storm that beaches every shrimping vessel in the Gulf of Mexico but his, for example - but in most cases this is just the story of a man going through life without self doubt and that little voice that tells the rest of us \"You can't do that! What are the odds! You'll fail! Make the safe choice!\" To me, this is what this film is about. I think everyone sees something different in it. I highly recommend it as it is truly one of a kind. I remember when it came out it absolutely made professional reviewers crazy that people liked this film, probably because they didn't understand it."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "jjacques1",
        "review_rating": "10",
        "review_title": "Forrest Gump (Negative Reviewers are Missing the Point)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Sleepin_Dragon",
        "review_rating": "10",
        "review_title": "Thirty years on, and it's still as wonderful.",
        "review_detailed_main": "A very eventful time in America's history, seen through the eyes of one man, Forest Gump, a man who has a very low IQ, a score of just 75.\n\nTom Hanks, we all know just how good an actor he is, but there is something about his performances here that's extra special, he is simply outstanding. He's given many great performances over the years, this has always stood out.\n\nForest sees Vietnam, the moon landings, presidential changes, and experiences a tough childhood and army life, all relayed from a public bench.\n\nIt's funny, it's moving, it's wonderfully quirky. I have always loved the way they placed him into historical footage, that scene with John Lennon a personal favourite. It's a long film, but it's one that simply flies by.\n\nThe music is fabulous throughout, some of the best, and most memorable songs of the time, you'll hear the likes of The Mamas and Papas, Scott McKenzie and many more, it's a terrific soundtrack.\n\nI saw it aged 14 when it was first released, and maybe didn't appreciate it at the time, now though, I think it's a captivating watch.\n\nKeep on running Forest.\n\n10/10."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "john in missouri",
        "review_rating": "10",
        "review_title": "Quite possibly the best movie ever made.",
        "review_detailed_main": "I've seen most of the top-voted 30 or 40 movies here at IMDb, and Forrest Gump probably wins my vote for the single best movie ever made.\n\nThis is not a conclusion I came to the first time I saw this film, or the second. The more you understand about this movie, the more you like it. And in terms of understanding it, my wife and I both were still gaining new understanding the 5th or 6th time we watched it. (For example: Why does Jenny behave exactly as she does throughout the movie? It'll take a lot of thinking to =fully= understand her.)\n\nJust the fact that we've seen it at least half a dozen times says a lot. There are few movies that I ever even give a second viewing.\n\nLike many of the truly good movies, there are people out there who see it once and consider it to be a waste of time. Such people are usually just looking for the most \"action,\" gore and sex they can find, and haven't a clue about films that actually involve thought, ideas, and life.\n\nDid I mention the script is absolutely brilliant? There are a lot of =truly= funny moments. And the music rocks. But those are only specific aspects of a movie that has just about everything else right about it as well.\n\nSee it, enjoy it, think about it, see it again. Think about it some more. Forrest Gump is one of the greatest movies -- if not THE greatest -- ever made."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "george.schmidt",
        "review_rating": "10",
        "review_title": "Contemporary classic: one of my all-time faves",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "kosmasp",
        "review_rating": "10",
        "review_title": "Mama said ...",
        "review_detailed_main": "Take this with a grain of salt and don't be mad about certain things. Like one of the first flashbacks to the very beginning that does not come over preachy when it talks about the Klan (Ku Klux Klan that is, just in case you think I'm talking about any other Klan). Maybe sometime in the near future there will be a disclaimer and someone giving this context. But until then, you have to be educated enough yourself to understand and comprehend certain things. And you have to have a certain sense of humor to dig all the coincidences that Gump comes across at. It's alike a marathon through many landmarks of the short US history we have behind us. Like the Watergate scandal, Vietnam War, Black Panthers and so much more.\n\nIf you can dig all that and go with the flow, than the chocolate box this opens up for you, will taste quite delicious. It had been quite a while since I saw this the first time, but it still worked its charme to say the least. Great movie, great actors - you have to be in the right mind set and mood though. And be able to forgive certain things ..."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "TheLittleSongbird",
        "review_rating": "9",
        "review_title": "Beautiful film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Xstal",
        "review_rating": "10",
        "review_title": "Encapsulating...",
        "review_detailed_main": "... all that is, all that was and all that will ever be, through the life experiences of the titular character performed to perfection by Tom Hanks whose generous performance leaves us humbled and in awe of what we can achieve, how we can achieve it and why we would want that achievement in the first instance. A piece of cinematic storytelling that will perpetually resonate no matter who or what you are, where you are going or who you are going with - timeless."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "a box of chocolate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Spleen",
        "review_rating": "2",
        "review_title": "Good if you're looking for something to set your teeth on edge",
        "review_detailed_main": "The other nominees for Best Picture of 1994 were `Pulp Fiction', `Four Weddings and a Funeral', `The Shawshank Redemption' and `Quiz Show'. ANY ONE of these would have been a deserving winner (my personal favourite was probably `Quiz Show'). Yet, of course, the award went to `Forrest Gump'. I took this as a deep personal affront. I took every undeserved success and wreath of flowers laid at the door of this miserable film as a personal affront. It was a standing insult to my belief that `Forrest Gump' was just too stupid to succeed for very long. Ah, well. Life imitates art.\n\nMake no mistake: `Forrest Gump' is not just stupid but a hymn to stupidity, an extended celebration of stupidity as a virtue. Gump is as innocent as they come and we're clearly meant to think that this is a good thing. The trouble is that Gump has purchased his sainthood too cheaply. He does not, for instance, display any real courage in the Vietnam War: he gives the appearance of courage only because he's too dumb to work out what's going on. (If only a bomb had landed on his foot. It would have knocked some of that insufferable self-assurance out of him, at the very least.)\n\nThe film is just one big, long appeal to the Pope to have Forrest Gump canonised, and is about as bearable as any such appeal - and, as is so often the case, the subject of this appeal is someone you wouldn't want to spend five minutes with.\n\n`Forrest Gump' is one hundred and forty-two minutes long."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Quinoa1984",
        "review_rating": "10",
        "review_title": "One of the best films of the 90's",
        "review_detailed_main": "Winston Groom's Forrest Gump was a novel that was complicated, but (Oscar winning) director Robert Zemeckis brings events together with visual effects that boggle even George Lucas.\n\nAnd leading the film in this odyssey of American life is Tom Hanks playing Gump (he won his second Oscar for his portrayal) in a film that shows one man who goes through many events in history to find the one he loves. Well done, well acted, and well directed to pythagorean procision. A++"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "bkoganbing",
        "review_rating": "10",
        "review_title": "The Hand Of An Unseen Providence",
        "review_detailed_main": "When Tom Hanks won his first Oscar for Philadelphia in 1993 the film received a total of five nominations. His second Oscar for Forrest Gump came in a film that received more than double that in nominations and awards. If Forrest Gump did nothing else it solidified Hanks's credentials as a serious actor. He would never be doing imitations of his Bosom Buddies character in films again.\n\nIt also among other awards also won for Best Picture and Best director for Robert Zemeckis, richly deserved. The film is Huckleberry Finn like in its canny observations coming from the man who had an IQ we are told of 75. But as Forrest also tells us, \"stupid is as stupid does\". And Forrest with the hand of an unseen providence comes out a lot better than some of the clever people he meets in life.\n\nWatching the film once again it occurred to me that Mark Twain if he couldn't have written this himself would have loved the way Zemeckis handled the character of Forrest Gump. The beauty of Huckleberry Finn and the secret of its success is that Twain got into the mind of a child who recorded all the events around him, a child without too much education. What Zemeckis did was get Hanks into a child like mind who sees things with amazing clarity stripped of any veneer of pretense. Which Hanks observes in the people around him and in the events that shape America and himself from Eisenhower to Reagan.\n\nThere are two prominent female parts in Forrest Gump. One is for Robin Wright who plays the abused child Julie as an adult. She is Forrest's love and best friend and she takes a different path of life one she chose with more deliberation than Hanks. Their fates though eventually entwined are radically different.\n\nThe second major female role is for another two time Oscar winner Sally Field who now is playing matronly parts, a far cry from Gidget and the Flying Nun. She gives Forrest the maxims he lives by and in a crisis they turn out to be more than sound bite clichés.\n\nAnother award that Forrest Gump won is for Special Effects and an award it didn't win was for Gary Sinise in the role of Lieutenant Dan Taylor, Forrest's commanding officer in Vietnam. That's something that does not compute because the special effects were to show Gary Sinise as a double amputee with both legs lost in Vietnam.\n\nIt's some amazing bit of work no doubt about it, but to honor it without Sinise whose performance really brings it off is ridiculous. Sinise is the educated one who curses the fate that happened to him, but in the end by just going with the flow he does prosper in the end. Sinise lost that year in Best Supporting Actor category to Martin Landau for Ed Wood, but I think Sinise's performance has had a more lasting impact.\n\nTo those Americans who serve our country it certainly has. Gary Sinise has devoted a great deal of his life and earned treasure to bring entertainment to our overseas troops in Iraq, Afghanistan, wherever, becoming a successor to Bob Hope in that regard. He's gone further than that though, setting up foundations to help civilians in both countries and contributing to numerous charities dealing with war and its aftermath. Doing that in my humble opinion Gary Sinise has become one of the great Americans of our brand new millenia, a lot more than just an actor. He's forever now known as Lieutenant Dan.\n\nIn the end though the film belongs to Tom Hanks who joined with Spencer Tracy as the only two male actors to win back to back Oscars for Best Actor. Hanks fascinates us and guides us through this film and when we're done we've seen something very special.\n\nIf you don't believe me about how good Forrest Gump is, then watch it for a few minutes and see if you're not sucked in. Like Forrest's mama says, the film's like life which is like a box of chocolates, you never know what you'll get until you open it.\""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "tightspotkilo",
        "review_rating": "10",
        "review_title": "An Amazing Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "simelemontolomeo-56461",
        "review_rating": "10",
        "review_title": "You need to watch it again and again.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "classicsoncall",
        "review_rating": "10",
        "review_title": "\"I just felt like running\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "tavm",
        "review_rating": "10",
        "review_title": "After 20 years, I still love Forrest Gump!",
        "review_detailed_main": "When I originally watched this with my mom 20 years ago, we both were pretty touched by the events of Forrest Gump's life and the way he handled things. So now, watching this in IMAX with my movie theatre-working friend, it's the same feelings all over again but now having some additional life experiences, one notices things one hadn't thought of before. Like how the first person who sits with Forrest on the park bench is so uninterested in his story she takes the wrong bus and admits it to him while the last one who sits with him doesn't take her scheduled one because she's so immersed in hearing about his life! Or how Jenny realizes how much she truly loves him despite the way she sometimes treated him. Robert Zemeckis truly made a very compelling picture. And Tom Hanks delivered a wonderful performance worthy of a second Oscar win. Nice humorous stuff involving Hanks mixed in real news footage of the various presidents. And great music soundtrack to mark the times they lived in. Oh, and I loved the supporting cast of Mykelti Williamson, Sally Field, Gary Sinise, and Robin Wright as Jenny. With all that said, I'll now just say that Forrest Gump is worth all the praise and adulation it has gotten over the years."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "CandaceDalton",
        "review_rating": "10",
        "review_title": "My favorite movie",
        "review_detailed_main": "I love this movie so much. It really shows what your mind can do, where it can make you go and to not judge people for what they may have going on in their lives. The good, the bad or the ugly."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "matt722",
        "review_rating": "",
        "review_title": "Forrest, Forrest Gump.. The greatest.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "acedj",
        "review_rating": "6",
        "review_title": "I liked it, but I did not love it",
        "review_detailed_main": "I get why so many people gush over this movie, I really do. I have watched it quite a few times myself. It is good to kill a few hours and be entertained. It ain't great though. The overwhelming emotion I feel for Forrest is pity, as he is strung along and used by the object of his affections. This is a decent movie, perhaps one of the best from Mr. Hanks, but I do not feel it deserves as much hype as it gets."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "david_topping",
        "review_rating": "1",
        "review_title": "A thoroughly nasty piece of work",
        "review_detailed_main": "This film clearly falls into the Love/Hate category. I think it's one where either you like the principle idea of optimism or you detest the idea that life is simply handed to you and all you have to do is throw it away.\n\nI for one hated this film. Not for the acting, which I didn't rate very highly, although Sinise put in a good performance in my view, I'm even a fan of Hanks other work but didn't particularly enjoy his performance here. No, I hated this film for its message which I found to be so central and pervasive that I couldn't enjoy any of the rest of the film's supposed qualities. The message I got from this film was that it makes no difference what you do in life, no matter how hard you work, how talented you are or how much you believe, if you just let life go past you, obey and be good then you will be a huge success. It's a belief I see more and more and one which I find abhorrent.\n\nStrangely enough it seems that this belief is becoming true. Make an average film with average acting and you too can have a huge box office success and win multiple Oscars.\n\nPerhaps this is then a truly brilliant and ironic piece of work. I still hated it."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "nwoolf-46353",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "An amazing movie the acting was fabulous by Forrest Gump (Tom Hanks) one of the best movies of all time and one of my favourite."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "colephelps-84155",
        "review_rating": "10",
        "review_title": "Real Message",
        "review_detailed_main": "My friend suggested me to watch this movie. I didn't expect anything out of it, just wanted to pass some time. After the movie ended, I felt like I had never seen anything like this before.. It even made me write a review. Such a beautifully made movie, has got everything. Teaches you about the power of love and innocence. Sometimes we take our life as granted and all we think is we don't have anything. This movie tells you how to realize and work with all that you have, no matter how you are. Brilliant way of telling a story of a young boy Forrest and his life. Not only through the eye of Forrest, but a mother, a friend and general people. The way your innocence wins over anyone you come across is exceptional, and all you will leave behind is love and respect. Magnificent movie."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "aussieg",
        "review_rating": "10",
        "review_title": "Must watch!",
        "review_detailed_main": "An absolutely remarkable film about a decent, humble man who throughout his life met a few presidents, fought in Vietnam, was a professional Ping Pong player and ran around the whole country of America while also meeting celebrities like John Lennon and Elvis Presley. A truly heart changing film that will change your life forever. After all this Forrest had an I.Q of 75 but that didn't stop him."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Horst_In_Translation",
        "review_rating": "8",
        "review_title": "Timeless masterpiece, very unique",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ironhorse_iv",
        "review_rating": "9",
        "review_title": "Life is like a box of chocolates. You never truly know what you're gonna get. Forrest Gump is amazing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "charlotte-taylor-brown",
        "review_rating": "10",
        "review_title": "Favourite film of all time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "jasminemermaid",
        "review_rating": "10",
        "review_title": "What a movie...10",
        "review_detailed_main": "10 10 10 10 10 This is a brilliant movie. Im wondering when a movie similar to this will appear any time soon in theaters."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "katarinaherd",
        "review_rating": "10",
        "review_title": "amazing",
        "review_detailed_main": "Amazing movie filled with laughter, tears, and love. this movie is the best movie and everyone needs to watch it. Tom Hanks plays the character amazing."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Vincentiu",
        "review_rating": "",
        "review_title": "delicate silhouette",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Spyrosmoviebuddy",
        "review_rating": "7",
        "review_title": "Jenny is bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "PaulLondon",
        "review_rating": "3",
        "review_title": "How is Gump ageing?",
        "review_detailed_main": "I recently saw this film again and was interested to see whether it had improved with time or I had mellowed in my opinion of it. Not a chance! The film looks even more tritely prelapsarian than ever. Basically the film is an unashamedly reactionary piece of brain candy floss, sickly and insubstantial.\n\nIn this films universe Simplicity = Good Social change = Bad. Agents of social change = very bad and therefore they must contract AIDS. If it wasn't so nauseating it would be funny.\n\nUnfortunately, the Academy took it seriously and it picked up Oscars, when they should have booed it off the screen. Cynically sickly and morally bankrupt its a disgrace.\n\nIncidentally Jamie Russell in his book \"Vietnam War Movies\" wrote; \"Forrest Gump is Hollywood at its most horrendous...Whats most worrying is that the British Board of Film Classification saw fit to give this evil little film a U certificate. How can we protect our children against such insidious brainwashing\" How accurate an insight."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ddelgerjamts",
        "review_rating": "10",
        "review_title": "One movie thousand lessons.",
        "review_detailed_main": "What a movie. This is so interesting movie in the world. I can't stop watching. I feel like there is too many things in this world I cannot solve...And to silly, stupid Forrest everything is simple and he don't want to solve.The promises that Forrest made to his mother, Bubba, Jenny and Lieutenant Dan were all kept. His love, passion, drive and spiritual understanding were all unconditional."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "yassine_azaou",
        "review_rating": "10",
        "review_title": "My best movie",
        "review_detailed_main": "This movie has a lot of meaning The most important one, don't be smartass. Just be a good person, honest and kind, and God will help you."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "tommythek",
        "review_rating": "10",
        "review_title": "Forrest has \"gumption\"!",
        "review_detailed_main": "Gumption: noun; common sense, horse sense, initiative, enterprise (Merriam-Webster). Chop off the back half of that word and you have Forrest Gump, a towering fountain of stand-alone common sense in a nonsensical world gone crazy.\n\nIn a recent letter, a friend told me that she had just watched \"Forrest Gump\" and that she \"loved that movie.\" Although it had been some seven years since I had seen it, her comment to me reminded me that I, too, had once \"loved that movie.\" When it suddenly showed up on TV last night, I felt the urge, the need, for a refresher course on what it is like to be a Forrest Gump in a world of schlumps, myself included. Moreover, I needed the sanity and serenity of Forrest Gump the man to assuage the insanity and unserenity that has been the month of September of 2001. I have been assuaged.\n\nBy now, almost anyone who watches movies has seen \"Forrest Gump.\" At least once. Thus, we all know that it cannot be classified as a comedy. Nor as a drama. Nor an adventure. Nor a charmer. Nor a tearjerker. And yet, it is all of those things, all in one movie. \"Forrest Gump,\" when and as you are watching it, reminds you constantly that there IS good in the world. Even as you are watching bad events transpire in the movie, you seem to know that somehow, good will eventually result. That is because Forrest Gump is nearby -- around -- somewhere -- and wherever Forrest goes, goodness follows.\n\nMy favorite movie actor is, was and always will be Jimmy Stewart. With Jimmy gone and no longer with us, Tom Hanks has taken his place. In my heart. Just as Jimmy was in so very many of his famous and fabulous roles, Tom has become the American Everyman. He's the guy for whom you always root. You want him to triumph. You want him to get the girl. He HAS to get the girl! Even if the worth of the girl to be gotten is open to question, you STILL want him to get her, if only because he has always loved her and will always love her so unfailingly and so unconditionally. And when, at last, his unrequited love for his beloved Jenny (Robin Wright) is finally so deservedly rewarded, you feel as if you want to jump up and shout ... \"HALLELUJAH!!!\" Then, when Jenny tenderly tells Forrest that he is the father of her sweet little Forrest Jr., you think to yourself and you say to yourself, \"Yes, Self! That is right! That is as it should be!\"\n\nAnd that is right and that is as it should be about this entire movie. Even Lt. Dan (Gary Sinise), Forrest's self-loathing and loathable army buddy, is unable to avoid Forrest's goodness wearing off on him. Forrest \"touches\" everyone. And he doesn't even know it! He's just a guy living his life. He just ... is ... Forrest Gump, a guy with gumption in a gumptionless world.\n\nI am so very glad and happy that my friend told me she saw \"Forrest Gump\" and that she \"loved that movie.\" She spurred me to watch it once again. Having now done so, I feel that Forrest has restored both peace and love to my troubled mind and heart over the awful events of September of 2001. He is a reminder to us all that no matter how many Hitlers, Stalins and bin Ladens may rise and fall, we will always have a Forrest Gump to help pull us thru the evils that these evil men do. Peace and love to you, Forrest."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "BlackDogCEO",
        "review_rating": "10",
        "review_title": "My favorite movie of all time",
        "review_detailed_main": "I have watched this movie several times and shared with my children. Recommend to anyone that wants to feel good."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ageurin-334-631172",
        "review_rating": "8",
        "review_title": "A man with a mental disability lives through and takes part in many points of history.",
        "review_detailed_main": "Without a doubt one of the greatest films ever to be shown on the silver screen and only solidified by a stellar performance by the cast and crew. One of the few films everyone can say they have at least seen once, this movie deserved every Oscar it won and will go down in history as one of the best and well-done films ever to be created. Many can say that this film does have some very minor issues, things such as the questionable moral depicted by the love interest, Jenny, throughout the course of the entire film. Some could take umbrage with the less-than amazing special effects (though the time of production should be added into context)."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Wuchakk",
        "review_rating": "9",
        "review_title": "Numersous Secrets to Success are Shown in \"Forrest Gump\"",
        "review_detailed_main": "YEAR OF RELEASE: 1994 WRITERS: Winston Groom (novel) and Eric Roth (screenplay) DIRECTOR: Robert Zemeckis RUNTIME: 2 hours 22 minutes\n\nI haven't seen this film for about 7 years or so. Seeing it again I was reminded why this is one of my all-time favorite pictures.\n\nTHE PLOT: Tom Hanks plays Forrest Gump, a mildly retarded Alabaman who brushes shoulders with the key figures and events of the 50s through the early 80s. Due to hard work, focus and uncommon wisdom he is hugely successful at whatever he does (running, war hero, ping pong, shrimp fishing). Meanwhile, the one woman he loves in all the world, Jenny (Robin Wright Penn), flounders through life hopelessly trying to find fulfillment in the drug culture with all the wrong people.\n\n\"Forrest Gump\" is hugely entertaining on every level. It's a drama that skillfully includes both lighter, comedic moments and serious, tragic elements. If you've never seen it, don't think for a second that this is some average romantic comedy or goofball comedy. Far from it. I don't watch the Acadamy Awards or give any credence to their judgment (\"American Beauty,\" best picture? Please) but \"Forrest Gump\" is one instance where they were absolutely right in regard to the Best Picture award.\n\nSome have criticized the film as an imbecilic fantasy, arguing that a simpleton like Gump would never become successful. It's true that the picture exaggerates Forrest's successes and experiences, and in that sense it's not realistic, but the film plainly reveals WHY he experienced continued success throughout his life. We can all learn from these little gems of wisdom:\n\n-- Whatever your I.Q., zero in on the areas for which you have a real talent.\n\n-- Focus on those gifts and master them. In other words, don't be a jack of all trades. This is in line with the Russian proverb: \"If you chase 8 rabbits you'll catch none.\"\n\n-- Mastering your talents will take HARD WORK (which explains why lazy people are never wealthy, unless they inherit it).\n\n-- Whatever you do, do it WITH ALL YOUR HEART.\n\n-- Love deeply and cultivate deep loyalties (e.g. Jenny, Bubba & Lt. Dan). Loyalty is underrated.\n\n-- Be patient and slow to judge (unless someone abuses another person).\n\n-- Allow others the freedom to choose and make mistakes, even if it seems like it takes forever for them to learn from them.\n\n-- If something or someone STINKS, reject it and stay away from it (remember the prostitute?).\n\n-- Keep your word.\n\n-- Pray and have FAITH.\n\n-- Keep a humble spirit no matter how successful or great you become.\n\nWe can also learn lessons from Jenny: Trying to attain fulfillment through loose sex and foreign substances is a LOST cause. Recognize and embrace those who have your best interests in mind (i.e. those who truly love you and are loyal to you); stay away from people who use and abuse you.\n\nFrom Lt. Dan (Gary Sinise) we learn a potent lesson about struggling with God to find true peace, success and reconciliation. Dan's all-out fight with God on the shrimp boat in the storm is potent and REAL. The great men and women of the bible experienced intense struggles with God: Most of the book of Job shows Job arguing with the Almighty and wanting to put Him on trial for crimes against humanity (!!); When God finally answers him Job falls to his face in humility and reverence. Jacob fought with God all night; the next day the Lord changed his name to Israel, which means \"struggles with God\" (Genesis 32:22-30). Also, remember Jesus' struggle with God and His will in the Garden of Gethsemane?\n\nAnother thing we can learn from Lt. Dan is that he was able to recognize a \"golden connection\" in Forrest. No one makes it alone, no one. They had help. Despite Forrest's lack of academic smarts, Dan recognized his wisdom and greatness; it attracted him and he respected it. Because of his link to Gump he became hugely successful. Remember: \"One day of favor is worth a lifetime of labor.\"\n\nLate in the film you'll see Lt. Dan and his Asian fiancé at Gump's wedding. Note how Dan LOOKS at Forrest when they greet each other. Dan shows the utmost love and respect for Gump and is in utter awe of his simple-minded greatness. (This is great acting on Sinise's part).\n\n\"Forrest Gump\" is a film gem to be RELISHED on many levels. Not only will you be incredibly entertained, you may learn a thing or two."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "pbm",
        "review_rating": "",
        "review_title": "Will be classic in years to come",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sampj",
        "review_rating": "10",
        "review_title": "A beautiful story.I can see why it won 6 Oscars.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "talktomylittlefriend",
        "review_rating": "10",
        "review_title": "magical movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "MovieAddict2016",
        "review_rating": "6",
        "review_title": "I used to love this movie.",
        "review_detailed_main": "*** Momma used to say if you haven't seen this movie, skip the second paragraph, 'cause it's got some of 'dem magic spoilers ***\n\nMaybe my inner cynic finally got to me. I've seen \"Forrest Gump\" about seven or eight times altogether, and these last few viewing experiences left me with a bitter taste in my mouth.\n\nA few years ago I praised this film for being delightful, warm, inspiring, epic, etc. It was one of my top-ten favorite films. I loved it.\n\nI watched it again last night and was struck by how smug, contrived and self-conscious it is. It's almost sickeningly sweet - it's a fantasy (as I've always said) and all the characters live their lives to suit the story. I loved the poetic justice before - now it's kind of insulting.\n\nThe character of Jenny is, story-wise, a nice addition because all fairy tales have the hero and his girl. The setup is firm because it presents her as the only girl of Forrest's life, the one person who accepts him for who he is - as she grows up and changes he's always there for her. The ending is a nice full circle. But the fact that the film kills her off is too righteous. It's like, \"Hey, she did the sex, she did the drugs - SHE DIES! Who cares if she had a change of heart? She's a filthy skank!\" Forrest's \"Momma\" is a right-wing Christian fanatical who has an obsessive hold over Forrest. She's a bit like the mother in \"Bubble Boy,\" except in this films she's presented as a hero.\n\nAnd finally we come to Tom Hanks as Forrest Gump. Last year I thought it was one of the all-time best performances in any film. Now, I can barely stand listening to him.\n\nIt's all so smug and annoyingly sweet. \"Would you like a choc'-uh-lut?\" You feel like slapping the guy. Then taking his darn \"walkin' shoes\" and throwing them in a pool of gasoline and lighting them on fire. Along with his box of chocolates.\n\nForrest's smug attitude is a bit too self-knowing for my tastes. It's like he's saying a big screw-you to all the people who disagree. He's Uncle Sam's Favorite American - the dumb guy who was too stoo-pid to say no to the government, and in return was awarded with millions of dollars and a happy, content life. All the Vietnam protesters were pigs, praise America.\n\nAs far as \"retard\" characters go, Dustin Hoffman is still my favorite. Leonardo DiCaprio in \"What's Eating Gilbert Grape?\" is really good, too. But Hanks' performance is just a bit too self-confident and mugging - it's too damn innocent and naive.\n\nAs I said, this used to be one of my very favorite movies. I loved it. It used to move me to tears at times. (Well, almost, anyway.) But I guess I've given my inner cynic too much room to grow - now I see it as a smug, annoying little journey through America's pop culture - with a message at its core that says, \"Don't mess with America - or you'll get the Gump.\" America has enough blind love going already."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "classicalsteve",
        "review_rating": "3",
        "review_title": "Sometimes American Movies Are Like a Box of Gooey Chocolates, and Gump is Pure Sap: One of the Silliest Movies to Win Best Picture",
        "review_detailed_main": "There are two kinds of people in the world, my friend. Those who dig Forrest Gump, and those who don't. I don't. If \"Forrest Gump\" is truly viewed as some kind of inspirational cinematic experience, then America is in a lot of trouble. Forrest Gump is no masterpiece of cinema, not even by a long-shot. It is largely a formulated overly sentimental contrivance that simply plays too well into American saccharine tastes, mostly pop melodrama for the sake of pop melodrama. This was obviously made for the same audience that likes \"Sleepless in Seattle\" and \"Lucky You\".\n\nCertainly, I don't have a problem with the idea of a feeble-minded main character from which to tell a story. (\"Rain Man\", a similar idea, is a far superior story to and much more real than the silliness of \"Gump\".) I will concede Hanks' portrayal of Forrest is no less than brilliant, and he was deserving of the Academy Award for Best Actor in 1994. But was this film really deserving of Best Picture, Best Director, and Best Writing? Is this film really in the same league as \"Schindler's List\", \"Ghandhi\", \"The Hurt Locker\", and \"Platoon\"? I don't think so.\n\nA contrived stooge, a late 20th century throw-back to Lenny of \"Of Mice and Men\" (\"Tell me about the rabbits, George\"), enmeshed in a series of sentimentalized vignettes is nothing more than contrived farce. Does Gump represent the American ideal or fictionalized empty-headed-ness? Forrest Gump only mirrors American's insatiable appetite for the overly sentimental. Instead of telling a true human story, such as \"Rain Man\", about the struggles of a man verging on feeble-mindedness, the filmmakers decided to sentimentalize him and put him into the most ridiculous and unbelievable of situations. Because of the fantastical nature of the entire story, I think \"Gump\" does a disservice to those with intellectual disabilities, although I will admit it does so inadvertently. \"Rain Man\" I think achieves quite the opposite.\n\nSo many of the scenes in this movie made no sense. In the opening sequence when young Forrest's legs are in braces and, inspired by the \"girl next door\", he begins running down a Midwest dirt road, and his braces magically come off. Oh brother. Only Hollywood could imagine something that rings of a bad \"Saturday Evening Post\" illustration from the 1950's. Not even Norman Rockwell would have painted something quite so contrived. Of course the \"running theme\" will recur toward the end of the the film. Later, despite his feeble-mindedness, he's drafted into the army where he puts his rifle together faster and better than anyone in training. He's a feeble-minded genius. Maybe an idiot-savant?\n\nDuring the course of much of the film, Gump ends up involved in the most unlikely of situations. He plays football under a legendary college coach, goes to Vietnam, wins a congressional medal, meets John F Kennedy, becomes a ping-pong champion, meets John Lennon, informs on the Watergate burglars, and ends up investing his ping-pong winnings into the Apple Computer company. And then goes on a pointless \"run\" where all these people run after him. Or maybe this last part is realistic. Not about Forrest running but that people would follow. Obviously everybody followed Gump to the box office. And then to the Academy Awards. It's a wonder the filmmakers didn't have him take the next logical step and have him run for president. Raymond Babbitt (the autistic character from \"Rain Man\" played by Dustin Hoffman) could be his running mate.\n\nThe only saving grace of the film is some of the Vietnam sequences, and his relationship with Lut. Dan played by Gary Sinese, who is the other standout talent of the film. Gump's tour of duty and his relationship with Dan were far more substantive than all the rest of the movie put together. I think it would have been far more interesting and insightful if the story was about a feeble-minded man forced to fight in Vietnam rather than adding all the other asinine episodes that made me say to myself, \"Oh come on...\" And I liked aspects of Gump's relationship with Dan, and I wished that had been more developed rather than Gump popping up in high spots of American history. When Gump reports the Watergate burglary, I just about lost my popcorn.\n\nThe recurring theme of \"Gump\" is \"life was like a box of chocolates. You never know what you're gonna get.\". As I have never liked most of the candies in those boxes (I always end up with the slimy gooey ones), I guess I am not the right viewer to appreciate the wonders of \"Forrest Gump\". I typically avoid those boxes of candies just for that reason. I want something that has a little more meat to it, a little more realism, and a little more honesty. Not just gooey caramel. Whoever wrote Forrest Gump was eating a box of these candies and decided to make a movie about it. The problem with those box of chocolates is that you know exactly what you're going to get and that's why I avoid them."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "CinemaClown",
        "review_rating": "",
        "review_title": "A Heartwarming Rendition Of Love, Loss, Redemption & Stupidity.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "nicholls905-280-546911",
        "review_rating": "10",
        "review_title": "Impressive film",
        "review_detailed_main": "It's a feel good film, that's not a bad thing. In this modern era of sequels and reboots, films like Forrest Gump offer an escape. I still believe Pulp Fiction was the better film for the best picture Oscar, but this is still an incredible film. Touching and heartwarming storyline leads our central character through some important moments in history. One of a kind film, that was not followed by a sequel. Tom Hanks is the foundation here, but is surrounded by a great support cast."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "antmon",
        "review_rating": "9",
        "review_title": "Great flick",
        "review_detailed_main": "Great flick. Have to say anything under a 7 rating are just kids posting to goof around."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "jimmyst-75481",
        "review_rating": "10",
        "review_title": "The best film for me",
        "review_detailed_main": "The best film I have ever seen. If you are looking for something meaningful here's the stuff!!! Cinema is all about how it makes you feel. I think I felt in every possible way during this film at the right guantities the perfect moment. After this unsurpassed experience I became a better person or more specifically I knew how I wanted to be as a person. Life is all about goodness and how you can help your fellowman. You don't have to be smart, talented, gifted, handsome, tall. You only have to be hopeful. Have belief in your actions. Have belief in the world, even in the darkest hours. When you have witnessed pure love, affection, kindness there is only one thing to do. Share it, share it to the rest of the people. Even if people believe you're wrong and nothing will change. It will."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sujithvarma",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "One of the best movies I have ever seen - It made me realize truth and innocence still lives. The love he had was pure. I cried watching this movie. Also the way in which the story goes -the political element in it -very accurate and nice. Also every character in this film\n\n100/100 for the director and story writer - Not to mention the extraordinary legend Tom Hanks....Tom Hanks, Robin Wright Penn, Gary Sinise, Mykelti Williamson - every one has played their part beautifully.\n\nIf U haven't seen this movie - you are missing one of the greatest movie ever made...."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "gopikrishnan92",
        "review_rating": "10",
        "review_title": "A Perfect Film",
        "review_detailed_main": "Wow. An incredible film. I watched many other movies of Tom Hanks, Now i understand that i made a great mistake by not watching this movie this long. This is such an epic. Terrific acting by Tom Hanks, dint knew that he was this versatile. The film just creates a very good feel inside you that even after watching it just hangs within your mind. Gump is spontaneous with great talent even though he looks retarded. Every scene in the movie drags our full attention into it, by the spontaneous actions of Gump. The movie's BGM is also perfect and syncs nicely with the scenes. Everything, everything is perfect for this film. Such films are extremely rare. This should have been a multi Oscar winner and indeed, it is. Watch it. No other words. Just watch and feel."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "SnoopyStyle",
        "review_rating": "8",
        "review_title": "Tale worthy of Frank Capra",
        "review_detailed_main": "Forrest Gump (Tom Hanks) is a simple man with a sweet heart. It's his journey through American history. His childhood friend Jenny (Robin Wright) would travel the underbelly flipside of the same world. His journey is heavily influenced by his mama (Sally Field), Lieutenant Dan (Gary Sinise), and Bubba Blue (Mykelti Williamson).\n\nDirector Robert Zemeckis has added another chapter to the American mythos. It is a magical tale where the good guys win out. That you can rise to the top no matter what handicap you have. That a good heart will enlighten all it touches. It is a tale worthy of Frank Capra.\n\nIf I could have a wish, it is a deeper meaning to Gump's journey. For example, he's given a chance to comment on the Vietnam war but the sound goes out of his mike. I would have like to hear what he had to say. But that might have been asking too much. More than anything, Gump is not controversial."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "allicouldbe",
        "review_rating": "10",
        "review_title": "Jennyyyyy",
        "review_detailed_main": "Tom Hanks you're a genius. The way he creates is characters is something other actors sometimes fail to do well- coming from a place of true thought and empathy. This is my all time favorite"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "gasslanderkim",
        "review_rating": "10",
        "review_title": "Simply one of the absolute best movies ever.",
        "review_detailed_main": "Seen this movie about 6 or 7 times and it just gets better, even tho i dont know how thats even possible. Tom Hanks is THE actor of actors. Simply Amazing. Life lessons movie for sure. Also yeah, the 90s was so much better..I hope this world shapes up. Thanks."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Torgo_Approves",
        "review_rating": "7",
        "review_title": "Like the chocolate in a box, my feelings are mixed....",
        "review_detailed_main": "(r#79)\n\nI would lie if I said that Forrest Gump isn't an extremely well made movie. From the acting, to the feel-good story, to the pacing, comic timing, and fantastic soundtrack, it is one of the best movies ever made. Tom Hanks is good as the titular character, and Gary Sinise and Robin Wright Penn make for a strong supporting cast. Robert Zemeckis' direction hits all the right notes. The movie is also visually beautiful. So why did I only give it a 7 out of 10? Well, as well produced, directed and acted as the film is, there is an underlying cynicism that doesn't work well with the movie's innocent and good-hearted nature. The \"heart-breaking\" scenes become more and more obvious and deliberate with each viewing. Don't get me wrong, this is a great feel-good story and I did love it when I was younger. Maybe I am just growing more desensitized to this kind of warm-hearted, mushy stuff. The problem probably lies more with me than with the film itself, but I still can't help but feel that Zemeckis was a bit too elaborate. There are scenes that, when you're re-watching the film, seem written specifically to make the audience crack up in tears. It borders on being manipulative, rather than letting the audience think for itself.\n\nThe movie could have worked as a serious drama. I'm a sucker for movies about mentally challenged men and I loved both \"Sling Blade\" and the more obscure \"Den Enfaldige Mördaren\". In the former, Billy Bob Thornton delivered a total class act. He embodied his character, Karl, to the point where you couldn't possibly compare him to his role in, say, Bad Santa. In \"Den Enfaldige Mördaren\", Stellan Skarsgård was also utterly believable. But I just can't buy Hanks in this role, even if it's probably the one he'll be remembered for. Thornton and Skarsgård, in their respective roles, *were* their characters. They were as human and real as you and me. Hanks' performance is a pure live-action cartoon, a caricature of a mentally challenged man. He's just too goody-goody. Too pure of heart. Too goofy and lovable. He's a man with no dark sides, and as such he's completely unbelievable. I did laugh at Gump's cute lines and catchphrases. I did feel for him when he got bullied around and when he finally got the girl in the end. But I wonder if anyone actually bought Gump as a character rather than just \"Tom Hanks playing a mentally challenged guy\".\n\nAnother problem is that the movie refuses to take any real risks. There is nothing controversial about the subject matter and nothing really inventive about the movie-making (although it is quite an achievement to fit an entire lifetime into a single film!) 'Gump' is not a movie that pushes the envelope in any way.\n\nThis is still a very enjoyable movie and first-timers will probably love it. It took a lot of viewings for me before my strong feelings for it started to falter. On the surface, \"Gump\" is one of the best feel-good movies ever made. But if you read between the lines, it is a cynical and very elaborate movie, nearly manipulative, and specifically designed to make you laugh, cry and pay for repeated cinema viewings. At least Hanks and Sinise do their best."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "enricobonanno",
        "review_rating": "2",
        "review_title": "One of the most over-rated American films of all time!!!",
        "review_detailed_main": "How can you start talking about a movie like \"Forrest Gump\" without being bias on the whole hype that has been surrounding it since it came out. For someone who actually knows about films, it is a personal insult that the Academy Awards considered this movie to be in higher standards than...\n\nPulp Fiction The Shawshank Redemption Quiz Show and even Four Weddings and a Funeral\n\nand how could Robert Zemeckis' (I hate that name) work be considered better than...\n\nKrzysztof Kieslowski for RED!!!!!!!!!!! Quentin Tarantino for PULP FICTION!!!!!! Woody Allen for BULLETS OVER BROADWAY!!!!!! Robert Redford for QUIZ SHOW!!!!!!! Not to mention that the Academy is such an airhead that Frank Darabont the director of The Shawshank Redemption wasn't even nominated!!!!!!\n\nLet's consider MANY important factors for this movie to be loved blindly, without a true sense of reflection and observation.\n\nNumber 1: I have to much time on my hands,\n\nNumber 2: It stars Tom Hanks who undoubtedly represents the white, flawless way of American Life. He is the Jimmy Stewart of today (that could not hurt). He is talented, but highly overrated. He has some excellent performances, but he always seems the same to me. He could never have the talent that actors like Gary Oldman, Ed Harris, Sean Penn, Russell Crowe or Denzel Washington have to reinvent themselves every time in a different role. He is the typical American male sweetheart, regardless everybody loves him. His star power more than his ability as an actor helped this movie to get sold and appreciated.\n\nNumber 3: Stories about characters with disabilities always, and I mean always sell in Hollywood (Rainman, I am Sam, Nell, My Left Foot, Awakenings, One Flew Over the Cuckoo's Nest) not that I am saying that these great films compare to Forrest Gump, but the idea itself whether good or bad sells.\n\nNumber 4: The history of the United States is taken rather lightly in this movie, all the events that take place around the character happen without his knowledge in the most unconvincing of methods. Racism, Vietnam, meeting a number of American Presidents, his unheard speech at Lincoln Memorial, the hippies, drugs, Bubba Gump shrimp, apple computers, amongst other historic events in which the character gets involved, but does not seem to grasp the magnitude of those very events. He is mentally handicaped as we are shown from the beginning, so because we are suppose to believe that he is emotionally handicap too. He never seems to get emotionally affected by anything, unless it involves Jenny, even then it does not appear to be convincing or moving in any way.\n\nNumber 5: The story itself appears to me as manipulative, sappy, uncompromised and made in half measures. It touches certain issues, but never dwells on them with justice. The ingenuity of the character, his disability seems enough reason to feel that all the events are seen with a certain depth. Which they are not. It is unfair, because Hanks' charm and Gump's likeable stupidity work as a hook to entangle people's emotions. It never allows for anyone to make an effort to see beyond the story and into the gut of what was attempted to be said.\n\nNumber 6: Stupid moments, everybody loves them, Hollywood is an expert of what people like and what they want to spend their money on. Gump begins a \"marathon\" across the country for no real reason at all, half way decides he's had enough, by then the entire country was following him (as a metaphor for the movie itself). Elvis Presley the King or Rock ends up as a youngster, who knows how, in Gump's house as a visitor. Gump who has braces in his legs miraclously teaches him the dance moves that made him famous. Something that I personally cannot consider to be taken lightly is an issue like the Vietnam War, but Forrest somehow manages to run in and out the jungle in the middle war saving people left and right. Maybe Zemeckis never read a book or even watched a film (Apocalypse Now, Platoon, Full Metal Jacket, Casualties of War) to illustrate him on what really happened on that war. Young soldiers were getting killed by the dozen. Forrest Gump is a fairy tale based on unfounded grounds and hypocritical notions of \"reality\". Oliver Stone dedicated his film Platoon to the American soldiers in Vietnam, he went there for real and saw what happened. Zemeckis has decided to ignore all these factors and still believe that his adored character could even be immune to a experience like Vietnam (in every aspect possible).\n\nTo conclude please do not let yourself be manipulated, not just because Forrest Gump won the oscar for Best Picture makes it one of the best films of the 90's. The \"sweetness\" of this movie is not even sweet, its only the a ploy, a sales pitch of the American Dream. In 20 years who will remember Forrest Gump, and more importantly who will remember that film when The Shawshank Redemption and Pulp Fiction are still in people's memories for real reasons. They are art films, Forrest Gump the oscar's favorite.\n\nAnd seriously folks if you haven't seen Kieslowski's RED run over to blockbuster and rent it. Its the end of the Color Trilogy. Then you'll know what we mean.\n\nthank you. VIVA EL CINE!!!!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "cocaine_rodeo",
        "review_rating": "",
        "review_title": "\"Bye Bye Jenny. They sendin' me to Vietnam. It's this whole other country.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "aalefragkis",
        "review_rating": "10",
        "review_title": "great movie",
        "review_detailed_main": "You must watch this movie. it's one of the best in history."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "torturedsoul",
        "review_rating": "10",
        "review_title": "One of the best of the 90's",
        "review_detailed_main": "I have seen Forrest Gump about 15 times, and every time it drives me to tears. It shows how a man who is not exactly \"right\" can be very successful and lead a full life. I hear people all the time criticize this movie, but why? How can't you love this movie? Forrest is so likeable and the filmmakers even succeed in making some humorous parts which is not normal in most dramas. Tom Hanks pulls in a great acting performance as Forrest and their are other great performances, also. Too many of them to name. It deserved that Oscar. I feel that wholeheartedly. I give it an A+."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "MohammadhSamii",
        "review_rating": "10",
        "review_title": "Simple and beautiful",
        "review_detailed_main": "Put yourself in the wind like a feather, always have faith and repeat this to yourself: everything will be fine"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "AaronCapenBanner",
        "review_rating": "9",
        "review_title": "Uplifting & Wondrous Fable.",
        "review_detailed_main": "Tom Hanks plays Forrest Gump in Robert Zemekis's Academy Award winning(Best picture, director, & actor) fable about a simple and honest man who finds himself floating through life like(the ever-present) feather in the wind. He is often bullied growing up, but finds solace in his best friend Jenny, whom he comes to love dearly as they get older. She tells him to \"run Forrest, run\" and he does, and one day runs into a football game, inspiring the coach to put him on the team, which makes him more popular, though at graduation he joins the military, where he fits right in, much to the bewilderment of his superior officer, Lt. Dan(played by Gary Sinise) whose life he saves, giving him a medal and inspiring him to be a Ping-Pong champion, where he meets three different U.S. Presidents, and later becomes a multi-millionaire by investing in \"a fruit company\" that takes off in a big way. He loves his mother(played by Sally Field) and takes her departure quite hard, running a marathon across the country for years, until he meets up with the elusive Jenny once again...\n\nEpic-scale character study is supremely well crafted and acted, remaining a funny, moving, and inspired drama about how one good man can affect the world around him, and still not know it, and remain uncorrupted by it. A truly marvelous achievement by all."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "rashadmusic-168-76869",
        "review_rating": "8",
        "review_title": "beautiful",
        "review_detailed_main": "This film is one of my all time favorite film. He goes through life on a cloud, which could be each of us. I hated that she penned the baby on him, which is crazy. I love the fact of the Bama football, roll tide. This is a great film, powerful, magical, passionate. He had a good life, only thing he couldn't figure out why she just didn't love him. I loved the comedy, also didn't know Tom had it in him. This film had some very powerful moments, that are life lessons. The story is truly a ride of a life time. Whatever he put his mind too, he did it and was pretty good at it. I would've loved to be apart of this cast, very powerful."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "thebigpapi_28",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Best Movie Ever!! Period...\n\nI've watched this movie like a dozen times and every time I watched it I love more this movie."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "redwingnut9798",
        "review_rating": "10",
        "review_title": "Free Bird Symbolism",
        "review_detailed_main": "I was wondering if anyone else noticed that when they were kids, in the field behind HER house when her dad was hunting for her, she prayed \"god make me a bird so I can fly far, far away.\"(as birds did fly away) Then when he found her singing naked at the bar and they were on the bridge she asked him \"do you think I could fly if I jumped?\" Then when she was ready to dive off the hotel balcony, the song Free Bird by skynnard was playing and at the end when he was walking away from her grave, he paused for a moment and watched the birds land in the tree above her. The symbolism of her trying to always get away and find peace and freedom only happened when she died and was laid to rest. By the way, the soundtrack cd for sale for that movie had every song on it but Free Bird."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "smmgod",
        "review_rating": "10",
        "review_title": "10/10 10/10",
        "review_detailed_main": "10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10 10/10"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "hbbio",
        "review_rating": "6",
        "review_title": "You're dumb...",
        "review_detailed_main": "...but the USA can make you rich, healthy and famous with the minimum trouble to make this a pure Hollywood movie. Should I say that this movie, though cast is okay and directing conventional, is much overrated. This movie seems made for a religious and puritan American audience, and it received here in France a particularily mixed opinion. Script has to my mind many flaws, music is irritating, and again I completely disapprove the meaning... so watch it (once only) if you have time and make yourself an opinion but don't think you are going to watch a wonder just because of its 6 academy awards! 6/10"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "drahmiel",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "This is one of the worst movies of all time. It is nothing more than an expensive, intricate jigsaw puzzle and none of the characters have redeeming value with the possible exception of Forrest's mother. His love interest Jenny is a vile human being and at no time did I want Forrest to end up with her. The off putting message IS in fact that you can be an idiot and be successful, and in fact suggests that it might be better to be so. The idea that skills that many people find so difficult to master all come so easily to a simpleton like Forrest is offensive. Its saving grace is that the book is even worse. I don't understand what people love about this movie, which is vastly overrated."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "mword-60551",
        "review_rating": "10",
        "review_title": "Run Forest,Run",
        "review_detailed_main": "This is a great film. love how it is a history like film"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "nobuyuki_shinoh",
        "review_rating": "10",
        "review_title": "The Real movie",
        "review_detailed_main": "I would say within all the movies I have been watching, the movie Forest Gump is the one and only movie that I feel it is the real movie, to be honest, this movie should have been Oscar winner. Except for the amazing war scenes on the movie, Forest Gump also succeeded in illustrating the whole development of the character from his childhood to his adult."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Science_Fantasy_Guy",
        "review_rating": "10",
        "review_title": "A magical and powerful celebration of life. A true classic.",
        "review_detailed_main": "Every so often there are movies that seemingly get released right at the right time and subsequently become cultural phenomenons beyond their creators' wildest dreams. These movies often largely retain that success and esteem over the years (Gone with the Wind, Star Wars and Jaws among others) or age poorly and get viewed as undeserving of their huge success at the time (for instance, Independence Day). Although no movie appeals to absolutely everyone's taste, Robert Zemeckis' Forrest Gump certainly can be said to belong more in the former category. Released in 1994 it raked in nearly seven hundred million dollars worldwide, becoming the second biggest box office hit of '94 (after The Lion King) and mopped the floor at that year's Academy Awards, winning six trophies including Best Picture (although I prefer Pulp Fiction and The Shawshank Redemption by the tiniest of margins, but this isn't about those two), Director and Actor. It's a classic that, after first seeing it in 1997 when I was 9, has stayed with me to this day. I'm about to explain why.\n\nI don't think there's any need for me to talk about the story, so let me begin with the cast ensemble Zemeckis assembled for this film. Sally Field will always be Mrs. Gump to me, and she turns in a beautiful performance as a strong woman with integrity who vehemently refuses to think of her son as a retard and does her best to make sure he never sees himself as one. An Oscar-nominated Gary Sinise is riveting as the hard-bitten but scarred military man Lt. Dan who comes to learn from Forrest the values of redemption and selflessness. Robin Wright Penn is heartbreaking as Forrest's free-spirited but deeply troubled true love whose life takes a very different route to Forrest's, and Mykelti Williamson also gives a very touching turn as Bubba, the African-American young man with a heart of gold who becomes Forrest's best friend in Vietnam.\n\nBut at the risk of sounding like a hyperbolic and dangerously obsessed fanboy, I daresay the acting masterclass Tom Hanks puts forth here is the finest display of acting I have ever witnessed. No other actor before or since has made such a convincing transformation into the heart, body and soul of another person as Hanks does here. Every delayed or confused mannerism is spot-on, his Southern accent is flawless and his every emotion letter-perfect. In the whole film, particularly the grave scene towards the end, you look into his eyes and you don't see Tom Hanks, you see Forrest Gump. Utter perfection.\n\nMany will say the storyline is a contrived, manipulative and even conservative affair (and, admittedly, in some respects they may be right), but they're oblivious to the darker subtext in Eric Roth's screenplay and the many postmodern storytelling methods Zemeckis deploys here. While we watch Forrest encounter so many historic people and events, we see Jenny experience the negative side of '60s and '70s counterculture as she protests the Vietnam War, embraces alcohol, drugs and illicit sex and also for much of the film's duration Forrest's impairments are exploited for laughs. When we analyze this side of the story the film becomes much darker than it initially seems. The unconventional methods Zemeckis uses in telling Forrest's story enhance this – in his narration he discusses things that are yet to happen and the placing of Tom Hanks into old footage of the real-life events gives the movie a revisionist historical feel.\n\nAnother huge plus is the soundtrack, containing most of the greatest artists from the '50s to the early '80s.\n\nForrest Gump's charm and appeal is timeless, and its artistic craft is even better. It's a rollicking tapestry of American history from the '50s to the '80s (both good and bad), driven by a powerhouse ensemble cast and a brilliant crew working on a brilliantly constructed screenplay filled with dozens of lines that have entered the lexicon, all brought together by the love and passion of a genius director. Forrest Gump is a classic that will look handsome in any DVD collection, and is yet another movie that never leaves me feeling amazed no matter how much older I get. A true classic."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "jboothmillard",
        "review_rating": "9",
        "review_title": "Forrest Gump",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "emrelanur",
        "review_rating": "10",
        "review_title": "That's one special man...",
        "review_detailed_main": "I think that the best movies are those that you 'appreciate' or understand after seeing it more than once. However, with 'forrest gump', i fell in love with it after the first 15 minutes and knew it would be in my top 10 straight away.\n\nIt is so unique because of the character Forrest Gump himself, who has a low IQ of only 75. Although he is 'mentally challenged', he finds himself in historic and troublesome situations and like that he manages to 'forrest gump' his way out of it and end up a hero or role model. but the real beauty in this movie to me was his ability to simplify the complexities of the world we live in and somehow do what some war movies fail to do. show the importance of world peace or what love movies can't deliver...the importance of love.\n\nI love that Forrest doesn't lose his innocence and purity throughout the movie, or maybe he just can't but either way, this shows you don't need to be evil or really intelligent to be recognised or successful. Then again it is just a movie (and a very good one too). So maybe it doesn't work like that in reality. what that simply means is that the acting and story of this film was incredibly touching on a real level. And in my definition that's what a good movie should be able to do.\n\nEvery award the movie received was well deserved especially Tom Hanks. Now that's an actor for ya. I love this movie and don't hesitate to give it a 10."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "A reasonably enjoyable romp through recent history and pop culture \u0096 any more than that and it's a crass conservative message (spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "rickeypinkney",
        "review_rating": "10",
        "review_title": "Heart Warming",
        "review_detailed_main": "This movie was amazing. It reminds me of my rises and falls in my life and just seeing how resilient Forrest Gump became was really inspiring. He had so much to offer the world, even when no one saw his ability to contribute to society. He did everything from leading a football team to a championship, to being a war hero. Even through the tough times in high school to the frantic relationship with Jenny, Forrest still remained humble and resilient. Any anti-bullying campaign, in my opinion, should use Forrest Gump as a prime example. Maybe even go as far as showing the movie. The movie also shows what it truly means to keep a promise. The promises that Forrest made to his mother, Bubba, Jenny and Lieutenant Dan were all kept. His love, passion, drive and spiritual understanding were all unconditional. What an amazing movie"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "spraytor-97991",
        "review_rating": "10",
        "review_title": "Forrest Gump",
        "review_detailed_main": "The movie Forrest Gump is about a boy who suffers from mental retardation. He also suffers with scoliosis and has to wear knee braces. The movie tells a story about his life and his accomplishments. He suffers bullying from the people in town and the kids in school. He grows up and proves a lot of people wrong. The story takes place in a small town called Greensboro, Alabama. Tom Hanks portrays the character Forrest Gump. This movie won eight Oscars, one of them being Best Actor in Leading Role. Tom Hanks won the award in 1995. He did a very good job of showing Forrest Gump without mocking his disability. We meet Forrest's character at bus stop talking to people on the bench about his life accomplishments. After that, the story starts with Forrest' first day on the bus. This is when Forrest first experiences the other kids bullying. Until he meets young Jenny, who lets him sit beside her on the bus. Young Jenny is played by Hanna Hall. Jenny becomes his best friend and doesn't look at his disability as a difference. Forrest and Jenny grow up together and spend all their time together. Jenny has an abusive and drunk father. Older Jenny is played by Robin Wright. Forrest gets many opportunities, he is asked to play football in college. You also see many history events and how innocent Forrest's eyes are to the world. The movie is told in the 1970s, a lot of movements happened in the seventies. The movie shows both Forrest's experiences and Jenny's life, vastly different. Jenny went through the hippie movement, with drugs and peace. Overall the film Forrest Gump is a great movie. It's definitely a movie you could re watch and still enjoy it as much as the first time."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "troyputland",
        "review_rating": "9",
        "review_title": "No one does it better than Tom Hanks.",
        "review_detailed_main": "Forrest Gump (Tom Hanks) is sat on a bench waiting for a bus. He's hardly the most intelligent person in the world, but he's definitely the most caring, heart-warming and relatable character to ever appear in film. Gump tells his story to other bus-waiters who come and go and only hear snippets of the whole tale. The path towards present day is packed full of events and achievements, some of which include the Vietnam war, meeting the President (twice), unveiling the Watergate Scandal and running non- stop for over four years. Sounds ludicrous. Above all else Gump has accomplished feats that would occur over many lifetimes. Tom Hanks though, fills Gump's story with tenacity. He has an eventful life, one full of ups and downs. Very sad, but very humorous. A great film controlled by its lead man."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "claudemercure",
        "review_rating": "6",
        "review_title": "entertaining but shallow",
        "review_detailed_main": "Entertaining comedy/drama/fantasy has a lot to keep you busy (and excellent special effects), but doesn't measure up to its epic pretensions. It would've benefited from sticking to comedy and eschewing sentiment. Instead it pushes every button imaginable to jerk a reaction out of the viewer, and tries to dictate your emotions with a pushy music score. The movie lapses into silliness at times, and is self-indulgent for the last hour. Director Robert Zemeckis attempts to evoke each era by illustrating its clichés and by scoring it to a procession of over-familiar songs that serve as lazy, embarrassingly obvious signifiers of their times (Sweet Home Alabama, Hound Dog, Blowin' in the Wind, California Dreamin', For What it's Worth, On the Road Again, Mrs. Robinson, etc.). I love a lot of those songs, but they've become clichés themselves by now. Tom Hanks is funny and convincing in the title role, but Forrest is too much of an invincible saint to be very interesting."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ScrimshawHatcheck",
        "review_rating": "1",
        "review_title": "Sugar-coated Trojan horse",
        "review_detailed_main": "This movie uses all the sappy, sentimental tricks in the book to sucker the audience into believing in poor, disadvantaged Forrest Gump: the sick mother, the bad legs, the innocence of incomplete mental capacity, the bullies, the girlfriend, etc.\n\nIf that's as far as it went, however, I wouldn't be writing this. The dangerous thing about this movie is its sweeping generalizations and stereotypical portrayals of events, groups, and people in recent American history. Because the filmmakers have succeeded in getting the viewer to pull so strongly for Gump, they can then pass off their revisionist version of the past few decades with little objection from the viewer.\n\nYes, it's just a movie, but images like these shape the way people think. The anti-war movement in the sixties and seventies and the Black Panthers, for example, were much more complex than portrayed in this movie. Using tiny, value-charged episodes to paint with such broad brush strokes, in settings that are designed to pull the viewer to Gump's side, is deceptive and manipulative."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "p-sw",
        "review_rating": "10",
        "review_title": "Life",
        "review_detailed_main": "Life is like a chocolate you never know what you gonna get."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "alex_ryde",
        "review_rating": "10",
        "review_title": "Book or Movie? Two separate monsters...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "auuwws",
        "review_rating": "9",
        "review_title": "Forrest Gump",
        "review_detailed_main": "A great movie, its great story and the story of Lieutenant Dan was sad, but I think it does not deserve the Academy Award for Best Film. I really enjoyed watching the movie and hated the character of Jenny."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "seymabilgen",
        "review_rating": "10",
        "review_title": "Great!",
        "review_detailed_main": "actually this movie is one of my favorite movies. the story is amazing, breathtaking. and tom hanks is rocking it! every human on earth should watch this movie! the story shows us that no matter what we can still do big things as long as we believe. Forrest is an inspiration for so many. if you haven't seen this movie yet, let go everything and start watching. after you've seen the movie something is gonna change. go and watch! enjoy!!\n\nPS: tom hanks is great. the directors could record him as he sleeps and still he can win the Oscar! :D\n\nit's a movie which has 6 Oscars! c'mon! what are you waiting for? watch!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "whitelotus_triad",
        "review_rating": "10",
        "review_title": "Never Been Better!",
        "review_detailed_main": "Tom Hanks is incredible in such an inspiration movie. Do not see this movie from the wrong angle. Never questioned the reality of this movie. Get the message from this movie. They're a lots! No overrated. This is quality imaginable movie that inspires people around the world. This is the fact that this movie is 4 and a half out of 5!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "zkonedog",
        "review_rating": "10",
        "review_title": "Gets Better Every Time I Watch It",
        "review_detailed_main": "When it comes to the greatest dramatic films ever produced, \"Forrest Gump\" has to be near the top of that list. Put succinctly, it has everything a movie could possible hold: adventure, great characters, drama, emotion, and humor. There are very few films that combine all those things with such aplomb as director Robert Zemeckis does with \"Gump\".\n\nFor a very basic summary, this movie tells the story of Forrest Gump (Tom Hanks), a man who, on the \"scale of normal\", falls a wee bit short in the intelligence department. However, via the guidance of his beloved Mama (Sally Field), the constant wanting for childhood sweetheart- turned-wild child Jenny (Robin Wright), and friends like Bubba (Mykelti Williamson) and Lt. Dan (Gary Sinise), viewers are shown a life that, despite coming from such a simple mind, touches so many others.\n\nFirst and foremost, this is a movie that perfectly captures the angst of the Baby Boomers generation. Throughout the course of the film, everyone takes a stand on something and refuses to budge. Jenny is a hippie, Lt. Dan has a death wish, and even Mama Gump is okay with her boy selling out for U.S. ping-pong. The ultimate point made, however, is that such behavior cannot last forever and eventually one has to find their true self. That's exactly where Forrest comes in, as he never loses himself to begin with. Despite his simple mind, he \"knows what love is\" and shows it to everyone around him, even when they are using him for various reasons. In a swirling, turbulent world, Forrest is a bastion of self-awareness (ironic, as his awareness in other life areas is so low!).\n\nIn order for all those things to work, it takes the acting performance of a lifetime--exactly what Hanks is able to give. There may never be a more deserved Best Actor Oscar given to anyone, as he perfectly nails both \"goofy simpleton\" and \"emotionally self-aware adult\", often in the the same scene. As many juicy themes as there are for Zemeckis to work with, this is as much a Hanks masterpiece as anything else\n\nOverall, \"Forrest Gump\" is no less than landmark cinematic effort. It captures the essence of Baby Boomer social struggles and does so in ways that make it timeless. Much like Zemeckis' earlier \"Back To The Future\", it is also a film in which not one scene is wasted. There is something interesting to either behold or ponder in quite literally every frame. Every time I watch this movie, I appreciate it a little bit more."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ofpsmith",
        "review_rating": "10",
        "review_title": "\"Run Forrest, Run!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "yooeun228-1",
        "review_rating": "8",
        "review_title": "everyman,,,",
        "review_detailed_main": "Robert Zemeckis directed this movie, Forrest Gump, in 1994. It well maintained the theme from the original version of book, \"Life is like a box of chocolates\" and \"Stupid is as stupid does\" This movie contains a lot of great actors and actresses who could act their own characters very well and showed the theme or plot. The reason why this film became so popular is because this story isn't just for the certain period or certain people, but for everyone.\n\nThe movie begins in the small fictional town in Alabama but soon; the setting of this movie goes on to the whole world. The setting also proves about the universal theme, \"Everyman\" All the important events happen between late 1950s to late1980s. This movie doesn't only affects about late 1950s to late1980s but the present time also. Such as white trash and people who have physical problems didn't live only between 1950s to 1980s but they still exist.\n\nThere are several characters that strongly affect the theme or the plot of this movie. First of all, the surrealistic character, Forrest Gump who was acted by Tom Hanks well represented the theme and also well showed of physical problem of Forrest. His IQ was under 70 and he had a problem with his legs when he was young. When he became an adult, he was still prejudged by people based on his intelligence. However, later he becomes really famous and rich. This event doesn't really mean to show that Forrest Gump became a successful person, but the movie is trying to break a strong stereotype of people, by using Forrest Gump. Also, it is telling not to judge people's ability or characteristics by intelligence or physical abilities. Like his quote \"stupid is as stupid does.\" Mrs. Gump, Sally Fields, the actress was actor playing the mother of Forrest shows the theme of strong determination of all mothers in the world. Even though only ten year older than the grown Forrest Gump, her acting was so realistic that the audience didn't realize her age. Jenny, who was acted by Robin Wright, showed the reality of dark side of Americans' life. In the movie Jenny was the \"white trash\" but she isn't the only who is showing the theme of American life but partly, but through L.T he is somehow showing it too. He's character was so realistic. A deep friendship is expressed through his characterization.\n\nGenerally, there are six most interesting events that are happening in this movie. In my opinion, starting the movie by grown Forrest Gump talking about his childhood from the present time on the bench is a good idea. His first interesting event starts when he entered school. He had a hard time. On the school bus everyone seemed to avoid him or be as far away from him, only because of his physical appearance. But later, Jenny who didn't look about her appearance came to him and be friend. Other than this, there are three events that Forrest Gump becoming all famous and meeting the U.S president three times. With this event, the plot goes really high in audience interest and I'm sure that viewers loved these events. Lastly, there is one important event left, about Jenny and Forrest that went audience very pleased but not a real happy ending.\n\nI was very impressed with this movie, especially with the acting skills and the themes of this story. This is a film that everyone would like and feel empathy with all these characters. The plot also appeals to average and ordinary people. I recommend this movie to all people no matter how old they are."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "jhonsstive",
        "review_rating": "",
        "review_title": "Forrest Gump: A Story About Being Kind and Brave",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "kyrat",
        "review_rating": "6",
        "review_title": "puzzled by its popularity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Kane III",
        "review_rating": "5",
        "review_title": "Revisionist history:- after only 30 years.",
        "review_detailed_main": "The thing that really spoils my enjoyment of this film is the way history is re-written.\n\nNot ancient history, but history which I lived through. In real-life the anti-war protesters were venting their disapproval of what they earnestly felt was an immoral war. They took a lot of knocks from the powers that be for their troubles as well.\n\nThis movie depicts them as shallow, selfish, manipulative, power-driven, and even violent people (there's irony for you!) who were \"Unamerican\" in every sense of the word.\n\nThe odious message of this movie is that ignorance is bliss. Don't think about things and everything will work out nicely and you will be happy. Well at least you'll get rich - which in most American movies is close enough.\n\nIt's enough to make a person gag.\n\nOh, and the fact it beat Pulp Fiction and Shawshank Redemption to the best picture Oscar doesn't help either."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "TaylorYee94",
        "review_rating": "10",
        "review_title": "American history book + fairy tale for adults",
        "review_detailed_main": "Of course I heard about this famous 'Run, Forrest, run!', and how Forrest Gump is the best of Hanks' acting career. However, I'm telling you this was not my kind of movie according to basic information provided. It has one narrative which happens to be biographical. My first thought is that 'Forrest Gump' will be another linear story talking about one character throughout the whole movie. Linear story lacks dynamic and bores me. Second, it is very AMERICAN, the stuff only hollywood clique will enjoy. I keep myself away from the literatures that emphasize patriotism too much.\n\nHowever, this movie does not bore me a bit for 150 minutes. Even though Gump narrates his whole life from the childhood to fatherhood, it feels more segmented. By cutting each chunk of life story and getting back to Gump in the bus station back and forth, it feels like the movie is giving the audience break after each session. I get to refresh and sum up at every scene of Gump at the bus stop. Also, supporting characters are unique and powerful, making the movie more dynamic. Rather than having many insignificant supporting characters, the director chooses to select and concentrate on three. Then, the audience can hear about the full story of Jenny, Bubba, and Lt. Dan, sharing the story with Gump.\n\nEven though there were many American historical moments, they were just necessary to develop along with Gump's story. AND it was funny to see Presidents and Elvis alive again with visual effects. Life lessons given to the audience are not just for Americans. Many countries go through conflict, turmoil, and destruction, and 'Forrest Gump' concentrates on what choice an individual, Gump, makes during those historical chaos. I cried a lot watching this movie because every character was me, my parents, my grandparents, my neighbor, and my heroes. Gump's warm heart really console me at difficult times."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "raulbora",
        "review_rating": "10",
        "review_title": "Life is so beautiful..",
        "review_detailed_main": "Never wrote a review before but every time I watched Forrest Gump I got the urge to do it.. This time I couldn't resist it and here I am sharing a few lines with you folks :) FG is one of my favourite movies. I think that if I had to choose a word to described this movie that would be LIFE. Forrest shows me how simple, beautiful and basic life is and how easy is to miss it and let it pass you by. The movie is very detailed and keeps you hooked in until the end. Towards the end though it touches you, puts a knott in your throat and even squeezes some tears out of you. I am sure I have absolutely nothing new to add but I wanted to show and share my appreciation for this wonderful and brilliant movie. Beautiful, beautiful, beautiful ..."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "gavin6942",
        "review_rating": "8",
        "review_title": "American History Through The Eyes Of A Simpleton",
        "review_detailed_main": "Forrest Gump (Tom Hanks), while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran (Robin Wright), eludes him.\n\nThis film is fun, funny and touching, if not a little bit sad. If a school wanted to (and no doubt some have), it would be an interesting way to teach the second half of the 20th century. Elvis, Wallace, the Kennedys and more.\n\nThis is probably the film that \"made\" Tom Hanks. Although he was already big in the 1980s with \"Big\" (no pun intended), this was probably the turning point where he went from comedy to serious actor (well, somewhat serious). And it probably remains his most-watched movie of all time (well, besides maybe \"Sleepless in Seattle\")."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "FireFly390",
        "review_rating": "10",
        "review_title": "I loved this movie since I was little",
        "review_detailed_main": "I remember seeing this movie for the first time when I was eight years old. My grandfather always showed this to us when we were younger. It became one of my favorite movies , not because of the story line , but what it meant to me in real life. I remember watching the beginning when Forrest had his legs braces, like me. I thought \"He is like me and I know how it is to be teased.\" considering I have mild cerebral palsy this movie meant my life and how I can see others treat you different when you have \"special legs\". I learned from this movie just because you have special legs and you are not considered \"smart\" don't let that hold you back. It never did and I'am thankful for this movie. People need to understand just because you have a disability does not mean we are stupid. We can do many things."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "TheRKOguy05",
        "review_rating": "10",
        "review_title": "An all-time great performance from Tom Hanks",
        "review_detailed_main": "Iconic flick. One of my top 10 movies ever. Haliourious, charming and sad at times, Forrest Gump is brilliant and an unforgettable experience and that's mainly because of Tom Hanks. This is Hanks at his peak, definitely the finest, most memorable performance of his Iconic career."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "cesarfan",
        "review_rating": "10",
        "review_title": "Classic",
        "review_detailed_main": "One of the best movies. i really love the whole story, details and acting ."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "dmess",
        "review_rating": "10",
        "review_title": "The incredible ingenuity of Forrest Gump.",
        "review_detailed_main": "This is definitely one of my favorite movies. Impossible not to fall in love with Forrest Gump and his ingenuity to live his extraordinary life."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "WhatsUpManPodcast",
        "review_rating": "10",
        "review_title": "A Heartwarming Journey of Innocence and Resilience",
        "review_detailed_main": "Tom Hanks delivers a remarkable performance in the role of Forrest Gump, perfectly capturing the character's unique blend of innocence, kindness, and unwavering optimism. Hanks' portrayal is nothing short of masterful, as he immerses himself in the character and brings him to life with sincerity and depth. Forrest's unwavering belief in the goodness of humanity serves as a poignant reminder of the power of compassion and resilience.\n\nThe film's narrative unfolds through a series of flashbacks as Forrest recounts his life story to strangers he encounters while sitting on a park bench. This storytelling device allows the audience to witness the significant moments and relationships that shaped Forrest's life, from his childhood friendship with Jenny (Robin Wright) to his service in the Vietnam War and his unexpected success as a ping-pong champion.\n\nForrest Gump seamlessly weaves together elements of drama, comedy, and romance, creating a tapestry of emotions that captivates and engages the viewer. The screenplay, based on Winston Groom's novel, is a brilliant blend of heartfelt moments, sharp wit, and thought-provoking social commentary. It explores themes of love, friendship, destiny, and the power of an individual to make a positive impact on the world, no matter their intellectual capacity.\n\nRobert Zemeckis' direction is both sensitive and visually stunning. The film skillfully integrates Forrest's interactions with real historical figures and events, creating a sense of authenticity and grounding the story in a tangible reality. The seamless special effects enhance the storytelling, allowing the audience to experience Forrest's journey through different time periods with a sense of wonder and believability.\n\nForrest Gump boasts an outstanding supporting cast, with Robin Wright delivering a standout performance as Jenny, Forrest's lifelong love interest. Her portrayal adds depth and complexity to the film, exploring themes of personal growth, redemption, and the lasting impact of childhood traumas. Gary Sinise shines as Lieutenant Dan Taylor, providing a compelling portrayal of a wounded Vietnam War veteran grappling with his own demons.\n\nThe film's iconic soundtrack, featuring a collection of popular songs from the 1950s to the 1980s, serves as a nostalgic backdrop to the story, evoking a sense of time and place. The music not only enhances the emotional resonance of the film but also serves as a reflection of the cultural and historical context in which Forrest's journey unfolds.\n\nIn conclusion, Forrest Gump is a timeless masterpiece that combines exceptional performances, a heartfelt story, and a touch of magic to create an unforgettable cinematic experience. Tom Hanks' portrayal of the lovable and resilient Forrest Gump, coupled with Robert Zemeckis' direction and a well-crafted screenplay, make this film a triumph of storytelling. It reminds us of the power of kindness, the importance of embracing life's unpredictable moments, and the enduring impact of a pure heart. Forrest Gump is a must-watch for anyone seeking a heartfelt and uplifting cinematic experience."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "mikekozel",
        "review_rating": "",
        "review_title": "One of the best cinematic works of our time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "madgelhisayo",
        "review_rating": "6",
        "review_title": "Exquisite warmth",
        "review_detailed_main": "Delicate and warm American theme. The different fates of Forrest Gump and Jenny are almost a mockery of the affirmative action movement in the 1960s, and Forrest Gump's burial of Jenny is also the burial of America's own history in the 1960s. The writing is beautiful, the editing is clever, the monologues are soulful, and Tom Hanks' acting is flawless, but the film's values are dubious. So divided."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "jeremy3",
        "review_rating": "1",
        "review_title": "Didn't like or get the message",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "mohakrajpal",
        "review_rating": "10",
        "review_title": "Never Saw A Movie Better Than This",
        "review_detailed_main": "Most touching movie I have ever seen. Hats off to the lead actor and director. Need more movies like this!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "maartenvercauteren",
        "review_rating": "10",
        "review_title": "One of the best ever",
        "review_detailed_main": "Even after 25 years, still one of the best movies ever made!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "whatissnr",
        "review_rating": "10",
        "review_title": "Beautiful",
        "review_detailed_main": "I have no idea how people could even think about Forrest Gump a 1/10 under the simple basis of it being \"boring\""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Shzh-demaoong",
        "review_rating": "9",
        "review_title": "Amazing movie",
        "review_detailed_main": "The main character is extremely optimistic, which makes me sad. It's a bad experience for me to watch the movie, I don't want to see it again and I'm sad about it."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "GradualMovieGeek",
        "review_rating": "10",
        "review_title": "one of my favourites",
        "review_detailed_main": "This movie has a story in which there is not a particular group of people to dislike, rather more being characters you can't help but to root for them. This movie changed my point of view in the later life and what it's like to struggle sometimes in life, but with there always being a glimmer of hope."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "person-52076",
        "review_rating": "10",
        "review_title": "Epic",
        "review_detailed_main": "Best film ever. I can't believe that it isn't more highly rated"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "mateuszbovitz",
        "review_rating": "10",
        "review_title": "One of my favorite films",
        "review_detailed_main": "The film was not watched only by the lazy. I watch this film quite often, and every time it gives me these unique emotions, raising my spirits. But! I couldn't get my girlfriend to watch it, I'm just confused! XD."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "mohalegendxx",
        "review_rating": "10",
        "review_title": "great great",
        "review_detailed_main": "I enjoyed this movie, and I liked the character forrest gumb and I liked the evolution of the character and I liked the relationship forrest and jenny, I liked everything in all short"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "hernan_amado",
        "review_rating": "",
        "review_title": "Over-rated and disappointing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "a.grassick",
        "review_rating": "7",
        "review_title": "Be simple and you'll be happy",
        "review_detailed_main": "Entertaining (but long!), however the message seems to be \"be simple, don't question authority and life will be fine, be angry, politically active, and come to a bad end\". Not quite the message I think is healthy to spread!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "nataliekvaida",
        "review_rating": "10",
        "review_title": "My Favourite Film",
        "review_detailed_main": "Tom Hanks has always been my favourite actor. I have seen him in other films of course but Forrest Gump definitely stands out.\n\nIt is comedic, heart warming, and most definitely touching and I would recommend this movie to ANYONE to watch."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "dre4mys4",
        "review_rating": "10",
        "review_title": ".",
        "review_detailed_main": "Forrest gump is the best movie i've seen in a long time, it's so beautiful, so sad and it made me cry a lot - wich is very nice, cause i never cry with movies, because i'm always reminding myself that everything is fake - seeing forrest's evolution over the movie and following his life was so good, no doubts that this is my new favorite film."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "AntiSocial_Wheelchair",
        "review_rating": "10",
        "review_title": "Best movie ive ever seen in my entire life",
        "review_detailed_main": "Forrest Gump is an impressively impressive movie indeed. It made me cry a few times. I love Gump's personality. Although he's a little bit dumb(no offence), he still made me laugh from his jokes. The theme song is also a huge success."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "gobravo-59804",
        "review_rating": "10",
        "review_title": "Classic, for sure!",
        "review_detailed_main": "I think this is the first movie I ever saw, where a very smart actor, skillfully portrayed a very simple yet profoundly good man, and left you saying... 'Wow! THAT was super well done!'"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "kuzeyseveroglu",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Must watch film. Rare 10/10 movie. Tom hanks played this character amazing. It can be a 1994 movie but it doesn't matter, you can watch it any time. It is kinda safe with children. Absolute 10/10."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "rickbakewell7285",
        "review_rating": "10",
        "review_title": "The eyes through the world of Forrest Gump",
        "review_detailed_main": "If only the world saw the world the way Forrest Gump saw it. An idiot to some, but a genius and hero to millions. Forrest Gump has the charm, the humor, the drama, and the tie ins to the most historical moments in history that make this film a true masterpiece."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Anmol_deep9043",
        "review_rating": "10",
        "review_title": "such a rollercoster ride",
        "review_detailed_main": "All i remeber is the adeventure gump went throught but the last scene , that hits different. Ignore the speelings , i just can bother enough to double check them."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "javieryalless",
        "review_rating": "10",
        "review_title": "The Best Movie Of All Times",
        "review_detailed_main": "Forrest Gump is a love-able film about an idiot savant and how he made an impact on history without even trying to. This is such a wonderful film that will make you laugh and cry from scene to scene"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "A great fantasy story with a lifetime of messages for all of us.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "naun",
        "review_rating": "7",
        "review_title": "Surprisingly enjoyable",
        "review_detailed_main": "There's something of a tradition in fiction of using the idiot savant to hold the mirror up to society and reflect its foibles. The figure of the Good Soldier Schweik was one I remember being introduced to in my early years at university. Forrest Gump is also a soldier for much of this picture's duration, but the satire is diluted to no more than a few bum and fart jokes in the presence of the great and the good.\n\nMaybe it's this evasiveness that caused this film to attract such a storm of criticism from the Left when it first appeared. Seven years on, it's hard to see the film's reluctance to take on biting social satire as something it deserved to be damned for. More likely, it's the film's unflattering portrayal of the counter culture of the sixties that made its baby boomer critics touchy. For the most part, it's a gentle and appealingly whimsical picture. Australian - and more particularly, Melbourne - viewers will recognize in it something of the spirit of Michael Leunig's cartoons. In keeping with this spirit is the one aspect of this film that could be regarded as controversial, which is its scepticism toward causes.\n\nTom Hanks is excellent. It says something about the rest of the world's stereotypes about American culture that one of America's biggest movie stars can hold the screen for hour after hour while remaining the most self-effacing of actors. There is charm and real emotion in his performance. If the film sometimes veers into sentimentality (and it does) it is not Hanks' fault.\n\nThe film isn't a masterpiece. As I say, it does sometimes lapse into sentimentality, and it annoys me that, like Rain Man, it can't acknowledge disability without conferring on its disabled characters superhuman talents of one kind or another. And, as I'm sure others have pointed out, the trick shots involving Gump's encounters with various historical personages had already been done - to much sharper comic effect - by Woody Allen in Zelig. However, for me the film's greatest specific failing is that it doesn't do more with the character of Gump's love, Jenny, who doesn't do much more in this film than turn up every half hour or so and look beautiful. I thought there was scope there to explore the nature of their mutual dependence more deeply, and to illuminate both characters in the process. To some extent this does happen with the character of Lieutenant Dan, a nicely drawn character who provides the right sort of counterweight to Gump.\n\nI don't expect that I will want to see this film again and again, the way I keep going back to Leunig's cartoons, which have a kind of natural wisdom-in-innocence that Zemeckis' film sometimes visibly strains to achieve. It's not a film that particularly goes anywhere, not that it really means to. But, a little to my surprise, I did enjoy watching it."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "philipbn",
        "review_rating": "1",
        "review_title": "\"Being an idiot is no box of chocolates\" (the original line from the novel)",
        "review_detailed_main": "A movie with this many comments obviously has great resonance. On the one hand, the movie is technically skillful, well-acted, and used then-advanced special effects to great advantage. As demonstrated by the comments here, it has charmed many viewers. On the other, the movie's values and message are clearly right wing: as many other reviewers point out, the plot rewards ignorance, unquestioning obedience, and laissez-faire corporatization (the marks of a good heart, apparently!), while it trivializes retardation to charm viewers with a saccharine vision of idiocy as goodness. It provides a right-wing allegory of recent US history by punishing the free-thinking Jenny and rewarding the mindless Forrest, named after Nathan Bedford Forrest, a founder of the Ku Klux Klan. Charming!\n\nI share the view of those who not entertained by the movie's right-wing allegory of Reagan-Bush era know-nothingism and historical blindness. As another commenter put it, \"this is a movie for people who voted for Reagan\" or for the Bushes. Overall, it's a remarkable document of Reagan-Bush era dominant thinking.\n\nSo the basic situation with this movie is not too difficult to grasp: the movie is skillfully made and acted, and the wide success of its right-wing plot and message demonstrates that the American movie-going public largely shares these right-wing views."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "oleksandrafedosova",
        "review_rating": "10",
        "review_title": "Timeless classic",
        "review_detailed_main": "An amazing film about all that surrounds us: about feelings, about people, about family and very special views on it. We often don't notice much.\n\nThis seems to us to be a vision of Forrest Gump - an incredible character, a kind of 'big kid' who perceives everything more obvious in a completely different way.\n\nThroughout the film, we observe the life of Forrest. We will see his childhood, good and bad moments from there. University, football team, Vietnam War, successful business - it's all about Forrest's life.\n\nHe lives in his own little, personal world.\n\nHe is really kind.\n\nHe is ready for extraordinary deeds, regardless of the framework that people come up with for themselves.\n\nThats the kind of people that society lacks: those who are always able to help, even if this help seems completely ridiculous, but you know in your heart that it is needed.\n\nThe actors are playing great. You no longer think that they are playing, it seems that you are just looking at someone's life, at the life of a person that might live somewhere nearby and sees everything in their own way.\n\nIt's a sentimental and thought-provoking movie that's hard to write about, just watch.\n\nSo just watch, empathize and feel."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sina_bahoosh",
        "review_rating": "10",
        "review_title": "Forrest Gump",
        "review_detailed_main": "Tom Hanks played very well in this movie.\n\nForrest Gump was the best movie of my life."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Smmba3",
        "review_rating": "10",
        "review_title": "my love",
        "review_detailed_main": "The greatest movie ever best sountrack best drama Tom Hanks"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Jack_Ratliff",
        "review_rating": "9",
        "review_title": "Forrest Gump is not for everyone, but it is for anyone who wants to sit back, relax, and enjoy the absolute mayhem that its central protagonist gets involved in with style.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "crnogorac-sasha",
        "review_rating": "10",
        "review_title": "Really deserved higher place",
        "review_detailed_main": "I really think that Forest is greatest movie or all time. Deserves better place on list! I watched this movie few times, and I read the book, tonight I watch it again with my 17 y.o. Daughter, and we really enjoy it!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "martinssonem",
        "review_rating": "10",
        "review_title": "The best film that's ever been made",
        "review_detailed_main": "I don't know how many times I've watched this film. It's probably 50 or 100. Once a year I rewatch it and become as emotional and as astonished as the very first time I saw it. There hasn't been a film since Forrest Gump and maybe there never will be. I will never forget how it felt to be touched by this story and the characters that hold it so perfectly together. This is unquestionably Tom Hank's greatest performance ever and the only film I am totally unable to criticise. Truly the definition of a masterpiece....."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "belalqayum",
        "review_rating": "8",
        "review_title": "Great movie, slightly overrated",
        "review_detailed_main": "Great pace. Interesting characters. Forrest lives a inspirational life in a way through his simplistic way of living.\n\nThe movie goes through a lot of events through the years it takes place. Definitely very cheesy and a feel good movie. Will take you through a string of emotions as you watch, which is good.\n\nAlthough the movie is long, the pacing was good so you don't feel bored at all. Don't need me to say it but definitely would recommend."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "la-24195",
        "review_rating": "10",
        "review_title": "This is not just a movie, this is an emotion",
        "review_detailed_main": "It's an exciting journey that you will never forget It will make you cry, it will make you laugh.\n\nThis movie will teach you so many life lessons like. Intelligence Isn't Everything Don't Be Afraid To Try New Things.\n\nDon't Take Yourself Too Seriously.\n\nPain Can Be Channeled Into Something Productive.\n\nMoney Doesn't Make You Happy.\n\nDo What You Love. And Of Course, Life Is Like A Box Of Chocolates.\n\nThat's all. One last thing You Should Never Trust Social Media like ever let me tell you why. On Rotten Tomatoes. Cuties get 90% while Forrest Gump got only 71% seriously.\n\nAre they crazy or they lost their mind? Seriously."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "orekhovo",
        "review_rating": "",
        "review_title": "Few thoughts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "filmbuff69007",
        "review_rating": "6",
        "review_title": "A Turkey of Epic Status",
        "review_detailed_main": "I read the book before going to see the movie.the book was strange but it was ok.this however is a overrated movie with a highly predictable performance by Tom Hanks.this movie was both pointless and how it managed to defeat pulp fiction at the oscars well only the academy know that one.i hated this movie with a vengeance i saw this the same day as the fantastic The Lion King.After the highs of Disney came the Lows of Hanks.a truly pathetic movie."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "imdb-6345",
        "review_rating": "1",
        "review_title": "The reason IMDb needs to introduce the zero rating",
        "review_detailed_main": "Not being Tom Hanks' greatest fan, I avoided watching this film for several months after its release. This also gave me time for the hype to die down a little - but on the back of all the press and several positive comments I was still expecting to sit down to enjoy a good movie.\n\nI was mistaken. My reward? Two hours of praying for the credits to roll to take away the pain.\n\nTo me this movie takes pleasure in displaying everything that is wrong with the Hollywood film industry - America's need to rewrite history to suit its own needs, its desire to peddle the \"American dream\" myth and the rewards given blindly to any movie that does the above (in the form of several Oscars - could anyone please explain to me the exceptional qualities of the movie that put it above anything else released that year?\n\nIf only Forrest had kept running... into the sea"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "nadiaj-97495",
        "review_rating": "10",
        "review_title": "Forrest",
        "review_detailed_main": "Oh I loved this movie . It includes every emotions and the movie makes you feel great and happy.when you're sad you should watch this"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "lyndonmata",
        "review_rating": "9",
        "review_title": "An Emotional Journey Through Decades of American History",
        "review_detailed_main": "Robert Zemeckis's \"Forrest Gump\" is a heartfelt and epic tale that combines humor, drama, and historical events to create a uniquely compelling narrative. Tom Hanks delivers an unforgettable performance as Forrest Gump, a man of limited intelligence but boundless heart and spirit, whose life journey intersects with pivotal moments in 20th-century American history.\n\nHanks's portrayal of Forrest is both charming and poignant, capturing the character's innocence and unwavering optimism. His performance earned him an Academy Award for Best Actor, solidifying his status as one of Hollywood's finest talents. The supporting cast, including Robin Wright as Jenny, Forrest's troubled childhood friend and love interest, and Gary Sinise as Lieutenant Dan, Forrest's embittered but ultimately redeemed commanding officer, provide strong, memorable performances that add depth to the story.\n\nZemeckis's direction is skillful, blending emotional storytelling with innovative special effects that seamlessly insert Forrest into historical footage. The screenplay, adapted by Eric Roth from Winston Groom's novel, is rich with memorable lines and moments that balance humor and tragedy. The film's pacing ensures that each chapter of Forrest's life is engaging and impactful.\n\nAlan Silvestri's score, along with an iconic soundtrack featuring hits from the 1950s to the 1980s, enhances the film's nostalgic and emotional appeal. Cinematographer Don Burgess captures the diverse settings and eras beautifully, adding to the film's immersive quality.\n\n\"Forrest Gump\" is more than a chronicle of one man's extraordinary life; it is a reflection on destiny, love, and the resilience of the human spirit. Its blend of heartfelt storytelling, historical context, and standout performances has earned it a cherished place in cinematic history. The film's critical and commercial success, highlighted by multiple Academy Awards including Best Picture, Best Director, and Best Actor, underscores its enduring impact and universal appeal."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "rossmichael-75248",
        "review_rating": "10",
        "review_title": "Absolute Joy To Watch! What A Journey! One Of The Best Movies Ever Made!",
        "review_detailed_main": "I have seen the film so many times as it never seems to bore me. Tom Hanks pulls off an absolute masterclass of a performance and has you rooting for Forrest Gump through the entire movie! You don't get movies like this anymore... so unique and full of laughter. You are missing out if you haven't watched it!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "engmkhatan",
        "review_rating": "10",
        "review_title": "Best Movie in the world",
        "review_detailed_main": "In my opinion I think that movie is the best movie in the world I Saw this movie more than 20 time and in each time I got the same feeling.the story was so beautiful and the picture has a very Good quality when you see the quantity of the picture you can't believe that this movie was produced at 1994. I make the music of the movie as my ringtone it was perfect. Tom Hanks I love this actor because of this movie I saw all the movies of Tom Hanks he is genius. Every time I travel to USA I go to the restaurant Bubba Gumb. All the characters in the movie do their best and all the cast do their best to produce the best movie in the world."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "luckywilleatyou",
        "review_rating": "10",
        "review_title": "classic film",
        "review_detailed_main": "love this film cry every single time. such an awesome film and deserves everything it got, its a must see for everyone from children to 65+. the story-line and actors are all just amazing and make the movie worth seeing over again and again. also it stands as a very good family film and funny as well as dramatic. the standards were set very high for me when i first watched it and i was definitely not disappointed or let down! if you are reading this review to maybe watch this film just go and do it you will not think it was a waste at all and i'm pretty sure you will cry at least once through the full 2hours. Perfect classic movie."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "anardio-47232",
        "review_rating": "10",
        "review_title": "Better now that I'm older.",
        "review_detailed_main": "I was born in 1983. This movie came out in 1994. I really liked it back then. Had to fast forward some parts in the early movie(like the girls dorm). Nothing taken away to the story. I loved it back then. I've always been a Tom Hanks fan. I always will.\n\nI watched this movie for the first time in over a decade. I love it even more.\n\nI'm 38 now. It touches me even more. About friends(mostly). I've had a few friends that have lasted 20-30 years. The ones that are always there. Even if they're not always there, they are with you. I still talk to these friends regularly even though I have moved away and so have another of them.\n\nThis movie hit me in that department in my recent age.\n\nThis movie makes you laugh, there is action, and drama. Tom Hanks emotions in the end of the movie may bring tears to your eyes. This is why it was one of the greats. It moves at a good pace. Moves along Forrest Gumps life. Mostly people who grew up in the 50's would notice the cultural references. But as a person born in the 80's with a family that liked 60's music and culture, it worked well for me. This movie will still remind you, even if you were not born back then, that you will never forget your old friends. The ones that will always be with you. Those select few that are still there from childhood to adulthood. That is what I took out of this. That is why this movie hits hard. Forrest does have new(er) friends and that is still nice. At least he has somebody."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "omar_ahmed88",
        "review_rating": "9",
        "review_title": "Best 1994 movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "universalstduio",
        "review_rating": "10",
        "review_title": "Best feel good movie I've ever watched",
        "review_detailed_main": "I know there are so many other good movies and their will be so many good movies. But one thing I can say is that this movie will be always in the top list of feel good genre. This is what we can call an evergreen one"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "mysmith12",
        "review_rating": "",
        "review_title": "Shawshank Robbed, but this is Great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Aaron1375",
        "review_rating": "6",
        "review_title": "The movie works overall, but like a box of chocolates there are way to many bad pieces here and there.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Jakealope",
        "review_rating": "2",
        "review_title": "Surest Way to Win an Oscar",
        "review_detailed_main": "Make a movie about a retard, or play one. Look at Hoffman in \"Rainman\" or Miles in \"Ryan's Daughter\", they won Oscars for playing retards too. You can't go wrong with a stupid person as the focus, sort of like the chimp lead. Better yet, endow him with all sorts of savant-like talents like superhuman strength and sports agility. What silly, contrived hokum. This is a sentimental piece of schlock that is always simple and forced. \"Life is like a box of chocolates\", yeah, right! The only one who deserved the Oscar lost, Gary Sinise. Finally, use cgi to work the retard into all the key TV/pop culture moments, guaranteed to melt a boomer's heart. Have him influence the whole world with his simple homespun Gomer Pyle platitudes. If the director had another 10 minutes to fill, Gump would have redesigned the Apollo space ship program and got the astronauts to the Moon. Enough sugar here to rot our whole country's teeth. It proves that pop culture really sucks. \"Pulp Fiction\" was it's dark Oscar nominated rival in 1994. It was a better movie with a sicker message so it lost to this treacle,"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "calebwade",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "Amazing movie, I loved it! It was about a boy growing up and becoming a man. He also found the love of his life through his upcoming and it is a heartwarming family fun movie that I suggest everyone go see!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "polissepeti",
        "review_rating": "10",
        "review_title": "Forrest, if God wanted everyone to be the same, he'd put iron bars on all of our legs",
        "review_detailed_main": "Forrest Gump tells the story of a man who is less intelligent than other people, but is talented in his own right and needs to be reintegrated into society. With an IQ of 75, Gump will go beyond his own limits, be successful in many jobs, climb the ladder of success one by one, and accomplish works that will make his family and relatives proud. A movie that everyone should watch and watch, contains very good messages. I especially liked this quote from Gump's mother: \"Don't let anyone look at you strangely, Forrest, if God wanted everyone to be the same, he would put iron bars on all of our legs. I laughed from time to time in the movie and got emotional from time to time."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "tinkyminky26",
        "review_rating": "10",
        "review_title": "MASTERPIECE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "marcelloidris",
        "review_rating": "10",
        "review_title": "Still a great classic 90s movie.",
        "review_detailed_main": "Watched many times and although nearly 25 years later it might be look a bit dusty now and the 90s CGI not as advanced as it is now, but is one of the greatest movies and one of the finest performances of Tom Hanks. Loved the narration and the interactions with various famous people , although again some of the CGI is dated. Favorite period in the movie for me was the Vietnam section. Its a long haul movie at 2 hours 20 minutes. I never really got the message that although he had the low IQ he achieved so much in his life. Quite the contradiction. He even comes across as autistic."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "bluenuriya",
        "review_rating": "10",
        "review_title": "What a wonderful movie-",
        "review_detailed_main": "I watched Forrest Gump. This movie holds a special place in my heart now. It's so moving, so beautiful and lovely. I can see why it's a classic, why it's an icon, and why it's so highly rated. The characters really do stand out to you. They're all so unique and different and complicated. They're so realistic, too. Forrest Gump, though. Obviously stood out from the rest. The way they wrote him is just pure magic. I never seen a character written like him. He's so original, so innocent and pure and lovable. The acting was just amazing. The performances really do bring tears to your eyes. I couldn't imagine anyone else to play these characters. The cinematography is excellent and the plot twists and turns are so shocking and timed so perfectly. The storytelling is really moving and powerful, and so is the message and moral of the story. We need to love life no matter what, and to think of life as a box of chocolates: you never know what you're gonna get, and that's okay. I cried a lot at this movie, just as much as I laughed. You'll fall in love with Forrest Gump, I guarantee it. I recommend."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "tbear-59163",
        "review_rating": "10",
        "review_title": "Love it",
        "review_detailed_main": "Clean fun movie to watch. Like Tom Bank I cannot see anyone else playing his part.. I have watch this movie about 50 times."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "www-jamiewelch",
        "review_rating": "10",
        "review_title": "Brilliant 😊😊😊😊😊😊😊😊😊",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "misteraj",
        "review_rating": "10",
        "review_title": "The history of the USA is shapped by forrest gump...",
        "review_detailed_main": "*~-S P O I L E R-~*\n\nA briliant brilliant movie, about a kid, in which his IQ is 75, making him different. and from the beginning of the movie, even before the story begins, you see thet forrest is the great great grandchild of admiral forrest, the man who created the KKK's. And from giving Elvis Presly the unique \"leg-shakin'\" move, in his video \"I ain't nothing but a hound dog\". and from there on, he is appearing with great presidents (I don't know how they did this! these are the real presidents!), and making diffrance, even if it's the biggest thing, like saving souls in the viatnam war, and setting the record of running two years in a row, or by inventing the \"SMILEY\" ;) :) :( or inventing the sticker \"S*** happens\", the world will never be the same once youve seen it through the eyes, of forrest gump... And the famous saying, that life is like a box of chocolate, is true. you can really never guess what comes later, and later. every thing they say matters. so, if you'r gonna watch it, watch twice, or three times. if you can, in a row. it will explain lots'a things."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sychonic",
        "review_rating": "",
        "review_title": "Simple, basic, and true",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "awvknj",
        "review_rating": "6",
        "review_title": "Does not hold up in 2023",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "SpaniardInTheWorks",
        "review_rating": "5",
        "review_title": "The most ridiculous movie I have ever seen in my life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "miguelneto-74936",
        "review_rating": "10",
        "review_title": "Touching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "miaoyabo",
        "review_rating": "10",
        "review_title": "What a movie!",
        "review_detailed_main": "I lived in China and in 1995 when I was still a high school student, I watched this movie for its reputation \u0096 won several Oscar. Honestly I felt bored when I was watching the movie that time because I could hardly understand the meaning of the movie and could hardly feel its beauty. At that time, only \"The Terminator\" kind of movies was able to attract me. After I watched it for the second time now after 11 years, I felt quite moved by almost all the elements this movie carries, the story, quotes, special effect, Tom Hank's perfect portray of Forrest Gump and most importantly, Forrest's deepest innate world. It's not easy to conclude what kind of person Gump is and what are the meanings and inspiration this fictitious character conveys to all the viewers. But I do have the strongest inspiration from this movie, that is, people can really get somewhere to achieve something not only because they have a lot of good qualities, more importantly, from what we see on Forrest Gump, because of not having a lot of bad qualities, or innate weakness of human beings, or various interferences around everybody. You can see all those bad qualities, weaknesses and interferences from the lives of Lt. Dan and Jenny who are normal or seemingly smart persons. On the contrary, Forrest is a person with low IQ and was thought of by many people as moron. Yes, Forrest is not smart and he knows it quite well. But for me, exactly because of his being not so smart, he doesn't have those bad things that other normal persons have that prevent them from achieving what Forrest was able to achieve. Those people have too many thoughts sometimes, or too much expectation, or too much depression in face of setbacks and all those things are actually interferences to the normal people that prevent them from staying focused for a long time. Now I should be looking at myself and asking myself, what kind of interferences I should remove from myself to really get somewhere. Thanks, Forrest Gump, thanks, this fabulous movie that sheds so much light on me."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "PacoZocko",
        "review_rating": "10",
        "review_title": "When do you start living the life, Just to Just Enjoy it?.",
        "review_detailed_main": "Forrest Gump (1994)is a Movie I have alwas related to.Growing up as a young child surviving on my own. I Viewed but never let the treachery around me slow me down from the task at hand.\n\nThe Same is true with The (1994)Forrest Gump. Every Event He knew what was and he Lived his life Straight.\n\nIt is Wonderful seeing a Personality that continues to take on each plot and adventure that arises up infront of them. Life IS all 1 long improved.\n\nWhen doors opens, you throw stones to see what the opportunities are. If it feels right , Enjoy and do it to the best of your ability. But to take yourself beyond that would be reasonably expected of you Life is like a Box of Chocolate.."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "gurpreetdusanjh",
        "review_rating": "10",
        "review_title": "Tom Hanks is best and this movie is a life lesson!",
        "review_detailed_main": "Forrest Gump is a masterpiece. This movie teaches you a very important lessons of life. Life is a box of chocolates, you never know what you gonna get. Tom Hanks delivers a one of greatest performance of all the time. He is one of the best actors Hollywood ever had. This review is spoiler free because i don't wanna ruin someone's movie by writing about it. Everything in movie is so perfect. Story, Acting, Music etc... Everything is great. THIS MOVIE IS AWEOME. 10 out of 10 without doubt. You cant hate movies like this. I don't know how people can hate this. You can do anything if you set your heart and mind on it. Thats what i learned from this movie. Not only this and much more. Watch it and you'll find out. 10 out of 10"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "longgangtian1989",
        "review_rating": "10",
        "review_title": "When you feel bad with your life, watch it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "dolphin-89901",
        "review_rating": "10",
        "review_title": "heart-warming family type movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Galina_movie_fan",
        "review_rating": "10",
        "review_title": "...And that's all I have to say about Forrest Gump",
        "review_detailed_main": "I think of Forrest Gump (1994) directed by Robert Zemeckis as a fantasy or a fairy tale set in the real world, and what a marvelous tale it is. It's been 15 years since I saw the film for the first time with my 13- years-old son. We were impressed, touched, and moved by it equally. We laughed, we could not contain tears, and we lived together with the hero, the childlike, naive, and innocent Forrest Gump, the most unusual lead character you can think of. FG was a big hit when it was released, and it went on to receive 6 Oscars including for The Best Picture, Director, Best Actor, Best Visual Effects, and Best Screen Play. The film's Oscar status has made it one of the controversial choices among the film viewers. Some completely agree that FG deserved all its awards and its love. The others, and quite few to that believe that the film is totally overrated, sickly sweet, and it is nothing more than the American propaganda of mediocrity. They believe that the film's main idea is, follow the orders, do what you are told, and even if your intellect is low or almost non-existent, with a little bit of luck, you would achieve the success in your life and even would change the history by simply being at the right place in the right time. How wrong I believe they are. You can't think of Forrest Gump as a real person. He is a fairy tale character, or rather the embodiment of a human with no cynicism whatsoever, the candid, pure, innocent man who is not quick or witty but who knows bad from good and right from wrong and through whose eyes we see the historical events in the live of this country for about thirty years of the last Century. Forrest may not be an intellectual prodigy but he was led through life's hardships, by the inner moral compass if you will and he knows the very simple truths that he never misses - love and loyalty to his mother, his friends, the girl he loves and his Country.\n\nThe movie covers the look at America not only from Forrest's point of view. Another look at alternative, rebellious, counterculture America was very well presented through Jenny's life. Between them two, I believe the film's creators were able to show the changing times and changing face of this country. Technically and visually, the film is a marvel. The best songs of the time that were used in the film soundtrack are great and I don't mind them sound almost all the time -the more the better. Tom Hanks had achieved the very difficult task. His Forrest is simple but not laughable. He is a decent and very good man. It is not easy to create such idealistic character and to make him alive and sympathetic. There is not a single false note in Hanks' performance, and he absolutely deserves the Oscar.\n\nWhen I rewatched the film recently, it touched me as deeply now as it did 15 years ago, and this is for me the sign of not just good but a great movie. And that's all I have to say about Forrest Gump."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "gamerman1902",
        "review_rating": "10",
        "review_title": "Classic movie is a Must See",
        "review_detailed_main": "Forrest Gump is a great tale of a unintelligent man. Tom Hanks does an great job in acting. He is truly awe inspiring. It is a story of sacrifice, love, friendship and honor. Gary Sinise and Robin Wright do great in their own supporting roles. The ending will bring a tear to the most serious moviegoer. Cinematography, writing and sound are all top notch. Director Robert Zemeckis does a great job with this film and it shows. This film deserves great praise and love. It teaches life lessons and is very moving to all. Anyone can find this movie wonderful and moving. It is a magical film and deserves all the respect it has been given. Anyone who is a film buff has to see this movie."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "grabes",
        "review_rating": "",
        "review_title": "WHERE'S JIMMY?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "MadReviewer",
        "review_rating": "6",
        "review_title": "Great Film, Horrible Message",
        "review_detailed_main": "I have a difficult time watching (and reviewing) `Forrest Gump'. Despite the brilliance of its actors, of director Robert Zemeckis, and of certain powerful scenes, I find that the overall film itself is a cynical lie. On the surface, `Gump' is a cheerful film about the perseverance of its genuinely sweet title character. Under that sweetness, though is a disturbing, uncomfortable message that says daring to dream is a bad idea.\n\nFor the seven people who haven't seen `Forrest Gump', the film deals with the travels and troubles of one Forrest Gump (Tom Hanks), an affable man with an IQ of 75 who manages to bounce around key historical events from 1950 onward in `Zelig'-like fashion. Forrest inadvertently teaches Elvis to swivel his hips. Forest accidentally becomes a football star. Forest accidentally becomes a Vietnam war hero, then accidentally becomes a successful businessman. (See a pattern?) Throughout all his travels and misadventures, Forrest is forced to deal with adversity and hardship \u0096 and he can never seem to fully capture the love of his childhood sweetheart Jenny (Robin Wright-Penn) \u0096 but through sheer niceness and through blind faith in the goodness of others, Forrest invariably manages to push on through his difficulties and to triumph in life.\n\nAgain, on the surface, a sweet, glowing, feel-good film. Despite my own misgivings about the film, there's no doubt that Tom Hanks is simply awesome as Gump \u0096 he clearly deserved the Oscar he won for the role. He gives Forrest Gump a childlike innocence, but there's more to it that that; there's a certain confidence that he exudes at all the right times, as well as insecurities at his low moments. Forrest Gump is certainly far more complex than the simple figure he appears to be at first glance, and I can't think of any actor who could've played it better than Hanks. Robin Wright-Penn is perfect as Jenny, who makes an astonishing journey through the years between wide-eyed to hardened cynicism to the acceptance and understanding of experience. I'm surprised she wasn't nominated for an Oscar as well. Gary Sinise makes a perfect counterpoint to Gump in the Vietnam era as Lieutenant Dan, another person who can't seem to travel through life quite as smoothly as Forrest does. Combine this with a superbly paced film, with moments both funny and sorrowful (often at the same time), as well as some of the best, subtle uses of CGI effects ever put to celluloid, and `Forrest Gump' should be one of the best films of all time. Right?\n\nIn my opinion, no. `Gump' is a bitter, bitter movie. Look at Jenny's dreams and aspirations, how hard she works to attain them, and how little she actually accomplishes. Ditto the dreams of Lieutenant Dan, or Gump's friend Bubba (Mykelti Williamson). For them, their hopes never ultimately amount to anything, not without the `accidental' help of Forrest Gump, anyway. Forrest, who has no ambitions, and never shows any true interest in doing anything, becomes wildly successful by doing nothing. In essence, those who dare to dream in `Forrest Gump' are punished for their ambition, while those who do nothing are handsomely rewarded. Considering that some of Jenny's dreams (and Lieutenant Dan's) are particularly selfish \u0096 in fact, a few are downright noble \u0096 I found this little understated message to be incredibly disturbing. It bothered me enough to make me not like this film at all, despite all the wonderful moments it does contain.\n\n`Forrest Gump' gets an overall grade of a C+ -- it starts out as an `A', but its dark underlying cynicism drags it back down to that level. But hey, I could be wrong. It's simply the Mad Reviewer's opinion. Good or bad, there's some great performances, and it's also thought-provoking. Watch it for yourself, and let me know what you think."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "richard-mason",
        "review_rating": "5",
        "review_title": "Technically Brilliant, Otherwise Barren",
        "review_detailed_main": "Yes, I watched in awe as Tom Hanks was digitally inserted into all the major events of the second half of the twentieth century, but my already opened jaw then went slack at the banality of the screenplay.\n\nSorry, but \"Life is like a box of chocolates\" is not a philosophy for a grownup. Or even a retard.\n\nI loved the opening shot, and was really wanting to like this film, but Sally Field is embarrassing, ditto Tom Hanks. Gary Sinise is good, but Robin Wright's character makes no sense.\n\nThere IS no moral or philosophical coherence to this film ... it just allows woolly thinkers around the world to project their own feel good mantras onto it.\n\nI give it a 5 for technical achievement\n\n(I stand by for the usual tirade of illiterate and obscene abuse I get when I dare to criticise a sacred cow.)"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "hitchcockthelegend",
        "review_rating": "9",
        "review_title": "Best Picture Oscar winners are like a box of chocolates.....",
        "review_detailed_main": "Forrest Gump, from a humble afflicted childhood, and with a low IQ, goes on to play a major part in the history of the second part of the 20th century.\n\nForrest Gump is one of those movies that comes along every once in a while to light a fuse under the movie worlds bottom! The sort of film that has evident flaws yet packs in so much charm, wit, intelligence and sentiment to make it really difficult to dislike with any sort of conviction. Even those with an aversion to the talent of Tom Hanks would surely be kidding themselves if they honestly fail to see that Hanks, as Gump, gives anything less than an extraordinary performance.\n\nWhat made Forrest Gump such a well loved picture? Garnering 5 golden baldies at the Academy Awards {three of them the main ones} and earning a staggering $677,387,716 worldwide after being made for the now relatively paltry sum of $55 million? Personally I think it has a little of everything that a film watcher wants in a picture, it sure does have things many dislike {the romantic arc, the overdose of sugary sentiment}, but as Forrest lurches from each apparently none-plussed situation to another, the air of the underdog coming thru triumphant sticks in the craw, but, in a most appetising way. We are in the company of a perfectly honest, simple and innocent man, he may not know it, but Forrest Gump has become a champion of the people, both in the film and to us the movie loving public.\n\nIf by some miracle you still haven't seen Forrest Gump, then I urge you to do so, it may not resonate with you as much as it did/does the majority {argue with the box office I say}, but for towering performances by Tom Hanks and Gary Sinise, and for being a clever movie with its finger on the pulse of Hollywood, Forrest Gump has few peers. 9/10"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ElMaruecan82",
        "review_rating": "10",
        "review_title": "Simply one of the Greatest American Films ...",
        "review_detailed_main": "\"Forrest Gump\" is one of the rare cases of cinema's magic working more than in any other artistic medium. Everything is a visual delight and a triumph in the field of storytelling, from the cinematography to the editing, from Zemeckis' sober direction to an extraordinary lesson of acting from Tom Hanks, the movie IS the Best Picture of 1994, which is saying a lot, and one of the best American films.\n\nEvery film tells a story, but a few of them have this capability to penetrate your hearts and engage your emotions like \"Forrest Gump\". There are no villains in \"Forrest Gump\", no room for negativity, the only adversity consists on the many obstacles that life puts on your path, and the only form of heroism relies on the ability to overcome these obstacles, and whether you succeed or fail, the point is to keep your faith on life, and find your own Alchemy to transform coal in gold. And Forrest Gump is the first to have overcome the handicaps that would have deprived him from a 'normal' life.\n\nThe flash-back introducing sight of little Forrest with his legs' braces, hand in hand with Mama Gump (remarkably played by Sally Field) would be too tragic if the script didn't rightfully choose to adopt a more lighthearted tone by making Forrest Gump the privileged witness of his time, of a cinematic journey in American History, with every piece of this epic puzzle connected in a way or another to him. I will never forget my first impression from the Elvis Presley part, the first indication of what would be the life of Gump. Something too promising to be eternally stuck in these handicapping braces, and the laughs work as the patient build up to a rewarding climactic moment, the miracle scene or an overwhelming celebration of the triumph of human spirit.\n\nAnd from this miracle, Forrest Gump becomes the fastest man in the world, and starts one of the most exhilarating chain of events that ever enriched a character. This is the power of Forrest Gump, a character defined by the way he is, the way he talks, the way he loves, defined by the events he lived, by those he underwent, and those he influenced, by the people that helped and loved him and people he helped and loved. Not one-dimensional or dim-witted, Gump is one of the most memorable and fascinating characters that even graced the silver screen. Who can ever forget \"My name is Forrest. Forrest Gump\"? Through his silent moments, gestures, speech mannerisms and Tom Hanks' unique talent to transcend his everyday look, Gump conveys the profundity of a character affected and affecting a world in constant change, mirroring Mama Gump's unforgettable 'chocolate box' catchphrase.\n\nAnd what an epic life for an epic era, Gump's talent launches his football athlete career, which gives him a ticket to college, from college to the Army, where he'll become a Ping Pong player before converting to shrimp fishing. Every achievement of Forrest Gump is due to someone he loves, starting with his Mama who traded her dignity to provide her son the best education, Jenny, his best friend whose unforgettable \"Run, Forrest Run\" will drain the miraculous force that would change his life. And his friend Bubba who'll indirectly provide the basis of Gump's fortune thanks to a simple promise. And whatever Forrest took, he gave it back, to his mother, to Jenny, to his best friend's memory, and to Lieutenant Dan, who thought he had to die in the field of honor, and learned the value of life from Forrest's unshakable friendship.\n\nThat's why I don't get the criticism toward the film, as if Forrest Gump was a kind of liberal incarnation of the passive state of mind that guarantees happiness. Why do people feel the need to appear so smart, to consider a movie where someone got shot in the face accidentally, superior, and it's a fan of \"Pulp Fiction\" speaking here. Maybe, I've missed a point, but \"Forrest Gump\" is perfectly aware of its comedic mood that almost flirts with parody sometimes. Eric Roth's Oscar-winning script is a kaleidoscope of all the incarnations of America in people's imagery through a glorious succession of anecdotes involving entertainment, music, politics, Presidents, scandals, Vietnam War, following one of the greatest cinematic soundtracks : the Doors, Dylan, Hendrix \u0085 \"Forrest Gump\" is a wonderful voyage to Pop-Culture America! And the intelligence of the script is subtly hinted in some little details like when Forrest evokes his perfect integration in the Army. This is pure comedy gold without any forced laughs.\n\nAnd as there's no better comedy than a comedy with a heart, on that level, \"Forrest Gump\" is so lighthearted it's almost blinding. I guess this comes from Forrest's heart, so pure, so white, like the cinematic allegory of Voltaire's Candid. How fitting that his last job is gardener, which mirrors Candid's motto that whatever happens, \"we need to cultivate our garden\". Gump does cultivate his garden as a sort of dream-like presence in a very familiar universe, a dream we'd loved to reach and touch, something that floats in our minds like this beautiful feather floating on the sky. Men like Forrest Gump are oddities only made believable through the magic of cinema with no other meaning than to inspire something pure in us.\n\nThis is why any attempt to rationally analyze \"Forrest Gump\" and discredit its success is representative of that loss of common innocence, this cynicism people disguise in lucidity and realism, unknowing that they fall in the same trap than those who ran with Gump thinking it had a meaning while Forrest Gump only \"felt like running\". Gump didn't necessarily choose his path, but he always followed his heart, his idea of love and friendship. \"I'm not a smart man. But I know what love is\". On that level, Forrest Gump was simply a goddamn genius!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "harshasudani",
        "review_rating": "10",
        "review_title": "This stupid is fabulous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "angelayu-57653",
        "review_rating": "10",
        "review_title": "The first American film I've ever watched",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "an_ga",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "leonardo-beltrame",
        "review_rating": "10",
        "review_title": "A must watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "JamesKnudson",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "I am sure there aren't many people who have never seen this movie.If you haven't,make sure it is the next movie you see.\n\nYou can't help but to fall in love with the title character.Tom Hanks has never let me down.This is a character that you can laugh at,cry with and feel all of his true emotions.\n\nThis is a man who has literally done everything in his life,yet he is a very simple man.\n\nOne of the 50 best movies I have ever seen,and I have seen a lot of movies.Maybe in the top 25.\n\nThis is also one of the best family films I have ever seen."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Jamil_Farraj",
        "review_rating": "10",
        "review_title": "Forrest Gump review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "kaynelson-16183",
        "review_rating": "",
        "review_title": "the movie forrest gump",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "CinematicGarbage",
        "review_rating": "6",
        "review_title": "One of the greatest dramas I've ever seen!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "FeverDog",
        "review_rating": "5",
        "review_title": "In response to SpaniardInTheWorks (SPOILER)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "igornveiga",
        "review_rating": "10",
        "review_title": "The 10/10 Gump",
        "review_detailed_main": "One of the best films, well portrays the 60.70.80 years. It shows various social movements in the United States, discussions about loyalty and love of neighbor. 10/10 cinema masterpiece with certainty"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "fabianthomasson",
        "review_rating": "10",
        "review_title": "A dreamy, warming and inspiring hunt for love.",
        "review_detailed_main": "From harsh bullying to the creation of milestone characters that have shaped our world. Forrest Gump delivers an inspiring journey in search a long searched unconditioned love.\n\nI have been watching this movie once a year since I was a kid. I love everything about it. Seeing the world through the eyes of Forrest Gump is needed from time to time. The naive interpretation of the world that Forrest delivers, will hand you a very useful perspective of the event to come in your own life.\n\nGetting through this movie without feeling love, hurt, happiness and even nostalgia is always an impossible task. For you out there who have not yet seen this movie, get to it!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sofiam-84691",
        "review_rating": "10",
        "review_title": "An amazing film which made even me cry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "arabellasruby",
        "review_rating": "10",
        "review_title": "Classic",
        "review_detailed_main": "This movie will never get old and cannot be duplicated. Tom Hanks has done a phenomenal job bringing out this disabled character from every aspect never missing a beat. From childhood memories of bullying to just growing up and trying to be accepted,this film makes you think about your own life and become grateful. It gives you a sense of hope in knowing you can be somebody that makes a change in this world. Full of emotional drama, action, and a little bit of comedy \"Forrest Gump\" is an all time favorite. Ten out of Ten hands down one of the best Films created. Watching this movie lets you see it from the eyes of someone who wasn't born with the glamorous or perfect lifestyle. I learn and see something different every time I watch it."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ndeveau-06312",
        "review_rating": "10",
        "review_title": "What a great movie, patriotic and sensational.",
        "review_detailed_main": "This movie can really show the ups and downs of American society from the 1950s till the 1990s. Each time a come across this movie, on Netflix or on TV, I just watch it, maybe twice a year or more. For everyone who'd never watch it, buy/rent/stream this wonderful Tom Hanks' performance. It depicts the life of Forrest Gump, a mentally challenged man from Alabama and his close links through American history. The movie also covers the life of his siblings such as his mother (Sally Field) and Jenny, his childhood friend and lover (Robin Wright). This picture shows the great transformation of American culture and society during Forrest's 50 years of life."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "suryanshmax-98019",
        "review_rating": "10",
        "review_title": "It proved to be a Oscar winning.",
        "review_detailed_main": "I decided to watch this movie today,and it made my whole day good. .The movie is extremely emotional and it seems as if I am watching several movies in a row. I simply don't have words to describe the role of Tom Hanks who is awarded with a Osacar.I would like to thank Robert Zemickis for making such a lovely movie......"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "nichster291",
        "review_rating": "9",
        "review_title": "An Exceptional Movie",
        "review_detailed_main": "This movie was something else, it perfectly captured an innocent man's life and it had the right balance of different genres. I really enjoyed watching it even though the ending was quite emotional."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "santigeranio",
        "review_rating": "10",
        "review_title": "Its Just One Of The Greatest Masterpieces Of All Time.",
        "review_detailed_main": "A Beautifully Told Story. Portrayed By One Of The Greatest Of All Time. And Masterfully Executed.\n\nForrest Gumps Story Is A Once In A Lifetime."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "squeezebox",
        "review_rating": "",
        "review_title": "Right Wing Propaganda Disguised as Heartwarming Family Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ACollegeStudent",
        "review_rating": "7",
        "review_title": "Fine coming of age movie not doing anything incredible though",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Platypus222",
        "review_rating": "1",
        "review_title": "I must be the only one...",
        "review_detailed_main": "(0 stars preferably)\n\nI must be the only one who HATED this movie. I know that most of you really love it, but I don't. I just don't see the point. It's just some idiot (nothing against mentally disabled people, but he's an idiot) sitting there telling his stupid story. However, NOTHING HAPPENS! He talks about all of these things that happened to him, but it doesn't matter. Would he be any different if these things didn't happen to him? No. Does any of it affect the plot of the movie? No. Does it matter that he happened to be in certain places at certain times? No, not unless you count that they got to show off the technology to splice him in with historical footage. Also, how exactly is it believable? He walked across the entire country. Right... He invented the smiley face. Right... He did a bunch of other stupid stuff that I have forced out of my mind because I HATE THIS MOVIE. Right... I just don't buy it. I can't. I wont. Neither should you. Nothing even happens until the very end of the movie. \"But,\" you say, \"the ending wont mean anything if you didn't see the rest of the movie. That's what the movie's about.\" No. It's not. The movie's about nothing. The end is pointless, as is the rest of the movie. It's not funny. It's not magical. It's not believable. It's not realistic. IT'S NOT GOOD!\n\nIf I never hear another \"Life is like a box of chocolates\" or \"Run, Forrest, Run\" or see a Bubba-Gump Shrimp place, it will be too soon."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "emilhristovich",
        "review_rating": "10",
        "review_title": "A touching story about overcoming life's obstacles",
        "review_detailed_main": "\"Forest Gump\" is a movie that nearly anyone would enjoy deeply. It contains every single element that a decent movie should contain and yet somehow manages to surpass being only mediocre.Tom Hanks' performance takes the movie on a whole nother level. The cinematography enhances the experience by making our bond with the characters feel personal and sincere. Just an overall amazing movie."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "niyasrahman-92000",
        "review_rating": "10",
        "review_title": "Complete Drama",
        "review_detailed_main": "It is a complete drama..but if you watch this Iam damn sure that this will be a complete entertiner too...and the perfomance of Tom Hank will blow your mind"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "georgipopov-07745",
        "review_rating": "10",
        "review_title": "Best romantic movie ever created",
        "review_detailed_main": "All-time classic. In the 21st century people are led to believe that they should be highly intelligent to understand life and his lessons. However, that movie teaches us that not your intellect makes life a lovely experience, but attitude, love, loyalty and ability to adapt to nature, far different from yours."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Danielvillalbah",
        "review_rating": "10",
        "review_title": "I wasn't expecting this.",
        "review_detailed_main": "Throughout my life, I've seen a lot of memes about this movie on various social media apps, such as Reddit, Facebook, etc...\n\nI don't know how I lived so far without seeing this movie before, but I finally watched it, and oh boy it was good.\n\nThis movie was a genuine journey, I didn't know anything about it and it was spectacular. This movie shows love, heartbreaks, laughs, and hate in its way. Something remarkable.\n\nWatching a movie without expecting anything about it and then blowing your mind by how good it was, it's a sentiment that will never stop making me fall in love."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "MelissaA96",
        "review_rating": "10",
        "review_title": "This film is one of the best",
        "review_detailed_main": "This film made my childhood amazing I could watch this over and over again"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ddelgerjamts",
        "review_rating": "10",
        "review_title": "Best Movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "durgarajurever",
        "review_rating": "10",
        "review_title": "Forrest Gump Worth watching",
        "review_detailed_main": "Great movie, Tom Hanks action was fantastic, genuine and simple movie. Nice try about Life"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ttbrowne",
        "review_rating": "",
        "review_title": "Disappointing is the very least I can say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "prestindalling",
        "review_rating": "7",
        "review_title": "Narration overkill",
        "review_detailed_main": "Forrest Gump is one of those movies where you can't really say you didn't like it without being criticized. Unless if you can back it up without some reasoning, excluding the term overrated. That just sounds like a lazy reason to most people, and even though I think it is overrated, I would still ask other people why they think it is overrated because I'm just a curious person. The response overrated is just disappointing for real but not professional movie critics like me.\n\nFirst off, Forrest's accent is over-exaggerated and obnoxious to hear for an 2 hour and a half movie. Imagine hearing it the theatres where the sound of his goofy and ridicules Alabama accent is pounding in my head. The only accent I liked in this movie was Bubba. In fact that will be my next point as to why I didn't like the movie too much:\n\nThe movie moves off the characters too fast, as if they are all expendable characters in Family Guy and the character development is weak, narration explaining most of the characters choices instead of showing the choices that they make. This movie had mostly tell, not show. Hell, I could barely tell why he even liked Jenny in the first place. He just said I love you, I write to her all the time, i miss you jenny, marry me jenny. Then even worse, he tells us why he likes Jenny, instead her showing those personality traits herself.\n\nGranted, there was one instance in the movie where it Did actually show his love for her instead of telling it, which was when she got punched and he punched the guy back, and he told her that no one should hit her and that he would never hit her. That was my favorite part of the movie, but that's not even the most famous scene of the movie for some reason. That brings up another thing\n\nThe most famous and heard of scene is the scene when Jenny says \"Run, Forrest, Run\" Seriously? It was in the first 10 minutes of the movie, and they were still little kids when most of the movie was jumping from historical scene to the next one. The scene did not have emotional meaning to me, the phrase sounds more of a meme than anything else. Also, what made the scene even more overrated was when he started outrunning the bikes and all that crap. It just made the scene even more unbelievable and unrelatable. Now this whole running junk was redeemable when he went back to go save Bubba because he was my favorite character, but when I was watching the scene for the first time I was rolling my eyes.\n\nStill, I gave it a seven because even though the historical scenes were narrated and had no point to the plot at all except to show he's been everywhere, it was still mostly funny and showed his goofy personality and it was nice to see historical figures interact with an idiot and see their reactions.\n\nAnd the crippled guy who I will not bother looking up was a great redemption story character, although I thought his subplot story was more interesting than Forrest's love life, and I wish that they could have added more to it. Like, how did he score some hookers? I wish it would have explained that to me because I can't see why they would be interested in a cripple. Unless they were paid like a normal prostitute, but I don't remember the movie explaining them as prostitutes.\n\nSoundtrack was good, particularly \"Freebird.\" Although the scene where it played it did not really match to what was going on and it was kind of confusing to me why they needed it then. Sweet Home Alabama is one of my most overrated and overplayed songs, and whenever I hear it I groan and complain. It's just so annoying!\n\nI wouldn't necessarily recommend this to somebody who wants to watch a famous movie, because I would recommend other movies like The Dark Knight or Requiem For A Dream or Donnie Darko or Silence of The Lambs but I can totally see other people recommending Forrest Gump. My advice would be, go check the movie out if you want to, and my opinion on this movie isn't as common as most people.\n\n7/10."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ElBastardo",
        "review_rating": "1",
        "review_title": "Apparently stupid people can become millionaires by blind luck. Who knew?",
        "review_detailed_main": "Everybody talks about how great this movie is. Will someone tell me why? So a stupid guy wanders through the world, saying all kinds of stupid stuff, chasing a drug addicted stripper, and by blind luck wanders into millions of dollars? Yeah, I can see why that's so popular. It seems like this movie would make more sense as an inspirational video for retarded people.\n\nLook! You too can be a success without the unbearable burdens of intelligence or talent. All it takes is ridiculous levels of luck.\n\nAnd what about the years of running? Years of running? What is that? It's just so ridiculous. Who does that? Who? And people follow him? \"I don't feel like running anymore.\" You're joking. Who wrote this because they should really be crucified."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Artimization",
        "review_rating": "10",
        "review_title": "Great Topic sir",
        "review_detailed_main": "Hi Sir I like your Topic it help me very much i am very glad to join jis comunity"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "BrianInvincible",
        "review_rating": "9",
        "review_title": "I may not believe in the American Dream, but I will always support Forrest Gump...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sicarrii",
        "review_rating": "10",
        "review_title": "this is my favorite movie of all time",
        "review_detailed_main": "This is my favorite movie of all time because i relate to some aspects and not just cause of that it is really re watchable and enjoyable i do recommend this movie to anyone and everyone who comes across this review"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "kewlconner",
        "review_rating": "9",
        "review_title": "Nearly perfection",
        "review_detailed_main": "It's hilarious, and it is tragic.\n\nTom Hanks is...amazing as Forrest Gump, striking the balance between \"stupid\" and \"normal\", as many choose to describe people.\n\nThere's parts where you can feel how sad it is, but it's not crammed in there, or overpowering. It strikes the right balance with the comedy.\n\nSomehow, this movie has found a way to be underrated, as it has 70% on Rotten Tomatoes from the critics."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "bpopp-46910",
        "review_rating": "10",
        "review_title": "Fantastic acting and cast",
        "review_detailed_main": "I loved this movie and the cast i felt that the story was very heartfelt and the way tom hanks was able to portray this character was phenomenal."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "satishforgod",
        "review_rating": "8",
        "review_title": "You can know what life is all about by watching it",
        "review_detailed_main": "This is a movie that should be watched by people who are keen to know the truths of life.."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "shrutisolanke-35547",
        "review_rating": "9",
        "review_title": "Simply beautiful.",
        "review_detailed_main": "This movie has so much to teach you. Life is absolutely what you do and quite simpler when you put it into action. All you have to do is never lose hope and keep moving. That dude had absolutely no clue where he was going or what he was doing but his carefress nature never let him into any worry of what will happen next, he just kept on moving for whatever led him. Did what he wanted, couldn't care less about people, loved his true ones, helped his companions, and finally succeeded at everything. That was some message told through the guy who was called to be stupid and his simple life and last but not least \"stupid is as stupid does\" he was no stupid others were."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "alchimiller",
        "review_rating": "10",
        "review_title": "Brilliant piece of movie culture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "shabeermullan",
        "review_rating": "",
        "review_title": "Thank you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "daoldiges",
        "review_rating": "6",
        "review_title": "Don't Eat Too Many Chocolate or You'll Get a Tummy Ache",
        "review_detailed_main": "Forrest Gump, I first met you back in 1994 in the midst of the great American hype over you. I thought you were an OK guy but was let down and disappointed, I thought based on my unrealistic expectations.\n\nAlmost 30 years later I decided to pay you another visit and see how you've aged. You know what, I still think you seem like a nice enough guy but this time I found the writing, and story all a bit lazy and pandering. All those American events and touchstones of the last 20th century, along with the soundtrack, it was all so 'on-target' that you didn't really have to both with the story and unique character development to touch the viewers emotions. But those were super low hanging and obvious fruits. I can kind of see why some folks loved and still love this film, but for me it was mostly average."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Millhouse-2",
        "review_rating": "3",
        "review_title": "Overrated",
        "review_detailed_main": "Forrest Gump is a bad, bad movie. It is an idiot going around falling backwards into heroism, fortune, and friendship in a very unrealistic fashion. It has no importance to society whatsoever. It adds nothing to one's personal enlightenment and does not make you think in the least. I suppose it is supposed to be a \"feel good\" film but it is too long and boring to be that. The fact that it has gotten so much praise notwithstanding winning Best Picture just makes me hate this film even more. If it is a feel good movie, let it be a feel good movie, but don't try to pass it off as some monument of film making and give it the same award as Schindler's List received and Saving Private Ryan got screwed out of. This movie is as retarded as Forrest himself is."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "aleksagrobar",
        "review_rating": "10",
        "review_title": "For sure the best one!",
        "review_detailed_main": "For me, this is the best movie ever. At first i thought i would not like this, because i dont like this kind of comedy. But, i was surelly wrong! During all the time, i was laughing and laughing because Tom Hanks was soo funny! Then i also cryied at some moments. Really emotional film for me too. The best film i watched."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "wieser-22488",
        "review_rating": "9",
        "review_title": "Awesome",
        "review_detailed_main": "There are movies that you can stand up while watching, go to the toilet or get another bowl of popcorn, and than there are movies, that keep you bound to your chair till the end because it's heartfelt and spectacular plot is just too good.\n\nThe latter is what this movie is. There is no way, anybody would be able to take their eyes off of this masterpiece directed by Robert Zemeckis. It combines one of the most beautiful screenplays in the 20th century and a score that keeps playing in your head until you peacefully fall asleep or just die and go straight to heaven.\n\nThe leading role of Forest Gump is being played by an astonishingly good Tom Hanks - such a great performance! As well portrayed is the smaller role of the mother, played by Sally Fields and Gumps big love-interest Jenny, portrayed by Robin Wright.\n\nBoots the house down, this is a must-see movie for every generation."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "korbendalas",
        "review_rating": "10",
        "review_title": "The best movie I've ever seen",
        "review_detailed_main": "I was only 13 when this movie came out, but it changed my life. Since then I've seen it like 40 times and I still find it amusing. It's the magic of the masterpiece movie that it makes you watch it over and over and you still find something new, something valuable. There are plenty of great movies but only one is on the top for me. Forrest Gump. Soundtrack is brilliant, cast even better, Tom Hanks is so believable, that you almost think that he really has IQ 74. The plot covers like 40 something years of a man, history events included in such a way that you just have to love it. There is no other way. I think that everybody would like to be a Forrest Gump in some way he is something like a working class hero of the 90's. Zemeckis did a great job with this movie, he managed to repeat it with CastAway in a different way. Hanks is exceptionally good in roles which view him as a solitary character, having nothing but a bunch o dreams, memories and plans."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "biswasarjun",
        "review_rating": "10",
        "review_title": "Forrest Gump is one of the best movies that has been built in Hollywood.",
        "review_detailed_main": "I didn't have a single moment of boredom while watching this movie.The story was beautiful. Each character is beautifully portrayed."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "pineow",
        "review_rating": "10",
        "review_title": "Run Forrest, Run!!",
        "review_detailed_main": "What truly sets Forrest Gump apart is its ability to evoke a wide range of emotions. It seamlessly transitions from moments of laughter to heart-wrenching sadness, leaving audiences both smiling and teary-eyed. The film's touching themes of love, friendship, and the indomitable human spirit resonate with viewers on a profound level.\n\nThe film's visual effects, particularly the groundbreaking use of CGI to insert Forrest into historical footage, were groundbreaking for its time and still hold up today. Alan Silvestri's evocative musical score further enhances the storytelling, creating a memorable and iconic soundtrack. Its enduring popularity is a testament to its universal appeal and the power of storytelling. It reminds us that life is a box of chocolates, and you never know what you're going to get, but every moment is worth savoring. This film is a must-see for movie lovers and continues to be a source of inspiration and reflection for generations to come."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "imnever",
        "review_rating": "10",
        "review_title": "The only movie I've ever given a 10",
        "review_detailed_main": "Yes this is the only movie I've ever rated 10/10. The story telling, direction, visuals, it is a pleasure to watch from beginning to end. Worthy of a lot of attention which it actually did get so no complaints there. If you haven't seen this, YOU ARE IN FOR A TREAT!!! I wish I hadn't seen this and the saw ait again for the first time. Maaan!!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "splaze",
        "review_rating": "10",
        "review_title": "How innocent a life can be",
        "review_detailed_main": "This movie presents life in a movie, you get to see a movie with full detail on how people live everyday. I highly recommend you see this movie as it is very educational movie that will touch your emotions. The movie will continue be seen for many generations so if you've not watched this movie yet then you're missing out. That being said this is an excellent movie with great actors."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "mohamed-magdy93",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "I think it's the most beautiful movie i have ever seen The movie has it all too,drama,comedy and it challenges societal norms as well I have seen this movie easily a half a dozen times \"Forrest Gump\" is one of the best movies of all time Tom Hanks' best performance He did everything from leading a football team to a championship, to being a war hero. Even through the tough times in high school to the frantic relationship with Jenny, Forrest still remained humble and resilient. A beautiful story.I can understand why it won 6 Oscars.Overall the film Forrest Gump is a great movie. It's definitely a movie you could re watch and still enjoy it as much as the first time.There is no way to define \"Forrest Gump\" as a movie. It can only be defined as art."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "ZebraCobaltis",
        "review_rating": "",
        "review_title": "The film is like a box of chocolates, the further you get the sicker you feel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "Neoshakespeare",
        "review_rating": "7",
        "review_title": "Great.",
        "review_detailed_main": "The movie was a great hit and it's not a surprise. Because everything was fine and superb. Once again the acting was so good. Even so we feel that the movie is too slow we realize that it is not boring."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "jockreby2000",
        "review_rating": "2",
        "review_title": "Schmaltzy patronizing pap, for the most part",
        "review_detailed_main": "You've got to give it to the makers of this film, they certainly tried every trick in the book to wheedle reactions from viewers. A person with a disability who manages to triumph through the most extreme and traumatic situations thrown at him. Was this meant to be some sort of metaphor for \"the American Dream\", whereby citizens by rights should triumph through whatever adversity is thrown their way, coming out the other side richer and stronger? Give me a break - or at least, show it to me in an intelligent, thoughtful, non-manipulative way!\n\nThe scenes with Forrest intercut into historic footage were quite nice, though."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "shervinebrahimi",
        "review_rating": "10",
        "review_title": "True Masterpiece",
        "review_detailed_main": "An actual work of pure art. Heartwarming, delightful and moving."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "cricketbat",
        "review_rating": "9",
        "review_title": "A unique & wonderful modern-day tall tale",
        "review_detailed_main": "Much like the titular character, Forrest Gump is such a unique movie. It walks, or rather runs, the fine line between drama and comedy so effortlessly that it doesn't feel jarring when the tone shifts. Plus, I think some may have forgotten how groundbreaking the visual effects in this film were. Tom Hanks is unforgettable as Forrest, and his performance made an impact in pop culture that was almost as big as the many cultural & political events portrayed in this modern-day tall tale. It's a wonderful experience to see a timeline of our country's history through the childlike eyes of Forrest Gump."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "murphaus",
        "review_rating": "9",
        "review_title": "a very good movie",
        "review_detailed_main": "Tho Forrest Gump is a great movie i would have done some things different, like i would of had a back story more on his father was kinda left out. Also we never figured out what happened to jenny's father kinda just briefly got taken out of the picture. where did he go what happened? It seems whoever wrote this was against fatherly figures, lutenist Dan was one of the only fatherly figures in the movie.but other than that this movie a great movie and i love it. Forrest gump should have won more than one Oscar and should be in the hall of fame. Forrest will go down in history forever my kids will always watch this movie with the family."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "annabjorkdahl",
        "review_rating": "9",
        "review_title": "This film is basically about a man with a mental disability who falls in love and this film is like his autobiography.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "lunchtime_215",
        "review_rating": "9",
        "review_title": "A Tasty Box of Chocolates",
        "review_detailed_main": "The movie Forrest Gump is a very unusual, but a great, film. Each of the four story elements of characterization, plot development setting, and themes are very effectively presented. It was very popular when it first came out, and people even now still discuss it, considering it as a modern classic. In the first eighteen days, it took $100 million in only American cinemas, more than any other film made by Paramount Pictures before. The movie was first written as a novel by an American author Winston Groom. The movie was made in 1994, directed by an American director Robert Zmeckis.\n\nThe story has an odd setting. It is set in a small fictional town in Alabama, but also the whole world. The filmmaker used this to represent his theme of 'everyman'. It has a long time setting. The story covers several generations from 1950s to 1990s. By covering of the world's time of losing innocence, as at the same time presenting Forrest as a symbol of innocence, he shows how the world has changed during the time.\n\nThe main character Forrest is an extraordinary person. He, played by Tom Hanks, is born with polio. He needed braces for his legs when he was young. He also has a low IQ of 70. He is unusual. He is different from other people in a lot of special ways. Forrest Gump represents all Humanity, as a kind of modern-day 'Everyman'. He is judged by his intelligence and appearance by other people. This leads to another theme of the story. Judging a person by one thing about them cannot explain the person. The filmmaker uses this astonishing character to show the viewers the surrealism. The events go under realism, but all the things that happen to him cannot happen to one person. This intentionally unrealistic characterization is used to give us the message that we are all human.\n\nOther characters are also very interesting. His mom Mrs. Gump, played amazingly by Sally Field, tries really hard for him to find the best of him. She is willing to do anything for Forrest, and she always stands up for him. She symbolizes good motherhood. Forrest's beautiful girlfriend named Jenny, also his first and the only friend in the school, later becomes his wife. She was the victim of physical and sexual abuse by her father when she was young. Her childhood was like living hell for her. In the film played fantastically by Robin Wright, Jenny plays one of the major roles in the movie, contributing to the plot development and the theme of acceptance and tolerance.\n\nThe mood of the film changes as Jenny comes to find Forrest, and then just leaves him alone again. The film slowly develops its high points. The first day of school is one. It is important because it shows that even little kids judge him by his looks. Later he goes to Vietnam and gets involved in the war. When he runs the entire breadth of America, the plot reaches one of its highest points with some humor in it.\n\nThere isn't only one theme in the film Forrest Gump. \"Life is like a box of chocolate,\" he says. You don't know what you're given, until you've opened your chocolate. Additionally, whatever you're given in life, you should always try to achieve your personal best. It also makes the viewers wonder about the idea of destiny and choices in life. The film has a universal theme of acceptance and tolerance. He says, \"Stupid is as stupid does.\" He might not fully understand what he's really saying, but the filmmaker intends the viewers to understand. It really means that it is not stupid to be unintelligent, but it's stupid to judge people on actions, not reputation, and to name-call them. The film tells us what it's really like to be a human. It expresses another universal experience of how we're more alike than not alike.\n\nOverall, I would say this movie is terrific. It doesn't only tell us about its themes and meaning of life but make us think about them as well. Both the actors' incredible performances, and the stimulating script writing make this movie so magnificent. The movie has won 6 Academy Awards including best picture. I strongly recommend you watch this movie and or read the original novel. It is important to understand what it's like to be a human, what it's like to be different, what it means to accept and understand each other and I'm sure you'll really like the movie too."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "matthewssilverhammer",
        "review_rating": "9",
        "review_title": "Sincere and Sweet",
        "review_detailed_main": "There aren't many movies that have penetrated the subconscious of the American zeitgeist as intensely as Gump, and it's not hard to see why. It's a film that deftly mixes nearly every genre into one epic tale, yet never shies away from the importance of small moments. But with this much love, cynicism and (some deserved) scorn aren't far behind: terms like \"on-the nose\" and \"syrupy sweet\" come to mind. But what's the advantage of this cynicism when it's so rewarding to just sit back and enjoy? At its core, Gump is pure Hollywood magic that deserves to be treasured. Essentially a biopic of a fictional character, Gump is first-person-perspective storytelling with a protagonist who sees much but perceives little\u0085at least not in the same way we do. Swimming in historical fiction and even magical realism, he impacts American history: presidents are met, classic songs are heard, Vietnam wars are fought\u0085yet Forrest's gaze is set on one thing: love. It's silly and whimsical, yet consistently surprising to see Forrest navigate through life with such sincerity and tenacity. Lest we neglect how technically impeccable the film is. The aesthetic is simplistic and gorgeous, and the effects (missing limbs, altered historical footage) are light years ahead of what they should be. But these things are rarely mentioned because they aren't the point. Zemeckis wants the movie to be the same as its hero: simple, random, sincere. Gump's unconditional love, overwhelming kindness, and naïve determination got him wherever he needed to be, and that journey leaves him and us in stitches, while never abandoning hope. Manipulative? Maybe\u0085or maybe it's just great filmmaking."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "rich-rossi-50",
        "review_rating": "10",
        "review_title": "An Absolute Masterpiece - The more you have experienced life, the better this movie gets",
        "review_detailed_main": "I've seen this movie several times since it came out in 1994 and every time I see it I have more respect for it than the time before. The story, the acting, the music, and the cinematography are all top notch, but this movie has a magic. It is a watch that brings us together and allows us to see what is really important in life. Follow what you feel when you watch this movie, this is one of the greatest parables ever written."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "LondonLady",
        "review_rating": "9",
        "review_title": "Amazing move all well acted",
        "review_detailed_main": "Best film story and perfect acting by all. You connect with all the characters. Emotional and funny yet entertaining. Gary Sinise will always be 'Lt Dannn!!' to us. Unforgettable and Unbelievable."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "matthewpringle-43659",
        "review_rating": "",
        "review_title": "Forest Gump Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "namanwal",
        "review_rating": "7",
        "review_title": "Great storyline but not a great value promoted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "sledge30",
        "review_rating": "1",
        "review_title": "This will break hearts",
        "review_detailed_main": "First off let me be fair about the movie...nice special effects. Now with that said sit back and let me rip the hell out of this horrible movie. I personally think Paramount and Robert Zemekis were handing out their own batch of Jim Jones Kool Aid at every theater in America when this was out.\n\nFrom start to finish I dont think I have ever seen a movie (I say movie, because this is not a film) that is more predictable, melo-dramatic, or sterotypicable. How in the world this dreck won best picture is beyond me. I personally believe the Academy was doing Speilberg a favor and awarded his buddy Zemekis for making an overblown bad film. Lets face it if this movie only grossed 60 million it would have been cosidered a failure and would have won best special effects and thats IT!!! In my opinion this is Ishtar part 2, without Isabelle Adjani. This movie was a forshadow of things to come from Zemekis. Contact, Cast Away, What lies Beneath; although better films than Forrest Gump just proves Zemekis has sold his soul to the BIG HOLLYWOOD garbage machine. Come back Bob, you were once a promising director."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "billdecker1",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": "I find this movie funny and also a pleasure to watch. Each time I have watched I find something new the message of this movie. Great cast. Tom Hanks was awesome. The Message of this movie for me is never give up and no matter what people say or do you can always move forward with what you want to do. I love the fact that he was in the army and even though he was not welcomed he made a long and lasting friends. Another thing is that he was always keeping his faith in God strong and true. He is an honest man and his momma raised that way. She did what was best for him.even though at times is didn't seam like it. And last thing Is that no matter what life throws at you. Have the strength and courage and faith to always keep your head up move forward. There are always things in life that is always going to blocking your path to happiness get through them"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "heisenberg12",
        "review_rating": "10",
        "review_title": "Might be the Greatest Movie Ever Made",
        "review_detailed_main": "If not, it's in the top 10 and a true masterpiece.\n\nRevisiting it after over ten years, it still hits hard with so much heart and excellent writing and acting by Hanks and Wright, as well as another unforgettable role for Sinise. Might be the only movie that can make you cry and laugh out loud at the same time.\n\nThere are many morals of the story, but one that seems universal is to make the most of life with what you got. Not everyone is privileged or handed things easily and people have different unique traits, strengths, and weaknesses, but you can at least make the most out of your life even if you have disadvantages. Forrest doesn't make excuses and does what he can.\n\nWish they still made Oscar winners like this. Miss the good old days of pure filmmaking.\n\n10/10."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "zardoz-13",
        "review_rating": "10",
        "review_title": "A Brilliant Comedy of Epic Proportions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "toccina",
        "review_rating": "9",
        "review_title": "Ability",
        "review_detailed_main": "Spoiler Warning!!!! Forrest Gump is in reality a movie that covers a plethora of issues for example racial issues with the KKK and Black Panthers, drugs, peace, war, and finally disability. For this review I would like to touch on the disability portion. I must first say that even though this movie is mostly comedic it can still be said that it is partially accurate. In the beginning Forrest breaks off his braces to help with his scoliosis but broke them off to run away from bullies. Yet even though he had this disability against him he still had the ability to do it. So in reality this movie begins by saying that it's more about ability. I can prove this point further by saying that he became a war veteran with a medal of honour and also managed to become a millionaire and then evidently a successful father, even though Forrest was put in the situation that was impossible, and even if it was for comedic purposes it is much deeper, yet he still managed to come out ahead. Mostly a duration of the movie it is asked if Forrest is stupid, now Forrest doesn't like it and even though he may have a low IQ he still manages to pull through in the long run. This is also the case for Lt. Dan, he is in Vietnam harmed in battle and winds up with his legs amputated, later in the movie he gets prothstetics and is able to walk again, he also ends up being a millionaire because of his success in the shrimp industry. It's not that he is in need because he is disabled but is able to help because he is able. So in reality Forrest Gump isn't necessarily a film about specifically disability or otherwise it is something that shows how much of an ability you have whether or not you have a disability from birth or war or some other thing. It takes a will to do something and this is why I would give this movie a 9/10 because of its uplifting story and some form of motivation to do something with your life."
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Iconic",
        "review_detailed_main": "I like the bit where he drank all those dr peppers and had to do a wee"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "vili1509",
        "review_rating": "10",
        "review_title": "Really good movie!",
        "review_detailed_main": "We just watch this movie in school and I thought that this movie was so good! I have never seen so good movie as this is. This is not my favorite movie but I would like to put it one of the best movie of all time list. Tom Hanks was good actor and deserved his Oscar. The actress of Jenny was really good too and I would like to give her the Oscar too. If you want so see this movie then watch it! This movie gives me some chills and some power of the excellent movie. Robert Zemeckis is one of the greatest director I know. Haven't you seen it? Then buy it for your DVD or Blu-Ray. Watch it, watch it, watch it, watch it, watch it!!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "seanspiering",
        "review_rating": "10",
        "review_title": "If this movie were a box of chocolates, you'd know what you're getting... cinema gold.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "zep42",
        "review_rating": "10",
        "review_title": "A story that contains all",
        "review_detailed_main": "This is the ultimate movie. It contains within it all of humanity and human history, wrapped around one special guy: Forrest Gump. Gump is clueless to this fact, he is just looking at the moment or forward, and in the process he changes history and fates of humans around him to the better.\n\nI recall no other movie that has satisfied me as a human in such way as this, in both drama, comic and thrill, with a manuscript that seems god-made in it's completeliness.\n\nOnly a few other movies ever made, can get close to Forrest Gump, if you ask me!"
    },
    {
        "movie_id": "tt0109830",
        "movie_name": "Forrest Gump",
        "movie_rating": "8.8",
        "review_username": "gdangeldth",
        "review_rating": "7",
        "review_title": "Touches One's Heart",
        "review_detailed_main": "I LOVED this movie. It was so cutely written. The fortune's of a man who decided to take all the steps he needed to not only run, but to run for the one he loves. Forest Gump isn't just a POV of the 'simple minded' on heir views of love, but it's also the triumph you feel for him. Despite everything, home really was were the heart is. This movie will cause you to open your heart and your mind, following Gump on his journey of determination to prove he could be a real man for Jenny. He didn't stay down when he was bullied and he didn't, as most humans selfishly do, think of only himself. I would definitely recommend this movie for families to watch, it will always be a family classic."
    }
]