[
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "kite111",
        "review_rating": "8",
        "review_title": "Excellent film! Great direction, acting and story! Don't listen to the critics!",
        "review_detailed_main": "They rarely make a film with true talent and substance in Bollywood these days. A lot of Bollywood has just become a senseless over-production of childish comedy, over the top action and sleazy \"item songs\". No one pays attention to direction, acting, storyline and dialogues anymore. But Hamari Adhuri Kahani has ALL the ingredients of a genuine film that will touch your heart. Emran Hashmi displays one of his best acting performances in a romantic and emotional role. He has successfully played a character that you would usually expect from someone like Shah Rukh Khan. Vidya Balan is equally impressive. She convincingly makes you believe that she is a woman stuck in the situation portrayed in the film. Yet the overpowering strength of the film is the fresh storyline, powerful dialogues and gripping direction. The connection with the audiences is so strong that it really makes you feel for the characters and will almost push you to tears. The songs and background music of the film are the pleasant icing on the cake. If you want to appreciate a great romantic film that will truly appeal to your emotions, PLEASE go and watch this movie! You will not be disappointed!!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "maulin5",
        "review_rating": "7",
        "review_title": "Emran rocks, unconvincing climax, overall one time watchable for the dialogues and performances!",
        "review_detailed_main": "First of all let me tell you that in the afternoon show of this movie, which doesn't have any Khan or Kumar in it, the house was full. Yeah, it's not convincing but it is true. The whole theater was full, especially with the youngsters. This clearly shows that Music hit, to Movie hit! Mohit Suri is popular for making films which are more related to the youngsters and especially the couples. The songs become popular before the movie release. He is the same director who made Ashiqui2 which became super hit without any stars and Ek Villain which collected 100cr at the box office without any storyline. So he rejoins the Bhatt camp and convince Mahesh Bhatt to write the story. Because of the family project, Emran Hashmi and Rajkumar Rao had been finalized for the respected roles. And Vidya Balan is selected because of the suggestion of Mahesh Bhatt. And then first of all, they create the soulful soundtrack. They even bought the song Zaroori Tha from Rahat Fateh Ali Khan for the better success of the album. Thus the film began to start! Story line is not refreshing. Old wine has been served in new bottle. But, the stars make the bottle a worthy drink. Undoubtedly, everyone will talk about Emran Hashmi after the movie. Though Vidya Balan is also fantastic and Rajkumar Rao also acts well. But, he is not convincing as a terrorist, or as an old man or as the husband of Vidya Balan. Vidya looks perfect for the role. But, it is Emran who makes the audience cry, who makes the audience to feel sad for him through his eyes, especially where tears come out from them. Music is outstanding. The best song that suits in it is Zaroori Tha. Title track is awesome. Jeet Ganguly once again proved that he can give the best! Last paragraph of that song is playing in the climax where Rao throws ashes in the garden, is the best scene with full emotions. Hasi and Hamnawa are also listenable. Dialogues are another plus point. The film is majorly dependent on Hashmi's powerful dialogues. Cinematography is as usual as we had seen in Suri's previous movies. Story looks good till interval, even after post interval, too. But, I don't convince with the climax and its twist. I'm hoping for something good for all, but, Suri only loves not so happy ending. This film shows the true love between two persons, so the Girlfriend-Boyfriend type people may not like this film. I'm saying so because I've watched some faces after the movie. On the whole, you can watch it once if you are a fan of Emran Hashmi or even Mohit Suri. I think it's better than Mohit's last 3-4 releases. But than also only Emran steals the show. This is his first U certified film, so family audience can also go for it. Hamari Adhuri Kahani can make only one difference and that is the return of Emran Hashmi!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "mbh690",
        "review_rating": "6",
        "review_title": "Well worth taking the pride of the ticket ...",
        "review_detailed_main": "From the trailers and songs , most of the movie is sorta guessed at. A sad / tragic love story , the question remains it has been handled well by the scriptwriters , the director etc.\n\nThe answer is a resounding yes. This is Mohit Suri's forte and he has elicited a fantastic performance from Emraan , Vidya. In particular this is Emraan's movie , his eyes speak volumes in his scenes.\n\nThe music is well placed.\n\nThe characters are not black or white , but grey, with their self motivations.\n\nIt's worth the money of the ticket. Go for it ..."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "n_dhruv",
        "review_rating": "",
        "review_title": "Emraan Hashmi made it worth watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "dipayandas1993",
        "review_rating": "7",
        "review_title": "Musical Journey of a True Love Story..",
        "review_detailed_main": "\"Hum kisi Aur se Payaar Tabhi karte hai.. jab khudse karna chodte hai.... \"\n\nWatched ‪#Hamari_Adhuri_Kahaani‬... After Ashiqui 2 and Ek villain Mohit Suri is Back again and this time with Emraan n Vidya... HMK's storyline may b look lil bit Unconvincing but its Unique.. yes Its a story of true love.. Emraan u just rock.. One of the best performance of Emraan so far.... Vidya looks good and other supporting cast r quite OK.. Direction by Mohit Suri is Good.. but could have been better... Cinematogrphy is excellent... overall its a good one time watch.. go for it..\n\nMY RATING- 3.5/5"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "binducherungath",
        "review_rating": "7",
        "review_title": "Hamari Adhuri Kahani is a movie about those who dare to leave their love for the sake of love. Watch this to feel love.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "acharyasailesh",
        "review_rating": "10",
        "review_title": "Sensitive story of every woman",
        "review_detailed_main": "It is a story of real Indian woman. Not the liberated, modern and independent woman but every other girl who despite being educated and employeed is buried under the tag of being a daughter, mother and wife. It tells real story of how difficult it is for them to find and feel love. It is a very sensitive movie and needs understanding of human pain and emotion. It is not some fun, masti, timepass movie for so called modern people who find everything traditional regressive. It shows the real situation not some make belief happy world. Yes, it is dialogue heavy and little filmy but that is expected of an emotional love story. Brilliant. Watch it."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "diwanmaithily",
        "review_rating": "7",
        "review_title": "Very touching love story",
        "review_detailed_main": "A very touching love story.. An unconditional love beyond the institution of marriage and society.. Watch this movie for beautiful story , great performance by the protagonists. I never liked Imran Hashmi till I watched this movie. I think he did a fabulous job and he looks cool in those business suits.. As usual Vidya Balan gives stunning performance as Vasudha.. She can get into any character very easily..she looks beautiful in the sarees. At some point you will predict the story, even then you will enjoy watching the movie for its simplicity in depicting this sensitive story. Kudos to the music director jeet ganguly for melodious songs which go very well with the movie..somehow all Imran hashmi movies end up getting awesome sound tracks. Hmmm.. The title song steals your heart.. Arijit Singh's magical voice makes u want to hear that song again and again. Good direction and all in all a nice movie.. Would recommend to all who like emotional and romantic movies."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "hamamalhar",
        "review_rating": "9",
        "review_title": "Don't judge by the overall rating. Must Watch!",
        "review_detailed_main": "Actually even i had lost a bit of interest after looking at the overall rating. But i was awed after i actually watched it. The music is soothing, it brings a tear or two. I still have the effect in me. Honestly i wish this story was published as a book. It would have contained a lot of insight and more weight. But still, Mohit Suri has done a hell of a job. One of the recent best emotional movie I'v watched this is. Some of the scenes would just pinch a muscle in the heart, thanks to the music and contents of the scene. Bollywood is improving, what with the kinds of films like YJHD. Even though the ending of Ashiqui 2 had me in disappointment, the story telling and acting put up in this movie just made me register for IMDb and write a review. Emraan Hashmi, with his love-felt looks, brings out the pain of a person who hadn't felt love, and covered by the money he has. Rajkumar Rao is outstanding. I like his movies. His acts are subtle. Brings out the character and hasn't failed to do so in the movie. He makes us cry with his innocence in the 'real time' of the story. Vidya Balan is cute. I'd rather tell sweet. Conveys the plot perfectly. Overall it is a must watch for movie buffs who wouldn't want a movie to end. Thank You."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "SumanShakya",
        "review_rating": "6",
        "review_title": "Modern treatment to an old story.....",
        "review_detailed_main": "From the ancient time period, our society has been male dominated where a wife is considered not more than a private property of his husband. Still the values haven't changed much and women are still tormented, beaten by their husbands. Such stories patronizing womanhood have been common in '80s social dramas. Story-wise the film looks a bit dated, but a tight script, nice dialogues, and a good performance from Vidya Valan makes \"Hamari Adhuri Kahani\" gripping. In other words, the film gets a modern treatment to an old story through beautiful sets and nice visuals. Emraan Hashmi as a business tycoon was a miscast whereas Rajkumar Rao attracts through his presence. A weakness persisting in the story was the inadequate elaboration of the dominance of the husband and retaliation of the wife , which was the main theme of the film. Instead, the romance between Emraan Hashmi and Vidya Valan gets most of the footage. However, few melodramatic sequences and a tragic end of the film do touch you at times for which the film is likable.\n\nRating: 2 stars out of 4"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "dhiraj-yahoo",
        "review_rating": "1",
        "review_title": "what a waste of time",
        "review_detailed_main": "what a waste of time. i guess most of the other reviews are fake. Please don't waste your time and money.\n\nEntire moving I was waiting for something to happen but a big disappointment. there is no connection what soever in storyline.\n\nSuch a lame ending and will leave you confused.\n\nwhat a waste of time. i guess most of the other reviews are fake. Please don't waste your time and money.\n\nEntire moving I was waiting for something to happen but a big disappointment. there is no connection what soever in storyline.\n\nSuch a lame ending and will leave you confused."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "mistie-13191",
        "review_rating": "10",
        "review_title": "Brilliant performance by Emraan Hashmi",
        "review_detailed_main": "Such a romantic movie. Music will touch your heart. dialogue are excellent and sometimes will make you cry. Vidya always good. She proved that still now she is better than all the young actress of bollywood.The best part of the movie is Emraan Hashmi. The way he delivered the dialogue with so much emotions its speechless. He is definitely one of the best actor in Bollywood now.Wow such a brilliant performance.don't know why it got so less star. But it worth of watching.yes direction is bit weak. But who cares about the the little negative points when its such a beautiful movie.loved watching the movie."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "MuviFan73",
        "review_rating": "7",
        "review_title": "Radha vs Sita: Who to choose?",
        "review_detailed_main": "It's a love story which also involves men going to lengths apart from whats mentioned in review title.\n\nWomen empowerment is a highlight in this emotional ride.\n\nFelt like Rajkumar's role was over dramatic until end.\n\nExtra mark for music."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "mohulghosh",
        "review_rating": "3",
        "review_title": "Hamari Adhoori Kahani: A Boring Romantic Story Which Drags On Without Logic Or Emotions",
        "review_detailed_main": "Hamari Adhuri Kahani, directed by Mohit Suri, the magician of love, and written by Mahesh Bhatt, the creator of emotions, miserably fails to ignite that intensity.\n\nWhat I felt after asking some viewers at the theater: characterization part is completely missing. There is no bond, no attachment, no feeling for any of the characters by the audience.\n\nHowever, having said that, the weakest link in this romantic ultra- melodrama is logic. There are huge, massive loopholes in the script, and often I was amazed how they can justify that. The timeline of the movie, the gadgets used and the over usage of tears; everything is done without any research into reality.\n\nThe plot is pretty simple: Married Vidya Balan falls for Imran Hashmi, the billionaire. However, Rajkummar Rao, her husband does not want to let go of her.\n\nWith a a triangle love story, there can be immense possibilities; if you add the Naxalite angle or of you include Dubai as a location or the office romance thing. But, the director decided to get stuck with the age old formulas; in fact, those mangalsutra sequences and all tears for the 'pati' and 'suhag' stuff made me cringe in disbelief.\n\nI was confused: why they have to go back to history, the previous blockbusters to ensure success in 2015? Why are they so afraid to try out something new, something unconventionally romantic. The love, and the purpose of love both have changed.\n\nFortunately, this was the first movie where Emran doesn't kiss; and unfortunately, this was the worst movie of Vidya I ever saw. She performed amazingly well, and carried out the cliché' dialogues in the most honest manner, but even her sparkling blue big eyes failed to save this movie.\n\nI had that sinking, depressing feeling all through the movie; as if love is only a mirror back of pain and hurt and stuff. It neither arouses empathy nor any false hope; it simply narrates an unfortunate story, in the most uncreative manner.\n\nAvoid it."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "psbanerjee",
        "review_rating": "",
        "review_title": "A decent story, let down by silly gaffes due to silly gaffes and weak first half",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "jmoneyjohal",
        "review_rating": "6",
        "review_title": "Flawed but HAK is full of beautiful mature emotions, and great acting. If only the story was as good, still a one time watch for sure!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "saurabh-20168",
        "review_rating": "7",
        "review_title": "Good Movie",
        "review_detailed_main": "My Review of #HamariAdhuriKahani : Emraan Hashmi's First \"U\" Certificate Film #HamariAdhuriKahani Releases this Week.. ✅It's Emraan Hashmi's Another Best performance.. ✅Directed by Mohit Suri (Director of Awarapan, Aashiqui2, Murder 2) is receiving positive response from audiences as well as members of the film fraternity. ✅Talented actors Vidya & Rajkumar rao have done a fab act in their perspective roles.. ✅Music is just fabulous & songs are placed on perfect situations.. ✅Arijit singh's HAK Title Track & Rahat Fateh Ali Khan's #ZarooriTha will wrench your heart.. ✅Emraan Hashmi's Act will surely Move You to the tears :) ✅It's an mature love story and one of the Best Love Stories ever made in Bollywood!!\n\n✌Go and catch this Love Saga in theaters near you with your family.. It's an well made clean Hindi cinema :)\n\nMy Rating : 7*/10 Good Movie 😎"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "AmanAjmani",
        "review_rating": "9",
        "review_title": "What's with all the negativity? The movie is freaking awesome <3",
        "review_detailed_main": "A Spoiler Free Review : First of all, let me tell you, I'm a Hollywood buff, but I love occasional Bolly stuff too of which my favorites being A Wednesday, Ek Chalis Ki Last Local, Rockstar, ZNMD, Fanaa, Ishqiya, Udaan, Dev D, Bheja Fry.. and some of them more. Well, I don't know why, but I chose Hamari Adhuri Kahaani to watch over Jurassic World(I'll watch that too, later :p), and Oh Boy! Did I made the right decision.\n\nThe movie is just fantastic, ek villain didn't impressed me at all(the songs were the ones which dragged it's so called 'success') But Aashiqui 2 was kind of good with some major plot holes, & the same goes with this one. I'm not implying that, Hamari Adhuri Kahani is one of a kind, It has many cliché moments, but the way Mohit opted to narrate the story, caught me into it.\n\nThis movie is purely performance driven. Vidya Balan stole my heart with her innocence but I've been a fan of her acting skills since Kahaani anyways. Rajkummar Rao delivering a top notch performance And Emraan Hashmi stole the show, I'm not gonna publicly admit that i cried every time he had tears in his eyes, I'm not gonna do that :p\n\nAll in all guys, this movie is packed with a hardhitting story, with an amazing climax (ignore the one's who are criticizing it, watch it for yourself & then judge it), the atmosphere (locations) serves as an eyecandy including the songs which gave me goosebumps, literally every time when the tittle track went on.\n\nThe movie is made for a Silver Screen so do watch it there. Worth ever penny, you'll love it :)"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "An Inconsistent, Yet Watchable Tragic Love-Story!",
        "review_detailed_main": "Mohit Suri's 'Hamari Adhuri Kahaani' is An Inconsistent, Yet Watchable Tragic Love-Story! Its brooding with sadness & although its never entirely convincing, this story still has a few moments, that evoke a certain emotion within you. Its flawed, but not without its pluses!\n\n'Hamari Adhuri Kahaani' Synopsis: Five years after the mysterious disappearance of her husband, a woman becomes romantically involved with a wealthy hotelier and together they confront her past.\n\n'Hamari Adhuri Kahaani' is a tragedy & hence the film mostly deals with the downs of life. The main characters are finely written, but they are so sad beneath, that after a point, you're exhausted. No, this isn't a depressing story, but at its heart, its an incomplete love saga about 2 people who just can't be one.\n\nMahesh Bhatt & Shagufta Rafiq's Screenplay is impressive in parts, but lags otherwise. While the first-hour moves a slow-pace, the second-hour slips into full on tragedy mode. However, the final act is unconvincing. The culmination, especially, doesn't work. The Writing isn't bad, but it could've been stronger & more convincing. Mohit Suri's Direction is decent. Cinematography is alright. Editing is loose at times. Mithoon, Jeet Ganguly & Ami Mishra's Songs are wonderful. Raju Singh's Background Score is excellent, as well.\n\nPerformance-Wise: Vidya Balan is earnest in her portrayal of a women torn between a broken marriage & a relationship she can't accept due to her morales. Though her character is regressive, Balan makes her believable, despite the Script's loopholes. Emraan Hashmi is brilliant & also the scene-stealer. He is mature, subdued & absolutely perfect as the sympathetic hero. Rajkumar Rao has a small role, but he leaves a mark as the hard-to-love husband. Namit Das is passable. Prabal Panjabi & Narendra Jha are adequate. Suhasini Mulay is terrific a cameo.\n\nOn the whole, 'Hamari Adhuri Kahaani' is a so-so fare."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "shweta_swee",
        "review_rating": "9",
        "review_title": "Love is blind but beautiful as here the lead actor fell in love with a florist.",
        "review_detailed_main": "Mind blowing picture,the way hashmi express his love is just speechless..all couples must watch this movie as they can only find it meaningful..mature roles has been played here with deep meanings.A very nice story directed by Mohit suri ,worth watching it.\"Tera bin bole samajh Jana\" -great job Emraan hashmi,love u for this performance.The dilemma part in Vidya balan's life in this movie when she came to know that her husband is a terrorist n she has to inform police whenever she gets even a call from him to help them to arrest him,there she acts beautifully. Hashmi dialog are so powerful that drives your attention.Those Adam lily flowers will be now mostly preferred by the love birds in the city ..haha...i too went to check out its fragrance as d movie reflects them so convincing.Well don't miss this movie guys ,a new philosophy,a new script has been brought down beautifully on screen..:) :)"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "ggoli",
        "review_rating": "7",
        "review_title": "The Challenges of grass route belief system",
        "review_detailed_main": "Watched the movie with a huge expectation as the movie was recommended by my good movie lover and friend. Due to 'Kahaani' movie expectations are very high.\n\nAfter watching the movie which is very intense and emotional, asked myself what could be the trigger to come up with this story, I guess inspired with the success of 'Kahaani'.\n\nThe movie is made in modern time, hence current generation of youth may not understand the reasoning of characterization of actors. Those who knows the traditional marriage system will understand and get totally emotional and feel sad for the 'circumstances'."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "nairtejas",
        "review_rating": "3",
        "review_title": "Impulsive Attacks Of Melodrama. ♦ 34%",
        "review_detailed_main": "There was a film called Ishqedarriyan (2015) that released few weeks ago and silently moved out of the theaters when everybody (including its cast and crew) chose not to watch it. Mohit Suri's latest makes sure that its story reached the Bollywood audience. So we have this.\n\nAn orthodox and abusive sadist of a man (Rao) marries a tubby, young woman (Balan), injures her both mentally and physically, plants his seed, and a year later, goes on an unexpected outing, leaving her to stay on her own with her newborn. Five years later, a success- oriented and priggish businessman (Hashmi), who otherwise has a good heart, meets this destitute woman and showers his love upon her, also hiring her has his florist like he is going to build a country out of flowers. In other words, the film is about a man (the good guy) who sincerely loves the wife of another fellow (the bad guy), and after an episode of dramaturgy, goes on to unite the original couple. How convenient.\n\nNow we know what the story is, and lovers may be able to relate and rejoice with it, but the loose screenplay and terrible writing spoils what could have been a genuine representation of true love, or whatever that means. Fortunately, it is better than Ishqedarriyan.\n\nDirection is also to be blamed where three top actors of the industry are simply wasted. Hashmi, in an out-of-the-typecast role, bluffs while his co-actor Rao puts up an average act of being a monster. Balan just gets away with her dismal performance. I sat up on my seat when I saw nose-jobbed Amala Akkineni (of Pushpak fame) in a cameo. Tonite I am going to wonder what drove her to do the bit.\n\nAlthough, I must say I am impressed with some of the dialogs which were quite romantic and generally true. Otherwise, the film is filled with people talking nonsense, shedding tears like their eye sockets are connected to the Niagara Falls. How a selfish man suddenly turns generous is what largely affects the dramatic closure of the story. All said and done, this tragedy is not heart-breaking, but heart-aching.\n\nBOTTOM LINE: Hamari Adhuri Kahani has a story that has all the ingredients mixed and placed in the mold. The makers just forgot to bake it.\n\nRATING: 3 stars out of 10. Should skip.\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "eamfam",
        "review_rating": "10",
        "review_title": "Simply amazing ( it started off a bit slow but overall loved it )",
        "review_detailed_main": "my brother watched and recommended it to me though he spoiled the ending for me and i just lost interest in the movie since i don't like these type of movies but after seeing a lot of people throwing some good comments on this in instagram i decided to give it a watch... the movie was absolutely amazing ,, very sad and heart touching and this is coming from a guy who doesn't even like these genre of movies haha no matter what genre of movies you are into, you will love this movie ! there were a few minor errors in the movie but that doesn't make it any less amazing enjoy the movie ! 10/10.. the end don't read next lines sad and heart touching and this is coming from a guy who doesn't even like these genre of movies haha no matter what genre of movies you are into, you will love this movie ! there were a few minor errors in the movie but that doesn't make it any less amazing enjoy the movie !"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "alekhyadas",
        "review_rating": "7",
        "review_title": "Every beautiful thing has flaws in it. Every beautiful films also gets some negative reviews.",
        "review_detailed_main": "\"Har khoobsurat cheez main daag hota hai. Har khoobsurat films ka critics reviews bhi ha-mesa ac-ha nehi hota.\"\n\nThis film has many flaws. I am not able to write a detailed review about this entire movie, but I'll just say, 'If you believe in true love, go watch this one'. The story may not be that good, but the emotional attachment I have from this movie is exceptional. I am not an Emraan Hashmi fan or a big adorer of romantic movies. I am a big thriller-crime lover, but I don't know why I love this film a lot. The music is quite well and goes well with the movie. The cinematography is amazing. Everyone acted their part quite well, but you'll fall in love with Emraan Hashmi.\n\nSo please don't listen to the bad reviews and stuff. Watch this movie.\n\nMoviewise - 3/5 Emotionally - 5/5"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "hanumantpatiljagtap",
        "review_rating": "4",
        "review_title": "Better to watch just the songs on YouTube. The movie's a waste of time.",
        "review_detailed_main": "Why Vidya why?? what made you choose Hamaari Adhuri Kahani..... This movie tries to show how intense love can be...n goes over the top....the dialogues are ridiculously insane.....n at times turn hilarious....god damn!!! who speaks that way!!!\n\nHAK lacks logic....its saturated with melodrama....its sad....over the top emotional....the film has a decent story-line but,it needed to be executed well!!! the meaningless dialogues n logic-less screenplay eat the essence of the story .....\n\nThis Mohit Suri movie doesn't quite hit the right note....I think he just wanted to prove that Aashiqui2 n Ek villain were better movies....talented actors were totally wasted in this movie......The only good thing about this movie apart from the songs was......well! ...The End!!!!...."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "sohomp",
        "review_rating": "7",
        "review_title": "Emotions Triumphs Over Everything",
        "review_detailed_main": "Hamari Adhuri Kahaani is a kind of movie that is worth watching mainly because of its music and Emraan Hashmi. Mohit Suri's direction is as expected superb. Music is already hit and love to hear in cinema hall. Some dialogues are awesome and you'll love them more when they come from Emraan's mouth with awesome expressions.\n\nEmraan Hashmi displays one of his best acting performances in a romantic and emotional role. He has successfully played a character that you would usually expect from someone like Shah Rukh Khan. Vidya Balan is equally impressive. She convincingly makes you believe that she is a woman stuck in the situation portrayed in the film. With a broad spectrum of emotions, Rajkummar Rao wows you with his power- packed performance.\n\nThe only factor which will go against the film will be its script. The script is out-dated and filled with too much of drama which might contribute to some dull moments.\n\nBut still, the connection with the audiences is so strong that it really makes you feel for the characters and will almost push you to tears. Watch this one if you are moved by sad love stories. The good performances are an added bonus. My ratings - 6.5/10"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "me-966-229407",
        "review_rating": "10",
        "review_title": "Excellent Movie and Touching.",
        "review_detailed_main": "This movie is an excellent piece of story. I cannot better rate this movie. I am compelled to write this review due to the touching nature of this movie. Emraan Hashmi's impeccable performance and lovely story. It reminds you the importance of love and how the Indian society and community needs to steer its mentality from the illogical, stupid and ruthless mindset of old times. Take everyone in your family to watch this movie. The movie has very good story plot. It's not an illogical movie plot. The best part of the movie was that there limited songs as stupid movies have many songs to fool audience. This movie had 2-3 songs only at places where the scene demanded it and your heart wanted it. Mohit suri could not do a better job at directing an emotional movie that is universally rated with Emraan Hashmi in it. Go with a positive mind and you will truly appreciate this movie."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "asif-90800",
        "review_rating": "9",
        "review_title": "In the era where all the movie rotate around stunts and stupid songs,A different movie which shows what really LOVE IS.",
        "review_detailed_main": "In the era where all the movie rotate around stunts and stupid songs,A different movie which shows what really LOVE IS.\n\nAfter a long time i felt something in my heart feeling love inside most of them wont like this movie as they are addicted to the stunts,sexy songs,stupid jokes and crazy things.\n\nThis movie focuses on LOVE and Mercy to others...\n\nShould watch one time. I liked the song Hasi and the Title song.\n\nStory is between the rituals and love.\n\nPlot: Five years after the mysterious disappearance of her husband, a woman becomes romantically involved with a wealthy hotelier and together they confront her past.\n\nThough there are some errors but ignorable."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "nanoo-shashwat",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Mohit Suri picked a topic which attracts everyone and generally receive mixed to positive reviews but i am sure this wont .\n\nEpic direction failure with not up to the mark acting made it even more unwatchable . Rajkumar Rao and Emraan Hashmi were good but Vidya gave 20 out of her 100% skills which you ll consider a disaster .\n\nScreenplay was average . The extra curled movie plot , story was bad .\n\nMaking film on a note of serious matter and promoting it everywhere is not enough Suri sir .\n\nIf you are a die hard fan of any of the above mentioned star , watch it . If you re not and wondering how the film is , wait for TV screening since its not worth your bucks .\n\nRating - 1/5 , Very disappointing ."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "darshans-03874",
        "review_rating": "10",
        "review_title": "This made me realize what True love is !!!",
        "review_detailed_main": "Being an avid English movie viewer, I was rather a pessimist to watch this movie.What started out as a lazy couch potato movie turned out to be one of the most loved movies by me. I never expected that love could be shown in such beautiful ways.The manner in which the male protagonist has portrayed the emotions and the feel of it is unexplainable. The way in which the director has captured the essence of emotions is truly remarkable.I would truly recommend this movie a watch.If you really want to fall in love again this is the movie you should watch.Vidya does a fantastic job with her portrayal of sadness and love. i could relate to the pain in Emran's eyes.It was too good to be true."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "ketgup83",
        "review_rating": "1",
        "review_title": "Lousy direction , insensible screenplay and predictable boring story gives you a headache",
        "review_detailed_main": "Sometimes I wonder whether Bollywood prepares any script before directing any film. Spending so much on location, songs and dance would not give inception of a good film unless script is thoroughly worked upon.\n\nHamari Adhuri Kahaani tells the story of Vasudha(played by Vidya Balan) who is vehemently married to Hari(played by Rajkumar Rao). Enter the rich business tycoon, played by Emraan Hashmi, who falls for Vasudha with dark past.\n\nMohit Suri, who is credited with films like Woh Lamhe, Ashiqui 2 and Ek Villain, does not do justice to the area of direction this time. Written by Mahesh Bhatt, this one is coupled with lousy direction , insensible screenplay and predictable boring story gives you a headache which you never asked especially from actors like Vidya Balan and Rajkumar Rao, forget about Emraan Hashmi. The main drama unfolds in the later reel which again is intolerable with screenplay written by a school kid. Dialogues are over-top and amateur. Imagine a 5 year old kid say about his father \"Papa sirf kaam karte hain... mere liye time kahan hain unke pass\". Art direction and Cinematography is excellent. Songs are tuneful. Vidya Balan convinces you with her matured performances. Emraan Hashmi as usual is wooden in expression. Rajkumar Rao is wasted.\n\nOverall, a pathetic film in every sense. Poor- 1/5"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "zanwer143",
        "review_rating": "10",
        "review_title": "An Excellent Movie To Watch",
        "review_detailed_main": "What's better than watching a classy movie on a weekend in your bed alone. Its a movie that one can say is composed of the very true and pure emotions, that depict the reality of life.\n\nBest Lines:\n\ni) \"Nothing in this world is perfect without imperfections\" P.S God has made everything on purpose. ii) \"You can't love until you stop being selfish, Love is about giving away its not an ordinary trade\" iii) \"Love is a responsibility not everyone can take it\".\n\nBest Scene: Imran Hashmi giving his life in lily garden.\n\nI gave 10 to this movie it impressed me on every ground that's the reason why I haven't left watching Bollywood movies because they occasionally produce a real master piece and its one of them\n\nHAMARI ADHURI KAHANI (Y)"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "kbhasuri",
        "review_rating": "10",
        "review_title": "Very heart touching movie",
        "review_detailed_main": "I have been liking his movies since long. He is known for the music which he nailed it here too. The emotions in this movie were really very heartwarming. Few scenes where vidya balan talks about women and traditions or her feelings for imran were really emotional. The whole movie had \"the feeling of love\" in it. Imran's performance was great. The passion he had for his love, the way he didn't have to prove it - All these things did add plus points to this movie. I would really give 10 stars to Shreya ghasal for \"Haan hasi ban gaye\" and Arijit singh for the title song. Its a must watch movie if romantic movies are your genre."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "indianature",
        "review_rating": "2",
        "review_title": "Mediocre",
        "review_detailed_main": "A friend recommended this film so I bought the CD. Watched it yesterday.\n\nMediocre is the best overall description.\n\nThis is a typical Mohabbat ki Junoon love story, not very well enacted at that. The plot is not strong enough and tends to drag. The film became somewhat interesting only from the second half but even that was not deserving of anything other than the mediocre tag.\n\nSorry to say and I have nothing against him otherwise, but Emran Hashmi was sickening in his role. He just could not pull it off. Vidya Balan was okay but what could she do with a story like this? Rajkumar Rao acted fairly well, but again the plot put it all to vain.\n\nSeveral other minor flaws such as the valley of flowers scene incongruously stuck in the midst of the Bastar jungles, did nothing to help the overall lackadaisical plot. Not sure why they bothered to film at Qasr Al Sarab in the Rub Al Khali desert. It did nothing to help the movie, other than to perhaps attract a few viewers from the UAE!\n\nWatch this on TV if you must, and if you can sit through the entire film."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "vilontetoyou",
        "review_rating": "10",
        "review_title": "Beautiful movie",
        "review_detailed_main": "It was really romantic. Usually not my type and still isn't, but it was still amazing!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "dineshprakash",
        "review_rating": "2",
        "review_title": "This film should have been incomplete",
        "review_detailed_main": "It is very clear that Director Mr. Mohit Suri has done this movie for other reasons rather than his own conviction. He is confused about characterization. Story it self is confusing. Screenplay and dialogues are stale and old. Starting of the film gives hint that it is going to be a romantic thriller but as drama unfolds there remains neither thrill nor love. You see worst makeup in the beginning of the film of aged person. There is a scene where woman touches a man's feet for showing her gratitude towards him but you will laugh at this scene the way and place is comes, when makers must have been thought it's epitome of emotions. Old lame excuses for love blooming, like something has put in my eyes, Man looking at woman through the center mirror of car, recalling her through scent of flowers. Woman runs for her Mangalsutra, when she feels tender emotions towards another man. Deeya goes off to symbolize the danger on man!!! You will laugh on the dialogue like \"Ye banjaran kaun hai jo apni si lagti hai?\" Gone are the days for such cheesy scenes and dialogues. Enough is enough. We have seen all this innumerable times on big and small screen. Tear flows down mostly but emotions have been conveyed rarely. A person, who has achieved grand success in his life should have been confident but he always keeps his hand in pocket or cross fold his arms, which shows lack of confidence. Performance wise fine actor like Vidya Balan or Rajkumar Rao are wasted. Emraan Hashmi is OK. Songs are melodious."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "yaminisharma-93672",
        "review_rating": "10",
        "review_title": "amazing movie, thanks a lot makers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "meydiana-65242",
        "review_rating": "10",
        "review_title": "Excellent film! Great direction, acting and story! Don't listen to the critics!",
        "review_detailed_main": "They rarely make a film with true talent and substance in Bollywood these days. A lot of Bollywood has just become a senseless over-production of childish comedy, over the top action and sleazy \"item songs\". No one pays attention to direction, acting, storyline and dialogues anymore. But Hamari Adhuri Kahani has ALL the ingredients of a genuine film that will touch your heart. Emran Hashmi displays one of his best acting performances in a romantic and emotional role. He has successfully played a character that you would usually expect from someone like Shah Rukh Khan. Vidya Balan is equally impressive. She convincingly makes you believe that she is a woman stuck in the situation portrayed in the film. Yet the overpowering strength of the film is the fresh storyline, powerful dialogues and gripping direction. The connection with the audiences is so strong that it really makes you feel for the characters and will almost push you to tears. The songs and background music of the film are the pleasant icing on the cake. If you want to appreciate a great romantic film that will truly appeal to your emotions, PLEASE go and watch this movie! You will not be disappointed!!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "habib_mushtaq",
        "review_rating": "1",
        "review_title": "This Vidya Balan, Emraan Hashmi starrer is a shockingly empty film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "ladyxoc",
        "review_rating": "8",
        "review_title": "A Sentimental Journey",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "bobbysing",
        "review_rating": "2",
        "review_title": "Two intense performances cannot save an otherwise absurd & badly written film.",
        "review_detailed_main": "Giving the Bhatts an advantage of their recent success stories, majorly achieved due to their proved music sense and the low-cost model they have been working upon, its quite possible that they might not incur heavy losses in this poor HAMARI ADHURI KAHANI too as per business terms. But if one talks about direction, characterization, execution and the writing in particular using some honest words, then this is one of the worst offerings from the team in the recent times (post another pathetic dud MR. X).\n\nPersonally, I don't even feel it was entirely written by Mahesh Bhatt (as publicized) since it has such silly, shabby and confusing story progressions that actually doesn't fit in with the name of Bhatt as a writer. Yes, the film begins with some intense sequences having a clear MB stamp dealing with a father, son and the mother, but then gets scattered so childishly that one cannot believe it has been really penned down by the same person we know by the name of Mahesh Bhatt, who gave us films such as Saaransh, Janam, Arth, Daddy, Swayam, Sir, Naam, Tamanna, Zakham and many more specifically written around emotional outbursts in broken relationships.\n\nTo give you some specific reasons for my above assumptions, What can you say about a script telling you a story of a single mother of 7-8 years old kid, left alone by her missing husband (since 1 year after the marriage), getting involved in a fresh affair and leaving for Dubai to work, without taking along her only dependent kid for some undisclosed reason? In fact its so weird to even assume that a script revolving around a single mother, features the kid in only few of its opening sequences and then again towards the climax, not mentioning him even once in the middle section when the mother is stepping into a new phase of life with a rich hotelier. Now how could Mahesh Bhatt even approve it, making every single character in the script look like a dumb, stupid person knowing nothing about what ought to be his or her first priorities of life to be precise?\n\nMoreover every key person in the story coming up with his own flashback after a while makes the narration heavy, boring and stale. Plus few absurd moments simply make you ask that, Is it the same film having those emotionally engaging promos promising a worth watching product from the Bhatts?\n\nFor instance, as Vidya's missing husband (Rajkumar) returns (who is a terrorist as per the police records), he easily gets into his old house and hides as there is no police surveillance around the residence of a wanted terrorist. But above all, meeting his wife after many years, he is not even concerned to ask about his only son and then fast gets into a weird revenge mode (partially making you recall the basic plot of SLEEPING WITH THE ENEMY and numerous Hindi movies made on the its theme unofficially). Besides the script in its climax (issuing bizarre death sentences to its lead characters), once again refuses to give any importance to the 'Parenting' aspect of the storyline making you laugh instead of cry putting it bluntly.\n\nBeing an uninteresting drag throughout after making a fine start, HAMARI ADHURI KAHANI doesn't impress with its soundtrack too with only the title song making a decent impact on the listeners due to its relatable lyrics (since everyone has some kind of Adhuri Kahani in his or her young past). Probably that's the reason the Bhatts had to buy an extra Rahat Fateh Ali Khan track from his private album to add into the film deliberately. So no credits for that good song can be given to the Bhatts.\n\nThe script full of all seen before, heavy melodrama fails to take any advantage from its otherwise fine background score and cinematography, mainly due to many badly written dialogues ruining the entire scene like \"Mere Ghar Ka Choolha\u0085\u0085...\", \"Arey, Yeh Banjaaran Kaun Hai?\" and more. Also the lazy, illogical & half-baked characterization doesn't allow the actors to reach their viewers hearts ever in the film's 130 minutes of duration.\n\nTo give the two key performers their deserving due, Vidya Balan tries really hard right from her first scene itself, but her character developments mostly remain dumb and highly questionable hampering the overall impact of the intense act severely. Similarly Rajkumar Rao too tries to deliver his best in the short role but doesn't get the much required support from his confusingly written role heading nowhere. And talking about Emraan, I honestly cannot recall when he acted differently in a film other than SHANGHAI directed by Dibaker Bannerji. As a result, once again he remains the same as seen in his earlier films making no visible effort to somehow do it differently. However it was indeed a pleasant surprise to see one of my favourite actresses Amla back on screen playing Emraan's mother.\n\nIn all HAMARI ADHURI KAHANI doesn't turn out to be anything even closer to the ones written by the exceptional filmmaker a couple of decades back. In other words, it can easily be rated as a badly conceived film that evidently couldn't express the basic idea in the mind of its reputed writer, for which everyone stands equally responsible in its entire team, including the one and only Mahesh Bhatt."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "prabhulaldamji",
        "review_rating": "9",
        "review_title": "Sensitive Topic Kept Under 'Carpet'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "shonyyourmine",
        "review_rating": "10",
        "review_title": "Don't Believe the Critic.....",
        "review_detailed_main": "Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai... Thousand words cant describe it, Gehri Battein Dil Ko Chuthi Hai..."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "itsprithveesinha",
        "review_rating": "2",
        "review_title": "Funny thing. How could anyone like this movie???",
        "review_detailed_main": "I've heard lots of people liked this movie. Reason not found.\n\n2 is for the songs.\n\nBut, Bad script, bad characterization, the love story failed to touch hearts,\n\nAnd dialogs? What the... I mean seriously? In 2015? Sure Mahesh Bhatt was struggling with his old writing skills.\n\nTitle song was good but doesn't make sense by playing it through out the whole movie.\n\nRajkumar's appearance was a waste. His dialogs were less than his hauling.\n\nEmraan could've done much better.\n\nVidya's acting was shocking.\n\nI'll blame Mohit for their bad performance.\n\nThough I liked the scene at Kolkata,\n\nA letdown movie."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "yasiru1991",
        "review_rating": "10",
        "review_title": "One of the rare Movies which shows the untouched depth of love !!",
        "review_detailed_main": "It was a Great movie which is a mix of magnificent direction, music, lyrics, screenplay , dialogues and acting. It is a very rare film which overlooks the simple theme of two bachelors falling in love and making their love to end in a marriage facing so many troubles. This film brings you the perfect picture of how complex love can be. Love is not marriage and you do not know where you will meet your love which makes you feel that you love. Even if it happens you may be in a position where you cannot love.\n\nIt is a masterpiece of discussing those rare complexities of love. It is a complete different theme discussed in a bollywood film which makes it very special. The music and dialogues are very powerful that makes you feel the same feeling what arav and vasuda felt right at the moment. It was a film which feels to you and at the same time gives you or educate you above the deepest complexities of love and human interaction. A must watch film for every person who has ever felt the feeling of love."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "rupak_speaking",
        "review_rating": "5",
        "review_title": "Had A Story To Tell But Poor Execution",
        "review_detailed_main": "This movie had potential but fails to make an impression. Vidya Balan and Rajkumar Rao were as usual stupendous in the scenes involving them, those were the only moments which perhaps had an impact on the viewer, otherwise average stereotype acting by Hashmi and a porous script damages the prospect for this movie, what could have been a soulful romantic tragedy. Emraan has still a long way to go as an actor and just could not match up to the lead woman in the movie. The way it ended, should have moistened the eyes of an average chick-flick lover, but it certainly even failed on that count. I can't go with more than 5/10 for this one..."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "kkhan-63669",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "Awsme movie brilliant acting and direction. Emraan hasmi one of d best movie and best movie by mohit suri"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "salikramkushwaha",
        "review_rating": "10",
        "review_title": "Good movie..",
        "review_detailed_main": "My one of favorite movie.. Not many people can understand such movies I know but for me it's priceless.. It definitely gonna be my all time favorite movie.."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "ahegde3149",
        "review_rating": "2",
        "review_title": "Flawed and overly melodramatic",
        "review_detailed_main": "Hamari Adhuri Kahaani is a film that makes the audience suffer as much as its characters. Its a distressing experience which you will either sleep through or it will end up inducing a headache. The story of a miserable love triangle with cringe-worthy dialogues and monotonous characters is what we are missing in Bollywood, isn't it great! The sad looking drama is pretentiously boring and synthetic. Instead of feeling sympathetic towards the characters I felt like laughing thinking how exaggerated the emotions were. What is more painful, is that it wastes the talents of some really good actors. Vidya Balan and Emraan Hashmi try their best but couldn't save this sunken ship. Rajkumar Rao was the best and convinces us with the sick character he plays. The only silver lining in this drivel was the title track sung beautifully by Arijit Singh and it induces more emotions than the film itself. Without that song the climax wouldn't have been heartfelt and much better than the rest of the film. I think one should just jump to the last 20 minutes skipping the rest of the film and having a much emotionally satisfying experience. Complete waste of time.\n\nRATING: [1/5]"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "sachin_rautela",
        "review_rating": "10",
        "review_title": "A true love story has no end.......",
        "review_detailed_main": "Emotional, Underrated & Exceptional\n\nThe saying is right that, \"Never judge a book by it's cover.\" One of best and underrated movie of Bollywood which I never thought would going to be the one of best love story movies I've ever watched.\n\nI usually avoid to watch movies based on love story but the song \"Hamari Adhuri Kahaani\" made me to watch this movie. And after watching this movie I really got impressed to watch such rare stuff.\n\nThe plot of the movie is quite impressive. Emraan Hashmi (Aarav) and Vidhya Balan (Vasudha) acted very well and they just nailed it. The chemistry between Aarav and Vasudha is worth watching.\n\nAll songs are very good especially \"Hamari Adhuri Kahaani\".\n\nOverall story of the movie quite impressive and you know what I am definitely sure this movie will make you cry at some point."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "waseemshafibhat",
        "review_rating": "10",
        "review_title": "Really heart touching movie",
        "review_detailed_main": "This movie reminds me of the Hollywood movie \"the bridges of Madison county\", though the stories are totally different but there is some emotional connection between the two. It has got brilliant story, mind blowing acting by Vidya Balen, Imran hashmi and not the least Raj kumar. Songs are amazing and fully connected with the movie. And finally, now onwards I am fan of Vidya Balen."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "priatripathy",
        "review_rating": "10",
        "review_title": "Heaven",
        "review_detailed_main": "\"**Hamari Adhuri Kahani** is a deeply emotional and beautifully crafted film that leaves a lasting impression. The performances by Emraan Hashmi and Vidya Balan are heartfelt and compelling, bringing their complex characters to life with great sensitivity. The storyline, filled with love, loss, and longing, is both poignant and engaging, making it easy to connect with the characters' journeys. The music, especially the title track, is soul-stirring and perfectly complements the narrative. Mohit Suri's direction captures the essence of the story wonderfully, creating a cinematic experience that resonates deeply. Overall, it's a must-watch for those who appreciate intense and moving love stories.\""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "sdmegha",
        "review_rating": "10",
        "review_title": "a good romantic film",
        "review_detailed_main": "i think this is Emraan Hashmi best film he have done.excellent movie to watch. love to share all film lovers.a good story. Emran Hashmi displays one of his best acting performances in a romantic and emotional role. He has successfully played a character that you would usually expect from someone like Shah Rukh Khan. Vidya Balan is equally impressive. She convincingly makes you believe that she is a woman stuck in the situation portrayed in the film. Yet the overpowering strength of the film is the fresh storyline, powerful dialogues and gripping direction. The connection with the audiences is so strong that it really makes you feel for the characters and will almost push you to tears. The songs are excellent."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "ashish-02307",
        "review_rating": "10",
        "review_title": "Very good movie don't listen to critics",
        "review_detailed_main": "The movie is too good its direction acting of cast music everything was well played."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "vaterian",
        "review_rating": "10",
        "review_title": "A heart touching",
        "review_detailed_main": "Masterpiece love story full of emotions.\n\nDialogue, music, acting everything just superrbbb."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "neha-03661",
        "review_rating": "8",
        "review_title": "Must Watch At least Once",
        "review_detailed_main": "I just want to write that this movie shows that how much a women sacrifice in her life to get the smallest happiness, however most men don't understand their value and emotions. They take them for granted.This is what happened in this film. I also believe that due to our long lasting customs that was taught to every girl that she should stay with her husband no matter what and she has no right to love again (even if she is not happy in her current marriage). No matter what as a girl you have to live with him.I loved the movie however there are some falls into it.\n\n1.She should have taken a stand with the person who can take her out from all her pain and sorrow that she has got till now rather than supporting him she was doing all possible foolishness to support her husband. 2. He had exploit her in every possible manner and also he has become selfish that he can't see her happiness being with the other person who love her like anything. 3.Her husband ruined her life he should have told her to settle down and live her life happily with the person she loves.\n\nThe writers would have given a chance to a lady who has suffered so much to live happily. I am not happy with the ending as well they would have made like this that her husband realizes and he united them.\n\nBut overall its worth to watch and you can connect with this movie automatically."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "hammadsalim-10327",
        "review_rating": "10",
        "review_title": "A refreshing love story without any usual predictable bollywood masala",
        "review_detailed_main": "I am not sure why there are so much negative comment.\n\nThe story is backed by really strong script and some really good acting from all the stars, even from Emraan Hashmi. I decided to watch the movie purely because the music was absolutely amazing. I was not expecting much from it but was pleasantly surprised. Mind you that I am not easily impressed by bollywood movies but this was definitely an exception"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "iushicpatel",
        "review_rating": "10",
        "review_title": "best Hindi film EVER! EMRAAN HASHMI STOLE THE SHOW!",
        "review_detailed_main": "So I've seen this film so many times, I don't watch Hindi films I am British born and I'm a student and live in England and I only tend to watch English films but I heard a song from the film (hasi) and fell in love with it so I decided to watch the film. It is honestly amazing I cant even describe how good it is, I think Emraan did so well I fell in love with his character and him. The film is AMAZING a sold 10/10 for me! Don't listen to the critics. As well as the film all the songs are really good an touching I honestly don't know what some of it means but the calming voices just say it all. Vidya Balan was equally as impressive as Emraan. Emraan Hashmi did so well his acting was on another level!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "xxshubhixx",
        "review_rating": "10",
        "review_title": "Wow!!",
        "review_detailed_main": "This movie was AMAZING, it really pulled on the heart strings. Overall great acting for both the main characters and the storyline was portrayed by them superbly. There was a very good twist in the middle of the movie that made you re think a lot. The beginning told the end which kept you in this limbo, because you forget it was shown but can't help but hope it ends differently. The title of the movie is perfect for the story"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "saudmayar",
        "review_rating": "10",
        "review_title": "Excellent direction, storyline and lyrics",
        "review_detailed_main": "i am glad that after a long time i watched a Bollywood movie and don't think i waste my time. A good movie and a rare love story to watch. This movie is pulling back the Bollywood to its realistic and unique tradition of love stories and its good to see. They should not follow the tradition of south and Hollywood actions films which is only a half n hour or two hours show and that's it, never clicks anyone mind not even a single message of humanity and love, but a combination of some blunders and high volume music. This movie makes you believe in love and humanity. The story of this movie is very heart touching and unique. I suggest everyone must watch and also rate and review. It always happens with Bollywood movies that good movies ratings are usually low."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "frankensteink",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "I just say, it's the best movie gifted by emran hasmi. After watching this movie, for few moment i was speachless. What an acting delivered by hashmi & bidya. Thanks mohit suri for such a mind blowing movie."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "snaidu422",
        "review_rating": "8",
        "review_title": "Love, Death & Arum Lillies",
        "review_detailed_main": "To become an immortal classic, it is a mandate that every love story has to have a tragic ending and one of the lovers making the ultimate sacrifice to prove their love or both of them. It has been happening since the era of \"ek dujhe ke liye\" and even \"Titanic\" is a classic example. When Mahesh Bhatt announced \"HAMARI ADHURI KAHANI\" and advertised it as based on a true story of his grand parents, little did we expect that we would be an audience to a movie with a terrific screenplay about star crossed lovers who are not exactly in their teens.\n\nThe movie begins with the death of one of the protagonists and the events which happen shortly afterward. A diary which reveals a story of a star crossed romance.....\n\nVasuda (Vidya Balan) is a married woman and a single mother, whose husband Hari (Raj Kumar Rao) is apparently gone missing from half a decade. She is a florist in a 5 star Hotel and one day ends up saving the owner of the hotel Aarav (Emrran Hashmi) from an eminent fire threat, which is later revealed to be a kind of false alarm created by Aarav to test the efficiency of the staff.\n\nImpressed by Vasuda and her Arum Lillies, Aarav offers her a job in his Dubai hotel, which she refuses as she is tied up to her family. Vasuda accepts the offer soon after when she learns that her husband is now a part of a terrorist group which killed a group of American Tourists in cold blood.\n\nOnce in Dubai, Sparks fly and the florist and the hotel owner get into a torrid romance and they both travel back to India to enable Aarav to meet Saanjh (Vasuda's son) and to get a divorce arranged for Vasuda.\n\nIt is here that Vasuda runs into her husband Hari who is in a very bad shape and reveals that he is not a terrorist and he has been framed. When he learns that his wife is having an affair, the MCP gets enraged and walks out and gets arrested by the waiting cops.\n\nVasuda runs to Aarav for help who decides to go to Basthar (the place where hari was framed) to procure evidence proving him to be innocent.\n\nThe movie has a perfect cast, Emraan as the love lorn rich man Aarav Ruparel is impressive and excels in the romantic scenes as well as the emotional scenes.\n\nVidya Balan as Vasuda is perfect and the 7 minute monologue delivered by her towards the end of the film is classic remainder of what a perfect actress she is and yes the speech does raise a lot of questions in our mind, mostly criticizing our rotten customs which are hell bent on snatching a women's freedom.\n\nThe movie belongs to Rajkumar Rao, his performance as the male chauvinist Husband is classic. The scene where he discovers his wife is having an affair and the scene where his wife fights back are perfect example of what a fine actor he is.\n\nThe surprise packet is Amala Akkineni who plays Aarav's mother and her cameo is responsible for a significant twist in the film and also she has the title song picturized on her.\n\nMusic by Raju Singh is soothing and most of the songs prepare you for the tragic ending the movie is heading for, which in fact is a unique accomplishment.\n\nStory by Mahesh Bhatt is perfect and the screenplay gives it a classic approach by using the Arum Lillies as a Macguffin. Whenever Arum Lillies appear in the movie, the screenplay warns us of an eminent danger or a significant twist in the movie.\n\nDirection by Mohit Suri is exemplary and he leaves no stone unturned in manipulating your emotional chords . The only confusing fact is the time-line of the movie, it is not clear whether the opening scenes are a present day occurrence, because if they are, then the main story should have taken place sometime in 1994-95, and use of cell phones and laptops and skype is little too difficult to digest for that period and if the opening scene is set in the future, well! Then the director sure has a dark vision of India's future where we still have those buses in poor condition and kaccha roads......and a farm of Arum Lillies in Chattisgarh is taking cinematic liberties a bit too far.\n\nWell! Minus the few hiccups, the movie has the quality of becoming a classic in the distant future, and yes it was little ahead of its time.\n\nWatch this movie, if you are into star-crossed romances and want a change of scenario from the same old Bollywood routine.\n\nI would give it a 4 star for a 5 rating........."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "Rawal_Afzal",
        "review_rating": "10",
        "review_title": "Emotional and touching....The perfect recipe for a tragedy!",
        "review_detailed_main": "There are flaws in the film, many of it, but it is its ability to touch through music and emotions that make it a tragedy so perfect, one that you can't help but feel sad and touched whilst watching it.\n\nI can see a pattern here, a pattern stringing together the last three films directed by Mohit Suri. Whereas I wasn't too impressed by 'Aashiqui 2' (2013), neither too fascinated by 'Ek Villain' (2014), but I have to admit that both still had an element of giving an immense feel of the pain of love, which again was down to the wonderful music and the constant running of very touching background music throughout the all three films.\n\nI have always believed that more than anything else, a tragic love story needs emotions that are able to connect with the people watching, it truly had that. The performance by Emraan Hashmi and Vidya Balan were outstanding I felt, so was Rajkummar Rao's. This was in fact amongst the very best tragedy films that I watched in my life.\n\nAnd so I sit to wait for Mohit Suri to come up with another one....."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "saahikat",
        "review_rating": "10",
        "review_title": "Emraan gives Vidya a job at one of his hotel chains when she saves his life; both characters develop feelings for each, that they cannot fulfill.",
        "review_detailed_main": "I was not expecting Emraan Hashmi to do such a clean acting, considering the previous 18+ movies he's acted well in. Emraan Hashmi and Vidya Balan looked amazing together; they really made my heart melt, as well as carried out their roles superbly - they got into their characters, and bought a lot of emotions out. The music in this movie is the main reason I went to see this movie, and it was EXCEPTIONALLY EXCELLENT! The direction was amazing, and the ending was well thought out, and well portrayed as well. You'll get out of the theaters with numerous reflections in your mine and welled up eyes. This movie is enjoyable for audiences of all ages, but it's mature in the sense of a love story involving two mature adults."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "dummyuserforsocialiq-03022",
        "review_rating": "10",
        "review_title": "Awesome Love Story!!",
        "review_detailed_main": "Such a romantic movie.\n\nMusic will touch your heart. Dialogues are excellent and sometimes will make you cry. Great Work done by Team.\n\nThis is Mohit Suri's forte and he has elicited a fantastic performance from Emraan , Vidya. In particular this is Emraan's movie , his eyes speak volumes in his scenes.\n\nEmraan Hashmi is speechless this time. You'll love him in every scene. He is totally brilliant in every scene. Vidya Balan is nice too. Rajkumar Rao as expected he always put a smile in audience's face when with his acting. Other supportive actors have done nice job too."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "adeelshifa",
        "review_rating": "10",
        "review_title": "Epic Romance,Marvellous Story and Breathtaking acting on such strong story line <3",
        "review_detailed_main": "What a movie to watch .. !!! i mean mind-blowing, tears rolled down my eyes ! Very well directed ! Emran Hashmi you least Sung hero !!!\n\nVidya almost killed this movie ...\n\nRaj kumar Rao AGAIN PROVING HIS WORTH ...\n\nMohit suri, its one of your best movie till now .....\n\nSongs are awesome...\n\nFull of emotions and love Its family movie too....\n\nAfter watching it believe me you will be stunned !\n\nloving it :) Recommended to everyone !!!!!! Its better than mostly high rated and stupid impractical action Movies, worth watching !!!!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "murtiman",
        "review_rating": "9",
        "review_title": "Mohit Suri Brings Romance Back On Screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "mumbhaaai",
        "review_rating": "9",
        "review_title": "Love - A by-product of Respect, Trust and Understanding.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "pkspnght",
        "review_rating": "10",
        "review_title": "Simply Amazing.Great Performance By All Cast.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "dipsbhalerao",
        "review_rating": "9",
        "review_title": "Movie is so good ...",
        "review_detailed_main": "Movie is so good u can feel the story, romance and the chemistry in it....overall good.."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "sanjk-01793",
        "review_rating": "10",
        "review_title": "Masterclass",
        "review_detailed_main": "This movie is so beautifully made and one of the best movie made in bollywood for a long time. The story, acting, direction and music everything is just pure emotion and beautiful. One of Emraan Hashmi's best ever movie, Vidya Balan is beautiful and brilliant actress and Rajkummar Rao is so underrated and versatile actor. Absolutely love this movie can always watch this everytime on tv."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "mahirawat-68976",
        "review_rating": "9",
        "review_title": "Simple and Best",
        "review_detailed_main": "Emraan Hashmi always won our heart However, In this film his corrector was super good and really powerful. Rajkumar Rao also did well like always. Vidya Balan just wow her beauty simplicity and perfect acting made this movie to another level. All songs music and lyrics was soooo pure and meaningful, Kudos to Arijit Singh voice. They all made it a deadly combination. I really want to go back in past and want to see this movie in cinema and also want to recommend everyone. It is a must watch, No vulgarity you can watch this movie with your family as well. We want films like this with this kind of real talents. Rockstar, Veer Zara, Sanam Teri Kasam and many more like this."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "Canavar-K",
        "review_rating": "10",
        "review_title": "best romantic movie",
        "review_detailed_main": "One of best bollywood movie i ever see. everything is good in this film. emraan rocks"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "saba_waqar",
        "review_rating": "10",
        "review_title": "Beautiful film!!!",
        "review_detailed_main": "The best movie I've watched. Such an intense love story. Beautiful in every sense. If you like action,comedy and silly stuff, people jumping around, cars flying then don't watch this movie. It has a story unlike most of the Bollywood movies made nowadays."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "harishbhojwani",
        "review_rating": "10",
        "review_title": "Heartwarming Love Story !!!",
        "review_detailed_main": "I am watching this movie in 2023 for the first time. I skipped this movie in 2015 for its negative reviews, but something in my mind told me to watch this movie because of the actors. Sheer brilliance by Emraan Hashmi and Vidya Balan. A must watch for Emraan Hashmi fans!!! By the way you will only understand this movie if you have ever fallen in love. Those people who don't have emotions will find this movie boring.\n\nThis movie brought tears to my eyes and goosebumps. Hats of to Mohit Suri for his directorial brilliance and blending of music in this romantic story.\n\nLoved this romantic movie after Ashiqui 2."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "rinkumiah",
        "review_rating": "10",
        "review_title": "Fantastic!",
        "review_detailed_main": "I really loved watching this movie. Great love story!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "sugyanimohapatra",
        "review_rating": "10",
        "review_title": "PAINFUL AND UNFAIR!",
        "review_detailed_main": "I can still recall crying throughout the entire movie, even though I was only a teenager when I first watched it. And I still have a heavy heart when I see the movie. Every time I watch Vasudha and Aarav's love, it kills me not only because of how awful their circumstances were but also because of my rage at realizing that they could never be together. I am aware that the story of a rich man from a poor family becoming richer and falling in love with a typical poor woman was rather cliché, but the performances were simply lovely. Despite the fact that I am a hopeless romantic, I do know what makes a good movie. They could have just let Vasudha and Aarav be together, but they chose not to do so because not all love stories end happily. We always anticipate a happy ending in a Bollywood drama, but that isn't always the case; most of the time, we don't receive what we want or wish. True love is imperfect yet it is just so beautiful."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "blastkohl",
        "review_rating": "9",
        "review_title": "Beautiful romance",
        "review_detailed_main": "Watching as an English reading American in 2020, I first chose this movie based on its beautiful music on YouTube. The music is even more amazing when watching the movie. It really enhances the scenes and the romance. I am very impressed by the beautiful flute and full orchestra complete with violins and harp.\n\nThis movie is full of romance and yearning. The movie was so good that it moved quickly.\n\nI suggest to enhance your viewing and do not understand Hindi, listen to the music with English translation. This movie got a point off for not translating the Hindi into English while singing. It is important overall to understand what these songs meanings are."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "deepakus777",
        "review_rating": "8",
        "review_title": "Not sure why this movie is so underrated",
        "review_detailed_main": "Do go by the meagre votes and the 6 rating, even in 2022 this movie has a nice feel to it. Vidya balan and Emraan hashmi are just too good with the acting and the stellar expressions, Rajkummar is also good too.\n\nWatch it to enjoy love in its true sense."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "yadavnarendra",
        "review_rating": "10",
        "review_title": "boring apple device biggest reason for failure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "Canavar-K",
        "review_rating": "10",
        "review_title": "One Of Best Emraan Hashmi Films Ever",
        "review_detailed_main": "Don't Believe vote or media just watch this film and you gonna know how Emraan Rocks in Romantic roles."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "christinchris",
        "review_rating": "10",
        "review_title": "Piece of Art",
        "review_detailed_main": "One of the best romantic drama made in bollywood.everything is good.. the direction screenplay..cinematography..music ufffff👌👌 Performance of Emraan hashmi damn awsome he just nailed it👌👌 othe supporting casts too good its comletely a piece of art... love it"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "hivinay1983",
        "review_rating": "9",
        "review_title": "Don't call it ADHURI...",
        "review_detailed_main": "If this is Adhuri Kahani, then what do we call Poori Kahani?? Outstanding direction, acting, music, and screenplay ! A form of love that cannot be expressed, but only be felt... Dont miss this..."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "Canavar-K",
        "review_rating": "10",
        "review_title": "One of best emraan hashmi film",
        "review_detailed_main": "I loved this film because everything was great ( Acting, Songs , Story) I didn't saw any spoilers in this filn"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "himanityagi-49895",
        "review_rating": "8",
        "review_title": "A soft romantic film. Loved everything about it.",
        "review_detailed_main": "After a long time, got to see such a nice, fresh romantic movie. The story touched my heart and music is soothing and songs are very well placed. I dont know why I didn't watch it before. Dialogues are somewhere heavy but expected in such movies. Emraan Hashmi is so perfect in such roles. And everybody is a performer in this movie. Narration is done such that it grips the viewer."
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "orendrasingh",
        "review_rating": "10",
        "review_title": "Must Wacth ! to every person who love someone by heart.",
        "review_detailed_main": "Its really an nice movie as i expected before watching it , really enjoyed watching this movie it will definitely going to teach all what true love means in this era as well because the love which is true can never be go under any circumstances.It will always be the voice of your heart bcz that's called true love..Really lovely movie. Must Watch!"
    },
    {
        "movie_id": "tt3483612",
        "movie_name": "Hamari Adhuri Kahani",
        "movie_rating": "6.7",
        "review_username": "lovepreetkaur-35459",
        "review_rating": "",
        "review_title": "Question",
        "review_detailed_main": ""
    }
]