[
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "chandrabhanusolanki",
        "review_rating": "7",
        "review_title": "The pair is cool",
        "review_detailed_main": "If you want to enjoy a movie with laughs and love story with innocence this is the movie for you. The narrative structure of films makes it interesting."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "Peter_Young",
        "review_rating": "6",
        "review_title": "The funny story of a strange love",
        "review_detailed_main": "I went to watch Ajab Prem Ki Ghazab Kahani simply because I liked most of Rajkumar Santoshi's movies. This movie is nowhere as good as some of Santoshi's great films like Damini, Lajja or The Legend of Bhagat Singh, but despite its flaws, it is very entertaining and is thoroughly fun to watch. Yes, it has its clichés and moments of over-romanticism which really get on one's nerves, but the movie works best as a crazy comedy which never dares to take itself too seriously, and that's where it scores. The film is often silly but that's the trick here because everything works in accordance with the film's mood.\n\nSome of the film's comic proceedings were totally great, whether it's the Salman Khan track, the entire party scene, the scenes showing Ranbir's parents and so forth. There were sequences which were unnecessary and did not make sense, such as the entire gangsters track. Where drama and romance go, the movie is good but something is missing, although it had its moments there too. One of the best aspects about the film is undoubtedly Pritam's excellent soundtrack which consists of such songs as the beautiful \"Tu Jaane Na\", the romantic \"Tera Hone Laga Hoon\" and the catchy \"Prem Ki Nayya\".\n\nAs far as acting is concerned, it is Ranbir, Ranbir and only Ranbir who carries the film on his shoulders and delivers a sincere performance. The role itself is actually nothing new or special but Ranbir ably turns Prem into someone who is both funny and easy to relate to. Katrina Kaif is a pretty and attractive lady and overall she is effective within the context of the film, but in terms of acting, though she has her moments, she never really manages to totally convince or impress. Smita Jaykar and Darshan Jariwala, who play Ranbir's parents, are awesome. All said and done, Ajab Prem Ki Ghazab Kahani is not extraordinary, but it's very enjoyable and an altogether fun romantic comedy which can be watched with family and friends."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "prats6",
        "review_rating": "7",
        "review_title": "Cute Movie",
        "review_detailed_main": "First, I did not expect much from this movie to be honest. I was pleasantly surprised. Ranbir does a great job playing a guy who is sweet and simple and is love with Kartina Kaif. The film is different because it has no crude jokes and yet it is humorous.\n\nThe film is set in a sleepy Indian town where Prem (Ranbir) is the president of his failing \"Happy Club\" , which ends up helping couples in love. He meets Katrina Kaif and falls for her, but he does not know that Katrina already is in love with Upen Patel. He does all he can to help her to marry Upen. Watch the film for the ending.\n\nIn between there are witty dialogs, very funny scenes, in special a scene where Prem goes dancing with Jenny (Katrina Kaif). Prem already starts dancing to which Jenny says, the dance has not yet started, while Prem replies, \"I am not dancing , this is just warm up !\" .\n\nA real rib tickler, you will watch this for a pleasant time at the theater. It is a surprise at a time when most Bolly comedies are really filled with double meaning jokes and crude humor, Ajab Prem .., does a really nice job to entertain people.\n\nThe story has its flaws, yet Ranbir manages to pull through and prove he is the biggest rising star in Bollywood. The screenplay was a bit loose but the cinematography was superb. The songs were very well sung and acted.\n\nIn all a nice movie. My rating 7/10."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "ilpintl",
        "review_rating": "",
        "review_title": "Dying is easy, comedy is hard...as proved by this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "rohitrd",
        "review_rating": "6",
        "review_title": "Disappoints mildly, due to my expectations from Santoshi",
        "review_detailed_main": "I can not be blamed for having expectations from a comedy movie directed by Rajkumar Santoshi. This is the man who gave us the always re- watchable Andaz Apna Apna ages ago. So I made a special effort to go see this movie after being impressed with the trailers. Given that I watch only a handful of bollywood movies, I am not sure I made the right choice. The movie is set in realms of fantasy, so I do not have any complaints about it being realistic or plausible. What did disappoint was the use of every single cliché' in bollywood tradition - orphan girl, good-for- nothing hero with a shinier-than-gold heart, the standard sets of parents, the underworld don and so on. They could be interesting if used for coming brilliance, but here they just feel forced. The dialogues seem to be written on auto-cue. Characters pop-in and pop-out at convinence. Apart from the leads, the characters are way short of achieving even a one-dimension target. The thing is though, I still enjoyed the movie. I guess its down to a couple of factors - and the most important one is the lead pair. Ranbir and Kat look great, act well (even with her acting limitations) and really make you root for them. There are a few comic moments done effectively, and the pair take a lot of credit on delivering them effectively. Secondly the music and background score are really good and carry the gaps in the plot forward without dragging too much. All in all, maybe recommended for a family outing, given my 5 yrs old enjoyed the physical comedy."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "rajandey",
        "review_rating": "6",
        "review_title": "Decent: not fit for 2009",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "akshatmahajan",
        "review_rating": "7",
        "review_title": "Entertainment",
        "review_detailed_main": "It was one of the best comedy and entertaining movie of 2009.. Well story is completed but then also I want it's sequel...Overall it's ENJOYFUL FAMILY MOVIE.."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "csadangi",
        "review_rating": "3",
        "review_title": "Didn't meet ma expectations",
        "review_detailed_main": "OK people here is the first review of this movie. A long awaited movie by many people. watched the flick because of Ranbir Kapoor and Katrina Kaif waster 175/- for the premiere and to say that the movie didn't match the expectations. There are some comedy scenes like Ranbir dancing so that he can be the dancing partner of Katrina which is hilarious.\n\nOther than that some scenes have been copied from Andaz apna apna, like the Don falling from the stairs and the final climax scene ( if you remember Andaz apna apna then Gogo fell down from the stairs ) Songs are good especially Tu jaane Na... Beautifully pictured."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "raheelsiddiqui",
        "review_rating": "10",
        "review_title": "A movie very close to my heart...",
        "review_detailed_main": "I consider it the best film of Ranbir... Far away from logics and justifications... This film is like a sweet dream which u want to watch again and again"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "vickykolari",
        "review_rating": "6",
        "review_title": "A fun ride (+62%) - Short review",
        "review_detailed_main": "This one is only for the hardcore 'Andaz Apna Apna' fans, this is a sub-genre of slapstick comedy and not for everyone. Raj Kumar Santhoshi is at it again, with witty quirky dialogues and situations, it is a fun ride but definitely not as fun as Andaz Apna Apan, this will not have such cult following.\n\nThe dialogues are very witty and also rhyming, with similar over-the-top performances that are required for this kind of movie. Foot-tapping music and good performances from all, especially Ranbir who can do wonders for any role. As usual, Katrina can't act or can overact, but surprisingly, this role suits her because this requires some overact.\n\nI rate this 62%.\n\nWATCH IT, only if you like Andaz Apna Apna or a hardcore Ranbir fan.\n\nIts a Hindi language movie, and is available to stream on Amazon Prime (As on April, 2020) with English subtitles."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "stark_reality",
        "review_rating": "1",
        "review_title": "was this funny?",
        "review_detailed_main": "when you watch a Hindi movie especially a comedy movie i know not to expect much of a good story.But this movie tested all the limits,i mean what was this all about,was this funny at all.There should be some story for keeping the audience interested , do the filmmakers even care for it.The characterization was horrible, and there's not comic relief whatsoever except for 2 or 3 scenes.Why cant the Hindi film industry make at least one intelligent or forget intelligence at least completely entertaining comedy movie in the likes of hera pheri. Please i suggest to all of you don't watch this movie and get bored and waste your money.The are some many other world movies worth watching. Help your self by not watching it."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "AishFan",
        "review_rating": "8",
        "review_title": "Ranbir rocks in this fun rom-com!",
        "review_detailed_main": "This movie is great fun--Ranbir is easily the show-stealer! He has acted superbly and is definitely on a winning streak! He has given great performances in all of his films--from Saawariya and Bachchna Ae Haseeno to Wake Up Sid and APKGK--even though all characters are quite similar (happy-go-lucky romantic fools who love life). Ranbir pulls off this role with excellent comic timing! Katrina looks really beautiful, while there's nothing really to mention about her acting. Upen is just okay. Salman's special appearance is a fun scene. Prem's parents also gave wonderful performances. Songs are great, especially Pyaar Hua. The music video of Tu Na Jaane is also really nice. The only thing I didn't like about this film are the sequences with the don and gangsters, which had pretty dumb humor. Those scenes had no importance and were only a deterrent to the film. Other than that, the film is a fun one and belongs to Ranbir."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "Pratik112",
        "review_rating": "7",
        "review_title": "Worth Watching Once.",
        "review_detailed_main": "Having known that this was a romantic comedy, it was a bit of a let down. A no good for nothing son, who operates a club from his father's business premises, accidentally falls in love, while trying to help his friend.\n\nStarring Ranbir Kapoor, Katrina Kaif, Upen Patel, Darshan Jariwala, Smita Jakar, Zakir Hussein and Mithilesh Chaturvedi, while Salman Khan does make a special appearance. This is directed by Raj Kumar Santoshi and is produced by Ramesh S Taurani while Pritam provides the music score.\n\nRanbir Kapoor has, again, definitely shown that he is talented by attempting a good performance in romantic / comedy movie genre. He is like a likable rogue. Katrina Kaif, has made a good attempt in such a genre movie. But it is a bit hard not to imagine her from her previous roles. But never the less, she has made a good attempt at this. Salman Khan's appearance, though brief does create impact regarding the comic situation but I felt that there was no need for that as the director and the producer could have taken it from another angle.\n\nMany of the comic situations are predictable and therefore a bit of a let down there. But Pritam's music score is worth listening to as are some of the songs. This is a film that can be viewed with family members and is worth watching at least once."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "mv2702",
        "review_rating": "2",
        "review_title": "Rotten",
        "review_detailed_main": "After the first five minutes I thought about switching this off. Juvenile jokes, which a 14 year might find slightly childish, were the order of the day. But I decided to persist with it. Silly me.\n\nAfter seeing 'Wake Up Sid' I had high hopes for Ranbir Kapoor. But he really needs to be a bit more choosy. If this movie was aimed solely for school children then fine. However I fear it was not.\n\nThe film reached its nadir with the entrance of the Don character. Cue 'hilarious' misunderstandings and slapstick violence of the worst kind.\n\nKatrina looked cute, as she always does, but in acting terms there was not a lot going on from her. But in a movie such as this you can't really blame her.\n\nI fell asleep before the films conclusion, but I wish I had nodded off a lot earlier..."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "kunalkhandwala",
        "review_rating": "",
        "review_title": "Refreshingly funny light entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "sniperswagat",
        "review_rating": "6",
        "review_title": "'Ajab' Prem ki not so 'Ghazab' kahani",
        "review_detailed_main": "Given the hype and promotion surrounding the release of this movie, not to say anything about the rumors surrounding the lead pair; you would have to have been living in a cave for the past few weeks not to have heard about this one. So, what is this Kahani all about, and is it worth a watch? Prem(Ranbir Kapoor), a simple small-town guy, runs a Happy Club in the town with his bunch of cronies. He stays happy and lives life to the fullest, uniting distressed lovers and getting scolded by his father and shielded by his mother, something seen in countless Hindi movies. Prem's life turns topsy-turvy when Jenny (Katrina Kaif) comes to town and he falls for her immediately. As the two get acquainted with each other, a series of incidents follows, some humorous, others romantic. Just when Prem starts to think about settling down with Jenny, she tells him that her boyfriend (Upen Patel) is waiting for her. Heartbroken, he sets out to unite the two, as that is the right thing to do. There's nothing too 'ghajab' about this kahani, honestly speaking.\n\nThe screenplay increases the quality of the product a little, embellishing it with dialogues and situations that sometimes make it hard for you to stifle a smile. Cases in point, the Saawariya spoof, the Katrina top incident and the ball dance.\n\nRaj Kumar Santoshi attempts a new genre in Ajab Ghazab, the rom-com. People have harkened back to Andaz Apna Apna, but the two films are as different as chalk and cheese. While Andaz Apna Apna was a slapstick comedy that would have gone wrong in a less experienced director's hands, this is a romance with parts of comedy that has been the main bread-earner of studios like Yash Raj. Santoshi slips into this mode effortlessly, and nowhere does it seem like this is his first attempt. The problem is, unlike the screenplay that did add to the movie, Santoshi's direction does not add to it. He just plays out what he got like how he got.\n\nRanbir Kapoor is a class act. This is yet another movie where he performs brilliantly. He rises above the average story and actually makes it work. Be it the comedy scenes, the romantic scenes or the dances, he does it all with aplomb and charms the females in the audience while he's at it. It's fair to say then, that this movie would have failed without him. This Prem is surely 'Ajab-Ghazab'.\n\nKatrina Kaif has grown better as an actress with time. Watch her in APKGK, and compare it to her earlier works and you'll see the difference. She may not be the finished article yet as far as acting goes, but she's getting there. And she looks STUNNING! Sigh. The supporting cast, featuring Smita Jayakar and Darshan Zariwala as Prem's parents, Govind Namdeo as Upen Patel's father and Zakir Hussain as a madcap gangster, does a commendable job. Upen Patel expectedly disappoints, and you wonder if he was meant to.\n\nPritam delivers another hit soundtrack with APK\u0085 The songs fit well with the narrative and don't jar on your ears. Main Tera Dhadkan Teri, Tera Hone Laga Hoon & my favorite, Tu Jaane Na are all chart-busters. The Salim-Suleiman duo does a decent job with the background score. Goofy and romantic sounds expectedly fill the background for most of the duration of the movie.\n\nThe cinematographer does a good job of showing us the small-town. After all, there are only so many ways you can portray the same city on celluloid. The editing is good and consistent, save for one occasion when Katrina is suddenly shown to have been kidnapped. To be fair to the filmmaker though, it could have been deliberate. The visual effects, though present for only a short duration, are good.\n\nFinal Verdict: Despite claiming to be a 'Ghazab' kahani, APKGK is a run-of-the mill rom-com that only rises above the regular product courtesy of the great performances and taut direction. The end result: it's a one-time watch for the excellent performances."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "Full-On Timepass.....",
        "review_detailed_main": "Accomplished Filmmaker Rajkumar Santoshi, who has delivered true classics & box-office blockbusters... is back with a bang with 'Ajab Prem Ki Ghazab Kahani'. A hilarious film!\n\n'Ajab Prem Ki Ghazab Kahani' is escapist cinema, where the word SENSE does not exist, to be honest it's like an alien to the dictionary it follows. A film where Entertainment is the question, not Enlightenment. I enjoyed the film, and I have no regrets giving 3 hours of my life to this film.\n\nRanbir is excellent, finally proving his potential. The youngster plays Prem with ease & makes you laugh without making weird or cheap faces. Katrina is okay, though she looks angelic. Upen Patel is wasted. Navneet Nishan is as usual. Darshan Jariwala and Smita Jaykar are lovable as Ranbir's parents. Govind Namdeo is passable, while Zakir Hussain hams the comical-bad guy. Pradeep Kharab who plays the role of Tony, is honest. Salman's appearance is fantastic.\n\nWatch this Ghazab entertainer, keeping your brains at home. Thumbs Up!"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "CyberPunkAJ",
        "review_rating": "7",
        "review_title": "Typically Bollywood but enjoyable",
        "review_detailed_main": "Well, the kind of movies bollywood is churning out these days, I wasn't expecting much. There is nothing new about the story, but if you want to have some fun, you can watch this movie one time at least. Ranbir was very good and his comic timing was good. Katrina was very average. Other characters did justice to their roles. Not much to talk about in this movie, but some good laughs are surely there.\n\nOne thing I must say is Katrina is still struggling with both her acting and Hindi. Seriously, no Christian girl talks like that.\n\nAnd Upen Patel was spoiling the humor in the movie.\n\nFor Ranbir fans, this is a good movie to watch."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "psood74",
        "review_rating": "4",
        "review_title": "Predictable, unfunny movie",
        "review_detailed_main": "The movie came hyped but the experience was a big let-down. Leave aside a few good visual scenes and jokes, the overall movie was a disappointment.\n\nThe good scenes: The bicycle with balloons falling into the lake, Prem's dancing at the wedding.\n\nOther than that, the jokes were tired, the characters were one- dimensional with no character or story development. Other than the pre-ordained destiny of the two main characters (Prem and Jenny) there was nothing else to anticipate. When the intermission happened, I was actually wanting the movie to end. The whole story line with Rahul was tacked-on just to extend the length of the movie.\n\nActing wise, the role of Prem was well-acted for a comic role but stammering does not equal emotional acting. The rest of the acting was average.\n\nThe songs were generally forgettable - I don't remember any of them less than 12 hours after watching the movie."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "madbhoot",
        "review_rating": "10",
        "review_title": "Finally!",
        "review_detailed_main": "Well I didn't expect too much from this film. Its a romantic comedy for sure. We could see that from the trailer. These days I don't expect too much from a Hindi film.They have a huge star casts, excellent location, beautifully pictured songs, but they lack in story and editing. But i can say after \"Love Aaj Kal\", this year APKGK is a treat to watch. I am not saying its a perfect film, but its a pleasure for heart. If you want to have a good laugh then APKGK is the film for you.\n\nAfter a long time I found that in a Hindi film which is not trying to portray its surroundings real. You know from the first scene that its a fiction. R.K Santoshi made it very clear.Its a movie where anything can happen and they don't want to make you believe its real. Its up to you to believe! I am not going to compare it with Andaz Apna Apna. It was one of a kind.\n\nThere is no Amir Khan and Salman Khan in APKGK instead we have this Ranvir Kapoor with amazing comic timing! He was superb in the film! Reminded me of Hrithik Roshan in Kaho Na....! Ranvir was so fresh and his chemistry with Katrina Kaif was wonderful! Bollywood have a new on screen couple who compliments each other. And I figured it out later that there is no romantic scenes (except two songs and a conversation in dream!) between the two, but they looked amazing whenever they were together.\n\nAnd the nicest thing about this movie is its decency! Mr. Santoshi (he is also the co writer) didn't use \"sex\" or \"homosexuality\" for comedy! Bollywood should learn!\n\nSongs were really nice! Pritam did a good job! I fell in love with the song \"Tera Hone Laga Ho\" and \"Tu Jane Na\". Katrina looked really pretty and real for the first time.\n\nIt was a nice film with an amazing cast(including the supporting actors, except Upen Patel!). Amazing locations (Goa and Ooty looked awesome)and amazing punches! Its a comedy after all!"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "saradag-76681",
        "review_rating": "7",
        "review_title": "A GOOD ENTERTAINING LOVE STORY",
        "review_detailed_main": "After getting bored from current time movies I thought to explore my childhood bollywood movies and it's worth the time. One sided lover can easily relate with prem, it's really hard to say someone how you loved them.\n\nI don't that two of my favourite music 'TU JAANE NA' and 'TERA HONE LAGA HOON' is from this movie. So, it's feel good while watching the movie.\n\nIf you're thinking that there would be lot of romance and kissing scenes in the movie as it's a love story, I can tell you that you might be disappointed but surely if you watch it you'll not regret it's full of comedy.\n\nOverall this movie is very good family entertainer and it's teaches a valuable lesson, Love doesn't mean you have to get him/her. It means what you can you do for the happiness of your loved ones which sometimes need to be get apart from them."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "milind00",
        "review_rating": "1",
        "review_title": "really bad one",
        "review_detailed_main": "There is no storyline, bad and very cheap sequences. Don't go to this movie unless you just want watch Katrina. I went to this movie looking at the TOI rating. I don't understand how come they rated such a bad movie at 3.5. I am not sure if TOI rating is unbiased anymore. Have they started taking money from the producer? I met few of my friends and who also felt the same. Everyone is fooled by TOI this time. I would recommend stop following TOI rating any more. I don't really want to get fooled again. Is there any way we could get unbiased rating of the movie?\n\nThere is no storyline, bad and very cheap sequences. Don't go to this movie unless you just want watch Katrina. I went to this movie looking at the TOI rating. I don't understand how come they rated such a bad movie at 3.5. I am not sure if TOI rating is unbiased anymore. Have they started taking money from the producer? I met few of my friends and who also felt the same. Everyone is fooled by TOI this time. I would recommend stop following TOI rating any more. I don't really want to get fooled again. Is there any way we could get unbiased rating of the movie?"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "deepanshudagar",
        "review_rating": "10",
        "review_title": "Comedy. Romance. Thriller. Music. 10/10",
        "review_detailed_main": "It is one of best movies ever made. I can watch this movie 100 times."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "sauravjoshi85",
        "review_rating": "6",
        "review_title": "Was expecting much more from the legendary director!!",
        "review_detailed_main": "Ajab Prem Ki Ghazab Kahani is a romantic comedy film directed by Rajkumar Santoshi. The film stars Ranbir Kapoor, Katrina Kaif, Smita Jaykar, Darshan Jariwala, Upen Patel, Govind Namdev, Dolly Bindra, Late Mithilesh Chaturvedi, Navneet Nishan, Zakir Hussain and Rana Jung Bahadur.\n\nPrem falls in love with Jenny, a woman who is already in love with a man named Rahul. Despite this, he agrees to help her marry him and even gets into several comical situations as a result.\n\nI have read many reviews where people were going gaga for the film as if this is one of the best comedy films ever made. To be honest this is an above average comedy film and why above average because when you reads or hears the name \"Raj Kumar Santoshi\" your expectations suddenly increases but this is not the finest work of Raj Kumar Santoshi considering his past works.\n\nThe plot of the film is good but not fresh as few of the reviewers said and the execution is above average to good. It seems that only Ranbir Kapoor was playing his part with dedication as the talented ones were completely sidelined and were given very minimalist of opportunity. There are very few outright comedy scenes and apart from the climax and some funny scenes the comedy in between, the film is blend. The music and songs of the film is superb and probably one of the reason for the super success of the film.\n\nIn acting department the credit should only be given to Ranbir Kapoor for his mind-blowing acting and probably he is the only reason to watch the film. Katrina Kaif is a terrible actress but was decent in this film. Talented actors like Darshan Zariwala, Zakir Hussain, Govind Namdev, Smita Jaykar, Navneet Nishan and Late Mithilesh Chaturvedi with Rana Jung Bahadur were completely sidelined and were impressive in their limited screen space. Upen Patel is a pathetic actor and this film proves again.\n\nOverall and above average comedy film can be watched once."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "bobbysing",
        "review_rating": "4",
        "review_title": "Ranbir excels but the film doesn't.",
        "review_detailed_main": "One of of my favourite directors Raj Kumar Santoshi, known for his admirable story telling skills returns on the screen with a romantic comedy featuring Ranbir Kapoor & Katrina Kaif. There are huge expectations from the three and everyone is looking forward to witness another applaudable comedy on the lines of Santoshi's highly appreciated \"Andaz Apna Apna\". The promos are exciting and the songs are good. Hence, the stage is all set for just another blockbuster of the season from the maker of brilliant movies ranging from \"Ghayal\" & \"Damini\" to \"Pukar\" & \"Halla Bol\".\n\nBut now after watching the latest project from one of my most admired directors, I remember a phrase which I don't believe in really, but is often used by the artistic people in the creative field. It is called \"CREATIVE BLOCK\" which refers to a phase in the life of creative people where they are not able to create as per their own set standards and come up with some shockingly underworked projects which were completely unexpected from a person of their status. \"Ajab Prem Ki Ghazab Kahani\" exactly falls in that category. Starting with a deliberately created comedy sequence, the movie clearly gives you an idea that it is not going to be what was being expected. And as the clock moves on you realise that this time Santoshi has delivered the weakest movie of his sparkling career.\n\nSurprisingly, the film has got nothing before intermission except the sincere, skillful performance of Ranbir and glamorous looks of Katrina. There is neither any story development in progress nor any well defined characters on the screen as normally seen in the previous works of the director. Till intermission only the love angle is visible to the viewers and one keeps on wondering that where the hell is movie heading towards. Besides this, when the real plot unfolds, it has no surprise element, since you have already guessed it without any serious efforts. Further it was also quite hard to understand that what was so \"Ghazab\" (great) about the storyline in the movie as mentioned in its title.\n\nPost interval, with the introduction of few new characters, the movie even slides down further mainly due to its disastrously weak writing. In fact there are only few hilarious scenes having the exclusive Santoshi touch towards the climax of the movie. But even those are very few in quantity, compared to the movie's enormous promotional campaign emphasizing on comedy. Moreover, the final sequence in the Don's den is also similar to the one seen in \"Andaz Apna Apna\" but it greatly lacks in content.\n\nThe movie has only one performer throughout and he is Ranbir Kapoor at his best. Giving an excellent notable performance, he simply shows that he knows his job very well. Katrina on the other hand has got nothing great written for her in the script. So she remains there as a pretty face in the movie who his capable of giving much better to a project. The rest of the entire cast completely fails to make any kind of impact on the viewer, which is not a routine kind of feature in a Raj Kumar Santoshi film.\n\nIn addition to this, Santoshi also makes many strange and bizarre kind of moves in his current offering which raises enough doubts on his whole hearted involvement in the project. For instance, the confusion over the city in which the story is staged, the short cameo of Salman Khan in the first half, the un-necessary stammering act of both Ranbir & Katrina, the broken English dialogue scene of Ranbir and the surprising entry of a character resembling Jesus towards the end. Actually speaking, all these scenes don't seem to be directed by the Santoshi we know from so many years (who can also be spotted in a scene with Ranbir). He may not have tasted success in most of his previous projects, but there has never been a BAD Santoshi film as APKGK.\n\nMusically, it does have some good numbers, well arranged by Pritam, which are widely being appreciated by the youth. But the soundtrack is surely going to be judged by the performance of the film. Cinematography serves the purpose well but it's really sad to see that we still have to move on to the hill stations and snow-mountains to film a romantic song featuring the lead. But actually, the main culprit here remains the writing department which takes everything back to the mediocre levels.\n\nIn the end, I would like to add that \"Ajab Prem Ki Ghazab Kahani\" is a very casual kind of effort from one of best directors of Bollywood. It can only be seen for the outstanding contribution of Ranbir. But let's take this movie as a result of an unproductive phase in the career of an immensely talented director. And let's pray that he gives us a much better and polished product next time which can stand tall among his other masterpieces of the past.\n\nRating : 1.5 / 5 (Very unexpected disappointment from one of my favourite film-makers)"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "mail-hv",
        "review_rating": "",
        "review_title": "best 2009 bollywood comedy - andaz R.K.Santoshi ka!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "sohamvhadgir",
        "review_rating": "6",
        "review_title": "Entertaining movie",
        "review_detailed_main": "So watching this type of movie feel and gives us chill comedy is good it's just movie which gives you happy and loves vibe this movie totally comedy and romance which good if you want watch something then this will definitely work I like this movie because I want something different and it's work acting is amazing now this type of movie is not getting old Bollywood was something different we want such movies now also song are good it's feels nostigia listening Atif aslam and if you find logical in this movie then don't watch this is for entertainment purpose movie but I don't like last part so for me it's just entertainment movie."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "Sherazade",
        "review_rating": "2",
        "review_title": "When will Katrina Kaif stop acting?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "ashkg2001",
        "review_rating": "8",
        "review_title": "Very romantic, like a dream.",
        "review_detailed_main": "Go for this movie without any expectations, then you will like it.\n\nThis movie is taken like a dream. All the scenes are shot in an unnatural color and contrast and all the dialogues are unnatural as well. Many of friends who like normally those movies which have more natural touch, did not like this movie at all. But if you are ready to take this movie as a sequence of sweet, soft and dream like scenes, then this is surely a movie for you. Trust me you will like it.\n\nThe best scene of the movie is when Katrina reveals about her love to Ranbir, he gets shock of his life time and he keeps his hand on his chest and falls down from the balcony. This scene is shot with one of the best camera angle I have seen. I just loved the scene.\n\nThe background score and songs are really brilliant. For awards, if they consider those who make the songs close to the mood of the movie, then Pritam, Salim Sulaiman, Irshad Kamil, Ashiesh Pandit and Hard Kaur really reserve recognition for this work. The songs and background score are very well mixed with movie.\n\nKatrina Kaif performed her role very nicely. Always, when it comes to a doll like character, Katrina is a safe bet (as long as there is not much emotions to be expressed). Ranbir also did the role quite good. But I some how have a problem with his body shape. Since he is having very thin waste, he looks like a triangle pointing down with a head on it, in some dresses. Either he should reduce the mass on his hand muscles to like thinner on top also or he should be careful with his dress selection. Other actors were also OK in the movie. Nobody did anything wrong.\n\nOnly one scene which I did not like at all in this movie was the scene in which all these guys trying to convince Upen Patel's father for his marriage using a lot of blood. That scene was quite boring and irritating and was very long as well.\n\nI am going to give a 8 on 10 for this movie, since I really liked it. I have an advice, try to see this movie only if you are a person who does not look for real life inspirations in movies, other wise you are going to hate this movie like anything."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "akeelmerchant",
        "review_rating": "1",
        "review_title": "What the......",
        "review_detailed_main": "One of the worst movies ever made. At the same caliber as Om Shanti Om, Dhoom 2 and My Name is Khan. What was the director thinking making this movie. Plot was clichéd...if you even call that a plot. Acting was terrible especially Katrina Kaif's. Only 2 songs were good. Rest was total madness. I just cannot fathom how this movie became the 3rd highest grossing movie of 2009. I barely mad it watching the entirety of the movie. I just wanted to turn it off...what kept me going was a big MAYBE...maybe it might get better. But it kept getting WORSE. Please don't waste your time on this. Watch only if you like movies like Om Shanti Om."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "milleniumstar2007",
        "review_rating": "8",
        "review_title": "A fresh comedy film...",
        "review_detailed_main": "Go and watch this film if you are supposed to see a fresh comedy film of this year... Rajkumar Santoshi has really made a film watchable with family in the time when comedy meant adult comedy only!!!He again showed that he is full of talent after giving flop films. He worked really well. The heart of the film is the chemistry between Ranbir Kapoor and Katrina Kaif. They both are just outstanding in the film. It doesn't seen in the film that Ranbir is a new comer in the industry. It was said for Kat that she is beautiful but not a good actress. She got chances and again she proved herself in this film that she is a good actess also. Both Ranbir and Katrina are youth icons. If you are crazy and young then don't miss this film."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "itsaryanpatil",
        "review_rating": "4",
        "review_title": "How bad a film gets rewatching 10 yrs later",
        "review_detailed_main": "I remember watching this film multiple times when I was a kid like 6-7 yrs. I don't know if it was becoz of the comic aesthetic or Katrina Kaif. But watching it again now. It is just so bad. Though not everything is bad, Ranbir Kapoor got a bad script but his acting is actually good. The songs are good and memorable, another reason for which I might have rewatched it. Katrina looks good but acting is way too low. It is too problematic too but at the same time adds a few woke elements (even unrelated) to sympathise itself or something. The comedy is low level. There is hardly any intelligence to it. It is predicateble as hell. The other actors r even forced to act loud which makes it gross. From the get go, it treats its characters like worthless pieces of story just to try hard to get a laugh. I hardly chuckled except ig during some songs and the picturization. This was just bad. I am disappointed at my younger self for rewatching this so many times. And if it is becoz of the heroine then yeah I am a simp."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "hossainbidduthossainbiddut",
        "review_rating": "10",
        "review_title": "good movies ajab prem ki ghazab khani",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "abuzar-84887",
        "review_rating": "10",
        "review_title": "💕",
        "review_detailed_main": "Best movie to have spend some joyful hours. It gives us emotions and laugh. Some of its funny scenes are love."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "papanloveu",
        "review_rating": "9",
        "review_title": "Mind blowing Romance!!",
        "review_detailed_main": "Gazab comedy, this one. Really, Ranbir is a revelation, Katrina is full of beans and the newly formented Ranbir-Katrina chemistry sets the screen on fire."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "Rishabh1804",
        "review_rating": "9",
        "review_title": "A Must Watch,at least for cine-goers",
        "review_detailed_main": "So the film starts in a rather in-apprehensive manner but as ten minutes pass the movie starts rolling and in a couple of minute u find yourself rivoted to the seat,all credit to Ranbir Kapoor for his rather Legendary performance,and when Katrina kaif comes....oh she is a beauty in the film...she has rightly been given a role of a Christian for her inability to speak proper Hindi.... Also comes in this great movie package is Salman khan,Upen Patel...and many others....but as i have said earlier this movie is all about Ranbir no one else...he has turned from an amateur in Saawariya to a Pro in this movie....u ll see yourself laughing really bad at certain scenes....and also it has some very good emotional moments.... Add all this what u get is a movie which seems so real yet so unrealistic...barring some fighting scenes where u ll find people flying all around....its a great movie....good enough to watch 2 times without a headache....not a Andaaz apna apna comedy but almost reaching its level at some points....which in itself is pretty Hilarious!!!....surely watch this movie....A MUST!!!"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "Alishahchat",
        "review_rating": "8",
        "review_title": "A good romantic comedy film",
        "review_detailed_main": "Rajkumar Santoshi has given the bollywood film industries a lot of serious films over the last couple of years for e.g Family: Ties of Blood, Halla Bol etc. But now he returns to make another comedy flick in the form of Ajab Prem Ki Ghazab Kahani. his early comedy film which was Andaz Apnaa Apnaa was a great hit and is one of my favorite comedy movies of all of time. The same however cannot be exactly said about APKGK but it is still a very good effort on the part of santoshi.\n\nRanbir kapoor once again proves why acting is in his blood by giving another show stealing performance he play the character of prem so well that you will end up falling in love with the character by the end of the movie. Katrina Kaif also proves why she is one of the best bollywood actresses of this generation with her performance in this film and new york she proved that she can play both a comic and a serious role in a film. The supporting cast also does a fine job Upen Patel was decent he was not involved enough in the plot enough to get any big sort of recognition. Govind Nao was OK still feel like his character was completely destroyed in this film however the people who played Prem's friends and his parents still deliver good performances.\n\nThe plot of the film is decent it is just another love story between a boy and a girl who meet, become JUST friends and the boy suddenly falls in love with the girl but can't confess, the girl loves him but she doesn't realize it and finally does after the boy leaves her forever and she misses him and feels lonely that is when she realizes that she really loves him. Well at least the plot is not a rip off of another romantic film which the bollywood industry seems to do very often.\n\nThe comedy is silly and over the top but it will make you laugh and entertain you nonetheless. Santoshi proves that he will go to any limits to make his audience laugh and entertain them. It is very hard to make the audience of this generation laugh very easily, silly over the top comedy wouldn't work so well but this film will still make you laugh more than any other comedy film has done in the last few years. the romance is the film is only captured during two songs during the movie and the dream sequence between Ranbir and Katrina and by the end of the film. But the on screen chemistry between the lead couple is fantastic.\n\nALl the songs in the movie are awesome apart from Prem Ki Nayaa which is decent. All the songs in the movie have beautiful lyrics and music and amazing singers like Javed Ali and Atif Aslam. The soundtrack of this movie is definitely one of the finest Bollywood movie soundtracks to come out this year.\n\nOverall APKGK is very good film which has a very good and funny first half but pales and drags in the second, the comedy is still over the top and silly but will still make you laugh, there is not much romance in the movie but the on screen chemistry lives up for that. So overall i would say despite its flaws this was a very entertaining and good movie and one of the better bollywood movies to come out this year.\n\n8/10"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "Lifeboy0007",
        "review_rating": "",
        "review_title": "If you are going to Watch the movie , It will make you laugh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "chansar86",
        "review_rating": "10",
        "review_title": "Great",
        "review_detailed_main": "Great great great great great great great great great great great great great great"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "arpitjawa",
        "review_rating": "",
        "review_title": "Tthe Dawn Of Retarded Comedies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "shahrukhullahkhan",
        "review_rating": "8",
        "review_title": "Nice comedy",
        "review_detailed_main": "Nice and sweet romcom. I loved it back in 2009. It's purely an entertainment film."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "sarthakbharad2926",
        "review_rating": "8",
        "review_title": "This is romantic-comedy at it's absolute perfection.",
        "review_detailed_main": "I don't know what to say about this. I absolutely love every bit of this film.\n\nFor starters, this film sticks to it's core concept and doesn't deviate from it for one bit. You have the instantly likable protagonist who is not perfect at whatever he does but has a good heart. Then you have the beautiful and sweet love interest who our hero is head over heels for. The movie goes on with sweet musical choices that make you feel better and provide you with comfort along with a few twists and turns which makes life miserable for both the characters. In the end is the climax where you know it's bound to happen but you just don't know how because the movie made you feel like all hope is lost.\n\nNow, this film has all these tropes accounted for, but what it brings to the table is the incredibly talented presence of Ranbir Kapoor (who is bound to make you laugh, fall in love and also make you cry with a crushed heart) along with a really crushing twist which is so so so unexpected that you're bound to get hit the moment it reveals itself. You relate to the character of Prem so much at one point in the film that you just can't bear to watch the sight of him hiding his emotions just to make things better for his other half. I was literally bursting into tears when Jenny (Katrina Kaif) calls out Prem at a certain point in the film for not experiencing that feeling. I don't know man, call me an amateur but this film really resonates with me on a much more personal level.\n\nThe songs in this film are just perfect and their placement is just chef's kiss. All of them, not even a single one feels out of place, especially the one which plays after the scene I mentioned above (the way it starts and Ranbir's performance in that particular moment just sold me on his talent).\n\nAs you can probably tell, Ranbir is obviously the star of this show but Katrina also works beautifully according to the story. I would've preferred someone else over her but she gives a decent performance according to the script that was given to her. She is this cute, sweet and likable love interest which you makes you feel that she and the protagonist are obviously made for each other. Other performances are also pretty good considering this is a rom-com and over the top stuff is just the right amount.\n\nThe one drawback which isn't really one when you think about it is the plot at the end gets a little bit absurd and tries to go above and beyond but happens so fast that you don't have enough time to process it. I don't want to spoil it much but it involve gangsters and guns (just that).\n\nI would definitely recommend watching this beautiful film with your family as it really plucks some heartstrings. Be prepared with tissues though."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "arpit-garg",
        "review_rating": "",
        "review_title": "The legend of Santoshi!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "aarishlncts",
        "review_rating": "10",
        "review_title": "best movie ever",
        "review_detailed_main": "Fully enjoyable movie cant get bored if you see 100 times fully entertaining and emotional want more movie like this so that i can enjoy"
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "bharathkalyan-00107",
        "review_rating": "10",
        "review_title": "On april 1st week 2010, last day of exam, came to home and watched this movie in B/W TV...",
        "review_detailed_main": "The story, screenplay, dialogues, direction, performances, production quality and my god that music is everything at top notch, hats off the whole team, every age group people goona love this movie, and my god the climax, is very emotional !!! This movie very special to movie...."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "",
        "review_title": "No ghazab story in this movie because the story is predictable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "apexm-23425",
        "review_rating": "10",
        "review_title": "Funny love movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "sayamasjad",
        "review_rating": "10",
        "review_title": "A Delightful Romantic Comedy",
        "review_detailed_main": "Ajab Prem Ki Ghazab Kahani is a delightful romantic comedy that is sure to put a smile on your face. The film stars Ranbir Kapoor as Prem, a carefree young man who falls in love with Jenny (Katrina Kaif), a bubbly and vivacious woman.\n\nOne of the highlights of the film is Ranbir's performance. He perfectly captures the innocence and charm of Prem, and his comedic timing is spot on. Katrina is equally delightful as Jenny, bringing a cool and collected energy to the role.\n\nThe humor is well-balanced, with plenty of lighthearted moments that are sure to make you laugh. The film also boasts some impressive dance numbers, with Ranbir showcasing his impressive moves.\n\nOverall, a fun and entertaining film that is well worth a watch. The songs are also excellent, adding to the overall enjoyment of the film. If you're in the mood for a feel-good romantic comedy, this is definitely the movie for you."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "silvan-desouza",
        "review_rating": "",
        "review_title": "Nothing great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "kr-66097",
        "review_rating": "9",
        "review_title": "Nostalgic movie",
        "review_detailed_main": "The film is far superior. Possibly one of the best Bollywood films. It's one of those films that you could watch 100 times. The performance of Katrina and Ranbir is great, as is the acting of the entire cast. The film exudes an aura. Ranbir Kapoor's best film. Excellent funny timing. Beautiful story. Fantastic movie sets."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "emonnn",
        "review_rating": "10",
        "review_title": "Masterpiece Movie",
        "review_detailed_main": "One of the best comedy , romance centric movie I loved the movie and it is worth your time.\n\nStory line was great but the comedy and rabir's acting was unbeatable must watch movie for everyone."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "saibal_ban",
        "review_rating": "",
        "review_title": "Its Highly Recommended.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "Raja79",
        "review_rating": "9",
        "review_title": "When Bollywood Was Bollywood",
        "review_detailed_main": "This movie is from that time period when Bollywood used to be The Real Bollywood, when it used to make entertaining amazing movies!\n\nThis movie is also very entertaining and nice, and the songs are AMAZING!\n\nShining in the setting sun like a pearl upon the ocean~~ Tu Jaane Naaa~~ The songs are simply GREAT."
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "mokshjuneja",
        "review_rating": "",
        "review_title": "Ajab Prem Ki... Where is the Kahani",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "abhi_devilk2",
        "review_rating": "",
        "review_title": "First Look",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "coolzain_me",
        "review_rating": "",
        "review_title": "Brilliant",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "anagpal",
        "review_rating": "",
        "review_title": "Goofy !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "puneet-kkv",
        "review_rating": "",
        "review_title": "A refreshing comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1252596",
        "movie_name": "Ajab Prem Ki Ghazab Kahani",
        "movie_rating": "6.4",
        "review_username": "rohit_ism",
        "review_rating": "",
        "review_title": "One more flick my Rajkumar Santoshi",
        "review_detailed_main": ""
    }
]