[
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pawanpunjabithewriter",
        "review_rating": "2",
        "review_title": "It is not the Salman Khan movie. It is only Salman Khan Movie",
        "review_detailed_main": "I watched this in theater. The only thing I liked was the BGM. The sound was extraordinary. However, the acting, the script, the dialogues were very poor. Could have marginally done better with the plot, but the script didn't make much sense. Won't see Dabangg 4 coming after such performance. It is completely Salman Centric and it doesn't really have anything except for his charm. With the poor script, it vanishes too."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hverma26",
        "review_rating": "2",
        "review_title": "One word for this : \"GHATIYA\"",
        "review_detailed_main": "This movie is an insult to Indian cinema. No story, awful acting, below average songs, bad cimetograhy, childish screenplay. Salman's diehard fans will love this crap. It's not Salman's fault to make such kind of movies as he knows majority of public are fools and love this type of movies."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "siddhartharora",
        "review_rating": "2",
        "review_title": "Salman did not allowed anyone to share a single frame without him",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hXz0r3",
        "review_rating": "1",
        "review_title": "Yet Another Boring piece of CRAP !!!",
        "review_detailed_main": "Salman,s era is definitely over. OR He should change his style, he will loose a major fanbase, continuing same SICK STYLE OVER AND OVER EVERYWHERE !!. I dont think I am going to watch another Salman movie, until I check the ratings.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dipali-20907",
        "review_rating": "1",
        "review_title": "Last SK movie",
        "review_detailed_main": "I'm writing this review while actually watching it! Lame and nonsensical. Utter waste of time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rahulagarwal-25008",
        "review_rating": "1",
        "review_title": "🙏🙏🙏 Dont watch it if you are not a fan of salman khan",
        "review_detailed_main": "Albert Einstein Issac Newton Galileo Galilei Stephen Hawking ..... and many more Agar ye sab log jinda hote toh aaj aatmahatya kar lete!!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sidjoshi-11166",
        "review_rating": "1",
        "review_title": "Trash of the DECADE!",
        "review_detailed_main": "Totally avoid the movie as its no good wasting your money on this when you can buy a PIZZA MEAL for the same price. At least it'll satisfy your hunger!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "love-abhi2715",
        "review_rating": "2",
        "review_title": "Crap movie with irritating performances",
        "review_detailed_main": "This is a lousy movie with same kind of story which we have seen in 80-90s movies. Bad guy wants hero girlfriend when failed killed the gf, rest of the movie hero take revenge. Too many songs, irritating slow motion action scenes, boring dialogues, no chemistry between hero-heroine. Kichcha Sudeep is such a fine actor but totally wasted in this movie. I like Prabhu Deva as dancer but he should stop directing the movies, he has no idea what audience wants nowadays."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rahulnaudiyal",
        "review_rating": "1",
        "review_title": "Atrocious",
        "review_detailed_main": "Idiotic, Rubbish and yet another dumb film from Salman Khan.. I wonder when he will stop!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chulayush92",
        "review_rating": "1",
        "review_title": "i think it may top my worst movie ever list",
        "review_detailed_main": "All the salman hardcore fans i know u wnat to see his movie but belive me even then also it will be pain in the neck"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rajeshk_sahu",
        "review_rating": "",
        "review_title": "OMG what a waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "zeeshanrizwan",
        "review_rating": "9",
        "review_title": "Love you Bhai",
        "review_detailed_main": "It's all & all Salman Khan Show 💪🏻💪🏻👍🏻 Kichcha Sudeep - Terrific 👌🏻👌🏻👌🏻 Saiee Manjrekar - Confident Debutant 😘 Entertainment Entertainment & Entertainment, Salmaniacs Rejoice. Love you bhai!!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pritypoddar",
        "review_rating": "7",
        "review_title": "Showcase of Salman Khan's star power",
        "review_detailed_main": "Dabangg 3 is an out an out Salman Khan formula movie. He looks relatively fresh and more invested than many of his other movies. Dance sequences are good.\n\nBhokal kar diye ... 😎"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kushagrat",
        "review_rating": "1",
        "review_title": "Serious Nonsense",
        "review_detailed_main": "Please get over from such kind of movies. Very poor acting, no entertainment, slow motion movie.\n\nSkip this one."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "aasthamittal",
        "review_rating": "1",
        "review_title": "Not even a one time watch",
        "review_detailed_main": "It is so hard to believe that Salman wrote acted and produced this film. Totally nonsense without a storyline. I went to see Salman but was so disappointed to see meaningless songs every now and then. This movie is injurious to your time so avoid if possible."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "JarvisIndian",
        "review_rating": "1",
        "review_title": "Oscar for worst acting",
        "review_detailed_main": "Salman can only do remake movies better. Like shahid kapoor, these stupid actors can only copy other actors Masterpiece and make a prototype of it to tatti bollywood people . Who always believe in action stunts . Tearing shirts and all. He is just endorsing worst actors like katrina Sonakshi warina. Crap movies aren't gonna stop. So please become wise and watch good content movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jgaurav-34892",
        "review_rating": "1",
        "review_title": "Unbearable",
        "review_detailed_main": "Is there any other superstar in Bollywood who takes his fans for granted as much as Mr. Salman Khan does?\n\nHe has reached the stage where he can even write up some sort of extended letter to his family, call it a \"script\", produce it himself, star in it himself and there you have a movie.\n\nMr. Khan expects his fans around the country to simply hand over their money to him for doing absolutely nothing and putting in no effort whatsoever is his performance or the writing. Prabhu Deva's direction is probably acceptable for the South Indian audience; at times during the movie it is difficult to even follow what is going on.\n\nThis movie is a complete waste of your time and money. You will find Tik Tok videos which are more entertaining."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dnooz",
        "review_rating": "1",
        "review_title": "How can anyone rate this 10",
        "review_detailed_main": "I went to the movie just cause I didn't want to upset my friends But the movie did upset us all"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "skvcal",
        "review_rating": "1",
        "review_title": "Horribly directed and no storyline",
        "review_detailed_main": "No story and the direction was not at all good. After watching the first 15 mins of the movie one can decide. Except Sudeep Kichas acting I haven't found the movie interesting. Felt the movie was being forcefully pulled."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "baruaritesh",
        "review_rating": "2",
        "review_title": "Salman's ego at work",
        "review_detailed_main": "Forcefully making a movie trying to show he is capable of everything including story writing spells doom for this movie.\n\nHUGELY DISAPPOINTED"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "gupta21",
        "review_rating": "1",
        "review_title": "The Only Good Thing About Dabangg 3 Is It Doesn't Allow You To Sit Through The Whole Movie! GARBAGE!",
        "review_detailed_main": "I just came from cinema having a nightmarish experience known as dabangg 3 . Now i have promised myself never to waste my hard earned money on Bollywood movies before reading reviews from GOOD, fair and unbiased critics. Dabangg 3 literally have nothing in it . At least dabangg 1 had some originality, some funny jokes and scenes and most importantly it had something. First of all, a \"free-fund\" advice to prabhudeva, please don't direct a movie again . The reason dabangg1 was a bit better was because of its director unlike now .\n\nSo here is how i am going to rate this movie ;\n\nDirection = 2/10 Story = 1/10 Music = 1/10 Acting = 1/10\n\nOverall 1/10"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "parthajyotinath",
        "review_rating": "10",
        "review_title": "HUD HUD ❣👓",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "saru2020",
        "review_rating": "",
        "review_title": "Same usual plot except that it is back in time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sulemanashiq2",
        "review_rating": "7",
        "review_title": "A mindless entertainment, only for Salman Khan diehard followers otherwise a boring cop drama.",
        "review_detailed_main": "Yes, the film was the weakest chain of the Dabanng series but it is not as bad as it is trashed on social media. Nowadays, people err their judgments due to the positive or negative hype, can't have their own personal liking and disliking. If something is in trends it must be spectacular, If something is not it must be crap, that is the scenario for Dabanng 3.\n\nDabanng 3 is a film, which works on the element of Masala genre, and Salman Khan, which is in its own brand, a cinema. His films don't work on the laws of filmmaking, he is the \"BHAI\" Afterall, a mammoth of personality and attitude and that's what he has presented in Dabanng 3 but the film was let down by its visual effects and down south action choreography if the action director emphasized on the dramatic and simple action, It would be a gem film.\n\nThe story has loopholes, It has all the flavors of a masala genre, but didn't well made, the villain looks weak, never developed throughout the film and Sudeep acted brilliantly If he had given more screen presence and some more cruel tricks, it will be an altogether different film. Everyone knows about Chulbul, so if the Bali Singh has more roots in the story, It would be fun to watch, battling one another.\n\nMusic was another weakest link of the film, Only Munna Badnaam Hua, has some moves and tunes the songs were pathetic, probably the worst Salman Khan films album. He has a definite taste, I am quite shocked what happened to him, with his music sense.\n\nDabanng 3 could be better, but it is watchable, a masala entertainer, the action and music irritate you but Sae Manjrekar, Sudeep, Sohail Khan, and Dhakad Chand Pandey makes you watch this film till the end.\n\nA mindless entertainment, only for Salman Khan diehard followers otherwise a boring cop drama."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "meettausif",
        "review_rating": "1",
        "review_title": "Illogical and Irritating",
        "review_detailed_main": "Stop making films Salman, For God's sake don't write stories.\n\nSalman's Story and Prabhudeva's made it unbearable"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "arjuncshekartheofficial",
        "review_rating": "2",
        "review_title": "Only 2 stars for Sudeep and Saiee Manjrekar.",
        "review_detailed_main": "The whole movie is totally a crass, Prabhu Deva must have to concentrate on Dance not on movies. Only I gave 2 stars for Sudeep and Saiee Manjrekar's acting. Salman Khan and Sonakshi Sinha turned out as Abhishek Bachchan and Uday Chopra of Dabangg 3"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sakshamkaushik",
        "review_rating": "1",
        "review_title": "Disgusting and totally horrible",
        "review_detailed_main": "We did not like this boring film. Waste of money. I appreciate his efforts but not this time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "amitsaxena1310",
        "review_rating": "1",
        "review_title": "Franchise Ruined",
        "review_detailed_main": "Honestly they have ruined the Dabangg franchise with the third installment. Dabangg 1 was the only good film because of it's new concept. Even Dabangg 2 is far better than this. Lame jokes and dialogues. Sudeep the antagonist has done his job well but could have been utilised more by giving him more screen time. Action is also OK but not as good as it should be.\n\nGlad I didn't watched it in the theater."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dhakarak",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "No movie can be worst than this one . Totally waste of money. Full of overacting, bad music ,poor script this movie has nothing to watch. Don't waste your money and time"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "swapnil-shukla",
        "review_rating": "1",
        "review_title": "WORST Movie",
        "review_detailed_main": "Guys pls do not waste your time and money on this. Such a pathetic movie with insanely bad script and direction. Prabhu deva u just BACK OFF!!! Bad choreography cheap lyrics worst comedy\n\nThose who have given 10 or 9 stars they are definitely Dabangg 3 cast n crew members. Not a sensible person can do this.\n\nWhy Salman khan is bringing down the standard of Bollywood and himself.\n\nWhat sort of audience is he targeting??? This is the big question mark. Regretting big time watching this."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "amitwb-31821",
        "review_rating": "1",
        "review_title": "Why Bollywood why?",
        "review_detailed_main": "I didn't know why I watched this film. Worst film of the year. Poor story, screenplay, poor music & poor action sequences. Totally crap. Masala entertainment value is also very less than previous Dabangg movie. Believe me it will be biggest disaster of Salman khan in recent year."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Abbas_Muhammad_cfc",
        "review_rating": "1",
        "review_title": "Worst movie! dont waste your money",
        "review_detailed_main": "One of the worst movie's ever! over acting, worst cgi, too much crap stuff! worst movie!\n\nIf u have someone and want him to suffer alot? take them to this movie!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abida-18014",
        "review_rating": "9",
        "review_title": "Must Watch",
        "review_detailed_main": "If you are Salman hater then u should watch it , it will change your thinking ...Its full on family entertainer ...Action,Comedy,Masala,Emotions ...everything in it ... #DontMiss"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rish2006",
        "review_rating": "7",
        "review_title": "This was a good one",
        "review_detailed_main": "The previous sallu films were pretty disappointing including Dabangg 2. But Dabangg 3 is shown to be very entertaining to watch with its action scenes along with some homour in the film."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sarabjeet05",
        "review_rating": "1",
        "review_title": "Save ur money and avoid this movie",
        "review_detailed_main": "Horrible, Pathetic, Boring are understatement for this movie. I am sure Sallu bhai himself would have got bored while watching this movie.\n\nAVOID !!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kumarvaasu",
        "review_rating": "1",
        "review_title": "Race 3 reloaded",
        "review_detailed_main": "One of the worst movies of the year. And the music is so underwhelming that it often feels irritating. The whole plot is provided in the trailer. The charm of chulbul as it was in the first dabangg is lost."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "duttab-05870",
        "review_rating": "1",
        "review_title": "Irritatingly bad",
        "review_detailed_main": "1.5/5 . What happens when you put a half baked plot, terribly written story, awkward pacing, subpar acting, mediocre direction, and irritating songs into a pot and add masala? You get a disaster by the name of Dabangg 3 . Skip this one!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "boobooc-06588",
        "review_rating": "1",
        "review_title": "There used be a word called acting...",
        "review_detailed_main": "Where 📍❓is it ❓oh 😁my 😇🙏👼god...the word called acting must be erased from the dictionary.....you must 🚫not ❌ 👀see this crap......"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nekhil-35856",
        "review_rating": "1",
        "review_title": "Utter Dissapointment",
        "review_detailed_main": "Very poor story writing and pathetic attempt at comedy."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chanducorleone",
        "review_rating": "1",
        "review_title": "Fully torture 😬😭",
        "review_detailed_main": "This movie like 2005 time mass commercial entertainer format fully boring story content is simply crap if you dare to watch this movie it means a best adventure for you"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pankaj_xyz",
        "review_rating": "1",
        "review_title": "Only Salman khan fans will like this crap movie",
        "review_detailed_main": "Acting 3/10 Story 1/10 Songs 1/10 Action 4/10 Totally disappointed"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "visfalu",
        "review_rating": "9",
        "review_title": "Best masala entertainment of the year",
        "review_detailed_main": "Dabangg3 one of the best movie of Salman Khan he is on fire, it is full of entertainment, no one dull moment, the best part of the movie is twist in the interval and in end the fight sequence, boxoffice be ready tsunami on its ways Dabanng3"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "varunsharma-66346",
        "review_rating": "",
        "review_title": "An entertaining ride!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "bollywoodkabar",
        "review_rating": "7",
        "review_title": "DABAANG 3 REVIEW",
        "review_detailed_main": "Whats Good : Good story & screenplay by salman Salman & Saie manjrekar sequence are good one & fresh Entertaining comedy & fight scene Emotional scene between chulbul & makhi\n\nWhats Bad : Song replacement (yu karke) Lenghty second half Some bored scene in second half\n\nWhats avarege : Music & background sound\n\nHidden layer : Munna badhnam hua lyric line are hearth contents by salman for Saie\n\nDabaang 3 is a entertainment movie, better than dabaang 2. Its because a good acting by salman and good direction by Prabhu Deva"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nilugupta-14027",
        "review_rating": "2",
        "review_title": "Totally waste of money",
        "review_detailed_main": "Abhi take sabse bakwass movie ....I like the work of villain he does her WOR k well. Screenplay very bad"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shankarvemuri-71938",
        "review_rating": "1",
        "review_title": "Scrap",
        "review_detailed_main": "No script cheap acting old very old kind of film. Boring"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akshayrby",
        "review_rating": "1",
        "review_title": "No story movie",
        "review_detailed_main": "Movie is made by taking clip of multiple movies. All songs are very bad 1.no new music. 2 no meaningful lyrics 3 no new dance step\n\ndialogues are very boring. Means total is waste of time and money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vivekrajput-53950",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "As usual..dont expect any entertainment fro this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dixitajit",
        "review_rating": "1",
        "review_title": "Headache!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vaideswar",
        "review_rating": "1",
        "review_title": "Unbearable",
        "review_detailed_main": "Gave us a headache...don't even think of going anywhere near it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chankyagaurav",
        "review_rating": "1",
        "review_title": "wastage of money",
        "review_detailed_main": "One of the worst movie ever ,total wastage of money.First time i am regreting about my decision for any movies"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "lalitgupta-09850",
        "review_rating": "1",
        "review_title": "worst and third class movie.",
        "review_detailed_main": "Overacting, no class and bakwas movie. plz dont wast your money and time for such type of film"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vishvjeetkumawat",
        "review_rating": "10",
        "review_title": "Great Masala,Action,Beaware from negetive reviews",
        "review_detailed_main": "Just Awsome..Another Blockbester from Dabbang Frenchise...A Masalmix,Action Eveerything you want is in that so Just Go and Saw this..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "drsarafhospital",
        "review_rating": "7",
        "review_title": "A commercial block buster",
        "review_detailed_main": "Movie is good. only a few songs can be removed great acting by sudeep and by salman rest cast is also good. Can be watched"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akshaytheboss-23921",
        "review_rating": "1",
        "review_title": "Worst than expectation",
        "review_detailed_main": "This movie deserve zero rating. Nothing new. Poor dialogu, screenplay, music. If you have enough time to waste you can go for it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "upadhyayapratyush-46180",
        "review_rating": "1",
        "review_title": "Worst movie of the decade",
        "review_detailed_main": "Bad film with no sense no story no screenplay. It's just about Salman Khan and nothing else."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "naveendabas-67944",
        "review_rating": "1",
        "review_title": "Waste of money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jafarkas",
        "review_rating": "1",
        "review_title": "Worst Movie Of Salman Khan",
        "review_detailed_main": "I watched this movie . There is a waste of time and waste of money"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pushpraj-62394",
        "review_rating": "1",
        "review_title": "Beware of positive reviews",
        "review_detailed_main": "This is really very bad movie with same old story line and bad music."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "robotatbb",
        "review_rating": "1",
        "review_title": "Headache",
        "review_detailed_main": "Wishing you a good day & I recommended everyone not to go for Dabangg 3. A mental torture of 2:30 Hours."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "wajahat4444",
        "review_rating": "1",
        "review_title": "DISAPPOINTMENT",
        "review_detailed_main": "Nothing new same old story lime.. Bad music and acting waste of time and money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chatterjeesandeep-29099",
        "review_rating": "1",
        "review_title": "A pure waste...",
        "review_detailed_main": "Didn't like the movie at all... Salman being such a big star shouldn't do such type of movies..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "iamrohanak-06118",
        "review_rating": "9",
        "review_title": "100% ENTERTAINMENT!!!",
        "review_detailed_main": "Never thought in my wildest dream that I will like Dabangg3 more than Dabangg1... It was a SURPRISE package. Got much more than what I was expecting! Salman Khan has nailed as young Chulbul. He shut his critics with his CHARM! 100% ENTERTAINMENT! Paisa wasool!! Kichcha Sudeepa as Balli Singh was terribly Mindblowing!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "usmanishaque",
        "review_rating": "",
        "review_title": "Terrible Story, Over acting Wastage of Money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "alishakhan-33057",
        "review_rating": "7",
        "review_title": "Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jeetdutta-16586",
        "review_rating": "1",
        "review_title": "Average",
        "review_detailed_main": "As a masala entertainer, it's not upto the mark. Nothing new, the story is like 90's movies with irritating songs, average screenplay and dialogues. It's not a pure masala entertainer which it should have been. Instead of this go for Star wars or Mardaani2."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jeewatram1",
        "review_rating": "1",
        "review_title": "More Power to Salman Khan Fans",
        "review_detailed_main": "Yes, only Salman Khan fans can say this Movie is superb, as they said Race 3 & Bharat are best movies. Salman Khan movies get audiences because of Eid & Christmas holidays, did his movie released on non-holidays in past 6 years? Answer is big NO."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "msunando",
        "review_rating": "3",
        "review_title": "Salmanathon that fails to make any impact",
        "review_detailed_main": "Dabangg 3 - This installment has Salman Khan written all over it, practically. He is the producer, story (ahem) writer, screenplay writer, and of course, the hero. The result is a 150 minute film with him in every frame, more narcissistic than ever before. Actually \"main thoda confujiya gaya hoon, ki yeh kis genre ki film hai - comedy, thriller, action, ....\", but who cares, it has Salman Khan, the rest can take a walk. Actually, Dabangg 3 was meant to be a prequel to the original - the transformation of Dhaakad Singh Pandey to Chulbul Pandey and the inspiration behind it, Khushi (Saiee Manjrekar), his original love interest. Thereafter, it turns into a revenge saga of epic proportions.\n\nBut let's not go into the story as there isn't one. Dabangg 3 has so much of Salman Khan in it that even his die hard fans will pray for a break. Alas, there is no mercy here. There are numerous subplots that refuse to allow focus to the narrative and the film keeps meandering. On top of that, there isn't cohesion within the screenplay which makes it disjointed - a comic scene is quickly followed by an action sequence and then a romantic interlude featuring a song. It's downright disturbing and amateurish. Dabangg 3 is at best a polished 1970's potboiler that aims to drive home a few social messages.\n\nKichcha Sudeepa as Bali Singh, Chulbul's antagonist is the only one who delivers a credible and almost menacing performance. His output is well nuanced and he makes a good hand at acting. Saiee Manjrekar is passable, Sonakshi Sinha constantly pouts and is irritating. The interaction between Salman and Sonakshi has some senseless baby talk (meant to be sweet nothings), completely lacking chemistry. The music by Sajid Wajid is good, but there are too many songs that grate on the nerves. This time director Prabhudeva fails to deliver a taut thriller, but I personally believe that it must be because of Salman's creative dabbling.\n\n3 STARS overall, maybe with a little less of Bhai it could have earned a better rating. Avoid, if you aren't a die hard Sallu fan."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nirajrathod",
        "review_rating": "1",
        "review_title": "As usual Salman Bhai lived upto the expectation",
        "review_detailed_main": "First of all pls don't blame Salman pls blame the fans who always support his crap work with no sense no story cheap songs and best of all showing CGI physic of this old baby"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "safayetas-03130",
        "review_rating": "3",
        "review_title": "Shame",
        "review_detailed_main": "Frist half was little okay... But 2nd half is worst.. Such a useless story line."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "virenjoshismpr",
        "review_rating": "3",
        "review_title": "Don't expect anything new",
        "review_detailed_main": "Same stuff is still going on in different way. No doubt acting is good but without everything else the movie just falls apart. Honestly, nothing fresh to absorb from this dabangg series. I hope if they ever think about dabangg 4 just go for a different story & unique elements. Do something different in each iteration of the movie.This just felt like stale attempt.Next time don't add mediocre music if you cannot find good one better to not include them. Initially I gave 1 star but added 2 stars just for acting. rest of other things like freshness, plot , music & predictiveness are main aspects for my judgement for any film for which it has failed severely"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ronakkotian",
        "review_rating": "1",
        "review_title": "This franchise should just end...",
        "review_detailed_main": "The Dabangg franchise has never been one that made me think \"WOW! This series is amazing\". I enjoyed the first one as there was some competence visible and effort put into it. The second one lost all the strengths of its predecessor and barely had anything charming about it. However, what Salman Khan has done to the third installment is absolutely atrocious.\n\nDabangg 3 reunites us with Chulbul Pandey as we see him go up against Balli Singh, an enemy from the past that destroyed his first love.\n\nThis story isn't anything special. We've seen countless films in the past that have used this exact same storyline and now it's at point where it has become old and overused but since Salman Khan knows people will turn up to his film no matter what it's about, it was a smart move from him to write the most generic revenge story. Speaking about the writing, this screenplay is one of the worst of the year. Everything is so bland. So many of the jokes fall flat which make it excruciatingly difficult to sit through the film's 2 hour 30 minute runtime. I feel Khan should just stick to acting because writing is not his cup of tea.\n\nFrom the trailer alone I could tell how bad this film was going to be but I had a bit of hope that at least the action would be entertaining to watch. Apart from the final battle, every other action scene had nothing exciting about it. On top of that the action WASN'T EVEN SHOT WELL. There were a few times where you couldn't tell what was happening due to the poor camerawork and direction. Prabhudeva, what went wrong?! Let's not forget the unbearable editing. There is so much slow motion used which make the scenes go on forever and visual effects that are completely unnecessary. The background score was obnoxious throughout and the overabundance of songs dragged the film further.\n\nI feel the choice of having an origin story had a lot of potential. It would have been a great way to add further depth to Chulbul's character and help us learn more about the villain but sadly none of this is explored in much detail. Salman Khan does an earnest job as Chulbul Pandey even though, a couple of times, he was a bit too over the top. Sudeep also does a good job despite his severely underwritten role. He brings a good amount of intensity to his character but we learn nothing from his character. He's one of the most basic antagonists you could come up with. The female roles were also played well but had very little to do. They just served as plot points and nothing beyond that.\n\nAt this point this franchise should end. All the humour, charm and wit that was gained in the first one has been fully lost in Dabangg 3. This is one of the most boring films of the year and an absolute pain to finish. I wish Abhinav Kashyap would come back to help give this series the boost it needs."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "anuragchatterjee",
        "review_rating": "1",
        "review_title": "Full 'TATTI' movie💩💩💩",
        "review_detailed_main": "Kuch bhi nhi h yaar movie me....only over acting and tatti stunts,action. Go at your own risk Note:-Nothing new for today's generation Mark my words \"NOTHING NEW\"."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jamihaqjoy",
        "review_rating": "10",
        "review_title": "Akki fans are so jealous",
        "review_detailed_main": "Akki fans , plzz stop this kind of things , Sallu fans were supporting you when Srk fans were trolling you . Now you guys are abusing them just bcz of this 1 week gap release ? shame on you . Next christmas you will troll Aamir Khan coz there will be a clash between Bacchan Pandey & Laal Singh Chadda . You will troll him without any reason . Shame ."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sharifftanveer",
        "review_rating": "7",
        "review_title": "Dabangg 3 Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nishikantkumar-76193",
        "review_rating": "2",
        "review_title": "Disaster",
        "review_detailed_main": "A two and half hour tortured ,unacceptable,90s type movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "zulfikaralarakhia",
        "review_rating": "1",
        "review_title": "Same typical Bollywood drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nikunjpandya-47509",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sohailparvaiz",
        "review_rating": "1",
        "review_title": "Rubbish and waste of time",
        "review_detailed_main": "It's a film that was made 15 years back and released now. Bad direction. Salman khan does not let any one give screen time. Bakwaas, don't even watch on tv"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "satyamagarwal100",
        "review_rating": "1",
        "review_title": "Just a headache movie.",
        "review_detailed_main": "The movie was just pathetic. the action sequence was poorly directed. the jokes were just too lame and bad. DONOT WATCH IF YOU WANT TO LIVE AND DONOT WANT TO WASTE 3 HOURS OF YOUR LIFE. Salman khan should be coming up with better script."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "patrioticutuber",
        "review_rating": "1",
        "review_title": "cringeworthy movie",
        "review_detailed_main": "Wanted to rate this cringeworthy movie -ve 100 but unfortunately had to give it one star only to stay on the scale. The producer, director, Salman Khan, and everybody involved in the making of this movie should be publicly shamed"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sandippathak",
        "review_rating": "1",
        "review_title": "Horrible Illogical Unbearable Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sanjayjaindelhi",
        "review_rating": "1",
        "review_title": "Hopeless",
        "review_detailed_main": "Was out of the movie in only 20 minutes. Total Waste."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rehanliet",
        "review_rating": "9",
        "review_title": "Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "salmaniac-26688",
        "review_rating": "",
        "review_title": "Must Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "SinhaSomesh",
        "review_rating": "6",
        "review_title": "Unadulterated crowd-pleaser!",
        "review_detailed_main": "#FinalVerdict\n\nThe pre-Christmas week has at last shown up. The best is always reserved for the last and it has been a custom to have at least one biggie unfurl in the Christmas week before the curtains fall on the on-going year. Salman Khan teams up with the Hit machine - director Prabhudheva -- yet again. In addition, several enviable names, on and off-screen, lend muscle to the enterprise. The canvas is gigantic as well. It can't get bigger than Dabangg 3, honestly.\n\nPrabhudheva is synonymous with audience-friendly movies. Most critics may abhor his work, however, the paying public - the ones who matter ultimately - adores his film. His films may not offer ground-breaking stuff, nor do they get exemplary honours, yet he whips up a storm at the box-office each time he attempts a high-on-entertainment fare.\n\nThis is for fans and adversaries of Salman Khan... Fans, cheer, Salman is back furiously with Dabangg 3. This is his deadliest performance to date. Indeed, you read it right! Adversaries, sorry, you won't have the option to lash out at him or dispatch a horrendous tirade this time. Well, without mincing my words, I must avow that Dabangg 3 is aimed exclusively at the hoi polloi. It rides on Salman Khan's star power. In a film like Dabangg 3, in a role that appears to be an expansion of his character, you can't even consider any other actor portraying this role with flourish.\n\nRecollect the successful potboilers of yore. Recall how the hero would diminish 10 goons to mash in a fraction of seconds. Recall how heroism won at last, regardless of how unfriendly the conditions were. Recall those films wherein rationale assumed a lower priority since the attention was on entertainment... You relive those moments as Dabangg 3 unfolds. It may/may not make sense to you, but screenplay writers - Salman Khan, Prabhudheva and Aloke Upadhyaya - ensure that you are entertained.\n\nWith Dabangg 3, one is well prepared about what's in store. The sole factor that director Prabhudheva needs to stress over is whether Dabangg 3 would meet the towering and monumental expectations. More so, because Salman Khan is contending with himself. Salman Khan has redefined superstardom with mass entertainers. He's box-office's favourite actor and seems invincible and insurmountable at the moment! Hardcore masala films are relished with glee by the audience and Dabangg 3 takes this genre one step ahead. Sure, it's an old wine packed in a brand new bottle but the result is sheer magic. Most importantly, Dabangg 3 has Salman Khan like never before. In fact, breathing fire and venom, Chulbul Pandey aka Robinhood Pandey taps Salman's star power like no film has. Dabangg 3 stands on three pillars - Salman Khan's star power, smashing stunts and super music.\n\nIn a nutshell, Dabangg 3 delivers what it promises: Entertainment in enormous doses. Prabhudheva's latest offering speaks the language that the masses comprehend. It's one formula that can never go out of fashion if handled smartly. Actually, Chulbul Pandey has come to represent the common man and that's yet another reason why you root for him, feel overjoyed and ecstatic when he triumphs in the finale. For anyone who needs to comprehend what is the on-screen meaning of Bollywood, Dabangg 3 is absolutely textbook fare.\n\nLet's face it, Dabangg 3 has nothing ground-breaking to offer as far as the story (Salman Khan) is concerned. But what makes Dabangg 3 shine, and shine brightly, is Salman Khan's star power, which camouflages the aberrations wonderfully. The film is special for two more reasons: Anl Arasu's stunts and Sajid-Wajid's music. Talking of action scenes, Salman's introduction at the start and the fight-to-finish in the climax, when Salman's shirt tears apart and the rippling muscles and the bare-chest fight ensues, will send the masses in frenzy. To state that the action scenes are outstanding, especially the fight in the finale would be an understatement. Mark my words, the action scenes will lead to chaos at mass-dominated centres, especially at single screens. It won't be erroneous to state that the climax is worth the price of the ticket, samosa, sandwich, popcorn, nachos and cola put together.\n\nSajid-Wajid's music is of a mixed variety and gels wonderfully with the genre of the film. Munna Badnaam Hua track will send the viewers into raptures. The background score (Sandeep Shirodkar) is electrifying and in sync with the on-screen situations. Dialogue (Dilip Shukla and Aloke Upadhyaya) are excellent. The lines are written with equivalent flamboyance and will be greeted with claps and whistles. Mahesh Limaye's cinematography is top-notch and he makes every frame appear larger-than-life.\n\nBut Dabangg 3 is not without its share of flaws. The film stands on a thin storyline and the viewer can guess what's in store next. Besides, the film could've done without a song or two, thereby keeping its length in check (editor: Ritesh Soni). However, these are minor aberrations. For, the plusses easily outweigh and outnumber the minuses here.\n\nThe principal cast provides the much-needed sheen to Prabhudheva's vision. Salman Khan uses his fists, spews venom and threats, bullies the villain, flirts and romances, does the pelvic thrusts... in fact, he does everything that one expects from Chulbul Pandey. Honestly speaking, Dabangg 3 is a Salman Khan vehicle and the actor is the Big Boss here. You cannot imagine anyone else doing what he does. And every time he plays to the gallery, many in the audience (especially at single screens) are sure to fling the loose change on screen as a mark of appreciation for his on-screen antics. He defies logic and gets away with it! He is like a ferocious lion who roars with all his might. The show belongs to the actor, who scorches the screen every time he displays the manic anger. From a statutory warning against cigarette and gutka, mouthed by Khan, to his anti-dowry stance and a message on water conservation and a dig at demonetization at the very end, there is also ample messaging to be found in the movie.\n\nSonakshi Sinha's pairing with Salman looks wonderful. She is her usual chirpy and feisty self as Rajjo. She delivers the right expressions. The newcomer Saiee Manjrekar has an infectious charm and radiates confidence all through the enterprise. The character she portrays has tremendous mass appeal. Also, the desi girl image suits her impeccably. She is camera-friendly and confident to the T. Arbaaz Khan is okay. Dimple Kapadia is truly wonderful. Pramod Khanna (brother of late Vinod Khanna) is excellent. Kichcha Sudeep has a good screen presence. He is superb as the antagonist. He's venomous to the hilt! Yet another sterling act that doesn't miss a beat! He takes giant strides as an actor & gives the film the much-needed support.\n\nOn the whole, Dabangg 3 is the emblematic formula movie with distinct essentials that Indian masses yearn for. The film is for those who seek unabashed entertainment and relish masala films. Damn the indomitable critics, pseudo-intellectuals and connoisseurs of parallel cinema, this one's not for them. Dabangg 3 is for the aam junta. Entertainment guaranteed. Dabangg 3 is your ticket this festive season. Dhamaal entertainer!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dikshitbatra",
        "review_rating": "1",
        "review_title": "Great 2019 for Bollywood until I saw this !!",
        "review_detailed_main": "OMG why does these kind of movies are even made. It's just sad that on the one hand other two khans are trying to do something they haven't done so far but bhai doesnt want to do something even sensible but forget about something new. Sure short waste of money and time and your senses."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "yogeshevolution",
        "review_rating": "1",
        "review_title": "No option to rate below 1",
        "review_detailed_main": "I got feeling after watching this movie that there should be option to rate movie lower than 1 on IMDb.And who called it dabbang 3 and not crap 3.😂😂"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rehmankhilji",
        "review_rating": "1",
        "review_title": "What the hell was this",
        "review_detailed_main": "Seriously what the hell was this? why on earth they forced themselves to make a third edition without any story line. Salman Khan you were looking grandfather of Saiee Manjrekar in this and you are the age of it as well. Stop this nonsense please. The movie starts without a rhyme, continues and ends without a story. BURN IT"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pranjaymalik007",
        "review_rating": "1",
        "review_title": "Worst movie ever of salman khan",
        "review_detailed_main": "The most boreing movie of the decade movie contain nothing some songs and drama no story nothing very boreing movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "fivestaaar",
        "review_rating": "1",
        "review_title": "Boring , Disappointing , Torture",
        "review_detailed_main": "I am a fan of action masala entertainer like Dabangg 1, Rowdy Rathore , Singham , Simmba. So Dabanng 3 was on my must watch list . Went for the movie with friends . All the craze and excitement fizzled our in first half an hour . What a torturous boring piece of crap they have made . There is no continuity in the narration . Who did the editing ? RGV ki Aag looks like a masterpiece when compared to Dabangg 3 . I can guarantee you will literally sleep during the movie or will go out 20 times for a smoke . No comedy ( not even forced comedy), extremely bad action , but still better than Tiger Zinda Hai and Bharat .any movie directed by Ali Abbas Zardad should be in waste bin . My advice : If you are Salman fan and if you like garbage like Tiger zinda hai and Bharat , then you won't be disappointed . This is far better than those 2 craps in terms of entertainment\n\nAll eyes on Good News now . Let's see how the Canadian fares this time 😂"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ishwardattmishra",
        "review_rating": "1",
        "review_title": "Worst movie ever.",
        "review_detailed_main": "I wish i had an option to mark negative rating.Story is real bad. Acting is poor."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abhishekraz-47389",
        "review_rating": "1",
        "review_title": "Why this movie exist on the first place?",
        "review_detailed_main": "Apart from Sudeep, this movie sucks really bad. Salman should stop making these sequels and focus on movies like Bajrangi with a better story. He can't act and he doesn't know that. Stop these mindless sequels which are nothing more than trash."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pan-pandey",
        "review_rating": "1",
        "review_title": "Salman Khan does the right thing.",
        "review_detailed_main": "If you have brainless fans, who will see anything you show them, than why not use this opportunity to make lots of money ?\n\nWhen you have such idiot fans, why work hard on script, acting etc, when you can make easy money by doing nothing.\n\nWell done Salman, you are a real businessman."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vijaykapoor",
        "review_rating": "10",
        "review_title": "All time blockbuster",
        "review_detailed_main": "Salman is outstanding and fully entertainment for specially mass audiences"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "isishavs",
        "review_rating": "6",
        "review_title": "Why so many songs??",
        "review_detailed_main": "Every situation has a song.. and almost every situation is same .. around 7-8 songs in a movie .. Its irritating.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "xscenex",
        "review_rating": "1",
        "review_title": "Dead Bangg",
        "review_detailed_main": "I didn't have any over expectations from the movie, but when i started watching it, i thought, what?!? kuch bhi... Salman's acting was too much of extra chull bull, who doesn't at all give a damn for acting Loud anywhere, even while shooting his own men.. That was disaster. Then the story was lame.. and very dead uninteresting and cliche.. yes salman fans will go crazy with the action and dialogues, they just need some motion on screen with salman thats it..\n\nAll n all the movie was extremely boring and bakwaas.. I thought krk is an idiot who blamed the movie, but now i totally agree with him.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rutujsikchi",
        "review_rating": "1",
        "review_title": "INSANELY BAD!!",
        "review_detailed_main": "Beware if your neighbour pukes on you! Insanely bad! Poor dialogues, silly comedy makes you cry"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chawlahimanshu-67513",
        "review_rating": "1",
        "review_title": "Total waste",
        "review_detailed_main": "Total waste of time and money. I am great fan of Salman but this was total waste.... Poor ... basically no story....poor screenplay...poor everything. Every scene was so disconnected"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jdpvsv",
        "review_rating": "1",
        "review_title": "Bakwas movie dont Watch",
        "review_detailed_main": "Please ignore SK gavar friends review they give just because of salman but in movie faltu nothing else."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "wavefaster",
        "review_rating": "2",
        "review_title": "Outdated",
        "review_detailed_main": "Still making a film with 5year back lines... masala action film but nothing new, wasting of time. too many songs without any means, any links makes you more gaps from feel for a story. its one time watch..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ankulmuz",
        "review_rating": "1",
        "review_title": "Don't waste your time guys",
        "review_detailed_main": "I have never seen these type of screen play and dialogue ...from salman bhai. In watching movie i felt asleep.... The role of her old friend is g ood.villain role is jakasss..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shivmadhwani",
        "review_rating": "1",
        "review_title": "REFUND MY MONEY",
        "review_detailed_main": "Dont waste your time and money!! ONE WORD REVIEW- PAISE REFUND KAR BC (ya ik one word nai hai but frustrated hu bhai itni ghatiya movie hai)"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abhijitkar-31630",
        "review_rating": "1",
        "review_title": "Save Your Money",
        "review_detailed_main": "Strongly recommended to skip this film. \"Kuch naya nahi hai ismein \" . Poor acting, dialogue, old action sequence. Waste of money & time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "anishvadiya",
        "review_rating": "9",
        "review_title": "Honest review for public",
        "review_detailed_main": "Watched dabangg 3 . Blockbuster all over written for it. Not a single dull moment in whole film .Salman Khan delivered over the top performance in dabangg 3. He is extraordinary in whole movie .kichha sudeep shine like a star what a perfect vollan role for this movie . Kichha had done a fantastic job here . When ever he come to screen you all will get goosebumps . He is class actor . Sai and Sonakshi has done fantabulous job . All are good in this movie . You action or music or dialogue delivery all are over the top . Direction of Prabhu Deva is over the top . It's very very very entertaining movie of the 2019 . It's blockbuster ."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mayanklouteriya",
        "review_rating": "6",
        "review_title": "It's a Salman Khan Movie. 'Ok' or Blockbuster you decide.",
        "review_detailed_main": "Here the story revolves around old days of Chulbul Pandey and how the Chulbul Pandey became Dabangg and his younger days love life. Same comedy timing like before (Dabangg or Dabangg 2) Predictable Story. Nicely done-the work of Vfx(for body shaping and to show Salman khan young). \"Saiee\" the 2nd actress/the love lady of Chulbul's life (younger days) is cute and sweet. Makkhi is good. Khushi (Saiee) doesn't get much screen time, same with Rajjo (Sonakshi) but Rajjo is Rajjo. the Villian Sudeep (Balli) worked very well and gave his best(not like all villains before). It's a good movie but lengthy 2 hours 42 min phewww.. Verrrry long. Fighting Sequence is long(Just because of Slo-Mo) and Unnecessary Songs. A Paisa vasool(worth watch) for some and blockbuster for Salman khan fans. If you're Salman Khan's fan and paying too much then its ok, if you're not a fan then think."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "laxmikantlrk",
        "review_rating": "1",
        "review_title": "I totally agree with the below statement",
        "review_detailed_main": "You will Enjoy if you are a Salman Khan fan or a person with a non-functional brain (I dont need to mention where Salman fans fall). Rest of you stay away from this cancer.\n\nPlease don't support overrated actors over actually good ones."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jatin4321",
        "review_rating": "1",
        "review_title": "Totally waste",
        "review_detailed_main": "If you don't have mind please go and watch.. Totally waste of money and time"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "talatiharsh",
        "review_rating": "1",
        "review_title": "consider it as half star .Using Pathetic is also like praising the movie",
        "review_detailed_main": "By seeing these movie the respect for panipat has increased How bad a movie can be?? Bad story Not so cool songs Over acting only good about movie was the villain playing actor. These movie worth to give half stars"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "filmdioxide",
        "review_rating": "1",
        "review_title": "Shameless production",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "girishlundwani",
        "review_rating": "1",
        "review_title": "Salman sucks",
        "review_detailed_main": "If you want to just go and sleep at theater go for this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hpsdeadman",
        "review_rating": "3",
        "review_title": "Below average",
        "review_detailed_main": "Movie is nothing in front of its prequel 1,2. songs are too bad. story and direction is also bad. But just because of salman it's collection will go high. Otherwise movie is below average."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kwarau",
        "review_rating": "1",
        "review_title": "Please retire this franchise right about now",
        "review_detailed_main": "It seems like everyone is getting on the bandwagon of making sequel and some forcefully turning their films into franchise and so called multiverse and so is SKF\n\nThose multiverse films are planned ahead of time and then executed like MCU. Singham might not be planned but they are shaping it well.\n\nThere is nothing noteworthy about the third part of franchise. Same old love story and typical love and revenge saga, foolish action sequences and a rushed ending.\n\nThe story was so outdated and so predictable. There was no twists and turn and whatever there was so so obvious from beginning it looked like Salman had free time in his hands so they decided to do another Daabanng\n\nMusic was so average and half of the movie was lost songs that were placed at wrong intervals through out the movie. I found them to be distracting as they took my mind out of the story.\n\nThe only good part of the movie was the villain who had a lot of potential but he was portrayed as a weak villain with very poor character written but honestly if they had put mind and sweat into this movie they could have take this movie to another heights and have it face off Singham/Simmba which was interesting movie to watch last year\n\nSave your self some time and money and watch it on TV"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "beevenkat",
        "review_rating": "2",
        "review_title": "monstrosity called #Dabangg3",
        "review_detailed_main": "After watching a monstrosity called #Dabangg3 im compelled to raise some queries - hope someone has the answers - why n how on earth was this project conceived - when will salman bhai learn to act - when will salman bhai learn to dance - when will salman bhai do something remotely sensible - when will sonakshi retire - whys Prabhudeva so desperate to direct - why did i watch the movie - why am i writing this review - rating 1/5."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "samjeremiah-21052",
        "review_rating": "9",
        "review_title": "#SalmanRocksHatersInShocks",
        "review_detailed_main": "Last year in December Simmba failed to impress me and my friends because it spoiled NTR'S Temper. But this year me and my friends 1st day 1st show at 8.35 am #FullSeetiyaan #FullTaaliyaan #FullTaabadtodDance on Munna Badnaam #Chulbul .... The Name Is Enough #Blockbuster #SuperDuperMegaHit #InThisKindOfSituationInOurCountry #SalmanKhanNailedIt"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chiruc-40127",
        "review_rating": "6",
        "review_title": "Story line is not good...illogical things are more brain less story",
        "review_detailed_main": "Only some scens look good...other scens are null.. actors are not acting...they are totally over acting...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jainish-86760",
        "review_rating": "1",
        "review_title": "EK DUM BAKWAAS",
        "review_detailed_main": "I haven't seen this movie yet....but i have confidemce about SALMAN KHAN is the WORST actor of bollywood..and he doesn't deserve the good words about him and his films.... For one thing i m happy bcoz i haven't seen this movie.. Bcoz everyone knows aboit salman's movies that he always does disastarous works day by day... IMDB SHOULD KEEP MINUS RATINGS ..SO THAT SUCH KIND OF DISASTER AND MOOD SPOiLER MOVIES GET THIS KIND OF RATINGS."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jituburdak",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "Don't watch . No story ,very bad acting of all actors"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ravidurden",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "Lol. Please do not waste your money or time. Repetitive action scenes with zero choreography."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sayhellotomaria",
        "review_rating": "1",
        "review_title": "-10",
        "review_detailed_main": "I don't understand why any sane, or even a insane person would put themselves through this torture!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sihabarshad",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": "Waste of money ..waste of time.. Do not watch this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Rajgupta25",
        "review_rating": "1",
        "review_title": "Even deserve 0/10",
        "review_detailed_main": "I am not salman hater and even I liked Wanted,BB and Dabangg 1 as well..but this is serious blunder..whole movie is in slow motion.. unnecessary songs... highly predictable plot and Worst acting by Salman itself..Even if someone is salman's diehard fan and call it for entertainment I can prove him or her wrong...0/10"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ShriArunKumar",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Just saw Dabangg 3 and I am already forgetting what was in the film, it is that bad. One of the worst movies I have seen in theaters. The first half is awful. There are few jokes, which writer would have written to make people laugh but not a single person in the theater laughed. Scenes were dragged for no reason. Salman looked constipated throughout the film. He is shown as 25 years old but looks not a day younger than 50 years old. The storyline is extremely weak and forgettable. This is the worst movie of Dabangg franchise."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sundrani-shaizad",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": "Tatti hai bhai Worst movie ever made Waste of time"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dipumirdha",
        "review_rating": "9",
        "review_title": "Blockbuster Movie",
        "review_detailed_main": "Only Salman Khan Rules...BLOCKBUSTER Movie *Must Watch*"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pragyaarora93",
        "review_rating": "2",
        "review_title": "Dabang 3",
        "review_detailed_main": "Total waste of money, worst comedy, action storyline, only the villain (Sudeep) did justice to his role."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "avininjas",
        "review_rating": "1",
        "review_title": "Worst movie ever.",
        "review_detailed_main": "Story - 01/10 Unnecessary music - 01/10 Acting Or Overacting - 02/10 Dialogues copied from south movies - 01/10"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "gagankohli-29839",
        "review_rating": "1",
        "review_title": "Please Don't waste your Mind and Money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ravimendapara",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie, they think public is fool. Unrealistic"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "manoharaka",
        "review_rating": "3",
        "review_title": "A big No",
        "review_detailed_main": "Seriously pls stop wasting your money..its not worth it. Only thing which is slightly good is sudeep's acting and his lines in the movie. Every other thing is preposterous. Do yourself a favour, just keep calm and let this movie pass..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rakshitsingh-48392",
        "review_rating": "1",
        "review_title": "Irritateting",
        "review_detailed_main": "Flop Movie Of The Year,Learn Something From Actors Like Ayushman Khurrana,Salman Khan Pe Kabhi Trust Mat Karna,such a wastage of money"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shashirajhegde",
        "review_rating": "1",
        "review_title": "Waste",
        "review_detailed_main": "This movie should not have been made. Wasted resource"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shanushekhar",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "This is the worst movie of Salman khan ever watched, non-sense actions, comedy. Literally crap"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "anjraina",
        "review_rating": "9",
        "review_title": "Full on entertainment",
        "review_detailed_main": "Loved the movie.. Dailouge, comedy, actions, love and emotion.... All are there in this movie... Its a family movie with guaranteed entertainment.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ajeetdewangan",
        "review_rating": "6",
        "review_title": "Simple story Time pass family movie but not like dabangg 1",
        "review_detailed_main": "Movie was a good but nowadays people can't watched these type of movi .story of this movi is very simple like 90s movies. so modern people can't attached this film...but when all family together seen this movi then they like it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Not among Khan's very worst...just close.",
        "review_detailed_main": "I usually don't watch sequels without seeing the original film. However, when it is a bad movie and the original isn't so bad, I go right to the bad film in some cases. Why? Because the sequels have managed to make IMDB's ignoble Bottom 100 List...and I, for some odd reason, like to see these films. Fortunately, it's not all I like...there are many wonderful films I love. But ever since reading \"The Fifty Worst Movies of All Time\" (by Harry Medved), I find I occasionally like seeing godawful movies just for the laughs they unintentionally generate. Will \"Dabangg 3\" generated laughs...or just be a chore to finish?\n\nSalman Khan stars in the series and I've seen him in quite a few other Indian films. I must admit he is not among my favorites...mostly because the films of his I've seen tend to be gangster and action ovies....which are not among my favorites...though I have loved a few of his movies, such as \"Baabul\" and \"Baghban\". Unfortunately, he's also made movies like this one as well as \"Race 3\" and \"Tees Maar Khan\"...which are among my least favorite Indian films.\n\nLike in the other \"Dabangg\" films, Khan plays a cop...Inspector Pandey. He's a super-cop who is able to take on gangs all by himself...though the film definitely tends towards showing him doing this in a comedic and over-the-top manner...and almost cartoonish. It also uses a lot of so-called 'wire fu'...a technique popularized in Hong Kong martial arts films where folks fly through the air when fighting...because they're being pulled by wires (which are digitally removed...making the person seem to 'fly'). This COULD work...but does it? Well, judging by its overall score of 3.0, I'd say that would be no.\n\nWhat's to like? Well, like many Indian films, there is the usual singing and dancing...and it's choreographed well and the songs aren't bad.\n\nWhat's not to like? The biggest problem I noticed is Khan's character. At times, he is almost a caricature and if you don't like this strange and funny caricature, then you're in trouble as he's in every frame of the movie!! He also often stares into the camera...mugging quite a bit. Khan lovers will like this...most others will just feel it's a case of Khan overload or that this is some vanity project.\n\nOverall, too much action, one dimensional characters and, most importantly, not much fun to watch. It's not among the worst Indian films (despite being on the IMDB Bottom 100)....but it's pretty difficult to enjoy...even as a bad film."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "adiagrawalu",
        "review_rating": "1",
        "review_title": "Utter rubbish",
        "review_detailed_main": "He is totally waste for Bollywood. Making such waste movies."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jayantkumar-26330",
        "review_rating": "1",
        "review_title": "Mind crashed",
        "review_detailed_main": "Don't watch it an any cost.. Only thing is good is sudeey.. If y are blind sicker of salman then go.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "manishkgzb",
        "review_rating": "1",
        "review_title": "Kachra movie",
        "review_detailed_main": "Same 90s type movie It is very bad movie of the year . Please don't waste your money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "visheshpunia",
        "review_rating": "1",
        "review_title": "Hagg diya",
        "review_detailed_main": "Ghatiya movie, wahiyat, don't waste your time. Story worst, Salman's acting worst"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shuklvineet",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "A movie can't get worse than this. I am not sure what is good in this movie.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vidwathpk",
        "review_rating": "2",
        "review_title": "The worst movie ever.",
        "review_detailed_main": "Bad directing, worst acting and bad story. One of the worst movie made by Bollywood."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ck-90060",
        "review_rating": "1",
        "review_title": "Boycott Bollywood Mafia druger",
        "review_detailed_main": "Bahut hua Ab papa or nana ka Rool kar le.dabang nahi kutta vi nahi puchega jo SSR ke saat kiya Bollywood."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sidhinath",
        "review_rating": "10",
        "review_title": "Mass movie of the bollywood",
        "review_detailed_main": "Awesome Massy movie of bollywood, family entertainer no vulgarity."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "beinggauravsinha",
        "review_rating": "7",
        "review_title": "Masala entairtainer....",
        "review_detailed_main": "A pure Salman khan style mass entairtainer but weak story and too much songs ruins the screenplay... good action .. highlights are chulbul pandey style and kicha sudeep class acting ..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pankaj_xyz",
        "review_rating": "1",
        "review_title": "Please don't watch it",
        "review_detailed_main": "Epic disaster, some actions are good, only Salman khan fans will like this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "likhithflix",
        "review_rating": "1",
        "review_title": "2 and half hours headache",
        "review_detailed_main": "Am speechless after watching this film it is so boring with mindless plot and unnecessarily fitted songs in middle and logic less fights and over show off six packs and what not it's a complete package of crap watch at your on risk and this one star is just for sudeep"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nadkarnisumeet",
        "review_rating": "3",
        "review_title": "Cop Out!!",
        "review_detailed_main": "Dabangg 3 review :\n\nSalman Khan is back to wish us Merry Christmas. Usually reserving an Eid release for his films, he decides to give his fans an early Eidi this time. Enjoying superstar status like no other today, Khan ticks off all the boxes in the checklist of what his fans typically desire from him.\n\nA hero wali entry- tick Slow motion action - double tick Cheesy one liners - tick tick tick One item gaana - tick Shirtless scene - tick tick. (Even his pants drop in this one). A formidable villain - tick\n\nIn short, Dabangg 3 has everything crammed in its two hour fifty minutes run time just to please the lowest common denominator which comprises Salman's loyal fan club.\n\nWhat the film doesn't have is a story, sense and sensibility. Now now, dont take me to be an elite prude or a Bhai hater! I aint. Infact, I personally liked his Dabangg 1 (2010) and few recent blockbusters like Bajrangi Bhaijaan (2015) and Sultan (2016). I genuinely tried hard to enjoy Dabangg 3 as well but failed.\n\nThe first half is pathetic where nothing - absolutely nothing - happens. The family shamily drama is a yawn and Chulbul Pandey's (Salman obviously) backstory with his young sweetheart Khushi (Saiee Manjrekar) is unexciting, to put it mildly. That debutant Saiee looks like Salman's beti in the romantic scenes makes matter worse. ..\n\nNext, the main villain Bali Singh (Kichcha Sudeepa) enters the frame, falls for Chulbul's girl and begins his full on rivalry with Pandeyji.\n\nOn the films only positive, Kannada Superstar Kichcha Sudeepa plays a truly effective antagonist and actually steals the thunder from Salman bhai in most of the scenes he appears in. Brilliant!\n\nSaiee Manjrekar looks pretty but gets too small a role to prove her acting chops. Sonakshi Sinha, reprising her role of Rajjo, is strictly okay. Pramod Khanna fills in for his late brother Vinod Khanna's Prajapati Pandey role. One misses the original Munni Malaika Arora's sexy thumkas in the 'Munna Badnaam hua' item number.\n\nOn the tech front, editing by Ritesh Soni is below par. Prabhu Deva's direction is even worse. More woe, the songs are not a patch on the previous two installments and they keep popping up every ten fifteen minutes to slow down the already sluggish narrative. The action finale is stretched beyond a point of endurance.\n\nFinally, Dabangg 3 seems to be a hurriedly made and haphazardly assembled product which adds no value to the franchise.\n\nSince a decade or two, Salman Khan has been repeating himself in film after film. Nevertheless, he has achieved remarkable success churning the same outdated content to his star struck fans. The question remains, For how long??!!!!\n\nRegards Sumeet Nadkarni"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dr-israr-ahmed-khan",
        "review_rating": "5",
        "review_title": "Dabangg 3",
        "review_detailed_main": "Masterpiece / Entertainment Guaranteed / One of the best movie from dabangg franchise / Salman khan Megastar"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jazibsatti",
        "review_rating": "1",
        "review_title": "Absolute Tatti",
        "review_detailed_main": "Everything in this movie is just plain garbage.The songs are so bad specially YUnn kar ke.We do not deserve movies like Tumbbad.This piece of trash is gona make hundreds of crores.This shows where our industry stands."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Undertaker20",
        "review_rating": "1",
        "review_title": "Money is everything",
        "review_detailed_main": "A poor actors the fruits of nepotism are playing lead role and the one who is actually an actor gets the chance to be Villian. Okk wow thanks Bollywood,the reason i prefer telgu,tamil and Hollywood movies only their is too nepotism but it's contain class though but here all are garbage"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akshayfan-83284",
        "review_rating": "1",
        "review_title": "Race 3 ka Baap",
        "review_detailed_main": "Oh my God. I can't explain how bad this movie is. Poor direction to poor dialogue. Dabangg3 is unbearable. Wish there was zero rating system! Skip it"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abhishekjha-79309",
        "review_rating": "1",
        "review_title": "Please save your money",
        "review_detailed_main": "Same larger than life hero romancing with half of his age actres without any script and mahafaltu songs like yu karke😅 i mean why salman why... Why wasting so much money to make this type of waste movie.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "iamrvparmar",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "samratmitra11",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": "The Movie starrer Salman Khan has power-packed action along with romance and comedy. Basically Salman khan playing the role of a police cop who hates any type of criminal offences and protest it .The movie has high voltage action which adds flavour to the movie but the film tried to comedy in this particular plot which is not done well.Overall the movie has above the average rating in terms of entertainment"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "royaakash-49347",
        "review_rating": "1",
        "review_title": "It's a Disaster",
        "review_detailed_main": "Dabangg3 was huge disappointing. Really I want my money back. Nothing new & extremely boring. Save your money & time. Good luck."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "satyam-88746",
        "review_rating": "1",
        "review_title": "Cringe fest",
        "review_detailed_main": "Absolutely a trash movie.Very hard to even tolerate this madness. P.S Bada nuksan hua darling tere liye."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "wwwdspandey",
        "review_rating": "1",
        "review_title": "Wastage of money",
        "review_detailed_main": "I went to watch in friday night with my friend and now she is not talking to me as she was so bored in film nkthing to watch the worst part is sonakshi acting .Please donot watch guys . I am so upset as I have lot lf acceptations from this film"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ankiy-18",
        "review_rating": "1",
        "review_title": "Just plain bad",
        "review_detailed_main": "It's a terrible movie with little to no storyline and over the top action. The movie has childish comedy and does not make you laugh."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ravindrababu-10238",
        "review_rating": "1",
        "review_title": "Most worst movie i have ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mkumar-45758",
        "review_rating": "1",
        "review_title": "Third class movie Dabang 3",
        "review_detailed_main": "Completely third class movie. No story line. I wasted my money and time. How can Salman khan works in this kind of movie which is completely insane. Doesn't he has some insight."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akhichintaram",
        "review_rating": "1",
        "review_title": "Not Worth the Hype and Illogical fight scenes",
        "review_detailed_main": "Mess. Much worse than Dabbang 2. Salman please stop. It was very cringeworthy and a little offensive"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "naik-06471",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Have seen some great Salman Khan movies but this is flop Wanted Tiger Zinda Hai Ek tha Tiger Sultan"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "bagbanzuber-77935",
        "review_rating": "9",
        "review_title": "Perfect Mass Entertainer of 2k19",
        "review_detailed_main": "This Decade Started with Bang for Superstar Salman Khan & without any Doubt it will end With a BANG\n\nA Perfect Family Entertainer with Perfect Dose & Mixture of ACTION+COMEDY+EMOTIONS\n\nComedy looks so Real that it will made u laugh hard & Emotional Scene & Flashback scenes Are best Suited **Special Mention : Pre interval Scene Salman Khan's act Kichha's Intensity & that Sad BGM you will connect with Chulbul Easily & the Climax FaceOff🔥\n\nKichha's act As Balli is exceptional Most Dangerous & Badass Villain of Dabangg Franchise He Acted so Perfectly that Chulbul VS Balli looks likes a Perfect Revenge Fight\n\nOne Star less cause of the Unnecessary Songs added\n\nOverall A Perfect & a Massiest Movie for the Festival Weekend which u can Enjoy with Your Family"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abhineet150",
        "review_rating": "4",
        "review_title": "Typical stereo type Dabangg prequel",
        "review_detailed_main": "As I didn't had much of an expectation from Dabangg 3 and same was found to be true\n\nThe only Dabangg which was good was Dabangg 1.\n\nSKF should put an end to Dabangg line up.\n\nNothing new. Even story wasn't catchy.Actoon scenes seemed like taken from Dabangg part 1 and 2 and looked repeatative.\n\nTrying to create Munna badnam song which wasn't catchy either compared to Munni badnam.\n\nBetter to skip this one and watch it on television."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "prakashdiwatai",
        "review_rating": "1",
        "review_title": "Worst worst worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vaanikhare",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "To start off, the movie had like 8-10 songs, NOT AN EXAGGERATION! I swear by the 8th song everyone in the theratre did a collective sigh. Besides that, the movie had no story line, at least not a good one. I knew the second dabaang was a little lacklustre compared to the first one, but this move was TOTAL trash. Can't believe its part of the Dabaang franchise. Don't waste your money and time. Only good part was the villain, but even then, Sanjeev's acting was a little cringe."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pratikthakkar-47510",
        "review_rating": "1",
        "review_title": "Waste of time and money! Not recommended.",
        "review_detailed_main": "As name of movie and Salman Khan's. Movie is not that as excepted to be. Same thing again and again. Story has no clue, action was like previous moves and comedy is clueless. Flop movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "atanuadhikary-12021",
        "review_rating": "1",
        "review_title": "Dabangg 3 movie review.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "devaanalyst",
        "review_rating": "1",
        "review_title": "Don't waste your money on this",
        "review_detailed_main": "1. Stupid acting 2. Stupid story 3. Comedy sceens fail to make you laugh 4. With worst story even bad story telling 5. Songs out of no where will pop up in the middle of what you might feel is something interesting coming 6. Salman Khan should stop doing this to his fans"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Tejas_Vinda_AITS",
        "review_rating": "4",
        "review_title": "For Salman's Fans only .., otherwise it Bores 🙁",
        "review_detailed_main": "1st thing first -\n\n3 stars only for Salman's strange attitude as Hero... Bhai's fans find it awwsum & movie lovers find it WTH.\n\nDabangg 3 is regular Bollywood masala entertainer.\n\nSalman Khan's Dabangg 3 is a prequel to dabangg1&2.\n\nThe film is the journey of how Chulbul Pandey becomes the witty, yet corrupt but good at heart cop loving called Robinhood Pandey.\n\nPrabhudheva is repeating his 'Wanted' style with Dabangg 3,....& it tests your patience.\n\nHe portrays Salman Khan's heroics in the most heroic way possible.\n\nIt takes optimum advantage of slow-motion technology...wch bores..!!\n\nAn over enthusiastic pair of Sajid-Wajid kills the watching experience multiple times. They throw unnecessarily songs at you fracturing your thoughts about the film. Songs serve no purpose whatsoever.\n\nI would recommend Dabangg 3 for all those people who want to see Salman as Superman."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "itsshowtimes",
        "review_rating": "9",
        "review_title": "A must watch movie",
        "review_detailed_main": "This film was very entertaining Salman khan was very good in the movie....a Massy film with classy dialogues and Sudeep steals the show he is amazing"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sureshkaukuntly",
        "review_rating": "1",
        "review_title": "Salman should retire",
        "review_detailed_main": "Salman should stop making movies before its too late. He cannot have any expression in his face, he is old tiger now. Before he loses his much of fan base, better he himself quit, such utter waste of time and money watching this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "surajitbaishya",
        "review_rating": "2",
        "review_title": "Typical Dumbass Salman's Film",
        "review_detailed_main": "Salman is gradually becoming intolerable with his nonsense movies. Films and acting are joke to him. Definitely the most overrated actor of Bollywood is none other than this dumbo. Don't go for this movie it's actually a headache to watch it inside the theater. This man is making us fool with his each and every release. People should immediately boycott his movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sanalsjm",
        "review_rating": "1",
        "review_title": "This movie is one of the most ridiculous thing I watched in a Theatre",
        "review_detailed_main": "First of all this movie doesn't make any sense to me. I can understand the fan base of Salman Khan and he has to entertain his people. But I believe he could have done it in a better way as the dialogues, songs and the so called comedy scenes are not connected , it doesn't have any continuity or relation with each other. What a crappy movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rs-66837-51533",
        "review_rating": "1",
        "review_title": "No acting no content",
        "review_detailed_main": "Sonakchi pls stop doing acting ,respect this art .boring u can't even tolerate for 30 min."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sairairfan-86335",
        "review_rating": "4",
        "review_title": "Same old same old",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "amitsheoran",
        "review_rating": "1",
        "review_title": "Complete rubbish",
        "review_detailed_main": "There is nothing in movie to talk about.its a very boring movie.0 stars out of 10.dont waste your money n time on this movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ranjitchohan-66875",
        "review_rating": "1",
        "review_title": "Don't waste your life watching this garbage",
        "review_detailed_main": "I'd give it zero stars but there was no option for that. This film was a complete flop. Make way for fresh actors Salman, you've had your time old man. I had to walk out because watching this movie was mental torture, complete load Garb."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "AMG17",
        "review_rating": "1",
        "review_title": "Rating it 1 without even seeing the trailer",
        "review_detailed_main": "I don't have the guts to watch the trailer let alone the movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "beingsrbsumit",
        "review_rating": "8",
        "review_title": "100% paisa vasul movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mohanank",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "This is the worst movie I have seen for a long time. Salman is ripping off his fans."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ucsaurabh",
        "review_rating": "2",
        "review_title": "Not at all",
        "review_detailed_main": "The movie is only for a specific audience that is core salmaan khan fans and no one else. The movie has no extraordinary things or new things, it just go around in the same way.\n\nThings I liked about the movie 1. Kiccha Sudeepa The factor that saves the movie from being a complete disaster is Kiccha Sudeepa's performance. He as a villan has given a perfect welcoming to himself in this Bollywood industry. His role is the only thing you wish to watch again and again. This actor can nail any role given to him.\n\n2. The connections The past two installations have been used in a perfect manner to create a unknown version of Dabangg or in other words the flashback of Dabangg.\n\nThings for not to watch this movie. 1. Songs Except 'Munna Badnaam Hua' you cannot enjoy any songs, even if you want to enjoy them.\n\n2.Cinematography Nothing new from Prabhudeva. The cinematography was better in the last two installments.\n\n3.Only Salman The movie is not much crowded but watching only salman for the whole time makes the movie unbearable.\n\n4.The story The movie doesn't give you any kind of thriller. The story is completely predictable and no twist or turn in the movie.\n\n5.Action sequels The overwhelming action sequels just urge you to go away from the theaters."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "DrSins",
        "review_rating": "1",
        "review_title": "Gargage",
        "review_detailed_main": "Trying to copy so many things again and again and again fooling audience complete waste of time and money"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "parthgoel-74406",
        "review_rating": "1",
        "review_title": "This is not going to help",
        "review_detailed_main": "The people who are thinking of watching this movie wont care for the ratings and this still going to be a 100cr 'superhit' movie, so ratings doesn't matter for this. Second the people who are thinking as a critic wont watch 'bhai's' movie since they do not have story sense etc etc. So leave critic just watch if you want or leave it if you want to use your brain."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "KDerekar",
        "review_rating": "1",
        "review_title": "Yet another typical non-sense movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ConfusedRoulette",
        "review_rating": "5",
        "review_title": "\"A weak story paired with an overdose of action!\"",
        "review_detailed_main": "The Dabangg movie series has almost established itself as a cult cinema series and it always reminds us of Sallu Bhai's signature moves, whenever we think about it. The 3rd installation of the series is now finally here and this movie has been dubbed into Kannada also this time to cater to the Kannada speaking audience. This is another win for the dubbing activists as the dubbing 'ban' of other movies into Kannada cinema is steadily coming off!\n\nThe story of the film has its links to the earlier 2 parts and mainly shows Chulbul Pandey's encounter with another gangster named Balli Singh. The story also shows some events prior to that of the first film, acting as a prequel. It shows how Chulbul becomes a loveable cop A.K.A. Robinhood Pandey and how Balli Singh is connected to his past.\n\nThe script is very poorly written with a predictable and uninteresting storyline. The film feeds the viewer with a huge platter of action than what he can actually digest! There are also lot of illogical twists and turns making this one a draggy affair.\n\nThe film lacks the effective usage of dialogues and there should have been more of it to keep the viewer engaged. There are also a lot of unnecessary slow motion scenes, testing your patience and making this movie experience a tedious one to watch.\n\nSalman Khan is at his usual best, Kicchha Sudeepa gives out a good performance. Sonakshi Sinha looks beautiful as Chulbul's dear wifey! Saiee Manjrekar gives a picture perfect act. The music is the major plus point of this film and there are some catchy foot-tapping songs which will definitely entertain you!\n\nAll in all this film has a weak storyline and an overdose of action sequences. It can however serve as a decent timepass cinema outing for the family audience!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "coolguyajit",
        "review_rating": "2",
        "review_title": "Another nonsense from Salman",
        "review_detailed_main": "I dont know whats up with Salman. Im his big time fan, but even i couldnt watch this movie in full. I left right after the Munna song and Im thinking why didnt I leave early. Its pathetic. Given 2 stars just because of Salman. Otherwise my review would have been in negative. Its high time he gets back to some sensical movies like Bajrangi and Sultan. Im really afraid he seems to be digging his own grave. Eagerly waiting for Inshallah and Radhe. Hope these movies wont disappoint like his recent movies like Bharat and D3. Prabhudeva seems to be looking for exploiting punches and dialogues from D1 and D2 but falls too short. Im utterly disappointed, had big hopes from the Dabangg genre. It seems none of the characters was interested in doing this movie and everyone is just sleepwalking. Sai seems fresh and Sudeep too dramatic. I couldnt find anything appealing to sit through the entire duration of the movie, didnt even wait for Sallu to go shirtless. May God give him some sense. His ardent fans like me expect much more from him."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "suyashkrishna",
        "review_rating": "1",
        "review_title": "Trust me, unbearably boring",
        "review_detailed_main": "I really loved Dabangg 1 and 2... If this one would have been the same level as Dabangg 2 I wouldn't have minded...\n\nBut this one is like it's forcing itself to be entertaining... Many serious scenes contained some bad or irrelevant 'trying to be' funny dialogues...\n\nSongs are bad and are placed where they are not needed...\n\nI watched it full just to see how worse it could get..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kumarhimanshu1993",
        "review_rating": "10",
        "review_title": "Paisa Vasool Entertainment",
        "review_detailed_main": "Delivers what it promises...Entertainment in abundance."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "beingasif",
        "review_rating": "5",
        "review_title": "A PURE MASS ENTERTAINER",
        "review_detailed_main": "This movie is all about \"Entertainment\"! From beginning to end it's a pure mass entertainer. I watch movies for ENTERTAINMENT. I got a pure dose of entertainment from this movie.\n\nIt's a Salman Khan Show. As a villain Kiccha did a fantastic job. Saiee is adorable.\n\nAnd the pre interval scene is such a touching and will make you engage.\n\nCLIMAX is good too.\n\nPure Entertainer go for it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dr-israr-ahmed-khan",
        "review_rating": "5",
        "review_title": "Masterpiece 👍👍👍👍",
        "review_detailed_main": "Best movie from dabangg franchise. Superb movie. Entertainment guaranteed"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "natashapuri",
        "review_rating": "1",
        "review_title": "One of worst ever movies!!",
        "review_detailed_main": "Total crap! No story line, no dialogue, fictional fights and what not! The brand name of dabangg itself is spoilt by this movie! Total waste of time and money! Don't ever go even if you get free tickets!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jaindivij",
        "review_rating": "1",
        "review_title": "Blunder",
        "review_detailed_main": "Just don't go. Please for god's sake. It was a blunder"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sammen-84304",
        "review_rating": "2",
        "review_title": "Could have been af very good Movie. To bad. Luv Salman Khan.",
        "review_detailed_main": "Sorry to say it. This movie sucks in many ways. Much to long. But also some fantastic scenes. Luved the songs and dances. Only see this Movie if you are a BIG fan."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abdurrahman_emdad",
        "review_rating": "1",
        "review_title": "Save your money.",
        "review_detailed_main": "Please don't waste your time. You will talk to yourself or your friends while movie is played in the background."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Leo_Indian",
        "review_rating": "1",
        "review_title": "If you dont know Sh**..then watch this movie",
        "review_detailed_main": "Salman Bhai has nothing new to offer to audience.. few reasons 1. He doesn't know acting. 2. This is his home production with useless brothers and useless director. 3. Better movies with good script and acting is available. 4. Rajjo has no charm..not better than my kamwali."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "manishmanu-98925",
        "review_rating": "2",
        "review_title": "A total disappointment,",
        "review_detailed_main": "The worst movie of the dabanng franchise , this is what happens when salman Khan acts, casts, writes,dances , screen play all in one movie. Only that there are some Jokes in this movie, which makes you laugh at times. Please don't watch this movie and don't recommend to anyone else to , bharat was way better movie than this. So decide wisely whether to go for the movie or no."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tejasplanet",
        "review_rating": "10",
        "review_title": "Plz Read",
        "review_detailed_main": "Big Thing. HATERS WILL HATE. There are so many movies that follow such a basic plot that is very predictable. But now Salman has done one, so ppl are hating that. Its Entertaining, Action Packed and Romantic. It's a great movie. Plz just watch the movie :)"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kushalsethi",
        "review_rating": "1",
        "review_title": "Not worth watching even on Torrent",
        "review_detailed_main": "Really it's that bad. Watching any C grade pic would be heavenly in comparison. People (including myself) walked out before interval."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "raizelslash",
        "review_rating": "1",
        "review_title": "bad one of the worst movie of all time",
        "review_detailed_main": "How can a man play the same character with no plot...no qualities, same fight scene, bad comedy . The only good thing abut the movie was the villain, at least the villain had some personality , this rating 1 is also only for the villain , overall movie was a disaster. Not even salman khan fans can defend this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nirzak",
        "review_rating": "3",
        "review_title": "Just another worste one of Salman Khan",
        "review_detailed_main": "If you want entertainment then may be this movie can satisfy you but really don't expect too much from it. Don't kill your valuable time and reserve it for a good watching movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tomcruise-51151",
        "review_rating": "1",
        "review_title": "As usual totally Crap",
        "review_detailed_main": "Save your money & skip this movie. Unbearable screenplay, worst music, dialogue.\n\nTotally crap."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Anita-1990",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Bollywood is literally going to garabge. Super pissed with the movie, so much over acting, lame jokes, and the slow motion just doesn't stop!! Ridiculously long and every other second was a song. Waste of money and my time!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "yashhmotani",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "As usual this was again a crap movie by salmaan khan....Expect nothing from him....boring songs.... Bad story....bad acting"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kumaraman-34074",
        "review_rating": "3",
        "review_title": "Worse ... .",
        "review_detailed_main": "Waste of money and time too..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "arjundec-98016",
        "review_rating": "1",
        "review_title": "Crap Movie.",
        "review_detailed_main": "Crap Movie. Dont waste 3 hour of your life and hard earned money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "beingman-39391",
        "review_rating": "10",
        "review_title": "The best movie",
        "review_detailed_main": "The best movie must watch😘💓. Salman khan Sonakshi Sinha"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mandhania",
        "review_rating": "1",
        "review_title": "Horrible , please refund",
        "review_detailed_main": "Horrible movie, disgusting , pathetic , cheap , no story , pathetic acting, terrible songs, torture watching this movie.\n\nREFUND OUR HARD EARNED MONEY."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "souparnak",
        "review_rating": "1",
        "review_title": "Awesome mind focking exallant babi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "cdt-abhinav",
        "review_rating": "4",
        "review_title": "Insult to DABANGG series... JUST WHY WAS THIS MOVIE PRODUCED???",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "namantiwari307",
        "review_rating": "1",
        "review_title": "Worst of all",
        "review_detailed_main": "Do not go and watch this movie. Total waste of time and money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vibhavjp",
        "review_rating": "1",
        "review_title": "Another physics breaking film by Sallu bhai",
        "review_detailed_main": "As the memes go, LAWS OF PHYSICS PREPARED TO BE BROKEN. Another physics breaking movie by Salman Khan. Can people just stop making sequels to bankable films and if they want to, they should at least make with some quality"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abhishekba-38538",
        "review_rating": "1",
        "review_title": "Not good",
        "review_detailed_main": "Expect kichha acting everything is crap....\n\nThis is not a good movie.. better go and watch asn"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hrishimuni",
        "review_rating": "2",
        "review_title": "Worst movie of the year 2019",
        "review_detailed_main": "Movie is waste of money and waste of time.we can call this is the worst movie ever played by salman khan."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "getpratheek",
        "review_rating": "5",
        "review_title": "DISAPPOINTED AND SORRY!",
        "review_detailed_main": "I really don't know how the dots were connected on the story perspective!! I was never bored watching Salman Khan's movie. Disappointed. Better luck next time Dabangg team."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jasmin-26547",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "binupbinup",
        "review_rating": "1",
        "review_title": "Movie without story and logic. Time waste movie",
        "review_detailed_main": "Salman seems happy by playing nonsense story in the movie. Dabang3 makes audience fool and charge money for stupid story. Audiences should better be at home and help their's mother."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ashoknsheth",
        "review_rating": "3",
        "review_title": "What a movie!",
        "review_detailed_main": "Is Salman Khan an Indian Citizen? Deport him to Pakistan for producing such a movie that can only be appreciated by his diehard fans across the border! Goodbye and good riddance!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "piyushapple",
        "review_rating": "1",
        "review_title": "Eh.",
        "review_detailed_main": "Salman Khan is now overconfident. He thinks whatever film he makes it will earn 300 crores."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "titulika",
        "review_rating": "3",
        "review_title": "Only salman khan factor was there",
        "review_detailed_main": "Watch the movie for our bhai and liked kichha sudeep part too..other than that.nothing else made sense"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sumit-tiwari1010",
        "review_rating": "1",
        "review_title": "I'd rather watch a rerun of Hum saath saath hain than this pile of garbage",
        "review_detailed_main": "Don't want to waste anymore time talking about this movie, consider yourself warned!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "khanirsal",
        "review_rating": "1",
        "review_title": "If a salman khan fan still don't watch it",
        "review_detailed_main": "Same old revenge no logic and to be honest not funny either"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "krishnayadavrock",
        "review_rating": "1",
        "review_title": "Very patethic movie, pyaj le lo paise ke",
        "review_detailed_main": "Maha ghatiya movie, acting third class, drama is horrible"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "wganesh-48586",
        "review_rating": "1",
        "review_title": "Acting is worst and the story is missing.",
        "review_detailed_main": "Worst acting. Salman Khan should understand that this is not the era at which he can make people fool by his name only... people need acting and story not just your face. if such stupidity is on then u should leave acting."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kushagrasardana",
        "review_rating": "10",
        "review_title": "Flawless",
        "review_detailed_main": "Super entertainer of 2k19. Story was good but picture is very long because of the songs but yaa overall full powerpack performance by salman."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rajashahrukh-35006",
        "review_rating": "1",
        "review_title": "Why Salman Khan why.",
        "review_detailed_main": "Utterly stupid and nonsense film. Salman Khan should leave acting after this movie. He just want to show that he is a macho man in his every film. Only brainless people watch such films. Salman Khan is doing one crap film after another."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "lvkmum",
        "review_rating": "1",
        "review_title": "Time Waste & Money Waste",
        "review_detailed_main": "I Feel Sorry I Hardly Sit For 30Minutes In Cinema And Felt Very Bad. Its Totally Time Waste🤔 And Money Waste😣😡😴😪."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "MsClashKingYT",
        "review_rating": "1",
        "review_title": "By MsClashKing YT",
        "review_detailed_main": "Every Thing you expect from the Modern Day Blockbuster Bollywood movie. D+"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rohansrivastava",
        "review_rating": "3",
        "review_title": "Not like part 1&2",
        "review_detailed_main": "Movie is not up to the mark as expected, too many songs in the movie. Lgta h movie jaldi jaldi me bhi h and khichi gyi h movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shubhamprakashkarad",
        "review_rating": "1",
        "review_title": "3rd class action movie",
        "review_detailed_main": "Don't waste your time and don't loose your mind.. it's 3rd grade action movie with routine story.. nothing New I don't know why all trolling Arjun Kapoor when Salman Khan is there 🤣🙏worst actor"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shivydv",
        "review_rating": "1",
        "review_title": "Senseless, boring.",
        "review_detailed_main": "No story, no emotion, no logic. This movie may like Salman khan fan but for general people it may be head aches. Except action there is nothing to watch."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "anuragayushi",
        "review_rating": "2",
        "review_title": "Waste of stardom and nepotism",
        "review_detailed_main": "Trying to become allrounder, going in vein the money, the time and the stardom"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "parthvenkatesh",
        "review_rating": "1",
        "review_title": "Because cannot give it a 0 star.",
        "review_detailed_main": "Save yourself and don't watch it. You have only one life, and every second counts. Once you watch it, you will feel like you have wasted your time. However, there's one condition to watch it, be naive."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abisen",
        "review_rating": "9",
        "review_title": "A fully Mass Entertainer",
        "review_detailed_main": "Love this film... Complete package of comedy, action, romance, drama....Salman sir is outstanding...Kichcha Sudeep is exceptional"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rjrama",
        "review_rating": "1",
        "review_title": "Boring bollywood crap !!",
        "review_detailed_main": "movie without any logic and story Boring.... Worst movie ever !!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rbhan91",
        "review_rating": "2",
        "review_title": "Pathetic",
        "review_detailed_main": "Time waste\n\nNo story.\n\nTrying to do anything in name of entertainment. Sudip was good"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vkmn-27797",
        "review_rating": "1",
        "review_title": "Contentless movie",
        "review_detailed_main": "Contentless worst movie. And as expected, u can't expect a good movie from Bollywood"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "satishmeghani",
        "review_rating": "1",
        "review_title": "Extremely bad and pathetic movie",
        "review_detailed_main": "Totally boring and time wasting movie. It's lacks common sense completely. All physics students beware before watching this EPIC crap! I want my money back!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vijaynj",
        "review_rating": "3",
        "review_title": "3 star for sudeep and sai ...salman and sonakshi full overacting",
        "review_detailed_main": "3 star for sudeep and sai ...salman and sonakshi full overacting"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mayank_dx",
        "review_rating": "1",
        "review_title": "I want my money back",
        "review_detailed_main": "I seriously regretted that why i went to see this movie. Utter non sense. Same overacting by salman khan. Worst movie i ever watched"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mohitmadhwani",
        "review_rating": "1",
        "review_title": "Gatiya",
        "review_detailed_main": "Bekaar . clearly just try to earn money on the name of salman Khan ."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sajidkhan-30022",
        "review_rating": "1",
        "review_title": "Another Super-Flop from Superhero",
        "review_detailed_main": "Entire movie can be described in one word...Salman. No acting, no story no character development, no one is allowed to do a scene with Salman Khan and its not even his biography. Shameful way to cash in on his name and franchise name to fall at this worst level of movie making and ripping people off of their time and money. I am utterly disgusted and will no watch another movie with Salman Khan in it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "femidali",
        "review_rating": "9",
        "review_title": "Entertainment, Entertainment, And Enternainment 😎",
        "review_detailed_main": "Salman is juat awesome with his dabangg avatar 🔥 and full on masala film done with high voltage ection 😎 Sudeep is fantastic villain 🔥"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "milestonejockers",
        "review_rating": "1",
        "review_title": "Third part is really Third class.",
        "review_detailed_main": "If you want to waste your time then please watch this film. Total Boring Film. Salman khan's one of the worst. PLEASE don't waste your time...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "bhargav-64445",
        "review_rating": "1",
        "review_title": "Please don't watch Dabangg 3, It's degradation of Bollywood standard",
        "review_detailed_main": "Total waste of money and time, Waste of good hard earned money, I don't think even Salman khan's fan would like this movie. After seeing direction and storyline of movie I think they need really good help, They even lost their last charm - music. Action, acting and story was long gone from the second movie.\n\nI suggest don't watch this movie, it's not worth a while. Instead of watching this movie just do some meditation."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "winak",
        "review_rating": "2",
        "review_title": "Exaggerated with tons of overacting ....",
        "review_detailed_main": "Move on ...Nothing new to watch here. The novelty has long worn off, all we now have is stupid dialogues, stale characters, humourless scenes with crappy songs. Directors must realize era of movies made for hero's self glorification has come to an end.\n\nProspective audience you decide if you want to waste your precious time on this garbage."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "irfanirfa",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mailwajahathasan",
        "review_rating": "3",
        "review_title": "Looking for sense? Don't watch movies then.",
        "review_detailed_main": "It's a complete Bollywood masala movie... I'm not a salman fan but this movie is good for one time watch. Idk why people saying words like nonsense, bad etc for it. It's meant for entertainment. Watch it and enjoy. My true rating would be 7/10."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Raja79",
        "review_rating": "1",
        "review_title": "This Does Not Feel Like Dabang Anymore...",
        "review_detailed_main": "This movie is a shame to Dabang 1 and Dabang 2. The original two movies were such artistic masterpieces wit awesome catchy songs, but this one? It is just cringy, and it brings shame to the first movies as well.\n\nThis movie is nothing in front of the first two movies, and the creativity has gotten severely reduced as well - The first two movies of Dabang had such great directing, acting, songs, script, and everything else, but this one is just plain cringy!\n\nI am going to pretend as if this Dabang 3 never existed and continue enjoying the awesome Songs of Dabang 1 and Dabang 2 - this third one just doesn't feel like Dabang anymore, it feels like a cheap copy."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "msundari",
        "review_rating": "2",
        "review_title": "Worst movie in the dabangg series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "prithvishah-61565",
        "review_rating": "1",
        "review_title": "Worst movie of Prabhudeva",
        "review_detailed_main": "I think Salman Khan written and directed this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nayaknnetravati",
        "review_rating": "10",
        "review_title": "KHATARNAK ACTING BY KICCHA SUDEEP",
        "review_detailed_main": "kiccha sudeep is the center of attraction of this movie his screen presence is mind blowing kiccha is the main reason to watch this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "yashvardhangoyal",
        "review_rating": "1",
        "review_title": "What the hell is this movie",
        "review_detailed_main": "What is this movie. Unable to bear it after first 30 minutes. Bland faces, no expression. The only good thing about dabbang 3 is sudeep."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nittizsumeet",
        "review_rating": "1",
        "review_title": "Worst film",
        "review_detailed_main": "Bollywood is running out of logic and content. People used to mock South Indian movies but Bollywood set to prove that they are worst."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "samgh-34794",
        "review_rating": "2",
        "review_title": "Avoid it",
        "review_detailed_main": "Why Salman why?? 2.5 hrs of headache.. even while watching at home on laptop.. part 1 and 2 were faar faar better ."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tanmoydey-dey55",
        "review_rating": "1",
        "review_title": "Worst movie of this generation",
        "review_detailed_main": "I wish i could give this piece a minus rating....worst movie of this generation....salman khan bhagwan keliye retirement lele re baba....dont wast your valuable money on crap movies like dabangg 3"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "xahzadxaif",
        "review_rating": "1",
        "review_title": "Biggest Bakwas of the year",
        "review_detailed_main": "WTF! have no words to explain this tatti, this movies biggest joke of salman khan"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "adityachhapekar",
        "review_rating": "1",
        "review_title": "Time wasting can't acting salman",
        "review_detailed_main": "Faltu movie. Boycott Bollywood fake body.\n\nFaltu movie. Boycott Bollywood fake body.\n\nFaltu movie. Boycott Bollywood fake body."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pixel-13487",
        "review_rating": "1",
        "review_title": "TATTI",
        "review_detailed_main": "MAST HUG DIYA LADDKE NE ISKE BAAAD TO TOILET JAANE KI ZAROORAT NAHI PADDI HOGI 1 MONTH KE LIYE"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sirmohittomar",
        "review_rating": "4",
        "review_title": "Sry I'm also Salman fan",
        "review_detailed_main": "But look like this movie is released for making money, and using stardum. . New girl really looking great, that part is really beautiful, rest everything this is like watching any old Indian cinema."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "neelamadhabjena",
        "review_rating": "10",
        "review_title": "Loved This Flick !",
        "review_detailed_main": "Dabangg 3 is an out an out entertainer .Must watch for Masala lovers . Story Screenplay Direction everything is paisa Vasool 😍 Must watch"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ababid",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "Worst-ever.Garbage.Dustbin.Waste of money nd time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "omgwtfvideography",
        "review_rating": "1",
        "review_title": "Junky and trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mandeepbuhra",
        "review_rating": "1",
        "review_title": "#BadActing #BadStoryline #BadVFX #BadAction.",
        "review_detailed_main": "#BadActing #BadStoryline #BadVFX #BadAction.\n\n#BadActing #BadStoryline #BadVFX ##BadActing #BadStoryline #BadVFX ##BadActing #BadStoryline #BadVFX #BadAction."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tejaspatelva",
        "review_rating": "1",
        "review_title": "Worst movie in Dabangg series",
        "review_detailed_main": "What a waster of time. Bad story line, bad directions, bad dialogs, bad acting, bad dancing, bad songs except the re-mix one. Overall horrible movie. PrabhuDeva should concentrate in dancing. Please please never direct any movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "saptesh786",
        "review_rating": "4",
        "review_title": "Mardani should take help from this Dabanng!!!",
        "review_detailed_main": "I am fan of Salman Khan, not for his acting but for his kind & helpful behaviour. He launched many new comers in his movies. Here he also launched Sai Manjrekar, Pramod Khanna, Warina for item number and to make Sudeep to enter in bollywood. This is the brigher side of D3 and my 4 starts for this. But worst side is movie is so childish that even a child will laugh on stupid direction. Who is the Prabhudeva ( I know, you know and all knows) who directs such stupid and foolish way? And story writer is Salman. Wow! There is no need of story writer and director to make mega boring movie. Even a kid of 10-12 would direct better. Total failure movie. I barely sat in the hall till end. Salman should stop to work with such stupid directors like Prabhudeva or Remo ( Race 3) and should do some meaningful movie. Nothing interesting in movie. No thrill, no tension and no logic here only glorified drama. To say truly I enjoyed Warina's item number only in whole movie. She looks fresh rather than Nora Fatehi. Rest movie is wastage."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ajith-v-m",
        "review_rating": "1",
        "review_title": "Another Trash!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sharmamohit-22903",
        "review_rating": "1",
        "review_title": "Worst in Series",
        "review_detailed_main": "U can't even maintain continuity.. It's that below average"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chandrima_p",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I would recommend that this movie is a complete waste of time and money. Never seen a worst movie like this."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "amanali-96932",
        "review_rating": "10",
        "review_title": "Superb Full time Entertainment",
        "review_detailed_main": "Awesome movie full entertainment enjoyable Best role performed by kicha sudeep - as bali singh"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Mir_Rock",
        "review_rating": "5",
        "review_title": "Full of banters but very very slow movie",
        "review_detailed_main": "As Salman Bhai's fan I was disappointed with the movie. The main problem was script and directing, as it seems Prabhu sir's latest creation was nowhere near as good as his earlier works like Wanted.\n\nI feel the movie had lots of witty bits but somewhere in the middle they got lost and coupled with SLOWWW motion scenes I felt time stopping for a bit and just wanted the movie to end in the end as I felt sleepy.\n\nI still like Salman bhais movies as you wouldn't expect a Khandani Shafakana or Made in China type sex topics to appear in his movies (yet) so is safe for family viewing. I would rather watch this movie which was mildly entertaining than what has been coming out of Bollywood recently full of 90s remix songs and remakes. I look forward to Salman bhais next film."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "momi746",
        "review_rating": "1",
        "review_title": "Bakwas",
        "review_detailed_main": "Iss Part Ney to Pehly 2 Parts ka bhi Nasha Utaar diya Ghatiya story 👎"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pramila-18308",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "Same story recycled and salman looks like robot 2.0"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "santropy",
        "review_rating": "1",
        "review_title": "3rd rated story and screenplay by pappu...",
        "review_detailed_main": "What exactly is the point of such a film. This is so bad, it is more like a piece of crap in its purest form, a steaming pile of sh**.\n\nStory writing exercises are taught in primary classes, but to have a creativity to write a simple decent story a person needs to have more than single digit brain cells which Pappu clearly lacks. To top it off it is directed by prabhudeva.\n\nEven making a bad film is an art. For example, the cult classic Gunda is made so badly but still it is enjoyable after couple of whiskey bottles.\n\nBut Dabang 3 is just mindless piece of junk."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "iwentaroundtheworld",
        "review_rating": "1",
        "review_title": "Rubbing the Dabangg part one movie name into ground. Pathetic...",
        "review_detailed_main": "I am gobsmacked that you do not need any creativity/vision to be a movie director and can be still in demand and the movie still makes money. Utter crap being dished out to us...\n\nDon't waste your money guys, go and watch some indi cinema. Will certainly have some soul in it. This one has none..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chitraansh-68058",
        "review_rating": "4",
        "review_title": "Bad film",
        "review_detailed_main": "Bad film didn't expect but not a good film all the song was good but acting was not good...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "arv-46199",
        "review_rating": "1",
        "review_title": "Third class hero,third class movie",
        "review_detailed_main": "Don't watch its a third class movie,old same story line,old action,worst dialogs and super worst acting."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shubhamkumartiktok",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "This is the one of the worst movie I have ever seen In my life I letrally walk of the threatry after 40 mins of the movie totally illogically and worst acting if u like content orrieted movies then don't waste time on this movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kunaldarakha",
        "review_rating": "9",
        "review_title": "Family Entertainer..",
        "review_detailed_main": "It was best masala entertainer with lots of emotions , actions and comedy.. Internal scene was best and climax was excellent. Must watch movie of 2019"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ratedrrafid",
        "review_rating": "1",
        "review_title": "Worst Movie of my life",
        "review_detailed_main": "Can this be anymore worse? Worst performance by Salman khan"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "coolrathish",
        "review_rating": "2",
        "review_title": "Useless movie",
        "review_detailed_main": "Gave 2 stars that's too for it's starcast. This movie is pure waste of time and money if you would like to watch it in theater. If you are depressed and then you watch this movie then surly you will go into coma, this is a pure nonsence mocie. I don't understand what Salam in doing this year, he have delivered hammer again again and again. And as it was a Prabhu Deva movie I told to my wife that I won't wast money in theater then it came in Amazon prime videos and I watched alone, I watched it in nearly 4 installment and still I have only watched 1 hour and 13 minutes. I use this movie when I don't have anything to watch. If you are a human, will request everyone not to watch this as this movie requires mental strength, if u have mental strength then u can watch the full movie, or please avoid."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "garry-79420",
        "review_rating": "1",
        "review_title": "Yeh Toh Tatti Hai.",
        "review_detailed_main": "Worst movie. Tatti movie hai yeh matt dekhna. Don't waste time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "domingoomes76",
        "review_rating": "2",
        "review_title": "Don't try to watch this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "panwarabhishek",
        "review_rating": "1",
        "review_title": "Tik tok videos are better",
        "review_detailed_main": "Was bored , started dabangg 3 on prime video. 30 mins in and i am already dead."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "avi-42883",
        "review_rating": "1",
        "review_title": "Overrated, absolute garbage",
        "review_detailed_main": "Yet another Salman Khan movie with no story. I watched it only because of the hype. Wasted my precious time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mraj-73329",
        "review_rating": "1",
        "review_title": "Illogical",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tshubhamu",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Writer Salman khan...what's wrong with bollywood industry now a days."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "azizessimour",
        "review_rating": "9",
        "review_title": "Superb entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tarotreader-13496",
        "review_rating": "1",
        "review_title": "Selmon gandu don't know how to act",
        "review_detailed_main": "To all the directers and producers, why you support this tharki Selmon who is not talented and very arrogant. He not deserve your time and money. He is nothing if you guy never support him at all. Coz of your mistake audience pay the price. Selmon torture every single audience in cinema hall. Saddest part we have to pay price for this mental trauma. Viewers we not deserve this monkey performance.😭 Please don't choose this rascal. Kuch aur dekhlo par isko toh mat dekho Baki apki marzi Peace to everyone Koi rupaya mat kharcho iss kamine par 😡 This movie even not deserve half star😵"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "just_ashishsingh",
        "review_rating": "2",
        "review_title": "Stale and boring !",
        "review_detailed_main": "Dabbang3 is a serious example of taking the audience for granted. The movie is as unoriginal, boring and stale as it can get with done to death sequences for Salman (entry with a bang,munni-munna song, and shirtless climax),terrible songs, and horrible acting - special mention Sonakshi. It offers nothing new it terms of its storyline and barring a few scenes where Kiccha Sudeep infuses some energy to the movie. It is unbelievably boring. If you love Chulbul Pandey, just watch Dabbang 1 and 2 and stay away from this one. About time Mr Pandey calls it a day and Salman comes up with something fresh. Well, we can just hope !!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "princeraz-15035",
        "review_rating": "1",
        "review_title": "its not worthy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "cooldeeps-74521",
        "review_rating": "1",
        "review_title": "Drastic",
        "review_detailed_main": "Don't waste your time on this type of non content movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kishanakhetan",
        "review_rating": "1",
        "review_title": "Insult to Bollywood industry",
        "review_detailed_main": "As usual salman again gave the worst performance and useless movie to our public... It'll be better if he stop making movie. Time and money both wasted, useless movies by him when it will stop.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sharadpandey-85161",
        "review_rating": "1",
        "review_title": "tatti movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "srikantdas-99329",
        "review_rating": "1",
        "review_title": "Utter nonsense",
        "review_detailed_main": "Utter nonsense movie , not worth watching. Indian movie standard has gone too low, wonder how these movies are collecting 100 crores !!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rajputshri",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Absolutely worst movie waste of time and not link with story"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "agayazamana",
        "review_rating": "9",
        "review_title": "Full entrainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "salila-78925",
        "review_rating": "3",
        "review_title": "BORING",
        "review_detailed_main": "Well...i didnt even finish watching and already started getting bored. Very boring"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mrozeek",
        "review_rating": "1",
        "review_title": "Bad movie",
        "review_detailed_main": "Very bad act and very very old story which make by many actor"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "manavchawla-63517",
        "review_rating": "1",
        "review_title": "I anything less than 1 then I would give that.",
        "review_detailed_main": "Dude please stop making movies or please learn how to read or get ur brain repaired. Such a 3rd class movie. Senseless baseless and if u think u were doing any comedy then comediless and dont ever dance. This chutia cant dance sala."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tushargupta-27286",
        "review_rating": "5",
        "review_title": "Nice story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shafathbaig",
        "review_rating": "1",
        "review_title": "Best movie to watch if you're not able to sleep",
        "review_detailed_main": "If you're not able to sleep then if you watch this you'll definitely sleep within a few minutes. Worked for me and my buddies"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "luckylakshay-72335",
        "review_rating": "5",
        "review_title": "A typical Bhai's movie",
        "review_detailed_main": "To be very honest, the first half of the movie was entertaining, Salman's acting was average but sudeep acted really well. It was a one time watch movie. Songs could be limited ,it was irritating to watch that much songs. Secong half of the movie had many songs, atleast 2 of them completely meaningless. If you are a fan of salman's action and dabang series you should watch the movie as overall it was an entertainment."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tushardash-70189",
        "review_rating": "1",
        "review_title": "Selmon Bhoi at his utmost worst.",
        "review_detailed_main": "Waste of time. Terrible story line. I am amazed they found iphone 11 design before launch in the missile launcher."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abedinnet",
        "review_rating": "4",
        "review_title": "Dabangg is more than this...",
        "review_detailed_main": "Poor story. Salman seem like learning to laugh properly for the first time!! Good action but less charming than before. Sonakshi is a good actress but except dancing in the song, poor charecter play. New comer girl was good enough though. After a very long time saw Arbaz Khan to act & the jeep scene, while talking to the constable, remind me his role in Pyaar Kiya to Darna Kiya, I donno why!!🙂 U love his acting. Sohel khan was a surprize, but dude, you look older than Salman!!🤐 Anyways, Salman Khan is a Superstar. ✌🙂"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dhitesh-46768",
        "review_rating": "10",
        "review_title": "Entertainment, Entertainment and only Entertainment!!",
        "review_detailed_main": "This is what we call a complete bollywood style masala film. Action, whistle worthy dialogues, emotions, humour, drama and importantly connects to audience. This movie is festival for Salman fans. And for others it will be worth watching."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hellkingmp",
        "review_rating": "1",
        "review_title": "This is for Salman as well Sonakashi",
        "review_detailed_main": "I m totally disappointed by imdb because they didnt gave any strar towards minus.....feel bad... I wasted my 2 hr to watch this shit.....dont waste your time guys...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abhaykumar-07857",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "I mean after doing infinite flop movies, and having less than 4 imdb, why don't you feel ashamed Mr. Salman khan, and stop doing nonsense. Please, moreover those fool fans who go to watch n waste their money are definitely stupid."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sibas-59254",
        "review_rating": "2",
        "review_title": "Very poor",
        "review_detailed_main": "Very bad movie that I ever seen. The action scenes are also very bad. That why I recommend you all to not see this movie at any cost. The acting of Salman khan sir is average."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "omdeep-66512",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": "Full of slow-motion action scenes. Dabangg 1 & 2 was way better than this"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kesariholi",
        "review_rating": "1",
        "review_title": "CRAP film",
        "review_detailed_main": "Crap like hell. Skip it at any cost. Save money save time. Most idiotic movie I have ever seen."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "lakhvirsingh84",
        "review_rating": "1",
        "review_title": "Crap movie",
        "review_detailed_main": "I wish there should be 0 so I could have given 0 This is crap movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akhilsyngal",
        "review_rating": "1",
        "review_title": "Dabangg or Chewing gum",
        "review_detailed_main": "I request the makers , actors to please see the films before releasing it . I watched it in prime & I started having headache while watching it . Same story , a prequel was added which was useless . I like Salman Khan but I can't tolerated such shot from him"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akkiishaq",
        "review_rating": "1",
        "review_title": "Worst movie of bollywood",
        "review_detailed_main": "Bollywoods worst movie i ve ever seen.no story no acting nothing.after bajrangi bhaijaan.i never seen good movie of salman khan..Khans ERA is finished...they only make bad movies now."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rnbhat",
        "review_rating": "9",
        "review_title": "Haters are posting fake reviews",
        "review_detailed_main": "Dear all, do not judge the movie based on its ratings and reviews. There are many people who hate salman and they rate 1/10 without watching the movie and they write negative reviews. The film is among the most entertaining movies of this decade and perfect for family audiences. Lot of action, music and family based story. Children will have a blast in the theatre. So will adults. I repeat. There are agencies that are paid to write negative reviews about salman's movies because he is the biggest star and people want to see his downfall. The movie is SUPERB 4/5 rating. Music is also very touching."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chandancssahoo",
        "review_rating": "1",
        "review_title": "Bakwas movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kashyapica",
        "review_rating": "1",
        "review_title": "Mental torture !",
        "review_detailed_main": "Don't watch this movie for the sake of your mental health and peace. I guess there should have been a disclaimer before the start of the movie saying that \"watching this movie might be dangerous for your mental health\". Dabang sequels should end with this. We have had enough"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ranamohsinawaisi",
        "review_rating": "5",
        "review_title": "Only Watch movie if you are fan of Salman Bhai.",
        "review_detailed_main": "This movie have no sense. Physics is absent in this movie. I just give 5 stars because of 'KICHA' sir acting and love for Salman Bhai. I Think the reason of disliking is story of 'Dabangg 3' which is written by Salman Bhai."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "critictreater",
        "review_rating": "1",
        "review_title": "Cancer at peak",
        "review_detailed_main": "Had little expectations starting the movie, couldn't hold pay the opening stage."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shahannoorani",
        "review_rating": "1",
        "review_title": "Award for the worst movie of the year goes to...",
        "review_detailed_main": "I'll keep this short and simple, DO NOT WATCH THIS MOVIE!!!\n\nI have not seen as many people walk out of a theatre ever in my life. You made your contribution in the past but there is no room for you to make such pathetic movies today. You will be doing all of us a big favor. Enough is enough. Childish acting, poor screenplay, and it feels like every other actor/actress did a better job than him. I'm done watching Salman perform anymore and you should too!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nishitnathwani",
        "review_rating": "1",
        "review_title": "third class movies of the bollywood",
        "review_detailed_main": "Totally meaningless contents and create bad impression of the indian police."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "robydany88",
        "review_rating": "1",
        "review_title": "I wish i could give it zero stars",
        "review_detailed_main": "I used to enjoy SK's films, Ek Tha Tiger, Dabangg, Bajrangi bhaijaan, Sultan were decent movies. I watched even Dabangg 2, which was not so good but still watchable. I loved Tubelight, good storyline and great direction. Bharat too. The script and the director are very very important when doing a movie. And SK gave big hits whenever there were good scripts and directors. Kabir Khan and Ali Abbas Zafar are very talented and delivered quality movies. Now I watched Dabangg 3, directed by Prabhu Deva, story and screenplay by Salman Khan, and I have to say the following :\ndirection was very very poor\ndialogues were terrible\n\n\nI watched Veer, Jai ho and i must say those movies were masterpieces compared to this. They had some good scenes, some good songs, some nice twists. But Dabangg3... I've never seen a movie so bad in my whole life. Everything about it is just terrible. I wish i could give it zero stars. No offence but this movie is just insulting for the viewers and i don't understand how it's got a rating of 3.5 on imdb."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jaykumarr",
        "review_rating": "1",
        "review_title": "Dint have 0 star so I had to give 1 star.",
        "review_detailed_main": "What is wrong with Salman? Doesn't he go through the script before singing up? What sick direction with sick acting of Salman the way he laughs. Had to leave the theatre with in 45 minutes."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "amishkoli",
        "review_rating": "9",
        "review_title": "Excellent",
        "review_detailed_main": "Excellent movie,mind blowing action,comedy,romance,well salman the name is enough above all"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tchoerab",
        "review_rating": "1",
        "review_title": "Rubbish actor who lacks acting skills",
        "review_detailed_main": "Idiotic movie as always. Still they make crores of profit off their stupid meaningless movies coz of their sheep fans."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "enptaliliaquat",
        "review_rating": "1",
        "review_title": "Horrific sequel",
        "review_detailed_main": "I was really excited and looking forward to this 3rd sequel. Really disappointed. No story, over acting, lame jokes, cheap humor."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jmc_machal",
        "review_rating": "4",
        "review_title": "Time-pass",
        "review_detailed_main": "Rubbish storyline..Underwhelming songs and childish screenplay make this film 'a forgetful film of the year'.Only meant for Bhai Fans.Action scenes and climax is good. Salman doesn't invest too much into the character but seems more engaged in a typical action mar-dhad film That's what makes the film lose not only its plot but emotions,comedy & everythings.Women are just used as objects in the film.Sonakshi has very less scenes in which she is less impactful.Sai has zero sense of dialouge delivery or expressions. Prabhudeva's direction is the poorest of all. 2nd half is still gripping but on the whole the film is a disaster."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kazianikbd",
        "review_rating": "2",
        "review_title": "Below Average Movie",
        "review_detailed_main": "With great hope I watched the movie and after that my feeling was like \"OMG\" This is my beyond expectation and How can I movie such a lame! Total waste of time and money. \"No proper acting, No Proper story\""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "swanhtet-97729",
        "review_rating": "2",
        "review_title": "Shouldn't watch if you don't like crazy fact of Salman.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sumanth053",
        "review_rating": "1",
        "review_title": "IMDB should allow negative ratings",
        "review_detailed_main": "Couldn't get past the first 20 minutes. If I could rate this -1, I would love to do so. Please do yourself a favor and skip this movie.\n\nThis could be one of the worst movies I have attempted to watch."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vipinthulaseedharan",
        "review_rating": "1",
        "review_title": "Waster of time",
        "review_detailed_main": "Not sure when the standard f Indian Cinema has stooped so low. No story, no entertainment, absolutely not worth watching"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shadabsiddique",
        "review_rating": "1",
        "review_title": "Worst movie of Salman",
        "review_detailed_main": "I have liked Salman movies. Atleast his movies are watchable and entertaining. But Dabang 3 is his worst movie of the decade. Dabang 1 brought him to the forefront. Dabang 3 will sink him. It spoiled my evening as we decided to watch with my family on steaming service."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "zararchohansk",
        "review_rating": "9",
        "review_title": "Love From Pak🇵🇰",
        "review_detailed_main": "Lots of Love and Duas from Pak🇵🇰❤ Love uh Bhai InshAllah it will be a biggest hit !! Not released here and uh may know the reason Lekin ekdum Bhaukaal machawegi picture.❤"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rahulkeswal",
        "review_rating": "2",
        "review_title": "Faltu",
        "review_detailed_main": "Not even worth to watch it for free,\n\nwaste of time"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sunnytiwari-79296",
        "review_rating": "1",
        "review_title": "Boring 😑",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nafisbinreza",
        "review_rating": "2",
        "review_title": "Troll",
        "review_detailed_main": "Dabangg 3 - Action Drama Movie Cast - Salman Khan, Sonakshi Sinha\n\nWhat can you expect from a movie more than this? The is super graphic intensive action which loterally has no logic, lame romance, new story build up which cannot be related with other two presequels, highly predictive storyline, no such plot twist or anything. Just there are few dialouges which are awesome and some acting of Salman Khan is up to the mark.\n\nI know this franchise is very popular. If you watch it expecting like a comedy drama with overwhelming fighting then it's not a bad movie. If you want to judge the movie and want to find logics then you will be dissapointed. It's a family movie so no 18+ scene but some dialouges are cheaky. I cannot suggest this one also cannot tell you to not waste your precious 2 hours. Choice is yours.\n\nPersonal Rating - 2.5/10 (Yeah you all know that I am...)"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kumar-00551",
        "review_rating": "1",
        "review_title": "Wastage of Money & Time.",
        "review_detailed_main": "Backwas story, song, Cinematography..... Full waste of Time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "samiran-com",
        "review_rating": "1",
        "review_title": "More worst movie ever",
        "review_detailed_main": "Dont waste your time unless you have enough time to spoil."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jineshcp",
        "review_rating": "1",
        "review_title": "One among the worst movies of 2019",
        "review_detailed_main": "A tutorial on how to make a bad movie and still expecting people to accept it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sharathmahadeshwara-07486",
        "review_rating": "1",
        "review_title": "yetho tatti hae",
        "review_detailed_main": "This is the one of the laziest writing that i have ever seen in my life. only one star for sudeep, makki's acting and makki's father acting. remaining all done their average. please don't think making this kind of movie in the future."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vikrantnehra",
        "review_rating": "1",
        "review_title": "Such a waste of time",
        "review_detailed_main": "It will be good if If there is any option to rate in negative."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nikhil-67333",
        "review_rating": "9",
        "review_title": "Blockbuster movie",
        "review_detailed_main": "One of best of Salman khan....!!!!! Entertainment and Masala very well fall in place....!!!! Go and watch it... It's worthy for your money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "LanternSwapnil",
        "review_rating": "1",
        "review_title": "\"Magar Kyu?\" Read it in KRK's Expression",
        "review_detailed_main": "Dabangg 1 = Class. Dabangg 2 = Awesome. Dabangg 3 = Watching it first time is like watching it 2000th time. Exhausted I feel even when I took almost a month to finish it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tapan-79455",
        "review_rating": "1",
        "review_title": "No Salman Khan anymore",
        "review_detailed_main": "No Salman Khan anymore in any film and in any field.!!!!!\n\nPlease make movies with another actor having good personality and acting.\n\nThere is also no need to take this person in the industry as well."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ctksqbg",
        "review_rating": "1",
        "review_title": "Waist of time n money",
        "review_detailed_main": "Waist of time n money Waist of time n money Waist of time n money Waist of time n money Waist of time n money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "welangasajith",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "The worst movie I watched in this decade. Salman also proved again that he is a king for fake actions. When he will realize to make some reality actions. Damn waste of my time."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "abhilashb-70632",
        "review_rating": "1",
        "review_title": "Poor Show from a Big Indian Star",
        "review_detailed_main": "For an experienced movie veteran like Salman Khan, this is a a really poor film, I'm surprised he would accept a script like this. The comedy wouldn't even make little children laugh let alone adults, far too many song intervals (not even good songs, so many illogical parts in the story. Movies like this taint the true capacity of Indian cinema and make our movies reflect very poorly to the rest of the world."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rsirari03",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": "Another tatti movie from salman khan! This actor need to be banned from acting! Earning money without any efforts."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pawankumar-28061",
        "review_rating": "1",
        "review_title": "Senseless",
        "review_detailed_main": "I dont think anything is more dumb than this movie plot."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kishorevenkishore",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": "Worst Movie to the core. Salman please stop Dabangg Franchise.\n\nFirst Part is 10000 times better than this."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vivekdeepaklol",
        "review_rating": "9",
        "review_title": "MASS FILM",
        "review_detailed_main": "Amazing film with MASS Action and Dailgoue scenes!!!\n\nSalman Khan at his best. What a acting he did with his younger version!\n\nKichcha Sudeep is Dooms Day with this villain role.\n\nOverally its very ENTERTAINING film from the start to the end. LOVED IT!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nikunjsureja-139-602237",
        "review_rating": "3",
        "review_title": "Bad directing",
        "review_detailed_main": "Boring movie 😴 bad acting bad storyline and worst dirction."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "masifali-47890",
        "review_rating": "1",
        "review_title": "Same old crap",
        "review_detailed_main": "Same old story action styles and poor acting."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "syedfarhanwolverine",
        "review_rating": "5",
        "review_title": "GOOD ACTING WITH POOR STORYLINE",
        "review_detailed_main": "Its a visual treat for all the Bhai fans,Salman khan comes back to the big screen as the \"dabangg cop\" doesn't disappoint but on the other hand the movie lacks good story and motive.The new comer Saiee Manjrekar does a fine job playing the second lead, Sonakshi looks beautiful but fails again to deliver a good performance.The best part of the movie was Sudeep who played the Antagonist surprising the fans with his amazing acting skills,the action is good but the story lacks humour and motive. Its an overall one time family entertainer."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sureshmeenakumawat",
        "review_rating": "1",
        "review_title": "Boycott Bollywood anti hindu culture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "cseabhi",
        "review_rating": "5",
        "review_title": "Dabangg 3 is a total waste of money and effort.",
        "review_detailed_main": "I was a huge Dabangg fan. Watched it thrice in theatre. Then came dabangg 2, which was far below than the first part but then also it was watchable and enjoyable. Then came this part.\n\nThe trailer before the release gave me hope that film would be entertaining but after actually this film a top class boring film.\n\nOther two part of Dabangg franchise had one solid USP - Salman Khan. He was the backbone of the film and really kept me glued to the screen. But this time Salman was clueless. He overacted, had bad dialogue delivery throughout the film and the acting was horrible.\n\nSalman always receive negativity in terms of acting but I am one of the few people who genuinely loves his acting. He is a natural entertainer but in this movie he failed totally as an actor..\n\nYou are spending so much movie on this type of heavy budgeted movie and still making dud ones?\n\nSecond half of Dabangg 3 was still somewhat watchable but the first half was really really horrible.\n\nSaiee Manjrekar was good and sonakshi sinha was okay. Sudeep was really good in this movie. Music was a big let down.\n\nThe only saving grace for me in this film was that I watched this on Amazon Prime, not in theatre. :)"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "trampdonald",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "Dabangg3 is not a movie, it's a disaster. Worst music, worst direction, worst action. Neither a mass movie nor a class movie. Don't waste your money for this crap."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mrinal-kanti",
        "review_rating": "1",
        "review_title": "Bury this series already.",
        "review_detailed_main": "Watched on Amazon Prime and couldn't tolerate this for 45 mins. Can't imagine how this would have felt watching in the theater with a friend/partner. Full of outdated cliche with repeated and stale humor from its earlier releases. Producers and sponsors just milking the franchise dry. Shame to see Salman degrading into such a pathetic state. I wonder if the kids watching this movie today can ever relate to what made the original Dabangg so entertaining."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "bitcoearn",
        "review_rating": "1",
        "review_title": "total worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mooreclay",
        "review_rating": "9",
        "review_title": "BLOCKBUSTER!!!!",
        "review_detailed_main": "Amazing film by Prabhu Deva and Salman Khan! FULL ON Dhamaka and Masss!!!! For me, this was the best out of all 3 SERIES of Dabangg so far! -Story is very good especially the young Chubul Pandey -Action is just over the top! Best Action Hindi film of the year -Climax scene is worth the money! EPIC BATTLE Definitely recommanding u to watch it!!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "androcious",
        "review_rating": "1",
        "review_title": "Disappointing performance- out of touch",
        "review_detailed_main": "The movie is a disappointment to Salman fans. Chalky CGI , an overabundance of dialogue moments miss the mark in capturing the audience interest. Story is poor, acting appears monotonous and pedestrian. Humor is often crass and probably appeals to very few. The dance scenes only sadly succeed in revealing Salman's loss of mobility - that they try to make up for with camerawork and itching steps. After watching this movie , several cringes later - one can only hope that Salman realizes he is past his prime playing the lead romantic or action hero."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jayshrisoni-87377",
        "review_rating": "1",
        "review_title": "Seems like comedy movie with lame jokes",
        "review_detailed_main": "Director producer and mainly script writers need to read some good books and start using their brains inspite of copy pasting others talent if they aren't passed 10th grade and haven't read physics basics rules also🤣🤣"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "inikmathur",
        "review_rating": "1",
        "review_title": "DON'T WATCH !!!!",
        "review_detailed_main": "The only people's who can watch this movie is salman khan family.\n\nOnly they can handle this kind of torture...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "manukaushik-53329",
        "review_rating": "1",
        "review_title": "Wrost",
        "review_detailed_main": "Haven't seen such a movie till date, please, you too must have kept a distance from it, it will be a waste of your time watching this movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Be_A_fan",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "Dabangg 1 was good Dabangg 2 was okay digestible But this one is just over the head Whatever you say filmography, story, plot, screenplay everything was just disaster. And there were few good actors on this movie but how much you expect from with this kind of disaster."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nikinusa",
        "review_rating": "1",
        "review_title": "Need to say anything",
        "review_detailed_main": "Another disaster created just in the name of trilogy...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "avsingh-86672",
        "review_rating": "1",
        "review_title": "Dabang 3 total faltu",
        "review_detailed_main": "Totally bakwaas full on wastes of time and money film deserves 0 star. Avoid this film. No acting no script"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kandpal-jatin31",
        "review_rating": "1",
        "review_title": "Movie with no sense.",
        "review_detailed_main": "Worst movie of the year. No story, unecessary action, this movie is made just to earn money."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "presunbhujel-83191",
        "review_rating": "9",
        "review_title": "BETTER THAN PREVIOUS 2!!!",
        "review_detailed_main": "Dabangg 3 comes in with FULL MASS Package!!! ACTION AND DIALOGUES are Superbb!!! The climax scene was while worth watching. AMAZING Acting by everyone and GOOD directing by Prabhudeva! Sure shot BLOCKBUSTER for Salman Khan...!!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sehgalvarun",
        "review_rating": "2",
        "review_title": "Horrible, crap..",
        "review_detailed_main": "I was never expecting any logic.. but its intolerable. There is no story, fight sequences are irritating. The comedy scenes are just horrible. Dont torture yourself by watching this. 1 extra star just for Sudeep who looks good in his role."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "harshraj-79868",
        "review_rating": "1",
        "review_title": "Health advisory please dont watch it",
        "review_detailed_main": "Worst movie i have ever seen, this movie made me to leave the theatre in interval almost every person present at theatre was saying that they have wasted their money. The worst part id its storyline , salmans and sonakshis acting. Tell me one thing is it necessary to come in film line even if you don't know anything. Im sorry , not only parts but the whole movie is garbage even its songs ,dance scenes. One more what salman thinks of himself is he really a superman who can do everything in movie, a screenplay writer ,singer , producer, actor. uff he really made me sick. He reminds of Ram rahim whose movie was like this a person who thinks he is multitalented but in really is nothing but a garbage"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mukulrathi-40213",
        "review_rating": "1",
        "review_title": "Nonsense movie",
        "review_detailed_main": "No plot no story. Nonsense movie. Old story new name. Salman bhai we need something refreshing."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "purvasharmajnct",
        "review_rating": "1",
        "review_title": "why is there no minus rating!",
        "review_detailed_main": "Utter waste of time and money. Stop making movies Salman!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ranasahasales",
        "review_rating": "9",
        "review_title": "Blockbuster",
        "review_detailed_main": "Salman Khan back with bang.Full mass.Salman khan kick the ball out of the park.full entertaining.KicchaSudeep fantastic"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pandaranjansoumya",
        "review_rating": "8",
        "review_title": "Dabangg3 is good one..",
        "review_detailed_main": "It's a good and entertaining movie . You just go watch ,enjoy and come. Don't use your brain on this movie... Nice one"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "johntherealcena",
        "review_rating": "9",
        "review_title": "Entertaining",
        "review_detailed_main": "Out & out Salman Khan film.Get Ready for Salmania.full paisa vasool"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nikunjbihari",
        "review_rating": "9",
        "review_title": "Its really awesome guys dont listen this paid critic",
        "review_detailed_main": "Go and watch u will enjoy this movie is not only for salman fan but it is also for normal people it gives lots of messages too"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nisakhairunaly",
        "review_rating": "8",
        "review_title": "Mass entertainer.. Go and watch with your loved ones",
        "review_detailed_main": "You will cherish and adore every bit of the movie..... A treat for fans as well as for critics... Fantabulously directed by prabhu deva.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rockstarsonupans",
        "review_rating": "10",
        "review_title": "Salman Khan's biggest treat",
        "review_detailed_main": "This movie has everything you expect from Salman's movie. Jabardast Action silly comedy ...shirtless salman"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Nalam39",
        "review_rating": "9",
        "review_title": "Bhai is back in action.",
        "review_detailed_main": "Rating:-**** Performance:-salman-chulbul and massy Sona & sai - both are amazing Sudeep- Balli Singh is new Gabbar Singh Prabhu Deva- justified Dabangg Last but not least- Salman Ali voice over in background giving goosebumps"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sanjaysahni",
        "review_rating": "9",
        "review_title": "Entertainment",
        "review_detailed_main": "Dabangg3 has Entertainment it doesn't let you bored , Screenplay is good , Salman's Performance is good,All other Supporting roles were Good , Overall if you want to enjoy the Christmas week , Watch the movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "lkam-62122",
        "review_rating": "8",
        "review_title": "I wasn't expecting that much of entertainment",
        "review_detailed_main": "No bakwas sidhi baat Comedy 10/10 Drama 8/10 Action 10/10 And the main thing I loved in the movie was (Saiee Manjrekar) she isn't just cute she is fabulous"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "yasin_khan-35261",
        "review_rating": "10",
        "review_title": "Ek dum jackass 👍🏻",
        "review_detailed_main": "Full on entertainment paisa wasool movie everyone must watch"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kunald-44883",
        "review_rating": "9",
        "review_title": "Blockbuster Family Entertainer !",
        "review_detailed_main": "Action -Romance -Emotions -Swag -Whistle worthy Dialogues -Lovely Songs -Dhamakedaar Dance -Epic Climax\n\nIn short a wholesome entertaining film which everyone will really enjoy and love !\n\nMaking a sequel and presenting it equally well (if not better) like it's predecessor (Dabangg 1) is no easy job. Dabangg3 has done that and kudos to the entire team and above all SALMAN KHAN for portraying CHULBUL PANDEY in such an Effortless manner even after 7 long years !"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "salmankhan-29726",
        "review_rating": "8",
        "review_title": "DABANGG 3 Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "anandsingh-39214",
        "review_rating": "9",
        "review_title": "All Time Blockbuster Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sakibhossain-65060",
        "review_rating": "10",
        "review_title": "Full pack of entertainment...🔥🔥🔥🔥",
        "review_detailed_main": "Blockbuster for sure. But the problem is.. current situation in the country... It doesn't matter.. movie will be good at box office"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "samuelabera",
        "review_rating": "9",
        "review_title": "Salman is too cute.",
        "review_detailed_main": "First half is ok but second half is gold no one will regret watching this movie its blockbuster written over it"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shayangreat",
        "review_rating": "10",
        "review_title": "Full Masala movie for Salman Fans!!",
        "review_detailed_main": "Movie is full Masti and enjoyment. 2 Songs could have been avoided. Salman and Only Salman..full on full for 2nd half of the movie. Please go and enjoy without logic.. Only masala."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dijaa-32285",
        "review_rating": "10",
        "review_title": "Great mass entertainer",
        "review_detailed_main": "I don't understand people who are giving this 1 star, it's a different genre, if you're not in interseted in this kind movie don't go to the theatre to see it. It's a mass entertainer. It's a typical bollywood movie. And as a foreigner this is wy i like bollywood and this is bollywood for movie : action, emotions, romance, songs, comedy ans it gives you what you saw in the trailer so it's not really tricking you into seeing it. If you like mass full-packed action entertainers, definetily go for it. I enjoyed it a lot."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "keshabcom",
        "review_rating": "9",
        "review_title": "Blockbuster of the year..",
        "review_detailed_main": "One of best movie of dabbang franchise so far so good..damn good movie..lot of msg nd lot of emotions nd bang with super action oriented movie..must watch.. strongly recommend to evryage of people..jao enjoy ur Christmas with dabbang 3"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "worldofsalmandiehardsalmanfan",
        "review_rating": "8",
        "review_title": "A Pure Action packed",
        "review_detailed_main": "It is truly must watch movie for whole family love it.High hard core action with lots of comedy good storyline.Dialogues are just fire. Go & watch movie there will be happiness on your face it will won't disappointed you.haters are spreading unnecessary negativity."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "deepaktskh",
        "review_rating": "9",
        "review_title": "Maasssssy!! ✨ flick",
        "review_detailed_main": "This salman starrer turned the best mass action flick of this deacde. Salman is at it's best. Last face off scene between kichha and salman is fablous"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mdshabanazad",
        "review_rating": "9",
        "review_title": "don't go for negative review",
        "review_detailed_main": "The negative review are only due to akshay fans are jealous of Salman khan...the movie is earning great and is a good movie. the movie never bad that it can ne rated as 1,2,3,4or 5 starts. it is always above 7 and should be...for Salman fans its pure masala entertainer."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "atishmusle",
        "review_rating": "8",
        "review_title": "Dabangg3 - Pure Mass entertainer",
        "review_detailed_main": "If ur Salman khan fan and mass lover u will have very good time watching this, lots of moments will give u goosebumps, first half is little bit slow second half is full of mass show ,climax is strong point of the movie, kiccha played his role perfectly he is perfect villain and bhai is bhai he nailed as chulbul this time also sai is looking cute she did her part well ,bgm is also good ,some songs need to removed from film but munna badnam and awara is perfectly placed ,there are some scenes who gives social messages beautifully ,overall this is pure mass entertainer out and out Salman khan show ."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "maaxcruz",
        "review_rating": "9",
        "review_title": "A must Watch",
        "review_detailed_main": "The movie is truly a complete package of action, comedy,romance, emotions.The Action was hard core & movie was a family entertainer movie. There were too good action sequences. The climax is the most important usp of the movie.Truly the biggest climax ever."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "onshop-78548",
        "review_rating": "8",
        "review_title": "Bombarded 🔥🔥",
        "review_detailed_main": "Salman is flawless here he is just back in bang with his iconic character, he portayed best the dabangg this time. kichha is too good. You will be amazed when you will witness the climax. It's completely salman show"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "popeyedec",
        "review_rating": "9",
        "review_title": "Yeeeees worthy!! !",
        "review_detailed_main": "Yes it's megastar salmania super flick ; romance, comedy, action, humour and songs. Salman and kichha done Very well saii is exceptional and munna badnam and hud hud song is worth watching"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "saquibmd-23077",
        "review_rating": "10",
        "review_title": "All time blockbuster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jugalbgr",
        "review_rating": "10",
        "review_title": "Treat for all! Awesome Film!",
        "review_detailed_main": "The movie is fab! The actors are fab! The poot is fab! The direction is fab!. Overall Dabbang 3 is Fabulous movie and is worth to watch. Go watch it guys!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "junedmapkar",
        "review_rating": "10",
        "review_title": "Fantabulous",
        "review_detailed_main": "Story perfect Action perfect Drama pefect Romance perfect Music perfect, what elso do we need"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shivamkr",
        "review_rating": "9",
        "review_title": "A perfect family entertainer",
        "review_detailed_main": "MUST WATCH !!! Salman Khan in his elements right from the word go. Decent performance by Kiccha Sudeep. Saiee overshadows sonakshi. Highlights - Film takes off from interval and after that it's full on Dabangg film. Mind-blowing last 20 minutes. First half - 4.25/5 Second - 4.75/5 for me Overall a 9/10"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "johnmaddy-25141",
        "review_rating": "9",
        "review_title": "Movie is pure entertainment",
        "review_detailed_main": "Dabangg 3 is movie for movie lovers.A movie with top-notch action,top notch cinematography.Good comedy,one liner punchlines.Emotional story at the end leaves you with social message."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "asifnanadi",
        "review_rating": "8",
        "review_title": "Blockbluster series",
        "review_detailed_main": "Dabangg 1 -Blockbluster Dabangg 2 -superhit Dabangg 3 -Blockbluster Story -10 Action -10 Romance -10 Song's -9"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kunaldarakha-91025",
        "review_rating": "8",
        "review_title": "Beware Of Negative Reviews",
        "review_detailed_main": "This movie is best family entertainer , when i was watching it every age group enjoying it . I don't know why people spread negative reviews for no reason , i watched dabangg3 with my whole family and it was really good . Go for it , climax was excellent and interval scene was emotional , go for entertainment"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "amansagarnaman",
        "review_rating": "10",
        "review_title": "Blockbuster of the year",
        "review_detailed_main": "Despite so much hatered and negetive review movie got such a great collections protests may have effected the movie collections but these reviews doesn't must go and watch the movies full family drama movie fully enjoyable with friends 😍"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ibeingsudeep",
        "review_rating": "9",
        "review_title": "Best entertainment movie so far",
        "review_detailed_main": "You don't feel boring in any portion . ORRA mass at its best"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "gppratyush",
        "review_rating": "10",
        "review_title": "Entertainment movie",
        "review_detailed_main": "Best Awesome movie with best action sequence powerful dialogue"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "gattri",
        "review_rating": "10",
        "review_title": "Best",
        "review_detailed_main": "Entertainment at its best..better than dabang 3..salman is awesome"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vg-38915",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": "Worth it! Entertaining movie go for it!........ Good direction acting and movie play .."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "aakiblanjekar",
        "review_rating": "9",
        "review_title": "Entertainer!!",
        "review_detailed_main": "Dabangg 3 is a complete package of entertainment with emotions, romance, intensity, high octane actions and whistleworthy climax. Slightly slow paced in first half but picks up amazingly with the story especially in the later half. Performances are upto the mark from each and everyone including Salman Khan, Sonakshi Sinha, Saiee Manjrekar and Kiccha Sudeep. Must watch if you want some good 2.5 hours of entertainment."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mrinald",
        "review_rating": "9",
        "review_title": "Dabangg 3: Triple Treat!!!",
        "review_detailed_main": "Coming back after 7 years Chulbul Pandey A.K.A Salman Khan exceeds our expectations and delivers a total entertainer. Action, comedy, emotion, romance and music everything is top notch and well paced. Prabhu Deva proves yet again why he is The 'Wanted' director and Salman-Prabhu combo rocks yet again after 10 years. The antagonist, Sudeep Kichcha, played his part brilliantly giving equal competition to Salman. Supporting cast comprising Sonakshi, Saiee, Arbaaz and others made justice to their roles. Speciall Kudos to the Killer BGM 👌"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ehsanahm",
        "review_rating": "9",
        "review_title": "Very very very nice film and perfect",
        "review_detailed_main": "Beautiful film and perfect salman khan and best director prabu deva"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shohiljackpot",
        "review_rating": "10",
        "review_title": "Best ever",
        "review_detailed_main": "Manojjattani is talking crap best film ever your dumb anyway films are for entertainment not to use your brains you should become English and don't bother watching Bollywood watch star crappy wars. Atleast Salman Khan don't have rude in hus film thats why you liked aamir Khan and shahrukh because they kiss and swear in films u like vulger Indian films Salman Khan makes family friendly u don't like that."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "skinny-02492",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "This movie was awesome all the way people who hv said this is crap u guys are in cookoo land this is the best dabang movie loved it all the way the story line was perfect"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "maazrehman-11324",
        "review_rating": "9",
        "review_title": "A must watch movie",
        "review_detailed_main": "A complete family entertainer action packed fully had core action, emotions,romance,suspense. The movie is completely mass entertainer and plus it has social messages to support rape&acid victims & water conservation. Go and watch for it there will be a big small & happiness on your face"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tawfiqsediqi",
        "review_rating": "9",
        "review_title": "Dabangg 3 Best Masala Film",
        "review_detailed_main": "Dabangg 3 is all about Chulbul Panday and his new avatar"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "beingsrbsumit",
        "review_rating": "8",
        "review_title": "Dabangg 3 blockbuster 🔥",
        "review_detailed_main": "@BeingSalmanKhan Roars as Chulbul Pandey 🔥🔥🔥 Movie is full dose of entertainment , action , masala , dialogue and good story . A must watch for mass audience . 🌟🌟🌟⭐✨/5"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mkshtj",
        "review_rating": "8",
        "review_title": "I dont know why people are crying so much",
        "review_detailed_main": "I mean if you went to this movie you already knew what a typical Salman Khan action movie would be like, esp. Dabanng series. I infact found this to be best of this series, second being the worst.\n\nMost people are love to hate Salman for making same movies, but still have not watched Bajrangi Bhaijaan which is one of best movies in Bollywood in the last decade. Many of the 1-star reviews sound like some drunken pretentious idiots blabbering. These same people would not trouble watching some Hollywood flick which is just as ridiculous, and almost every action movie is ridiculous in some aspect. Its not meant to be an exercise in philosophy, just good entertainment. I am we all love Dark Knight series, but just how realistic is it to have a caped crusader. Its still a great series.\n\nComing to the movie, the first 10-20 mins are definitely cringeworthy. Even I stopped watching in the first fight scene itself. So a lot of people might have written reviews without watching the entire movie. But the movie goes on a different level after main story starts. Sudeep esp. as a villain is pure evil. He is the best of villains so far in this series. Just has a cold psychopath demeanor which plays perfect counterfoil to the over the top hero.\n\nThe action sequences are far more tamed, and the movie has just the right dose of comedy action and drama. Some people would like to hate Salman for trying to be in every scene, but the first two scenes in which he meets the villain are almost entirely on Sudeep, Salman being the secondary actor there.\n\nI however skipped the songs, and there seemed to be too many of them.\n\nSalman as usual is the superstar, he is funny and serious in just what the scene demands. Granted he does not have the best diction in a few scenes, but he isn't gunning for Oscar either.\n\nIf you want to watch some deep intellectual stuff, I dont even know what you are doing here. For those who want to watch a good action comedy, please just forward through the first 10-15 mins and then enjoy."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "heysuhel",
        "review_rating": "9",
        "review_title": "Blockbuster",
        "review_detailed_main": "Paisa vasool blockbuster with good emotional scenes.... Bhai is back with a bang🔥🔥"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dbk-36829",
        "review_rating": "9",
        "review_title": "That's What We Call A Family Entertainer !",
        "review_detailed_main": "Dabangg3 is best movie with emotions , action , dialogues , dance and comedy.. Background music gives you a goosebumps. Enjoyed with family and all are happy with the movie. Best entertainer of 2019 Go for it"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dhruvmenghani",
        "review_rating": "9",
        "review_title": "Chulbhul Pandey is Back With Bang",
        "review_detailed_main": "Salman Bhai is Awesome as always Full on Entertainment Action,Comedy, Masala, Songs, Dialogues are the Key Part of the Movie Kiccha Sudeep Acting is on another level best Satisfied Watching The Movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "aakashranjan-99895",
        "review_rating": "9",
        "review_title": "Blockbuster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sanjaysahni-04988",
        "review_rating": "9",
        "review_title": "Masala Entertainer",
        "review_detailed_main": "Overall its Salman Khan show ,He justify his role perfectly as Chulbul Pandey , Dabangg3 has everything which movie goers expects ,you will not be disappointed , Highly recommend to watch atleast one time"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sweetpooh",
        "review_rating": "10",
        "review_title": "Paisa Wasool",
        "review_detailed_main": "OUtstanding movie.I couldnt take my eyes off this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kamalkhan-80097",
        "review_rating": "9",
        "review_title": "Dabangg 3 hit🔥🔥🔥",
        "review_detailed_main": "Salman Khan super fun & entertain movie.. One more hit on the way"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "skraselctg",
        "review_rating": "10",
        "review_title": "awosam i like salaman bhai",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shohiljackpot",
        "review_rating": "10",
        "review_title": "Absolutely amazing",
        "review_detailed_main": "Best film ever Salman Khan amazing as usual Amazing action idiots should have put it in Crawley"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tallapallisatyam",
        "review_rating": "10",
        "review_title": "Awesome Mindblowing Ultimate",
        "review_detailed_main": "Movie starts with Salmans Grand Action Pack. Movie includes Comedy, Romance, Good songs, Social Messages, Best dialoues Hopefully it will gain 300 crore. Its a must watch movie. I'm ready to watch the movie twice"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "darakhakunal",
        "review_rating": "8",
        "review_title": "Entertainer With Best Climax and Interval scene",
        "review_detailed_main": "Combination of comedy , action , emotions and off course the Title Song , it was best Enjoyed with family You won't regret to watch it"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sbmak",
        "review_rating": "10",
        "review_title": "Fully Family Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "panisaumyaranjan",
        "review_rating": "10",
        "review_title": "Its a love from a fan to salu bhai",
        "review_detailed_main": "Its the movie which have fun,emotion & action. In this movie u will know how salman khan name geting \"chulbul pandey\" . As a fan i will give 100 out of 10. It is outstandig movie. It will cross the record of bajarangi bhaijan."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "anandsingh-39214",
        "review_rating": "9",
        "review_title": "Wow Blockbuster Movie Biggest Movie 2019",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sannanali",
        "review_rating": "10",
        "review_title": "Best movie also for non salmaniacs",
        "review_detailed_main": "Well. Honestly I'm not a fan of Salman But this movie has all elements that a movie require. Don't just believe or haters mouth. Just go and watch and decide it. Y the hell people listens other experience and make it there experience ??? . Make your own experience and say it. Well now go and watch this masala movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chandanshivhare",
        "review_rating": "9",
        "review_title": "Awesome",
        "review_detailed_main": "Definitely its a good movie ,,,please go and watch"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "riteshrajugoel",
        "review_rating": "9",
        "review_title": "Amazing one better then 2",
        "review_detailed_main": "Lovely movie all things there must watch go for it its like a treat"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akashibm",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": "Dabang 3 is larger than life . Salman Khan is killing it"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "alialishaikh",
        "review_rating": "9",
        "review_title": "🌟 Blockbuster 🌟",
        "review_detailed_main": "Full On Entertainment, Best Of Action Salman Khan Is His Best.. Kichha Sudeep Is Awesome As Villain.. Must Watch Guys 👍👍"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dilkashhaq",
        "review_rating": "10",
        "review_title": "Non Stop Entertainment",
        "review_detailed_main": "This movie is 2 and half hours of complete masala and non stop entertainment. Dont apply your brain ( keep it for your professional and personal life ) if u want to enjoy this movie. This movie is wholely dedicated to Sallu fans and once again he proved he is the king of bollywood. Sallu fans Go watch it. U all gonna love it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shreyasbobade",
        "review_rating": "10",
        "review_title": "Blockbuster Movie Dabangg 3",
        "review_detailed_main": "Blockbuster Movie Dabangg 3 Bhai Ke Dialogues,Action Climax Scene munna badnaam hua song Aur Baki Sab Songs Bohot Acche Hai Paisa Wasool Movie Box Office On🔥🔥"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "snehalnangare",
        "review_rating": "10",
        "review_title": "Beware of negative comments! It's too good.",
        "review_detailed_main": "Ignore the negative comments. Salman's aura is unmatchable. His acting and hardwork is laudable. The movie keeps you engrossed till the end. Great climax.❤"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "gauravpatel-15086",
        "review_rating": "10",
        "review_title": "Best movie in Dabangg series",
        "review_detailed_main": "Love the movie. Best in the series. Must watch. Salman is at the best level."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "umar-18884",
        "review_rating": "9",
        "review_title": "Dabangg review",
        "review_detailed_main": "Full on entertaining dabangg 3 is paisa wasool Kichha sudeep has nailed his role where salman khan is main soul of this movie I would love to give a 4star"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sagarmaheshwari-47965",
        "review_rating": "10",
        "review_title": "Bhai ki film mashallla",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "harshitraj-99628",
        "review_rating": "10",
        "review_title": "Blockbuster movie",
        "review_detailed_main": "Dabangg type movie...one world review BLOCKBUSTER.... So go and watch the movie with friends and family."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sumanbramabulldas",
        "review_rating": "9",
        "review_title": "BLOCKBUSTER",
        "review_detailed_main": "Dabangg 3 has written blockbuster all over on it. Throughout salman khan show and kicha also done a tremendous work as villain, songs are ok and direction was good but the action scenes were out of the world absolutely top class."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nakulbamaniya",
        "review_rating": "9",
        "review_title": "Salman khan comes back with a bang..!!!",
        "review_detailed_main": "A solid, well packaged entertainment- #Dabangg3 gives you all. #SalmanKhan is outstanding as Chulbul. Emotions and actions remain intact throughout.SalmanKhan whistles, claps and hooting assured.🔥🔥🔥😘😘"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vishukumawat",
        "review_rating": "10",
        "review_title": "Just One word..Fully Entertaining",
        "review_detailed_main": "Why people give negetive reviews.. Todays people only like the valgarity,Nonsless things...this movie gives any entertain us songs,action,romance,comedy what hust audiance like...All haters just hate only nothing has any mind....."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "coolaceu",
        "review_rating": "10",
        "review_title": "He's back!!",
        "review_detailed_main": "Salman is back!! The king of mass , this has everything don't read these haters. Salman has many of them who loved the movie but giving it low rating! Go and enjoy!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mdraj-11899",
        "review_rating": "9",
        "review_title": "B-L-O-C-K-B-U-S-T-E-R",
        "review_detailed_main": "Just one word Blockbuster 🔥 Salman Khan as chulbul Pandey Killed it🔥🔥 100times Better than DABANGG and Dabangg2"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mahirvhora-98072",
        "review_rating": "9",
        "review_title": "Overdose Of Entertainment",
        "review_detailed_main": "I find it's highly Entertaining movie which has perfect Romance,Comedy and Action. Must watch for Entertainment."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "aqureshi-59460",
        "review_rating": "8",
        "review_title": "Masala Entertainment for all genere",
        "review_detailed_main": "Every family go & watch bcz only SALMAN's movie can enjoying together with your family . Kids will enjoy. Sudeep sir works excellent . Saiee M Manjrekar natural beauty shown no artificial makeup . Salman sir love u always ...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ats_en",
        "review_rating": "10",
        "review_title": "Salmania",
        "review_detailed_main": "Swag of Salman, blockbuster music, superb action what else u want in an entertainer.. Must watch"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "surajseervi",
        "review_rating": "9",
        "review_title": "Entertaining",
        "review_detailed_main": "Movie has lot of emotional scenes which will let your tear down. Good amount of humor. And the action was really breathtaking . Overall it's family film plus mass entertainer . Must watch"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "bhojpurtiger",
        "review_rating": "9",
        "review_title": "SALMAN MANIA",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kotreshr",
        "review_rating": "9",
        "review_title": "Kicha sudeep biggest plus for Dabang3",
        "review_detailed_main": "Comedy,,, entertainment super movie,, Salman super,,, saiee super,, sonaksi good but but but Kicha sudeeep,,,,, extraaaordinory what a performer,,, he is fire power what an actor,,,, kicha sudeeep steal the show,,,,, best villain after gabbar and mogambo,,, unbelievable kicha rocks"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rehanliet",
        "review_rating": "9",
        "review_title": "Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kanhucharan-27381",
        "review_rating": "9",
        "review_title": "Salman blockbuster khan",
        "review_detailed_main": "It's a bhaiBlockbuster thoroughly enjoyed! Second half totally salman searing 🔥kichha is nailed his role. Mid interval scene touching the soul of film Salman entry and hud hud song is for fans and it's totally a movie for family. Pure massy"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hnsrajgoswami",
        "review_rating": "9",
        "review_title": "Paisa wasool",
        "review_detailed_main": "Full to entertainment mass music screenplay everything is up to mark u will definitely enjoy go for it"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "faizangagan",
        "review_rating": "9",
        "review_title": "Blockbuster movie good story with comedy best series in dabangg.. hater's ki mat auno negativety fella rahe hai",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sdharamsi",
        "review_rating": "10",
        "review_title": "Ek Dum First Class!",
        "review_detailed_main": "Salman is excellent again as Chulbul, with some wonderful nods to previous films. Sudeep is by far the best villain in the series, and Sonakshi's character is far deeper also.\n\nA wonderful, hilarious, and well rounded film for all the family."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "its-me6611",
        "review_rating": "9",
        "review_title": "Better than Dabangg and Dabangg 2",
        "review_detailed_main": "7 Years after Dabangg 2 we get the third installment of an amazing film series. One of the things that I loved about this film is that it stays true to its predecessors. Anyone who liked Dabangg or Dabangg 2 will love this one.\n\n9/10\n\nLike the last two films this one starts with Pandey Ji stopping a crime in progress. Some goons have robbed a wedding and are now in their hideout counting the money. Enters Inspector Chulbul Pandey. This time he comes from underground. This is an action-comedy film and first half an hour is filled with both action and comedy. The film shifts its tone once Pandey ji finds out that the boss of the human trafficking gang he caught (Sudeep) is someone he had a run in with in the past. There we get a flash back of Pandey ji's younger days before he became a cop.\n\nThis is a treat for Dabangg film fans because a lot of care has been given to the scenes of the flashback. We get to see how innocent Pandey ji becomes badass Robinhood Pandey. How he picks up his style also the legendary dialogues of Chedi Singh and \"Swagat nahi karoge hamara!\" As a young Pandey, Salman Khan portrays an innocent persona that is akin to his character in Bodyguard.\n\nThe making is good. Prabhu Deva did an excellent job of maintaining the original feel of Dabangg and Dabangg 2 while elevating the look and feel. The locations are amazing. Costume is great. The music and dance is colorful, full of energy and fitting. Salman Khan showed superb energy on the dance floor. There is no complaint on the acting department, everyone did their part well. Salman khan as young Pandey did an excellent job. The new girl Saiee Manjrekar played her role well. Would have loved to see more of Sonakshi Sinha.\n\nThe best of part of Dabangg series is it's \"hatke\" dialogue and Dabangg 3 has it in truckload. From retelling the old ones to delivering new ones Dabangg 3 packs quite a few memorable dialogue. Another thing that is better than Dabangg and Dabangg 2 is the entry of Salman Khan is more effective in Dabangg 3. Almost all of his entry was mass.\n\nThe music is catchy. Action is well made, the earlier action scenes had dose of comedy and gradually the fights got serious till the explosive climax fight. I loved the climax action scenes. It had some really cool scenes. It was also bloody like Dabangg (2010). Dabangg 3 improves on the last two of the series and provides an entertaining action-comedy ride. Must watch for who liked Dabangg and Dabangg 2."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "messimagical",
        "review_rating": "9",
        "review_title": "Must watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "impraveengarg",
        "review_rating": "9",
        "review_title": "Biggest movie of the year dabbang3",
        "review_detailed_main": "Superb masala , family entertainment movie From 7-80 age group Can watch it U will come out from theatres With full satisfaction Best story, acting , comedy , action ,songs\n\nTop class movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "skazharuddin-26032",
        "review_rating": "10",
        "review_title": "Blockbuster #Dabangg",
        "review_detailed_main": "Outstanding dhamaka fully Paisa Vasool movie #Dabangg3"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chetandewangan",
        "review_rating": "10",
        "review_title": "Mass maharaj is back",
        "review_detailed_main": "D3 is ATBB everything is good Climax scene is fantastic. All songs are Melody Kichaa is banging in this movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "smohammeds-88463",
        "review_rating": "10",
        "review_title": "It's big entertainment",
        "review_detailed_main": "Best in dabangg franchise.. U will laugh.. You will get emotional.. U will love the actions.. It's Salman written all-over it.. Sudeep kiccha is a wonderful actor.. Nailed every minute he was in screen.. Paisa vasool movie of the year... The only actor who's movies u can watch with your family /parents..."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shuklaaakash-75813",
        "review_rating": "10",
        "review_title": "Content, mass audience and masterpiece. What you need more?",
        "review_detailed_main": "Day by day people are targeting salman khan towards negativity. A movie like dabangg 3 is a masterpiece without any doubt. Super rocking dailogues, larger than life action and salman khan. Kicha sudeep was perfect as a villain."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "twistsoul-66116",
        "review_rating": "10",
        "review_title": "As expected",
        "review_detailed_main": "We always expect every movie like Sholey or Baabubali. Which is not gonna happen. This movie is full of entertaining with clean story. All we expect is small story with full enjoyment. Salman give his best to make audiences happy and he nailed it."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "pateldhruvil-59191",
        "review_rating": "10",
        "review_title": "Entertainment at its best..!!",
        "review_detailed_main": "All your paisa are vasool..!!Get the best experience of movie after long and all thanxx to SALMAN KHAN..!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "umanminhas",
        "review_rating": "9",
        "review_title": "Review non spoiler",
        "review_detailed_main": "Dabangg 3 - is an all out Salman Khan Action Packed Masala movie. After the disappointment from Race 3/Bharat - Salman has come back, in his most suited Avatar. Dabangg 3 is far better then the previous two movies and the major reason is Sudeep and director Prabhudeva. First half is a little slow but gripping in terms of Mass, as it's all about Chulbul's previous life as you can see in the trailer. First half this movie has comedy/innocent love/emotion/family sentiments/heart breaking tears and a lot more. Second half is really fast and you would not want to blink your eyes as you might miss something, it's full of action and has the present Chulbul - who is grown up with his very deep voice does absolute justice. I think this movie will 100% become Salman's 4th 300cr movie or short of 250cr at least because movie offers everything that a Masala movie has. It also offers a social message which is quiet admiring as it's a masala movie and you don't get to see these kind of messages in Masala movies often. SALLU fans are in for a treat with early Christmas gift and general audience I'd say go watch it as you will not be disappointed and will come out happier."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kausikdutta",
        "review_rating": "9",
        "review_title": "Full Entertainer",
        "review_detailed_main": "Must watch for entertainmen, pure salmaniac film with great dialogues power packed action scene with new actrees good acting skilss and direction, lovly to watch"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ayushwasnik",
        "review_rating": "9",
        "review_title": "Dabangg 3",
        "review_detailed_main": "Its an out nd out salman khan show 😍😍🔥 nd full mass entertainer 🔥. Nd kichaa Sudeep mind-blowing acting 😍😍🔥🔥🔥"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "bhagirathisahni",
        "review_rating": "9",
        "review_title": "Overall Good movie",
        "review_detailed_main": "Dabangg3 is actually better movie than Salman's recent releases,Full on Entertainment,But haters are doing Negativity and hate for Salman effect the movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nikunjbihari-90244",
        "review_rating": "9",
        "review_title": "Its more than awesome movie",
        "review_detailed_main": "Please go and watch it once you will enjoy the movie its contain mass and masala too"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sibaprasadsamantaray",
        "review_rating": "9",
        "review_title": "block buster 🔥",
        "review_detailed_main": "Best masala entertainer 🔥🔥 🔥 my personal review bhai ke kitne saal baad acha movie aya hai.... 👌👌"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rharka",
        "review_rating": "9",
        "review_title": "Blockbuster full of entertainment",
        "review_detailed_main": "Blockbuster movie with full of entertainment mass + class Highly recommend must see"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "presplayz-85064",
        "review_rating": "8",
        "review_title": "Entertaining Family Movie!",
        "review_detailed_main": "I watched it first show with my family today and we really enjoyed it! First you need to go with no-brainer as its a MASS film and Salman Khan. I am not Salman or Kichcha fan but really enjoyed the final battle and the younger version love story of Chubul Pandey!\n\nReally worth going at least once with your family...!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sanjeevkumarsura",
        "review_rating": "10",
        "review_title": "explosion",
        "review_detailed_main": "It is good movie for the fans of salman khan , and even the other people also can see it ,,, it is not that much boring ... it is a quite good story"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "raktimdhar-65847",
        "review_rating": "10",
        "review_title": "FANTASTIC MOVIE WITH A GOOD MESSAGE",
        "review_detailed_main": "Masala..entertainer movie.. You can watch this with your family.. no vulgarity..no offence words were used... very entertaining..and siti maar performance.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Dastaan007",
        "review_rating": "9",
        "review_title": "What A good movie",
        "review_detailed_main": "I Just saw it here in the Netherlands. It was full entertaining With A lot of action comedy and a good serious backstory. Sudeep sir was Really rocking as Bali Singh. The darkness That hè gives to that character is amazing! Bless him! Salman sir didnt change a Bit as chulbul Pandey. I hope in the future that there will be a Dabangg 4 and the story will continue about the brother of chedi Singh. And that hè will join Singham, Simba en Akshay Kumars New character. That would be rocking! Just ons thing that was not necesarry was the amount of songs in the film. They could have cut 1 song out. I hope this movie will do good that we can get more of this action comedy movies. Bless the Dabangg trilogy!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mooreclay-27944",
        "review_rating": "8",
        "review_title": "GREAT AND ENTERTAINING",
        "review_detailed_main": "Amazing film by Salman Khan and Kiccha sir!\n\nKichcha Sudeep is the best villain I have seen in Dabangg series so farr!!!\n\nSalman Khan did awesome comedy and action in the film...!!!\n\nOverall I really enjoyed it with family :)"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mooreclay-02621",
        "review_rating": "9",
        "review_title": "MASS + COMEDY !!!",
        "review_detailed_main": "Great film with very nice dialogues and comedy scenes!!!\n\nReally enjoyed watching this film with my family yesterday! Salman Khan comedy had me laughing so much lol! Kichcha Sudeep looked AMAZING with villain role! All cast members did brilliatn acting!\n\nPrabhudeva is known for MASS films and he didnt disappoint. Amazing DIRECTION and Action scenes, especially the last final battle between Chubul Pandey n Bali Singh!!!\n\nMUST WATCH AT LEAST ONCE!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rajeshwarsingha-14939",
        "review_rating": "9",
        "review_title": "Full on Entertainment",
        "review_detailed_main": "For the past few years we have been watching Salman Khan doing experimental roles. However, he is back to entertain the mass. Dabangg 3 brings us the Salman Khan which everyone wants to see. Salman Khan as Chulbul Pandey is mind blowing. He takes the entire film on his shoulders. Kichha Sudeepa as Balli Singh is extraordinary. It seems that he was born to play the character. Sonakshi Sinha as Rajjo Pandey is good. She made her presence well despite having limited scope. Saiee Manjrekar as Khusi is very pretty. She makes her debut well. Apart from them all the other actors have given a good performance. The movie carries various social messages based on dowry, water scarcity and women safety."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "priya-40387",
        "review_rating": "10",
        "review_title": "Amazing movie!",
        "review_detailed_main": "We LOVED it! Action, romance, great story line, Salman Khan! If you are a fan of the Dabangg franchise, you will absolutely love this film, as it carefully explains why Chulbul Pandey is the way he is. Direction was the best of the three Dabangg films so far - full credit to the director Prabhudeva. If you haven't seen Dabangg 3 yet, go and check it out!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shahriarhossain-75879",
        "review_rating": "9",
        "review_title": "100 times better than the trailer of the film!",
        "review_detailed_main": "Dabangg 3 touched the zenith of the franchise !! With no doubt, it's a perfect Salman Khan film we were thirsty for. Salman's performance in Action, Acting, Comedy, Romance & even in writing the film is above anyone's expectation. Direction of the film 10 on 10! Narration 10 on 10 Music & background score is 10 on 10 Songs are not all good, but absolutely the album is a rest from the remakes!!!\n\nBest parts- (for which you should see the film) 1. All the action scenes, specially the greatest climax. 2. Before interval time. 3. Munna badnaam song. 4. Bali singh's attitude. 5. Dialogues. 6. Mention if i missed anything!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hannanfaruki",
        "review_rating": "9",
        "review_title": "Mind-blowing",
        "review_detailed_main": "It's a outstanding action Salman Khan in his own genre."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "theferdouskhan",
        "review_rating": "9",
        "review_title": "Chulbul Pandey vs Balli Singh Show",
        "review_detailed_main": "Dabangg 3 is all about Chulbul Pandey's past life. How he became Chulbul Pandey, why he puts on the goggle in his collar etc everything was revealed in this part. Moreover, the actions between Chulbul & Balli Singh was insane. Sudeep nailed the character Bali Singh."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kushalgupta-35389",
        "review_rating": "9",
        "review_title": "Blockbuster",
        "review_detailed_main": "What a movie Bhai always rockzzzz Ignore Paid Critics Salman is Show Stealer Sonakshi is Decent Saiee is looking cuteeee Sudeep Sir is Awesome Overall Action Packed Dhamaka Movie"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jatinsandhu-92351",
        "review_rating": "10",
        "review_title": "ENTERTAINING",
        "review_detailed_main": "Action-Romance-Masala-Drama full family entertaining movie paisa vasool picture hai"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "adharvsalmaniac",
        "review_rating": "9",
        "review_title": "DON'T BELIEVE ON PAID NEGATIVITY",
        "review_detailed_main": "Dabangg 3 is Full of Hard Core Entertainment..Today Meme Pages are unnecessary Trolling movie just for likes..Some Paid Negativity is also going on for the movie...But Truth is that This movie is a Entertainer...Watch with your family...You will not be Disappointed.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "chocolatykameena",
        "review_rating": "8",
        "review_title": "It's Fabulous job",
        "review_detailed_main": "Great direction as a.. Masala..movie superb.. At.. Intervals scene.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "luckydoctor",
        "review_rating": "9",
        "review_title": "Entertainment entertainment entertainment",
        "review_detailed_main": "One of the best entertaining movie ever... Salman Khan is a absolute performer...he performs the character of chulbul Pandey with ease...am going with 9 stars because one extra star for the biggest villain kichha Sudeep....he is absolutely fantastic"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "xxzzx-86782",
        "review_rating": "10",
        "review_title": "Best movie of 2019",
        "review_detailed_main": "So entertaining, so funny, full of action, awesome storyline..Bhai rocks.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "bk_connection",
        "review_rating": "8",
        "review_title": "What is wrong with critics and haters",
        "review_detailed_main": "I haven't written any review in here for many years, but today I decided to do so, after watching Dabangg 3\n\nThe movie starts with a blast and got all the masala a movie needs. Salman Khan is too good. Songs are a bit too many, but at least they are good.\n\nI don't understand why critics are bashing this movie, it's a nice movie which u can watch with whole family, without being vulgar.\n\nI give the movie a 7, but Salman Khan made the movie extra good so will give it a 8.\n\nMust watch movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "narayansinghcharan",
        "review_rating": "10",
        "review_title": "Awesome,fabulous ,jhakas movie must watch movie 😍😍😍",
        "review_detailed_main": "Awesome movie guys must watch ,, bhai is back with bang 😍😍😍 it is christmas dhamaka for his fans must watch movie.... Go and watch it u will like it definitely 😍😍"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "anilk007",
        "review_rating": "8",
        "review_title": "As expected !",
        "review_detailed_main": "An entertaining sequel. Salman Khan fans are left cheering, clapping & shouting. if you watch knowing what to expect (like the previous 2 movies), you will not be disappointed. There is over-the-top action and bad use of CGI but that is normal with Salman Khan movies. I enjoyed the movie. The 3 movies make a good trilogy. Overall=Good"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "morshedasif",
        "review_rating": "10",
        "review_title": "Chulbul pandey is back with a bang",
        "review_detailed_main": "Outstanding salman sir and sudeep ... What a climax fight on fire Out and Out masala movie Blockbuster coming soon 300c club one more"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "beingsrbsumit",
        "review_rating": "8",
        "review_title": "Dabangg3 blockbuster loading",
        "review_detailed_main": "Full on drama romance commdy action 🔥🔥 #SalmanKhan back bang Rate 4.5/5 star"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Sangramnayak143",
        "review_rating": "10",
        "review_title": "Best in Dabang series",
        "review_detailed_main": "A good family entertainer movie with lot of action.1st half is good and second half was awesome.after bajrangi bhaijaan this is Salman top rated movie👌"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dark-evil_lord",
        "review_rating": "10",
        "review_title": "Beware of the Negative Reviews, they are just paid bots.",
        "review_detailed_main": "Like really, the people who are complaining about depth in the script & novelty should go through a psychiatric checkup. If you want such things, you should have watched Super 30 or Chhichhore. If you have watched the previous parts, you just know what to expect. This movie was explained as a masala movie.. So obviously the story will be from the 90s. The thing which did Matter was the screenplay & the music both of which was good enough. The movie successfully delivers what it promises. A Holiday Entertainer.. With emotions, comedy, action & good music. And as usual the quirky Chulbul Pandey who gets an origin story in this one, plays to the gallery... A Christmas massy blockbuster..!!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "samullah-65683",
        "review_rating": "10",
        "review_title": "Best",
        "review_detailed_main": "Best in Dabangg series, You would love to watch Salman Khan, He is impressive, powerful and allover the movie...."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akaash_kumar-68700",
        "review_rating": "10",
        "review_title": "Salman Vs Kiccha. Must Watch 👌",
        "review_detailed_main": "Salman Khan aka Chulbul Pandey has his own universe. One of the best entertainer of 2019. You can't miss Chulbul Pandey Vs Bali Singh. SWAGAT TOH KARO HUMARA...🤘"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ershaikhshahjada",
        "review_rating": "10",
        "review_title": "Hud Hud Dabangg Dabangg",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mpscedutech",
        "review_rating": "10",
        "review_title": "Watch it ...don't listen to paid negativity...",
        "review_detailed_main": "Full masala....Damdar action.......Great background music......awara song is so nice"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dipuwheezal",
        "review_rating": "10",
        "review_title": "Dabang 3",
        "review_detailed_main": "Its an awesome movie,dilouge delivery,parbhudeva stunt,dance number songs comedy action drama is awesome,south industries jhalak seems in the movie,I ll give 5 out of 5.I don't want to give any spoiler, its a family drama type movie go and watch the movie with family and friends."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "tosifbhatti",
        "review_rating": "10",
        "review_title": "Don't let the negative rating fool you",
        "review_detailed_main": "Yes it isn't always realistic and sometimes too lame. But that's the point. It's an entertainment bomb. Every movies doesn't have to be serious like Bajrangi Bhaijaan. Just sit down and enjoy."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nishithkumar",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "2019 best movie. Not that worse what people are telling"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sagarkale-30943",
        "review_rating": "10",
        "review_title": "Brother",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "Magow-Intermean",
        "review_rating": "9",
        "review_title": "Dabangg 3 Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kanorekvk",
        "review_rating": "10",
        "review_title": "Awesome with some cons",
        "review_detailed_main": "The story revolves around Inspector Chulbul Pandeys early life n times before he becomes an inspector Pros: Very good cinematography Good dialogue Awesome visual Cons: Childish editing in two scenes Long runtime Too many songs"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jontyc",
        "review_rating": "10",
        "review_title": "Ssr Charsi bechara fan jeolous",
        "review_detailed_main": "All negative comments is from the charsi Ssr fans dont believe."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "fbargothi",
        "review_rating": "10",
        "review_title": "Timing matters",
        "review_detailed_main": "His best movie yet. Watch it with an open mind. Classic."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "mayankmashu",
        "review_rating": "10",
        "review_title": "Salman Superhit Khan",
        "review_detailed_main": "As always Salman is on a bang with another entertaining movie. He won't let his fans down. A simple story has been directed sooo good that audience enjoy every bit of the movie. It' Salmaniya all over the movie.. Great acting by every cast specially Sudeep. Sai is good but Sonakshi has same old expressions.. Overall a wonderful movie with great direction and awesome music.. A must watch"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "arbutt-38676",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "As usual awesome movie by the king of Bollywood. Awesome item song. Awesome actions and awesome dialogues."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "ramkumar-28288",
        "review_rating": "9",
        "review_title": "Masala film 🔥🔥🔥",
        "review_detailed_main": "Dialouges of the film were great. Salman khan's comic timing was very good and Kichcha Sudeep naile it 🔥🔥🔥"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "khoslagaurav",
        "review_rating": "10",
        "review_title": "Nice and blockbuster movie full paisa vasool",
        "review_detailed_main": "Very nice movie..must watch with family and friends"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "nasernolove",
        "review_rating": "9",
        "review_title": "I give this film a score of 10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "alifarddin",
        "review_rating": "10",
        "review_title": "Blockbuster movie",
        "review_detailed_main": "U can watch this movie, u also love this movie This movie action best & song best."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "akaashsarkar-39804",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "k-31454",
        "review_rating": "10",
        "review_title": "Nikunj kumar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sanjaysahni-59841",
        "review_rating": "9",
        "review_title": "Beaware of Negative reviews",
        "review_detailed_main": "Movie is good, Salman's performance and Kichha Sudeep as a villain is good , Actually Akshay fans are Doing lots of negativity for Dabangg3 giving negative review without watching movie,So beaware of all these fake reviews from Akshay fans, Watch Dabangg3 atleast once with family"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sapnasalman-01059",
        "review_rating": "9",
        "review_title": "Very good entraînement",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sagarhossaink-99869",
        "review_rating": "9",
        "review_title": "Realistic! Entertaining! Strong Action Sequences!",
        "review_detailed_main": "The boundaries between contemporary art and cinema are so rigid. It's unbelievable. The film critics don't know my artwork and the art world doesn't know my films."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "prangonbora",
        "review_rating": "10",
        "review_title": "Good but not best",
        "review_detailed_main": "This is a good movie I personally like it ..... Awara song was outstanding.... This is a good movie. Don't believe in anyone 😂 you must watched this film .... All the negatives review are from haters.. Good movie 👍"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "eventlaunch",
        "review_rating": "8",
        "review_title": "Solid Bollywood masala",
        "review_detailed_main": "Got to love it if you're a true traditional Bollywood fan ignore the bs critics s just watch it"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "lolclodify",
        "review_rating": "8",
        "review_title": "Good",
        "review_detailed_main": "It's a good action entertainer with romance, drama and songs all thrown into the mix. It does have a few off bits here and there but it is a good movie nonetheless. It's definitely not 10 star material but does deserve a 6,7 or an 8."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "syedmyaqoub",
        "review_rating": "9",
        "review_title": "Surprisingly good entertainment",
        "review_detailed_main": "I must say I wasn't sure going to cinema considering all the negativity surrounding reviews of the film. The only downside was mediocre songs, but had good music. There was more to story other than Chulbul Pandeys running the screen time. People who have issues with action in this movie should stick to Hollywood superhero flicks and shouldn't bother watching Bollywood"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "dkuheli-66997",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": "Paisa Vasool Seeti Maar Blockbuster Movie. Salman Khan & Kichcha nailed it, Saiee so cute... sonakshi good. I love this movie."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "alifhasan-39205",
        "review_rating": "9",
        "review_title": "What a movie of Salman",
        "review_detailed_main": "I really like Salman Khan. He always gift us some awesome movies. Also this movie was too good. I just cant explain. I think I am going to watch it again."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "jeelan-59330",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": "Wow great action,good songs with good music not remakes songs like bala"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "kalrakabir-44602",
        "review_rating": "10",
        "review_title": "Dabangg 3 is the hit movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "sdsardar",
        "review_rating": "8",
        "review_title": "Comedy, Action",
        "review_detailed_main": "Salman Khan's Swag Is Too Good.\n\nSai Manjrekar Looking Gorgious."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "istar-53862",
        "review_rating": "10",
        "review_title": "Outstanding movie",
        "review_detailed_main": "Maza aagya 💪 Salman ka baat hi alag h.\n\nBht mast movie h sb koi bht accha kaam kiya h."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rocktanga",
        "review_rating": "9",
        "review_title": "One time watchable.",
        "review_detailed_main": "Watched it in theatre 🖤. It was based on taking revenge on whom killed chulbul's love.."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "hri-30136",
        "review_rating": "10",
        "review_title": "I rated 10 star",
        "review_detailed_main": "One Line for in this movie. Best movie i have been ever seen."
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "arnevdb-13324",
        "review_rating": "8",
        "review_title": "AMAZING",
        "review_detailed_main": "All the people who gave a bad review are just doing it because others say so. This movie was LIT, just as cool as the first 2. Nice story, lots of humour and action. PLEASE try it for yourself before you let it be judged by others!!"
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "shiva-maharjan",
        "review_rating": "",
        "review_title": "pathetic movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "rajrajeev-93462",
        "review_rating": "",
        "review_title": "Review of dabangg 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7059844",
        "movie_name": "Dabangg 3",
        "movie_rating": "3.0",
        "review_username": "vyasvishal-05311",
        "review_rating": "",
        "review_title": "Save your brain than your money",
        "review_detailed_main": ""
    }
]