[
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "houghtonconnor17",
        "review_rating": "7",
        "review_title": "A Movie of Two Acts: Unfortunately Only one of Them is Any Good",
        "review_detailed_main": "Yash Chopra's last cinematic outing left me feeling somewhat conflicted, but I would still recommend it as a watch for any fan of Yashji. First I would like to elucidate the moving and effective parts of the film before I go on to the major critique. Firstly, the performances from all of the actors were at least at par with their previous work, and I thought Shah Rukh, in his role as a Major in the Indian army was one of the best of his career. In addition, the cinematography and the songs in the movie were both enchanting and involving. The story is very compelling and (though a touch filmy) gets the viewer involved in the struggle between the characters very well, a feature that is common to most of Yashji's work in any case. On to the negative aspects. While the story is engaging, the character development is somewhat confusing. We get to see the change in Shahrukh over time from a carefree worker in London to a cold and calculating soldier carefully orchestrated over time, and yet Katrina's character is portrayed in a very nebulous light. She takes her relationship with God very seriously in some areas, but in others it seems to be at the back of her mind if it is there at all. Normally I would attribute this to Kaif's lack of depth in acting ability, but in this case she cannot be entirely to blame as she was at least adequate in the role she was given. The second major problem is that the antagonist, God, is never portrayed (if He could be at all) in a very distinctive light. It would be giving away plot points to say exactly why, but suffice it to say that Chopra did not seem to have the heart to actually portray a fight against God, and so the effort of making him the only true antagonist seems to be halfhearted. Finally, in the final third of the movie, a somewhat shady tactic is used in order to propel the story forward. While I have seen worse devices used in Bollywood films, it did seem like a somewhat cheap ploy to utilize in order to move forward. This does seem to somewhat distance the audience from the actual plight of the characters and further seems to muddy Katrina Kaif's role in the film. Overall, I would not call this a terrible movie by any stretch and certainly a beautiful film to watch, but if there is any lesson to take away from this film (other than for Shahrukh Khan not to go on the streets in London) is to keep it simple and that emotion can only go as far as reality allows it."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rsabnis1",
        "review_rating": "7",
        "review_title": "Romance : Immortal Forever",
        "review_detailed_main": "Directed by the late Yash Chopra, the film doesn't cease to impress the romantic movie lovers and of course SRK fans. People go in with some expectations of a 'Yash Chopra' type of romance and are not disappointed at all. It begins with a fearless army officer Samar moving all along Kashmir diffusing bombs without tinge of fear in his mind. The story flies in flashback after the audience is well settled for the movie. Shah Rukh Khan handles the role of a strict army officer and jolly youngster so well that it seems hard to believe that both roles are played by the same man. Anushka sharma is bubbly and ' happy-go-lucky girl' who lives life to the fullest breathing every moment of her life happily. Katrina Kaif on other hand is exactly opposite to Anushka. She is a God-lover, believes in goodness,reserved, n filled totally with love. Yashji never lost hold of his directorial touch in the movie. The songs do deserve a thumbs up. Especially the romantic Saans and foot-tapping Ishq shava. Challa makes u groove a bit on your seat. Heer likely to trigger some emotion So for all the romance lovers, JTHJ is a perfect and 'go for it' film."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "koustav_net",
        "review_rating": "8",
        "review_title": "One of the year's best.....!!!!",
        "review_detailed_main": "Jab Tak Hai Jaan - In a time dominated by South Indian remakes and illogical stunts comes a movie that is so refreshingly different from those mindless sagas. A movie that connects to that Old World charm and beauty of a special feeling called Love. A movie that will make you feel good about life and gives you hope about love. Though an Love Story on the surface, the movie has its own layers of emotional undercurrent running from its inception till the last frame.\n\nAnd The Great Yash Chopra is not called a LEGEND just like that, he justified his legendary status yet again with a MASTERPIECE.\n\nAnd there is no match for SRK when it comes to intense roles. He excelled in a role tailor made for him only. When MR Bachhan calls his' act as \"THE BEST\" after Swades, who are we to comment on that. Still, I believe this movie will not appeal to all, as not everyone is born with a good taste and we can't help it."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "vivek-ramasha",
        "review_rating": "10",
        "review_title": "His last and his best..",
        "review_detailed_main": "Amazong plot, great direction and brilliant acting is what that sum up to a good movie. JTHJ had all three of them.\n\nBeing one of the most anticipated Bollywood movie of the year(SRK's only movie), audiences had high hopes. I doubt any of them would have been disappointed. From the very beginning to the end, it was terrific. Three best thing about this movie were its plot, A. R. Rahman's music and SRK. His acting was brilliant, but that's hardly a surprise. Katrina, after a long time since Namastey London, has given a convincing role. Her chemistry with SRK was great. But even with her relatively small role, I think Anushka Sharma came on top with her acting and unmatched facial expressions.\n\nMovie isn't predictable...at all. You'll keep guessing how its going to end and it will surprise you. Its unpredictability is another factor you won't find anybody yawning.\n\nSumm- One of the best romantic movie to ever been made. Do NOT miss it. I would give it 11 on10, but that will be a wee bit difficult. Mr. Yash Chopra's last movie is probably his best. RIP Sir!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "fanofbollywood",
        "review_rating": "10",
        "review_title": "Rarely we call a bollywood movie the Masterpiece - JTHJ is the One !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sal_maan12",
        "review_rating": "",
        "review_title": "It's a mature old-fashioned love story, told in a young, engaging but slow way.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sanjibm8",
        "review_rating": "7",
        "review_title": "A simple yet twisted tale of love followed by great performances",
        "review_detailed_main": "A sweet but twisted romantic movie by Yash ji which redefines love stories. A movie that should not be compared to Veer Zaara which had a different aspect.Jab Tak Hai Jaan is unique in it's own way,it has all the moments in it.A story about a man whose life has played a freaking game with him for getting his ladylove. Plus Points:\n\nGreat performances of three leading actors-Shah Rukh,Katrina & Anushka. Movie direction by Yash ji and Music direction by A R Rahman saab. Choreography by Vaibhabi Merchant and cinematography by Anil Mehta. Story by Aditya Chopra. Minus Points: A little bit of excess length (needs patience)."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "p-ashwathnov",
        "review_rating": "3",
        "review_title": "One of the Best romantic movies.. will be Shahrukh's highest grosser..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "DICK STEEL",
        "review_rating": "10",
        "review_title": "A Nutshell Review: Jab Tak Hai Jaan",
        "review_detailed_main": "We see Major Samar Anand (Shah Rukh Khan) being the shining star of the Indian Army's bomb disposal unit, clocking almost close to a hundred IED diffusion and doing so in daredevil fashion. Some call him the man without fear, while others coin the term the man who cannot die, because his job is high risk, but he doesn't take the necessary precautions. The routine involves going off for a little quiet time for himself after having stared death in the face, but this time round got rudely interrupted by the vivacious Akira Rai (Anushka Sharma), who is adamant to get a stint with Discovery Channel, and chanced upon Samar's diary of sorts which got left behind.\n\nAnd this natural flashback provided a look into the Major's past before his army career, being a multiple job holder in London in order to make ends meet, from shoveling of snow to the waiting on tables, to being a fishmonger, and busking in the streets. Fate allows him to meet poor little rich girl Meera (Katrina Kaif), and before you know it, their constant interaction to exchange tips in the learning of languages form the basis of their relationship, even though Meera is engaged to a rich scion. I suppose no girl can resist the charms of a man who can serenade at multiple London landmarks, and dance the way SRK does.\n\nBut here's the catch which I thought was an extremely bold move. Religion comes into play, and this takes on proportions and depth of discussions about how some put religion as priority, having empowerment over their lives, that it could sometimes lead to paralysis of sorts. To save Samar's life, Meera makes a pact with her spiritual father, and I suppose only a bet as big as exchanging one's happiness with the life of another, can bring that prayerful wish to fruition. But this causes bitterness in Samar because how can one do battle with Jesus? It's almost impossible, but if this rivalry of one's heart, toward man and toward god, isn't colossus, then I don't know what is.\n\nI suppose what Yash Chopra's story was trying to say, is that without love, or keeping the faith, one's life can get really inward and withdrawn, losing that fun element with all things going really serious, and at times, reckless. Samar goes back to India and fulfills his family lineage of military men, but chooses the riskiest of professions, if only to tempt the higher being at taking his life away, and in such fashion to put a dent in his ex lover's faith. Akira enters the picture, and finds this old fashion love of the previous decade a lot more meaningful than the present throwaway ones that centers around physical love. The second half after the intermission sees the relentless pursuit Akira has for Samar, only for her constant advances to be continuously rejected, because in essence, Samar's heart was locked in on another, and left for dead.\n\nAs if that wasn't enough - with how Samar has turned into a Meera even without his knowledge, in shutting people out - Yash Chopra has more up his sleeves when he has to put everyone together, forming tremendous tension especially when throwing in one of the oldest plot elements in the book for a romance, albeit too with one too many hospital stays. It's decision time, and you'll find yourself taking sides as to who Samar should eventually end up with, after having emotionally invested an hour with each heroine. Characterization here is top notch in making everyone of them rich and real, that you'll probably see shades of yourself, or people you may know, in one or more of the leading protagonists.\n\nShah Rukh Khan once again shows why he's one of the leading men in Bollywood, with his fine all round performance in being a younger man who is full of zeal, hope and life, with the world ahead of him given his hard work, and yet balancing that out with a more sullen, serious look as the hardened military man with a death wish, nursing a broken heart and resigned to the impossibility of challenging god. Between the two leading ladies, it is difficult to pick who actually had an edge over the other, but if it's a personal choice, I'd give my vote to Anushka Sharma if only for her assured portrayal of a bubbly personality who knows what she wants and is a go getter, being in for a challenge when encountered with emotions she has yet to handle, compared to the more indecisive character that Katrina perfectly portrayed, in what would be a classic Yash Chopra model of the unattainable femme fatale responsible for the total breaking of hearts.\n\nCinematography is great, as you would come to expect from a Yash Raj production, with lush costumes, glossy production and art design, sets and locales being nothing but the best to put you in the mood for love, and love lost or broken. Music by none other than A.R. Rahman also lifts the film into epic greatness, befitting a contemporary love story of our time. If anything, Yash Chopra's parting gift through his films, and this one in particular, is a reminder to keep the faith, that love will come in good time, and to remember to live life, not be afraid of it. A definite must watch backed by all the right reasons."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kescool",
        "review_rating": "7",
        "review_title": "Jab Tak Hai Jaan (Review)",
        "review_detailed_main": "Jab Tak Hai Jaan (Review) - The movie has finally hit the screens with a lot of expectations mainly because it is the swansong of late veteran director Yash Chopra and also because it is a Shah Rukh Khan starrer. This movie was initially touted as \"A Yash Chopra romance\" as it is a genre in which the director has excelled in making movies from about half a decade. The movie begins in the present day when Samar Anand (Shah Rukh Khan), employed with Indian Army, dressed in military outfit makes an entry on an RE 500 and is trying to diffuse a bomb which he specialises in. Then enters a happy go lucky Iraa Rai (Anushka Sharma), a prospective documentary film-maker. By sequence of events we are soon taken 10 years back in time in London where Samar is employed to clear snow off the roads after a snowstorm which is just one among the many jobs he does to earn a living. On one such day, Samar comes across the other protagonist Meera (Katrina Kaif) who is running into a church to make a confession. Samar instantly falls for Meera, the daughter of a very well known industrialist played by Anupam Kher. No sooner, events take turn and Meera who approaches Samar to learn punjabi, falls for him. After a long wait, the interval which eluded you for a while actually happens. In the second half, Iraa wants to make a documentary on Samar Anand for Discovery Channel. So she goes around with him on all his endeavours and makes a documentary titled \"The man who cannot die\" inspired by all the successful bomb diffusing endeavours of Samar. Then Samar meets with an accident and ends up losing memory and can remember nothing since 2002. Finally what happens to the protagonists, Who lands up with whom in the climax is to be watched on the big screen. Yash Chopra who is known for capturing scenic locations and portraying romance like none other, has excelled in that front this time as well which is evident as the crowd cheers every single frame that looks exquisite. Cinematography is one of the USP's of the movie as landscapes in Kashmir, the London bridge have been shot so well to the liking of the audience. A.R. Rahman makes his mark as well as the music of the film stands out in a couple of songs like Challa, Saans and Ishq Shava. Watching Challa and Saans on the big screen is literally a treat to one's eyes. The music for the street dancing sequence and the choreography for the same is also brilliantly done. Watching this movie would probably take you back in time to those days when cinema meant storytelling. Glad to see that the Hindi film industry is going back to storytelling ways and that is definitely one of the main things that makes you sit back and watch even though about 15-20 mins in the second half might seem to be a bit dragging. The length of the movie could have been trimmed though. The performances by the actors are commendable. The montages of the making of \"Jab Tak Hai Jaan\" is shown at the end of the movie as a tribute to the director. The last frame in which Yash Chopra says \"ACTION\" and the crowd in the theatre clap, was the best tribute probably depicting that the man will always live on with his work. Watch this movie for it is definitely worth a watch. My verdict - 7/10."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "prat-pattu",
        "review_rating": "1",
        "review_title": "The most stupidest and illogical movie ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dineshprakash",
        "review_rating": "8",
        "review_title": "Sweet, good and enjoyable love story",
        "review_detailed_main": "It is a good sweet love story. I personally adore Late Yash sir films. Till interval I was very scared because movie is very slow till interval, almost at the level of boredom. Nothing happens. Just before 15 minutes it takes good pace and suddenly you start enjoying it. Movie runs on a good pace till half an hour before climax. Again it slows down badly before climax. I was unable to understand that if one forgets something which is not very important to survive or any strong reason then why all are very desperate to make him remember. Thank God , climax is good. A very good story but screenplay by Aditya Chopda and Devika Bhagat is not up to mark. It drags so many times. Dialogues by Aditya Chopda , are very good, especially after interval. Performance wise Anushka Sharma is show stopper. Shahrukh Khan is very good in intense emotional scenes as usual. Katrina Kaif is also good. She is very balanced actually. Music by A.R. Rehman is good. One song is very good \"SAANS MEIN TERI SAANS MILE\". It's lyrics is typical of Gulzar Saab one but rest one lacks his mastery. Tune wise this one and another song \"HEER\" is good. After all one time must watch."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mishrarakesh793",
        "review_rating": "7",
        "review_title": "fall in love once again!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "iyer-venkatesh2",
        "review_rating": "1",
        "review_title": "Nikal Li jaan !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "salludtiger",
        "review_rating": "10",
        "review_title": "jthj",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "iceicebaby542",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan Too Good",
        "review_detailed_main": "Hello.. I watched Jab Tak Hai Jaan.. And I am not at all disappointed after watching this movie.. Brilliant Movie..\n\nActing was good of all the stars.. But SRK was perfect like as usual..\n\nUnique Love story.. Watch this movie you will fall in love once Again..\n\nYashji thanks for this movie..\n\nThe chemistry between SRK and Katrina was really good.\n\nTwists were good in d movie..\n\nMusic was excellent.. Direction was good.\n\nPerfect Movie to watch with family..\n\nGuys Must watch..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "careyrajan",
        "review_rating": "7",
        "review_title": "The Man who cannot die",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mohan_lal",
        "review_rating": "1",
        "review_title": "Not suitable for anybody with a three digit IQ",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shaktiswarupblore",
        "review_rating": "8",
        "review_title": "Another feather to Yash ji's cap",
        "review_detailed_main": "A perfect love story from the duo - Yash Chopra and Shahrukh again after a long time (I hope Veer-Zaara was the last). This movie filled with Love, Romance and enjoyment.\n\nKatrina's fans: you must see this :)\n\nStoryline: Though there is nothing in this story which you can't imagine while watching it, but little way out of a normal one.\n\nDirection: Direction was amazing, hats off!\n\nActing: Shahrukh, Katrina and Anushka acted very well in this movie.\n\nA full family entertainment movie, go and watch this on this festive occasion!\n\nI would rate 8/10\n\nDear readers Wish you a very Happy Diwali to you and your family!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gurmeetduggal31",
        "review_rating": "7",
        "review_title": "Stunned! Made me believe once again the true power of love",
        "review_detailed_main": "The movie had the best music. A very good presentation of love and pain what i saw in eyes of Sharukh and katrina. the first half was so awesome when sharukh saw katrina and narrates her pari ...and was truly madly in love with her. katrina did an amazing job. She looked very natural and it was great to see the way she learned punjabi song and then they had a cool dance and after a kiss she started loving sharukh. they both were amazing together on the screen. The movie was sweet till the interval and other half was a bit pain. and emotional but that i believe was the good balance kept. and the best thing about what i liked in movie was the love which was still there for srk and kat for each other after 10 years! we don't usually get to see such nice movies these days! it was the best .. cant wait to get a copy of this for my personal collection"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "raghubs81",
        "review_rating": "1",
        "review_title": "Jab Tak Jai Jaan Math Dek 'Jab Tak Jai Jaan'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "amit-dutta89",
        "review_rating": "10",
        "review_title": "A Uttermost Romantic Movie--Love Redefined",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "saytosandeep",
        "review_rating": "7",
        "review_title": "MY REVIEW: Yash Chopra's Last Romance!!",
        "review_detailed_main": "Jab Tak Hai Jaan. It's not good because it's last indulgent attempt of Yash Chopra. It is good because Yash Chopra had the ability to adapt his love stories to changing times. His hero has still the old soul of undying love but one of his heroine is straight from the generation from 21st century. Every love story has a villain who does not like lovers to be close to each other, here he is God himself. The story has three acts, first riding on confident performance of Shahrukh Khan, second act riding on soulful energy of Anushka Sharma but third act is where writer and directors find themselves in confused state and let the story fill with few silly twists. Movie works because it has soul, neat characterization, uncluttered screenplay and nice background score but it is let down by average work by A.R.Rahman and Gulzar in songs by their standards and the average performance by Katrina Kaif which could have been a killer performance if played by some better talent. Nevertheless, it is a nice love story to enjoy once for sure."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "itzntme",
        "review_rating": "1",
        "review_title": "Movie Review: How Jab Tak Hai Jaan gets romance wrong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sharyarkhan73",
        "review_rating": "10",
        "review_title": "Amazing movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "devinder_singh2002",
        "review_rating": "10",
        "review_title": "awesome movie to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "preetsdhakappa",
        "review_rating": "",
        "review_title": "Yash Chopra's Work Montage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "parmvir_87",
        "review_rating": "7",
        "review_title": "A decent film, could have been better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "karun_kumar",
        "review_rating": "1",
        "review_title": "Horrible, obnoxious, quite possibly one of the worst films of the year !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shaan4444",
        "review_rating": "10",
        "review_title": "if u have a good taste in movies .. this is it..!!!",
        "review_detailed_main": "Amazong plot, great direction and brilliant acting is what that sum up to a good movie. JTHJ had all three of them. u should have a good movie taste to watch this movie..!!! Being one of the most anticipated Bollywood movie of the year(SRK's only movie), audiences had high hopes. I doubt any of them would have been disappointed. From the very beginning to the end, it was terrific. Three best thing about this movie were its plot, A. R. Rahman's music and SRK. His acting was brilliant, but that's hardly a surprise. Katrina, after a long time since Namastey London, has given a convincing role. Her chemistry with SRK was great. But even with her relatively small role, I think Anushka Sharma came on top with her acting and unmatched facial expressions.\n\nMovie isn't predictable...at all. You'll keep guessing how its going to end and it will surprise you. Its unpredictability is another factor you won't find anybody yawning.\n\nSumm- One of the best romantic movie to ever been made. Do NOT miss it. I would give it 11 on10, but that will be a wee bit difficult. Mr. Yash Chopra's last movie is probably his best. RIP Sir!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "MrSlickJerk",
        "review_rating": "7",
        "review_title": "Good according to bollywood standards",
        "review_detailed_main": "I watched this movie because many of my friends praised this movie a lot. So I watched with high expectations. Maybe that's why I didn't find it that amazing. But it was a good movie nevertheless.\n\nJTHJ has good story. Something new to see. Not so predictable. It is shot in beautiful locations which makes it beautiful to watch. Acting was average. Shahrukh was as usual shahrukh. It has the typical Bollywood elements of dancing, singing and is over dramatic at some places. A tragic ending could have made things a little interesting.\n\nTo sum it up, if you are a Bollywood fan or shahrukh fan, you are going to love it. Otherwise, it is an average movie which is almost one hour lengthier."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "indianausjones",
        "review_rating": "1",
        "review_title": "Why do people lie ?, well...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "npshah-528-794829",
        "review_rating": "9",
        "review_title": "An Epic Saga",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ksreekar",
        "review_rating": "6",
        "review_title": "Lengthy, illogical, but some neat twists and an enjoyable plot. Doesn't deserve the hype.",
        "review_detailed_main": "To start of.. Jab Tak Hai jaan was Yashji's last. This automatically brings hype and with it come high expectations. Frankly, It doesn't deserve the hype.\n\nThe story has some neat twists. Most of them at the perfect time. And by that I mean whenever you feel the film is dragging, there comes a twist.\n\nSRK was not as good and does not create an impression in the first half but certainly does in the second. He portrayed the deep role of an military personnel perfectly. I think that SRK now is perfect for those old man roles rather than being a 25 year old.\n\nAnushka Sharma was brilliant in her role.. whenever she was on screen, the film seemed to have a fresh look about it. She was perfect.\n\nThe film has a lot of those beautiful locations as you would expect from a yash raj film. A lot of those in Kashmir and UK.\n\nThe film also had a lot of minus points.\n\nFirst off.. a 47 year old SRK doing the role of a youngster.. not very pleasing. And there was Katrina.. with her same plastic looks and pathetic acting.. The length of the movie was annoying. Frankly speaking, I thought the film was over at the interval.\n\nOscar Winning A.R.Rahman fails to make an impression. Specially the film depended a lot on songs like Challa and Ishq Shava but they were not up to the mark. Better music would have given the movie a lift.\n\nAnother main thing which was missing from this film was logic. Well I cant actually tell you those Illogical moments because it would reveal the plot. But some of them were really over the top.\n\nBottom line: Watch It if you are a Die Hard SRK fan or you just have nothing to do this weekend."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "tushar-panda",
        "review_rating": "3",
        "review_title": "Unfortunately not good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "reham_khaled1967",
        "review_rating": "9",
        "review_title": "Amazing story, good to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "alamin89",
        "review_rating": "9",
        "review_title": "A Yash Chopra Romance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Esentyfive",
        "review_rating": "",
        "review_title": "Another AWFUL film with artificially inflated ratings",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "anirudhjaura",
        "review_rating": "6",
        "review_title": "Jab Tak Hai Jaan..doesn't take your breath away",
        "review_detailed_main": "Jab Tak Hai Jaan is not your timeless classic of a tale well told and a story unfolding in a manner that would make for repeat viewings. It is your formula Bollywood movie, a formula that has been perfected over time by a master storyteller..well, at least on some counts. On others, its best if you go prepared to make certain concessions.\n\nIf you are willing to give up on logic/ believability of certain scenes, go mentally prepared that the movie would seem endless and runtime would be excruciatingly long, there'll be plenty of unnecessary song and dance that could easily have been avoided – if you are willing to overlook all that well, then Jab Tak..provides another story of eternal love made quite watchable by the veteran himself. If not, then its best strike to this one off your list at this stage itself\n\nThe first half of the movie plays like a musical. With three songs and a long dance sequence crammed in, there's little room for anything else. There is precisely one moment in the entire first half that would cause some stir and that's where the master wields his magic wand. Other than that, its pretty much all about the song and dance. While the music itself is decent, one still expects more from A R Rahman, and considering it does nothing to progress the story line, it becomes frustrating\n\nThe second half provides more of the story though the twists and turns (if you could call them that) are less palatable. Each new sequence is less convincing then the earlier one and the movie lurches towards a rather delayed climax. Somehow, somewhere things happen and by the end of it all, Yash Chopra manages to convince you that this is yet another story of eternal, never-ending love, but only just, this time round\n\nAs for the performances, Shahrukh is predictable as ever and one really can't see him for the character he portrays. While the same could be said for Katrina, given her historical record, this is probably one of her better performances. The real star of the movie though is Anushka Sharma who brings a natural ease to her character and a lot of freshness to the proceedings. That and the wonderful cinematography of exquisitely shot landscapes are some of the best reasons to watch this movie\n\nSo what's the verdict? Well, Jab Tak Hai Jaan certainly doesn't take your breath away but despite its flaws its a decent one-time watch especially considering this was Yash Chopra's swan song and this is a man who has literally immortalised love on the bollywood mantelpiece – its worth a watch if only to honour his memory"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ishaanp92",
        "review_rating": "5",
        "review_title": "Nothing Special",
        "review_detailed_main": "The movie had some good scenes but overall the plot was very lacking. At several parts of the movie I wished the movie would just end, keep in mind I am still a very big SRK fan. SRK's acting was amazing as usual, Anushka's acting was incredible as well, Katrina's acting could have been done better. Despite the overall acting, the movie was terribly unrealistic. Why would a girl not choose to be with her lover just because of a promise to god. Other areas of the movie were done well, such as the dancing in some scenes were incredible (specifically the part where Katrina dances in the nightclub). However the songs could have been much better especially coming from A.R.\n\nOverall, I don't think this is no where close to Yash Ji's other movies. Nothing comparing to DDLJ or his former movies. Regardless, I felt that the only reason the movie will be able to do well on the box-office is because of SRK and being Yash Chopra's last film. If Yash Chopra was still alive or was to make another film, the reviews would have been a lot more harsh simply because the movie was done terribly, from the plot to the script, it was a nightmare."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sud-chouhan",
        "review_rating": "10",
        "review_title": "You can watch this movie again and again jab tak hai jaan.",
        "review_detailed_main": "I'm very very very happy with this movie. Samar Anand and Major Samar Anand are the best roles SRK's ever portrayed. You cannot take your eyes off SRK once you enter the hall. Yash Sir has done something really incredible. Roles of Katrina and Anushka are nicely categorized. Katrina acts as a bold and beautiful seductress and what can I say about Anushka! She's simple and amazing at the same time. None other than this trio could have played their respective roles. Story is awesome, locations are eyeball gripping and songs in the first part create base for the script. thousand cheers for the team. I can watch this movie again and again...Jab Tak Hai Jaan."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "DesiBaba",
        "review_rating": "6",
        "review_title": "Mediocre by YRF standards. Poor lead casting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shiv_7668",
        "review_rating": "1",
        "review_title": "most boring love story of 2012",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dheeraj-goyal60",
        "review_rating": "9",
        "review_title": "The best in recent times !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "grunge_jucy",
        "review_rating": "6",
        "review_title": "a weak plot beautifully crafted by late Yash Chopra..",
        "review_detailed_main": "What a silly reason to break a relationship that a promise made to god not to meet forever with the love of the life in return of the lover's life. Who does that? Here Meera (Katrina Kaif) does that. Just knowing this much, you may think what a stupid plot. Despite the weak typical plot Mr. Yash Chopra has beautifully crafted the whole picture with the leading man Samar Anand (Shahrukh Khan) along with the tangled romance with Akira (Anuska Sharma).\n\nSamar Anand,an arrogant lover, a passionate lover, a bomb defuse expert of the Indian army, a man who cannot die although wants to be dead and does risky and extremely dangerous jobs without any precautions to defeat the god. Akira, a daring, confident and new generation girl, who is not serious in relationships, accidentally meets with Samar. Akira comes to find a Samar ten years back and love of his life Meera, their romance and they apart through his diary. Akira makes a documentary of the man who cannot die (samar) and finds her falling in love with Samar.\n\nJab Tak Hai Jaan has the intensity to make you fall in love. It is a typical love story with modern treatment. The repeating accident to the same character, the unrealistic religious faith, amnesia and it's recovery, the love triangle fells like traditional Indian love stories. But there's no doubt, the film makes you feel love with the film and Samar. The story telling style is as usual of the Yash Chopra. The two female protagonist are totally different. Meera, Yash Chopra's leading lady type and Akira total opposite, but both are madly in love with Samar. But the fact is, \"Jab Tak Hai Jaan\" rests on Sharukh khan. We can see his as both charismatic and intense and arrogant lover, who is just passionate about his love throughout his life as the title says, \"Jab Tak Hai Jaan\".\n\nI am giving it 6 out of 10. Despite a weak plot, it is beautiful work which makes you feel love."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dyutimaan",
        "review_rating": "3",
        "review_title": "In one word : Its stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ricky-twity",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan and Beyond",
        "review_detailed_main": "There are commercial movies, art movies, action movies, horror movies, thriller movies and yes now remakes and then there are Yash Chopra Movies. Movies that entertain you, make you dance, make you laugh, make you cry and above all make you love the life.\n\nJab Tak Hai Jaan has it all and beyond. What makes Jab Tak Hain Jaan special from Yash Ji's earlier movies is the narration, characterization. When he shoot portions in Kashmir and Ladakh he never did it for the sake of Natural beauty. Switzerland, lush green mountains a sort of character in all his movies is not there in this one. But nature plays a important role in narration. And that's what Yash Chopra is. The portions shoot in ladakh are not romantic considering its rough mountains, light comic scenes in kashmir valley and some thrills of bomb defuse in street of Kashmir. Kashmir is not there just for scenic beauty.\n\nThere are actors, there are heroes, there are superstars, there are stars and there is Shah Rukh Khan. He needs no special dialogs he makes ordinary ones very special. His eyes speaks thousand words..Jab Tak Hai Jaan makes you believe that here is someone who redefines acting. A classic performance from a legend.\n\nIt's hard to select who is better Katrina or Anushka though few may say Anushka but that's due to her character. What Darr did to Shahrukh's career and his way of acting Jab Tak Hai Jaan will do to Katrina and Anushka...watch their performances post Jab Tak Hai Jaan...now on they can make a ordinary role a talk about.\n\nThere were mix reactions about Music but once you saw the movie you will agree this is the best music. Like all Yash Chopra movies music of Jab Tak Hai Jaan is not for making popular music but it is important part of movie. For Example Challa song or Heer song...you may wonder why out and out Punjabi song? but when you watch the movie you come to know they are in Punjabi for a reason.\n\nTechnically movie is stunning...cinematography is awesome and so is choreography. Few may fill the movie is slow...but then understand love stories are not Action or thrillers where you want a fast paced narration. Love Stories do need their own time to move on.\n\nTo conclude....this is not the last movie of Yash Chopra for me....through the future performances of Shahrukh, Katrina and Anushka Yash Ji will talk to us....and with smile will say Main Yahan Hoon Yahan Hoon Yahan Hoon Yahan\n\nThis movie is special in many ways...DON'T MISS IT"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "jen-122-636160",
        "review_rating": "9",
        "review_title": "Transitional movie for SRK",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "superindrajit",
        "review_rating": "6",
        "review_title": "Fairly Okay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mdobaid777-387-527769",
        "review_rating": "1",
        "review_title": "****This review contain Spoiler**** (King Of Romance)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dhulia-sarkar",
        "review_rating": "10",
        "review_title": "beautiful experience !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "hiteshjulka",
        "review_rating": "6",
        "review_title": "an average first half followed by a better second half",
        "review_detailed_main": "After hearing so much about the film i finally decided to see the movie even though i am not a fan of SRK and the 2 leading ladies\n\nThe movie kicks off well with a hurt locker style bomb diffusion by SRK who is playing major samar anand.also the few poetry lines in the beginning are good and then starts the melodrama\n\nThe first half of the movie is so slow that you may feel like leaving the hall but katrina's charm,dancing and far better acting hods you. the movie is irrelevantly extended because of the pace of first half which also contains some ineffective laughter punches\n\nAnd now comes the second half and it was definitely better than the first.the story finally gains some pace with all the romantic and accident stuff which i am not going to reveal.i really liked the ending though it was a bit predictable\n\nCamera work, music (especially the Heer song), direction and all the glamor stuff is pretty good as seen in most of yash raj films\n\nAll in all, irate this movie 2.5 out of 5 attributed to katrina;s charm and some beautiful camera work and its a one time watch."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gamer-sawan",
        "review_rating": "3",
        "review_title": "Very Very Lengthy Movie ...Outdated Romance !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "The plot is really hard to believe...but it's done so well you won't mind.",
        "review_detailed_main": "To enjoy \"Jab Tak Hai Jaan\", you really can't think too much about the plot. After all, when you really think about it, it seems ridiculously impossible and farfetched. BUT, if you put all this aside, you'll find a wonderful love story...one that will require you have a box of Kleenex nearby!\n\nWhen the story begins, Samar (Shah Rukh Khan) meets Meera (Katrina Kaif). At first, Meera just seems rich and spoiled, though as the story progresses you see she is a very good person and cares about others. But she also has a problem. After meeting the happy Samar, the pair help each other--she teaches him proper English so he can become a better waiter in his job in London and he helps her learn to sing and express herself, as she's going to marry soon and wants to be able to sing for her spouse on their wedding day. However, over time the two fall in love and Meera is in a bind....as the man she originally planned to marry was the man her father chose for her. But now, she finds she just can't resist Samar....so she plans on telling her father and marrying Samar. But there's a problem. First, shortly after meeting Samar, she promised God that she would marry her fiancee, not Samar. And, second, shortly after she forgot this promise, Samar was hit by a car and nearly dies....at which point she promises God that she'll not marry Samar after all...if Samar's life is spared.\n\nA decade passes. Samar is now a rather suicidal man, as without Meera, he doesn't mind dying. So, he's now Major Samar Anand of the Bomb Disposal Unit back in India. He's great at his job, by the way, because he doesn't fear death and this brings him some fame...and Akira (Anushka Sharma). Akira is little like Meera. She is a bit younger, more of a party girl and more spontaneous. But she's heard the story about Samar...including his abortive relationship with Meera...and she thinks it would make a great story for her job with the Discovery Channel.\n\nFor the next few weeks, Akira works with Samar. Not surprisingly, she also falls in love with him...though Samar is reluctant to commit to her and give up Meera....even though Meera hasn't seen him for a decade. However, just before the story can air, her bosses want to meet Samar. So, he reluctantly leaves India and returns to London...and is once again hit by a car!!!! What are the odds?!\n\nNow, once again, Samar survives...but there's a BIG hitch. Now Samar has lost much of his memory and thinks it's STILL 2002. And, because of this, he keeps asking for Meera as, in his mind, he thinks they are still together!! And, the doctor tells Akira that perhaps the best way for Samar to regain his memory is if they can find Samar! So what's next in this rollercoaster romance? See the film and find out yourself.\n\nSometimes I get stuck on plot holes and hard to believe plot elements, but \"Jab Tak Hai Jaan\" is so well made I found it easy to look past this and just enjoy the romance. It sure helped that the film was so well directed and SRK was, once again, doing a fine job in the lead. Well worth seeing despite a plot that defies belief."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "A Yash Chopra Romance....",
        "review_detailed_main": "The Late/Great Yash Chopra changed Romance in Indian Cinema. With his ever-lasting, heartfelt or even sometimes tragic love-stories, Chopra proved his mettle time & again. A Career Spanning Decades, Chopra made films even till his last breath & 'Jab Tak Hai Jaan', his final film, has released.\n\n'Jab Tak Hai Jaan' isn't Yash Chopra's finest film, but its a shining example of the late filmmaker's maddening love for cinema & love, itself. 'Jab Tak Hai Jaan' isn't half as good as it ought to have been, but the storytelling is passionate & I appreciate that.\n\n'Jab Tak Hai Jaan' tells the story of of 3 individuals, who are connected to each other by only 1 common feeling: LOVE.\n\nThe Screenplay Written by Aditya Chopra & Devika Bhagat, is flawed & appeals in parts. The Twists & Turns in the narrative aren't particularly effective, but some sequences genuinely are magical. Yash Chopra's Direction is Magnificent, as always. Anil Mehta's Cinematography is Stunning. Editing is sharp. Music by A.R Rahman is outstanding.\n\nPerformance-Wise: Shahrukh delivers sincerely. His performance as the struggling musician is endearing & his turn as an army officer, is fair. Katrina Kaif is her usual self. Anushka Sharma is terrific, she brings so much energy to the goings-on. In cameos, Rishi & Neetu Kapoor are noticeable.\n\nOn the whole, 'Jab Tak Hai Jaan' is a love-letter by one of Indian Cinema's Greatest Storytellers."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "chaitanyaskc",
        "review_rating": "1",
        "review_title": "Waste of time!!",
        "review_detailed_main": "Watching this movie is just waste of time. If the Chopra's have so plentiful instead of producing such devastating movies they better spend for social cause. I'm sure anyone would end up in depression after watching the 3 hours horrifying movie. The movie is not worth watching even for 5 mins, never expected this from the Chopra's & the musical magician Rahman!! Its better to watch a bhojpuri movie instead of this. The acting performance from Katrina has been disappointing as always. The only character whose role was apt and justified was by Sharib Hashmi (SRK's friend). I just can't understand where does Anushka end up out of nowhere, diving in the middle of this river. At the outset guys, I would only say its just waste of time watching this dreadful movie..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sahilkishore04",
        "review_rating": "9",
        "review_title": "Very good to watch, nice to heart !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "amit-kumar72043",
        "review_rating": "9",
        "review_title": "What a display of 'love', splendid !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "nilz1791999",
        "review_rating": "6",
        "review_title": "Clichéd",
        "review_detailed_main": "I'll be honest this isn't one of the best movies of Yash Chopra's or even Shahrukh Khan. I am huge fan of SRK, i love his movies from Dil Se to Swades to My Name is Khan but this movie doesn't deliver with an interesting plot or even a great climax. This movie is just includes romantic anecdotes from books or movies that have been combined to form JAB TAK HAI JAAN. As Doctor Khan said \"this is 2012 not 2002 (the year of Devdas). We need new love stories with a great story, that is intriguing and most importantly NEW LOVE. Also the movie didn't deliver on creativity because you could watch this movie with your eyes closed and still know what happened and who Sammar Annand ends up with. Finally, AR Rahman didn't deliver awesome music yes ISHQ SHAVA AND SAANS are great songs but anyone can create such mediocre music, AR Rahman means new and vibrant music but he hasn't composed such music for JAB TAK HAI JAAN. I guess i will be listening to Rahman's ROCKSTAR album until the end of the year or until AR Rahman gets his groove back."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ChrisTreborn",
        "review_rating": "2",
        "review_title": "Again another dumb musical for Asians",
        "review_detailed_main": "I don't know why Bollywood films are still producing soap opera based musicals in large scales. May be most of the population are poor, illiterate, religious and dumb or they don't have any access to international movies. Any way i happened to watch an advance screening of most hyped Bollywood movie 'JTHJ'. I must say one of the lame movies I watched in recent years. Not because it's 'boy meets girl' or 'pretty people fall in love' storyline, it was one of the craziest love triangle ever filmed in a Bollywood film. Story is simple, leading man stuck with his past, find it difficult to live in the present, reason his past, present relations, I can't reveal much more about the plot line in this spoiler free review. I must say this movie is for the ladies, or estrogen driven males, to enjoy this sort of enlarged melodramas. I have no problem with musicals, or recent twilight movies, but I don't think they deserve a good spot in realistic serious movies in worked cinema.\n\nAnyway anything good in the movie was the visuals, camera works and some background scores. Also the actress and supporting girls tried their best to look surreal beautiful in every frames. And the leading man who looked so aged for the part, was so overacting, but wait it's a musical, and from Bollywood, so it's OK i think, good for a single watch.\n\nI give this movie 2 out of 10.Sorry I am not a musical song dance number fan."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "harpalsingh227",
        "review_rating": "9",
        "review_title": "technical faults but good love story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Souvik_Das_2021",
        "review_rating": "7",
        "review_title": "Jab Tak Hai Jaan is the swan song of Yash Chopra.",
        "review_detailed_main": "Jab Tak Hai Jaan is the swan song of Yash Chopra, the big daddy of romance. Every frame is picture perfect, the emotions are well nuanced. But there is one inherent flaw--the story by Aditya Chopra is hackneyed. Shah Rukh Khan is Samar Anand a bomb disposal expert from the Indian army posted in Ladakh. He's a brave heart(of the kind you've seen in Hollywood movies like Livewire, Hurt Locker) who has defused close to a hundred bombs without bothering to ever wear a safety suit. His colleagues laud him and refer to him as the man who cannot die. Samar goes about defusing bombs with such ease; even your fear of the bomb is temporarily suspended, at least through the duration of this film. On the personal front, Samar is a brooder and sleeps with his personal diary strapped close to his chest. Anushkha Sharma (Akira Rai), a documentary filmmaker, who is also in Ladakh, accidentally finds herself in possession of Samar's diary. Since no one has ever told her that it is bad manners to read another person's diary, she leafs through its contents. And discovers that the army man doesn't smile because of his poignant past. The story unfolds to tell you that in his growing up years Samar, who did odd jobs in London, to make ends meet was footloose till he fell head-over-heels-love-with a rich heiress Katrina Kaif (Meera Thappar). Meera is engaged to be married to a gora but she finds herself inexplicably drawn to the desi Samar; the man who teaches her how to shed her inhibitions and live life king-size. A road-accident in London changes the course of Meera-Samar's happy love story and Samar finds himself back in Ladakh diffusing bombs. In this strife ridden atmosphere, his path crosses that of Akira; a young girl, who falls for him. Before Samar and Akira's acquaintance turns into anything deeper, the film plot lands Samar back in London, where he meets with a road accident yet again. This time, the hospital authorities, diagnose him with retrograde amnesia... and say he has been in a time warp of sorts for close to a decade. The only one, who can bring him back from the brink, is his first love Meera. And a new chapter unfolds. Shah Rukh Khan is the backbone of JTHJ. He's charismatic as the lover and enigmatic as the army guy. Katrina Kaif is a smart dresser and looks stunning. She's also a delight to watch in the song Ishq Shava, she having become this dramatic Bollywood film dancer. But when it comes to handling the intense emotional scenes, Kat is still a Barbie doll, beautiful but plastic. Anushka Sharma is easy on the eye and an ideal fit in the motor-mouth parts. She has the perfect 10 figure but frankly she is saddled with an unsatisfying role. A R Rahman's music--be it the Challa track or the Heer song never grew on the charts; but in the film, the music charms you because the lead actors infuse life into the songs. Frankly if someone were to ask what's the bonus you take back from JTHJ. It's the end-credit visuals of Yash Chopra horsing around with his actors or immersed in deep discussion with his crew. These bring a lump to your throat because the film comes so close to his death."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sankolluri",
        "review_rating": "1",
        "review_title": "Lousy Film",
        "review_detailed_main": "This is probably the worst film to be ever taken. Sad that Yashji did this as his last film. SRK looks bad. The story is stupid. The message is disgusting. This is not the SRK who charmed audiences in DDLJ. Its really time for him to go. Anushka's character was really annoying. She needs to stop trying to be a bubbly teenager and do more in the line of Rab ne bana di jodi style where she really did a great job. Katrina cant act anyways. Overall Bollywood needs to rethink SRK roles like they do for Amitabh as he cant get away as a 25 yr old anymore - he looks more like 55. The songs were terrible too. Also how did Dicovery channel come into this picture."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gapingzulu",
        "review_rating": "8",
        "review_title": "As much as I am a big Shahrukh Khan fan I must say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "SumanShakya",
        "review_rating": "7",
        "review_title": "An exuberant, slightly tart romantic approach from Yash Chopra",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "tejanshrivastava91",
        "review_rating": "1",
        "review_title": "One of the most dumbest love story of modern times... *awful*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rahulchamp07",
        "review_rating": "10",
        "review_title": "best jthj",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "amishra-aman-mishra",
        "review_rating": "10",
        "review_title": "immortal forever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "harishmadireddi",
        "review_rating": "7",
        "review_title": "Sincere Emotions with Illogical Occupations.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "feverbaba123",
        "review_rating": "1",
        "review_title": "The Death of \"Raj\"",
        "review_detailed_main": "Through the film ,its said hero is the \"man who never dies\". But I think the \"Raj\" of romance is dead in this film.He is killed by the same people who once created it.The Raj who was known to be the Ram of romance.But the Raj here is not someone who used to \"respect\" women or was a family man. He is a sugar daddy and is 20 years too old to do what he been doing in the film. After 20 years in cinema,he may be hated for his romantic roles but at least they had dignity.This is cheap.There are scenes ( the whole sans song especially)where it looked like just another cheap film.\n\nIf at all there is a \"story\" ,then its laughably bad.he seems to have some curse that he will meet with an accident whenever he is horny Lola! His memory is like a recycle bin. you can retrieve any data as and when you want it. I don't want to give more spoilers,watch the film if you can for more funny scenes . All roles are poorly written and all 3 of the actors are in awful form. Katrina is terribly exposed in this film.SK has sleepwalked through the film. Anushka was below average but her role is just of a sidekick.The army angle is ridiculous and a pure gimmick to give it some mas ala. SK said in some interview that this will popularize army? Hahahahahahahahahah\n\nThere is only one scene in the climax, a small SK monologue where i saw glimpses of him that we knew.\n\nThe film is never ending. The first half is so long that at least thrice I had decided to walk out in the film. My friend wanted to me walk out just after interval ROFL.I told him wait till the climax. I want to know if SK dies or not.\n\nand finally ,let me categorically state this – This is their WORST film in career without any qualification.and this is not an exaggeration by any means. watch the film for yourself and read this again."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "herbqedi",
        "review_rating": "9",
        "review_title": "Magnificent and Epic Romance",
        "review_detailed_main": "Great acting, great story, and most of all, a great romance. Too bad the loser in the romance, Akira, was far more interesting and full-of- life than Meera, his object of desire - but it all is fated to fall into place just as it has.\n\nAnd shed no tears for Akira, it works out for her too. Bravura performance by the veteran Bollywood actor playing Samar - and all the supporting players add vibrancy and texture to their roles. I just love Akira's mates at the Discovery Channel and Major Anand's Bomb Squad cohorts. One of them, however, is listed twice in the IMDb Credits and I could not find the female actor who played Dr. Khan so well at all so any clues to her real identity would be appreciated.\n\nAll romantic epics have their slow spots and this was no exception, and i'm not a huge fan of the longer, more choreographed Bollywood dance scenes - but that's personal taste. For the most part, the music was very poetic, profound, and intrinsic to the story. Only one early dance number was a bit excessive but all the singing was great. I can't believe there will be many dry eyes watching this one. Also she a cheer for the late director and loved the loving tribute with the ending credits showing his interaction with the cast. What a great valedictory for Yosh Chopra!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "edwardinayat",
        "review_rating": "7",
        "review_title": "Typical Bollywood Movie... with a twist",
        "review_detailed_main": "OK... for the folks that are bashing this film... what did you expect? It is your typical Bollywood film that is filled with pretty people, lip-syncing to music and over-acting. Once you can understand that most Bollywood films are of this nature, you need to try and appreciate it for what it is.\n\nPro: Eye Candy - Katrina and Anushka... very nice. Anushka character too funny. Love the revealing outfits on Katrina ;-) Decent Plot - I personally liked the way the story wraps itself up. Video Quality - Bollywood films are getting much better technically. This movie showcases that.\n\nCons: Over-acting (deducted ONE and HALF STAR) Minimum use of Anupam Kher. The man has talent. Put it to use. An hour and half too long. Not sure why Bollywood insists on long features... but this didn't need to be that long. (deducted ONE and HALF STAR)\n\nAlso - Nice tribute to Yash Chopra... Man def put out some quality films. RIP."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Sherazade",
        "review_rating": "1",
        "review_title": "What the fish?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "itspriya-75",
        "review_rating": "10",
        "review_title": "best of best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "fahimay",
        "review_rating": "6",
        "review_title": "For love story lovers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sumk-21209",
        "review_rating": "1",
        "review_title": "Terrible fantasy and false idea of love",
        "review_detailed_main": "Terrible film... acting was descent but the story line was so bad, unrealistic and stupid that the whole film became a joke.\n\nAlso the portrayal of an indian immigrant doing labour work in london was romantascised and over bollywoodised. This isn't a true picture. Katrina was born to indian parents yet appeared white when she was a kid? I think even the director got confused. If this was his last film, thank god!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "hitesh_c",
        "review_rating": "10",
        "review_title": "very fitting and emotional",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "benny-bt91",
        "review_rating": "10",
        "review_title": "Hats-off to Yash Chopra and SRK",
        "review_detailed_main": "Definitely a fitting end to a magnificent stream of films by Yash Chopra. Thank you sir. Story-line is really touching. I'm still not over humming the tune of Jiya re and Challa. This one is going to stay. Shahrukh-10/10 as usual. Anushka brings liveliness to this film through her character. I'll give her 9/10. Coming to the cons, the weak link of this movie is Katrina Kaif. Well she has tried her level best. But overall this one is a must-watch movie with a heart-warming storyline. Yash ji has proved he is and would always remain the best when coming to teaching the world ,to love, through his colourful films.We would all miss you a lot. Rest In Peace. Bollywood lost its original king of romance who was the actual inventor of the Badshaah Of Romance. We miss you."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "joshi-shakti",
        "review_rating": "6",
        "review_title": "Average Story with Good Songs, and good acting by Shahrukh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Kazama-Kiryu",
        "review_rating": "1",
        "review_title": "Probably the worst movie Iever ever watched.",
        "review_detailed_main": "Nothing that happens in this movie makes sense. There is no logic behind anything that happens in this movie and it's not cheesy enough to be one of those it's so bad it's good movies."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "pramitdas2008",
        "review_rating": "9",
        "review_title": "An Excellent movie with lot of emotions...Must watch",
        "review_detailed_main": "Well, so much drama on facebook pages, so much illogical thoughts on emotions, so much protest against the king of all the kings, what he will do, what he will not, But, Do you people really know, \"What real love means and What emotion is all about, ???\" If you are a man without emotion just like the pen without cap, then Don't watch \"JAB TAK HAIN JAAN\", but if you realize, yes, I have something, you will enjoy it by three Fold, SRK and Anushka , You won my heart!!9 Star for me!!!! I've watched it today, before going to see, got too much complaints against him, this film sucks, not at all good, bla, bla ...blaa.....but so surprised to the see the outcome after watching it....just got stuck in my emotional wall and true definition of love...Like it!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Not a perfect swansong for Yash Chopra but okay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "nairtejas",
        "review_rating": "5",
        "review_title": "Vague, Unrealistic & Hackneyed! Avoid!",
        "review_detailed_main": "The below review is hackneyed just like the movie:\n\nSo, I know this is Yash ji's last movie, but I cannot empathize!\n\nThe story is so vague, unrealistic & hackneyed, you cannot imagine but criticize. SRK has acted well, but I think both the actresses should stop acting. Katrina Kaif is the new Arjun Rampal with wooden expressions!\n\nSome sequences are so disgrace to the whole of cinema that you just wish you close your eyes. I don't know how people liked it (or did they, actually?) But it was a first first show for me and I regret it. Indian army has been shown in low light. The only good thing about it is its music. Hail A R Rahman!\n\nIt is too complicated and that's why it has my five, instead of four. Aditya Chopra should stop writing. I may not be a critic but if you look at Yashji's classic like Daag, this is just not another feather in his hat.\n\nAnd for the people who are talking about love should go and watch Hollywood classics. This is not a love story. This is pain in the neck. This is not how we love where Anushka constantly shows that she is 50 years younger than SRK. Grow up Aditya! Grow up!\n\nThis is definitely not an atheist-type movie! Watch for SRK only!\n\nAnd, The Story Of A Man Who Cannot Die Is Deadish! Avoid! Nothing new!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "subhashyadav929",
        "review_rating": "9",
        "review_title": "Sweet unforgettable love story !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "bobbysing",
        "review_rating": "",
        "review_title": "The Maestro began his individual journey with Daag (1973) & thoughtfully ends it with a new age version of the same as his swan song.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "TuFNuT",
        "review_rating": "7",
        "review_title": "A beautiful swan song which is slightly out of tune",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "BaijuNair",
        "review_rating": "5",
        "review_title": "Jab Tak Hai Jaan...sadly is not up to the mark..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "namrasaheba",
        "review_rating": "10",
        "review_title": "Its just SPLENDID!! Amazing, Romantic, Heart Touching, Completely Entertaining movie of decade!!!",
        "review_detailed_main": "\"JAB TAK HAI JAAN\" is the best movie of SRK since Om Shanti Om!! It can be placed as his best performance and Jab Tak Hai Jaan easily makes its way in the league of movies like Devdas, Kal Ho Naa Ho, Chak De India..!!\n\nThis movie has SUPERHIT written all over it.. ♥\n\nReasons:-\n\n1) Power packed star cast 2) SRK, by his flamboyant acting, convinces why he is still \"King of Romance\" and \"King Khan\" 3) Damn damn good story line (not to mention completely different) 4) Ultra songs 5) Super sonic background score (Thanx to A R Rahman)\n\nWell this all reasons might seem too obvious coming from an ardent SRK fan but I bet this will completely and totally match with anyone who loves Romantic movies or rather, just say, Movies :)\n\nP.S :- Any fan of SRK will feel that he/she must watch this movie at least thrice to quench their thirst for watching SRK in Romantic movie after sooooooo long!!!\n\nMovie truly defines its tagline.. \"EPIC SAGA OF ROMANCE\"\n\nWill remain SRK fan no matter what, after watching this movie, till JAB TAK HAI JAAN ♥ ♥"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "pritam-rawat7",
        "review_rating": "8",
        "review_title": "Best Romantic Movie of the year and years to come",
        "review_detailed_main": "Last movie by Late Yash chopra ji who is known for one of the best romantic movies till date. It has everything one could wish in a great classic love story. Story by Aditya Chopra is superb,the best thing about the scipt is its unpredictability which is rare in a romantic movie. Screenplay is not so great but good. Beautiful locations were always an important ingredient in a Yash chopra movie and this movie is just like poetry on motion. A.R Rehman's music is just awesome and every song is perfectly pictured Length of the movie never seemed a deterrent for me, in fact i wish it could be more. Shahrukh's one of the finest performances is the best thing about the movie. Katrina is not a brilliant actor we know but its her best work till date , she worked hard in this movie. Anushka played the character of a 21 yr old girl and she played it beautifully. Finally all i can say is that its a treat for every SRK fan and if u'r not a King khan fan and still u'r looking for a Romantic movie u'll never regret your decision."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Farah-zak",
        "review_rating": "",
        "review_title": "Watch it for SRK-Kat chemistry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "siddhartha_00729",
        "review_rating": "6",
        "review_title": "Porridge and commercial. The movie won some laps but couldn't touch the line.",
        "review_detailed_main": "Jab Tak Hai Jaan..!!!(Eaten Porridge??)\n\nNow this is difficult...so not getting \"judgmental\"...The movie won some laps but couldn't touch the line.\n\nFirst on to performance: SRK: He was SRK. Nice bollywood acting. Touched hearts. Girls around me were going crazy. Amazing Army man show, haven't seen better rocking army portrayal. Success. The Kiss dimension worked but was not stressed upon. 4 Kiss scenes (First Time S R K) and lots of attitude style acting. Did great and was the freshness the bollywood musical had.\n\nKatrina: Bad on many grounds. Looked very pretty in the plethora of dresses she carried, but didn't make a statement. Sizzling Hot Dance moves, impressed a bit. NO Acting. The welcome with Diya scene in the end was bad but those in the church with/without SRK kinda kinda touched.\n\nAnushka: Thumbs up on the little she had. The portrayal was good. She lived up. Lively, and edgy characterization, was as if made for.\n\nThe thing, the actors weren't pushed out of their seats but rather cushioned. Everybody did what he could and has done.\n\nSetting, scenes and locations, amazingly done and adapted on to the screen.\n\nThe old man (shraddhanjali); he gave his shot. The whole creation was as if made for him. Worked. Thumbs up with a wink. We will surely miss you.\n\nScreenplay was exaggerative as it should have been, and it worked\n\nNOW THE BIGGEST BAD PART: Aaaah!!!..pain..and pain...Story....\n\n(3 hrs....and WTH !!! Rich girl..Poor boy..LOVE..then, TRAGEDY...FAR APART...New Girl..LOVE..But again..TRAGEDY...First Girl Back...Climax..Anti-Climax..then, Happily Ever After..!!)\n\nFairy tale plot. Broken and really not coherent. Scenes and locations drive the plot and not story. Things change suddenly. Waiter becomes army man. Every thing designed for the scenes. May be it's a way to approach but I couldn't digest it.\n\nMovie takes too long to mature and grasp and ends as a fairy tale. Cool.\n\nSoundtrack is nice i.e. as always Rahman rocks. Watch it for Shahrukh and Yash ji. May be a Katrina ka Jhalak (Katrina's show scenes) here and there.\n\n(The Best part, and the one that makes the money worth: The credit video, Yash ji ka role at the end)"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "waqas_a91",
        "review_rating": "5",
        "review_title": "Not an epic love story - a disappointment - Average.",
        "review_detailed_main": "Before watching this movie I heard so much about it. All these great reviews, and of course I'm a huge Shahrukh, Katrina and Anushka fan as well as Yash Chopra and his movies. I was majorly excited for it.\n\nAfter watching it, I have to say, i was left disappointed. Not to say the movie wasn't good, it was. But its definitely (in my opinion) Yash Chopra's weakest.\n\nThe problem for me was, firstly, Katrina. I usually love her, but feel let down by her. I wasn't moved or particularly amused by her scenes. Nor did i feel much chemistry between her and Shahrukh.\n\nIn fact, their whole love story/romance didn't touch me either. Preity and Shahrukh in Veer-Zara touched me.. that was epic. I didn't feel the same way with Shahrukh and Katrina. They were intimate in the movie, most the time they were together, even that didn't make me all fuzzy inside (and trust me, i get all soppy and emotional over the tiniest thing). I do have to say though, Katrina looked very beautiful in the movie!\n\nThe movie was too long, it dragged a bit. The whole thing was a bit incoherent.. their love story could have been captured and shown in a better way.. There was just something missing.\n\nAnushkha on the other hand, i felt was brilliant! Which is why i preferred the second half of the movie to the first. Yes, she might have been lively and over the top but i actually preferred watching her with Shahrukh than Katrina and watching her scenes overall.\n\nApart from SAANS and CHALLA, the music was a disappointment too, which didn't help.\n\nHad the movie been shorter, the script stronger/overall more coherent, had someone else played Katrina's part, with more of Anushka and better music, i would have definitely enjoyed it more.\n\nFor me, the best thing about the movie was Shahrukh and Anushka.\n\nIm a huge Yash Chopra, Shahrukh, Katrina and generally romantic movie fan, but sadly, i have to admit, JTHJ didn't turn out how i expected it to be. Maybe because i was expecting it to be an epic love story and so much more.\n\nIf you're expecting it to be another Veer-Zara, then you got it totally wrong. But watch it for Shahrukh and Anushka. Also, Yash Chopra as its his last movie."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kishore_govind",
        "review_rating": "8",
        "review_title": "Jab Tak Hai Jaan !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "tejashari1",
        "review_rating": "7",
        "review_title": "Jab tak Hai Jaan Review: 'Yash Chopra ends on a high, SRK at his best'",
        "review_detailed_main": "This one became more than just a film after the director, Yash Chopra passed away in October. It turned into more of a celebration and a tribute to the legendary filmmaker's last film, quite ironically titled \"Jab Tak Hai Jaan\". Furthermore, his combination with A.R Rahman and Gulzar for the first time also created both curiosity and anticipation. And also, not forgetting the pairing of SRK and Katrina for the first time on screen.\n\nWithout giving any story away, the film starts off at a slow pace. Not much occurs during the first hour but the great locations and chemistry of the lead actors keep your eyes glued to the screen. However, it may test the patience of some who are perhaps looking for the story to move forward quite quickly. But thankfully for everyone's sake, a crucial incident occurs after this time has elapsed, which takes the story to a whole new level. It takes off and stays steady, leaving the audience gripped right to the end. While it's not exactly a flawless script, it does have a few more twists and turns which makes it an emotional roller coaster ride. And because of these twists, the audience finds it difficult to predict the ending.\n\nAt the end of it, one can't help but admire an 80 year old's vision of romance in the modern era. He quite easily outclasses all directors younger than him as far as portraying modern relationships is concerned, whether it be in the form of dialogues, costumes, characters or direction. The man did it in the 1990s with Dil Toh Pagal Hai, which was also more youthful and modern than any other romantic film that released within the time.\n\nPerformances: Big B correctly described SRK's performance as his best since Swades. However, his performance in Veer Zaara and Chak De India was just as exceptional. While SRK can go over the top like he has in some films, here he is natural, intense and effortless just like he was in the films mentioned above. His energy in the \"Ishq Dance\" with Katrina is breathtaking and he doesn't look out of place even at this age. Katrina Kaif delivers her career best performance - a decent step up from New York and Ajab Prem Ki Gazab Kahani. Anushka Sharma is brilliant as the full of life, \"Akira\". The special appearance cast don't get to do much - Anupam Kher, Rishi Kapoor and Neetu Singh are all wasted.\n\nOverall, \"Jab Tak Hai Jaan\" is worth watching at least once. Watch it for the performances, music and the soulful love story. And of course, SRK! Rating: 3.5/5."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mayukh-string",
        "review_rating": "1",
        "review_title": "Waste of money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "roychan742",
        "review_rating": "9",
        "review_title": "Flawless romance !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "flyingsaucer",
        "review_rating": "6",
        "review_title": "Jab Tak Hain....Khan",
        "review_detailed_main": "I have been waiting for this movie a long time now. Shahrukh has been out of his mould for the last 7-8 years easily, doing films which are not his genre, films like Ra.One, Billu Barber, My Name is Khan etc. We all love watching Shahrukh do what he does best --Romance. And who else can bring out the best of Shahrukh than Yash Chopra? And this was specifically the reason why I was yearning to watch this movie. First and foremost, the music of the film was not really something exciting or mind-blowing for me. The music is definitely not on par with DDLJ or Dil to Pagal Hai. But the music is good, especially Challa song.\n\nToday, it is Sunday and I had the opportunity to watch this movie at a local theater. The first scene came on the screen and it was set against the Military Backdrop, displaying the gorgeous landscapes and scenic beauty of Kashmir. The first shot of the film makes it clear -- it is either going to be a dud or a master-piece. Five hours later when I am writing this review, I shake my head at how it was neither a master-piece nor a dud. Jab Tak Hai Jaan is a good movie, a good movie which never tries to become a great movie. Maybe Yashji never wanted to make a master-piece, maybe Yashji never wanted to make a great movie, all he wanted was a movie which runs smoothly and tells a story in a conventionally unconventional way.\n\nWhat is the good in the movie? 1. Well, the cinematography is wonderful. 2. Music is great. 3. The tightly bound script where each element is connected to the other. The scenes of the second half remind you of the similar scenes in the first half. 4. Shah Rukh Khan underplays throughout the film, and its refreshing to watch his portrayal of Samar.\n\nWhat is Bad? 1. Lack of inspirational moments in the film. (Romantically inspirational) 2. Entertainment factor declines in the second half 3. A prolonged Interval and Climax. 4. Bang! We all wanted the movie to end like DDLJ, with a bang, but it was missing.\n\nWatch JTHJ with an intent to watch a cool and stylish flick which will definitely be a great date movie with your girlfriend. Don't expect any heart-wrenching emotional story full of excitement like Dil to Pagal Hain or DDLJ."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "saad_khi",
        "review_rating": "1",
        "review_title": "What the F...(as said in JTHJ)...it's Himmatwalla 2!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sajid-tahera",
        "review_rating": "10",
        "review_title": "A complete movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "anurag-gahlawat-554-796656",
        "review_rating": "9",
        "review_title": "Good story execution but length irritates !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "leenarete",
        "review_rating": "",
        "review_title": "Till Your Last Breath, I Will Not Stop Loving You",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "satu002",
        "review_rating": "6",
        "review_title": "Only for those whose heart beats for idealistic love stories.....",
        "review_detailed_main": "As the last epitome of yash chopra's love-story legacy, this movie marks another one of the idealistic, dream-worldish love stories for which its director was famous for.... PROS- all the star casts show exemplary acting skills and the movie emotions quite clearly play out on their faces. As a love story, a wonderful effort which would have a long lasting remnant in every one of its viewers. beautifully shows the eternal love whose unfathomable depths and immovable strengths are what the story tries to show\n\nCONS-thought the movie is not totally predictable and has its own anticipatory turns, we still can forecast a few outcomes. It is almost a waste of time for those who are not love story fans. moreover, it is quite stretched after the interval and it lacks the uniqueness of a new story. apart from the love theme, it is very low on entertainment(maybe only 2 punches and 1 action sequence). story was not that well written and had observable gaps.\n\nverdict_ unless your heart beats for love stories or shahrukh, go watch skyfall..!!!!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "cssihyd",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shibasish-mishra",
        "review_rating": "10",
        "review_title": "sweet good love story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "m_sidat",
        "review_rating": "6",
        "review_title": "Jab Tak Hai Jaan - Film of two halves",
        "review_detailed_main": "I had high expectations for this film as it had SRK, Katrina and directed by the legendary Yash Chopra. I thought it would be good to see SRK back into a typical bollywood romance which he plays well after his performance in RA One (awful!) and Don 2.\n\nI really enjoyed the first half of the film, good chemistry between SRK and Katrina, believable story and characters. London really is an amazing city to see on the big screen as well. All in all I thought this was a return to form for SRK. Then the film took a turn after the intermission, I don't want to spoil it but the story got a little ridiculous especially some of the medical advice and premise. It felt like a lot of effort had gone into building a great story then they just crammed an end in to tie up all loose ends.\n\nThe movie was supported with a great soundtrack, every song is of good quality. The dance scene in London between SRK and Katrina is an amazing piece of cinematography. All in all a good film to watch however could have been a lot better and felt disappointed with the second half.\n\nNo doubt the film will get good reviews as it has all the big players and is the swansong of Yash Chopra's career."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "indradeep077",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "monukalra11",
        "review_rating": "9",
        "review_title": "sweet love story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "victorgagan",
        "review_rating": "7",
        "review_title": "likable...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "virtualanand",
        "review_rating": "5",
        "review_title": "Legends are fallible too",
        "review_detailed_main": "What do you expect from a Director who has given masterpieces in the world of Indian Movies of romantic genre? If it was attempt to create a Love triangle then they have created demigod out of SRK, if it was to create an Actress out of Katrina then they have succeeded in creating Barbie doll out of her, if it was to underrate the skills of Anushka so that Katrina looks better, then yes they have succeeded in it but she still shines. The movie offers glimpses of brilliant moments but then falls right into the nadir of dull moments too.\n\nFinally, YashChopra knew this was going to be his last movie, the passion was already faded, it was as similar to expect Sachin Tendulkar plays his masterstroke innings during his grey days, not going to happen, but its a tribute to end a career, and Yash Chopra did it graciously, so thank you for that.\n\nLets move on to newer breed of ideas, directors and fans please!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "zikriafaheemcoolfriend",
        "review_rating": "8",
        "review_title": "A Great and enjoyable movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shailzapatel",
        "review_rating": "9",
        "review_title": "Bold and interesting ! An Epic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shallowmeforever",
        "review_rating": "",
        "review_title": "Sweet, Simple and Realistic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "7",
        "review_title": "Bomb",
        "review_detailed_main": "There are some logical mistakes in the movie, yes.. But it doesn't spoil the beauty of the movie... There is Shahrukh Khan... Come on."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "abhijitdesh07",
        "review_rating": "3",
        "review_title": "Go with Pain Killer",
        "review_detailed_main": "To be honest i went for this movie thinking it will be better than Son of Sardar.It look far more better in promos then SOS and yes last movie directed by great\"YASH CHOPRA\" who has made some of the best romantic movie ever.The first half was OK,not big emotions or drama.Katrina Kaif as usual lacked acting skills but she was looking ufffff.....SRK delivered good acting but still something was missing.The story of the movie was pain,how can a girl be so stupid.She does barter system with god, ask somethings and in return give away something.Oh come on man, this stupidity will not work in today's era. The whole story is read by supporting actress Anushka and i don't understand how can she fell in love with the guy(SRK).\n\nIn first half,SRK is with Guitar and singing everywhere at Trafalgar Square,Tower Bridge,O2 Arena and some part time jobs in market -resturant.In second half he becomes an expert in bomb diffusion for Indian Arm, which added essence of Hurt Locker.But the pain starts when he goes back to London and mets with an accident. He losses his memory and goes back sysdate-10 years.Damn, he doesn't know anyone and then bullshit stuff starts. Katrina comes back in SRK's life spends night together but doesn't have sex despite she still being single. Then the break-up happens and he tell god, he will accept her when she will comeback in India. Damn man...... i really need Pain Killer that moment so much of frustration after watching that movie.\n\nMusic was average,AR Rahman disappointed bit.Movie had no humor nor it had any dazzling scene's. Yet despite i feel this movie will be nominated for Best movies,Best actor,Best director as it trend in Indian cinema to always nominate SRK,Yash Chopra,Karan Johar etc movies.\n\nDon't waste money in watching it........"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rutviiimishra",
        "review_rating": "9",
        "review_title": "Movie Review: JAB TAK HAI JAAN!!",
        "review_detailed_main": "LOVE; One can't define love in concrete form... What is love? It's a Feeling... I love/like someone but why?? That's why, has no answers. And if u get answers then it's not love but mere an attractions.\n\nLate Yash Chopra is back with his superior Romantic movie... In this fast world no one has time to wait for love... but love requires patience... Commitment... It's not instant mix\u0085 But unfortunately our Gen Y won't understand what love is all about... Hats off to Yashji who made such movies\u0085 SRK as Samar Anand is mature and doing perfectly. Katrina as an NRI Girl is charming. But its Anushka that is the real charm. She is jolly and funny. Go and watch friends... its worth to be watched... Yup but have patience as it stretches 3 hours...\n\nHappy Diwali & have a Prosperous New Year Ahead!! :)"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "qadirmagsi",
        "review_rating": "6",
        "review_title": "An honest review of Jab Tak Hay Jaan",
        "review_detailed_main": "I saw this movie today and to be honest, halfway through i was bored. There is nothing much wrong with the movie if you like the usual bollywood fare; but be ware that that is exactly what it is; usual bollywood fare.\n\nI feel many people are giving it a higher rating mainly because it is yash chopra's last movie, and because they feel that shahrukh khan can do no wrong. I beg to differ. Chopra Sahib and shahrukh have both made many better movies that this but sadly in his last years they seem to be stuck in a formulaic rut and want to play safe. So don't expect a dirty picture or even a talaash. Think of it as a few hours entertainment which you will forget by the next morning."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "maildemanas",
        "review_rating": "3",
        "review_title": "Overly dramatic and unrealistic plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "saintytiwari",
        "review_rating": "8",
        "review_title": "Good Movie......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "anuprettyanupretty",
        "review_rating": "7",
        "review_title": "Romantic saga",
        "review_detailed_main": "What did i just watch !? The romantic saga of lifetime starring SRK, Katrina kaif and Anushka Sharma. The lyrics of Gulzar sir, the music compostion by A.R. Rahman and the fine direction of late Yashraj Chopra ; when this trio working on a project you can not deny the possible outcome. This triangle lovestory is not an usual love story. This film will make you fall in love in *love*again. Every single dialogue will touch your heart. The best thing is there is no single intimacy scene in this movie beacuse who needs it when SRK can just do with his eyes. The whole story is based on 'BELIEF'. Belief in yourself, belief in your partner, and belief in your GOD. Your belief can either make you or break you. If you have not watched this film yet my only advice will be just download and watch."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "upasanabhuyan",
        "review_rating": "3",
        "review_title": "Ridiculous Story. Only dumb people would enjoy it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "adarshbhandaryp",
        "review_rating": "10",
        "review_title": "A Romantic saga.. A masterpiece",
        "review_detailed_main": "Shahrukh Khan gets into his romantic groove and proves that he is global phenomenon when it comes to acting skills. His role as a bomb defuser is more engrossing than the Hurt locker movie and his playful challa role is better than the Raj from DDLJ. The movie is a mesmerizing experience which reflects the meaning of true love. Katrina Kaif's best performance till date and SRK-KAT's chemistry is simply classic. So Shahrukh be ready for Best Actor award speeches again and Anushka is going to eat up all the supporting actor awards. Last but not the least Yash Chopra will be feeling really happy in Heaven because his movie is being loved by audiences all over and he will and should win the Best director award posthumously."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "md-sajalhasan-364-777098",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan",
        "review_detailed_main": "Akira (Anushka Sharma) is a spunky student out for a project in Ladakh when she chances upon the story of Indian army's bomb disposal officer Samar (Shah Rukh Khan) and decides to make a documentary on him: The Man Who Cannot Die.\n\nThe story goes into flashback mode as we learn about Samar's lost love. A hard working chap in London, Samar worked a couple of jobs to make ends meet but always looked at the brighter side of things. A chance meeting with the rich heiress Meera (Katrina Kaif) changes both their lives. While Meera wants Punjabi singing lessons from him, Samar barters it for English lessons from her. Soon, the two fall in love, though Meera is betrothed to someone else.\n\nOn the other side of the timeline, Samar is now a bitter, reticent army officer who doesn't even bother with a bomb suit while defusing explosives. Akira finds herself increasingly drawn to Samar and even he thaws a bit.\n\nBut why did Samar and Meera part ways? Will they meet again? And does Akira have a chance with Samar?"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "nnawar12",
        "review_rating": "7",
        "review_title": "An emotional blockbuster",
        "review_detailed_main": "first thing first,in todays world where sex comes before love, many will find jthj a lame story, but for the die hard lovers, its a treat to watch.\n\nShahrukh khan is obviously the JAAN of the movie.Anushka adds tom boyish charm, and plays perfectly the roller coaster of emotions of her character Akira, Katrina makes you believe how simply one can overlook her own happiness for the sake of her love.The romance between the two lead actor is believable, there is a couple of smooches also.\n\njthj is not about any messy break ups and patch ups, it is about loving your loved ones so deeply and forgetting thyself. Yash Chopra showed us what love actually means and what he believes. jthj surely makes you fall in love with love."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "drharishka",
        "review_rating": "5",
        "review_title": "Another stupid movie in line",
        "review_detailed_main": "Went with lot of expectations and not to get dozed of with that typical bollywood songs. The storyline which can be precisely written in one sentence. The star cast had lot of potential but probably producer and director wanted to gross money rather than give a good plot. Everyone agrees the MUSIC was good by ARR but too familiar becoz it is a copy. Only people who will enjoy the 3 hrs of stretch are people who are hardcore fans of SRK and those whose IQ is below theater temperature. Very much disappointed with movie (esp the storyline). I would highly recommend caution against spending money and wasting time on this mindless movie. The director changes plot with no brains. Just awful to sit for 3 hrs. SRK tries his best and anushka is reasonable and KK is baby doll with very little acting skills. Never looked at my watch so many times."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "faraz-alig",
        "review_rating": "10",
        "review_title": "A true love saga!!!",
        "review_detailed_main": "This is a great film directed by the greatest commercial director of Indian cinema. All the actors have performed really well. Songs are catchy and come to their own with great picturization by Anil Mehta. Some people think it's lengthy. But any shorter and it would have looked rushed-up. SRK is spontaneity personified and plays his parts to perfection - both as Samar Anand and Major Samar Anand. Anushka is like a breath of fresh air. Katrina looks truly ethereal. Dialogues by Aditya Chopra are fresh, witty and precise. Locales are breath-taking right from London to Switzerland to Bangkok and Ladakh & Kashmir.\n\nOver-all: An epic film that should not be missed."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ItalianToni",
        "review_rating": "7",
        "review_title": "\"I Can't Quite Put My Finger On It\"",
        "review_detailed_main": "Before I write one thing, please let me say that I love Shah Rukh Khan! I think he is a wonderful actor and just his facial expressions alone in a movie have sold me on that.\n\nSo, this is a good movie and SRK makes a great Samar Anand, both as a civilian and a Major, but there is something about this movie that won't let me give it a higher score. I can't quite put my finger on it. It may be the differences in ages between SRK (Samar) and Katrina Kaif (Meera) that I struggled with, both in real life, and in the attempt to make them look closer in age in the movie.\n\nShah Rukh Khan has always looked younger than his actual age to me, but the 19 year age difference between he and Katrina Kaif was difficult for me to put aside. Granted, if I was an actress in Indian movies doing my first kissing scene, Shah Rukh Khan would be my pick, but even so, I think someone maybe a little older than Katrina Kaif could have been a better fit for the movie. She didn't have to be his age, but possibly have a few more years on her. Samar always looked much older to me than Meera in the whole movie, especially when he was supposed to be 28. I didn't have a problem with Anushka Sharma's (Akira) age because she was meant to be younger than him, and there was no actual romantic relationship between them.\n\nI did like the story and the ending, and I was very glad that Major Anand didn't get blown up at any point in the movie. I kept waiting for that to happen and was going to be really ticked off if it had. :-)\n\nOver all, it was a good movie and I enjoyed it, but I do think another actress (and I don't mean Priyanka Chopra) could have made a better Meera and had better chemistry with Major Anand."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ha123",
        "review_rating": "1",
        "review_title": "Exceptional music, screenplay, direction but weak script. Big unfortunate!",
        "review_detailed_main": "Just watched the movie. It was hard to spend 3 hrs in hall but somehow I managed. I don't understand why most of bollywood writers don't really bother about quality of script even with such a big budget. I have always been a huge fan of yash chopra's direction and this movie certainly impressed me again in terms of direction. However there is a big disappointment with the weak script.. For only this reason this movie is not worth to watch.. It certainly deserves not more than 1 out of 10. AR Rehman did his best with songs and background. I think that's the thing hold me off for such a long time. Katrina looks nice, SRK as usual as always acting wise but does not fit to character (Lost the charm of 25 yr old guy..pretty obvious), Anushka's role was confusing.. Overall movie is not able to deliver emotions that its meant to be made for.. Please don't waste your time."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sharmah6",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sliddar121",
        "review_rating": "1",
        "review_title": "Cannot believe the same director made Trishul, Deewar, Silsila",
        "review_detailed_main": "It is hard to believe the same director made true classics such as Trishul, Deewar, Kaala Pathar and Silsila.\n\nWhat an awful and very boring movie.\n\nThis movie is just another typical modern day Yash Raj movie, over acting foreign locales, 2nd rate foreign actors, NRI's shown as people with loose character, no original story and brainless dialogues, screenplay, unbelievable display of wealth.\n\nIf I was Yash Chopra I would have made sure that my last movie is a classic and memorable movie on the lines of the 3 movies I have mentioned above, unfortunately he didn't. At least with the budget and technicians at his disposal he could have made a movie which was 100% Indian and original, but alas, no.\n\nThe people who will support this movie are the people who like other brainless so called \"blockbuster\" movies such as KKKH, KKKG, Ready, Bodyguard, Namastay London etc....you know what type of films I mean!! If these type of films continue to be successful we are heading towards the death of Indian cinema."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "chiranjib123",
        "review_rating": "9",
        "review_title": "Outstanding",
        "review_detailed_main": "Oh..... !What can I say about this film. Excellent and never seen before locations of London and Kashmir,Outstanding performance by SRK,excellent performances by by Katrina and Anushka,modern, hard hitting,romantic superb dialogue , great direction,very good background score,good songs and last but not the least cinematography make this film absolutely stunning.\n\nAnd for the down side, story and characterization of Meera(played by Katrina) are not so strong.But those things are not so big issues to prevent it as an all time classic and blockbuster.\n\nSo,go and watch to experience the poetry on screen.\n\nMy rating is 9 out of 10"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ashok2801",
        "review_rating": "9",
        "review_title": "Watch it for SRK's acting .. Katrina's beauty & dance ,,, Anushka's boldness & natural acting",
        "review_detailed_main": "First of all may GOD bless Yash Ji's soul!!! This epic director has presented a love story to be remembered for.\n\nSRK as usual did full justice to the character ,, he played both the role as it was a cup of tea for him.\n\nKatrina was looking dam sexy and hot in this one. One thing had me was Katrina's dance in this movie. I never ever imagined that Katrina could dance like this. I am sure you all would end up admiring her dancing skills.\n\nAnushka was more bold then she ever was. Her presence brought smile at the faces of audience. The way she delivered her dialogues was commendable. She is born to play roles like this ( not only like this).\n\nI would like to end up by concluding at this point that this movie worth a watch. Do not wait for anyone to tell you how is it. Just watch and tell others :)"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "arunranjith08",
        "review_rating": "5",
        "review_title": "Very Average Movie",
        "review_detailed_main": "Hello Guys , This is my first post/review on this beautiful site. I had some hopes about this movie , i just watched the movie tdy.I went to theatre bcoz ppl had given 8.5 rating on IMDb on the release day. Some of friends who had watched this gave some kinda OK movie review. This is no way a Yash Raj classic movie , i'm telling this bcoz just last week i watched 'Veer Zaara' for the 1st time & it was classic love story ,compared to that this is a very average movie.\n\nThe 1st half was boring & second half was OK , there's not much anything new. The story seemed like a mixture of 2-3 old romantic movies, the acting of all the stars were average , nothing exceptional. The emotional scenes didn't bring any feel to me being an audience.\n\nFinally the movie felt lengthy bcoz there was nothing that was entertaining(boring) , waste of money & time . Better watch the movie after downloading from torrent after 3 months when u'll get BRRIP . A very simple & average movie , no where near the classics."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "jchakraborty7",
        "review_rating": "10",
        "review_title": "Great film. A very well heart touching film. Must must must must must must must must must must must must must must must must Watch",
        "review_detailed_main": "Awesome film. An outstanding mind blowing film. Can't imagine that an old respected person like Yash Chopra has the creativity to create such type of romantic film. The film made me cry just for the contribution of Yash Chopra. Hats off!!!!. It was his last film but no other guy has the capacity to make such romantic films like Yash Chopra. The film is for those who believes in love. In the film, I didn't find any slap scene. The film is full of love, passion. Songs are really touching. His last film will never forget so easily. It is a must film, and everyone should watch this film. I have become a great fan of Yash Chopra after this film."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ashish_rg",
        "review_rating": "4",
        "review_title": "Stupid Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kjasleen471",
        "review_rating": "10",
        "review_title": "Shahrukh khan at its best",
        "review_detailed_main": "A movie which will make you realize what true love is all about..\n\nA movie which touches your heart with true cinematic brilliance ..\n\nA team of some the greatest performers ever.Yash Chopra,Shahrukh Khan,ARREHMAN, Gulazar,Aditya Chopra.\n\nThey have bring in together a masterpiece of romance..\n\nDirection-yash chopra with his endless romance ..\n\nShahrukh khan he is the god..\n\nMusic is fantastic..it becomes more beautiful with the movie..\n\nSRK and Kat look Superb together..\n\nanushka sharma she has performed exceptionally good..\n\nA must watch guys....its a movie for all..\n\nA perfect family entertainer..\n\nThums Up...Go for IT"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ketgup83",
        "review_rating": "5",
        "review_title": "Jab Tak Hain Jaan has all the glitters but no gold. Big Letdown !!!!",
        "review_detailed_main": "Jab Tak Hain Jaan was one of the most overrated movies of recent times which had all show and no substance at all.\n\nSamar Anand (Sharukh Khan) is a musician who wants to make it big in London and struggles to meet his ends by doing small jobs. One fine day , he meets Meera(Katrina Kaif) and is head-over-heels for her. Eventually, Samar gets close to her and they fall for each other. However , destination separates them he loses her completely. He challenges death and joins Bomb Squad in back in India. Fate again takes him back to London where he meets with an accident and suffers from amnesia. In order to regain his memory back, all the people he met during his London days must help him to recover,including Meera. Will Samar regain back his memory and find his true love back ?\n\nDirected by Yash Chopra (Deewar , Kala Pathar , Dil To Pagal Hain , Veer-Zara) , JTHJ was his last film after death. Sadly , the movie does not really take-off properly. Right from the first scene , you will wonder what is the story all about in this 3 hours long boring film with so many loop-holes. For instance , Katrina Kaif's younger version is shown as foreign kid with blond hair where as she is daughter of Indian parents? Sharukh Khan is diffusing bombs in every 5 mins without wearing any apparel as if he is diffusing some Diwali crackers and more over he is giving interview to Anushka while diffusing one of the bombs.. Anushka Sharma's introduction scene where she get into the middle of the river without getting wet and then Sharukh comes and saves her? Its high time that Indian directors don't take audiences for granted. Our Indian Hero can do anything in the film - He can play guitar , he can dance in the night club , he can join Bomb squad without basic training and even can woo any girl that comes his way. The film's pace becomes unbearable at certain point that you might want to leave the theater and take a break. I have never liked Yash Chopra's romantic saga. On contrary , I liked his action dramas more. Story is a complete let-down. Direction is weak and screenplay contains loop holes almost every where. Cinematography by Anil Mehta is spellbinding. Art Direction by Sharmistha Roy is superb. Music by A.R.Rahman is a BIG disappointment. I have been an ardent fan of Rahman's music but he has certainly been influenced by high-profile person and given his kind of music. Not a single song is memorable. Coming to performances, Sharukh Khan is good not great. He is repeating himself in the roles previously done in Veer- Zaara , K3G. I wish he does more of Swadesh , Dil-Se , Chak De India. Katrina Kaif is alright. Apart from looking good , she is just about OK. Anushka Sharma is playing the same kind of role she played in her previous films.\n\nJab Tak Hain Jaan has all the glitters but no gold. If you are die-hard fan of Sharukh Khan's romantic film , you might want to give it a chance but certainly not for everyone. Strictly Average 2.5/5"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sidharth-banerjee25",
        "review_rating": "10",
        "review_title": "Just Short Of A Master Piece Yash Ji RESPECT!! SRK ROCKS :D",
        "review_detailed_main": "A girl madly in love with a guy decides to leave him as she makes a promise to God to keep him hale and hearty. Yet another tries to win over the broken hearted soldier. This forms the backbone of Jab Tak Hai Jaan. And the feeling you had reading the first line would decide whether or not you would like the film or as Amandeep commented would want to advice Meera (the character Katrina plays) to go and watch OMG Oh My God! First.\n\nIt had a lot to look forward to JTHJ that is being Yash Ji's last film and genuinely the poignant yet romantic touch is so so there but I do feel Yash Ji's untimely demise does make it devoid of that mesmerizing finesse Veer Zaara had.\n\nShah Rukh as Samar the happy go lucky charmer during the first half of the film is the usual 28 year comic yet romantic 28 year old which he can play any day with ease(and a little hamming of course)and Superb as the tough mature major in the bomb defuse squad. He handles such roles with such precision that you just can't take your eyes off major Samar. Katrina Katrina Katrina is smoking hot and goes a step further in the sexy quotient from ek tha tiger.\n\nBut my heart hoots for Akira played by Anushka. In a role that is clearly overshadowed in terms of the quantity when compared to the other two leads Anushka still manages to be the one I loved the most in the film because of the sheer energy she puts in all the scenes she has with the right expressions every single time.\n\nLadakkh is exquisitely and beautifully shot making that part of the movie thoroughly enjoyable.\n\nThe pace slows down as the movie draws to an end and frankly a better ending was needed. For the movie lacked that sucker punch for which the audience waits for 3 hours. The music is good, just good.\n\nNonetheless its the ideal diwali watch if of course you want a brainless comedy instead.\n\nYash Ji salute :)\n\nJab Tak HaI Jaan 3/5\n\nAnd an added 0.5 if you like surprises though I Did not !!\n\nSRK we love you and we do not need a KISS to prove it ;):D"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "yunusitboss",
        "review_rating": "8",
        "review_title": "Jab Tak Hai Jaan (U/A) Hindi-----my Rating : 4/5 VERY GOOD",
        "review_detailed_main": "for more movie Review like this page:::::\n\nhttps://www.facebook.com/MovieReviewByYunusIrshad.\n\nJab Tak Hai Jaan (U/A) Hindi-----my Rating : 4/5 VERY GOOD\n\nIt is a romantic entertainer of full length....\n\nVERY GOOD:- *FIRST HALF of the movie *Performances - SRK-Katrina was awesome pair *Direction - Yash we miss u.... *Cinematography - Crystal clear journey from Kashmir to London.. *Music and Background Score - songs awesome by A.R rahman *Editing *Story and Dialogues - romantic feelings with emotions *Kissing Scenes between SRK and Katrina *Screenplay - second half end fastly but tricky.... *promotions,visuals and locations : which made me to watch it in theaters...\n\nAVERAGE:- *Length of the movie which runs 176 minutes.. feels little bit tired..\n\nFINAL VERDICT:- It is a great romantic flick which has more lovable emotions ... this will be loved by young generation romantic couples..clean one time watch for this Diwali\n\nShahrukh Khan (Samar) is an introverted army officer in the bomb disposal squad. He meets Anushka Sharma (akira), a tomboyish kind of girl who works for a wildlife channel. She starts liking Samar but Samar is lost in his past.After finding and losing his true love in London, Samar Anand defies death by becoming a bomb disposal expert for the Indian Army. Returning to London after 10 years, he suffers amnesia after an accident. Will he be reunited with his love?"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dennythegame7",
        "review_rating": "4",
        "review_title": "JAB TAK HAI JAAN.... A Big Disappointment",
        "review_detailed_main": "Movie is basically a copy of many movies and is mixed into one romantic disaster. It explains about 3 different stages of SRK's life. Firstly showing a life of a Major who detects bombs followed by a diary which explains SRK's romantic history in London and lastly about SRK's amnesia disease which was caused by two accidents in the movie. The movie keeps rotating in these 3 stages making it lengthy and boring. The beautiful sceneries, music, acting and looks of the 3 main actors and cinematography can be marked as the positives in this movie. Whereas, the poor script, storyline, direction and time span of 3hours are the negatives. The director tries to make this movie very touching and emotional but it actually ends up making the audience leave the premises as it lacks these two things completely.\n\nIn fact, the director fails to explain how SRK becomes a Major who defuses bombs from a struggling waiter, seafood seller and street singer. Besides this, SRK being affected by Amnesia gains his memory quickly and returns back to the army and continues his job of defusing bombs. Oh Common guys !!!! is it so easy for a soldier to leave the army and return to it??? None of this is explained in the movie.\n\nTo sum up, Jab Tak Hai Jaan is definitely the worst movie of the late Yash Chopra. I went for this movie hoping for a typical Chopra experience like Veer-Zara, Fanaa, DDLJ etc.. But it ended up in the list of my worst movies My Verdict : - 4/10 (1 each for music cinematography costume design & looks and lastly acting)"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "vinay-grone",
        "review_rating": "10",
        "review_title": "SRK's splending performance given a Boost to the story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rohanrajpoot1",
        "review_rating": "1",
        "review_title": "really?? its a movie??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "christenbale-537-497078",
        "review_rating": "10",
        "review_title": "Its just SPLENDID!! Amazing,Unforgettable,Romantic, Heart Touching, Completely Entertaining movie of decade!!!",
        "review_detailed_main": "jab tak hai jan is some kind of movie which can not die.\n\nHello.. I watched Jab Tak Hai Jaan. And I am not at all disappointed after watching this movie.\n\nIts a Brilliant Movie.\n\nActing was good of all the stars. But SRK was perfect like as usual.\n\nIt has an Unique Love story.\n\nAfter Watching this movie you will fall in love once Again.\n\nYashji thanks for this movie..\n\nThe chemistry between Shahrukh and Katrina was really good.\n\nTwists were good in d movie.\n\nMusic was excellent.. Direction was good.\n\nPerfect Movie to watch with family.\n\nhere Love is selfles.\n\nIts just awesome Masterpiece by the Maestros of Romance.\n\nThe king of romance is back.\n\nTechnically movie is stunning. Cinematography is awesome and so is choreography. Few may fill the movie is slow...but then understand love stories are not Action or thrillers where you want a fast paced narration.\n\nLove Stories do need their own time to move on.\n\nGuys Must watch..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "piyushnhimanshu",
        "review_rating": "1",
        "review_title": "Solid piece of CRAP!!",
        "review_detailed_main": "I can't recall as bad movie as this one from my memory. Truly awful 3 & half hour of torture. It was horrible. Really bad acting by SRK n Katrina. Anushka was somewhat bearable. SRK is looking too old for both actresses & doesn't even close to what he is capable of. I regret that I wasted my 200 bucks on this. No offense but this was the most awful movie by Late Yash Chopra. No story, Not well directed, bad acting, etc etc, altogether a Solid piece of CRAP. Don't even think to watch. There are lot better things to do. Can't give zero points :( I can't recall as bad movie as this one from my memory. Truly awful 3 & half hour of torture. It was horrible. Really bad acting by SRK n Katrina. Anushka was somewhat bearable."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ravindra-lb",
        "review_rating": "10",
        "review_title": "A well crafted movie and a subtly magnetic performance that is both charismatic and intense from Shahrukh Khan",
        "review_detailed_main": "SRK is back again in what he does the best.. But, this movie offers you a tale of love than just romance.. It's about that one man's character Samar Anand that all would like to live.\n\nSRK aka Samar Anand is from the Indian Army bomb disposal squad. He plays a pivoting role in the movie as a young happy go lucky man who falls in love with a NRI girl Katrina aka Meera in London. The story unfolds when Meera makes a promise to god in haste and SRK returns to India with anger and lives to die everyday. Yes indeed, It's a story of a man who cannot die. The introduction of SRK behind the picturesque Ladakh and Kashmir stands out to be the best of Yash Chopra's directing skills..\n\nSRK's acting is charismatic, intense and brilliant and so is Katrina's. Anushka brings a lot of life in the storyline. I've no words to describe Yash chopra's direction. The Cinematography is at it's best.\n\nIt's a poetry on the celluloid though it has few weak moments where the story moves on a slower side and just when you realize that, it picks up very well with good twists..\n\nTotally, JTHJ is a good watch and offers you a story never seen before...."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sunnikchakrabarty",
        "review_rating": "10",
        "review_title": "an inch from masterpiece.......!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "abbasisgreat2001",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kishangupta-539-800747",
        "review_rating": "9",
        "review_title": "Overall - Excellent Piece of Cinema !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Beastwithagrin",
        "review_rating": "1",
        "review_title": "How can anyone rate this unbearable torture 10/10 :/",
        "review_detailed_main": "When you are going to see a core romantic movie in India all you want is if Late. Yash sir have directed.\n\nWith all due respect to Yash Chopra this is the worst movie that he had ever directed. JTHJ sucks to the core right from the beginning when a 50 year old some guy (SRK) playing the character of a 25 year old unemployed dude in England till he became a officer in the Bomb Squad with all the hate he have for the God because for some weird reasons his girlfriend(Katrina Kaif) left him before his accident.\n\nAnushka did the same bubbly character of Punjabi Girl like in all her previous movies.Katrina, if she would have pronounce a single Hindi word correctly.This is total illogical movie for the fans of Shahrukh Khan, who have lost it all.\n\nI must say it is total waste of time(3 and half hours), money and your freaking mind."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "singjay9",
        "review_rating": "10",
        "review_title": "beautiful romantic movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "festrel",
        "review_rating": "1",
        "review_title": "Old Steak needs to be dumped - that steak is sharukh",
        "review_detailed_main": "3hrs spent in a cinema hall on an Diwali eve sheer disappointment. SRK needs some body else to tell him that he needs lessons in re inventing himself maybe he should watch kabhi haan kabhi naa again. About the story, it would be a hit if we were in 1995, but definitely not in 2012. Average music, poor storyline. yuk acting. stunning locations. It has been also alleged that movie production used malpractice to prohibit son of sardar to be screened in movie theaters. Now looking at the premiere' pictures I cannot see anyone who is sad enough to see yash ji go away. even sharukh looked more than happy that the old horse is out. anyways what a waste of everything.\n\nDon't watch it this week , when you are really bored and you feel like watching old movie thats when you should watch it , but that will probably be in a month from now.SRK i pity you you are in a state of denial."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ragmayur",
        "review_rating": "10",
        "review_title": "The last Masterpiece from the Master of Love Stories!",
        "review_detailed_main": "There is a tradition in Hindi cinema that whenever SRK comes with a movie for Diwali, it HAS to be a Box-Office Dhamaka. Baazigar, Dilwale Dulhaniya Le Jayenge, Dil to Pagal Hai, Veer Zara, Om Shanti Om, Don have proved it in the past. Yash Chopra - SRK combination began with Darr- the intensity and the obsession part in Love, then came Dil To Pagal Hai which showed the Destiny will always bring two people made for each other in Love. Then came Veer Zara, which told us that Love doesn't know boundaries, and all it knows is to sacrifice everything in the name of Love, including a man's identity.\n\nWhat if all these three aspects are shown in a single movie? No wonder, it will be a completely emotional and beautiful treat, riding deeply on the emotion that rules the world- L O V E. And who else other than the King of Romance- Late. Yash Chopra, can tell this beautiful love saga in the most effective and the touching possible way! JAB TAK HAI JAAN is that! Revealing the story would be a spoiler, but at the same time, there is nothing highly unpredictable too. The story relies totally on the performances of the lead cast, emotions and the dialogs which were simple but with a lot of impact. There are umpteen number of scenes which gives you goose-bumps. The grandeur and the cinematography(Anil Mehta) you expect in a SRK-Yash Chopra movie lives up to the mark . The movie seems dragged in a couple of scenes, but is efficiently compensated, by the extremely beautiful screenplay by Aditya Chopra.\n\nSummary: The last Masterpiece from the Master of Love Stories! Watch it right now, to just get immersed in the world of Love. Watch it for the greatest Lover in Hindi Cinema, SRK as Samar's intense performance, and Katrina as Meera's beliefs, and Anushka as Akira's energy!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sarojkumar-nayak00",
        "review_rating": "10",
        "review_title": "superb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ump616",
        "review_rating": "3",
        "review_title": "My faith in IMDb has been shaken",
        "review_detailed_main": "I usually watch movies based on their ratings in IMDb. For Bollywood movies, I enter the cinema hall only if the rating of that movie at the end of the first week of its release is more than 7.5 otherwise I just wait for the DVD release. For JTHJ, it was more than 8 and everyone was reviewing it as an epic love story. So, I went to watch it. First hour was good but thereafter the story didn't make any sense to me. I think the acting, direction, choreography and songs were good but the story/script was, I don't know what to say, I guess the word is \"emotional atyachar\" –(Emotional Torture), yes it was the same.\n\nI do like fantastical activities in movies, as sometimes they make sense in an unusual way. But when the story seems to be a serious love story, any alien activity is not acceptable. The same happens in the movie. No one behaves in the real life the way the three main casts have behaved in the movie. Their behavior just bounced off my common sense and I was left with despair. I was disappointed."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ajgautamthecricstar",
        "review_rating": "10",
        "review_title": "about a movie of love and awesome acting",
        "review_detailed_main": "movie is awesome guys. awesome acting, music and cinematography. climax was superb. the film was complete entertaining. must watch for all.every1 will fall in love. locations are awesome. most important was after interval part and it was phenomenal. few scenes were heart touching and loved the actresses. best part was the scene when actor's memory came back. loved that. the poem was awesome. the timing of scenes were awesome. the romance of actor and actress was so lovable. the acting of 2nd actress was dude type. loved each one.the screenplay was very good. editing was awesome.the acting of other actors were good. the most important point was plot. it was excellent. the background music was more than excellent."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "smita-25081996",
        "review_rating": "2",
        "review_title": "Unexpected",
        "review_detailed_main": "Never expected such a movie coming from Shahrukh Khan 'the king of romance'.Sorry to say but i didn't find any spark or magic in d romance between Shahrukh and Katrina!The locations taken were beautiful but the songs were simply horrible!I am amazed after realizing d extent to which this movie is overrated..the story line first of all does not relate to the present day relationships shared..today rarely anyone takes a break-up so seriously that they end up becoming a tough Army Officer!well as far as the acting portion is concerned I believe Anushka did justice to her role efficiently...Katrina Kaif I would really suggest you 2 sit back in your bungalow amidst your beautiful Barbie dresses and stare yourself in the mirror for the whole day because it is the only thing which can actually make you proud and satisfied!At last I would only like 2 say Yash ji we have started missing your good romantic flicks already!:("
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "bhudev_java",
        "review_rating": "9",
        "review_title": "Absolutely deserves an applaud ! Epic !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gcellphone",
        "review_rating": "5",
        "review_title": "Its an okay Movie, Not bad but Not the worth of hype created",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ankitmishra14",
        "review_rating": "9",
        "review_title": "one of the finest romantic movie ever..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "iamsrklover",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan amazing movie",
        "review_detailed_main": "this movie is amazing in every thing .including songs and actors performance .SRK performance is wonderful .SRK act many films as a Lover Boy but every time see him as a first time.SRK as arm man was fantastic .SRK looks so young and fresh.SRK was in his best.SRK and Katrina pair was great .they have high chemistry.u can watch this movie without boring.Yash Raj prove he is the best in making romantic movie.Katrina was beautiful and a great dancer.Anushka make movie has a life.Yash and SRK magic appear in the movie so u will fell with a love when you watch this movie.this movie the last film was directed by Yash .the triangle of love return the magic of Yash.this movie deserve 100 from 10"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rahulgandhi-iitk",
        "review_rating": "1",
        "review_title": "Average movie - extraordinary hype",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "roshan_sukla",
        "review_rating": "9",
        "review_title": "VERY GOOD!!not the best but better than the garbage remakes coming out in bollywood these days",
        "review_detailed_main": "let me start with this.Please don't try to compare it with Veer- Zara .That was a classic!!Now coming back to review this movie,I have got just two words..\"very good\". Some flaws in the script are pulling this movie from becoming a \"perfect\" one,but wonderful acting of Shah Rukh & Anushka will compensate for the flaws in script.length of the movie, if, could have been cut down to 2 hours 40/45 minutes, then it would have been more than awesome.AR Rahman's music is too good!!If you are into romantic-drama movies then you will enjoy this very much.But if you like brainless action comedies, watch the remakes.\n\nTo sum up- I found my money n time worth spending for JAB TAK HAI JAAN!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sidin",
        "review_rating": "2",
        "review_title": "Meandering tale of love...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "monica75",
        "review_rating": "10",
        "review_title": "A beautiful love story",
        "review_detailed_main": "Jab Tak Hai Jaan........ The title says it all!!!\n\nA beautiful modern love story, you won't be disappointed,a truly magical Yash Chopra film. It takes you on a journey full of love,excitement,fear, romance and emotions. Shahrukh is just outstanding throughout the film, Kats and Anushka are portrayed as Yash Chopras heroines always are elegant and beautiful. Both did a spectacular job. Katrina and Shahrukhs hot pairing is a defo winner with great chemistry!! Yash Chopras attention to detail is very impressive as usual,from the costumes to the background scenery. He never ceases to amaze you. You will be missed Yash ji,but your work and films will be with us for ever. You have left us with beautiful memories. This film is the icing on the cake. Saans,Jab Tak Hai Jaan and Heer are my favourite songs. Enjoy it peeps......there will not be any more love stories like this one for a while....."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "soumikmukherjee",
        "review_rating": "1",
        "review_title": "Don't watch unless you are a blind SRK fan",
        "review_detailed_main": "This movie is a mixture of previous\n\nYash raj films like Chak de India (style of SRK ) , Dil to Pagal Hein (storyline) and some inspiration from the hurt locker. The script is extremely poor. Acting by cases are below per and SRK doesn't look like a 27 year boy romancing. Anushka Sharma's over acted and so does SRK. Katrina kaif looked beautiful but lack acting skill. Songs were not up to the mark. The movie is way too stretched. Its complete waste of time . If you have seen the other yah chopra films you will recollect all of them as there was nothing new in this movie. there are several more things can be written about it, but since i don't want to write a spoiler, i am skipping them. i watched this film as i was a hardcore SRK fan and to pay tribute to the legendary yash ji. but i think lack of substance in script tied his hands."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Suyashi",
        "review_rating": "10",
        "review_title": "Clearly a Yash Chopra movie. Better than many other mindless movies that have been made in recent past",
        "review_detailed_main": "I was a little skeptical about the movie after reading comments on different reviews. I thought my husband would hate it and I told him what I read in comments on different sites before going. It turned out just opposite. We both loved it. Don't let the (apparent) haters push you into not watching this movie. I bet those people haven't even watched it.\n\nThis movie is just like any other Yash Chopra movie - lots of love & emotions, great locations, centered around love birds..His love stories have always been slightly unreal so is this one. Its a movie after all -don't expect it be flawless, don't look for loopholes, every movie has loopholes. IMHO its could be 10-15 min shorter but I liked it much better than DTPH and Veer Zaara.\n\nA 80 yr old man directing such a movie makes me love the movie even more. Congrats JTHJ team. Yashji wherever you are are you must know you did an amazing job."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "zakamed22",
        "review_rating": "10",
        "review_title": "Epic Masterpiece",
        "review_detailed_main": "\"Jab Tak Hai Jaan\", a movie that is not just a movie, but lot more than that. I wouldn't say anything about the story cause i don't wanna spoil all those twist from the film.\n\nI gotta say \"Jab Tak Hai Jaan\" is an Epic Masterpiece that i saw today after 2004's Veer-Zaara.\n\nAs simple as it is... Love stories will come and go, solid romantic masterpiece will come and go, But no one will able to make them like Yash Chopra!\n\nSir...I salute you. Genius Aditya Chopra nail the story. Last but not least, SRK, Anushka, Katrina, you guys ROCK!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ankimagine",
        "review_rating": "2",
        "review_title": "Most Boring. This movie is a Disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mrakeshsmiley",
        "review_rating": "10",
        "review_title": "Incredible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "1",
        "review_title": "Jab Tak Hai Jaan is a very boring movie.",
        "review_detailed_main": "Legendary filmmaker Yash Chopra signed off with a flourish with his romantic drama 'Jab Tak Hai Jaan' - his last film before his death this year. The film has his signature courtships and nuanced complexities set in India and London.But the film falls far short of expectations that come attached to swansongs. Chopra, who's the master of emotional dramas such as 'Kabhie Kabhie' and 'Silsila', simply fails to create a magnum opus with JTHJ. The scrutiny is greater because Shah Rukh Khan, the protagonist of the film, is back to the genre he ruled for over two decades before experimenting with science fiction and negative roles in classic remakes.So what went wrong in 'Jab Tak Hai Jaan'? And how could the film have been a better send-off for the iconic director.'Jab Tak Hai Jaan' falls far short of expectations that come attached to swansongs.Plot: For starters - the film is weighed down due to the lack of a cohesive plot. The film hinges on one women's promise to God to stay away from the man she loves for the rest of her life. It's not only far-fetched, it's downright silly. She makes that promise right after he is hit by a car. She makes her peace with Jesus Christ in the end, but not before she has wasted 10 years of her life. Shah Rukh on the other hand returns to India and enlists for the Indian Army - age be damned. The man who was shown waiting tables in London because he wasn't cut out for any specialized career, becomes the army's most coveted bomb disposal expert, to hell with logic. People expecting a tragic twist in the end were rewarded with a happy ending to the romance that waited its turn. But somehow the ending falls flat. A better screenplay would have elevated the film to another level.Cast: There is no doubting that Shah Rukh is Indian cinema's quintessential romantic hero. He's the boss in the matters of the heart. Or he was, until age begun to mark his face with its lines and creases. His 25-year-old portrayal of a busker in London just doesn't cut it. The heroines look much younger than him and his moments with Katrina came across as stiff and awkward. An older female lead cast would have worked wonders.Heroines: Heroines have always formed a crucial part of Yash Chopra's romances. From Rakhee to Rekha, Waheeda to Madhuri, the Chopra heroines are all about understated sensuality and elegance. Though immaculately turned out, Katrina is wooden throughout the film. She's glamorous and has perhaps scripted the best piece of percussive party dance number ever but fails to add depth to her character, making it very difficult for her audiences to feel any sympathy for her. Anushka Sharma as an over-eager intern for the Discovery Channel is much more believable. She tries to channel Kareena Kapoor in a 'Jab We Met'-type pitch to Shah Rukh, but for the most part she's annoyingly chatty and overdoes her brief.Music: This isn't your usual AR Rahman. The maestro's magic touch is lacking and none of the songs are memorable even after months of promotion. The selection of background voice artistes is poor, because Shah Rukh and Katrina's voice do not match with them and the resulting product jars on the ears. Different leads: Though it sounds improbable, but could Chopra have chosen different leads for his film? Though Shah Rukh makes the role his own, he does not fit into the lover-boy image at 47. Who could have worked for this role? Ranbir Kapoor would have been a good alternate choice along with Parineeti and Priyanka Chopra.Length: The length of Jab Tak Hai Jaan is a major issue. At 179 minutes it feels far too stretched. The editing could have been crisper.Attention to details: A struggling Pakistani, who could not hold down a job long enough to save some money to send back home, makes it big as the manager of a posh eatery in London in 10 years' time with the help of a fist full of bank notes. A rich NRI girl falls for the busker. A reporter shoves a camera in the face of a bomb disposal squad officer while he's defusing live ammunition. The same reporter, who is supposedly an expert swimmer, plunges into a freezing Ladakh lake for a dare and almost drowns. It's the lack of attention to details that takes away half the joy from watching JTHJ.Sex: Sex and intrigue have always been integral parts of Chopra's films. While a pair of dandelion would have sufficed in the 60s and a shot of two pairs of legs rubbing against each other in the 70s, it simply does not make the cut in 2012. Audiences are bred on much rougher stuff in films, videos and television series and the sexually loaded moments in the film fall flat."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rkapoor489",
        "review_rating": "9",
        "review_title": "Good One, after a long time !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "xxxanand",
        "review_rating": "4",
        "review_title": "You can easily ignore this .......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "azmatmuhammad998",
        "review_rating": "9",
        "review_title": "It feels good when a movie receives standing ovation !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "deepaksarswat26",
        "review_rating": "9",
        "review_title": "Beautiful soulful movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "santronix1",
        "review_rating": "3",
        "review_title": "Jab tak hain jaan,,,,,don't watch this movie!",
        "review_detailed_main": "This is really a waste of time. As usual Shahrukh has over acted and despite the good story, which could have been a good make if could have handled by South Indian cinema, could not make a difference. Lot of plot holes and factual loopholes. The movie is just a an exaggeration of hyper story! Damn! Don't waste time watching this one!\n\nA guy entering an Indian army after 25 years of age! What a stupidity, that too as a bomb disposal squad man.\n\nThere's nothing waste can be done than making this film.\n\nand that too with SRK.\n\nDon't waste the time....\n\nDon;t don't1"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "raahul_dutta",
        "review_rating": "10",
        "review_title": "must watch",
        "review_detailed_main": "Ladakh's beauty-SRK's entry(98th bomb defuse ,but never failed any time)- no overreacted SRK-mature Katrina(as a dancer cool but plastic in emotional )-tooooo good Anushka (Akira ,reporter of Discovery)-Good movie frame- Visualisation of every song – dialogue –climax-at the end nice tribute to Yash Chopra ,the cocktail going to be create the record in Bollywood history.. \"DONE DONE London\"\n\n2nd half more cooler than 1st half .. is too tangled to transport you, At almost 180 minutes, it also requires enormous patience.. the background music non forgettable .. Acting of Anushka seriously brilliant.. It's a movie that puts the mushy, filmy craziness back in love stories."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kachara73",
        "review_rating": "3",
        "review_title": "same old wine..not even a new bottle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mehul_k",
        "review_rating": "9",
        "review_title": "Awesome Masterpiece by the Maestros of Romance!",
        "review_detailed_main": "JAB TAK HAI JAAN - 9/10... One less because I felt the movie was too short to get over. 3 hours aren't enough for an awesome masterpiece. Not even once did I bother to check the time or waited for the movie to finish.\n\nShahrukh Khan as Samar Anand was PERFECT!! He delivers it the way that only HE can do it and no one else. A dialogue post-interval opposite Katrina in the church proves it that he is the King and he rules!! Awesome performance. Words too less for him.\n\nAnushka Sharma as Akira has done a fabulous job. Very impressed by the acting and performance. The character suits her perfectly. The only other actress that could have filled her shoes would have been Kajol. Two thumbs up to her!\n\nKatrina Kaif as Meera is a disappointment. I couldn't have hated Katrina more. She doesn't fit the character at all. She looks like a cracker that would blast but then goes FUSSS! It would be better if she concentrates more on her acting than her looks. Also, I disliked Meera's character. But, well, her character is what gives the story a push forward.\n\nA cameo by Rishi Kapoor and Neetu Singh is heart touching!\n\nThe tracks were okish when heard before watching the movie. After watching the movie, Challa is one of my best from the movie. Second best ties with Saans and Jiya Re. These 3 have been a trademark tracks for each of the 3 characters. The background score by A.R. Rahman is simply unforgettable. I can still hear myself humming them. Hats off to his music. Lyrics by Gulzaar were very good but the music has just been superb throughout the movie.\n\nLast but not the least. Respect to Yash Chopraji to present us with such a beautiful masterpiece. He did what he does best - to show what love really is even today."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "smoky_circles",
        "review_rating": "4",
        "review_title": "Where's the love?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Nihal-24",
        "review_rating": "10",
        "review_title": "The Legacy lives on! Yashji - The Creator of Romance!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "banerjee-shubham",
        "review_rating": "9",
        "review_title": "JAB TAK HAI JAAN - bears testimony as to why Yash Chopra is regarded the best storyteller in the genre of romantic drama & why Shah Rukh Khan is the King of Romance...",
        "review_detailed_main": "JAB TAK HAI JAAN - bears testimony as to why Yash Chopra is regarded the best storyteller in the genre of romantic drama. Why Shah Rukh Khan is the King of Romance.A saga of unconditional , undying love which warms your heart and makes to want to believe the existence of what is termed as \"true love\". The Chemistry between the lead pair is refreshing. SRK oozes charm n charisma that is unparalleled. Anushka breathes life. Cinematography top notch. Wish the chemistry of Rahman & Gulzar had been as good. A must watch for all movie lovers. A love story which is rare nowadays!! Hats off to Yash Chopra... Your movies would always stay with us. \"JAB TAK HAI JAAN\"."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "tejanonline",
        "review_rating": "1",
        "review_title": "One of the most dumbest love story of modern times... *awful*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sumanism16",
        "review_rating": "10",
        "review_title": "Excellent Movie. Worth watching several times",
        "review_detailed_main": "Just came after watching Jab Tak Hai Jaan. One word for the film-\"Epic\" film .\n\nMindblowing Acting and Expression By King khan (SRK , you again made me cry ). Awesome Direction and screenplay. Heart touching Background Score. Anushka was superb and Katrina as never seen before (though somewhere she's not up to d mark). Katrina and Srk creates Magical chemistry (Masala movies lover may not like this movies, but its an awesome movie) Hattsoff to Yash Sir Nd For SRK, Salute u king. P.S: True love touches you when you least expect it and lasts Jab Tak Hai Jaan ♥\n\nThis Film will be remembered Jab Tak Hai Jaan. Love u Srk."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dr_usmansaeed",
        "review_rating": "5",
        "review_title": "Disappointing",
        "review_detailed_main": "Even if you are a die hard Yash Raj fan you will be disappointed. Movie is far far away from reality. It has its moments of romance and comedy but the script is full of flaws. Story is ordinary and predictable. Katrina Kaif sizzles and Anushka impresses with her acting skills. Shahrukh Khan doesn't fit in to the character and dances badly. A R Rehman's music is delight to ears.Direction is just above average.\n\nIn short second half is full of flaws which are hard to digest.Events in second half are not only unrealistic but make you scratch your head. You would not expect that in a Yash Raj movie. I will not try to spoil the whatever fun is there for you. One can watch it once but twice will be torture."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "vakshaykar",
        "review_rating": "9",
        "review_title": "Worth A Watch!!!!",
        "review_detailed_main": "Jab Tak Hai Jaan!!!!! Its Not The Typical Triangular Love Story....... Its Unusual Love Story With Lots Twist And Turns One Of The Best Romantic Movie Rather A Love Story In Indian Cinema...... Hats Off To Mr.Yash Chopra..... Its Unfortunate He Isn't There To Relish The Success...... After This Response His Soul Will Surely Rest In Peace... Its A Shame On Me That I Haven't Seen Any Of His Previous Movie.... Now To The Movie....... This Has To Be SRK's Best Performance After Chak De.... SRK Was Commendable....... Anushka Sharma From Her FIRST SCENE To The End Was Nothing But Brilliant... Katrina Kaif - No Enuf Words To Describe Her... The Panache She Brought To The Screen Was Amazing......... Rishi Kapoor's Beautiful Cameo Screenplay Was Bang On........ Anil Mehta Great Job Behind The Cam Picturising The Beautiful Ladakh The Biggest Plus Dialogues And BGM....... AR Rahman's BGM Makes The Movie More Beautiful\n\nIn Simple Words As Quoted From The Movie - \"Its Not Story Of Courage , Its Not A Story Of Miracles, But Its Just A Simple Story Of Love\".........\n\nOverall - Worth A Watch One More Time...... Confirmed 100Cr Club......\n\nP.S - U Might Think Its Drag But Wait..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "self-username",
        "review_rating": "4",
        "review_title": "Outdated and boring.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "achurockingstar",
        "review_rating": "10",
        "review_title": "king of romance is back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "viryadu",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan Is Sexy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gajjar-rushi-a",
        "review_rating": "2",
        "review_title": "Total waste of time & money",
        "review_detailed_main": "First of all, by which angle or which means this movie is called a masterpiece by so-called critics? Only money talks, huh? I'm highly disappointed by last movie of Yash Chopra who gave masterpieces in past. Calling this movie a masterpiece would be a great offense to all his previous gems. Silsila, Lamhe, Chandni, DDLJ, Dil To Pagal Hai, and Veer-Zara could be called masterpieces (I didn't like Veer-Zara personally but now I can say that it was way better than this so-called romantic (with matured & old actors) saga (ha ha!).\n\nThere are many glitches & loopholes in this movie & even discussing them would be a waste of time same as the movie so I am avoiding it. My simple advise about this movie in 3 words is as under: avoid this movie, that's all!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gyananayak48",
        "review_rating": "10",
        "review_title": "excilent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "roy-puja03",
        "review_rating": "4",
        "review_title": "Weak script, redundant dialogues\u0085Yash Chopra's last was a very average YRF product. Jab Tak Hain Jaan - a Film review",
        "review_detailed_main": "The movie starts with a poem being delivered by the man himself- Yash chopra. A tone of reverence for the filmmaker, whose last film as a director was going to be screened a few moments from then, was set.\n\nYash Chopra has created many 'Romances' in his long career. Often good scripts and mostly great songs have been integral part of his films. With so much done and achieved, his last film was, alas, far away from being called his 'best work'.\n\nJab Tak Hain Jaan is just another potboiler featuring YRF's favorite hero since the 90's and their formula female actors (i.e. the actors who are 'stars of the moment'). With great promotions (steeped with sentimentality's evoked around Mr. Chopra's sudden demise), large posters all around the metropolitan cities, SRK flanked by the two most hot actresses of the time and of course umpteen number of public appearances made prior to the release, this film just did not make it to the audiences' expectation.\n\nWhat Mr. Chopra wanted to convey, perhaps never permeated through his film and instead too many questions arise. How does a person who does odd jobs (cleaning snow in front of a church in England, selling fish in a market, so on and so forth) after 10 years become the Major in the Indian army? How does a girl (Anushka) who loiters around all the time with all her antics and hysterics, end up with a documentary that goes on to become the main cover story in none other than Discovery Channel?\n\nAs if these anomalies were not enough, there is a long list of them. To start with, the film had a very weak script and an inept Shahrukh Khan as the 28 year old in the 1st half, fidgeting around without doing much (one of the most unconvincing performances ever by him). There was Katrina Kaif who just delivered her dialogues on time without taking much pain into emoting and an Anushka Sharma whose presence almost had a screeching effect due to the boisterous rendition of her character in almost all the scenes.\n\nHowever, the 38-year-old Shahrukh in the second half came as a relief, as here he played his part quite convincingly. YRF movies are known for their mesmerizing songs, here too there was a big disappointment. Barring one 'saans mein teri saans mili to', all others were slack and does not leave any mark.\n\nThe movie ends with shots and scenes featuring Mr. Chopra directing the cast in various locations. It was a real pleasure to see Mr. Chopra behind the scenes instructing his actors. The mental effort that went into figuring out who is doing what in the 3-hour long drama, mellowed down with the solemnity embedded in the last few minutes. The tone set in the beginning found its connection in the end.\n\nJab Tak Hain Jaan is a watchable film that will be remembered more for being the last directed movie by the great crafter of Bollywood, than for anything else.\n\nP.S- After watching the film, I realize the best part of it was used in the promotions thereby creating an illusion of poetic extravagance – its amazing poetry."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kunalkhandwala",
        "review_rating": "8",
        "review_title": "Bearing the magical stamp of a Yash Chopra romance...",
        "review_detailed_main": "A generation grew up watching Love defined by Yash Chopra's films. The stories evolved with time but the essential magic of Yash Chopra's direction and story telling was timeless. The now Late filmmaker's swan song is a tribute to romance and the genre that pretty much belonged to him only. Even though it may be flawed in its story and screenplay, 'Jab Tak Hai Jaan' is a fitting end to an era of old school romance with all its cheesiness, emotional quotient, drama, melodious music, spectacular scenery, stunning outfits and memorable dialogs.\n\nAfter diffusing his 98th bomb without a suit, Major Samar Anand (ShahRukh Khan) rides along on NH-1, narrating the title poem while we witness some of the most breath-taking visuals of the Ladakh region. Akira Rai (Anushka Sharma) is an intern with the Discovery Channel who, after being rescued from the freezing waters of Pangong Lake by Samar, shamelessly goes through his personal diary to take us into flashback. The younger Samar was a multi-tasking, striving immigrant in London who charmed its people with his melodious singing, customer service and dimpled smile. He met the newly engaged Meera (Katrina Kaif) and their friendship formed as a tutoring exchange. With Samar, she opened up to being herself in ways she never knew and before long, Samar fell in love with that self. Inspite of vows taken in church to not cross the line, they end up romancing to Saans all over London. An unfortunate accident made Meera choose between her love and faith, resulting in Samar's return to India and his subsequent enrollment into the Indian Army's bomb squad. Akira gets permission to shoot a documentary on the fearless bomb diffuser and while doing so, she falls for his love for Meera. Being a generation younger, Akira has a different recipe for love and the old fashioned ways of Samar charm her only to disappoint her when she confesses her feelings. Upon her return to London, BBC requires verification to air her story and that brings Samar to the city he vowed never to go back to. That's when the love triangle takes its real shape.\n\nWhat makes Yash Chopra's approach to romance special, is the subtle poignancy with which he depicts situations. A simple dialog can convey depth and relevance without the need for thundering background music and close up angles. It's not all about the romantic song sequences and mushy one-liners. Yash Chopra's direction brings exemplary performances from the actors and along with well written, meaningful dialogs, he brings the depth in simple confrontations that eventually make his films memorable.\n\nNeetu Singh's cameo is really special. Even without her physical presence, the emotion she conveys in the narration of the letter read by Meera is par excellence. Then, it is the charmer Rishi Kapoor's dialog that establishes the basis of the film. Anupam Kher is surprisingly underutilized in the film but one must be thankful as it prevents the mundane father-daughter-poor lover saga. Anushka Sharma starts off being over-the-top but soon turns likable with her natural depiction of the carefree Akira. Katrina Kaif is at her best in this film. Not only is it her best performance after 'Rajneeti' but she looks her stunning best in every scene even if she puts up a serious face most of the time and shows the lack of versatility in emoting. She does look Jaw-droppingly sexy in Ishq dance and Ishq Shava where her dance is commendable. There is a reason why he is the King of Romance. He can experiment with 'Swades' and 'Chak De India' but it is Yash Chopra that made ShahRukh Khan who he is and he revives him yet again, in a role that was tailor-made for him. The intensity with which he loves and the liveliness he infuses in Challa and Saans are attributes that make him a remarkable lover-boy. He plays the immigrant Samar and Major Samar Anand with distinct emotions that are in total control. While his confrontation with Meera is depicted with controlled frustration, his outburst against God in church is explosive. Only two men have stood convincingly against God in movies and both were directed by Yash Chopra.\n\nYet, this isn't a flawless movie. What prevents JTHJ from being a great film is Aditya Chopra's story and screenplay. An accident causing amnesia is an age-old twist in the story and this lack of imagination has not only lengthened the film unnecessarily by 30 mins but also made it less celebratory in the end. Anil Mehta's cinematography shows London in all its glory and Kashmir in all its beauty. Every scene with the landmarks or actors looks very well composed.\n\nA.R. Rahman's music falls short of the big expectations. His experiment with mostly new singers failed to create any magic. Saans is definitely the best track that requires repeated listening that you can't get enough of. Ishq Shava is a groovy track and certainly the best choreographed one in recent times. Heer is melodious but not much to playback on. The title song required a better singer and so did Jiya re which sounds like a teenage Ila Arun screaming.\n\nYash Chopra leaves us with a legacy that shall remain inimitable. To many, he taught what true love and romance is in a way that people still desire in their hearts. A director who made films only when his heart told him to and films with a heart they all turned out to be. 'Jab Tak hai Jaan' may not be his best romantic work ('Veer Zaara' is the title contender to that) and it is flawed in its story and screenplay but as a finale to a prolific and much decorated career, it still bears his stamp, his trademark style of story telling. Enjoy the fantasy while you can. There aren't too many who believe in it anymore."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "maxmize",
        "review_rating": "5",
        "review_title": "Not Yash Chopra's proudest work!",
        "review_detailed_main": "Now bottom line is this is poorly made movie. Yash Chopra was a far better director than this. I do not really know whats good about movie other than names associated with it. Other than locations of Ladakh etc we have same old London. Biggest complaint that I have about this movie is loads of Plot holes. Yes we know Bollywood and how it requires you to leave your brains behind but then I thought YC was better than directors making mindless comedies. Another complaint is how poor costumes of both girls are. Katrina is beautiful but she is wearing teenager clothes in most of the movie which make her look awkward. Anushka 's whole character is loud and overacted. She has to wear hot pants throughout no matter what weather or location. SRK looks so old. He needs to realize that he does not look anywhere near 25 year old that he pretends to play in the movies. I know SRK can act and has done so many times in Romantic movies but in this movie he was not at his best because the character and plot is so weak and clichéd. Yash Chopra should have chosen a better story or just not make another movie. This movie being his last does no justice to his legacy.\n\nThere are no stand out scenes , no stand out performances , no comedy , no romance in this one.Only saving grace were songs like Challa ,Ishq Shava and Saans which were really good but other songs are very average. Only people who can love this movie are people who can close down their common sense and objectivity. If you are craving a good movie of SRK why not watch one of his older ones and same goes for Yash Chopra."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "DareDevilKid",
        "review_rating": "8",
        "review_title": "A resoundingly fitting swansong to the legacy of Yash Chopra",
        "review_detailed_main": "Film: Jab Tak Hai Jaan (2012)\n\nRating: 4/5 stars\n\nReviewed By: DareDevilKid_DDK\n\nIf you are in love, ever been in love, or just believe in love, then please go & watch it. If you think that \"LOVE\" is just an unprioritized four-letter fluffy word, then you should most certainly go & watch it. It does have its minor flaws & is a tad lengthy, but at its core is a triumphant tale of romance which leaves an indelible mark in our hearts, & this coming from a guy who generally abhors love stories, but this saga ranks right up there with such classics as 'Titanic' & 'DDLJ'.\n\nThe performances are vibrantly immaculate. Anushka is splendid, Katrina is joltingly astounding, & Shahrukh is brilliant, dynamic & reliable as ever.\n\nAt the end of the day, this movie might or might not jump the bandwagon of the 100 crore club, but its profound aura of 'love conquering all odds' will remain etched in our hearts & minds for 100's of years to come. Sigh......they just don't make love stories like these any more, & Yashji, you Sir, will be sorely missed forever!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kusalovesbollywood",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan,The Best Movie Ever!",
        "review_detailed_main": "Jab Tak Hai Jaan, the last movie by the great legend Yash Chopra is an outstanding movie. It can be considered as one of the best ever. The performances by Shah Rukh Khan,Katrina Kaif & Anushka Sharma are wonderful and really heart touching.Hats off to the one and only A.R.Rahman for the wonderful music.This is truly an amazing film.It is a treat to watch throughout the 3 hours. I really loved watching it.\n\nIt is the story of Samar Anand(Shah Rukh Khan) who was in London in an simple but happy way.Meera(Katrina Kaif) comes into his life.While teaching her how to sing he falls in love with her.They like each other but Meera promises in front of god,that she will not be together with Samar because her father wants her to marry someone else.Samar faces an accident and Meera feels scared that his life will be lost as she promised god.She tells her that they cannot be together.Heartbroken Samar goes back to India where he battles with life and death everyday as a Bomb Disposer in Indian Army.Akira(Anushka Sharma) meets Samar and finds out about his story from his diary.Akira gradually falls in love with him.While Samar comes back to London to help Akira to complete her documentary he mets with another accident.He loses his memory.His memory is back to the time where he had a similar accident while he was with Meera.Akira meets Meera and tells her the situation.Meera acts as Samar's wife in order to make him happy and feel better. But one day Samar disposes a bomb on a train, while doing that his memory comes back.Heartbroken Samar goes back to India.But Meera comes to India to meet him.He is finally able to get together with her after 10 years. Akira presents her documentary calling it \"The Man Who Cannot Die.\"\n\nFor the performances Shah Rukh Khan is absolutely superb as Samar Anand. This is one of his career's most challenging roles which he does so perfectly.He does full justice to his role.He shows a wide versatile performance as his role as Major Samar Anand contrasts from his early life in London.He looks great with Katrina Kaif who also does her role extremely well.She gives a heart touching performance as Meera.As always she is able to charm the audience and she gives a great performance, looking wonderful throughout the movie.She looks sweet as the young Meera.The chemistry she shares with Shah Rukh is great to watch.The Jodi looks fantastic in all the songs specially the heart touching Heer,Sensual Saans and of course Ishq Shava is totally stunning. Anushka Sharma is bubbly,cool,gorgeous and she is simply wow.As innocent Akira she gives her best performance in her career till date.She looks great in Jiya Re.\n\nMr.Yash Chopra have given us a wonderful movie,his final salute to us. The great legendary filmmaker who gave so many lovely movies, the king of romance will be forever remembered. Bollywood fans around the world will always remember you sir, Jab Tak Hai Jaan..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "purbasha-mishra",
        "review_rating": "5",
        "review_title": "Brilliant idea... Terrible Execution!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shahrukhkhan65-538-442550",
        "review_rating": "10",
        "review_title": "Great Movie Classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "brittondv",
        "review_rating": "3",
        "review_title": "Please don't take such a senseless film Jab Tak Hai Jaan, Jab Tak Hai Jaan",
        "review_detailed_main": "I don't have anything good to write about this film except their effort behind this film. It shares a disappointing experience for the film lovers. Even the Classical love story genre has been out-fashioned in this digital world. And, they still project the unrealistic illogical senseless romantic story-line. Why can't these so called superstars realise the pulse of this present day world? Let them come down to earth from their heavenly Utopian world.\n\nThere's no age limits for this hero to get into the Indian Army, miraculously he even gets a lover that's 20 yrs. younger to him, and disappointingly this film bores the viewer for 3 hours with a host of unnecessary songs. I believe the audience will never forgive this Jab Tak Hai Jaan Jab Tak hai Jaan..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Vivekmaru45",
        "review_rating": "10",
        "review_title": "Yash Chopra Should Have Saved Veer Zaara As His Last Tribute To Hindi Cinema.",
        "review_detailed_main": "I feel happy that I saw this from the internet for free and did not waste any money on cinema viewing.\n\nKatrina Kaif is such a expressionless artist. There is no depth of feeling that we saw Preity Zinta give in Veer Zaara. Also Mr. S.K. Khan's face is showing signs of accelerated aging.\n\nThe plot of the film is handled very badly. The scene where S.R.K's character has the 1st accident seems like an episode of Jackass. The 2nd one is even funnier. Even with a motorcycle helmet on, this guy sustains head damage. Unbelievable!\n\nThese days they expect us to believe everything that happens in films happens \"exactly\" in real-life.\n\nAnushka Sharma is a better actress than Katrina, and I think she was good enough for the lead role. Katrina should have been give the side role.\n\nBrief plot of film: Samar Anand (Shahrukh Khan), a major in the Indian Army, defuses a bomb showing no fear or regard for personal safety. After a while, Akira Rai (Anushka Sharma), a Discovery Channel filmmaker, dives into a river in Ladakh and is rescued by the major. Samar gives her his jacket but leaves before retrieving it. Akira finds his diary in the jacket pocket and starts reading.\n\nThe diary recounts Samar's earlier years as a struggling immigrant in London. He worked as a musician and found other menial jobs to support him and his roommate. One day Samar is offered work as a part-time waiter where he meets Meera (Katrina Kaif) during her engagement party. In exchange for English lessons, Samar agrees to teach her how to sing. In the process, Samar and Meera fall in love. On the day Meera is supposed to tell her father about their relationship, Samar gets into a terrible accident. Meera prays to God to save his life and makes a vow to never meet him again. Soon Samar makes a speedy recovery and comes to know about the vow. In anger he tells her to go away and leaves London. Samar challenges God to keep him alive while he will risk his life everyday because he believes his death is the only way to make Meera lose her faith in the deity who stole his love. He goes to India and enlists in the Indian Army.\n\nVerdict: this film is not like Veer Zaara. Teenagers will find this film appealing as the film is directed towards them. Older viewers will find this film a real drag and will maybe leave the film halfway.\n\nList Of Good Films: Prem Pratigya, Ghar, Agar Tum Hote, Amar Prem, Ram Teri Ganga Maili, Saagar(Dimple Kapadia Rishi), Saajan, Gol Maal(Amol Palekar), Chhoti Si Baat, Aaina, Prem Rog, Parinda, Yeshwant, Aadmi Ek Khilona Hai, Ek Duuje Ke Liye(Kamal Hassan, Rati Agnihotri), Henna, Swaami(Manoj Bajpai, Juhi Chawla), Beta, Fanaa, Parineeta, Tere Naam, Devdas(Dilip Kumar Classic), Baghban, Benaam Badshah(Anil Kapoor Classic), Eeshwar(Anil Kapoor Classic), Woh Saat Din(Naseeruddin Shah), Pestonjee(Naseeruddin Shah), Masoom (a Shekhar Kapoor film), Ek Ghar (1991).\n\nLong Live Hindi Cinema!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "aretro999",
        "review_rating": "3",
        "review_title": "Utterly exhausting, a complete letdown",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kumarvijay62218",
        "review_rating": "9",
        "review_title": "Interesting story and good acting !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dee234",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan - \"The Movie that cannot DIE\"",
        "review_detailed_main": "don't judge the movie by its running time, OR try to make logic in every other scene ... sometimes, to display all correct EMOTIONS on screen, you have to defy few logic.On the contrary ITS a DRAMA/ROMANTIC MOVIE SPANNING OVER DECADES ..HOW MUCH TIME CAN A DIRECTOR HAVE ..???\n\nThe movie kick-start (Enfield) with beautiful Kashmir, opening scene, with fantastic poetic narration = Rahman's background Score + Gulzar thoughts + SRK voice \"teri aankhon ki namkeen mastiyaan .......\"\n\nDrama/Romantic Story follows good directions by late MR.YASH CHOPRA, stretched but enough twist to keep one glued till the credits roll.\n\nCLASSIC performance by SRK as Major Samar Anand i.e. \"THE MAN WHO CANNOT DIE\" , Katrina's portrayal of Meera is slightly low in comparison to Shahrukh's and Anushka's acting.\n\nCinematography is beautiful throughout the movie - London and Kashmir.\n\nNice soundtrack by A.R.Rahman and group, special mention - Challa, Saans and JTHJ Fantastic lyrics penned by Gulzar Sahab.\n\n************************************************\n\nMovie meant for any time, any season, for any lover ..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "jdinike",
        "review_rating": "2",
        "review_title": "Couldn't even sit through the entire film. Shallow stupidity all the way.",
        "review_detailed_main": "Wow what a low point this film was for a director who has given us classics like Kala Pathar, Kabhie Kabhie and Silasila. I think Yash Chopra just didn't put his heart and mind into this one... at all.\n\nLets start with the weakest of all things, the plot and the script. Without giving anything away, I haven't seen a weaker plot in a film by a serious film-maker in some time. The love stories had no depth to them whatsoever. There was no believable reason for any character in this film to truly fall in love with any other character, at all. Felt like a miserable, immature, failing teen rom-com throughout the first half, and that too with a misfit Sharukh Khan playing a 25 year old. Felt as if even he was just passing time with this one. Then there were twists in the plot that remind one of the worst part of the 1980's plots. Sharukh Khan's character was one self pitying guy looking for audience's sympathy. He should stop doing that. It looks pathetic. The characters were not well thought out at all. Katrina's was plain stupid, the other girl was way over the top and Shahrukh was massively unconvincing in whatever weak characterization he was given.\n\nDon't even get me started on the script and dialogs. When will these guys mature and produce intelligent stuff rather than soap-opera-ish junk?\n\nOverall a pain to sit through. The funny moments were not funny, cute moments were irritating, romantic moments were uninspiring, and tragic moments were ice-cold. What a waste of everything including money, time, efforts, film-making.\n\nPersonally I think when directors age, they lose track of what the youth is really going through, and produce films based on what they think the youth must want, based on a very surface level understanding. They should either do a thorough cultural research, or better just make less commercial, mature films which depict their real selves and frames of mind rather than their forced young selves. As far as SRK is concerned, he should get his act together, choose scripts more intelligently, act his age, and also stop obliging friends by starring in their crappy films.\n\nPlease don't bother watching this utter non sense."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Niaz_Morshed",
        "review_rating": "8",
        "review_title": "An epic Love-Story, from the one an only Yash Chopra!",
        "review_detailed_main": "Watched Jab Tak Hain Jaan! Initially planned to wait for it until the arrival of dvdrip, but couldn't resist myself from downloading the film this week! an emotional master-class from one and only yash chopra\u0085finally in a movie Katrina got the chance to act and I felt she was more than okay, Anushka simply rocked and next year she is gonna get all the awards for best supporting actress female, without any doubt! Nothing to say about SRK, he just did it once more what he does best.\n\nStory is a long one and at time some twists and turns will be felt like its way too much cinematic (1 in a 1000 times chance of happening in real life!) but again it's a film. it's a film where the hero is an expert who defuses bombs without wearing the bomb-suit, without any protection! But its not a story of courage, its not a story of miracles, its just a simple story of love\u0085:) Awesome background music, Challa-Saans-Jiya Re these 3 songs were beautifully placed and choreographed\u0085overall a nice film just a bit long\u00852hrs 55 minutes! but its one of those few bollywood movies that are both critically and financially successful."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sanjaybhosle11",
        "review_rating": "1",
        "review_title": "its very bad movie , making people fool",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "khankabir352",
        "review_rating": "9",
        "review_title": "Very divine and pleasant love story !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "vishalrajput07",
        "review_rating": "1",
        "review_title": "Bad Direction & Acting",
        "review_detailed_main": "Direction of movie was too bad.\n\nAgain bad acting by SRK.\n\nSome illogical concepts in the movie. Some of them are:\n\nWhen Anushka jump in the lake at Ladakh from the stone which was located at the center of lake. How she reached to the stone without touching the cold water of the lake.That scene also look too much animated.\n\nBad logic from Katrina to sacrifice her love in the movie.\n\nIts the movie for those who just want to see a love story without any logic and sense."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kharad_p",
        "review_rating": "9",
        "review_title": "No words ! Feel good movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rmishra-rakesh-mishra",
        "review_rating": "9",
        "review_title": "An Epic Unforgettable love story ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "nilanjankar",
        "review_rating": "1",
        "review_title": "Awful...thank god his last!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "narendrarastogi",
        "review_rating": "8",
        "review_title": "Best romance of the decade!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "himanshug1",
        "review_rating": "4",
        "review_title": "The poorest amongst all of Yash Chopra's Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ricky-twity",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan and Beyond",
        "review_detailed_main": "There are commercial movies, art movies, action movies, horror movies, thriller movies and yes now remakes and then there are Yash Chopra Movies. Movies that entertain you, make you dance, make you laugh, make you cry and above all make you love the life.\n\nJab Tak Hai Jaan has it all and beyond. What makes Jab Tak Hain Jaan special from Yash Ji's earlier movies is the narration, characterization. When he shoot portions in Kashmir and Ladakh he never did it for the sake of Natural beauty. Switzerland, lush green mountains a sort of character in all his movies is not there in this one. But nature plays a important role in narration. And that's what Yash Chopra is. The portions shoot in ladakh are not romantic considering its rough mountains, light comic scenes in kashmir valley and some thrills of bomb defuse in street of Kashmir. Kashmir is not there just for scenic beauty.\n\nThere are actors, there are heroes, there are superstars, there are stars and there is Shah Rukh Khan. He needs no special dialogs he makes ordinary ones very special. His eyes speaks thousand words..Jab Tak Hai Jaan makes you believe that here is someone who redefines acting. A classic performance from a legend.\n\nIt's hard to select who is better Katrina or Anushka though few may say Anushka but that's due to her character. What Darr did to Shahrukh's career and his way of acting Jab Tak Hai Jaan will do to Katrina and Anushka...watch their performances post Jab Tak Hai Jaan...now on they can make a ordinary role a talk about.\n\nThere were mix reactions about Music but once you saw the movie you will agree this is the best music. Like all Yash Chopra movies music of Jab Tak Hai Jaan is not for making popular music but it is important part of movie. For Example Challa song or Heer song...you may wonder why out and out Punjabi song? but when you watch the movie you come to know they are in Punjabi for a reason.\n\nTechnically movie is stunning...cinematography is awesome and so is choreography. Few may fill the movie is slow...but then understand love stories are not Action or thrillers where you want a fast paced narration. Love Stories do need their own time to move on.\n\nMy wife who don't really like watching movies..loved this one very much and for the first time asking me to go for it again....For me all reviews and collections are useless now.\n\nTo conclude....this is not the last movie of Yash Chopra for me....through the future performances of Shahrukh, Katrina and Anushka Yash Ji will talk to us....and with smile will say Main Yahan Hoon Yahan Hoon Yahan Hoon Yahan This movie is special in many ways...DON'T MISS IT"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "AishFan",
        "review_rating": "5",
        "review_title": "To its credit, a well-made movie, but difficult to relate to",
        "review_detailed_main": "I was slightly disappointed with this film, but I wouldn't write it off completely. Cinematography and music are excellent. Katrina is fabulous. Performances are good. The main weakness of the film is the story. The fault lies not in that it is told poorly or that it is devoid of any intelligence. It just is kind of old-fashioned, and I found it difficult to relate to. Chopra did make a good attempt of trying to address this point with Anushka's character, but she still seemed more of a stereotype of Gen Y rather than a sincere incorporation of its viewpoint. Thank goodness, the climax is well-done and refreshing."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "simrangupta506",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan Is Superb",
        "review_detailed_main": "Hi Watched Jab tak hai Jaan of Shahrukh Khan Its a Superb Movie and Must watch for All.\n\nA unique Love Story with perfect twist and turns yash chopra has given his best at the end of his career Shahrukh khan is just out of this world no words to express his cinematic brilliance,Perfect timing with great emotions.\n\nA R Rehman Has created magic again, best music of this year Gulzar has written beautiful lyrics..\n\nthe movie is a treat...\n\nGo and watch with the family ..a perfect family entertainer Katrina in his best ever performance..\n\nBut believe me anushka will be loved the most.."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "basujesu",
        "review_rating": "10",
        "review_title": "Great movie called it a \"Best of Both world\" concept using in Romance",
        "review_detailed_main": "Great Movie to watch treat to eyes in this diwali which maded awesome by late Mr.Yash Chopra jee, he again proves that from the time of our father and to the time of our grandchildren, he,always remains the king of romance and it is our fortunity and luck to born in his era era of film making Again Shah Rukh Khan Proves that Romance and Grey or Dark Roles is his territory and his collections in overseas is unteachable. A great story which reveals a life of a musician an lover boy too, awesome performance by SRK and specially done a great work with Katrina.....!!!!!!!! The Both roles of lover boy and army man is greatly done by SRK and the cinematography is mindbogglingly audience have to hold their hearts because the sequences done and performed by SRK or Anushka is great to watch katrina plays both romantic and serious roles excellently some places were you have to think what the characters have done next and why they done the things in it which can be expressed in word like expressive acting of both Kat & SRK which left the audience speechless then pls friends if you have any work left finished it & go to Multiplexes,Theater or cinema halls this movie is worth it for you and your loved ones a full family entertainer Film by Late Yash Jee & SRK"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "bajaj-sahil",
        "review_rating": "1",
        "review_title": "Another Typical Yash Chopra Movie!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "virajssk",
        "review_rating": "9",
        "review_title": "Classic love recipe cooked by extraordinary cook with addition of many new spices",
        "review_detailed_main": "Jab tak hai jaan :First of all pls listen all idiot,silly,hate-infested brains.. Movie is not a remake of DAAG.... not a bit... nor a south spice...\n\nNow keeping cap down as SRK's die hard fan... I am giving real feedback from heart...Surely I like the film as it is one of the great attempt to renew old love story concept with modern but logical finishing. Performances:No word require to adore SRK's performance... You will realize Katrina is going to be one of the challenging dancer in future projects.... I need few grams of Glucose to praise energy shown by cute , pretty Anushka... She plays role like Virat Kohli does to score few extraordinary shots ... she really stretches your lips.... Rishi Kapoor, Neetu singh, Anupam Kher are best as cameos ... Direction: It is clearly visible that Yash chora did want to make his last cut as precious as possible... he has used all of his master strokes... D.O.P. leaves your eyes so stunned... coolest , sexiest frames... no comparison only negative part is tooooo much length and some scenes which could be thrashed .... ( as I said Yashji may have wanted to show each of his masterstroke )\n\nStory: Not so different Love saga but many new tadaks and twists....\n\nOverall: Classic love recipe cooked by extraordinary cook with addition of many new spices... though it may prove Heavy dish for many people... Please don't miss it.. it may receive - ve signs from fastfood lovers... yet You should not miss this.. *** + half*"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shoumava-11803",
        "review_rating": "1",
        "review_title": "Touch and Go",
        "review_detailed_main": "Totally illogical storyline with some beautiful songs. A middle aged waiter in London who makes extra bucks by singing on the street suddenly gets the 'fitoor' of joining the prestigious and difficult to enter Indian army as an officer and has suddenly become a bomb squad expert who has diffused 97 bombs without any safety gear. SRK does pull out his usual charm and Katrina looks ravishing while Anushka is a touch and go. Songs, background musical score is the only thing that makes the movie worth watching once. The Yash Raj gang needs to understand that the modern Indian audience needs matured content and has got bored of same run of the mill movie storylines. Just watched it to remind myself of lost love, otherwise the movie doesn't make sense."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gyananayak388",
        "review_rating": "10",
        "review_title": "excilent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mumairehsan",
        "review_rating": "1",
        "review_title": "One of the worst movies i have seen in my film career",
        "review_detailed_main": "So boring.. actually a comedy for the time i spent watching this mockingly unrealistic film.. i mean can you imagine all time bombs of the world in one place and only one person is willing to dispose them without wearing the Bombsuit. hilarious ... very weak story throughout the film. characters are not even behaving like actors. The actor experiences same accident in 10 years twice and one time his head is injured on right side, other time on the left side.. the dialog are so hollow ..looks like they made it up for the street guys... In a nutshell .. recommended for a comedy but NOT recommended in millions lives if you have and you know what i mean :P"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shanmukhaswarup58",
        "review_rating": "10",
        "review_title": "it is a great movie...........",
        "review_detailed_main": "wow yash chopra is great director.one of my faviroute movie simply superb.The great movie from great legend.Shah Rukh Khan delivers a good performance as the brooding Major Anand. He looks good in army fatigues. He is famous for his lover boy roles and he pulls off yet another one quite convincingly. Anuskha Sharma is superb as the hyper energetic Akira Rai. She is a big asset to the movie and her scenes with SRK are actually quite endearing.Jab Tak Hai Jaan is a film that has all the ingredients you expect in a Yash Chopra film but somehow, it does not work out this time. The film is way too long, painfully slow at times and the magic is missing between SRK and Katrina. Anushka is excellent though. Watch the film if you can take the slow pace and if you want to catch Yash Chopra's last flick..Don't miss it............."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "pappujasani",
        "review_rating": "10",
        "review_title": "Worth Watching.",
        "review_detailed_main": "Ever since the late Yash Chopra, released \"Veer Zaara\" in 2004, I was waiting for him to Direct another movie but had to wait for eight years. Then in 2011, it was announced that he was Directing a movie with Shah Rukh Khan, Anoushka Sharma and Katrina Keif. There was no mention of the title and when this was announced, the release date was also mentioned. A fearless officer in the Bomb Squad, saves a young, female Journalist / Reporter who finds a diary of the officer who had saved her and decides to make a programme of his life before he joined the Armed Forces and in particular the romance side of it.\n\nStarring Shah Rukh Khan, Katrina Keif, Anoushka Sharma, Kris Somerville, Anupam Kher, Rishi Kapoor and Neetu Kapoor. Music By: A R Rahman. Lyrics: Gulzar.Produced By: Aditya Chopra. Directed By (late) Yash Chopra.\n\nShah Rukh Khan, is convincing as the fearless officer in the Bomb Squad as he portrays facial expressions that make the audience think whether he will be able to defuse a bomb or not. His role and character show what the men in the Bomb Squads go through. As always he is good.\n\nKatrina Keif. Well I was not really impressed with her acting until this movie - with the exception of \"New York,\" in which she appeared alongside with Neil Nitin Mukesh and John Abraham. As a daughter of a rich businessman, who is due to get married but then has second thoughts,she is very convincing and the role is most appropriate and suits her.Her dancing steps and moves are also very impressive.\n\nAnoushka Sharma,who last appeared in \"Ladies Vs Ricky Behl,\" as a young Journalist /Reporter, is also excellent. She is young and represents the current youth and it is through her that the audience sees the earlier life of the Officer who saves her life. From \"Rab Na Bana Di Jodi,\" \"Band Baja Baraat,\" and \"Ladies Vs Ricky Behl,\" her character in this movie, is completely opposite to the roles in the films that I have mentioned. Her character is the type that is young, fearless and energetic and will do anything to achieve her goal – in this case the story of the Army Officer.\n\nAnupam Kher, Rishi Kapoor and Neetu Kapoor, make a very brief appearance in the movie, but yet their characters punch an impact in the story and perhaps that is where the mastery of the story writers – Devika Bhagat and Aditya Chopra, really is at the best. For they have created characters, who, though have a small part in the story, but they make an impact.\n\nFor the first time, since \"Slumdog Millionaire\" was released, Music Director A R Rahman and the Lyricist, Gulzar, have come together and have, again composed some excellent and memorable songs and music – \"Ishq Shava\" and \"Saans\" being the two most memorable numbers along with the \"Chala\" song.\n\nDirected by the late Yash Chopra,this movie does bring some memories in some scenes, of the previous movies that he Directed – \"Kabhi Kabhie,\" \"Silsila\" and \"Veer Zaara.\" His \"signature\" of mountains and snow falling and romance, is written and can be seen very clearly on the screen and yet this can be considered as not a typical \"Yash Chopra\" movie. The scenes between Shah Rukh Khan and Katina Keif are the ones to watch out for.\n\nConclusions: Though the movie has some flaws, it is one that is worth watching, even though many may feel that it may not be so. This is a Yash Chopra movie and he will be remembered for it."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Shobhitsharma_2000",
        "review_rating": "5",
        "review_title": "Average Movie at Best",
        "review_detailed_main": "Below average music, average story and good performances by Shahrukh and Anushka makes the movie barely watchable. Katrina does not impress at all. Girls showed some skin throughout the movie but some of scenes seemed forced. Used good locales especially the country sides in UK. Have not seen him use these locales before. However the locales in India seem to be ones from Tashaan and 3 idiots.\n\nAt the end of day not what we expect from Yash Chopra. Seems like someone forgot to edit the movie altogether. Jab tak hain jaan , the poem is nicely done. however the songs and lyrics not up to par with Chopra movie productions. Watch it for being Yash Chopra's last movie but nothing special at all."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dbca2012",
        "review_rating": "9",
        "review_title": "Grand love story of new generation ! Epic !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "nikhilparatkar",
        "review_rating": "3",
        "review_title": "Classic example of a \"Bollywood\" movie",
        "review_detailed_main": "As the summary says, this movie is a classic example of a Bollywood movie, which does not make any sense at all. It's the result of casting big stars, shooting at exotic locations, pouring money on everything but a good enough writer. The writing is extremely week and the movie totally sidelines common sense. Various scenes vital to the story are shot thinking of the audience to be a 12 year old kid. Scenes were stolen from movies like 'The hurt locker' and enacted poorly. For example, the scene where SRK's character is defusing a bomb. It was a real challenge to sit through this awful experience of a love story."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dewanrameez",
        "review_rating": "9",
        "review_title": "undoubtedly Bollywoods modern Masterpiece",
        "review_detailed_main": "After watching this movie i was feeling like after a decade i have seen a good movie in Bollywood. without any comparison i will say this movie is an another great movie after 3idiots in Bollywood. ah! the music , the performances, the direction , the cinematography all are good.i will say watch it and experience a romantic extravaganza. sadly Mr. Yash chopra is not with us any more but he made a masterpiece before his last breath. there are more than 50 movies releasing per year in India but some of them leaves its mark. Jab Tak Hain Jaan is one of them. Actor Shahrukh Khan is still a Romance king. its proved again. there is only one point which i want to say that is the duration of the movie is bit lenghty. overall if you love romantic films you not gonna feel bore. thats for sure."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sulemanisbeast",
        "review_rating": "3",
        "review_title": "A waste of 3 hours",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "newsomo-soumyarocks-momo",
        "review_rating": "8",
        "review_title": "this epic movie is awesome for the emotion drama romance comedy lovely movie.",
        "review_detailed_main": "That man taught a country of a billion the art of loving. Those subtle, nuanced, romantic sweet nothings that were engendered from the brain of that man, have always had a way with people. no matter how much they would want themselves to be impervious to that emotion called love.Samar and his eternal love story keeps you entertained through out.Although it depends how you would the ending to be.I liked it.The story is very strong well-presented.100000 cheers.Acting was outstanding.costumes was good.Location was beautiful,.the crisis and situations are very well accepted.Yash Chopra's direction, and Shah Rukh Khan's acting - hats off to both!LOTS OF CLAPS FROM ME."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "itsprasad555",
        "review_rating": "10",
        "review_title": "an intense romantic movie (must watch) teaches us to love truly n without any expectations",
        "review_detailed_main": "this movie as i can say is one of the best romantic movies of all times.. it is a story which shows the intensity of romance n love... it is a story of faith in GOD,faith in love,sacrifice and how true love should be... the locations are heart warming.. the music is heart touching.. it shows the minute emotions in love.. SRK i think if SRK acts in a movie then his performance is not a thing that should be discussed he always performs the best n gives what the character needs.. one thing to state that he's looking extremely handsome n charming as a guy in late 20's... he is just awesome... Katrina is a let down when she acts in front of a actor like SRK her acting looks nothing in front of him... anushka deserves all the praise the way she has carried her character n looks so confident n sweet...\n\nall in all THIS MOVIE IS A CLASSIC INTENSE LOVE STORY WHICH WILL MAKE YOU FAL IN LOVE....\n\none can learn how true love is from this movie.. a must watch.......!!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shafiq-siddiqui81",
        "review_rating": "5",
        "review_title": "Jab Tak Hai Jaan - A Dull Fare",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shakkhan-534-154965",
        "review_rating": "10",
        "review_title": "Great emotional movie",
        "review_detailed_main": "Yash Chopras magic works once again. Such a lovely movie probably not one of his best but still a good movie and good to see such a film after a long time in Bollywood after all the masala films and so sad knowing such films won't be made again as Yash Ji ain't anymore. Shahrukh khan was superb proves it once again he is the king of acting and he's just made for such roles the best actor ever Bollywood has produced everyone in uk are loving this film and it's record breaking stuff in the cinemas here always sold out. Katrina was OK in it she still needs to work on her acting and anushka was good in her role. One of shahrukhs best performance for sure"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "hikerhetav",
        "review_rating": "1",
        "review_title": "Last But Great Attempt To Prove His Mastery!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "triguna-mutuguppe",
        "review_rating": "10",
        "review_title": "Must watch for everyone",
        "review_detailed_main": "Fantastic movie.... A must watch for everyone... I do not know why some people say its not good... This is the kind of movie which gives message to the people in this world. Also the end which shows Yashji's work for the movie is a tribute to the great soul who's thoughts of love is tremendous. Dialogues were tremendous... Overall a must watch movie for everyone. Do not miss this one... I can watch it again and again just to listen to some of the dialogues... :) Sharuk as the title says \"The Man Who Cannot Die\" is acted like he will never die. Katrina & Anushka acted very well. Esp. the kisses were very much needed in this movie and the expressions on the actors are very very good. Everyone in the movie acted very well. There were few comedy scenes which were good as well. Overall a must watch."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "dabanggk",
        "review_rating": "1",
        "review_title": "Most Boring Movie",
        "review_detailed_main": "Slept in theatre while watching this movie. Worst movie ever."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "osanda91",
        "review_rating": "8",
        "review_title": "Good romantic movie but not Yash Chopra's best",
        "review_detailed_main": "Having seen it just few hours ago...Jab Tak Hai Jaan feels how brilliantly Shah Rukh Khan returned to his best form with his role of Samar after his dare-devil acts in Ra-One and Don 2,Romance is best suited for him undoubtedly. This also marks Yash Chopra's final movie in direction and also before his death which has significantly increased the movies value massively, but notably it isn't Yash Chopra's best.\n\nKatrina Kaif I feel gave her best as a Yash Chopra heroine, and her acting was quite brilliant and so was the quirky, cool, naughty Anuska Sharma who played the Discovery Documentarian Akira.\n\nAll in all a movie worth the watch and for all romantics a must watch."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "junejah6",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": "Hello.. I watched Jab Tak Hai Jaan.. And I am not at all disappointed after watching this movie.. Brilliant Movie..\n\nActing was good of all the stars.. But SRK was perfect like as usual..\n\nUnique Love story.. Watch this movie you will fall in love once Again..\n\nYashji thanks for this movie..\n\nThe chemistry between SRK and Katrina was really good.\n\nTwists were good in d movie..\n\nMusic was excellent.. Direction was good.\n\nPerfect Movie to watch with family..\n\nGuys Must watch..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Not Recommended 👎",
        "review_detailed_main": "Even tho this movie is basd upone Inidian Army, still got nothing to do with it, this movie just used Indian Army theme as for to gain popularity, otherwise its the same old repeated love story lol"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "anilreddy635",
        "review_rating": "9",
        "review_title": "Couldn't be the perfect one, but still great !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "itsravie",
        "review_rating": "2",
        "review_title": "Not cool at all, very weak script",
        "review_detailed_main": "A Critical Review (Not Spoiler): Saw Jab Tak Hain Jaan..... Was thinking Indian Movies still revolve around some imaginative stories and singing around trees and in gardens harping on some medically insane conditions and most favourite is loss of memory ( Ek aur jhatka jarurui hai to bring back the memory of our Heros). One thing is clear Indian movies still defy logic and common sense. Anyways.... Katrina is beautiful but when will she start acting and stop being a beautiful plastic doll with pouting lips. Shahrukh is old now and has become rigid in movements (watch him in discotheque sequence). Anushka sharma looks weak and cachectic with pencil thin legs and loose denims. Watch her in Tujme rab dikhta with sumptuous figure and nice curves. Looks like Anushka is the next Kareena in the making. In all a very weak script, hero looking too weak."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "khalid-anwar39",
        "review_rating": "10",
        "review_title": "a refreshing tale of an unending romance.....",
        "review_detailed_main": "This movie is certainly one of the best movies of Yash Chopra and even Shah rukh Khan's career. Even though the movie is little long as compared to an average movie runtime today but it never gets boring. Yash Chopra once again proves his mettle in romantic movies genre. The movie too lives up to its hype. The acting of all the actors are good but the movie belongs to Shah rukh khan. He as always is brilliant & katrina and anushka shine in their respective roles. Cameo roles by Rishi kapoor & Neetu Kapoor are well placed. The cinematography and locations in the movie are excellent. Music by A R rahman is fabulous. All in all an outstanding movie which will always be remembered as an excellent piece of cinematic experience."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "versandeep",
        "review_rating": "4",
        "review_title": "Best emotional special effects",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "raginimehta475",
        "review_rating": "9",
        "review_title": "Terrific ! Epic !!",
        "review_detailed_main": "This is so brilliant movie and so respectful, lovable movie ! The love and passion. No one does it better than Yash Chopra. And no one portrays it better than Shah Rukh Khan.\n\nShah Rukh Khan, as Samar, was flawless. Every single time. You think he's done it all. You think there won't be any novelty in his approach. And yet he comes and blows you away. The intensity he brings in, and the powerful control of emotions he displays is just brilliant.\n\nKatrina Kaif did a really good job. She and Samar have a really great chemistry. In the scenes they are together, you totally see how much in love they are with each other.\n\nAnushka sharma is bubbly and ' happy-go-lucky girl' who lives life to the fullest breathing every moment of her life happily. Brilliant expressions ! Most impressive in JTHJ !\n\nA must watch movie backed by all the right reasons. JTHJ will be remembered as an EPIC !"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gurmeetkhurana605",
        "review_rating": "10",
        "review_title": "Deep love story and sacrifice !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "cikcikler505",
        "review_rating": "4",
        "review_title": "this movie had so many stupid parts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rahul160711",
        "review_rating": "9",
        "review_title": "Very good, deserves standing ovation !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "umair-sf",
        "review_rating": "2",
        "review_title": "Indian Cinema....seriously?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "prabhatsingh-1987",
        "review_rating": "10",
        "review_title": "Yes, He's the King; King Of Romance!!!",
        "review_detailed_main": "If it is a Love Story, it has to be Slow!!! Yes, his age sums up the ages of both the actresses in the movie, but then who told you to remember his age while watching it???(hope u knew this before going to hall)... Yes, he has got \"his own style\", which he is known for! Why the hell he should change for few \"pseudo pragmatic film analysts\", who only like Chulbul Pandey or Quixotic Hollywood??? If u can't digest an officer diffusing bomb w/o life saving jacket then you must have puked watching an engineer cum gynecologist pulling an unborn kid with a Vacuum Cleaner, right? and for people commenting about Dialogues... \"apka kuch nhi ho skta!!!\"\n\nJab Tak Hai Jaan, yet another legendary Love Story, showing deep sacrificial love!!! Yes, I liked it!!! (-:"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "devasisc-531-196294",
        "review_rating": "4",
        "review_title": "The 'Six mistakes' Jab Tak Hai Jaan should not have had",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kumarrajesh196320",
        "review_rating": "9",
        "review_title": "Excellenct script and acting !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "nik-sebastian",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan - A tale of unflinching love!",
        "review_detailed_main": "At the outset, Jab Tak Hai Jaan is a very good movie. Nothing extraordinary. Its an honest and intense romantic film. A love story, the types that aren't made these days where South Indian remakes and mindless comedies reign supreme. So, if you are not the mushy romantic type, you may not enjoy it. There are many moments in the movie which are goosebumps inducing and leave a lump in your throat, and maybe, a tear in your eye. And yeah, watch out for the twists!\n\nKatrina Kaif, in comparison to her earlier performances has improved a lot in this, but she has a long way to go. Looks very pretty though. Anushka Sharma is yet again, awesome and takes to her role like fish to water! But, this movie is a Shah Rukh Khan show completely. A beautiful performance by him. Jab Tak Hai Jaan is definitely in the league of his better movies. Looks like the genre of romance is tailor made for him. The intensity in his eyes is unbeatable.\n\nThe music is lovely. The songs may not have been chart busters till now, but the way they have been filmed changes that notion regarding A. R. Rahman's music. The locations, as expected in a Yash Chopra movie, are stunningly picturesque. Watch out for the choreography before the song 'Ishq Shava'. Splendid! Also, the end credits shouldn't be missed.\n\nHowever, on the flip side, people may find the movie too long at around 3 hours, something that the movie going crowd isn't used to these days, where any movie over 2 hours may end up being considered a 'drag'! I didn't think so being a fan of movies like Kal Ho Naa Ho, K3G, Veer Zaara, etc. which were also around the 3 hour duration mark! Also, a stronger script may have just converted this movie from a 'very good movie' to an 'epic' movie! But alas, it is not.\n\nHowever, those are minor issues in what is otherwise, a beautiful tale of love and longing. Here is a fitting farewell to a master of romantic movies, Yash Chopra, who once again, with his muse, Shah Rukh Khan, takes you into his world of unflinching love, hoping you get lost in it. Basically, if you're planning to watch it, and i think you should, don't go expecting some path breaking classic like a Veer Zaara or a Lamhe, and you will definitely leave the theater with a smile on your face, having fallen in love with the movie!\n\nI definitely did! :)"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "youmylove_2526",
        "review_rating": "2",
        "review_title": "waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "vimalshukla226",
        "review_rating": "9",
        "review_title": "Outstanding ! Yash Chopra did it !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "neha0030",
        "review_rating": "2",
        "review_title": "Very Poor",
        "review_detailed_main": "I really cant believe that a marvelous director like Yashji directed the movie!! The storyline was full of flaws with unrealistic twists, music was average, acting was stereotype and several other unacceptable aspects. Katrina was as usual beautiful but with under average acting, Shahrukh with conventional acting, while Anushka with a lively performance. I wonder why Shahrukh couldn't come out of his lover boy attitude and get into some serious acting! While watching the movie it always feels that the movie was scripted to just highlight Shahrukh in every possible way...whether its realistic or not. A restaurant worker gets a high ranked post in Indian Army as a bomb disposal officer. Is that really believable? if that would have been the case then Indian restaurant workers would have decorated the highly admirable army posts as well. I believe that our favorite actors should focus more on versatility that than their preferred comfort zone of acting. Because that is the only thing that would save bollywood from creating movies like JTHJ."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shreya-chattergee",
        "review_rating": "9",
        "review_title": "Many technical flaws, still okay !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "bk_connection",
        "review_rating": "1",
        "review_title": "Among the weakest Yash Chopra movies",
        "review_detailed_main": "My expectations were high before seeing this movie, SRK + Anushka + Yash Chopra, how can it go wrong....but it did.\n\nThere wasn't a single moment where Yash CHopra created magic like he did in his previous movies.\n\nMany scenes in the movie were forced and didn't create any meaning to the story. The opening scene with Anushka Sharma did not make any sense when she jumps in the water. The whole scene with Rishi Kapoor and Neetu Singh did not make any sense.\n\nCasting Anushka Sharma in this movie was a waste of her talent, cause she didn't get no scope.\n\nFirst time that Katrina Kaif did an OK job, and SRK did OK but since its a Yash Chopra movie an OK is not enough.\n\nThis is the worse Yash Chopra movie I have seen, and what a waste that this became ur last."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mohittomar19",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "The King of Romance behind the camera directing the Badshah of Romance in front of the camera. And a script that boasts of solid, undying love. No, there cannot be a better way to portray love on the silver screen. 'Jab Tak Hai Jaan' has nailed that – at least for the immediate future. Shah Rukh Khan, you don't really need words of praise or adulation; but go ahead and take a bow! With Samar Anand, the actor has brought another Raj Malhotra alive on screen. And a newer, better, improved version at that. One who doesn't know how not to love; one who instills in every heart the hope to be able to love – love unconditionally, love that doesn't know its limitations. Sounds like I'm just out of a Yash Chopra movie? Yes, this had to be the one.\n\nMajor Samar Anand, stationed with the Bomb Defusing Squad of the Indian Army is a man who flirts with death at every step of his life. He has successfully cut short the lives of ninety-seven bombs and is on his ninety-eighth one when the film begins. Wolf-whistle from all corners of the theatre greets the stubbled, sunglasses-clad man in uniform; oh yes, and a lot of claps too."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "manasgoswami60",
        "review_rating": "10",
        "review_title": "Great Movie by the Legend",
        "review_detailed_main": "I want to kick those guy's ass who spreads rumor about \"Jab Tak Hai Jaan\", that at last Shahrukh dies & lots of more. For those people many people haven't seen the film in Theater like me. It's an awesome movie.... Great Job by Yash Ji, Shahrukh Khan & all actors. great direction and brilliant acting is what that sum up to a good movie. From the very beginning to the end, it was awesome. And what a music by Rahman Sahab.... Brilliant.... Hats off to Late Yash Ji. He has done it ! Grand locale, awesome cinematic experience. Shah Rukh Khan once again shows why he's one of the leading men in Bollywood, with his fine all round performance in being a younger man who is full of zeal, hope and life, with the world ahead of him given his hard work, and yet balancing that out with a more sullen, serious look as the hardened military man with a death wish, nursing a broken heart and resigned to the impossibility of challenging god. Absolutely marvelous movie...."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "blackbeauty-nvyn",
        "review_rating": "4",
        "review_title": "A disappointment..",
        "review_detailed_main": "Usually, I love Yash Chopra movies and am very impressed by them so I was pretty excited to see this movie. Unfortunately, I wasn't very impressed. I was already having some suspicion when I found out Katrina Kaif was in here. At that moment I realized that this movie was going to have a bumpy ride. I saw it anyways because of SRK and Anushka Sharma. As I saw this movie, I had seen many...\"nonsensical\" scenes which messed up the plot. I also noticed that they were just trying to make it have the sense of a Western movie which always ruins a movie up. The dialogue sucks too... The cinematography, production, and songs are good but overall, It's really boring and I really wasn't interested in seeing the movie till the end. Katrina Kaif needs to stick to modeling and stay away from the movie industry. Her expressionless face and crappy acting skills ruined the movie. Anushka still somehow can act. SRK is aging and looked unfit for that role. I would suggest that they had John Abraham and Kareena Kapoor instead of SRK and Katrina Kaif. Watch this movie if you can't fall asleep."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "vikashsarangi143",
        "review_rating": "10",
        "review_title": "awesome movie..with great thought",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "MysticFalls007",
        "review_rating": "3",
        "review_title": "This movie is full of clichés",
        "review_detailed_main": "This movie is full of clichés,seriously i was expecting something good and original from this but it disappointed me and many fans out there big time.Big cast doesn't mean that movie needs no story.Now a days Bollywood become so much stereotype that you can predict every time what happens next in these kinds of movies.Same type of dialogues with same type of emotional scenes, what are you thinking when you making this movie that people are still living in era of dil wale dulhaniye lajaiyengay..Give us some break from these kinds of stereotypes and bring some thing original and worth watching..Can you do this Bollywood for fans?"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "devk20",
        "review_rating": "9",
        "review_title": "Very sacrificing love, great movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "JarvisIndian",
        "review_rating": "2",
        "review_title": "Plagiarism . Watch hurt locker",
        "review_detailed_main": "2009 movie Hurt locker is better than this stupid movie. Katrina till date doesn't know how to act . Anushka Sharma is always over acting. The reckless behaviour of diffuse sqaud can be witnessed in Hurt locker. They got inspired and copied it"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "vipukar",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Amid mad rush at a multiplex entrance, got the first glimpse of Jab tak hai jaan... A quintessential yash chopra love saga.... The first half drags just a little bit but overall an epic movie... No one in the world can portray romance on the screen better than SRK... His eyes talk so much... The man who cannot die forgets but does not forgive. A unique thing in this movie is that Katrina has acted.. The dance number before the Ishq shava song was something special. Many many twists in the movie. I thought the end of the movie gives a message against stupid superstitions. Don't dare to predict anything... You will always be on the wrong side.... Must watch !!!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sayantandey23",
        "review_rating": "8",
        "review_title": "Must-watch",
        "review_detailed_main": "Well, when it comes to romance... JTHJ is simply outstanding! Yash Chopra is a genius and he proved it again by his magical Direction which makes the film a master-piece but well could have been a Disaster because of a bad script. SRK showed yet again why he is the undisputed king of Romance by delivering a power-packed performance which is definitely, his best performance in recent times. Katrina looks stunning throughout the film and does \"OK\" in her glamorous NRI character which suits her well because of her accented Hindi. But she still is a bit plastic when it comes to emotions and needs improvement in this section. Anushka Sharma, on the other hand comes as the surprise package and brings life and a new age look to the movie.She did complete justice to the unorthodox but beautifully scripted role offered to her. Dialogues written by Aditya Chopra is amazing and compels you to relate each and every character of the movie. But, the best part is JTHJ's Cinematography.. the way it portrays Ladakh and London is just extraordinary.. Overall, JTHJ may not come in the all time bests of Yash Chopra but is definitely a delight to watch. So don't miss it..."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "swathibal",
        "review_rating": "2",
        "review_title": "This one is cringe!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "aaravpanti",
        "review_rating": "9",
        "review_title": "Hats off Yashji! The best possible end to such a brilliant innings.",
        "review_detailed_main": "The grand show is over and I was out of the theater where a media person asked me what I felt about the movie as it being Yash Chopra's last. I replied, I wish new directors get inspired by Yashji and continue making such romantic movies forever. Because my only thought after the credits rolled down was, is this the end of the romance era which I grew up watching? Chandani, Lamhe, Darr, Dil to Pagal hai,Veer Zaara and now Jab tak hai jaan.\n\nAt 47, Shahrukh Khan was dapper and energetic as the young Samar Anand and was elegant as the intense older version. The reason he is the king of romance is that he lets you empathize every emotion he feels as a character. Katrina kaif as meera was OK at her act though showing some beautiful dance steps to prove that she is not just a barbie doll. Anushka sharma as Akira was bang 10/10 in her beauty and role execution. So charming and subtle at the same time. Anil Mehta is a genius. His beautiful cinematography in Kashmir, Ladakh and London is one the reasons that will hold u for this 3 hrs of escapist cinema.\n\nThe plot with all its creative liberties was still very good, though a bit stretched. Dialogues and costumes were really nice. A. R. Rehman's music, Gulzar's lyrics and Aditya Chopra's poem make the soul of the movie. Checkout the meaning of the songs 'Heer' and 'Challa', you will know what I mean.\n\nWatch this movie ONLY if you like mushy romantic and eyes tearing emotional drama. As Yashji said, the best and the tastiest sweets are kept for the finale, my this review should also end in the same fashion. The best thing about Jab tak hai Jaan is Mr. Yash Chopra and this is one of his best directorial movies. I will miss him but will surely enjoy his cinema..jab tak hai jaan."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ssunny-social",
        "review_rating": "4",
        "review_title": "An enjoyable romantic entertainment",
        "review_detailed_main": "A movie after 8 years from the acclaimed personality, Yash Chopra, but is it really worth the wait? The answer is neither a complete yes nor a no. Technically the director has improved a lot in his movie making but still has not been able to use the story to its full potential mainly due to lazy editing and bollywood formulaic orientations.\n\nThe story starts with Samar Anand (Shahrukh Khan), a high ranking army officer working with bomb disposal squad, who is aka \"the man who cannot die\" for his daredevil ways of diffusing bombs. Samar meets Akira (Anushka Sharma) while rescuing her from drowning and covers her with his jacket to keep her warm where he mistakenly leaves his diary. She starts reading it and this is where the whole story of his youth and love in London is conveyed. Akira works with the Discovery channel where she's permitted to shoot her dream documentary on the bomb disposal squad after her persistent pleads. Here, she gets to know Samar deeper while also slowly developing feelings for him, and with this comes some pace and grip to the whole film towards an easy yet interesting conclusion to the tale.\n\nLike usual, Shahrukh has been given the major responsibility of holding the movie together and he carries it well to some extent with his trademark style of romance and emotions. But I clearly wouldn't go so far to call it his second best after \"Swades\". Anushka is good, while Katrina looks better than her previous attempts. The foreign actors and the extras have done well with whatever little part they have been given (a rarity in bollywood). The cinematography is typical Yash Chopra with improved continuous shots, whereas the music is fresh and foot tapping though nowhere close to Rahman's bests. The first half shows a lot of promise but it gradually fades as it advances with the unconvincing presentation.\n\nIt surely is a culmination of all the Chopra's movies for its plot line and certain cinematic elements, whether it's the poetic harmony from \"Veer-Zaara\" or the youthfulness from \"Dil Toh Pagal Hai\", whether the maturity from \"Silsila\" or the intensity from \"Deewar'. Thus, it succeeds in serving as a good conclusion in the filmography of the veteran film maker.\n\n(imeansuraj.blogspot.in)"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "alihassan68771",
        "review_rating": "10",
        "review_title": "jab tak hai jan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "neelam1",
        "review_rating": "3",
        "review_title": "Not So Good: Contains Spoilers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "pradyu_rock",
        "review_rating": "10",
        "review_title": "Best modern love story!!",
        "review_detailed_main": "Jab Tak Hai Jaan. Clearly the best romantic Hindi movie in the modern era. Coming to the acting point of view, it wins the audience because of the most simple and touching performances. SRK, once again proves that he is the romantic king of cinema. The army look on him is a treat to the eyes. Katrina has been made to ACT after a long time. Hats off to Yash Chopra. Anushka has been used the write way. She has brought youth into her character. Music. Brilliant. A R Rahman proves once again the he can charm people with his music. Direction is great with no flaws. Overall, it's a musical journey for lovers. Go and watch it for Yash Ji and SRK. Rating-10/10"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rakib-dbz57",
        "review_rating": "10",
        "review_title": "SRK still has his touch, Kat gave her best performance, Anushka is adorable",
        "review_detailed_main": "This movie is all about love and how much it means to someone who really finds it. A great gift from Yash chopra to Bollywood.\n\nSRK did his thing. He was awesome in the whole movie. Some moments are a little bit predictable but that doesn't mean its bad.\n\nKatrina was so good in the movie that gave me a little surprise. I know she is a good actress. But in Jab Tak Hai Jaan she gave her best performance yet. As Yash chopra said, \"She is a rear beauty\".\n\nAnushka is one of the best new talent in bollywood. And she proved it again. She made her small role so nice that will make you clap for her.\n\nSo in short Jab Tak Hai Jaan is a must watch movie. It will bring back the love in you."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "bharat_bhushan02",
        "review_rating": "1",
        "review_title": "worst movie i have seen ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "bonaparte_abhi",
        "review_rating": "8",
        "review_title": "It is good.. :)",
        "review_detailed_main": "i saw this movie last night when its DVD came out.. and after watching this i am not at all disappointed. i liked this movie. it doesn't feel dragged or lengthy. i don't know why people were complaining that it was long or something. Acting was good.. even KAT acting was good as compare to her previous flicks. Chemistry between SRK and KAT was really good. Direction was superb. all credit to late yashraj ji. Songs were rightly placed in the movie even though i didn't liked the songs when they came out. Anushka was good in her role too.. so u can watch this movie at least once. i totally enjoyed it. and this movie is far far better than SOS."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "wildlife-ptech",
        "review_rating": "5",
        "review_title": "An intense Khan performance but loses steam in second half",
        "review_detailed_main": "Rating\n\n5/10\n\nA disappointing last film by Yash Chopra. Khan gives an intense performance but the script loses steam in the second half. Sharma tries but has some particularly laughable lines. Kaif is unable to emphasize the complexities of her character. Songs are good however. Die hard romantics will rate the film higher."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rishiraj19662001",
        "review_rating": "9",
        "review_title": "Hats off to Mr. Yash Chopra !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Vineet_MishraPrayagraj_Dibiyapur",
        "review_rating": "1",
        "review_title": "Love story my *** !",
        "review_detailed_main": "Story meant to fascinate teenager girls, who have very low IQ. I hate these Bollywood movies where directors and Producers will burn loads of money in Hiring Big stars, adding multiple songs to increase length of their movie. But they don't give a s**t about scripts. Seriously, when will Bollywood become mature. These foolish low IQ movie makers have made Indian movies subject of mockery all over the world."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "harsh007",
        "review_rating": "8",
        "review_title": "His legend will be difficult to match..",
        "review_detailed_main": "Jab Tak Hai Jaan\n\nDeewar, Daag, Waqt, Kabhie Kabhie, Trishul,Mashaal, Silsila,Chandni,Darr,Dil toh pagal hai,Veer-Zaara. Now coming to distinctions ;6 national awards,11 filmfare awards including 4 best directors,Dada saheb Phalke Award ,Padma Bhushan and the only Indian to become the life time member of BAFTA(British Academy of Film and Television Arts), 5 Honorary Doctorate degree and numerous Recognition from all over the world. You don't need to have an IQ of 160 plus to guess the name of the person being introduced above.He is the Legendary Mr Yash Chopra(Late). Now when a personality like Mr Chopra comes back to do what he does best ,the excitement among Fans and movie lovers especially in a media frenzy country like ours ,reaches gigantic heights.Thus Humungous expectations are inevitable, the desire to traverse the untraversed and the thirst to taste the Elixir becomes inescapable. This is the same enthusiasm with which I booked my tickets for the First day first show and entered the realms of the silver screen. The movie begins with Mr Chopra reciting a unheard stanza from the poem Jab Tak Hai Jaan.The Journey begins.\n\nThe movie has a very modest and fitting start which is beautifully shot in the Valleys of Ladakh. Every frame here looks like a postcard, such sequences are testimony to the fact that Mr Chopra had eyes for beauty like no one else. The Movie moves on with the story going backwards into the winter laden streets of London where Srk meets the love of his life floating like an angel in the midst of heavenly snowfall. The movie is filled with such beautifully shot sequences which clearly show the skill of a master filmmaker,who knows his craft like no one else.But disappointingly his craft is let down by his son 'Aditya Chopras' implausible story especially the hinge that connects the two timelines shown in the movie. If only he chose better reason for the separation of our 'Star Crossed ' lovers the movie would had been something else.There are many other places where the story should had been better written. Despite having a faulty story ,Yash Chopras exceptional treatment of the subject make the movie watchable and lovable in some places. Shahrukh Khan is called the 'Baadshah of Romance' and he shows us why girls go crazy for him. He is another pillar that keeps the ship above water till the end. He is in form after a long time and delivers one of his best performances ever(At least top 10). Nobody could have portrayed a character with emotional baggage better than him. He is truly the King. Anuskha Sharma is a natural and she proves her skills again and leaves an impression in almost every scene .In terms of acting, Katrina is a weak point.They should have taken a better actress for her character because it was complex and only a seasoned actor could do the job well. The music of the film is awesome but when Maestros like gulzar and AR Rahman come together you expect it to bring down rains but clearly our expectations went a little unsatisfied. So after all of the above Is JTHJ worth a watch??Should we invest our hard earned money in it? The answer is Yes, of course and how can you even ask such a question!!! The movie may have a defective storyline but it does have a story and it has the execution of a master storyteller .It could've been the best movie of the year or maybe the decade if only there were some tweaks in the story, some refinements which would had made huge difference to the impact it made on the audience. And and above all, Movies are as complex as humans,you just cant dismiss them as plain good or bad. They have shades, some bright some dark,only the intensity differs.\n\nIn the end all I could feel was there are few story tellers whose legends will be passed on to the next generations and Mr Yash chopra is one of them because his skill of portraying human emotions was exemplary and rare, simple but beautiful ,brilliant but close to the heart. Love will never be portrayed on screen like the way he could because he had the eyes to see what ours couldn't. Your Legacy will continue ,JAB TAK HAI JAAN"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "hbravat52-251-198577",
        "review_rating": "9",
        "review_title": "great movie",
        "review_detailed_main": "personally despite some flaws(which every movie has) i liked this movie inspite of me being a salman fan.really some great performances by king khan,katrina & anushka.if u love someone timelessly,this is d movie for u.every one may not like it as its all about the personal taste.some like masala movies wid ppl flying here n der,some like comedy movies which has a collection of SANTABANTA JOKES (SOS),but this movie just touches your heart.SONGS ARE JUST Awesome.they are like slow poison which gradually sinks in your heart.direction is spot on as usual being a yashraj movie.awesome movie.simply awesome.must watch this if you have a heart."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sarah_cool009",
        "review_rating": "2",
        "review_title": "nope didn't like it... cause....",
        "review_detailed_main": "I didn't enjoy that much, honestly saying. it was unpredictable story but unpredictability is not enough. its not that much fun. i mean yes it was but it was in some little moments. the making is great. but some characters are so much illogical specially katrina's i mean what the hell is with promises.. naive character. it only seems like its only about two people who was soo much in love. in order to prove their love they were separated and felt dead. -_- annushka's character was really sane in here. but not too much :P but it was enjoyable.\n\ni don't get why this is 7. its not that good. if you guys wanna watch romantic love story with no intention for searching logical explanation.. (or in some case common sense) feel free to watch this one.\n\n3 rating is for the nice making and 1 for annushka :P"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "eh5963-297-967354",
        "review_rating": "8",
        "review_title": "Strikes the right chords..",
        "review_detailed_main": "\"Har ishq ka ek waqt hota hai\" - A simple line rendered by Rishi Kapoor's character, Imran. By the end of the viewing, that is what this movie is mainly about. A love taking a couple of generations to mature. If we look at the big picture, JTHJ is merely another Yash Chopra Picture dealing with human relations.\n\nIf one goes back in time and looks at films such as Waqt, Daag, Deewar, Trishul, Silsila, Maashaal, Vijay, Lamhe, Darr, Veer Zaara etc. One notices that these Yash Chopra directed films delt with human emotions and relations above anything else. So does JTHJ live up to the humongous expectations? Does it live up to the name that is Yash Chopra? For the most part, Yes! Samar Annand is a Punjabi struggling to make a living in London. He bumps into Meera a few times here and there and then they start meeting consistently so that Samar can teach Meera to sing in Punjabi. (Reason is explained in the movie) They end up falling in love. However, circumstances and a promise to God from Meera leads them to break up. 10 years later, Samar is in the Indian Army enters Akira into his life. Why did Samar leave? Will they ever meet again? JTHJ doesn't leave any question unanswered.\n\nWhat separates JTHJ from other Yash Chopra films is the whole modern feel of the movie. The characters using foul language, kissing scenes etc. However, the soul is surely the same and that's what separates JTHJ from other films of the year.\n\nJTHJ may have the language of today, but it still has that Yash Chopra trademark of love, emotions and not to forget that Punjabi touch he puts in his films. That is surely there.\n\nOther plus points in the movie are the twits/turns in the movie. Also, the chemistry between the lead pair is electrifying. The second half is actually pretty interesting for the most part. While the first half is excellent.\n\nA scene I loved was in the second half when SRK-Katrina meet in the hospital. Add to that, there's a sequence in the second half when Samar shows Akira his past life 10 years ago. As a viewer, you see the scene just like Akira does. You realize how alive Samar is the same as Akira.\n\nFlaws? The film could have been trimmed down a bit. The scenes before the climax start to drag a bit.\n\nA special mention to the cinematography of Anil Mehta. The film is a visual treat. Whether it's London or Ladhak - Just beautiful.\n\nAditiya Chopra's story is good but it's the dialogue that does the trick here. Knowing Aditiya Chopra's past work, one expects some great lines and he delivers.\n\nA.R. Rahman and Gulzar come up with a beautiful soundtrack. Each song is special. Challa being my favorite and Saans being the most soulful. Again, each song is picturised perfectly.\n\nKatrina Kaif gives an elegant act. She looks gorgeous but also performs well. Given that her acting talent is limited, Chopra has extracted something out of her.\n\nAnushka Sharma is a scene stealer. This is her best performance yet. Her energy, charisma, lines etc Just brilliant. She's sure to take great acclaim after this movie.\n\nRishi Kapoor, Neetu Singh, Anupam Kher all make nice cameos and do justice to their roles. The guy that plays SRK's roommate from Lahore is a delight.\n\nAll said and done, JTHJ is held on the shoulders of 2 giants. Actor Shah Rukh Khan and director Yash Chopra. SRK puts his best foot forward and gives another powerful performance. He has 2 distinct characters and he excels in both. If SRK carries the film in front of the camera, it's the man behind the camera that the film really belongs to. The late Yash Chopra's direction is nothing short of spectacular. He said he would make films till he died and he did just that.\n\nOverall, JTHJ strikes the right chords. The story may not be the most interesting but it's the moments that make the movie. So do watch this Yash Chopra Romance!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "gokul0801",
        "review_rating": "4",
        "review_title": "Tired, old love story from the Chopras..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "zahrariazch",
        "review_rating": "9",
        "review_title": "Watched it in 2023 and can't forgive myself to not have watched it in a cinema",
        "review_detailed_main": "I went in with 0 expectations but was blown away by this movie. So much and so that I ended up watching the entire making!\n\nSRK: The way he's brought intensity and life to his character is a testament to his craft. I could watch the movie on mute through his eyes and body language.\n\nKatrina: She was much more than just a pretty face/dancer. Her performance didn't feel short in comparison with SRK. Katrina fans: WATCH THIS!\n\nAnushka: It was just refreshing to see her character. Very strategically placed to break the intense moments and bring relief to audience.\n\nIn short: I laughed, cried, dreamt, worried and believed in love all over again. Not to mention, Yash Chopra shot London and Kashmir STUNNINGLY. And to say this about the most used locations in movies is a big thing."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "RA118",
        "review_rating": "5",
        "review_title": "Disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "tuhin94",
        "review_rating": "9",
        "review_title": "What a beautiful story!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "rajpanchal34",
        "review_rating": "10",
        "review_title": "What A Movie!",
        "review_detailed_main": "Surely the best movie ever! Everything was Amazing! I enjoyed every second of it and I'm a teenager, trust me it's truly remarkable. Yash Chopra sign off with a BANG! The story is outstanding with Shahrukh Khan doing a great job, and KAtrina Kaif just being her, lovely! Anushka Sharma did really well too, this should be rated a ten, probably the best story and the best romance film I have ever seen! Please watch this movie, it will not disappoint! I really enjoyed the film because it gets straight into it, it makes you feel intrigued straight away, and after you start watching you cannot resist taking your eyes away from the movie, believe me it is AMAZING!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "amitgarg_pta",
        "review_rating": "3",
        "review_title": "It is positive approach dictation term is violence over estimate in reconfirm over address in letter over interest in via dictation term off value over dictation term in reo.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "owlfowlofficial",
        "review_rating": "10",
        "review_title": "Shahrukh boss again.",
        "review_detailed_main": "I knew this would be awesome, after watching around half of the film, I understand the story is different and epic, nice plot, great direction and awesome acting of everyone. I like the chemistry between Katrina and Shahrukh, this is amazing, in this movie you cannot imagine their age difference. Everything is nice. Hope I will see it again, but always watch in good quality video, otherwise you will miss some special scene. Shahrukh is brilliant as well as before. The songs are amazing. Specially I like the dance part of this movie and how Shahrukh propose Katrina, this is awesome, I never seen this kind of scene before to any Hindi film."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "Pakhpalo",
        "review_rating": "4",
        "review_title": "Jab Tak Hai Jaan – A Review 2 Years too Late",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "erkansirin78",
        "review_rating": "9",
        "review_title": "Best SRK love story in last decades",
        "review_detailed_main": "I had been thinking that SRK was not gonna touch deep in my heart again since Veer-Zaara and Kal Ho Naa Ho. Once I watched Jab Tak Hai Jaan, I realized that I was wrong. Yes, I was really really and terribly wrong. What was that? It slugged me. Although I have same profession with major Samar, the profession which is supposed to be masculine :), I couldn't help but cry. Yes I cried. Raised in a culture where crying is perceived as a sign of weakness and femininity, I was not allowed to, but even so I let it go. SRK is so lovely, romantic and warm person. Who can resist his charm and sweetness? Despite in his late forties He can still play very well in love stories and preserves his appeal. I pray God to stop his aging so that he will be able to play more and more in romance movies like this one. As if He is sent earth to accomplish a mission which is love and to be loved and teach this all people. Heer echoed in my mind for days along, best song in the movie. Actually I don't know Hindi except a few common words in our languages, Turkish and Hindi, indeed I don't need to. We are all humans. Although we speak different languages, the language of feelings are always same. We are able to love, one of the most powerful feeling God had given us. I have realized again we need to love someone and to be loved in return and then life can become more meaningful and worth to live. I thank all staff who put so much in this warm and nice movie. It has succeeded to flow in my heart. I can still feel its warmth in there :) We are very close and alike."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kaminnisreeram",
        "review_rating": "2",
        "review_title": "Dud.",
        "review_detailed_main": "These two stars are for Gulzar saab and Rehman Sir. Both worked with Yash ji for the first n last time. Thankfully by the time this film came around, one had seen enough of Anurag Kashyap, Dibakar Banerjee, Shoojit Sarkar, Zoya Akhtar, Sriram Raghvan, Sharad Katariya. These directors have brought new sensibilities to story telling. Not interested in Yash Raj buffet."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "est2019",
        "review_rating": "10",
        "review_title": "A Fitting Swan Song for Yash Chopra",
        "review_detailed_main": "Yash Chopra - a director like no other who has entertained us for decades. From Daag to Lamhe and Veer-Zaara to Chandni with many others in between, his larger-than-life films have never failed to keep an audience member engaged.\n\nJab Tak Hai Jaan - a fitting name - is everything you expect from a Yash Chopra film. A well-paced story, excellent songs, phenomenal acting, and of course, superb directing.\n\nEvery frame is picturesque in this film. Shah Rukh Khan and Katrina Kaif have given some of the best performances of their careers, and Anushka Sharma surprises as the \"side-heroine\", never once having a dull moment.\n\nEvery song in this film is a masterpiece. From the underground \"Ishq Shava\" to the sweet \"Heer\" and the vivacious \"Jiya Re\", listeners are treated to a variety of musical arrangements that will stay with them long after the film. The title song - Jab Tak Hai Jaan - is perhaps one of the best songs of the decade that will make one nostalgic.\n\nAll in all, this film is a masterpiece and should not be missed."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kingrahul-32901",
        "review_rating": "9",
        "review_title": "Brilliant",
        "review_detailed_main": "One of the best movie Yash Chopra has directed and of course Shah Rukh Khan's as well . With an awesome album and this is one of my favorite movie for sure definitely in top 10 ,I don't wanna give any spoilers so that's the reason I'm not going to give any details about this movie . Must watch."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "qjohn10",
        "review_rating": "2",
        "review_title": "No on screen chemistry between SRK&Katrina",
        "review_detailed_main": "i have seen almost all the movies of SRK. He and his heroine always have great on screen chemistry which portraits well to the audience and almost all of his love stories are excellent. in this one i didn't see any on screen chemistry between SRK&katrina. they didn't act well to show they were in love. Well i don't think it was SRK , he is the king of Romance.\n\nKatrina didn't have any expressions on her face. always same plastic face for every emotions. Maybe thats why they didn't portrait that in the movie. I felt Anushka and SRK had more on screen chemistry as romantic couple than SRK and Katrina. it was really awkward to see."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "TharsheyN",
        "review_rating": "9",
        "review_title": "True Love Transcends All Boundaries & Efforts To Stop It!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "srikar2097",
        "review_rating": "2",
        "review_title": "Beware of this movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "maheshayindala",
        "review_rating": "9",
        "review_title": "Beautiful romantic drama",
        "review_detailed_main": "Fascinating love story, stunning cinematography by Anil Mehta, and A. R. Rahman's soulful music. The romantic drama performed by Shah Rukh Khan, Katrina Kaif, and Anushka Sharma and directed by Yash Chopra. SRK plays an visious role as Samar Anand.\n\nThe film explores themes of love, sacrifice, and destiny. It takes the audience on a journey through picturesque locations, blending poignant moments with A. R. Rahman's evocative music. As Samar faces life-threatening challenges in the army and grapples with matters of the heart, the film delves into the complexities of relationships and the enduring power of love. Ultimately, it's a matter of personal taste, and viewers may appreciate the film for its emotional depth and beautiful visuals."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "akumbhar",
        "review_rating": "3",
        "review_title": "One word Disappointed",
        "review_detailed_main": "Disappointed this film . Story ⭐ Song ⭐⭐⭐ (SAS me) Acting srk 🙏 Anushka ⭐"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "yankeedoo",
        "review_rating": "10",
        "review_title": "Great",
        "review_detailed_main": "I can only watch with subs as I'm afraid I only understand English. But this film I've watched three times as usual long movie but grt some nice songs even tho most not clue what's said but decent subs help I've now bought on amazon watch and c"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "umarfarooqueans",
        "review_rating": "10",
        "review_title": "Most Romantic movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shruthi-iisc",
        "review_rating": "2",
        "review_title": "Boring, predictable, lacking chemistry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "karizma-45480",
        "review_rating": "10",
        "review_title": "A Heart touching Emotional journey",
        "review_detailed_main": "Its a great film and definelty a one time watch. SRKs chemistry with both katrina and anushka is simply fantastic.\n\nSRKs acting is so realistic and mesmerizing that you can't pull off your eyes from him throughout the film.\n\nAnushka is simply amazing, free spirited characters should always be given to anushka as she plays them so effortlessly. Katrina Kaif is amazing, so beautifully potrayed that character. Direction, screenplay, acting,music,etc. Everything is just lovely in this movie. Hats off to the story writer.\n\nAnd not ro forget the wonderfull songs it has. Very nice movie.\n\nChalla song is one of my favourite and i always listen to it many times in a day."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "mattvtm12",
        "review_rating": "1",
        "review_title": "Good Story but no chemistry!",
        "review_detailed_main": "Over all story was good. but there was no chemistry between SRK and Katrina in the movie. we found more chemistry between Anushka and SRK. so odd to call this a love story cause couldn't see love between them. Usually when we watch a love story we feel that there is love between them as a viewer we also go through every emotions those lovers going through in the movies. non of that what found between the hero and heroine thought out this movie. that the only downside of this movie. otherwise its good. Great choreography. Love the composition and music. Especially love the song Saans Mein Teri and Jiya Re. Great graphics, great sceneries."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "sulemansaeeed",
        "review_rating": "10",
        "review_title": "Love in London movie",
        "review_detailed_main": "\"Jab Tak Hai Jaan\" is a poignant and mesmerizing romantic drama that explores the complexities of love, loss, and redemption. Directed by Yash Chopra, this film is a swan song that showcases his mastery of storytelling and emotional depth.\n\nThe movie follows the journey of Samar Anand (Shah Rukh Khan), a charming and brooding musician who falls deeply in love with Meera (Katrina Kaif), a beautiful and vibrant woman. Their whirlwind romance is cut short by a tragic accident, leaving Samar heartbroken and searching for solace.\n\nThe film's narrative is expertly woven, oscillating between the present and the past, revealing the layers of Samar's emotional turmoil. Shah Rukh Khan delivers a powerhouse performance, bringing depth and nuance to his character. His chemistry with Katrina Kaif is undeniable, making their romance a joy to watch.\n\nAnushka Sharma shines as Akira, a feisty and determined filmmaker who helps Samar confront his past. Her character adds a delightful contrast to the melancholy tone, bringing a sense of hope and renewal.\n\nThe music by A. R. Rahman is sublime, with each song perfectly capturing the mood and emotion of the scene. The cinematography is breathtaking, capturing the beauty of London and Ladakh. My favourite songs from this movie is Heer, by Harshdeep Kaur, but all other songs are also good.\n\nIf you're a fan of romantic movies, \"Jab Tak Hai Jaan\" is a must-watch. It's a beautiful, emotional, and thought-provoking film that will leave you smiling. Yash Chopra's legacy lives on through this masterpiece, reminding us that love can conquer even the darkest of times."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "godiswithunme",
        "review_rating": "3",
        "review_title": "Expected better",
        "review_detailed_main": "The movie is too overrated. Katrina Kaif's acting, really sucked. Still can't believe Yash Chopra chose Kaif for the role. The story plot would make some sense if it was made in late 80s."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "oyontahmid",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "I don't know why the rating is low here. But trust me this is one of the best enjoyable Bollywood movie. You will like it 👍"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "shy_innocent_guy",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ankit-singh92",
        "review_rating": "1",
        "review_title": "Tumme Jab tak hai jaan, please don't see Jab Tak Hai Jaan",
        "review_detailed_main": "I find this movie very inspirational indeed. I too am 30, I don't like my job, fortunately I don't have a zombie girlfriend. Sorry, zombies too have feelings. Calling Katrina a zombie in this movie is an insult to their kind. So, for a career hike, why don't I just conscript into the Army and since I have a post graduate degree, surely they'll appoint me as a Colonel rather than a Major. Had the great Baldev Raj Chopra been alive and seen this miracle, Yash Ji would've been found murdered for sure rather than dying of dengue."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "yashpatil-59612",
        "review_rating": "10",
        "review_title": "Jab Tak Hai Jaan",
        "review_detailed_main": "The movie is one of the best movie of shah rukh khan and it is one of the highest grossing Bollywood movie of 2012. The movie story is awesome with melodies songs."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "ziahsjed",
        "review_rating": "1",
        "review_title": "anchuska",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "loverchirag",
        "review_rating": "10",
        "review_title": "Ultimate love story",
        "review_detailed_main": "Actually I watched this movie at the end of 2018 just after zero was released I was upset of zero not becoming a super hit movie but I just want to say that the collection does't matter. What matters if how you good you have created that film its just an another masterpiece by srk. And I don't even know whether this film was hit or flop I just know one thing I cried I feel love I was happy in this movie all at once. IF YOU ARE A TRUE LOVER LIKE SAMAR ANAND THAN WATCH THIS MOVIE. Love you srk"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "barev-85094",
        "review_rating": "5",
        "review_title": "The Throwaway Swansong of a Bollywood Master",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "krmohitchauhan",
        "review_rating": "10",
        "review_title": "Heart warming story",
        "review_detailed_main": "Very well directed and amazing utilization of Bollywood veterans. Shahrumh just nails it with his mature looks and his sizzling chemistry with Katrina Kaif he can also be seen playing around with Anushka but overall the movie deserves 10 from all aspects be it cinematography to plot to picturisation to some of the stunning landscapes captured across the world. Definetly a worth watch.\n\nThe audience can defiently feast their eyes on Shahrukh for this much awaited bollywood blockbuster. Katrina will be sharing the screen space first time with bollywood king which increases the urge to watch this movie."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "kasimahmed-49471",
        "review_rating": "10",
        "review_title": "Everlasting love story ❤ 💕",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "calhobbes99",
        "review_rating": "5",
        "review_title": "so bad :(",
        "review_detailed_main": "Wanted to like this movie so bad. All the other khan's are kicking SRK's behind so i wanted this to be his fightback. Didn't work at all. The acting choices were really weird. His initial emotions towards Meera were very muted (not passionate at all). The build up of a relation or his warming up to Akira seems really fake and contrived. Yash Chopra (god bless his soul) tried to throw in all the clichés which have worked for him in the past (London, amnesia, love-triangle etc..). but they all seem dated. Seriously amnesia as a plot line is so 70s.\n\nA good movie this year - Matru ki beejli ka mandola."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "samikjainmgg",
        "review_rating": "8",
        "review_title": "Just perfect",
        "review_detailed_main": "Don't understand the negativity in the reviews. Definately comes in the best films bollywood ever made."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "manubhatt3",
        "review_rating": "5",
        "review_title": "Seriously?!? You want to prove God wrong, then why don't just try doing suicide instead of living a risky life?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "parva-66760",
        "review_rating": "10",
        "review_title": "It it's nice movie to watch",
        "review_detailed_main": "It's a very good movie. I love srk.\n\nPhemeral Echoes Movie Review\n\nChatGPT 3.5\n\nUser Write a movie review for me in 600 words\n\nChatGPT Title: \"Ephemeral Echoes\"\n\n\"Ephemeral Echoes,\" directed by visionary filmmaker Alice Harper, is a cinematic masterpiece that transcends traditional storytelling, weaving a tapestry of emotions, philosophy, and stunning visuals. Released in 2023, the film takes audiences on a mesmerizing journey through the labyrinth of human consciousness, challenging perceptions and leaving an indelible mark on the soul.\n\nHarper's directorial prowess is evident from the opening scene, where she introduces the audience to the enigmatic protagonist, played brilliantly by the versatile actor, Emily Blunt. Blunt's nuanced performance captures the essence of a character navigating the intricate landscapes of memory, love, and existential contemplation. The character's journey becomes a mirror reflecting the complexities of the human experience.\n\nThe narrative unfolds in a non-linear fashion, akin to the ebb and flow of memories. Harper employs this unconventional structure to great effect, immersing the audience in a puzzle of interconnected moments. While some may find the non-linear approach challenging, it serves as a metaphor for the fragmented nature of our own recollections.\n\nThe film's cinematography, helmed by the award-winning Dariusz Wolski, is nothing short of breathtaking. Each frame is a visual poem, capturing the ephemeral beauty of fleeting moments. From sweeping landscapes to intimate close-ups, Wolski's camera work enhances the emotional resonance of the story. The use of light and shadow becomes a language in itself, speaking volumes about the dualities present in the narrative.\n\nThe musical score, composed by the renowned Lisa Gerrard, complements the film's ethereal atmosphere. Gerrard's haunting melodies guide the audience through the emotional peaks and valleys of the story, creating a symphony that lingers long after the credits roll. The sound design, meticulously crafted, enhances the immersive experience, allowing."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "artaddicted04",
        "review_rating": "3",
        "review_title": "Disagree, too bad yash last movie is a piece of crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "lordmobashshir",
        "review_rating": "8",
        "review_title": "A special (and rather strange) connection of love.",
        "review_detailed_main": "This is the first time I am writing a review for any film( because usually I just watch films for entertainment and don't care to write a review). But I found this film so moving ,and a message of love which was quite special, that I just couldn't resist(i had seen this film before but back then I was just kid). It tells a story of how a man meets with a accident which could have killed him but his lover prays so desperately that if he lives she would never meet him again out of love for him. He eventually survives but gets angry on his lover to make such a promise that if he meets her, he will die. So, eventually he grows an enmity with God and vows to embrace the grasp of death every day till he dies to prove the promise false(that doesn't mean he tried to commit suicide every next day, he joined the army as a member of the bomb disposal squad which is a very risky job). He then waits for 10 years for his death but death never arrived on his doorstep but his love for his lover remained and so did the lover's love for him, then eventually they reunited to love each other. Such a strong bond of love( which you will realize after watching the film) really changed my perception and the role of emotions in love which I will remember. Sure it may not be masterpiece in the eyes of the critics but I personally felt a strange connection to it which I can't explain in words. So yes do watch the film, maybe you will also find that connection."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "oronnomridha",
        "review_rating": "8",
        "review_title": "A fanboy review",
        "review_detailed_main": "From my childhood I'm used to watch SRK movies and he's my Fav. Hero. This movie is quite enjoyable. Emotional Ride. But the ending will get you for sure."
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "raghavsharma1986",
        "review_rating": "4",
        "review_title": "Spare us please",
        "review_detailed_main": "One of the most poorly conceptualised movies of all times filled with all kinds of make believe. A 28 year old Shahrukh gets into Army's bomb disposal squad- please tell me which recruitment route he goes through. Army does not take anyone who applies at that age - utter nonsense!\n\nThen there is a bet with God that he would put himself in near death situations by defusing bombs without putting on safety gear. Mr. Script Writer have you considered the possibility that a bomb may not kill the protagonist as he assumes but maim him for life. May be in Indian movie it is optional to apply your mind. Bigger question is why bet for near death situation when you can simply slit your throat and prove God wrong. Utter nonsense!!\n\nKatrina is already married but simply runs away when Shahrukh reappears. Hello! but there is a family she is related to after marriage and it is surprising that they did not even make an attempt to find her. how ludicrous!!!\n\nLastly, a superb disease where your memory gets reset to a point 10 year s back. ROTFLMAO!!!!"
    },
    {
        "movie_id": "tt2176013",
        "movie_name": "Jab Tak Hai Jaan",
        "movie_rating": "6.7",
        "review_username": "azetkhataieva",
        "review_rating": "9",
        "review_title": "First movie i have ever watched starring Katrina...",
        "review_detailed_main": "I am sorry to say this to all KK-fans,but this is the only movie i have watched starring her,but i promise!I plan to watch more of her works, i have only til now watched many of her music-videos. Of course i watched tis one mainly because of SRK.He is the king of movies forever in my heart, and he blew me away once again in his performance in this one.\"JTHJ\" is another Magic by Yash Chopra,but with it's citysized locations and the top sensuality on the romance,he really modernased it. And the kiss between SRK and Kaif!WOW i was deeply shocked!(and i have got to admit that i wish the kiss never happened.SRK can always make a love-scene sexy without a actual real kiss)Poor SRK,I know that he did everything to avoid any kiss with his co-stars.He must have felt depressed somehow. Anushka Sharma did great too with her supporting character, i also knew that it would somehow be a love-triangle in this one.I really beautiful film i have to say. Truly beautiful..."
    }
]