[
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "churchofsunshine",
        "review_rating": "2",
        "review_title": "Typical Friedberg & Seltzer fare",
        "review_detailed_main": "I'm a sucker for spoof movies. And although I am of the opinion that Aaron Seltzer and Jason Friedberg are a pair of talentless hacks, I keep buying their movies on DVD, in the faint hope that one of these days they will produce something half-decent. I decided to give them a fair shot this time around and actually sought out the real thing - \"The Hunger Games\" before I stuck Friedberg & Seltzer's offering into my DVD player, so at least I would have some idea of what they are trying to spoof.\n\nThe result is fairly typical Friedberg & Seltzer fare - grab a bunch of unknown actors who bare a passing similarity to the more talented originals, throw in a bunch of gratuitous pop culture references that are way too late ('Harry Potter', 'Gangnam Style', 'The Expendables', 'Avatar' etc.) and try to tell your story in under 80 minutes, including 20 minutes of bloopers and credits. In that respect, \"The Starving Games\" doesn't disappoint and nothing in this movie will come as a surprise to those of you who have seen other works by Friedberg & Seltzer.\n\nThis is their sixth collaboration as directors (sadly, there are more in the pipeline - next up is a spoof of Fast & Furious) but alas, they are not really getting much better at this sort of thing. The only decent movie they were ever involved with was back in 2000 as two of the six writers on 'Scary Movie'. Based on their career track since then, it is clear that it was the other four writers who actually had the talent.\n\nThat this film hasn't been picked up by a proper distributor and has basically gone straight-to-video says it all. I'd love to know where Friedberg & Seltzer get the money to keep financing this stuff. It's probably all my fault, as I keep buying all their DVD's! If we all stopped watching, maybe they'd go away and get a real job. The thing is though, I can't help myself. I *knew* this film would be pants. I just had to see it for myself just to see how bad it really was. I'm desperately trying to think of something positive to say about this movie. How about - \"It's not the worst of the six films they've made?\" A final word to Maiara Walsh - you're better than this."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "You won't burn any calories watching this laughter-free \"spoof comedy\"",
        "review_detailed_main": "It is not as if spoof comedies are terrible, on the contrary there are some brilliant ones out there like ones from Mel Brooks(Young Frankenstein) and Leslie Nielson(Airplane), even Scary Movie and Loaded Weapon 1 were fun if not quite in the same league. Like a lot of people, I do think Friedberg and Seltzer are hacks and not one of their previous five directing-writing efforts with Disaster Movie, Epic Movie,(two of the worst movies ever made), Meet the Spartans, Date Movie and Vampires Suck have been good. Curiosity and that there are some good examples of good spoofs out there were the sole motivations of seeing The Starving Games in the first place. This said after viewing, The Starving Games really is no improvements over the previous Friedberg/Seltzer collaborations though it doesn't quite stink as badly as Disaster Movie and Epic Movie. There are three fairly small bright spots, Maiara Walsh's game performance and the cute Angry Birds reference and Taylor Swift serenading a dying contestant moment(though that only raised a very meek smile). Visually, it's amateurish stuff, the impersonation costumes are also pretty good but that's it, the production values have low-budget TV quality all over it coupled with (thankfully sparse) poorly rendered effects, too many reaction shots(manipulating us into supposing to laugh) and some really choppy editing. The soundtrack feels thrown in and poorly placed, just there for the sake of it which makes it tiresome and sometimes tedious, that it isn't very catchy in the first place doesn't help either. The toilet-humour-heavy dialogue is vomit-inducingly crude, childish and unfunny is the best it gets which is testament to how truly terrible it is. The parodies themselves are no better, like Vampires Suck there is a main gag and other ones that are not as prominent. The parodies and impersonations are just tired, painfully predictable and often irrelevant, reeking of Friedberg and Seltzer just throwing like the most unsubtle of sledgehammers things in with no relevance or structure to them. And the jokes are drawn out especially the lottery draw one and the tasteless sex scene to the point of slowing the movie down. There was at least a story, unfortunately it comes across as a very thin one and is completely lost within the humour, which explains why some scenes were drawn out. The characters are just caricatures and nothing more, and despite Walsh's efforts you feel no shred of empathy for the lead character. The acting is awful, ranging from over-the-top(Diedrich Bader) to vacant. All in all, incredibly lame but is not Friedberg and Seltzer's worst. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "ilikeimdb",
        "review_rating": "5",
        "review_title": "Of course it's bad! But it's very funny in places",
        "review_detailed_main": "What does one really expect regarding this kind of spoof outing? The Hunger Games is certainly an above-average target given how serious it takes itself. What's too bad in terms of the humor used in The Starving Games is the amount of low-brow fart/elimination/kick-to-the-nuts stuff that seems to show up in lowest-common-denominator humor. Yes, it's a bunch of sight gags, but many are fun and well-done. The leads are pretty/handsome and very well matched to the characters in the Hunger Games. I imagine this movie benefits from lots of beer with some amount of pizza...so you won't starve while watching this outing and a bit of judicious inebriation will certainly help elevate this movie."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "duraznoboi",
        "review_rating": "",
        "review_title": "Why",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "StevePulaski",
        "review_rating": "1",
        "review_title": "Run and tweet this",
        "review_detailed_main": "A few weeks ago, upon discovering known and universally panned parody filmmakers Jason Friedberg and Aaron Seltzer were making a parody of the popular franchise The Hunger Games, I sent out a message on Twitter I thought would be seen as encouraging to some. It read, \"Encouragement to young filmmakers: whatever you're writing now is infinitely better than the new parody film The Starving Games. Soon after sending the tweet, I received a reply from the film's official Twitter reading, \"Great! We're working on The Starving Games 2!\" The fact that the PR/marketing campaign for the picture needs to reply in a smarmy way to negative feedback online about their film shows about as much maturity on their part as the film at hand. Unsurprisingly, The Starving Games is another miserable endeavor of a parody movie, directed by Jason Friedberg and Aaron Seltzer, the same men who have brought you Date Movie, Epic Movie, Vampires Suck, among other installments of the dead parody genre. That's right, I'm referring to the genre as dead now. Consider my reviews of A Haunted House and Movie 43 (which I'll throw in the same genre since it revolves around many self-referential skits and lampoons A-list actors) the genre's funeral service and this one a visit to its gravesite. What has happened to a genre so promising and so filled with life? The simple answer is it has been reduced to what appears to be a cinematic competition between writers to incorporate as many pop culture and movie references in one film as possible. In the first few minutes of The Starving Games, we are annihilated as viewers by the abundance of references thrown at us, as if it's a commercial break on Television in mid-December and we're trying to decide on what toy to buy our children. The Friedberg and Seltzer formula is to have no continuity, no logic, and no wit in their story. Just clobber together every successful film character, pop culture icon, current celebrity, etc into roughly eighty minutes and string it along with a loose plot and hope someone laughs (or enough sales come through to cash a large check).\n\nAs inferred by the title, the film is one long parody of the popular book/film franchise The Hunger Games, with the protagonist of Katniss Evergreen now under the name \"Kantmiss Evershot,\" an inept archer who now must fight for her life in the game where her and another opponent must kill one another in The 75th Annual Starving Games. The winner receives an old ham, a coupon for a foot-long sub sandwich, and a partially eaten pickle. The person who sits through this film in its redundant, eighty minute glory gets nothing but a shorter amount of time left in their day.\n\nWith all the disgustingly unfunny references, I'm glad this film was shot, edited, and completed before Miley Cyrus and the \"twerking\" phenomenon became mainstream. If I had to witness something of that caliber in a film that already breathlessly tries to include the \"Gangnam Style\" musician Psy, the whole Avengers squad, Harry Potter and his friends (who are told to get out of the film because their franchise has ended), and the cast of action movie legends from The Expendables, I would've probably given up.\n\nThe reason why I resist discrediting or shattering the likely large egos of directors Friedberg and Seltzer is because, well, why bother? They have found a formula that pays big money and have capitalized off of the lowest common denominator of wit and intelligence there is in the cinematic world. I am anticipating reviews of The Starving Games that consist of death threats, comments about the devolution of humor because of the directors' films, and remarks of their worthlessness because of their filmography. Reviews of their films have become as predictable as the films they make, so why bother attacking them? All I can say is be grateful this one is confined to a video-on-demand released and a very limited theatrical release, as opposed to their other films which garnered wide releases. Let's hope their window of release just becomes smaller and smaller over time.\n\nThe Starving Games and films like it don't make me angry anymore. They just make me sad. It makes me upset to see films like these gain an audience of young teens who are already experiencing shorter attention spans thanks to Television and the internet. I'd let my twelve year old child watch the original Halloween before a film by Friedberg and Seltzer. Or, better yet, the original Airplane! or The Naked Gun series, both starring the gifted comedy actor Leslie Nelson. Those films worked because they spoofed their own genres and didn't try to incorporate every current celebrity and movie figure that has rose to prominence since their last film. There is no reason anyone should see The Starving Games, but, oh, people will.\n\nRun and tweet that.\n\nStarring: Maiara Walsh, Brant Daugherty, and Cody Christian. Directed by: Jason Friedberg and Aaron Seltzer."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "GTeixeira",
        "review_rating": "2",
        "review_title": "Better than their previous attempts, but still far from good",
        "review_detailed_main": "Yet another 'modern spoof' by Jason Friedberg and Aaron Seltzer, 'The Starving Games' has as its main focus of parody the 'Hunger Games' film. Alongside it, multiple references/spoofs of other hit films like 'The Avengers' or 'Expendables', or popular culture in general.\n\nFriedberg and Seltzer have for very long tried to copy the parody style of David Zucker, with varying degrees of success: 'Scary Movie' was very good (though I believe that was more due to the other screenwriters involved, like the Wayans' brothers), as was 'Wrongfully Accused' to a lesser degree (though that was more due to Nielsen than their writing), but the rest of their works tend to range from regular to terrible; in fact, their more aimless, messy spoofs ('Epic Movie', 'Disaster Movie') are amongst the worst films I've ever seen.\n\n'Starving Games' falls in the second category, with some genuinely funny moments (like the aforementioned 'Avengers' and 'Expendables' spoofs) but with a lot of bad ones (including, for example, the rather tasteless sex scene). Friedberg/Seltzer try so much to cram as many 'hip' references as possible, that by the end the final product is an unfunny, idiotic-looking mess. The fact no actor here managed to give a good comedic vibe, which could save some scenes (something Leslie Nielsen was very good at), makes this worse than it could have been; the actors don't even seem to try at all, and no one has any charisma (especially the main actress).\n\nUnfortunately, while this is a slightly better attempt, It doesn't give me hope for their future career. The fact their comedies seem to keep having a degree of audience success means they will keep with this formula. Guess I will just have to learn to stop bothering with their films."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "leonblackwood",
        "review_rating": "2",
        "review_title": "Really not that funny! 2/10",
        "review_detailed_main": "Review: This movie was totally not funny. For a spoof movie, I was expecting at least a couple of laughs, but the director must have been about 2 years old because the whole thing just seemed immature and silly. The only thing that a found a little amusing was the Pink bearded Mr. T lookalike, but that was about it. Some parts go really over the top, and make you wonder if they actually watched the movie before they brought it out, which was why it went straight to DVD. You won't be seeing most of the actors again, so there isn't much to comment about there performances. At the end of the day, it's just another spoof movie. Disappointing!\n\nRound-Up: As there dint that much out on DVD, I thought that I would give this movie a go, but I knew what to expect. I didn't really pay that much attention to the film after a whole because I just couldn't find anything funny. There are a few references to some other movies like The Avengers and The Expendables, but the director didn't do that much with the material. If you want loads of laughs then this is definitely not the movie for you, but if you want to play \"Name That Film\" then you should give it a go. A total waste of time and budget.\n\nBudget: $4.5million Worldwide Gross: N/A\n\nI recommend this movie to people who are into there spoof movies, but don't expect much from this a Hunger Games make over. 2/10"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "chunkiefroth",
        "review_rating": "1",
        "review_title": "My first Seltzer/Freidbergowitzgoldstien experience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "About what we've come to expect from dreck like this.",
        "review_detailed_main": "\"The Starving Games\" is yet another film in the idiotic teenager parody genre. This overused genre consists of many movies currently on IMDB's Bottom 100 list....with the likes of \"Disaster Movie\" (#1), \"Epic Movie\" (#12), \"Date Movie\" (#24), \"Scary Movie V\" (#50), \"Fifty Shades of Black\" (#65) and \"Extreme Movie\" (#99). \"The Starving Games\", incidentally, is #44 on this infamous list of badness.\n\nThese films are all essentially the same...each one parodies dozens of different movies and rarely, mostly by mistake, they actually provide one or two laughs. But they also provide dozens and dozens of unfunny, crude and stupid 'laughs' that make you cringe. A few examples are names of characters...such as Hugh Janus and President Snowballs. And, as is true of the genre, plenty of fart, poop, wedgie and testicle 'jokes'. Intellectual fare, this sure isn't!\n\nSo is this worth seeing? No."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "javivmartiarena",
        "review_rating": "3",
        "review_title": "Oh god",
        "review_detailed_main": "This movie is bad. It's unfunny and cringeworthy jokes and lack of wit make it a disaster"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Lomedin",
        "review_rating": "10",
        "review_title": "For fans of Scary Movie and related spoof movies",
        "review_detailed_main": "I don't really understand what people expect to find when they decide to watch movies like this. I do know what I can expect, because they are always the same. If you like this type of ridiculous, non-intelligent, dirty comedy, good. If not, why do you bother?\n\nI had a good few laughs with this movie, and it entertained me more than other films that apparently are great (see pacific rim). This movie is not pretentious nor tries to amuse you with new, all fantastic jokes. It doesn't need much budget and it's something I appreciate. It's also better than other predecessors such as Disaster Movie or Epic Movie (those were actually quite bad). As I said before: if you like the Scary Movie saga and related spoof movies, go for it.\n\nNow, 10 is probably a bit overrated, but I can't stand the 3 or so score that this movie shows at the moment, while other trash is in the 7s range.\n\nI expect a lot of clicks on the NO button regarding if this review was useful to you. Please, be my guest, I wouldn't have it any other way. The day I am loved by the masses will be the day that I start rating movies like twilight with a score of over 5."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Dragonborn64",
        "review_rating": "6",
        "review_title": "Fans will like it",
        "review_detailed_main": "If you get all the references you're sure to get a chuckle or two. The lead actress looks startlingly like Jennifer Lawrence at times. There's a few good one liners."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "drh-76620",
        "review_rating": "2",
        "review_title": "Weird",
        "review_detailed_main": "This movie is a satire of all other decently made movies, I would bet Mel Brooks would think this movie's outtakes were much more laughable than the movie itself I watched and rarely laughed at all But when the outtakes were viewed I found them more entertaining. Sad to see someone try too hard to make it funny it wasn't.\n\nI have seen funnier stupidity in other films that were satires. This one does not hit the mark. If the producers and writers sat down and watched other satires that were real box office gems They would then perhaps make something far more entertaining. Just stop with the boom boom and the Viagra jokes. It would work if they took some of those outtakes and pasted them in the movie. It would then be far more funnier."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "maggeboiii",
        "review_rating": "1",
        "review_title": "A Travesty Beyond Belief",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "denis_natea",
        "review_rating": "1",
        "review_title": "sleep,sniff,drink, read or have sex but don't waste your time with this crap",
        "review_detailed_main": "i cannot believe how crap is...i must say that i never saw anything worse than these...i was tensioned from the beginning to the end...but because i was annoyed...i choose to see a movie and this is a waste of time and money...i like the scary movie series but please do not compare that with this... from the begging to the end is a predictable story with nothing than bad taste... It supposed to be dumb but not like that..this doesn't have any type of humor.I would like to be asked after the movie what i think about it and if i want to be refunded.I think that is fair.is about my time and my money and same as me was lots others disappointed by the movie.It was advertised in a way that make you to come and see it, but since now i will be reserved...i will read some reviews before going for a movie..it really ruined my evening.."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "jonathan_maroon",
        "review_rating": "1",
        "review_title": "May the odds be never in your favour (especially if you watch this movie)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "rileyjustin306",
        "review_rating": "2",
        "review_title": "It's everything we've come to expect from the Seltzerberg",
        "review_detailed_main": "I think it's fair to say that 2013 has not been the best year for comedy. In this year alone, we've had to suffer through Movie 43 (Cringe- Inducing), A Haunted House (Subpar), Grown Ups 2 (Insufferable) , & Scary Movie 5 (Excruciating). After Scary Movie 5, I thought to myself \"This is it, this is as bad as any comedy can get, it's all uphill from here\".\n\nWell, turns out that I was wrong, because believe it or not, The Starving Games is EVEN WORSE Than all the movies that I just mentioned. If you've seen/survived Jason Friedberg and Aaron Seltzer' s past movies, then you know what to expect. It's a series of juvenile gags, dated pop culture references, lame celebrity impersonators, cheap production values, and scenes stolen from movies that have nothing to with what they're supposed to be spoofing.\n\nThe only good thing about this movie is that it's in limited release, so that no one can spend their money on this garbage."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "forrestly7",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "I am all for spoof movies but this is one of those that is totally unwatchable - I am embarrassed for the cast, especially those with a smidgen of talent such as Diedrich Bader (get a new agent!) - I stopped watching when the angry bird appeared. I would imagine if this film even had aired in theaters even the seats would have walked out. \"Starving Games\" falls into the lowest category of spoof films, it's not funny, it's not occasionally funny, it's not so bad it's funny...just plain unfunny throughout. This is further proof that the duo of Seltzer and Friedburg are pretty much THE worst that Hollywood has to offer right now. Anyone even considering watching this film should be warned - it's a complete waste of time."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "nilanna999",
        "review_rating": "1",
        "review_title": "Don't subject yourself to this",
        "review_detailed_main": "I was at work this morning and during a lull, my boss put on this movie. I wasn't really paying a lot of attention to it but I eventually had to ask him to watch the rest of it at home.\n\nI'll be the first to admit that parody films are not my forte. I don't like gross out humor and I find a lot of them to be completely immature. But I'd seen The Hunger Games so I figured I could just glance over every once in a while if a joke was funny. I like the 5 minute parody videos on youtube (you know, How It Should Have Ended and such) so I figured it would be like that.\n\nI was wrong.\n\nSome of the jokes were nonsensical. And by that I mean I was trying to figure out what the joke was and why it was supposed to be funny. Jokes that make me wonder if the writers just threw in random inside jokes without explaining them are not jokes at all. They're just random events the movie treats like jokes.\n\nSome of the jokes were needlessly gross. I will never understand how anyone finds this kind of humor funny but I thought surely professional writers would know how to actually write something that could be funny to someone other than themselves in their addled state of mind. I was wrong. The ridiculous sound effects made it all the more difficult to tune out by the time I knew this wasn't going to be funny. Even the jokes that did have punchlines that pertained to the actual movie it was parodying were so predictable, I literally said \"called it\" at one of them after it was said.\n\nNo one in this movie looks like they care at all about what they're doing. This is such an obvious attempt to cash in on a popular franchise, it's shameful. I get that movie studios are businesses and they need to make money to keep afloat but at what cost? Nothing about this movie showed any effort whatsoever. I would have thought, for a movie parodying The Hunger Games, that they would have at least made fun of the dim lighting of that movie instead of just making everything brightly colored. Was this so you could see every disgusting physical joke more clearly? It doesn't come off as a parody if you can't even make fun of things that actually lend themselves to humor.\n\nI hate movies like this. 4.5 million dollars and there was no talent or effort in this movie. I'd seen the actress who played the Katniss mockery in other things so I know she can act. I felt a bit sorry for her that she actually thought this would be anything but embarrassing. As someone who would love nothing more than to be a screenwriter, it's an insult to people who put real thought into their writing when these kinds of movies get made. There's Hunger Games fanfiction better than this. And anyone can write fanfiction.\n\nI know what you're thinking, how dare you judge this movie when you didn't even finish it. But have you ever watched a movie that started out badly and finished as a masterpiece? Because I haven't. And if there was clearly no effort in the beginning, there's no way there was suddenly effort at the end.\n\nI really hope Hollywood learns from movies like this and the genre dies out. In the meantime, I'm hoping this review dissuades anyone with a sense of humor and any class whatsoever from watching this terrible, terrible movie. Or even listening to someone else watching it."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "michaelhirakida",
        "review_rating": "5",
        "review_title": "Friedberg and Seltzer fail to make this parody hilarious due to the low budget and gross out humor.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "nogodnomasters",
        "review_rating": "10",
        "review_title": "DON'T HATE THE PLAYER, HATE THE GAME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "alexjamessmith",
        "review_rating": "7",
        "review_title": "it's bad. but that's the point.",
        "review_detailed_main": "Yes it's bad but thats the point. It's a parody. If it was meant to be serious it would be seen as a rip off. People rating it badly need to be slapped with a silly stick."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "elshikh4",
        "review_rating": "1",
        "review_title": "Why do I spend effort in reviewing a movie that didn't spend effort in ANYTHING ?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "maiconfs14",
        "review_rating": "1",
        "review_title": "More of the Same",
        "review_detailed_main": "Awh, man. I'm a big fan of the whole parody/spoof genre, i loved all the classics like \"Spaceballs\", \"Airplane!\", \"Top Secret\", \"Scary Movie\" (not actually a classic, but still) Even the terrible ones like \"Vampires Suck\" and \"Superhero Movie\" gave me some laughs. But, this one is just... awh, i don't know how to describe it. OK, \"The Starving Games\" as the title suggests, is a parody on the hunger games saga and follows the same plot of the first one. However, it does nothing actually funny with it source material, and it could. All the jokes are so dumb, old and pointless i really doubt the writers thought they were funny. The first \"joke\" of this movie is Kantmiss, the main character, hunting in the wood, when her boyfriend pops up from nowhere making her accidentally shoot an arrow at a balloon with a \"the great and powerful Oz\" character at it. HOW? How is it supposed to be funny? Do the writers really think just showing a familiar face is funny? And that's my problem with Friedberg and Seltzer, they don't even try. All of them spoofs just show some famous character or celebrity being hit by something or popping out of nowhere like that's funny. Here's an example in this movie we see LMFAO and the avengers exploding, in another scene Psy is shot by an arrow, Taylor Swift appears and starts singing, an Avatar parody in the middle of the film, with no good reason, A man uses Siri for throwing \"angry birds\" and fruits at a character and she cuts the fruits in a \"fruit ninja\" way. Why all this? Because the writers really think the audience is dumb enough to laugh at something just because they recognize it."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "kosmasp",
        "review_rating": "4",
        "review_title": "Almost decent",
        "review_detailed_main": "This is way better than many other \"parodies\" of recent years. It doesn't make it the best and it doesn't even come close to the classics, but you could do worse than watching this. The obvious story line is that of Hunger Games that gets spoofed here. But there are occasional other movies thrown in for good measure (like Harry Potter to name but one of them).\n\nSome things might not work in a couple of years because it is based on current events, that's one major difference to something like \"Airplane!\". It would be unfair to set the standards that high though. So if you liked the Scary Movies (even the latter ones that lost a bit of their appeal), you will like this too. You might also like this if you didn't like the Hunger Games (another thing it doesn't have in common with the classics, but rather with new parodies, is not respecting the \"source\" material)"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "estebangonzalez10",
        "review_rating": "1",
        "review_title": "Awful attempt at parody",
        "review_detailed_main": "\"You know, we could run away from here. We could live someplace else.\"\n\nWhy would someone want to spend 4 million dollars to produce a film like this? That's not even the right question I should be asking, it should be: Why did I actually waste my time in watching The Starving Games? I was simply skipping channels on my TV and this film was about to start so I decided to give it a go. Perhaps the adolescent teenager living inside of me would appreciate it. I'd seen Aaron Seltzer and Jason Friedberg's other spoof films such as Vampires Suck and Meet the Spartans and I had hated both of them so I wasn't expecting anything different here. I don't know how they manage to do it, but their films seem to be getting worse when you'd think it would be an impossible achievement to go any lower. At least some of their prior films have a funny joke during the opening sequence, but this film falls flat for its entire runtime. There is no creativity whatsoever here and the jokes are all recycled. The spoof genre seems to have been dead for quite some time now and there is simply nothing entertaining about it. I can't think of the last time I actually enjoyed one, but having recently seen Dr. Strangelove my heart really sinks to how low we've fallen. This film tries to throw everything at you: the Expendables, the Avengers, Harry Potter, Oz, Avatar, and even Taylor Swift, but nothing about it is remotely funny. I won't even spend more time writing a full review because it's not even worth it. I just wanted to spend some time ranting about how films like this are given the green light and why some audiences might find this material funny, because I think a ten year old could come up with the ideas for the jokes in this film.\n\nhttp://estebueno10.blogspot.com/"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Edvis-1997",
        "review_rating": "2",
        "review_title": "2",
        "review_detailed_main": "It supposed to be a comedy but it's not even funny. Huh those reviewers who're giving 10/10 should be banned from this site because they're literally stupid..."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "SquigglyCrunch",
        "review_rating": "2",
        "review_title": "A Sad Attempt at Humor",
        "review_detailed_main": "I was curious about this movie. I didn't know the creators, and I'd seen an advertisement for it somewhere and thought \"I should give that a look\". So when it appeared on Netflix I decided to give it a watch. As you have probably already guessed, it was terrible.\n\nThe movie is completely reliant on its humor. Considering its a parody I think that it's quite clear that this movie isn't going for a good plot or characters, so I'll just talk about the humor.\n\nThe beginning of the movie is pretty funny at points, and that's about it. Everything else is absolute garbage. The funny parts at the beginning were dark and unexpected at times, and I assumed that that would be how the rest of the movie was. Considering the Hunger Games is about people killing each other, you'd almost just assume that it'd all be dark humor. But that's not the case. After that everything is either random crap that only children would find funny or pop culture references, and it's quite clear that this movie isn't for children. The pop culture references aren't funny though. It feels like the movie just throws in it and says \"Haha get it, it's funny because we mentioned Nikki Minaj. Haha get it? Get it?\" Something isn't funny just because it's there. Sometimes things just being there are funny, but only if done right (yes, there is a specific way to make things funny by just existing), but that's all this movie is. It's funny because you know what it's referencing. That's like saying that The Pianist is funny because it's about the Holocaust and you know what the Holocaust is and it's well-known. No, that's not funny, right? That's basically what this movie does. Now while it doesn't say the Holocaust is funny (because I think that everyone knows that it isn't), that's what its getting at. 'It's funny because its famous' is all the movie is. It's hard to explain because there's really nothing amusing about it, nor is there any reason why it would be funny. So why would anyone think that this movie is funny? I have absolutely no idea. Now while I look back at some of the random jokes and think they were funny, watching them is anything but. They're better remembered then watched. Although I try not to think about this movie as best I can, because it's better not remembered. I almost felt bad about laughing at anything by the end or else I'd lower myself as a person, so even if anything actually humorous happened in the end it was lost.\n\nOverall The Starving Games is about as funny as a steaming pile of poop. It's funny at first to a handful of people, but after that it's just a giant turd and now you have to clean it up and forget about it because otherwise your weekend will be ruined. It's funny for maybe ten minutes at the beginning, but after that it's 'funny' because famous. And that's it. It doesn't make sense (even the sentence structure doesn't, yet there's no other way to explain it), and yet it still passes as entertainment. In the end there is not a chance I would ever recommend this movie. If I were you I'd wipe any research of this movie from your internet history and just try to forget about it. Even if you're interested, don't. If you're extremely interest, don't. The only time anyone should watch this movie is if it's a matter of life and death, and even then it'd have to take a lot of convincing to make anyone watch it."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "bobjenkins892",
        "review_rating": "3",
        "review_title": "OK/bad",
        "review_detailed_main": "OK, lets just start out by saying, I did not like the Hunger Games movies, i just didn't like them. I preferred the books, but when i saw this i had heard of a book parody and I thought \"Hey, maybe this is a movie for the spoof book!\" But i was wrong, I didn't find much of it funny except a little chuckle here or there. I did find that some of the acting was OK, the actress, Maiara Walsh, for Kantmiss was pretty but not the best actress ever. I didn't really enjoy the movie but i sat through it. The only real reason i did not like it was the references to old viral videos/series. The annoying orange reference ticked me off because i hate that thing and they call it annoying for a reason. Also i hated the Double Rainbow, Just because it was funny 4 to 5 years ago does not mean it is still funny."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Hellmant",
        "review_rating": "4",
        "review_title": "Jason Friedberg and Aaron Seltzer's best movie yet!",
        "review_detailed_main": "'THE STARVING GAMES': Two Stars (Out of Five)\n\nAnother movie spoof from the writing/directing team of Jason Friedberg and Aaron Seltzer. Friedberg and Seltzer also helmed such loathed film parodies as 'DATE MOVIE', 'EPIC MOVIE', 'DISASTER MOVIE', 'MEET THE SPARTANS' and 'VAMPIRES SUCK'. They also co-wrote 'SPY HARD' and the first 'SCARY MOVIE'. This time they chose to poke fun at the immensely popular youth book adaptation film 'THE HUNGER GAMES'. I think it's their best movie yet but that's of course not saying much at all.\n\nThe directing duo chose actress Maiara Walsh to do her best job imitating Jennifer Lawrence in the film. She's no Jennifer Lawrence and she doesn't really look or act like her at all but she does an OK job in the role all the same. Walsh plays Kantmiss Evershot and Cody Christian and Brant Daugherty co-star with her as Peter Malarkey and Dale. Diedrich Bader also co-stars in the movie as it's main villain President Snowballs. The film takes place in a post apocalyptic future (much like that of 'THE HUNGER GAMES') in which the 'Starving Games' are in their 75th year. Kantmiss volunteers in the 'games' to save her sister and has to compete to the death with other teenagers (like Malarkey) in hopes of being the sole survivor. She also could win a coupon for a Subway sub, a half-eaten pickle and an old ham.\n\nUnlike other blockbuster satires from Friedberg and Seltzer this one mainly just parodies it's main source material ('THE HUNGER GAMES') and doesn't detour from that plot line. It briefly makes fun of other popular movies (like 'THE AVENGERS', 'THE EXPENDABLES 2' and 'HARRY POTTER') but those jokes take up just minutes of the movie (or less). To be fair I've only seen 'DATE MOVIE', 'VAMPIRES SUCK' and the original 'SCARY MOVIE' (out of the other films on the filmmakers' resumes) but I did think this one was the funniest of those four. Perhaps just because I like the movie it's making fun of the best. It's a bad satirical comedy flick that's mostly unfunny but it's not painfully unfunny like those other films.\n\nWatch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=JSU_hwOQSWQ"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "mistaknly",
        "review_rating": "8",
        "review_title": "Can't wait for \"The Starving Games: Catching Farts\"",
        "review_detailed_main": "Can't agree more with Lomedin. If you don't like fart jokes and are looking for artistic quality, don't watch it. I loved it.\n\nIt really helped me to have just watched \"Catching Fire\" so I was in the right frame of mind to see this. I just sucks all the tension right out of you.\n\nThe books are about a very serious subject and the films are trying to do them justice. The first film was slightly off target and too much about production values and less about the story than it could have been. But \"Catching Fire\" was more in tone with the books.\n\nSo if you approach \"The Starving Games\" with the serious attitude the books (and films) would like you to take, then that's what makes great satire. It just blows the pretentiousness of the first film all to hell. And that's the whole point."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Bruce722",
        "review_rating": "6",
        "review_title": "One of the best parody movies ever.",
        "review_detailed_main": "I'm not going to lie, this is quite possibly my favorite low-budget parody film I've ever seen. Most of the jokes are on the money and catch you off guard just the way they're supposed to. And I'll be honest, even the acting was good. I've seen good actors try and act poorly before but this cast delivered. Speaking of the cast, Maiara Walsh is gorgeous. I hope she can break out of the low-budget niche film market and onto the big scene a bit because she's legit. If you're looking for a serious film, this obviously isn't for you but this is definitely a movie worth watching if you're looking for a cheap laugh or two or twelve."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "klchu",
        "review_rating": "5",
        "review_title": "Really stupid with some laughs",
        "review_detailed_main": "There are some dumb but funny moments in this movie. It's satire and you can tell a lot of effort was put into the jokes. Some land and others don't. It's well made decently acted (for a parody). Some of the jokes are crude and juvenile but that's part of the fun. Relax, have fun, and enjoy it does what it is."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "SusieSalmonLikeTheFish",
        "review_rating": "4",
        "review_title": "It was funny at first but the crude humor was just pathetic and disgusting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "tindesus",
        "review_rating": "4",
        "review_title": "Hilarious and awful at the same time!",
        "review_detailed_main": "This was crude, awful, disgusting at times even, but it was absolutely hilarious. The quality and costumes are so bad as well as the photoshop. The back scene part was disgusting. The sexual content was a little weird. And excuse me, but Rudy? Marco? What the heck? The ending was abrupt. The acting was just okay, but for a comedy film it was decent. I love how Dale is exactly like Gale just more honest. If you're a fan of THG you will either hate this or love this. The Taylor Swift cameo thing was strange but fun. The reaping scene was comedy gold. This is cringey but a whole lot of fun for sure."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "jamesaberinger",
        "review_rating": "5",
        "review_title": "It's fine",
        "review_detailed_main": "While lacking in mainly everything, mostly budget, it recovers itself by using its low budget as comedic and being quite funny in place. The characters are one dimensional, but there's not much time to care thanks to the large amount of jokes.\n\nI would say just watch it on YouTube. Its an experience you may like or hate but at least it's free."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "damndandamn",
        "review_rating": "2",
        "review_title": "hideous",
        "review_detailed_main": "Its got a tittle that's bizarre, the content is hideous and quite frankly, I didn't like it.\n\nHonestly woud've felt more if I was one of the dead people in the movie"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "TheMovieDiorama",
        "review_rating": "1",
        "review_title": "The Starving Games left me hungry for some quality film-making.",
        "review_detailed_main": "Oh boy. This was something else. No longer are we experiencing the tolerability of 'Date Movie'. 'Meet The Spartans' now an echoing far cry for assistance. Stranded, isolated, and alone. Friedberg and Seltzer have somehow managed to accomplish the impossible, bettering their previous efforts in creating one of the worst possible parody features available. This is undoubtedly down there, burning in the hellish fires of Hollywood's underworld with 'Movie 43' and their own ironically titled 'Disaster Movie'. Solely spoofing 'The Hunger Games', this parody was instantly exhausted of ideas right from the very first second. Kantmiss Evershot? Was that supposed to be funny? No, seriously. Did I miss something whilst I gleefully bleached my eyes?\n\nThis time around, the directors seemingly gave up trying to be hilarious and instead insisted on presenting as many advertisements as possible. Angry Birds, Fruit Ninja, Starbucks, Subway, Apple, McDonalds, Nike and a plethora of other brands. Atleast their previous parodies actually attempted to mock films (it's a back-handed compliment...) and not feed into corporate monopolisation. Then there's the outdated pop culture icons that were ham-fisted into this grotesque rectum of a film. The Annoying Orange, PSY and LMFAO to name a few. Playing on nostalgia isn't funny. It's death-worthy. The Starving Games wasn't in first gear to begin with. Heck, it wasn't even in neutral. It was reversing! The film was laughing at me for watching it in the first place!\n\nPeter is a device for an elongated homosexual joke, an unhealthy obsession that the directors have had in all their features. Sexual crudeness was included to, yet again, satisfy all those lonesome virgins \"fapping\" to their TV whenever Kantmiss repeatedly forces a teen to \"motorboat\" her. Looping scenes by masquerading them as highlights, from shoving a foot up someone's poop chute to a guy battered by a cannonball and exclaiming \"my balls!\" in slow-motion, functioning as a minor lethargic effort to ensue laughter. Then, the real kicker, the final five minutes of the runtime comprised of a blooper reel! As if the film itself actually wasn't funny, they thought the outtakes would surely inject some hilarity! Yeah, no. Tears were certainly visible. Tears of regret. Technically speaking, there are no positives. Acting? Terrible. Visual effects? Borderline obnoxious. Directing? Wait, there's direction? Costumes and makeup? Cosplayers.\n\nTo sum up this travesty in one sentence: The Starving Games is a bunch of blindingly white-teethed attractive models running around in their overgrown back garden, attempting to parody 'The Hunger Games', but instead obliterated their careers before they had even manifested. There. Done! Move along..."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "paul_haakonsen",
        "review_rating": "3",
        "review_title": "Where did the laughs go...?",
        "review_detailed_main": "The good spoofs are rare and far between, sadly \"The Starving Games\" is not amongst the good spoofs, not even by a long shot.\n\nGranted, I have not, nor will I, watch \"The Hunger Games\", so I am not sure of how much in \"The Starving Games\" was actually a direct spoof on the events in \"The Hunger Games\". But it hardly matters, because this movie failed on the most important aspect - raising a laugh.\n\nI didn't laugh once throughout the entire movie. It was only when the bloopers were running that I was laughing. And as such, then \"The Starving Games\" was a failure and as far from entertaining as a movie almost could be.\n\nThe acting itself was good enough, but people had very little to work with. And there were some great enough talents to the cast list, but ultimately no one really shined on the screen.\n\nIt is as if the makers of these spoofs are way off chart, because spoofs are not what they used to be back in the days when \"Hot Shots\", \"Airplane!\" and the likes of those were out.\n\n\"The Starving Games\" gets a mere 3 out of 10 stars from me, given some of the talents in the movie, and the fact that there was actually some effort put into the production. But entertainment-wise and laughter-wise, then \"The Starving Games\" failed miserably."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "invisibleunicornninja",
        "review_rating": "5",
        "review_title": "Lots of fun.",
        "review_detailed_main": "More effort was put into this movie than the movie that its parodying. True, the overall look of this movie is cheap and a lot of the humor is a bit crude, but it all works in the movie's favor. This masterpiece is a parody of the mess that is the Hunger Games and as a result there is a fantastic movie. I don't want to say a lot about this movie in the review. Its well worth just watching."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "realvedmak",
        "review_rating": "10",
        "review_title": "Mindless comedy exactly as advertised",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Jimsonite",
        "review_rating": "7",
        "review_title": "If you take it for what it is, you'll like it more",
        "review_detailed_main": "It's a spoof movie. If you liked Scary Movie and are a Hunger Games fan, you will certainly like this. It's idiotic with crude humour throughout but that's funny to some people. And I am one of them."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Lovecraftesque",
        "review_rating": "5",
        "review_title": "Doing justice to the original",
        "review_detailed_main": "As a movie, this does not amount to much. The jokes are not all that hilarious, the acting is not all that brilliant, the plot is not all that engaging, the special effects are not all that terrific. But, it is not pretentious. It knows what it is, and does it relatively well. However, I would recommend it only if one does not have anything better to watch. In the final analysis, the truth is that this movie is significantly better than the original that it is spoofing. This is no big achievement, for just about anything would be better than that ridiculous piece of turd. The Starving Games inherits that ridiculousness - but that's part of the point of the movie."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "4",
        "review_title": "A slightly stronger effort from its infamous directors, \"The Starving Games\" does land a few jokes and has a very likable lead... but still suffers a poor execution.",
        "review_detailed_main": "Let's just get it out of the way... Jason Friedberg and Aaron Seltzer are not good filmmakers. In fact, they are bad filmmakers. Dreadful, even. Responsible for some of the worst comedies of the past ten years. Heck, even arguably responsible for at least one of the worst comedies ever made with their shockingly terrible \"Disaster Movie.\"\n\nBut that being said... (And I can't believe I'm saying this)... their latest film, \"The Starving Games\"... isn't terrible. In fact, I would even go so far as to say it's \"not TOO bad.\" Oh, it's still bad. But it's nowhere near the level of infuriatingly awful that many of their other films reach. In fact (And I REALLY can't believe I'm saying this)... I actually laughed at a few jokes in this film, which is a first. Out of their other directorial efforts, I've only gotten maybe one or two chuckles. Never a full laugh. This one... it gave me about two laugh-out-loud moments, and a couple of good chuckles.\n\nBravo Friedberg/Seltzer. Bravo.\n\nEssentially a send-up to the uber-popular \"Hunger Games\" franchise, \"The Starving Games\" is a parody (in the loosest sense), following Kantmiss Evershot (Maiara Walsh), a young woman who is forced to take part in the annual \"Starving Games\" death tournament. Along the way, she encounters wacky circumstances, contrived pop-culture references and bad jokes galore.\n\nIn all actuality, this film really isn't too much different from other Friedberg/Seltzer duds. It follows the same formula (a central storyline that generally is modeled after one or two popular movies, peppered with random pop culture references and caricatures of recent popular characters from film and TV), and it definitely does have their stamp with some awful jokes and nonsensical references. But somehow, it just doesn't feel as painful this time. It is mainly due to an extremely likable performance from lead star Walsh, who is not only cute-as-a-button, but has a great sense of comedic timing, and seems very open to do whatever it takes to try and make a joke work, no matter how silly (or even exploited) she has to become. She pretty much saves the film from being another intolerable mess. In addition, as I said above, there are a few jokes that do actually work here. Heck, I'd even argue that they managed to actually work in one of their random pop-culture references in a way that was actually funny for the first time in any of their films. (A reference involving Kantmiss being asked to join \"The Avengers\", which despite coming out of nowhere, worked because it felt like one of the post-credits scenes from the Marvel movies, where characters randomly show up to talk about \"The Avengers.\")\n\nBut that faint praise being said, don't think I'm necessarily recommending this movie. Because I'm not. A likable lead and a few decent jokes can't save what is otherwise a pretty big mess-of-a-film. As in Seltzer/Friendberg's other work, the characters and plotting are far too shallow, the direction is cheap and lacks creativity, the production values are sub-par, and the reliance on random references is far more grating than amusing.\n\nIt just isn't QUITE as bad this time around.\n\nI give \"The Starving Games\" a sub-par 4 out of 10. I'd say if you can catch it for free on Netflix or cable, that you could do far worse, and might wanna give it a shot. But it's not worth spending money on to rent or buy."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "GiraffeDoor",
        "review_rating": "4",
        "review_title": "Pretty dumb even for this subgenre",
        "review_detailed_main": "I always try to watch these kinds of movies but truthfully never hold up.\n\nThere's a curious infrequency of actual jokes and they're nowhere near as weird or risque as they could be. And when they devote themselves to one franchise you miss out on the kooky plots that made Scary Movie 3-5 so good.\n\nI can watch this but even for the parody movie genre it's pretty flaccid. I wish there were movies that could be a happy medium between the gay abondone of this kind of movie and the schmaltz of the other contempories pseudo-comedies."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "dogglebe",
        "review_rating": "1",
        "review_title": "A pitiful pitiful movie",
        "review_detailed_main": "Will someone please tell Aaron Seltzer and Jason Friedberg that they should stop making movie? They're not good at it! I picked this one off the list at Netflix and thought, why not? Terrible jokes, poor acting and a sh!tty script are reasons why not. This is not a parody as parodies contain some wit; this did not. It was the same lame jokes that you'd see in F and S's other alleged parodies. It makes me wonder if fart jokes are pre-printed in the beat sheets when they start story development.\n\nThe acting was a step above a cold read (if that much). The jokes are heavily forced on you. And most are rehashed from every other F and S movie."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "mekueny",
        "review_rating": "1",
        "review_title": "Huge Offense to the hunger games",
        "review_detailed_main": "I only watched a few minutes of this film, but it was just like a pile of poop. Oh wait that's an offense to a pile of poop. If you are a hunger games fan don't watch this film. It's sole purpose is to poke fun at the hunger games. I can tell it has positively no storyline, its completely random. I think it's supposed to be funny, but its not. Not only does it make fun of the hunger games, it makes fun of lord of the rings, the hobbit, harry potter, and much more. It's completely dumb. I think my one star rating is extremely generous. Even a zero star rating would be extremely generous. I have no possible way to express my anger at the doofuses who made this movie. What if people see this and think this is what the hunger games is like? The hunger games is pure genius!!! This is, well how do you put it, uh garbage."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "arsakar",
        "review_rating": "3",
        "review_title": "Spoofy fun",
        "review_detailed_main": "Well, I don't like spoof movies and my rating is compared to all the other movies out there. But if you consider this just as a spoof film, well, it does its trick. It has its funny moments and it does manage to decimate the original hunger games movie in a really funny way. If you really like the spoof genre, you might wanna take a look at this. Hardcore Hunger games fans may wanna kill the produces for making this movie. On the whole, this movie does what it is supposed to do - take a movie and take it apart piece by piece as much as you can and put it back in together after destroying each piece (I mean it in a funny kind of way). Anyways, I guess if you keep idealistic expectation from this movie, you won't be much disappointed."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Does what it sets out to do, just a funny parody of 'Hunger Games.'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "kcott44",
        "review_rating": "1",
        "review_title": "Another Horrible \"Comedy\" from Friedberg and Seltzer, Two of \"Hollywoods\" Greatest Hacks",
        "review_detailed_main": "The only reason I watched this and I mean it, was that I was paid $20 to, by a truly cruel evil man that even the \"prize\" of $20 is not worth sitting through an hour and twelve minute film which this is, not counting horribly unfunny bloopers which take up ten more minutes of your life which would be better spent shooting up heroin and I mean that. Thankfully, this is the first Friedberg/Seltzer \"film\" to be released straight to video, it's about time. You know, people say there are worse directors but I don't see it, even Uwe Boll delivered a couple of decent films in Rampage and Assault on Wall Street. Even Michael Bay as much as I dislike him can create solid special effects. But this deadly duo who are guilty of making people dumber for having to sit through their films are the truly most criminal.\n\nOn to the \"film\" itself, it obviously is a \"satire\" of The Hunger Games while also in typical fashion of this duo add random unfunny things to it, just to add it, for no apparent reason. I just watched the movie and I am started to forget most of it which is a blessing, every joke, and I mean every joke is a desperate pathetic attempt to make the viewer laugh, I can't comprehend the people who would find this funny. Obviously the people who like their awful excuses for movies, there has to be some people, if they keep making them. The only thing I give the movie props for is a quick moment where they show that The Hunger Games is essentially a rip off of The Running Man and Battle Royale, however, the way they did it, did not make me laugh. The acting is cringe worthy and I like Diedrich Bader but he has nothing to do here and is completely wasted in his role, he must have needed the paycheck. I can't even explain how bad the \"jokes\" are.\n\nOverall, it's just like their other flicks, painfully unfunny and will make you want to commit suicide faster than a death in your family. Not as bad as Disaster Movie as nothing ever will but still easily one of the worst comedies ever made. I don't believe in an afterlife but if there is a hell, it will no doubt be a never ending marathon of their works. Now excuse me while I go hang myself."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "toweryliam",
        "review_rating": "1",
        "review_title": "bad",
        "review_detailed_main": "Edited worse than a 2010 youtube video. I definitely would not recommend for people who are actually intelligent. Don't recommend. Owjeoshwkejnfnd.anenksnskwjdjkzkwjemcljsnslfjjdnwks."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Westeire",
        "review_rating": "10",
        "review_title": "Best Spoof movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "mjjmolina",
        "review_rating": "6",
        "review_title": "Better than the original.",
        "review_detailed_main": "As far as spoof movies go, this one isn't so bad. It has all the campy humor one would expect. But one overlooked aspect of this movie is that it is actually better than the movie that it spoofs. I know, a lot of people won't agree with me here. It is my personal opinion that the Hunger Games are in fact a bad series of movies with only three saving graces. One, it had great acting. No question about that. The stars did a terrific job. Two, the casting was great and I don't think anyone can really argue that as being wrong. Finally, third, the movie was way better than the terribly written and poorly thought out book. So, again, as far as spoof movies go, this one wasn't so bad and I'd rather watch this ten times more than to sit through any more of the horrible tripe that is The Hunger Games."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Hayden-86055",
        "review_rating": "2",
        "review_title": "Terrible spoof of an amazing franchise",
        "review_detailed_main": "I would highly recommend against watching this cringe fest, 80% of the jokes fell flat and made me just want to watch the proper Hunger Games again.\n\nA couple of the jokes were quite funny but it's one of those films that will become incredibly dated quite fast, I thought the main characters were extremely obnoxious and unlikable. I did, however, quite like Dean West's take on Seneca, he was probably the best acted of the lot. The music was terrible and the forced parodies of anything they thought would make them money is just plain sad.\n\n2/10: Very cringe worthy, reminded me all to much of the disastrous \"Epic Movie\" from 2007."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "roblesar99",
        "review_rating": "1",
        "review_title": "83 Minutes of Garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Snootz",
        "review_rating": "2",
        "review_title": "Consider the source material",
        "review_detailed_main": "I enjoy good parody. This is not good parody. However, consider the source material: The Hunger Games. That movie in itself wasn't exactly Oscar material.\n\nThis flick starts with a poor source to parody (although if you're going to parody... certainly parody a bad movie). It's like parodying people dying of cancer; it's just not likely to be all that funny.\n\nIn this case though, the jokes were crude, lame, gross and predictable. If your idea of funny is poo jokes and open running sores, boy are you gonna love this.\n\nSeriously, this is an entire film that resembles 3rd graders telling bad jokes. The sex references are simply crude, and the violence \"jokes\" aren't funny. It's just one really dumb skit after another with an ending as stupid as a... a... well as the writers who wrote this slop. One has to wonder how much weed they smoked to think this stuff was humorous.\n\nThis is a swing and a miss and dropping the bat in a pile of guano. (See what I did there? Bat? Guano?) Yes, this movie was just that funny. What we need is a spoof of this spoof. Or \"How The Starving Games Should Have Ended\"."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "judealexharnett",
        "review_rating": "1",
        "review_title": "Hahahahahahahagah",
        "review_detailed_main": "Most spoof movies are not funny. This was no exception. I have absolutely no idea who asked for a hunger games spoof movie, like it made no sense, but it was directed by the same people who directed epic movie so at that point you know you gotta have low expectations. Whatever low expectations I had they were not met irregardless. This was some of the most unfunny media I've consumed in a long time, maybe ever. I don't think I even smiled once during this whole movie. I was actually physically uncomfortable for most of this movie. I would not recommend this movie to my worst enemy, still better than the artemis fowl movie. 0.1/10."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "vincemusic",
        "review_rating": "3",
        "review_title": "This isn't the bad movie you're looking for",
        "review_detailed_main": "I'm a big fan of movies so bad they're \"good.\" But for me, this wasn't one of them. I've watched parody films before and I typically like them quite a bit, but for whatever reason this one left zero impression.\n\nI think the biggest problem I had was that I just didn't find the funny parts funny. They come off as slapstick and repetitive. I'm sure that's how it was intended to be but it just didn't seem to work as well as those types of jokes work in other parody films. The repetitive jokes went on far too long and weren't funny enough to be done more than once and none of the humor or story had much pay off.\n\nI love watching bad movies, but this was one that was just too unextraordinary to be worth it."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "phatworld",
        "review_rating": "3",
        "review_title": "It's great it was shot in LA",
        "review_detailed_main": "They could have embraced the badness. They could have used MST3K guys to narrate. Instead they tried to kinda tell a story via special defects, like old school after affects. The body paint was good, and the acting wasn't bad. Maybe it's used for something cool like money laundering breaking bad style...\n\n80% shot with extra queazy cam, at least through first half."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "susanafuentes",
        "review_rating": "2",
        "review_title": "Absolute Trash",
        "review_detailed_main": "It's not even funny. But what's laughable is the fact how terrible it is. Honestly, it's not worth it. Sexual Innuendos here and there, dumb references that are old. It's completely. At least I don't have to pay for this movie. If you're curious, I suggest you stay away from it!"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "suite92",
        "review_rating": "2",
        "review_title": "Brings new depth of meaning to the word inappropriate.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "rblaze6",
        "review_rating": "10",
        "review_title": "Goofy, Silly Spoof Movie",
        "review_detailed_main": "This is one of the best spoof movies I've ever seen. It's silly and even inappropriate in some parts, but that's part of its charm. Some of the scenes are hilarious and others are so pointless that they are funny on a \"turn your brain off and just be entertained\" kind of way. The storyline closely parallels the original movie with clever twists on the original scenes. Some of the acting is good, and some is so bad that it adds to the humor. If you're a Hunger Games fan and you're in the mood for some mindless fun, give this movie a try. You'll likely laugh at many scenes and cringe at others, but you might find it entertaining... in a 6th grade humor kind of way."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "face-819-933726",
        "review_rating": "6",
        "review_title": "Someone out there must have made an unreleased parody of Hunger games, and this is terrible parody of that.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "One of Hollywood's Mysteries",
        "review_detailed_main": "I could give this a 1/10, but why, I knew what I was getting into before I pressed play. These parodies are low-brow and largely unfunny. I watch just to see if somehow they stumble onto something funny.\n\nAllow me to sound like an old man for a second.\n\nThe parodies used to be watchable back when Leslie Nielson was the spoof king. Heck, they were good up to \"Scary Movie\" and \"Scary Movie 2.\" After \"Scary Movie 2\" it's been all downhill.\n\nAs can be gathered by the title, \"The Starving Games\" was a parody of \"The Hunger Games.\" Like all spoofs you get some other pop culture insertions in the movie as well. In this case there was LOTR, \"The Expendables,\" \"The Avengers,\" \"Avatar,\" \"Sherlock Holmes,\" Taylor Swift, Lady Gaga, Nicki Minaj, Honey Boo Boo, Tim Tebow, Siri, Skittles, Subway, and more.\n\nOne of the big failings with this parody and others is the copious use of CGI. It's made an already bad product worse. And maybe I shouldn't say that the CGI has made them worse, it's more like the discount brand of CGI they use has made them worse. I get it, they don't expect good returns on these movies anyway so they have to keep costs to a minimum. What I don't get is why they keep making them knowing that the movies will flop like a freshly caught salmon. Just another of the mysteries of Hollywood I guess."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "ancientscore",
        "review_rating": "1",
        "review_title": "Um... Burn it please",
        "review_detailed_main": "A true gag fest and is for those who enjoy the most raunchy of humor. Even for a spoof this is too much. If I could, 0/10 recommended. I will try to pry this goop of a nasty film from my brain to let other good spoofs and movies fill it. I will always try to forget it."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "randyjax-80651",
        "review_rating": "1",
        "review_title": "This ranks among the worst movies I've ever seen.",
        "review_detailed_main": "It's as if this movie was written by an alien who doesn't really understand the human concept of comedy. I've seen some lazy jokes, but this one takes it to a whole other level of awful."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "scottdavidsellers",
        "review_rating": "1",
        "review_title": "No...just no.",
        "review_detailed_main": "Probably the worst spoof movie I have ever seen. The jokes (if you want to call them that) fall flat each time and has a strong sense that the writers are the type of people who like to refer to themselves as \"random\". It's just \"joke\" upon \"joke\" with no respite between them. I know it's a comedy, but space the jokes out a bit more.\n\nThe actors in this movie must have been desperate to be in a movie."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "printing_um",
        "review_rating": "4",
        "review_title": "Funny but sometimes gross",
        "review_detailed_main": "This spoof of The Hunger Games is a good laugh if you have nothing better to do. I did not watch the original movie but did skim through the book on which it is based. Do not watch this unless you are willing to be disappointed at some parts. Not having watched the Avengers, Avatar and some of the parodied movies I could not understand some of the references, yet the movie can stand on its own. Overall it is watchable but sometimes the jokes fall flat. This is one of those movies people will watch in order \"to find out if it is as bad as people say it is\". Should one rent it to watch? The answer is NO. Watch if free. In short, it is watchable but just barely."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "searchersd",
        "review_rating": "4",
        "review_title": "Eh. Ha ha. Eh. Cringe. Eh. Eh. Ha. Zzzzzzz.",
        "review_detailed_main": "Only laughed at maybe 10% of the places where I was supposed to. I cringed at the others. Only see this \"spoof\" if you can't find anything else to watch. I rated it 4 stars because the actors at least tried. The writers didn't. Too bad."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "sandlot1992",
        "review_rating": "1",
        "review_title": "a Lousy yet Terrible Spoof Movie",
        "review_detailed_main": "I sat through an hour watching this on Netflix and it is yet to be the most terrible parody movie in recent years that something Mel Brooks or Jim Abrahams the director of Hot Shots! would have direct."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Silly but it was expected",
        "review_detailed_main": "This film is based on the Hunger Games. Unlike other previous parody films directed by Jason Friedberg and Aaron Seltzer, the Starving Games focuses on one main film with its typical insertion of pop culture gags and other popular Hollywood movies.\n\nStill the film really isn't funny and the jokes aren't clever or anything special but there were some positives.\n\nIt isn't as completely forced. The attires and outfits of the cast members do look well enough and the celebrity impersonators are good enough.\n\nMaiara Walsh is one of the bright spots as she is definitely engaging as the lead.\n\nThe Avengers spoof was mildly entertaining, as was the audience in the theaters watching the show and the two table broadcasters (mainly Cleaver).\n\nOverall the film isn't great but if comparing to other Friedberg and Seltzer films (Epic Movie, Disaster Movie, Meet the Spartans), it is better and shows an improvement."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "neacorp",
        "review_rating": "8",
        "review_title": "A fun ride if you didn't like the hunger games.",
        "review_detailed_main": "Yeah, it's not perfect or big budget super special effects, but it works, and works well on satirizing the plot holes of the original story. The humor is witty enough, but some of it is too 2013 only. It doesn't drag on with the setup and quickly goes straight to the game. Fun if you didn't like the hunger games.\n\nThe flow from scene to scene is good. The forest is an actual forest. The actors are having fun with their roles. Love the announcers, the blue guys and the pink lady. No joke overstays its welcome for too long, except for the small gag with the toilet humor, but it's only in two parts of the movie. Some hated memes get destroyed. It might not make you laugh, but it will make you smile.\n\nIf you are a fan of the hunger games book or movies, don't even bother, because you most likely don't have a sense of humor about yourself to enjoy this movie."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "ted-peterson",
        "review_rating": "7",
        "review_title": "Starving for some comedy. Here's an hors d'oeuvre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "kim100",
        "review_rating": "1",
        "review_title": "Mean and not funny",
        "review_detailed_main": "Difficult to believe a movie could be so bad. Meanness does not make for humor."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "jwlambert-13844",
        "review_rating": "2",
        "review_title": "This movie is a can miss",
        "review_detailed_main": "The only redeeming thing about this movie is the color commentator cleaver. This is disaster movie or date movie quality spoofage. I came in expecting setting a low bar for the film and this film is limbo dancing with the devil."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "martinevans-91195",
        "review_rating": "1",
        "review_title": "Rather burn your television",
        "review_detailed_main": "This isn't so much bad as insulting. Whoever funded this mess must have been trying to launder money.\n\nUtter cretinous writing. I've seen hospices that can generate more laughs."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "machrf",
        "review_rating": "1",
        "review_title": "How do you rate such an awful movie?",
        "review_detailed_main": "I suppose with how it left me feeling after watching it. The actors are not that bad considering they are spoofing the original and exaggerating everything. The problem is with the jokes and visuals are more offensive than funny. With all the adult material I cannot believe it received a PG 13. This is an R movie most definitely for the content. It shows that those in charge of the movie had no sense of good satire or the audience they were going for.\n\nThat is not to say they did not have their moments. Unfortunately, the good jokes were far and few in-between. It shows that they did have some good sense in humor although the rest of it was just pure garbage. They missed the mark completely in making this movie. This should have been an easy and simple satire to pull off. Instead, we got this mess."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "AngelHonesty",
        "review_rating": "4",
        "review_title": "It's a Jason Friedberg and Aaron Seltzer film at its Finest",
        "review_detailed_main": "Like all of Jason Friedberg and Aaron Seltzer films, its very over the top, down right stupid to the point of not being funny. And yet I find myself watching all of their movies. They are all made in the same style, if you've seen one then you know what you're getting yourself into.\n\nI honestly found this movie quite tame to the other ones that Friedberg and Selzer have made. I think what really helped the movie was the main actress, she was beautiful to look at and not bad at acting. I'm always curious at how they will mock other movies and what ones they will mock. The Starving games had a wide variety of famous films they picked on. Honestly, the movie is beyond dump and over the top, but, its something to waist time with that might make you smile or roll your eyes a few times. II's very simple as it was mostly all filmed in the forrest. They obviously didn't put much money into it. And it's rated 3/10 from 22k votes for a reason. But don't let that scare you from watching it, just be prepared for the worst."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "scraig-53917",
        "review_rating": "1",
        "review_title": "I Refuse to call this a Film!",
        "review_detailed_main": "As you have probably guessed by the title I would not consider this to be a film. Instead I shall refer to this as a Media File. This Media File is hands down the worst thing I have ever witnessed. This Media File has passed the point of being unbearable to watch, instead this broke new ground and was actually painful to watch. Every \"Joke\" every scene added to the pain of this experience. Your all probably wondering \"Why is it so bad?\" Well, let me tell you why. To start with, the writing in this Media File, is as expected, terrible, there is no semblance of character, theme, development or any other element of a screenplay that makes a Film what it is. Instead this is just a collection of dated pop culture references, tasteless humor and jokes so bad that even Adam Sandler wouldn't write them into his next Grown ups movie. The Cinematography is non existent, it was so horrendous that it physically hurt to see. I noticed streams of liquid going down my face at one point during the film, this is when I realized, I wasn't crying, instead my eyes had began to bleed. The acting in this movie was also trite, a third grade production of Hamlet would be better acted than this. My personal theory for the acting being this bad is, that they found people with serious mental issues, and cast them as the roles in this film. The directing goes without saying, it is horrendous. The director is possibly the reason all of these problems have occurred, unless everyone involved in this film is as mentally inept as the director. Jason Friedberg and Aaron Seltzer are the directors and writers of this Media File. Unsurprisingly, their other film-making achievements include, Vampires Suck, Epic Movie, Date Movie, Meet the Spartans and the infamous Disaster Movie. I have seen only one of these films, that being Vampires Suck. I also did not like this movie, however it was infinitely better than this monstrosity. I would urge everybody to stay away from this Media File, avoid it like the plague, if I could rate this movie lower than one star, I would."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "zianimustafa",
        "review_rating": "4",
        "review_title": "a nice movie but not that funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "gluonpaul",
        "review_rating": "2",
        "review_title": "Terrible, unimaginative and has one funny joke... but it is a good one.",
        "review_detailed_main": "So this is replete with examples of other movies parodied in the most obvious and boring way imaginable. Most of the jokes rely on gross out humour and I guess \"hey I remember that better movie they are referencing\" humour?\n\nAnyway this is not funny, quite boring actually. The actress is pretty and not a terrible actress and this has one good joke with a parody of Chuck Norris in but I will admit that one actually gave me a belly laugh. All of the rest of the jokes fall flat though and I wouldnt recommend sitting through the whole movie for that one joke. Avoid."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "westsideschl",
        "review_rating": "8",
        "review_title": "A Parody Appropriate for it's Source Material",
        "review_detailed_main": "One of the main criticisms of this parody/spoof is that it is of low quality, but to me I found it spot-on appropriate given it's source inspiration. \"The Hunger Games\" is written with plot & dialogue for the broadest marketable audience - functioning 9-10th grade literacy (even with aging unchanged decades later). \"Starving\" exposed all the dialogue, acting, set and action sequences for what they were - improbable dumbness. \"Starving\" even tossed in a few gibes at similar audience favorites, e.g. \"The Expendables\" super badasses, Marvel superheroes and Taylor Swift, Potter and more in their equal opportunity funning. The cross media \"Angry Birds\" and \"Fruit Attack\" turned reality app attacks were a total-hilarious surprise. There is the basic slapstick improbabilities (breadstick arrow); the brief crudeness (a streaker). But, most poignant, in a \"Daily Show\" way of exposure, is Starving's behavior burlesques of the whole \"Hunger\" milieu - the hunt & kill sequences, the cameras, the basic scientifically impossible dome with it's computer controlled environment. The pun work was spot-on or should I say \"Kant-miss\" on \"Every-shot\".\n\nSo, \"Hunger\" fanatics, watch this great parody to see \"Hunger\" for what it is."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "nicholasboulay",
        "review_rating": "7",
        "review_title": "Exactly what it looks like",
        "review_detailed_main": "I review a lot of movies but don't write a lot of reviews. But I noticed this was severely underrated. The movie is a parody to the hunger games and it's funny and it's the perfect low budget movie. This is the type of movie that just doesn't leave you thinking about it later and that's completely fine. Enjoy the moment it's a fun movie to watch."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Amazing_Wizard",
        "review_rating": "8",
        "review_title": "A solid effort, with lots of great gags",
        "review_detailed_main": "Firstly, there is a sex scene in the middle of the film which ruins it. Up until this scene, i was planning of loaning the DVD to my brothers and sisters who love the Hunger game films. I cannot do this now. This is not a film to watch with family because of that scene.\n\nWhich is sad, Because for the most part, this is a cleverly written parody with some great gags. It surpasses the last few Scary Movies and Haunted House film which all got cinema releases and is the best of the straight to video releases ever made.\n\nHowever many of the jokes are topical and based on cultural references which means it wont work for too long. In five years time for example, most the references will be outdated and subsequently the film will not be as funny. Scenes involving the Expendables, Avengers and pop stars will age quickly. I recognised a joke parodying the Sherlock Holmes films which not many others will get or understand. I applaud them for not telegraphing the reference and trusting their audience with knowing what it was parodying. But it is a gag that will be less understood the further we move away from its reference material release date.\n\nThere is a minor reference to a gay relationship but it doesn't last long or dwell on it. A couple of deaths were rather gruesomely visual which may be a problem to some viewers. But my main issue was the sex scene as previously mentioned.\n\nIt doesn't outstay its welcome at 80 minutes but still feels long enough to be happy with. I will happily watch it again and the writers did a great job in a genre often tarnished with toilet humour. Other than the one scene, it had very little of that in it, and featured mainly higher quality jokes.\n\nI strongly recommend watching this film, especially if you like the Hunger Game films, or parodies in general. But it earns the 12 rating it got for a reason so know this going in.\n\nI hope the writers continue making films like this, and preferably original parody moves (not based on cultural references) also."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "TheBareWoods",
        "review_rating": "7",
        "review_title": "Well acted and humorous low budget effort.",
        "review_detailed_main": "Actor Maiara Walsh was especially effective as Kantmiss Evershot, and the rest of the cast was obviously having a great time and it showed. This is a low budget film, but had many good qualities. The filming itself was generally professional, the creativity unique - with a variety of off-beat comic inclusions that I found absurdly funny.\n\nI did roll my eyes a couple of times, but I think that was expected as the writers and director obviously wanted this taste of absurdity in the film. The soundtrack was not intrusive, sound effects well done and overall very appropriate for this style of film.\n\nNot up to Monty Python standards, but still well done. I have to give a nod to Kennedy Hermanson, Lauren Bowles, and Cody Christian for putting a full measure of soul into their characters. As an amateur film-maker myself (The Parchene Conspiracy), I can appreciate the effort all the cast and crew put into this production and anyone who goes into this film with light-hearted expectations should enjoy the content."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "mdmascaroauthor",
        "review_rating": "10",
        "review_title": "To each his own..",
        "review_detailed_main": "I thought it was hysterical. Don't hate. I don't watch spoofs as a rule so I have nothing to compare it to but it made me laugh on a night I really needed it. The production wasn't Industrial Light and Magic but I thought they did a great job, the writing was funny, and the actors were good. I wish I'd been an extra in this film; it would have been fun."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "ecogirlveghead",
        "review_rating": "7",
        "review_title": "An Amusing Spoof for the Most Part",
        "review_detailed_main": "I watched this spoof of The Hunger Games with no expectations or preconceived ideas of what it should be like. And I enjoyed it! Not every joke hits the mark but for the most part its kinda funny, kinda silly, and mostly harmless.\n\nMaiara Walsh does a good job imitating Jennifer Lawrence and has nice comic timing of her own. Diedrich Bader, who I never could stand watching on the Drew Carey Show due to his general lameness, plays an amusing President Snowball, a parody of The Hunger Games' President Snow. He doesn't bother trying to imitate Donald Sutherland and as a result comes off kinda funny.\n\nThere's a slow, odd, and unfunny sex scene with LOTR characters thrown in that really didn't fit and I fast forwarded through most of it.\n\nThese kind of parodies require one quick gag after another in order to keep us watching and for this most part this one succeeds. Worth watching if you have a Saturday afternoon to kill."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "m-31912",
        "review_rating": "10",
        "review_title": "Laugh and laugh until you choke",
        "review_detailed_main": "The whole movie is a joke and meant to be bad. Which is why I think 3.2 for a movie like this is very low. At least a 6. But for me I am a fan of this. At first I was getting board until they begin throwing their cards. They were so unexpected to the point I had to pause for 3 min to breathe. It almost killed me from laughter. Sadly it didn't stay that funny till the end. Some parts weren't that funny. And some parts were really unnecessary. But still it was really good. I wanted to give it a 9 but seeing the bad reviews I gave it a 10\n\nWhen I saw the rating I really thought the movie was bad. Sadly it isn't. Please give it a try. Wait for like 10 mins before you begin judging."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "Erik_Stone",
        "review_rating": "7",
        "review_title": "Silly, fun, and better than \"Hunger Games\" by far",
        "review_detailed_main": "It has parts that are just dumb and not that funny, but some parts are really funny.\n\nIf you really thought \"Hunger Games\" was awful, and you like standup comedy, this is worth the watch and you will enjoy it."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "stholmes-65685",
        "review_rating": "9",
        "review_title": "So awful it is good",
        "review_detailed_main": "I think the best thing about this movie is that the actors seem to be completely dedicated to making this an irreverent mockery of the original. Starving Games keeps the same rough outline as the hunger games while dropping a few references in from other movies, and has the usual mix of idiotic jokes, occasional clever humor and generally the more intoxicated you might be, the more you will enjoy this.\n\nThis is not meant to be Titus, the GodFather, or GWTW, this is a ridiculous spoof by actors enjoying themselves, and is one of my favorite wastes of about 90 minutes.\n\nIf you are looking for serious acting, or originality, pass this by, it is not meant to be these things. If you want a bumbling waste of time to leave a smile on your face, and kind of clear your head of any serious thoughts, but want to keep clear of some of the worst of the spoof series, this rates near the original Scary Movie I, II, levels of humor in my opinion. I'll admit I occasionally skip a few scenes that get old after the first time or two, but this is one of the few spoof movies in the past twenty years that genuinely made me laugh.\n\nIf you're stuck home in bad weather, can't get out and are looking for a quick cheerup to pass the time, I would highly recommend this movie."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "tommyaasum",
        "review_rating": "7",
        "review_title": "This movie is the funniest thing to watch blazed",
        "review_detailed_main": "I loved it. It's terrible, awful even. But amazing for how instanely stupid the skits are. I love watching these people suffer it's funny. Kinda cringe at other times but that makes it funnier in my opinion."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "my_perfect_mistake",
        "review_rating": "10",
        "review_title": "Good for a few laughs...that's what it's all about, right?",
        "review_detailed_main": "Crude, juvenile humor perfect for a ho-hum weeknight. This is not humor you need to think about, which is exactly the point if I'm not mistaken. You really, REALLY do need to see the original Hunger Games to understand the jokes, though, which I think is the problem with many of the bad reviews. The people who come here to rate this flick with 1 star and proceed to type 10 or 12 paragraphs detailing all the reasons and every scene why they thought is was \"so bad\" either don't have a sense of humor, are to intellectual to allow themselves to \"get\" the humor or haven't seen the original movie the spoof is based on. This is low brow, gag comedy, folks. Don't compare it to Shakespeare! Enjoy it for what it is!"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "deeznutsbelongme",
        "review_rating": "7",
        "review_title": "\"I want this backpack!\"",
        "review_detailed_main": "As a 14 year old, I'm a huge parody fan. My top favorites are mostly Mel Gibson films (Spaceballs, Robin Hood:Men In Tights). I get why most adults wouldn't find this very funny, and I honestly think it's meant for a teen audience to find the comedy in it. This movie was pretty funny, not in my top 5s but probably at bottem of my top 10s list. Most of the jokes weren't as funny, but I ended up have a quite a few good laughs."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "tm-timcronin",
        "review_rating": "8",
        "review_title": "Jokes are layered for celebrity geeks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "pishilis",
        "review_rating": "8",
        "review_title": "Funny, and thats the point!!",
        "review_detailed_main": "I have read all three books of Suzzane Collins and I liked them all. But on the same time I liked this movie which someone can say that it makes fun of the book and the Movie.\n\nI saw this on a trailer, and Immediately I knew that it should be a stupid-funny movie. And that's exactly what it was about! That's why I give a good voting! Doesn't mean its a disrespect for the book as I read from others.!\n\nThere lots of moments of lots of laugh for me. Lot of random things that make you laugh!! It made my day:)I can even say that I liked this movie more than Hunger games and Catching fire, why? because on this too books, I expected like a copy of the book, and every little change from the original was bad for me, but now, I knew that they gonna have lots of differences, so I quite enjoyed it more!\n\nP.s The actor that plays Katniss, is prettier than the one playing in the hunger games and caching fire.!"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "joaombento",
        "review_rating": "10",
        "review_title": "Funny all the time.",
        "review_detailed_main": "Wonderful movie. Usually I'm very critic and don't find most comedies amusing. I loved this movie. I'm also very fond of Maiara Walsh specially in this movie. It helps ... ."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "stkilda-34404",
        "review_rating": "6",
        "review_title": "Typical Spoof Movie",
        "review_detailed_main": "I think it had all the elements that make a spoof movie good.\n\nI gave it a low score because I didn't laugh as much as I have in other spoof movies.\n\nI believe that all the main characters were cast perfectly, and they did contain enough relevant pop culture references.\n\nIt stayed true to the formula that most if not all spoof movies follow and if you are a fan of the spoof movie genre then I a sure you will enjoy this movie.\n\nNot as good as some in the genre but not the worst I have ever seen either and if you enjoyed movies such as Epic Movie, and Not Another Teen movie then you will definitely enjoy this movie."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "e-26956-58625",
        "review_rating": "10",
        "review_title": "Great for a spoof",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "tomhr",
        "review_rating": "10",
        "review_title": "ROTFL-funny like \"Airplane,\" but with kids killing kids",
        "review_detailed_main": "This movie is hilarious, every second. The more you know about the Hunger Games book trilogy, and the 2012 Hunger Games movie, the more you will laugh. The actors whom they got to impersonate Effie Trinket and Seneca Crane look like the originals."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "shanetodd43",
        "review_rating": "8",
        "review_title": "Happily surprised",
        "review_detailed_main": "So it's a Friday night during lockdown here in the Uk, a year odd into the world pandemic and I see this movies on my tv . I had never heard of it before and as every other channel was full of repeats I flicked over......and with in seconds I was laughing out loud . It's total nonsense but perfect viewing for me at this exact time . Ive seen a few of these parody movies over the years that just sucked but this one I honestly found totally silly & funny. A perfect movie for me at the perfect time . Thanks"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "JayPatton88",
        "review_rating": "10",
        "review_title": "Hunger , Starving",
        "review_detailed_main": "These games were better than the hunger games , their salute said it all! I cried,,,,,,, laughing!"
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "grochomarx2002-953-297125",
        "review_rating": "8",
        "review_title": "Actually a pretty good parody of \"The hunger games\".",
        "review_detailed_main": "In the style of \"Airplane\" The starving games is a broad parody which throws every joke they can at the screen and hopes that at least a few of them work.....and for the most part they do. This is a laugh a minute movie which actually stays fairly honest to it's original source material. It is not for everybody, but if you enjoy goofy parodies of movies then this one is worth seeing. The cast is strong, the dialog while a bit crude at times fits the scenes, and it is paced well and builds to a worthwhile , ( and expected,), conclusion.\n\nYou could make a movie far worse than \" The Starving Games\", but it would take some real effort to make a low budget flick better than this little gem. Forget the negative reviews and add this flick to your weekly rental list...you will be surprised and glad that you did."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "gianmarcoronconi",
        "review_rating": "9",
        "review_title": "Not so good",
        "review_detailed_main": "A movie as beautiful as it is funny that has only and only useless and senseless scenes with a few really funny parts, for the most part it is boring. So in conclusion it is the usual parody seen and reviewed."
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "temmieflakesrgood",
        "review_rating": "10",
        "review_title": "Bible quote in the background of the cheering scene",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "dreyproducts",
        "review_rating": "10",
        "review_title": "Wildly hilarious spoof comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "wbraffman",
        "review_rating": "10",
        "review_title": "Review bombers are haters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "manizeh-78126",
        "review_rating": "",
        "review_title": "I'm sick to the stomach",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2403029",
        "movie_name": "The Starving Games",
        "movie_rating": "3.2",
        "review_username": "manizeh-78126",
        "review_rating": "",
        "review_title": "I'm sick to the stomach (Part 2)",
        "review_detailed_main": ""
    }
]