[
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "moviewizguy",
        "review_rating": "3",
        "review_title": "An improvement on the previous spoofs, but not saying much",
        "review_detailed_main": "Becca, an anxious, non-vampire teen, is torn between two boys. Before she can choose, Becca must get around her controlling father, who embarrasses Becca by treating her like a child. Meanwhile, Becca's friends contend with their own romantic issues – all of which collide at the prom.\n\nVAMPIRES SUCK will surprise many people because it's an improvement over the previous spoof films directors Jason Friedberg and Aaron Seltzer have been churning out for the past couple of years. However, that's like saying it's the better crap of all crap. The jokes still aren't funny and the filmmakers still don't realize the difference between satirizing and copying. But I would be lying to myself if I said I didn't find some good that came out of this film because there are some improvements.\n\nFirst of all, the performances are great by the two leads. In her first film, Jenn Proske does a dead on impersonation of Kristen Stewart. However, it's sad to see her in this because I think she's better than this. Matt Lanter also does a great impersonation of Robert Pattinson in his \"pain\" look. I don't know what made Ken Jeong come aboard the film but he's basically playing the same character in THE HANGOVER. He's not in the film that much, though. Also, I think it's pretty great that Carmen Electra isn't in here and I'm sure others will agree.\n\nThe second obvious thing that stuck out to me was that the film focused on only the first two TWILIGHT films. The filmmakers finally learned that spoofing 600 movies is a bad thing. Saying that, the film still does have the many pop culture references, some too random to comment about. Fortunately, they really did tone it down quite a bit compared to the previous films where you get one every five seconds. You probably get one every five minutes here.\n\nI also liked the fact that it looked like an actual film because if you saw MEET THE SPARTANS and DISASTER MOVIE, you'd know the films were filled with shoddy sets made up in ten minutes. In here, you might question if they stole the sets and locations from the TWILIGHT films. I don't know if this counts as something good but I really think the film manages to create a decent storyline from the first two TWILIGHT films.\n\nOverall, the film is still bad because it's rarely funny, although I will admit I laughed at some bits that took a jab at the TWILIGHT series. If the story is better than the jokes itself, you know you got a bad comedy. It's an improvement from the last few spoof films, but that doesn't say much. I really don't recommend seeing it at all. If you must, just rent it on DVD that will inevitably come out a month after the film is released."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "DonFishies",
        "review_rating": "2",
        "review_title": "Further proof why Jason Friedberg and Andy Seltzer should stop making movies",
        "review_detailed_main": "Jason Friedberg and Aaron Seltzer are the single worst filmmakers currently working in the realm of mainstream cinema. This pair of writers/directors is responsible for single-handedly destroying the parody genre. I consider their third film, Meet the Spartans, to be the single worst movie of the last decade – one which gave us a dozen well known and lesser known treasures by Uwe Boll. But where Boll shows ambition and dare I say, \"style\", Friedberg and Seltzer exhibit laziness and a lack of purpose. These two hacks throw in dated pop culture references and steal the work of others, and seem to get away with calling it comedy.\n\nIt is funny to note then that their first movie in two years, Vampires Suck, is a parody riffing on the Twilight series. The duo gleefully crib from Twilight and New Moon, providing us with the tale of new girl Becca (Jenn Proske) who falls in love with the vampire Edward (Matt Lanter), and all the problems that come with their newfound romance.\n\nMy immediate question, before even beginning to try and discuss this waste of time, is why did Friedberg and Seltzer ever think it was a good idea to make a parody of the Twilight series? The films are unintentionally hilarious as it is. And True Blood has been on for three seasons now, and for all intents and purposes, it is merely a darkly satirical and much more adult version of Twilight. So right off the bat, these two brilliant minds are mining at something that has already been done. I guess it was money, but who would knowingly believe Twilight fans would rush out to see a movie bashing their beloved franchise much less the haters who would not be caught dead seeing the film as it is?\n\nIt just seems overly baffling to me, what could possibly have made anyone think this film is a good idea. It recycles the unintentional jokes from the series, and packages them in a way that either rips them off lightly or just come off as not being anywhere near as funny as they were before. I chuckled at a few parts here and there, but they were only mild chuckles. There is nothing inherently funny or stands out as being hilarious at any given point in the film. Perhaps Friedberg and Seltzer are laughing – but no one else is laughing with them. I had the good fortune of not having to see this movie in a theatre, but I can imagine the film's showings are silent enough that the filmgoers can hear the projector whirling more than they can hear anyone laughing.\n\nI will give credit however in the fact that unlike their previous atrocities and crimes against cinema-goers all over the world, Vampires Suck does not deviate from its riffing of the Twilight. Characters still make dated pop culture references (is anyone in five years even going to remember The Kardashians? I barely know who they are now), but no one from other films is just thrown into the film at random. The film never stops to suddenly jump into making fun of another film or franchise (outside of a total throwaway blink-and-you-will-miss-it gag involving Alice from Alice in Wonderland). It stays consistent throughout, and to me, suggests a minor development of maturity on the parts of the filmmakers. Or of course, they realized there was nowhere they could possibly throw someone like Justin Bieber or Cobb from Inception, and not confuse the audience even more than they like already are.\n\nBut this consistency comes with a price. Instead of whipping by, the film runs at an incredibly slow pace. I fell asleep twice, and somehow barely missed anything. They do a fairly nifty job of condensing the first two films, but it seems like they did not do nearly enough editing and whittling down. The film easily could have felt a lot faster paced, but it stalls a bit too much in almost every scene. And for a film that runs less than eighty minutes, it speaks a lot for what these two filmmakers were trying to accomplish or even what they wanted to show. If they cannot answer that simple question to the filmgoing public, then what is the point of even making movies in the first place?\n\nYou will need to sift through the increasing amount of junk and waste in Vampires Suck, but Proske is actually fairly good in her role (her acting debut, sadly). She has the Kristen Stewart impression and mannerisms down perfectly, and she almost came off as a better Bella than Stewart ever has. She also has a commanding aura about her, which suggests she is in store for much greater work in the future. As long as she runs away from everyone involved here, I am sure she can prove this soon enough. Unlike her, no one else even remotely stands out or is even half decent in the cast (Ken Jeong and Diedrich Bader go to complete waste in supporting roles). They all just go through the motions, and are just as lazy and half-assed as everyone else. But then, why should they bother if the filmmakers do not even try?\n\nDespite being a lot more balanced than any of their brethren, Vampires Suck is still an awful and truly unfunny film that only further proves the point that Friedberg and Seltzer need to stop making movies. Even with a great lead, they still manage to botch the making of this film and still suffer from many of the problems their earlier films were plagued by. Years from now, will anyone even remember these films? Better yet, will anyone want to remember these films?\n\n2/10.\n\n(This review also appeared on http://www.geekspeakmagazine.com)."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sonicingandentering",
        "review_rating": "4",
        "review_title": "Has potential, but fell through",
        "review_detailed_main": "Vampires Suck! is the latest film from those who brought you the Scary Movie series. That being said, I already had fairly low expectations. If you absolutely despise Twilight, like I do, you will probably find this laughable, like I did. In the movie by itself, there were a few jokes that gave chuckles, but very few. Now as a spoof of Twilight, this did quite well. I have had the painful memories of having to actually watch those \"films,\" and of the events that happen in the first two, Vampires Suck went over nearly all of them and exposed the ridiculousness of them. This is really the only redeeming factor that Vampires Suck! has. All in all, give it a try if you hate Twilight, otherwise, stay far away. Don't even rent it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "bebromana",
        "review_rating": "5",
        "review_title": "A B Movie. A Twilight spoof, good for seeing with a crowd.",
        "review_detailed_main": "I saw this movie at a Halloween Party. By no means is this movie great art, but those of us watching had a few good laughs at this skewering of the Twilight saga. Pretty good performances from the leads. I thought the actress playing Becca was particularly good. Great Bella Swan impersonation. The script and production values were definitely B movie level. As long as you're not expecting too much, this is a light, frothy movie to see with your friends on Halloween. It's a bit like reading a trashy novel at the beach."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "shadowbender626",
        "review_rating": "",
        "review_title": "It ain't That Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "xHeffalump",
        "review_rating": "1",
        "review_title": "'Vampires Suck' ... SUCKED!",
        "review_detailed_main": "So far, the Twilight films have been extremely disappointing and they have all received pretty low ratings from me. I decided to check out Vampires Suck, thinking it would be a good laugh. Unfortunately, I could count the amount of times I laughed on one hand.\n\nThe film was full of cheap gimmicks, badly written lines that were not even close to being funny and actually, much like the Twilight films themselves, terribly structured with mass chunks of uneventful time filling.\n\nThe lead actress is a fantastic Kristen Stewart impersonator - literally every twitch, facial expression and bodily movement is spot-on. Even her voice is extremely similar! Having never seen her in anything else however, it remains to be seen how far her acting skills actually stretch.\n\nThere is really nothing much to comment on, simply because there was nothing in the film that was really worth noting. Don't bother seeing this one - simply AWFUL!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Princess_Nuala23",
        "review_rating": "1",
        "review_title": "I felt like I was sitting through the first two twilight films again but with more CRAP added in",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "StephenReviews",
        "review_rating": "1",
        "review_title": "I had the unfortunate pleasure if seeing this early...",
        "review_detailed_main": "...thankfully for free. This movie is BAAAD! They even had the guts to show all the \"highlights\" (if there were any) in the trailer. Don't be fooled by the name, this is one of those \"Movie\" movies (Disaster Movie, Epic Movie)! They clearly changed the name because the series got a bad name from being name some of the worst movies of all time.\n\nNow, on to the movie. I didn't laugh. There's no original story. There really is nothing more you can say about this. It's just bad. Really, really bad. There is no acting, they just said what they were told to say.\n\nYou honestly have to have to sense of humor of a 7 year old to find this rubbish funny. One other thing that really bugged me was the stock sound effects like the \"Howie\" scream and the Woman scream, both of which are burned into the brain of movie lovers and whenever one hears one, it feels like salt on an open wound.\n\nDon't watch this movie. It's so, so bad. I'm honestly speechless that it's so popular at the moment. It's just so hard to describe how bad. Maybe if someone made you eat some really gone off eggs again and again, that might just come close to how bad this is."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "DICK STEEL",
        "review_rating": "1",
        "review_title": "A Nutshell Review: Vampires Suck",
        "review_detailed_main": "I wouldn't have watched this if not for a friend who wanted to catch a comedy together, though I must admit I'm still pretty intrigued and amazed at how writer-directors Jason Friedberg and Adam Seltzer managed to continue get money thrown at them to make terrible, unfunny comedies such as sub par works like Meet the Spartans, Disaster Movie, Epic Movie and Date Movie, the last which to me was mildly amusing. Gone are the days of the Zucker brothers, and now we're stuck with low-brow efforts like what Friedberg and Seltzer continuously dish out, setting their sights at whatever's popular genre at the moment.\n\nAnd that of course is the phenomenon we call Twilight, where it's already three films old, and taking its cue from the Harry Potter franchise, decided to split its last book into two films, done squarely for profits. Poking fun at something popular is expected, but to do so in the Friedberg-Seltzer fashion just reeks of desperation. They seem to throw anything and everything into the film, without even due consideration if it's funny, or not. There are plenty of sight gags, innuendos, and just plain badly designed scenes that don't flow from one to another, making it look like a series of school children skits that got strung together, hammering wooden pegs into rounded holes, and jokes that's 99% bad, you'll find more pleasure from experiencing long nails clawed against a chalkboard.\n\nEven more curious is the demographics out to support / watch this film. As I was understandably surrounded by women of all ages who turn out in droves to watch the Twilight movies, I was again equally surrounded by the same demographics for this one in a near full house. Clearly, I don't think they're that vacuous to, for a moment, think that their highly anticipated sequel film had arrived, or even remotely suspect that this is a companion film. I suspect though that for all the spoof movies out there, there's always a great chance that the impersonators of their favourite yummy characters will look equally yummy. Sorry to burst your bubble, but Matt Lanter as Edward Sullen is miles away from Robert Pattinson as Edward Cullen even though both cannot act, and Chris Riggi as Jacob White is not Taylor Lautner as Jacob Black even though both share equal number of pronounced abs (hmm... maybe this could be a reason, Team Jacob was actually out supporting this?).\n\nThe only thing that was the rare shining light in this film, happens to be Jenn Proske as Becca Crane, who did an awesome job impersonating how Kristen Stewart would play Bella Swan, down to all the subtle nuances that if Stewart decides to leave her role, then the Twilight producers can plonk Proske right in. It's really uncanny watching her ham up the Bella spoof, but do note that I'm not praising her performance either as she's just carbon-copying what another actress had done, although pitch perfect.\n\nI did laugh out loud here and there, but it's laughing at the film in how it got away with the stupidest of jokes and the absurdity at who this project could have been green lit by a Hollywood studio (says a lot, doesn't it?) I hope Friedberg and Seltzer either learn from the best in the comedic business, or quit filmmaking altogether. Vampires Suck sucks. Period. And I'm just feeling dirty having to recount what I had watched, and to craft a review for it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sieb66",
        "review_rating": "1",
        "review_title": "As \"Comic Book Guy\" Would Say:",
        "review_detailed_main": "\"Worst... Movie... Ever!\" This one makes \"Meet the Spartans\" look like frikkin' Ben Hurr.\n\nI always felt like having a good sense of humour (even in those \"crappy\" films I can trap myself having a giggle or even laugh, out of \"place-exchanging shame\"), but this was just sad and painful. Laugh-count: 0 (with a capital \"Z\")\n\nAnd keep in mind that my expectations couldn't have been lower to begin with. But sometimes I can amuse myself with a terribly bad film. In this case curiosity, DID kill the cat!\n\nOh... Wait! Come to think of it, I stand corrected: I find Segways pretty ridiculous and funny just by plainly looking at it, ...so make it a half a giggle.\n\nAvoid!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "davewriter2003",
        "review_rating": "9",
        "review_title": "Giving \"Twilight\" the treatment it deserved!!!",
        "review_detailed_main": "Normally, I don't review movies on here, but when I read everyone else slamming this movie, I thought maybe they should get the perspective of someone who enjoyed it.\n\nAs a non-Twilight fan (haven't read the books and don't wish to for reasons to numerous to mention), I was determined to see this movie at the time when I wanted to tease a Twi-hard that I personally got to know from my disability social group about it. She refused to see this movie simply because they make fun of Twilight and Buffy, which motivated me even further.\n\nFirst off, yes, there were a lot of corny sex jokes, fart jokes, pop culture and celebrity references that many reviewers said wore out their welcome with projects like Epic Movie and Meet the Spartans. That may be true, but think about this for a minute. We are talking about a franchise that has spent 500 or so pages going on and on about Edward Cullen's \"great\" looks, using every descriptive synonym known to man, resulting in the most annoying teenyboppers since Benji and Joel Madden put the oh-so-overrated Good Charlotte on the music map, them and the Jonas Brothers. Ask anyone who has hated the Twilight series from the start, or started to hate it once they got through their Twilight-gushing phase (in other words, they grew up and developed literary taste!) Neither the books nor the movies deserve even a quarter of the recognition they got, because all the people behind it want you to focus on is how a naive, despairing, depressed girl who doesn't know what she wants getting into a love triangle with a fairy vampire and a werewolf. That and how gorgeous Robert Pattinson looks in his sparkles and pale makeup, and the same with Taylor Lautner in his shirtless scenes. The result: hordes of groupie girls going so far as to unrealistically want to have Edward Cullen and Jacob Black's children, despite the fact they are fictional characters. It's ridiculous and absurd, to say the least!\n\nThis is why \"Vampires Suck\" can be halfway appreciated. You can easily laugh at the jokes in this movie because even those who hated it know that this highly overrated saga had this coming all along. And for the aforementioned crimes that this literary atrocity committed, the Twilight saga got the bashing and ridicule it so richly deserved.\n\nSo if you disliked it the first time because it made you think of the unfunny torture you experienced after flops like the Scary Movie franchise after the first movie, Disaster Movie, Date Movie, Epic Movie, Superhero Movie, and so on, I challenge you to watch this again when it comes out on DVD, and think about what the \"Twilight\" saga has done to the worlds of both literature and cinema. I guarantee you'll developa new appreciation for this particular one."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "cricketbat",
        "review_rating": "6",
        "review_title": "I'm not proud of it, but this movie made me laugh",
        "review_detailed_main": "Maybe it's just because my expectations were so low, but I didn't hate Vampires Suck. In fact, I found myself laughing more than I thought I would. Jenn Proske nails the awkward, mumbling performance of Kristen Stewart and the pot shots at the Twilight franchise feel absolutely justified. It's a completely stupid parody and only a fraction of the jokes land, but, as strange as it sounds, I liked this movie."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "staunton-gary",
        "review_rating": "5",
        "review_title": "I love a spoof",
        "review_detailed_main": "A good spoof will make it a laugh out loud experience, unfortunately, this isn't one of them. There's a few times that I let out a \"ha\", one particular scene I managed three of them."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "It had a few one liners that made me chuckle, but that was it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "DanBalhatchet",
        "review_rating": "4",
        "review_title": "Improved... But Still Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "claudio_carvalho",
        "review_rating": "4",
        "review_title": "A Silly but Funny Spoof of \"Twilight\" and \"New Moon\"",
        "review_detailed_main": "\"Vampires Suck\" is a silly but funny spoof of \"Twilight\" and \"New Moon\". The writers and directors Jason Friedberg and Aaron Seltzer made a parody of practically every important scene and dialogs of the stories of Stephenie Meyer. If the viewer likes this type of joke and sees the movie with low expectations, he or she will probably enjoy \"Vampire Sucks\". The name of the town, Sporks, means a hybrid form of cutlery with the form of a spoon-like shallow scoop with the addition of three or four tines of a fork; therefore another hilarious joke with the name of Forks. My vote is four.\n\nTitle (Brazil): Not Available"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "h_wilson92",
        "review_rating": "1",
        "review_title": "Epic Fail",
        "review_detailed_main": "I have no idea why I went to see this movie when the makers of this movie Friedberg and Seltzer keep making awful movies.I think the reason is because i wanted to give them a chance but this movie was an epic fail.One thing I realized is that Meet the Spartans and Epic Movie are both in the IMDb bottom 100 and I wont be surprised if this one makes the cut to the bottom 100.The only scene I liked was the BEP part and thats all.I feel like I got ripped off.It was so lame! Vampires Suck achieved its goal when you read the title - it sucked! I am a Twilight fan(but not a huge fan) and I don't think they even watched the Twilight movies.This movie is a good way to cash in the money from the Twilight haters.I reckon that Friedberg and Seltzer make much worser movies each time.I really wanted to give this 0 stars out of 10 but that isn't possible.So I think i am being generous with the 1 star rating.Don't see this movie you will truly regret it.By far the worst movie of 2010.\n\n1/10 is my rating"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "captivatingobsession",
        "review_rating": "1",
        "review_title": "seriously a big fail and made respect the real movies twilight",
        "review_detailed_main": "seriously awful movie thought the main actress doing Bella is really great honestly but the movie sucks big time and failed to make me laugh but in one particular scene i don't even know why but i felt like really embarrassed while watching and seriously they made me respect the twilight movies a lot better cause they prove that there can be worse than twilight\n\ni remember me an my mom watching scary movies and laughing our guts out without losing respect of the actors or movie ,but i just couldn't even finish vampire sucks cause it was pretty lame and even not that funny BASICALLY a waste of time people"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "lollipopqueen10",
        "review_rating": "1",
        "review_title": "This Movie Sucked More Than the Vampires.",
        "review_detailed_main": "Wow, this movie was really dumb. I saw it at a local theater in which tickets cost $5 on Mondays, and I'm sorry I wasted what few dollars I spent. There were probably, 6 funny parts in the entire movie, 4 of which were in the movie trailers. Most of the \"humor\" was very crude, and had to do with body parts (personal) or ripping limbs off each other. And, they played up certain \"funny parts\" over and over again until you were sick of seeing it. The film makers could have done so much more with this. Now, you can expect spoofs to be dumb, which this was, but I feel the actual Twilight movies were funnier than this spoof."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "freaky_dave",
        "review_rating": "3",
        "review_title": "This movie pretty much sucked",
        "review_detailed_main": "Vampires Suck really sucked. I mean for real. This movie for the most part was ineptly made. A few scenes worked, but for the most part most of them failed horribly. I did like the Black Eyes Peas scene and the fight in the beginning between the guy in the wheel chair and the father. There were a few others that come to mind, but 80 percent of this movie was horribly done and could've been so much better.\n\nNot much else to say other than I'm glad I didn't have to pay to see this very bad movie. Than of course it was created by the same people who brought us Meet The Spartans which most people hated as well. These guys should never be given the production money to ever make movies again unless they actually learn how to make them."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "neil-476",
        "review_rating": "5",
        "review_title": "Lame. But so is its source material",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "TheNonSmoker",
        "review_rating": "10",
        "review_title": "Nice 'Twilight' parody movie xD",
        "review_detailed_main": "Better than the actual Twilight and all its sequel ✌🏽😂"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "rutaguer-06355",
        "review_rating": "6",
        "review_title": "Apparently a lot of people have no sense of humor.",
        "review_detailed_main": "Schlocky? Yes. Dumb? Yes. Funny? Yes. Too many Twilight fans have no sense of parody. Watch and laugh."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "pattisonbeth",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen.",
        "review_detailed_main": "The absolute WORST of all movies I've ever seen. I hope to never see it again and I hope they take it of our screens asap. It was so bad. The acting was awful. I'm definitely a big twilight fan, but I was actually excited to see this. But I don't know why it was dreadful. It wasn't even funny. At the most it made me laugh twice. Overallit was overdone, trying to hard and an absolute disaster. I strongly don't recommend it to anyone! Waste of time. Definitely the top of my 'Movies that should never have been released' list. But trust me, don't waste your money on watching this disaster. It's an embarrassment to itself and I hope the producers realise what an awful job they've done."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "frankaphone",
        "review_rating": "",
        "review_title": "Could have been potential cult classic like, \"Scary Movie\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Jerique",
        "review_rating": "1",
        "review_title": "Worse Than Twilight",
        "review_detailed_main": "Could there be anything worse than Twilight? Yes! It's called Vampires Suck. At least with Twilight, pre-teen girls and some feminine boys can enjoy the cheap thrills and adolescent romance of Bella and Edward, but what makes Vampires Suck horrible is that they didn't even do a good job of making fun of Twilight. When you fail to make fun of the movie you're parodying, you really fail as a filmmaker.\n\nI couldn't stand any part of this film. Jason and Aaron didn't go the usual route and use the same joke for the entire movie, but they did use the same plot and mix in pop culture references to Lindsay Lohan, Taylor Swift, and a few more. They insulted (not making fun, purely insulted) Canadians a couple times, and really only made fun of Twilight. Which begs the question, \"why not call it Twilight Sucks?\" In that sense, it would be more of a correct title, because Vampire movies are awesome. Blade, Interview with the Vampire, Bram Stoker's Dracula and more are just some awesome Vampire movies. I realize the title is a word play and a pun that Vampires suck blood, but it's more accurate to say Twilight Sucks because only Twilight is made fun of really.\n\nEven with all the stupid jokes, it never gave me a genuine funny moment. I only laughed because the rest of the audience was laughing and it was contagious. Clearly, Jason and Aaron need to stop making movies because everything after Scary Movie has been atrocious when they work on the project as a team solely.\n\nI would advise you to not even go see this but, haters of Twilight, lovers of Twilight, the lovers of these \"parody\" movies are still going to see it (since last night's showing was completely sold out) so nothing is going to stop these movies from being made. I can say proudly that I didn't pay to see this film, thank God. I would have wanted a refund for the brain cells I've seem to have lost by sitting through it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "It's amazing that a film can have this many jokes...yet none of them are funny.",
        "review_detailed_main": "In IMDB's infamous Bottom 100 list, there are many movies like \"Vampire Suck\". \"Disaster Movie\", \"Epic Movie\", \"Date Movie\", \"Starving Games\", Scary Movie 5\" and \"Fifty Shades of Black\" are all essentially the same film. They all provide bad jokes in rapid-fire manner. So, when one unfunny joke falls flat, they then go on to the next unfunny joke...and along the way make LOTS of unwanted references to pop culture. I have no idea why they make them and I wonder who would pay to go see them....especially as they have a reputation of being terrible. Is \"Vampires Suck\" just as bad as the rest...most likely yes, as it's #44 on the list. I have made it a goal to see all the Bottom 100 and, fortunately, this is the last of these dreadful parody films I have to see. And, like the rest, I did not see them in a theater...I am not THAT desperate to see the Bottom 100!\n\nThis film primarily is focused on making fun of the \"Twilight\" movie franchise...which should be easy and fun. Unfortunately, it really isn't...and you can only assume that lemurs made this movie. It's unfunny from start to finish and occasionally is very distasteful...though less than most of these sorts of films.\n\nSo did I enjoy any of it? Not much...and that came as no surprise. Unlike older comedies like \"Airplane\" or \"Hot Shots\", which had rapdi-fire jokes that actually worked, this one is as artless and dull as the rest of the recent pile of crap that studios are making for particularly undemanding young adults. Anyone over about 20 would find the films dopey....and I felt myself getting stupider the more I watched. Sadly, the film DID make money...so I assume they'll keep making more like it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "3",
        "review_title": "Didn't suck as badly as the other spoof movies Friedburg and Seltzer have churned out, but it is still pretty lame",
        "review_detailed_main": "I have made no secret of hating the movies of Jason Friedburg and Aaron Seltzer. Their movies to me are poorly structured, poorly written, terribly acted, and just come across as a waste of time. From reading this sentence and my reviews on them you may be wondering why I watched Vampires Suck in the first place. Simple, out of curiosity. I wanted to see whether Friedberg and Seltzer had gotten better or were further losing the plot.\n\nAlthough I was very unimpressed overall, I have to say it is a slight improvement over their previous efforts. A year ago I would have said Date Movie was their best(very faint praise though) but after seeing Vampires Suck I have changed my mind. This is their best, but it is still barely average.\n\nI will get onto the good things before the many bad things. Now I saw it to see how well or not it poked fun of Twilight. Just for the record, I don't hate the Twilight movies as much as others do, but I have never understood their popularity either. In Vampires Suck, the costume and set design are actually spot on, the previous movies especially Disaster Movie look like straight to video fodder. Also Matt Lanter gives a dead on impression as Edward Sullen, as does Jenn Proske as Becca. Also, while I may sound mean here, I am glad Carmen Electra is not in this, she is the epitome of all looks, no talent to me so I was kind of pleased not to see her grating presence dragging the film down any further.\n\nHowever, that's where the redeeming qualities end. The story is very disjointed and almost non-existent, while the humour is another let-down. There are a scatter of surprising laughs here and there, but never anything hilarious or anything consistent to make it even funnier. The direction is patchy too, and that is being kind, while the soundtrack while definitely not as bad this time around is forgettable. The two leads are fine, however the other acting is nothing to write home about at all really, nobody else stood out. Pacing is an issue too; admittedly pacing was a big weakness in the Twilight movies as well as the clunky dialogue, but as Vampires Suck was never that funny the pedestrian pacing made the experience somewhat exhausting.\n\nIn conclusion, a marginal improvement but it is very faint praise. For me it is still one of the worst movies of 2010. 3/10 Bethany Cox"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "rtc4023",
        "review_rating": "1",
        "review_title": "painful",
        "review_detailed_main": "this movie was terrible.the unfunniest childish spoof movie i have ever seen.i feel sorry for the movie industry releasing this rubbish to the paying public.it was so bad it just came annoying after a while.I'm not a lover of the twilight movies myself,but breaking it up into a spoof movie just didn't work on every level.the movie fell on its knees from the opening titles.most people have seen the twilight movies so i don't need to go into detail and tell you this movie was trying to rip it to pieces and trying to be funny at the same time oops.nothing worked the one liners the jokes the gimmicky actors all fell dead.it was that bad it was embarrassing.even a prisoner on death row banged up 24/7 given a chance to watch this movie would run a mile.stay away from this movie at all costs people"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "DarkVulcan29",
        "review_rating": "4",
        "review_title": "The title says it all.",
        "review_detailed_main": "From the guys who are tired of sitting through a Twlight film, there also the same guys that brought you Date Movie, Epic Movie, Meet The Spartans, and Disaster Movie.\n\nAfter all that you wonder whats left to spoof, they found it with Twlight, although I wonder why,I mean Twlight makes fun of itself in it's own way. It wasn't that funny, I mean there where moments where I slightly giggled. Jenn Proske and Matt Lanter are amusing, spoofing Edward and Bella, but not enough to keep your interest. Now Diedrich Bader(Drew Carey) is the only in the film ,who made me laugh. Anneliese Van Der Pol(That's So Raven) is alright at times.\n\nNot entirely awful, but still pretty bad."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "neilchallis99",
        "review_rating": "1",
        "review_title": "Uwful Movie",
        "review_detailed_main": "This has to be one of the Un-funniest movies i have ever seen. i was looking forward to seeing this film. i thought it had a lot of potential to be very funny, (how can it not), Ripping one of the worst movies saga's of all time (Twiglight). But this film fails epicly. it goes from bad to worse, all the jokes and acting are cringe worthy i was embarrassed to watch it. i was lucky that i didn't have to pay to watch this movie or i would of been very upset. This is my first ever review. i just signed up to warn people of how bad this film as i wish i was warned before i wasted One and a half hours of my life on this and would of been very grateful if i was told this before hand. save yourself some money and heartache and give this a miss."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jnelson-iaha",
        "review_rating": "1",
        "review_title": "What is the difference between terrible and horrible?",
        "review_detailed_main": "This movie. I almost cried after seeing Vampires Suck, because I wasted my money on what has to be the Worst movie ever made. Who ever decided to put this in theaters should be forced to give refunds. Or better yet they should have payed us to watch it.\n\nDon't waste any money or precious time out of your life on this. It f'd up our whole night and we were having a beautiful day prior to watching that BS.\n\nIt was not funny and kind of like watching a cracked out version of the twilight movies with a not so amusing clown. I hope that I haven't said anything spiteful. The movie at hand gives insult to injury... to all viewers.\n\nThe movie title is a spoiler and a warning that inadvertently speaks for itself. It Sucks with a spot of vampires on the side. No one could possibly spoil this movie. It was rotten from the start."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Megk92",
        "review_rating": "8",
        "review_title": "Great spoof",
        "review_detailed_main": "Original twilight movies suck. They are so dramatic and poorly acted. This movie hilariously points out how ridiculous the twilight franchise is!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "tari1uk",
        "review_rating": "7",
        "review_title": "Vampires don't suck that much",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "gregking4",
        "review_rating": "1",
        "review_title": "And so does this movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "kristinsparkkles-787-664420",
        "review_rating": "",
        "review_title": "Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "kosmasp",
        "review_rating": "1",
        "review_title": "Condolences",
        "review_detailed_main": "I am wondering why movies with \"Suck\" in the tile do exactly that? Well more or less. It's the second in a row and both use the word for vampires, though of course it is a game with words in this case. Very clever ... Not!\n\nThen again the German title that took the \"Twilight\" and twisted it around might be one of the funniest things that came out of this movie. The movie itself though? Not good. The best scenes are in the trailer (who'd have thought?)!\n\nBut you have to really ask here: What were they aiming at? At what audience? Did they think that \"Twilight\" fans would run to watch this? Or that people who were appalled by the Twilight series in the first place, would be interested? Well whatever they were thinking, it would have been nice if they had put some thought into the movie, which they obviously did not do.\n\nI came not expect anything from spoofs in recent years. And even those \"expectations\" were too much for this movie. With pop references that were almost extinct by the time this movie saw the light of day, you wonder who was supposed to laugh at those scenes. At least they seem to have had fun. Even the dreadful \"Movie\" series (Scary/Date et al) had at least one or two jokes that worked.\n\nDon't waste your time and money on this. Even if you know you won't like the Twilight movies, it would make more sense watching one of those. You can make your own jokes ... and there is a great chance that yours will be way funnier than those on display here."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "TVGuy3",
        "review_rating": "1",
        "review_title": "I cannot believe how bad this movie was",
        "review_detailed_main": "If I could give this movie a negative-infinity for a vote, believe me, I would. I only saw this because the projector for The American was broken (they fixed it later though, so I ended up seeing 2 movies last night). I chose this movie over Piranha because this movie is supposed to be bad (it is) and I don't think I've written a bad review of a movie yet.\n\nOkay so here's how it goes. It's a parody of Twilight. Twilight Saga is bad, and this is worse. Wanna see something creepy? BOX OFFICE OPENING WEEKEND COMPARISONS Vampires Suck $12M Scott Pilgrim Vs. The World $10M Isn't that scary? I thought so. Anyway, back to the review. Don't see this movie unless you are on Death Row and don't want a lethal injection, because you will die watching this movie. 3 years ago, I made the mistake of paying $8 to see Epic Movie (which sucked). But, thanks to the stupid economy, I made the mistake of paying $11 to see Vampires Suck. Thanks a lot, Bush and Obama. Never see this movie. Oh and uh, yeah, I'm on team NOBODY."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "ScottDMenzel",
        "review_rating": "2",
        "review_title": "\"Vampires Suck\" really does suck the life right out of it's audience.",
        "review_detailed_main": "\"Vampires Suck\" is a spoof of the \"Twilight Saga\" with the primary focus on the first two films. The basis premise of \"Vampires Suck\" is similar to those of the \"Twilight\" films. Becca moves to the town of Sporks to live with her father. There she meets Edward, a vampire who she automatically forms an instant attraction to. But here is another boy who wants Becca just as much and his name is Jacob. This begins a battle of Vampire vs Chihuahua to win over Becca's love.\n\nThis film actually follows the plot of \"Twilight\" so that's a change from the normal Friedberg and Seltzer film. There films usually don't really have a plot or a storyline but are just filled with random pop culture references. This one however, actually follows a story similar to how \"Naked Gun\" and \"Airplane\" followed one. The problem however is that \"Twilight\" in itself is a mockery already and there are several spoofs out already. I can't tell you how many YouTube parodies I have seen of the film. Some of them are funny and some aren't but then again they are free so who really cares. With that being said, making a movie that lampoons \"Twilight\" at this stage must be very creative and funny in order to be good. Those talents are things that both Jason Friedberg and Aaron Seltzer lack.\n\nFriedberg and Seltzer wouldn't know what funny is if it hit them in the face. The film ran for about 80 minutes and I think I smirked twice during the whole film. Without giving anything away there is a segway joke that I laughed at and something else but at this point can't remember because like the rest of the film it was forgettable. The film tries to keep tossing jokes at you every minute and I would say 99% of them fall flat. Now remember I have seen all three of the \"Twilight\" films and got the references but they still weren't funny. The obvious and cheap jokes seen in the trailer like Jacob's buddies being a bunch of gay men and Jacob taking off his shirt every 15 minutes because \"it's in his contract\" just isn't funny.\n\nOn top of the jokes from \"Twilight\" not being funny, Friedberg and Seltzer try to throw as many pop culture references into the film as possible during it's painful 80 minute run time. You have an \"Alice in Wonderland\" joke, \"Jersey Shore\" joke, Lady Gaga reference, and of course a bunch of other vampire references like \"True Blood\" and the \"Vampire Diaries.\" None of these work and the only reason I remember most of them is because I have the trailer to refresh my memory. For the haters of \"Twilight\" there is a bunch of random \"Twi-hard\" fan mockery thrown in as well. In all honesty, the final joke in the film ends on one of those \"Team Edward/Jacob\" jokes. Some people in the audience seemed to find it funny, I, however, just found it rather stupid.\n\nJenn Proske who plays Becca aka Bella (why they couldn't keep her original name but kept Jacob and Edward is beyond me) actually did a good job capturing all the little quirks that Kristen Stewart brought to the original character. She was probably the only half way decent character in the film. The rest of the acting was just atrocious. I also wonder how they got Ken Jeong and Dave Foley to do this film? I am not saying these guys are great actors but they are better than anything this film can offer. Dumb career move guys! At this point, I am convinced it should be illegal for Jason Friedberg and Aaron Seltzer to make movies. I have said this a few years ago after I paid money and sat through \"Date Movie.\" These guys are just an embarrassment to film makers everywhere. They should not have jobs when for some reason we have independent film makers with a lot of talent who can't get noticed but these morons keep getting work. This is just truly unbelievable at this point. The saddest part of all is that \"Vampires Suck\" will probably do fairly well at the box office because there is so much hype around \"Twilight.\" The haters will see it because they hate the franchise and the fans will see it out of curiosity. If that happens its going to be a disaster because that will add more money to these talentless hacks bank accounts. Please people stop funding stupidity.\n\nIn the end, one would ask is \"Vampires Suck\" the worst film Jason Friedberg and Aaron Seltzer have done so far? I can't honestly answer that because they are all on the same level to me. They are all unfunny, short, stupid, not clever, unoriginal and poorly directed. The only thing \"Vampires Suck\" does have that their other films do not is the plot of the main film they are mocking. I guess I should give them a point for that but other than that everything else is the same old garbage. The jokes all fall flat, the humor is old recycled gags that any good YouTube parody did better about a year ago, and the acting is nothing short of horrible. There are no redeeming qualities about this film and like all their other work I would recommend for everyone to avoid this bad boy like the plaque. Jason Friedberg and Aaron Seltzer need to go back to film making 101 and learn what it means to make a decent film! MovieManMenzel's final rating for \"Vampires Suck\" is a 2 out of 10. This is without a doubt the worst film of 2010 surpassing \"Jonah Hex\" and \"The Last Airbender.\""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "hilt_m",
        "review_rating": "4",
        "review_title": "Very funny vamp spoof",
        "review_detailed_main": "I thought this movie was rather funny for a spoof. The two lead actors portrayed their characters well, with Jenn Proske as Becca in all her twitching sideways frowning glory and Matt Lanter really playing up the comical aspects of Edward. The let down of the movie I feel was more in the roles of the supporting cast, Becca's father played by Diedrich Bader was badly utilized, this otherwise solid comedic actor fell flat with cheap jokes and wooden script as was much of the rest of the supporting cast. Would I recommend you see this movie? If you are a die-hard Twilight fan, you will probably not like it, but If you are able to take a step back from all the teenage heartthrob vampire seriousness, you may find yourself laughing hysterically."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "treyvo",
        "review_rating": "1",
        "review_title": "Horrible Spoof Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "Jason and Aaron... You do care!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "DirtyStarling",
        "review_rating": "1",
        "review_title": "Worse than \"Twilight\"",
        "review_detailed_main": "How in the hell do you mess up a parody of \"Twilight\"? The \"Twilight\" movies are so terrible that all you have to do to parody them successfully is slightly exaggerate the already annoying and ridiculous melodrama inherent in the series. I mean... for f***s sake! A random kid on YOUTUBE has done it successfully, and he's done it more successfully than this studio approved movie WITH NO BUDGET! But, surprise, surprise; the geniuses who brought us \"Date Movie\", \"Epic Movie\", \"Meet the Spartans\", and \"Disaster Movie\" have once again failed to grasp even the basic elements of comedy in this piece of s***. It's like they actively TRIED to write the movie so that it wouldn't be funny at all.\n\nThe... film... loosely follows the story of the first two \"Twilight\" movies. To their credit, it's clear that they actually sat through the movies and were attempting to parody some parts of the film. I recognized scenes from New Moon, like Bella being followed by a ghost of Edward on a motorcycle, and the \"staring out the window\" scene passing from month to month, but they failed to do anything that was actually funny with it. Rather than come up with some clever jokes, or funny stuff for Edward to say while he's chasing Bella on the motorcycle, he just keeps falling down. That's not funny. There was a joke with a guy in a wheelchair where he talks about how he can't feel anything from his waist down, and feels the need to emphasize that his genitals are down there. That's not funny. It WOULD'VE been funny if it was clever innuendo, but they have to beat you over the head with the joke.\n\nThere are three big problems with the humor of this movie.\n\nThe first is pratfalls. There are a ton of body injury jokes in this movie. And none of them work. Part of that it is because they use it too often, but the other part of that is that they don't do anything clever or interesting with the injury jokes. People are thrown into walls. People trip and fall. A guy gets thrown into a piano. But the actors don't do anything with it. There are no jokes written for the fall. They just expect us to laugh because someone fell down. It's not just funny because someone falls. You need character reaction, you need a set- up, you need a d*** joke!\n\nThe second problem is reference. This is the same problem the more recent episodes of \"Family Guy\" have. These guys throw in a reference to \"Jersey Shore\" here, a reference to Tiger Woods there, but there's no actual joke. Again, they just expect us to laugh because it's there. \"Hey, I recognize 'Jersey Shore'! That's funny!\" NO IT'S NOT! IT'S NOT FUNNY! YOU NEED TO DO SOMETHING WITH THE REFERENCE TO MAKE IT FUNNY! YOU CAN'T JUST SAY THE NAME OF A TV SHOW OR GIVE A POP CULTURE REFERENCE AND EXPECT US TO THINK IT'S FUNNY JUST BECAUSE WE RECOGNIZE IT! YOU HAVE TO WRITE A JOKE TO GO WITH IT!!!\n\nThe third problem is juvenile humor. Does just hearing the word \"penis\" make anyone laugh over the age of 15? They have a lot of jokes in here I might have found funny when I was 10, but they're not funny to more mature people. Heck, even most of the kids in the audience weren't laughing at it, because they probably saw some of their classmates doing it better on Youtube!\n\nOVERALL\n\nThis movie is terrible. When there are jokes, they don't work. Most of the \"jokes\" are just references or pratfalls, and when they actually find something that has the potential to be funny, they dwell on it so long that it just gets tedious. I saw this movie the same way I saw \"New Moon\": because it was a slow night at the drive-in where I work... and I gotta say, I'm glad I've never seen any of their films before, and I don't intend to watch another.\n\n1/10 - I'm not recommending this to anyone. It's worse than \"Twilight\". At least the makers of \"Twilight\" put SOME effort into it to make it entertaining for the fans."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "phd_travel",
        "review_rating": "8",
        "review_title": "Enjoyable if you are a fan of Twilight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "OmNomNom_NomNom",
        "review_rating": "7",
        "review_title": "Did what it had to do - Make fun of Twilight!",
        "review_detailed_main": "Being directed by the directors/writers of films such as the Scary Movie films, Epic Movie, Meet the Spartans, etc., I knew that Vampires Suck won't be good at all, and just when I was getting tired of these kind of films, I didn't need it to. I only wanted to see this because it parodies the crappiest crap in the history of crap literature and crap film. I saw it, didn't really like it, but I was surprised - It made fun of Twilight, yet it was better than it in every single way! Like I do with the other spoof films, I only watched this for some hilarity (which some of you should do instead of bashing it). I couldn't help but burst out laughing at all the jokes, even if some of them were predictable. It doesn't only parodize Twilight, but pokes a tongue at the monotony of teenagers girls who are all manipulative narcissists, or a soldier of \"Team Jacob\".\n\nCompared to the forced acting in Twilight, the acting in this was Leonardo DiCaprio good. Their timing was perfect, they actually had facial expressions and varied their voice. Cough cough, Kristen. Cough cough.\n\nThe good thing is that it was less boring than Twilight. It didn't waste its time on boring, senseless conversations - It was more \"action-packed\", it had more blood, the vampires actually seemed like vampires, and yes - You will see its astonishing horrible special effects that you always find in the other spoof films! Futheremore, the ending was epic!!! Let's just put it at that - One of the greatest film endings of all time...\n\nI think this is the second best spoof movie that I have seen (Spaceballs) being the first. You should give it a try, you won't be disappointed if you know what's coming."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "donojang",
        "review_rating": "2",
        "review_title": "What Can You Expect?",
        "review_detailed_main": "Vampires Suck is brought to us by the same people who gave us Meet the Spartans and Disaster Movie. Seeing that both of these movies are in the IMBb bottom 100 worst movies, then you have a pretty good idea of what to expect.\n\nThis movie gives what's promised; Lame jokes, Twilight based storyline, Taylor Lautner look alike (For all you girls out there), as well as a pretty good Bella impersonation. Basically, what we see in this is a recap of the first 2 Twilight's in a shorter, and much more lame form.\n\nHere's where I complain. All the highlights of Vampires Suck was shown in the trailer. EVERY SINGLE ONE OF THEM. Okay, maybe they didn't show the ending, but still! As for the plot, they have about 1 funny joke in there, and then it's just seeing the first 2 Twilight movies again. Don't be fooled by the title either. If you're a die hard Twilight hater, then you'll get no satisfactory. The movie does nothing to make fun of Vampires! Not even their damn glittery skin!\n\nDON'T see this in theatres."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "heylooorx3",
        "review_rating": "",
        "review_title": "don't knock it before you try it people!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "Just as unfunny as any of Friedberg/Setzer's other films, though slightly less scattershot.",
        "review_detailed_main": "It's shocking to see that \"Vampires Suck\" has a 6% on Rottentomatoes, and a 3.3 on IMDb, because that would lead wary viewers to believe that this movie is much better than any of Friedberg and Setzer's other films since Date Movie, but in reality, this is just as bad. The difference must be that Twilight has a lot of fans who will love anything related to the books or the movie, because this movie is flat out awful with no redeeming qualities. It just adds to the idea that Friedberg and Setzer must be the least funny people ever to attempt to write.\n\nThe plot is basically just the first two Twilight films summed up into 80 some minutes with horrible spoof cutaways thrown into each scene. The jokes range from boring and unfunny to horrible and unfunny, so if you're expecting nonstop chuckles from start to finish, I question why you chose this film.\n\nWhere the start with the negatives...the references can be the start, as they're the worst. These guys make all of their spoof films based on popular movies with frequent random references to other recent movies/television shows. For some reason, they think because they make a reference to something, it's automatically funny...it isn't at all. It's just dumb! Jersey Shore and Tiger Woods and American Idol and Alice in Wonderland all referenced randomly, and not one laugh. These references are just references, they're not even jokes. If they could make a funny anecdote from the reference, but no, these \"writers\" aren't good enough for that.\n\nThe jokes are unfunny. Lots of crotch hits and head hits and pratfalls. Derherher, funny stuff! The movie actually started more promisingly than any of the other of these movies, because of less jokes. Then when the jokes kick in and we see this vampire town that nobody seems to realize is full of vampires, the boredom sets in, and when Jacob and Becca's parents begin fighting, the eye rolling and uncontrollable audience vomiting begins. And honestly, throughout the movie, there is not one funny thing. Nothing even smile inducing. It's deadly boring.\n\nNow there are some positive aspects to the film. The acting isn't too bad, and doesn't rely on as much \"spoofy bad acting\" as their previous films, and instead relies on direct imitation of Twilight actors, which sadly is better than goofy spoofy acting. Jenn Proske, who plays the Bella spoof character does a decent job of imitation, though nothing she does is remotely amusing. The look of the film is pretty close to Twilight's look, at first. In fact, when this started, it actually looked like a movie, instead of their normal films which look like piles of dog excrement. After the beginning of the film, which features swooping cameras and a grey coloring, it's like the editors gave up, and the spoof film look and bad camera angles kick in. And well, that's it for positives.\n\nThis movie is awful, and typical of these two dimwit writer/directors who clearly have not an ounce of talent. I urge Friedberg and Setzer to try and make a decent movie in the future, because if they don't, they'll probably be stoned to death by the movie going audience for their crimes against humanity.\n\nMy rating: BOMB out of ****. 90 mins. PG-13 for crude and sexual jokes and language."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jackieburkhart394",
        "review_rating": "2",
        "review_title": "Just DUMB!",
        "review_detailed_main": "I don't exactly know why I wanted to see it, perhaps it was my hate for Twilight that made me excuse the fact that the trailer made the movie look stupid. I figured that maybe it wasn't doing the movie justice and PERHAPS there might be some funny things in there. Needless to say, I was wrong.\n\nA comedy means it's supposed to make you laugh, it's supposed to be witty. I figured that they could really pick at the stupid things in Twilight and make it funny, but NO. They decided to make it dumb, goofy, and just plain sad to watch. The only thing I thought was mildly funny was the beginning where Bella's listening to her angst soundtrack, but it's obviously all downhill from there. All in all, one of the worst movie parodies I've seen, if you want to see a Twilight parody that's a bit more intelligent and witty, read Nightlight (A Twilight Parody created by Harvard students)."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "dvc5159",
        "review_rating": "3",
        "review_title": "They'll never learn, do they?",
        "review_detailed_main": "\"Date Movie\". \"Epic Movie\". \"Meet The Spartans\". \"Disaster Movie\". These are the movies which single-handedly killed the spoof/parody genre that the great Zucker/Abrahams/Zucker team worked hard to perfect. Will \"Vampires Suck\" bring the glory back?\n\nDon't count on it.\n\nYou see, the \"Twilight\" franchise are a mediocre film/book phenomenon that will probably be forgotten within the next decade or less. I have nothing against the cast and crew of the \"Twilight\" saga or Stephanie Meyer as everyone has to make money SOMEhow, but I do have a riff with this \"film\"'s writers/directors. Jason Friedberg and Aaron Seltzer a.k.a. \"The Murderers of Comedy\" decided to jump on the \"Twilight\" bandwagon and possibly cash in before this fad dies out.\n\nBut is there a point? \"Twilight\", with its poorly-written storyline and cardboard-bland characters is enough of a joke on its own; why repeat the joke? And while they're at it, throw in some random and lame pop- culture and crude/fart jokes as well? *Shakes head*\n\nI recalled chuckling for a few times before the movie began to repeat the jokes. Yes, they have toned down the pop-culture references, but a few still remain. And it's not EVERY movie that's being made fun of, it's just \"Twilight\" and \"New Moon\" (obviously Friedberg and Seltzer did not have time to include \"Eclipse\"). Apart from the acting (which was OK, a high for the directors' films; Ken Jeong was sadly wasted, however), the production design was also not bad, it looked as if they borrowed sets from the original two movies.\n\nSo, I can say, that if you really want to see it, see it if you hate \"Twilight\" down to your bone. If you want good laughs, I can solemnly say that there's no hope.\n\nForgive the pun, but \"Vampires Suck\" is exactly what it says on the tin.\n\nOverall value: 2/10 (Avoid)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "todd1928",
        "review_rating": "1",
        "review_title": "Same Crap in a Different Wrapper",
        "review_detailed_main": "Jason Friedberg and Aaron Seltzer have a lot to answer for. To everyone who criticized any film this year I give you the worst feature film of the year and once again it is from the guys responsible for Date Movie, Epic Movie, Meet the Spartans and Disaster Movie (My god can you imagine trying to get a job with those films on your resume?). I never went into this movie expecting a classic that will stay with me for as long as I live but I had some naive hope that these two idiots realized that their last movies weren't funny and they need to think up some new material, this may be a new film but it's the same jokes. I sat painstakingly through the last three Twilight films and every time I came out thinking \"Why the hell did I suffer through this crap again?\" but I will say with absolute certainty that those three films are leaps and bounds ahead of this pile of crap.\n\nOnce again it is a poorly done outline of a film with numerous pop culture references just tossed in because the directors thought it would be a good idea (it wasn't). I recently mocked Eat, Pray and Love for being a terrible film but this god awful excuse for cinema makes Eat, Pray and Love look like To Kill a Mockingbird. I will say that this film is better than the last film that these two guys produced if only because they chose people that actually look like the stars from the twilight series to a point where I actually thought these guys were the stars of the film looking for another pay check. My main problem with the last four films these guys are responsible for is always the same thing; it's not that the jokes are terrible (which they are) it's the fact that they have been done to death and you can get more laughs looking at the original films than you can the parodies. My advise to anyone that want's to see the film is watch funniest home videos and imagine a bunch of pop culture references in the background, I think that's how they wrote the script.\n\nThese guys got their start as writers on Scary Movie and I think they have destroyed and legacy the Wayans brothers or Leslie Nelson left in the parody genre that these guys made famous. These two are the scum of Hollywood and they should never write anything ever again."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Simon_Says_Movies",
        "review_rating": "1",
        "review_title": "Vampires may suck but so do Friedberg and Seltzer",
        "review_detailed_main": "I can't believe I even partially convinced myself that this latest film from directors Friedberg and Seltzer might be better than their past \"efforts\". I have to keep explaining to my friends why I continue to watch their movies (never in theatres by the way). Is it that I need to see if they can get any worse? Can they maybe make a good movie eventually? Or does my subconscious have a sick desire to be subjected to 75 minutes of pure torment.\n\nEven at that mercifully short running time, it was a torturous slog to sit through Vampires Suck. I was about to give this movie a rating of 2/10 (a prestigious accolade) until I realized there was still 25 minutes left. To make a successful spoof, one must parody good or classic material and the \"Twilight\" series is neither. It is simply met to capitalize on the vampire fad and to criticize a \"bad\" series when they have made the worst movies of the decade is simply infuriating.\n\nNot only that, do Stephanie Meyers and Summit Entertainment have no legal recourse against this? There must be more than a few infringements on their material. Certain jokes are not jokes at all but simply stating lines from the films script in a visual way which continues their trend of making sure you see and understand the jokes instead of being subversive in any way.\n\nThere is a certain underlying charm in watching the most juvenile and charmless satirists lampoon a film series to such mirthless and embarrassing results, but I would still rather they stop all together. Vampires may suck, but so do they."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Goombalock",
        "review_rating": "1",
        "review_title": "No Just No",
        "review_detailed_main": "Wow, this has got to be the worst movie I've seen in my life AND all year.\n\nHoly crap I mean they just throw in pop culture references every five FREAKIN SECONDS.I'm all like ENOUGH ALREADY!! I swear to god it's so bad I was hitting my self because it was so painful to watch.\n\nGood analogy Have you ever seen Brawl Taunts? Well it's like that with 1000x the awful jokes.\n\nI take it this crap was made by the same docuhebags who did Epic Movie AND Meet the Spartans. But this was the worst of all.\n\nIn fact I can't believe I'm saying this but I'd ACTUALLY rather watch Twilight then this poorly written parody. See the irony in that? So yeah, AVOID THIS MOVIE AT ALL COSTS!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "fallnangel70",
        "review_rating": "2",
        "review_title": "THis was the king of suckdom",
        "review_detailed_main": "If you want a good vampire spoof movie, go rent and watch \"Dracula: Dead and Loving it\" with Leslie Nielsen. That movie made me cry I was laughing so hard. This movie just made me cry. I WANT my hour and a half back!!! Provided, the girl that played Becca did a good Kirsten Stewart impersonation, but she couldn't save this film. I did laugh at a few (like 3) parts and I don't know if that was due to the stupidity of the parts, I needed to laugh at something, or this film sucked all the good sense of humor out of me to make me laugh. I could have been a combination of the three. I had to go home afterwards and watch the Naked Gun series just to make sure I had a sense of humor after this movie. I should have walked out of this film but I haven't walked out on a film yet. This one came close. As a comedian once said in an SNL skit....I would rather go home, take off all my clothes, roll around in thumbtacks and soak in a tub full of turpentine. That would be a pleasant experience."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "robbiejimmy",
        "review_rating": "8",
        "review_title": "loved it, what else can i say?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "kevinnivek1",
        "review_rating": "6",
        "review_title": "Really liked this one",
        "review_detailed_main": "A long time I didn't see any movie like this, maybe since scary movie and I really liked this one , nothing surprising original but fun after along time without seeing parodies. I tried to saw the 300 parody but didn't manage to pass the 5m mark. And the actress is amazing, It's really how I saw the \"real\" actress acting on twilight and she nailed her."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "MosHr",
        "review_rating": "4",
        "review_title": "A better than par for \"the movie\" standards; Unfortunately still a very stupid movie.",
        "review_detailed_main": "If you've seen a \"the movie\", then you have a pretty good idea of what \"Vampires suck\" is going to be like. It is going follow the plot and storyline of Twilight all the while reinterpreting the scenes in its own way. The most jarring thing about the movie is the constant change of mood and tone within a scene which gives it no tension or build-up whatsoever. It lives and dies by the quality of its minute to minute jokes which are as previous installments quite hit and miss. Though the movie is barely one and half hours long, it is fatiguing because of this.\n\nThe movie starts off really well; Bella captures the nuances of the original Bella and there is an extended act about vampire town which is quite charming. Things devolve quickly though as slapstick and crudity is favored instead of satire and wit, and the movie fractures into banal shtick that is grating and stupid. However, this movie seems to possess a few more funny gems than compared to the others movies of the same fold hinting that perhaps that there is a glimmer of a chance that movies of this format can be good if done right. The biggest weakness of the movie is that it has to tear away from every funny environment it has created to chug along the storyline.\n\nIf there is one word to describe the movie, it would be stupid. It's a stupid stupid movie and perhaps enjoyable only if one is in the right frame of mind or willing to forgive the large amounts of feeble attempts at humor to find the good ones."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Sherazade",
        "review_rating": "",
        "review_title": "actually more entertaining than the originals it was spoofing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "katcakes2788",
        "review_rating": "1",
        "review_title": "It was just bad.",
        "review_detailed_main": "Being a Twilight fan (not a die hard one tho) I was excited about seeing this and was hoping that it would be as funny as the scary movie ones. I was so disappointed. To me the whole thing seemed more of a you tube spoof, but even then I've seen 10 minute Twilight spoofs on there that were better than this thing. I will say that I liked how they got the quirks that Bella does in the original but the jokes just seemed over done. I'm glad I didn't pay to see this movie but I still wish I could have that time I wasted to see it back. If your still really wanting to see I would wait to rent it and then you will see how bad it is. I really wish I could say that I enjoyed this movie tho."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sedreg",
        "review_rating": "1",
        "review_title": "Parental warning",
        "review_detailed_main": "Wow, dear parents, when they state \"crude sexual content\" in the rating of this movie, it is an understatement. How they obtained a rating of pg 13 baffles me. I enjoy spoofs on movies, but this is just a foul attempt at humor and offends my intelligence. As a parent I enjoyed the movie this spoof makes fun. The time I spent at the real movie with my child was wonderful. Vampires Suck allowed me to instill in my child that you have the right and freedom of choice to walk out at anytime and not suffer unnecessary bad taste...nine others followed us out. Don't waste your time or hard earned money. a young teen's perspective: this movie is full of very up-seen gestures. And the\"jokes\" were as though a bunch of drunk, sick teenagers got together and wrote a bunch of crude sexual terms and pathetic movie lines and threw together a \"funny\" scripit. I don't recommend seeing this unless your an adult that is over 35 and likes to make fun of the twilight saga. If this isn't your style walk the other direction. the real title should have said this movie should be: we suck."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "bonediggitydog",
        "review_rating": "5",
        "review_title": "People need to stop trying to seriously critique this movie",
        "review_detailed_main": "All this movie is meant to do is make fun of the awful acting, awkward dialogue, horrible special effects, and fan obsession of the Twilight movies. So if you thought Twilight was awful for any of the above reasons (or if you just hate Kristen Stewart's lack of an acting ability) then you're probably going to love this movie. While the movie does take an occasional shot at current pop culture phenomena (Jersey Shore, Taylor Swift, Lady Gaga) it does a very good job of sticking to its plot.\n\nThe acting in Twilight (with a few exceptions of course) is horrible. This movie purposefully exaggerates that level of horrible, so I don't get how anybody can try to critique the acting. This movie isn't suppose to be good by the regular standards of a film, its suppose to be horrible. That's what makes it funny. It is meant for people who hate the Twilight series or fans of the series who can admit that the movies, mostly the first two, are just awful.\n\nI gave it a five because the movie delivers on its purpose. You can't really give a movie that steals 95% of its material from another movie more then a five though."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jonnyhavey",
        "review_rating": "1",
        "review_title": "Twitchy Becca",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "velcrohead",
        "review_rating": "1",
        "review_title": "Awful pace, flat and unfunny jokes...Yup, this is a Seltzer/Friedberg flick",
        "review_detailed_main": "I did not know when I went into this movie that Jason Friedberg and Aaron Seltzer were behind it. If I had, I would have never have wasted my time with it. But it was pretty obvious to me who was responsible for this by 15 minutes into the movie.\n\nI'm mystified that 20th Century Fox would willingly distribute a movie with these guys attached, given their horrendous track record, and especially given the returns on their more recent atrocity, \"Disaster Movie.\" \"Vampires Suck\" suffers from many of the flaws that all Seltzer/Friedberg movies suffer from. There are, of course, weak pop culture reference that are already dated by the time the movie is released. These guys seem to operate based on the premise that everybody compulsively watches basic cable and knows who the Kardashians are or what Jersey Shore is. Ten years from now, if a copy of this movie survives, nobody will get the jokes.\n\nPacing. Good golly. For an 80 minute flick, this movie went by SLOWLY. This is the biggest reason that the sight gags fall flat. The movie belabors each of its jokes, which makes it sort of like the guy who tells a joke and then looks at each of his non-smiling friends for 30 seconds, saying \"get it? it's funny, right? get it? see what I did there?\" In this movie there are even occasions when the dialogue EXPLAINS the joke. Here's a clue, guys. If you have to explain it or belabor it, it possibly wasn't funny to begin with.\n\nGreat spoofs like \"Airplane\" or \"The Naked Gun\" didn't follow the stories they were based on so slavishly either. This one, on the other hand, basically tells the whole story of Twilight with a few sight gags.\n\nTo their credit, Seltzer and Friedberg did play it safe this time. It's hard to lose with Twilight hate. I notice that the positive reviews on this site come from hardcore Twilight haters almost exclusively. So they went the safe route, at least. It's sort of like making a movie about hating Hitler. You're not gonna get much disagreement.\n\nBut through and through, this movie fails. I wish I hadn't seen it, and I hope you won't. I love the parody genre, but these two clowns are killing it. Don't give these two unfunny fellows any more money."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "n-tune1234",
        "review_rating": "1",
        "review_title": "absolute rubbish",
        "review_detailed_main": "this film is absolutely rubbish it doesn't make sense the humour is rubbish and it doesn't feel like a comedy there is litrally one line that made me slightly laugh that,s it.\n\ni have seen many other spoof movies that are a lot better this one really does let people who enjoy spoofs down. it also feels that it was really cheaply made. i don't like the twilight saga that much but i can even say i would rather watch that than this film.\n\ni can't even recommend this to anyone because i don't think that anyone would like this. it is truly one of the worst movies i have ever watched."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "verdu_a",
        "review_rating": "2",
        "review_title": "What were these guys thinking?",
        "review_detailed_main": "I just saw this movie today and I can't believe I spent money to watch this movie. I just had to walk out. It was a waste of time. Though the actors weren't bad. They did okay in casting. What were this guys thinking, I think it will make just enough to pay the actors. Twilight haters should have enjoyed it. And I don't mean this because I don't like Twight, but it was one of the worst movies I have ever seen. And I have seen many. I wonder what the Twilight writers and cast are thinking about this movie. I hope they don't even think about making a second movie for the last part of the Twilight Saga. If they do, it will just be so ridiculous."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sarp_okay",
        "review_rating": "9",
        "review_title": "To be honest it was really funny",
        "review_detailed_main": "Whenever i watch this movie i laught at it everytime"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "UncleLongHair2",
        "review_rating": "7",
        "review_title": "Pretty good spoof giving relief to those done with Twilight",
        "review_detailed_main": "My wife is a complete, total, and obsessed Twihard. She's read the books many times and seen the movies uncounted times, and gets all of her girl friends into it too. While I can admit that there are some good qualities to the movies (they are immensely popular after all), it all just gets to be a bit too much after a while. This movie gives a great outlet for those who are tired of the Twilight movies and want to laugh about it.\n\nThe whole point of the movie is to loosely follow the original plot to set up zippy one-liners and make fun of pretty much everything about the original movies. This basically works, many parts of the originals really are completely ridiculous and very spoof-worthy. This movie drags in some places and some of the lines fall completely flat, but hey it isn't intended to be a piece of art. It is all pretty low-brow slapstick humor and I got the impression it was done in a hurry, but I had at least 10 full belly laughs.\n\nI can't imagine how Jenn Proske kept a straight face delivering some of her lines, and she must have spent time studying Kristen Stewart's acting, because she does a perfect exaggeration of Stewart's little pouty angsty faces. She even has the hand gestures down. It makes you realize how good of an actress Stewart is, to be able to play the same note again and again and make it convincing, but it is a delight to see it mocked too.\n\nMany of the scenes are nearly exact replicas of the originals, and you can tell that the cast had fun getting the details right.\n\nIt definitely started to drag at the end but hey if you want an hour's worth of Twilight recovery, it's definitely worth it.\n\nBTW if you like this and want to see more, see Colt Ford's video for \"Chicken & Biscuits\".\n\nI was surprised at the low ratings for this movie here, reading the reviews, it sounds like some people didn't even realize that it was a parody. I think it only makes sense if you saw (or were forced to see) the Twilight movies and got tired of them. If you really liked the originals and don't like to see fun being poked at your favorite characters, or if you just don't like dumb slapstick humor, you might not like this one."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "RubyMouse",
        "review_rating": "5",
        "review_title": "More fun than I expected",
        "review_detailed_main": "OK - so you know it's not going to have out of this world production values or be great art - but I think this is one of the better parodies I've seen. There are scenes that are very close to what actually happened in twilight so if you are a fan you can appreciate the cleverness. I also laughed out loud a few times and thought the actors playing Edward and Becca did a great job. If you want to kick back and disengage your brain for the evening, this should work."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Marjeez",
        "review_rating": "",
        "review_title": "With Unbelievably Low Expectations, Quite Surprised",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "alexpaul1982",
        "review_rating": "1",
        "review_title": "Masterclass in modern day movie making",
        "review_detailed_main": "Firstly i would like to say i haven't seen this movie. I am not going to see this movie. If i am flicking through the channels on a Friday night in my living room and happen to stumble across this film i will pull my TV out of the wall and launch it out of my window. Then pick up a gun and shoot myself in the eye. Why do i feel this way? Simple answer....i have seen epic movie, disaster movie, meet the Spartans etc etc. And was utterly disgusted by each and every treacherous minute i had to sit through. They make me feel like i want to rip my arm off and club myself to death with it. In fact i don't think i made it to the end of any of them. I refuse to watch this trash. Instead what i am going to do is paint my spare bedroom in magnolia and watch the paint as it drys into a beautiful off-white colour. Having said all of this i still feel utterly compelled to rate it at 1 out of 10 (because the rating system doesn't go into negatives) At what point did the producers of this movie think, 'hey, i know what the world needs!.......another spoof movie! The last 14 spoofs have been just utterly delightful!' Do they make money? Is that what it is? Coz i don't know anyone who has paid money to go and see these movies. Why are these movies churned out year after year after year? Its utter madness. Everyone associated with this film should be ashamed of themselves. Utter crap."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "racpehrsson",
        "review_rating": "1",
        "review_title": "Terrible, Terrible, Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "martestinis",
        "review_rating": "1",
        "review_title": "It was awful",
        "review_detailed_main": "I would have given this movie a zero out of 10 if it were even possible. But as a 1 is the lowest I can get, I will submit that as my vote.\n\n\"Vampires Suck\" is one of the worst movies I have ever seen. And believe me, I haven't seen a lot of bad movies. The Twilight Saga, for a start, is brilliant. And please, don't go thinking: \"Oh, she is only writing this review because she loves Twilight.\" That is only partly true. This movie, \"Vampires Suck\", was just so bad, that you don't have to love the Twilight Saga to hate it. All the characters used in the movie were really bad, and they seriously had no acting skill whatsoever. And just because one person, the director of the movie, together with some other people, apparently do not like the Twilight Saga, is not a valid reason to make a parody about it. I mean, if you want to make a parody, then don't try to fail doing that as well.\n\nThis movie was really bad. Instead of \"Vampires Suck\", this movie sucks. Just because some people don't like vampires and werewolves, doesn't automatically mean that other people should so too. I stick with my eternal favourite: the Twilight Saga.\n\nAnd if you think this review was not helpful because I am a fan of the Twilight Saga, then go ahead and see the movie. I won't stop you. But bear in mind: if you ever decide to make a parody on something, then at least try to make it a good one instead of failing at it so awfully bad.\n\nI rest my case. This movie sucked!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "nck356",
        "review_rating": "1",
        "review_title": "Suck Movie",
        "review_detailed_main": "The only thing that sucks more than vampires is this movie; or perhaps the fact that we had to pay to endure it. One of the few movies we have both agreed was a waste of time, money and brain cells,so we walked out after about 20 minutes. The acting was sub par and an insult to those few recognizable actors who lent their \"talent\". The futile attempts at humor were so in your face that even a imbecile would not be able to miss what they were conveying. What happened to subtle humor allowing the audience to catch the satire. It wasn't even satirical, it wasn't even silly, it was just a bad movie. If you really want to laugh, go and see the original Twilight movies. They are much funnier and campy and silly. This crazy mix of non-humor and grossness has no business being in a movie theater. NO redeeming value whatsoever. Save your money, skip the movie!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "nghoey",
        "review_rating": "3",
        "review_title": "This movie is improperly rated.",
        "review_detailed_main": "My biggest gripe about this movie is that it's not rated properly. I don't get it. If an adult was to show a minor half this stuff in real life, they would either be arrested or reported to child protective services. It was funny, but I don't see how this is appropriate for a 13, 14 or 15 year old. I'm in my 40s and find it offensive. Boringly cheap thrills (and I mean cheap). Satire? Yeah, I sat and got tired of being offended over and over again. The TV trailers were the most age appropriate part of the movie. It doesn't represent the movie well. Yeah, there were some funny moments. But it wasn't funny to bring your 13 year old daughter and her friend to be violated by this movie. I never leave movie reviews, but after seeing this, I thought it was only fair to warn other parents and kids."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "obsessedmovies",
        "review_rating": "4",
        "review_title": "Better than Friedberg and Seltzer's latest movies, but that's not saying much.",
        "review_detailed_main": "I saw this sometime last week, and while it had it's funny moments (that's new), it's still very bad. The funny moments are really the only thing that makes this movie better than it's other movies. It's still dumb and annoying. I will give it credit for making funny references to the books. It was also shot better than the other movies (another surprise). I guess you know what's coming since it's from the same guys who made Disaster Movie and Epic Movie. I really don't recommend this movie. I guess you can see it if you REALLY hate Twilight, or if you're a twilight fan who likes to see it made fun of. But it's still nothing special.\n\n3.5/10"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "uruguayita",
        "review_rating": "8",
        "review_title": "People clearly didn't get the point",
        "review_detailed_main": "Reading the reviews is amazing to see how many of this people clearly missed the point. Of course the movie is completely ridiculous, that's the point! Parodies exists to make fun of the original material, and that it definitely did"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "badumtssh",
        "review_rating": "6",
        "review_title": "This movie sucks....less than expected!",
        "review_detailed_main": "After making the woefully regrettable decision to pay money to see \"Epic Movie\", I had vowed to stay far away from this movie and any other with the word \"Movie\" in the title. But, because I am faint of heart and/or an idiot, I allowed myself to be talked into watching a leaked version online because A) it was actually pretty funny, according to friends who had seen it already, B) it was only about 70 minutes long, and C) this Edward was actually hot. After watching it for myself, I would agree on all three counts (especially C\u0085.daaaaamn). It's no great cinematic achievement, but for a devoted Twilight hater such as myself, it was worth a chuckle or two.\n\nSure, \"Vampires Suck\" meets many of the same pitfalls other parody movies do. It operates under the delusion that anyone out of diapers thinks that a character being bludgeoned over the head time and time again for absolutely no reason is comedy gold. It often relies on stupid pop culture jokes (Look! A Jersey Shore reference! It's funny because it is a Jersey shore reference!) and unoriginal gross-out humor (it's funny because you want to vomit! Haha!). But, so help me if I didn't find myself laughing at the way the film mercilessly mocks everything laughable about the Twilight movies, a series that, let's face it, lends itself pretty easily to parody. In fact, all \"Vampires Suck\" really had to do was recreate the first two Twilight films pretty much scene-for-scene, tweaking here and there to make the scenes only slightly more ridiculous than the originals. The result is actually a pretty clever send-up of the ludicrously over-the-top melodrama that Twilight lovers eat up. This film holds a mirror up to pretty much everything laughable about the series that proves that a wildly successful book/movie franchise does not necessarily need a \"plot\": the rabidity of its fan base; the shameless parade of shirtless males; the idea that teenage Stephanie Meyer\u0085er, I mean, Bella, would be the object of every hot guy's lust despite being a mopy sourpuss with no trace of a personality; the insistence that Robert Pattinson is \"sexy\". The actress who plays Bella, or \"Becca,\" as she is renamed, does a killer job parodying Kristen Stewart's mannerisms (hair-tucking, downward gazes, constant lower-lip biting) by which I mean she mimics them exactly and everyone laughs at them because they are stupid. Mocking Twilight is not exactly hard to do, but I have to say this film does it quite cleverly at many points. I'll even say that the ending is magnificent.\n\nNeedless to say, \"Vampires Suck\" is for members of Team I Want a Boy Who Doesn't Want to Kill Me only, as I'm sure Twilight fans would not appreciate being forced to acknowledge that the thing they love is dumber than a sack of fruit fly larvae. However, since like I said the movie is pretty much just a re-creation of the original Twilight movies, many of the jokes are best appreciated having actually seen them. So you'll probably like this movie if you are not a Twilight fan, but have actually seen the movies because A) you were dragged there by a girl whose pants you really, REALLY wanted to get into, B) you were stoned, walked into the wrong theater, and failed to realize that it wasn't The Hangover until it was too late, or C) you are self-loathing and willingly subjected yourself to them out of morbid curiosity (like me).\n\nSo if you hate Twilight and everything it stands for, take a break from your violent (yet strangely erotic) fantasies about Robert Pattinson and Taylor Lautner and go see \"Vampires Suck\". It will ease your tortured soul, and maybe, just maybe, restore a molecule of faith in the parody genre. It couldn't possibly be worse than \"Meet the Spartans\"."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "RichardSRussell-1",
        "review_rating": "4",
        "review_title": "Shoots at Big, Fat Target; Could Have Been SO Much Worse",
        "review_detailed_main": "Vampires Suck (1:22, PG-13) — other: comedy; bargain basement; formula\n\nThe writing-directing team of Jason Friedberg and Aaron Seltzer, along with producer Peter Safran, are the 3 in the Box production company. Considering that their previous movie was the monumentally dreadful Disaster Movie, and considering how bad this satire of vampire romances could have been, it didn't suck all that badly. Which is not to say that I recommend it, of course, but you needn't bring a barf bag with you.\n\nThe F-S team is also responsible for such other spoof films as Meet the Spartans, Epic Movie, Date Movie, and the later, lesser installments in the Scary Movie series. This time around, they abandon the kitchen-sink approach and choose to satirize only 1 of the many available vampiric targets, the Twilight series based on the novels by Stephenie Meyer. No mention at all of Dracula, Nosferatu, Saint Germain, Lestat, or Bill Nighy's clan from the Underworld series. The sole exception is a super-brief cameo by Buffy the Vampire Slayer.\n\nIn general, this was a wise choice, as there is soooooo much worth satirizing in Twilight (including its devoted fans, known among themselves as Twilighters and among the less enraptured as Twihards*) that it provides ample source material. Bringing in material from other canons would only have garbled the main story line.\n\nAnd that story line is a fairly faithful retelling of the Twilight saga to date, except done as high camp. (Make that highER camp.)\n\nJenn Proske as Becca Crane does a dead-to-rights impression of Kristen Stewart as Bella Swan. She's got all the tics and mannerisms down cold. She's always clutching her sweater's overlong sleeves, smoothing her hair behind her ear, dropping her eyes as she talks to people, biting her lower lip, and generally moping and mooning about. Matt Lanter as Edward Sullen does a pretty good Robert Pattinson as Edward Cullen, and Chris Riggi as Jacob White is a spot-on Taylor Lautner as Jacob Black. Really, while this is a low-budget production, and all of the leads were unknowns, the casting was top-flight. The make-up was pretty good, too, altho I think it would have been even better satire to go with mime-style whiteface and blood-red lipstick 100% of the time, instead of as fitfully as they did. Special mention for Edward's hair (including the curler scene), which deserves the cover of Architecture Today.\n\nThe humor emanates mainly from breaking the 4th wall with self-referential allusions to the movie-making process, as when Jacob, asked why he's always taking off his shirt, promptly hauls out his acting contract. Other bits rely on incongruity, such as the unexpected appearance of the Segway. There's just plain foolishness, such as Edward demonstrating his dexterity by juggling an apple, a bowling ball, and a baby. And there's gross exaggeration, such as the world's worst paper cut. Blessedly, there are almost no bodily-function gags (well, aside from the bloodsucking, of course), save for one semi-justifiable fart joke.\n\nBut mainly it's a straight-up satire of the original. It hits maybe half the time, and the other half of the time, when it's missing, it's mainly because the original was already such a satire of itself that it's almost impossible to overdo it.\n\nGood effort and worth it for Twilight completists, tho the True Believers will probably think it blasphemous.\n\n––––––––\n\n*For the record, I rated the 3 actual Twilight movies 7-5-7 on my 9-point scale, which makes me mildly appreciative but hardly a devotee."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "dianaschleisman",
        "review_rating": "",
        "review_title": "Frickin' hilarious, laughed at least 20 times",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "wowyourock",
        "review_rating": "1",
        "review_title": "Sad...",
        "review_detailed_main": "I think the biography on the movies official web site of perennially bald and non-creative producer Jerry P. Jacobs explains why this excrement of a film gets made and why all his projects are made of excrement. \"His proudest accomplishment was producing a forty thousand dollar feature and a forty million dollar feature in the same year and neither made a dime!\" Well, excrement seeks it's own level. I hope this gets him out of the creative business and sends him to work at Bandini where he can be around his level of talent and creative energy. He must really be the Max Bialystock of Hollywood and the producer movies can only afford because he's just an accountant from a Hollywood background that couldn't hit creative water if he fell out of a creative boat. No premiere in August means no good, no how, no way. And you can't fault a young actor wanting to be in a film but 20 years from now if they survive the Jacobs curse...hopefully they can get a future governor to pardon them from being a part of this excremental film! Ken Yeoung, really?\n\nT"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "experimentaltech",
        "review_rating": "1",
        "review_title": "One of the worst movies ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "blumdeluxe",
        "review_rating": "3",
        "review_title": "Scary Movie meets Twilight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "bots-de132",
        "review_rating": "1",
        "review_title": "One of the worst films I have seen in my life",
        "review_detailed_main": "That is a really hard thing to do, Jason Friedberg and Aaron Seltzer. Great f***ing job, you really stooped to a new low. I hate this movie, I want that time back. This is one giant piece of s**t in movie history. Scratch that, this isn't even a film, this is just a mashup of sex/urinary or fecal jokes/lame reference jokes. Sure its not Friedberg or Seltzer's worst film(*cough* Meet the Spartans *cough*). This is just so bad that I think they killed the parody films forever. I know its masochistic to see these films with Friedberg and Seltzer's background but damn, this is a giant piece of hysterectomy fluid using the geysering effect from the depths of hell. I didn't even finish this, ungodly film. If I could give a film a zero, I'd probably give it to this dreck. They plague the cinema world with trash that is so unsightly that they could make a puppy cry and they market these films to adolescences to corrupt there minds with this decimation of the art of film. To lobotomize every child in the world is the job of Friedberg and Seltzer."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "twlightsaga3100",
        "review_rating": "1",
        "review_title": "It's a disappointment (some spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "scottshak_111",
        "review_rating": "3",
        "review_title": "A Definite no-go for all the movie lovers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "paul_haakonsen",
        "review_rating": "3",
        "review_title": "What a lovely ending....",
        "review_detailed_main": "Well, I am not a \"Twilight\" fan, but I am a fan of spoof movies that suck (no pun intended) on the fame of other movies. And \"Vampires Suck\" did just that, literally.\n\nI was cool to see how they re-told the \"Twilight\" saga with a handful of laughs, stupid jokes, silly events and embarrassing moments and dialogue. \"Vampires Suck\" does stand out from other spoofs such as \"Scary Movie\", \"Epic Movie\", \"Superhero Movie\" and the like, as it doesn't steal and borrow stuff from multiple sources. It just sticks to the overrated \"Twilight\" saga.\n\nNow, the movie in itself was long to sit through, especially because it wasn't funny all the time. In fact, there were long between laughs. But when the laughs were there, they were well earned. One thing that really was amazing was how they had managed to replicate and make the movie seem like the \"Twilight\" movies. The sets were fantastic and very believable. I guess even the 'true' hardcore \"Twilight\" fans (or young teen girls, as they truly are) would even agree with me on that one.\n\nThere was a lot of really stupid comedy in the movie, but many of the scenes actually did work out quite well. And also nice to people like David DeLuise and Ken Jeong in a movie like this.\n\nThe low rating for the movie is because there were surprisingly few laughs in the movie, and it was a bit too long to sit through. It lacked the comedy pull to make it worthwhile. But the sets, settings and whole believability of it all managed to save it from sinking even lower on the ranking scale.\n\nWithout giving anything away, the ending was the best part of the movie. That was freaking hilarious. That was, without a doubt, the best scene throughout the entire movie."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "milanmohan-41532",
        "review_rating": "10",
        "review_title": "Better than the original",
        "review_detailed_main": "This was far more interesting than original franchise and it really mocked everything about Twilight. The lead actress is more likeable than Kristen Stewart. It's dumb, and stupid but that's how a parody should be."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Dragoneyed363",
        "review_rating": "7",
        "review_title": "Maybe I've just gotten used to them, maybe they've actually gotten better. . .",
        "review_detailed_main": "Oh, Friedberg and Seltzer. How woefully you are viewed upon by over half the film world's population today. The films you have made have been deemed some of the worst ever. However, there are still some traces of fans out there, whether anyone believes it or not. I, myself, am certainly not a fan, but I understand both sides of the scale and review your films unbiasedly. With that said, I have to admit that I rather enjoyed the latest spoof from these two.\n\nThe Twilight phenomenon is an utter joke among many already. A feature length spoof of the movies seemed like it was bound to happen, but who would have known it would have been created by them. Some might enjoy this because they find any mocking of the Twlight films joyous. Some might enjoy this because they honestly find the antics humorous. Most will hate it entirely because of the directors. In any matter, I found it fun because of how well crafted I actually thought it was and how many times it made me laugh because of how funny the movie managed to be by working off the films' it mocks cheesiness areas.\n\nLike some have already reviewed saying, this is an improvement in many ways. Unlike all their other films, this actually focuses on spoofing just the two first Twilight films and does not rely on criticizing every film they possibly can as well as making lame pop culture reference after lame pop culture reference to get giggles, even though there still are pop culture references in there, they're just not as lame and are spaced out for our brain's convenience.\n\nJenn Proske and Matt Lanter are actually incredible, in a sense, in their performances. Proske covered every Kristen Stewart fault swimmingly as did Matt Lanter for Robert Pattinson. Even though that's generally not something to be proud of, it works here. The movie doesn't linger on humorless side jokes until the point where boredom is spewing out of our mouths, and the crew captures the essence that I was looking for in this film. Yes, it has many problems, what Friedberg and Seltzer film doesn't? It still is entertaining in the right mood, and just maybe the two have finally started to perfect on what they have been oblivious to all this time, or maybe I have just gotten used to their mediocrity, but regardless, I think this film deserves more appreciation than some Friedberg and Seltzer haters will give it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "MissSimonetta",
        "review_rating": "1",
        "review_title": "Worse than the franchise its parodying",
        "review_detailed_main": "Twilight was one of the most annoying franchises of the last decade, and certainly ripe for parody. Unfortunately, most of its parodies are shallow \"comedies\" that reference certain scenes, and then insert flatulence jokes and uninspired slapstick in them. That's Vampires Suck (2010) in a nutshell.\n\nRandom is the word of the day here. Random musical numbers, random celebrities popping up out of nowhere, random fights, random references to other bits of popular culture that have nothing to do with Twilight or vampires. I understand most people think random equals funny, but guess what? It doesn't. It just makes for a boring, frustrating mess of a movie."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "freddy_at_home",
        "review_rating": "",
        "review_title": "This summer, Twilight get's funny!! Or so it seems..?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Chandni_Lilikoi",
        "review_rating": "4",
        "review_title": "Not a hit but not a bust",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Hellmant",
        "review_rating": "1",
        "review_title": "Friedberg and Seltzer suck!",
        "review_detailed_main": "'VAMPIRES SUCK': A Half a Star (Out of Five)\n\nAnother spoof movie from writers / directors Jason Friedberg and Aaron Seltzer, this one parodies 'THE TWILIGHT SAGA' (specifically the first two films). Friedberg and Seltzer are the same team responsible for such notoriously bad slapstick as 'DATE MOVIE', 'EPIC MOVIE', 'MEET THE SPARTANS', 'DISASTER MOVIE' and they also co-wrote 'SPY HARD' and the original 'SCARY MOVIE'. I haven't seen a lot of those films because I hate that type of film-making but I have seen 'SCARY MOVIE' and 'DATE MOVIE' and in my opinion they're two of the worst films ever made. With that said this film is slightly better. It's not quite as atrocious but it's still pretty bad.\n\nThe film stars Jenn Proske as Becca Crane, a young high school student who moves to Sporks with her father Sheriff Frank (Diedrich Bader) after her mother begins an affair with Tiger Woods. She feels like an outcast at first but quickly makes friends, including the reuniting with her childhood buddy Jacob (Christopher N. Riggi), and draws the attention of bad boy Edward (Matt Lanter). She falls for Edward even though he warns her he's dangerous and he quickly takes her home to meet his family and exposes his true identity as that of a vampire. His family quickly turns on Becca and tries to eat her, as well as other dangerous vampires in the area and Edward and Becca's true love is put to it's biggest test. If you know the first two 'TWILIGHT' films it pretty much follows the same basic storyline.\n\nThe film is full of juvenile humorless jokes that have been done hundreds of times before, especially by these filmmakers, it really scrapes the bottom of the barrel. There's absolutely no creativity or wit to the film at all. With that said the film is less painful to watch than others of this genre. It's not as disgusting or gross and the jokes aren't quite as bad. There's also a few jokes that are funny I have to say, enough that could fit in a ten minute short film but the film does provoke a couple laughs. Also the film's acting is actually better than the films it spoofs and Jenn Proske (in her debut film) does an extremely impressive job imitating Kristen Stewart (who starred as the character she mocks in the 'TWILIGHT' films and was actually the only one to give a good performance in that series), so she could be someone to watch out for in the future. While the film is really bad it's not one of the worst films I've ever seen, like similar type movies, and while I'll admit the 'TWILIGHT' films are a little better made than this I still found it slightly more enjoyable to watch.\n\nWatch our review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=vqvCRlRn7qY"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "yelizarov94",
        "review_rating": "5",
        "review_title": "Not so bad...not so good",
        "review_detailed_main": "Any parody always in dispute. Millions are crazy not to like, but love the unit. Jason Friedberg and Aaron Seltzer - a so-called creators of the stupid American comedy skits. They took them only one adequate film - a cult Scary Movie. And if this movie was still possible to see some follow-up films were catastrophically stupid and reckless. At only parody did Jason and Aaron, mostly the subject of stupid to laugh became cult films and continuous blockbusters. But now Friderberg Zeltser and done, perhaps, his best parody since Scary Movie - Vampires Suck (write the name in the original, because I do not know what will be the definitive translation of Russian distributors) In this film, the subject of jokes has become the most, now polar Twilight series . Here ridiculed just two films - Twilight and accordingly the second part, Twilight. Saga. Moon. And, you know, mocking all quite adequately and funny, though quite a few \"below the belt jokes.\n\nIncidentally, I do not like Twilight. Perhaps that is why I liked the movie. No, definitely, it's not a masterpiece, but you know, it is clear that directors have tried and done something more meaningful than almost all of their previous work. Not all the jokes funny, but how skillfully the creators made fun of that fervor, that excitement that reigns near Twilight, this must be proud. It is like a joke of the family of vampires who are against Cullen in the original movie.\n\n-You know who we are, is not it? Yes. But you Black Eyed Peas! Joke about Chitose can be assigned almost to the masterpiece comedies, where very accurate and funny derided life and worship of dumb idols.\n\n-Once I have a smoke, I always want something to eat. And I think you know what I need.\n\nChitose? -Thanks, dude. You're just saved my life.\n\nAnd most importantly, this is as it was ridiculed in one phrase the whole sex-symbol of Jacob. This joke of the standard and brilliant. If it were not for her, this film would be an ordinary stupid comedy, but it gave the film of charm and originality.\n\n\"Why are you now off T-shirt? -In my contract says that I must remove a T-shirt every 10 minutes of screen time.\n\nThe end of the movie is very stupid. But the dialog Becky and head Zolturi was very funny and spectacular. And if there were fewer American humor, a sense of humor, which was in the beginning, I would have liked the movie more. The first 18-20 minutes of the film - it is very, very well-filmed comedy very good jokes. No, of course, his \"genius\", the actor, plot or soundtrack, this film is no different from all the other parodies. But for me this film is unique. For the first time since publicly ridiculed the most important disease of today's youth - Twilight. I hope after this film will be less fans of this saga."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "splendour_inthegrass",
        "review_rating": "3",
        "review_title": "Positve feedback",
        "review_detailed_main": "Usually, I am one to be very opinionated and critical when it comes to the movies I watch, but this movie was an exception. It isn't a cinematic masterpiece but i considered it just a movie to relax and have a few laughs. I honestly was expecting to be disappointed from the very beginning, but it didn't \"suck\" and it wasn't like the previous parodies(epic movie, date movie, etc) Even I got sick and tired of the obsession with twilight so for them to make it the butt of every joke made it very enjoyable to watch. Though i must say, towards the end i felt like they ran out of ideas and just wanted it to end. None the less, GIVE IT A CHANCE AND WATCH IT FOR YOURSELF :)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "No, just the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "burisam",
        "review_rating": "5",
        "review_title": "Sucks the fun out of Vampires.",
        "review_detailed_main": "It throws in a few funny jokes to keep you laughing throughout the movie but there was over-exaggeration in some scenes of the movie. It IS probably one of the best parodies of the 'Twilight' Series and the ability to merge two films together + capture the essence of those was done well.\n\nIt is a film that accommodates both people who are fan of the series or absolutely hate it. The portrayal of Becca Cullen by Jenn Proske was done to make her almost as likable as Bella Swan.\n\nMy key reason of watching the film? Matt Lanter, who I previously watched in 90210 and Cutting Edge 3. He pulled of the role and provided the audience with a few laughs. The only flaw was that he was covered in all that makeup.\n\nVampire Sucks is not as horrible as it's made out to be but it's definitely not Oscar material. It's a bearable film to say the least. Wouldn't recommend going to watch it at the cinema, just hire it at your local DVD store instead."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Jonny_Numb",
        "review_rating": "4",
        "review_title": "The Lowlight Reel",
        "review_detailed_main": "It's been a week since I attended a teen-centric, after-work screening of \"Vampires Suck,\" and my usual punctuality in submitting a brief review on IMDb was met with a sort of instinctual resistance. Ultimately, I felt more than a little unqualified to critique something that pokes fun at a universe I view with indifference: Stephenie Meyer's \"Twilight\" books (and the subsequent film franchise). While the screening was not my idea (I agreed to accompany a female friend), I took what I knew of the cultural phenomenon (which is also apparently what the writing/directing duo of Jason Friedberg and Aaron Seltzer did), lowered my expectations, and prepared for the worst. The verdict? \"Vampires Suck\" wasn't the terrible waste of time I dreaded it would be: certain bits of crude slapstick connect, as does the subtle (and rarer) bits of wordplay; and Jenn Proske, who plays the film's Kristen Stewart stand-in, absolutely nails the actress's awkward twitches and lovelorn stares. That being said, this parody coasts largely on the name-brand recognition of its source rather than any genuine comedic impetus: at the end of the day, the name of the game is profiteering off \"Twilight\" before the phenomenon loses steam. As such, \"Vampires Suck\" is an inoffensive -- yet utterly disposable -- bit of cinema.\n\n3.5 out of 10"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mariamartyris",
        "review_rating": "10",
        "review_title": "Made me laugh",
        "review_detailed_main": "I'm giving this a 10 only because it is unfair that it got so many 1 ratings. i think the Twilight saga fans came here and put those 1 ratings :)\n\nAs a spoof this movie pokes fun at the Twilight saga all right, so it is right on the money. Ok maybe I wouldn't pay money to see this movie but i'd watch it on TV anytime it was showing - it is funny enough"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jerrywestra",
        "review_rating": "7",
        "review_title": "Dumb, fun and entertaining movie",
        "review_detailed_main": "That's basically what it is. Definitely doesn't deserve a 3/10 which it scores right now."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "thegoodman-1",
        "review_rating": "3",
        "review_title": "A parody that just wasn't needed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "kezzofresco2",
        "review_rating": "",
        "review_title": "What sucks??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "rzajac",
        "review_rating": "1",
        "review_title": "So bad, it hurts to watch",
        "review_detailed_main": "A friend invited me over for a \"junk movie\", and I thought, how bad can it be? Watching a junk movie every now and then at least calibrates your understanding of the media machine; what kinda junk have they been grinding out lately? Well, I was aware, for example, that there's actually a publishing industry that's based on the idea that if you slam a bunch of senseless, touchie-feelie prose between a hard cover and give it a self-help-sounding title, lost souls will buy it to adorn their shelves with--and then wonder why life is still hell.\n\nAnd it's just as true that if you assemble of coterie of hack \"writers\" to knock out a movie script rife with poorly sublimated aggression (\"gags\"), hire hungry actors, and apply some out-of-the-box production values, there are people who will shell out a few shekles and sit and derive some boredom-killing value from viewing it. Not watching it; viewing it.\n\nOK, I'm being a little unfair: Somehow--and I really don't know how--certain personality types will get a cavalcade of laughs from this kind of watery, dim-witted tripe. My friend surprised me by showing that she was one of these types. I really need to get a better grade of friends.\n\nThe more primitive the humor, the more readily it cuts across cultural boundaries. Not everyone can understand the warm humor that derives from a piquant observation of life's experiences. But everyone can laugh at a wheelchair-bound guy being savagely beaten in a spirit of playful camaraderie. Or utterly gratuitous pop-culture references, with no plot anchoring, whatsoever.\n\nWait a minute: I started out trying to say something conciliatory, but it backfired.\n\nMy point is, that the real world of film production entails an understanding that there is a kind of economic undergirding: If people will watch it, people will produce it. That's all that can be said about this movie.\n\nPeople: Stop watching these movies. There is still time."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "djay782",
        "review_rating": "1",
        "review_title": "Just youtube Twilight parody and it will better than this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "3xHCCH",
        "review_rating": "3",
        "review_title": "Awful, But a Little Better Than Other Friedberg-Seltzer Films",
        "review_detailed_main": "I only found out later that \"Vampires Suck\" was another project of Jason Friedberg and Aaron Seltzer, them of the \"Disaster Movie\" notoriety. However, during the film, you did already get the feeling that these were cut from the same cloth. There were so many stupid, lame and unfunny jokes and sight gags and pop references, all based on the already uneven \"Twilight\" films. They simply try too hard at being funny, that they wind up sucking more.\n\nBased on the poster, you already know coming in that \"Vampires Suck\" will be a parody of the \"Twilight\" saga. Surprisingly, the film does follow the original quite closely, even with the make-up and location. The actors they have chosen, from the leads to the secondary characters, actually resemble the actors in the original.\n\nThe actors who played the three main characters really had a good time impersonating the original trio. The girl who played Becca Crane, Jenn Proske, had her Kristen Stewart perfectly, down to all those angsty mannerisms. Matt Lanter, whom we saw before as the lead guy in \"Disaster Movie,\" also went to town, playing a tongue-in-cheek Robert Pattinson as the miserable Edward Sullen. Chris Riggi had the requisite tan and abs (and teats, haha!) of Jacob White, and the contractual obligation to remove his shirt every 15 minutes. These guys were actually quite funny as impersonators. Actually, I thought these smaller, subtler jokes in characterization were funnier than the big broad ones.\n\nOverall, I still think this film is a waste of time and admission ticket. The comedy is lazy and groan-inducing. However, if you do decide to watch, there might a few gags which may make you giggle despite yourself (like the Black Eyed Peas joke with the bad vampires, or what the directors made the Wolf Pack do, or the prom sequence at the end). You may have fun with the spoof impersonation of the lead characters, like I did. We do have to find the silver lining in these instances, don't we?"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "JoeB131",
        "review_rating": "3",
        "review_title": "Picking on an easy target",
        "review_detailed_main": "Gee, a satire of the Twilight Movies...\n\nI mean, were there no baby seals available to club? Or would they have put up too much of a fight? Talk about your easy targets.\n\nThis film is full of the vignettes you'd expect to see in a movie like this, the parts of the Twilight movies where the guys snickered while their girlfriends went oooh and ahhh. And of course, like most modern parodies, it couldn't resist at least one flatulence joke. Because Flatulence is funny, even the 500th time you've seen it. NOT!\n\nSome bits were funny, like the werewolf who turned into a chihuahua. But most of them were the kind of predictable jokes you'd see in a movie like this, the only thing absent was Leslie Neilson, who passed away the week this came out on DVD."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mg3-926-816857",
        "review_rating": "2",
        "review_title": "You know what sucks about this movie? Everything",
        "review_detailed_main": "Vampire sucks is a movie that I do not recommend renting, buying, or even watching on TV. This will take up 2 hours of your life that you will never get back. I saw it since the twilight films were OK and I wanted to see how they made fun of them, yet they failed miserably. Yes, they made fun of them, and everything, but people need to remember it is a movie and the audience is the main critic. People argue that this was a hilarious film, yet I didn't even have a smirk in my face. HORRIBLE MOVIE. To bad. There were some scenes that had nothing to do with the saga, and the jokes were to plain. I know that giving this movie a 2 is harsh, but as a critic I think that it is what it deserves. Why am I not giving it a 1? The reason is that even thought it was awful, the main target was to make fun of the twilight saga, and it did, yet the movie itself was a failure."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Christian_Dimartino",
        "review_rating": "3",
        "review_title": "Yes,Vampire's suck,but they aren't the only thing that sucks.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "brandon-jimenez-644-272895",
        "review_rating": "2",
        "review_title": "A Horrible Movie, but not as Bad as the movie it's spoofing",
        "review_detailed_main": "Vampires Suck is undoubtedly an awful movie to watch. It's another \"Masterpiece\" created by the Horrible movie directors of Friedberg and Seltzer. These guys have no idea how to make anything good, or even how to make anything humorous. They should be banned from the industry from making anything. And this movie is no exception. But why do I give it two stars instead of one? Because though Vampires Suck is a terrible film, its still a better movie than any of the Twilight movies. Yes, BETTER. The Twilight movies are the worst movies I've ever seen. Its mainly because of the horrible characters of Bella, Edward and Jacob who have no decent human qualities. It also ruins the lore of horror fantasy. Because of the Twilight movies, I will never find Vampires or Werewolves interesting ever again. Bottom Line, the Twilight movies are to me the lowest levels cinema can ever sink down to. Vampires Suck is better because it at least know the franchise it's spoofing is already horrible to begin with. Friedberg/Seltzer at least know that Twilight is terrible, so anything they do will be better than Twilight. Don't get me wrong, all of their movies are really bad. I just find them better than Twilight will ever be."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "ajleslie-rop",
        "review_rating": "8",
        "review_title": "I wouldn't watch again, but its a parody; are you supposed to?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Bored_Dragon",
        "review_rating": "6",
        "review_title": "Now I regret that I spent the \"Still better love story than Twilight\" title on \"New Moon\"",
        "review_detailed_main": "IMDb Bottom Rated Movies # 45 is a 'so bad it's good' over-the-top parody of \"The Twilight Saga\". Objectively, the movie is bad and ridiculous, but unlike the original, which with a budget of $ 400 million and serious intentions turned out to be bad, stupid and boring, this one with dozens of times smaller budget is deliberately bad and stupid and immeasurably entertaining. They dug up actors who mostly resemble those from the original franchise and mimic them pretty well, and Jenn Proske is both hotter and a better actress than gloomy Kristen Stewart's she skillfully mocks. The movie does not deserve the rating I gave it, but considering all of the above, I simply have to rate it at least one star more than the original.\n\n6/10"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "elshikh4",
        "review_rating": "5",
        "review_title": "Unlike all of their movies, this doesn't compete for \"The Worst Friedberg & Seltzer Parody\" !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mayrock13",
        "review_rating": "",
        "review_title": "dumb and pointless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "tavm",
        "review_rating": "3",
        "review_title": "Vampires Suck is another uneven movie spoof from Jason Friedberg and Aaron Seltzer",
        "review_detailed_main": "Okay, having seen the previous \"movie spoof\" pictures-Epic Movie and Meet the Spartans-written and directed by Jason Friedberg and Aaron Seltzer, I knew right away to expect a \"hit-or-miss\" ratio when watching this, their latest comedy to take on the latest trends and topical one-liners, Vampires Suck. Based largely on the Twilight movies, we get a teenage girl named Becca (Jenn Proske) becoming the new girl in school who attracts the attention of the brooding vampire Edward (Matt Lanter). Even though I've yet to watch any of those Twilight films, I was familiar enough with that series' reputations to be partially amused by some of the situations. And it's a treat to see such familiar character actors like Diedrich Bader (who I first watched as Jethro on the movie version of The Beverly Hillbillies) and Ken Jeong of The Hangover do their stuff here. Still, it's a very uneven comedy with the usual punchlines on various headline-making celebrity scandals like that of Tiger Woods and the Kardashians that would render this very dated so fast, you'd probably be saying \"Who?\" by the time this goes to DVD in about three months! I mean, I liked when that squirrel was going to bite Edward's neck after he chomped into him and when Becca sang like Taylor Swift when playing the guitar on that motorcycle but, really, the lines and gags were sooo obvious and predictable that I was counting the minutes till it was all over. Oh well, at least the leads, especially the female, are such good eye candy..."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "saadgkhan",
        "review_rating": "1",
        "review_title": "As expected it Live up to its Name \"SUCK\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "bastiaan0740",
        "review_rating": "1",
        "review_title": "I have to write.",
        "review_detailed_main": "Hello all.\n\nI have not written a review on this site for years. However, after having the misfortune to watch vampires suck, I felt compelled to write one. To get rid of all the bad karma.\n\nThings looked promising after viewing the trailer. 'Are you the black eyed peas?', heh. And so I was suckered in. With the possible exception of one or two gags, this movie was totally unfunny. Not only that, it didn't make any sense. Mostly it didn't even get to the part 'there was the joke and it wasn't funny'. More like, 'wait, was that a joke? I'm unsure. What the hell is going on?' There is definitely no plot to the movie. Frankly it felt like the directors made efforts to create some sort of anti-plot. Every angle; murder, cops, father-daughter relation, alternate love interests, lycan-vampire rivalry, the introduction of lycans altogether; absolutely everything is presented and is an immediate dead end. Then there comes a sudden spiked club to the head and this stinker of a movie is put out of its misery in its typical nonsensical and unfunny way.\n\nThe only redeeming factor of this movie was the great acting performances. Seriously, they were good. I endured the whole movie clinching to the idea that at least the acting was good, like gasping for air. This maked me feel comfortable with giving it the 1/10. Would have been zero otherwise.\n\nUnfunny, probably even if you're a retard."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "ConnorMonteith",
        "review_rating": "2",
        "review_title": "This spoof is something along terrible",
        "review_detailed_main": "This film is a complete make-up of \"Twilight\". The spoof is nothing good. Although it is different, it still doesn't satisfy anyone's present requirements for a good film.\n\nThe story is about a human teenage girl, Becca, who is torn between 2 boys - a vampire and a childhood friend.\n\nThe humour in the film is very basic, and can't pass as \"professional\". The film is made up of poorly crafted scenes, which wouldn't change my opinion on the movie, no matter what order they appear in. \"Vampires Suck\" is more or less like \"Epic Movie\" and \"Disaster Movie\". Out of these 3 films, none of them appealed to me 1 bit. The attempt at humour is incredibly bland, and in my opinion, there was not much effort put into the film compared to some other films that came out around the same time.\n\nKen Jeong made a fantastic appearance in \"The Hangover\" in 2009. He takes a small role in this film, but personally I think he would have been better taking on a larger role. The character of \"Daro\" is pointless and doesn't fit in with the story much.\n\nI won't say the film was terrible, but as this film is a \"Twilight\" parody, you can see right from the start that it is mainly aimed towards \"Twilight\" fans. Despite watching it, It was a complete waste of my time. It is still an awful, unfunny film.\n\nSome people may like this film, but in a few years time, I doubt there will be any more films like this, and if there are, I definitely wouldn't pay to see it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "ValleyOfScarletFever",
        "review_rating": "4",
        "review_title": "Mediocre at Best",
        "review_detailed_main": "This film was surprisingly not as awful as Jason Friedberg and Aaron Seltzer's previous endeavors, however it is not nearly up to the level of a great farce like Airplane or even Kentucky Fried Movie. It echos the tone of MadTV often at times due to the cast, and although it could have been much hammier and painfully obvious,the leads primarily pull of the meta jokes with ease and elicit some of the best laughs. The pop culture references and slapstick gags are all groaners, however the jokes with the sole purpose of lampooning the Twilight phenomenon work and are actually clever with the actors competent delivery. However, despite the comedic chops behind some of these MadTV actors and even cameos from Ken Jeong and Dave Foley of Hangover and Kids in the Hall Fame, respectively, the movie ultimately leaves you wanting to watch their previous projects instead. Not terrible, but not worth the watch."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "2",
        "review_title": "Vampires Suck (2010)",
        "review_detailed_main": "I'm giving this film a very generous 2 whole stars based on the Work Print release. It gets this by simply being better than the diabolically bad previous efforts of Jason Cuntberg and Aaron Shitzer. First of all, it manages to stay focused on the material it is supposed to be spoofing. Second, the lead actress is as good as, if not better than, Kristen Stewart. Third, some of the jokes do work, but most of them are obvious as Twilight is such an easy target. Finally, the pacing of the film is a lot better than that of Twilight or New Moon, showing that Twilight really squeezed out every drop of blood for it's sequel. There's also less of the celebrity \"look alike\" crap. Most of the jokes are still juvenile, obvious, painful, and poorly delivered, but it's certainly the best offering from these cinematic leeches thus far."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "IheartCali5882",
        "review_rating": "3",
        "review_title": "An hour and a half of my life I'll never get back.",
        "review_detailed_main": "I'll admit I'm not the biggest fan of spoof films, but I rather enjoyed the original Scary Movie and Not Another Teen Movie. Scary Movie was the best one I've seen thus far and I gave it a 7. Compared to SM, this is absolutely inferior; which is a bit hard to understand considering these are the same writers (two of them anyway). Where are the Wayans bros. when you need them? I could definitely tell they are absent from this film w/o researching it first. The jokes are subpar (I gave a small chuckle twice, exactly twice), and the delivery is nowhere near as clever or smooth as SM. It's full of too many been-there-done-that gags, and after 7 or so spoof films within the past 10 years, they don't carry the same punch they used to.\n\nI think somewhere around the 45 minute mark I fell asleep until the last 10 minutes of the movie. But the kids I took to the theater liked it. They're all 10 and under by the way. I doubt anyone over the age of 12 who has any taste in comedies will be able to sit through this in its entirety. Total waste of time, but I expected as much."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "kwingate",
        "review_rating": "9",
        "review_title": "Ingenious parody",
        "review_detailed_main": "I really enjoyed this. The only thing I knew about the books was that they were causing tweener and young teen (girls, mostly; my 15 year old son would have no part of them...) to actually read books, you know, just for fun! \"That can't be bad,\" I thought.\n\nWhen my wife bought the first Twilight film home on a rented DVD, I actually was surprised to like it: most teens could relate to one of the main characters, I'd bet, or would at least admit to having \"friends like that\". (I mean, not quite undead / shape-shifters of course, but certainly \"different\", \"alone\", angst-ridden, confused...). I didn't care for the second installment, but then I rarely like sequels.\n\nI usually am not that fond of parodies either, but this one had me laughing from beginning to end.\n\nWhat amazed me about this one was that it works as parody even if you like the originals, which I think is very unusual. (Some of the reviews here claim you could only like it if you hated the originals, others said you'd like it MORE if you liked the originals...). I kind of think it might work even if you'd never seen a Twilight movie.\n\nWhile I've not read the books this movie might in some ways be truer to the source than the movies it lampoons. (\"I feel safe with you. Not like with Edward...\"). I didn't get that from Twilight.\n\nFinally, as has been duly noted, the leads were TERRIFIC at mimicking the characters in the original, particularly the ones playing Becca (why the name change though?), Edward, Becca's Dad, and Edward's sister."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jake-584",
        "review_rating": "7",
        "review_title": "I enjoyed it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "p-stepien",
        "review_rating": "3",
        "review_title": "Be warned! They joke!",
        "review_detailed_main": "Somewhere in the script wilderness this was bound to be written. Unfortunately it also turned out a sure-fire reality. Given the awkwardness of the \"Twilight\" series with shiny white veggie vampires, boring chicks to die for and an eternal love-story with a man-pooch as a third party, you just knew deep down that there would be a spoof of the series.\n\nAnd as sure as vampires teeth are shiny low and behold: the suck has come to being. The typecast \"Airplane\" jokes densely populate the genre it is over-flooded with the expected low-level humour based on low punches, cheap shots and obligatory word jokes (i.e. regarding Edward's bling bling). Nonetheless sometimes on a new moon the rare heavy hitter does manage to transform the typical jokes into ones more fleshed-out and rather effective. Some of the obvious, yet more subtle jabs, at the movie are also present, so I found myself weirdly endeared for brief stints of the movie. I especially found myself engaged by the final act when the plot actually manages to take me off-guard with the scene of the 'final battle'. The audacious natural goofiness of Ken Jeong as vampire numero uno must have also influenced my overall perception: I just can't not love the dude, however ridiculous his given role.\n\nAn additional star for Jenn Proske as our hoariness for actually turning out to be a more believable and considerably less irritating actor than Kristen Stewart (aka Bella Swan in the \"Twilight\" franchise)."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sarahjose-397",
        "review_rating": "",
        "review_title": "The film never stops to suddenly jump into making fun of another film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "PirateMetalFan",
        "review_rating": "2",
        "review_title": "When you hear a title like vampire sucks you expect vampire jokes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mitchellkerr",
        "review_rating": "1",
        "review_title": "terrible",
        "review_detailed_main": "If you want to watch a really bad film. This is perfect for you. I don't have much to say about vampires suck because it is awful. The acting is poor. I enjoyed the twilight films and i find this very offensive to those. Don't bother watching this film. It is a complete waste of time and you would no doubt find much better things to do then watch this movie. I didn't even watch all of this film and i still found it to diabolical to watch. I watched this film with my family and they found it to bad to watch it just as much as i did. By the way if you are a twilight fan this will defiently not be for you. It will put you complitely of it for a while."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "dbborroughs",
        "review_rating": "2",
        "review_title": "Not very good and less so if you don't know the Twilight films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "g-bodyl",
        "review_rating": "3",
        "review_title": "Rather Watch Twilight!",
        "review_detailed_main": "Vampires Suck is not a very good spoof at all is practically the same as watching Twilight with worse acting and dumb fart jokes. In terms of recent spoofs, this film may be a little better than those unfunny Meet the Spartans and Disaster Movie, but that's not saying much. The only joke I really liked here is when the one girl said that the movie would bomb, but camera pans up to saying Twilight Breaking Dawn part 1.\n\nFriedberg and Seltzer has to making these films because they're stupid and not funny. They need to make something like the Scary Movies series. This film basically has the same plot as Twilight with the exception of a few lame name changes.\n\nThe acting is pretty awful. Except for the main girl who actually captures Bella's essence, everyone else was just painfully awful.\n\nOverall, this is a pitiful excuse for a movie and this should have never been made. It's bad that people lose all our IQ by watching films like this. I don't mind spoofs but they have to be good quality. I'm not the one to trash on movies but on films like these, I will. I rate this hideous film a 3/10."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "eventlaunch",
        "review_rating": "2",
        "review_title": "Vampire SUCKS It sure does",
        "review_detailed_main": "Do I have to say it what can we expect from the team that bought us the piece of crap that was Epic movie"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "hmying",
        "review_rating": "3",
        "review_title": "Not as funny, and whole lot of nonsense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "MLDinTN",
        "review_rating": "1",
        "review_title": "complete crap",
        "review_detailed_main": "This movie was terrible. Nothing was funny. The only good thing I will say is the girl that played Becca had Kristen Stewart's weird pouty faces down. The movie combines elements of the first two Twilight movies. It just kinda bounces around and when they need to, they make up their own plot lines. For example, Becca doesn't go to Italy, instead the ancient vamps show up to their vampire themed prom. As a side note, Frank, Becca's dad, is played by Jethro Bodine from the Beverly Hill Billies move from the 1990s. When I first heard that guy speak, I was like, that sounds like Jethro, so I looked it up on IMDb.\n\nFINAL VERDICT: Only watch if you want to see what one of the worst movies ever made looks like."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "fudgemonkeyz79",
        "review_rating": "10",
        "review_title": "This movie needed to be made :)",
        "review_detailed_main": "In my few years, (I'm 19), I've never seen something as popular, yet as terrible as the Twilight movies. They are the ultimate proof in this world that just because something is popular, doesn't mean that it's any good. This movie is brilliant in that it takes all of the flaws, awkward moments, and overall ridiculousness of the series and magnifies it. This movie is so self aware that its just brilliant. I have to say that I didn't enjoy Date Movie, Epic Movie, Meet The Spartans, or Disaster Movie at all. In fact, I think they are terrible. They are perfect examples of how to waste dozens of millions of dollars on overdone, unfunny parodies of love-able movies. The twist with Vampires Suck, though, is that it is a parody of something that, deep down inside, we all really do hate. (Unless you're an obsessed teenage girl with the IQ of a tomato, no offense) So, please, if you're one of those persons who listens to everyone else's opinions, please don't. Rotten Tomatoes gives this movie a 3%, which is ridiculous. This is an insult, because they gave The Last Airbender an 8%. This film deserves at least a 75%. This movie will make you laugh until you crap thunder, and if a movie makes me laugh more than 15 times, I like it. (A couple recent examples of really funny movies are Date Night, The Other Guys, Dinner For Schmucks, She's Out Of My League, The A-Team, and Hot Tub Time Machine.)\n\nSo, have a nice day, go see this movie, and don't be uptight and not accepting, have an open mind, and you'll laugh yourself silly. This movie was better than all of the Twilight movies combined."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "legacye",
        "review_rating": "7",
        "review_title": "Much better than I would have expected!",
        "review_detailed_main": "Lets be honest..almost every movie-fan that's watched epic cinematic failures like Meet the Spartans , Epic Movie etc are going to think Vampires Suck should be avoided at all costs.\n\nThey couldn't be more wrong.\n\nYES there are a few gross-out moments in this and YES the inescapable potty- humor moment here and there, but other than that this movie is completely hilarious. I couldn't help but find myself laughing every 10 minutes and thats a pretty good track record for a modern day movie spoof. I'm not a Twilight fan..and if you're not either, chances are..you will enjoy this movie. It's light-hearted, doesn't attempt to be more than it is and entertains.\n\nThe funniest thing about it is that the actors playing in it almost do a better job playing Edward, Bella and Jacob than the original cast do. The movie doesn't suffer from attempts at poking fun of 10-15 different movies at once and maybe thats why it works this once.\n\nThey just focus on just making fun of two movies in the Twilight series and I think they did a pretty damn good job of it. I hate to say..I really do..but I might just go see this movie a second time. It's honest to god that funny."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "aesgaard41",
        "review_rating": "3",
        "review_title": "Vampires Suck Just Plain Sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Idiotmaniac",
        "review_rating": "",
        "review_title": "While it isn't the best spoof out there...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "the-awesome-von-grimm",
        "review_rating": "2",
        "review_title": "This movie sucks more than Twilight.",
        "review_detailed_main": "I am not a big fan of the Twilight books or films. I read one or two books when I was 13, enjoyed one of them and went to see the first movie in the cinema and it broke my heart in two. They ruined the books, the characters and actually made me quit reading the remaining books. Since there are so many new vampire movies it really became a hype so a parody about vampire movies would actually be really funny. Well, this movie isn't. Not. At. All.\n\nThey basically copied the whole Twilight story, so it is actually as watching the Twilight movies but then stuffed with bad, tacky jokes and throw-cake-in-face humor that a lot of American comedies have. I think it would be a lot funnier if they came up with their own vampire story, so it actually would be something refreshing to see instead of sitting and staring at a bad version of Twilight. The references to famous singers or actors are not doing a great job, there was no single moment that I had to laugh or even smile during this movie. I was watching it waiting for it to end so I could write this sorry review about it. Jenne Proske, playing Bella, could impersonate her very well and was the only thing in this movie that actually made me think 'good job'."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "s3276169",
        "review_rating": "1",
        "review_title": "Garbage making fun of garbage",
        "review_detailed_main": "Satire is supposed to be witty, revealing, insightful. Sadly this title is every bit as bad as the drivel it clumsily attempts to ridicule.\n\nPathetic jokes about flatulence and so on are a substitute for insightful comment and there is plenty to comment on. The unthinking formulaic nature of industrial film making, the creation of a stereotypical youth culture and a lot more besides.\n\nSo much could have been said. Instead what we get is exposition, cheap stunts and gags that could well have been dreamed up by a eight year old and his/her friends backed by obvious, predictable jokes and ersatz satire that is really little more than tarted up cynicism. But then this is what happens when you get an industry that attempts to satirize itself. It misses the mark either because it has no idea what it needs to say or does not really want to say, for very obvious reasons, what it already knows.\n\nA one out of ten and its barely worth even that."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Vampires Suck",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "bellhollow",
        "review_rating": "3",
        "review_title": "Vampires Suck and so does the show. SPOILER ALERT",
        "review_detailed_main": "This was one of those movies where the ending wasn't good, the last half of the movie wasn't good, and somebody forgot this was supposed to be a funny show. It could have been funny but having a werewolf chase a cat two or three times ceases to be funny. The ending could of been good, but instead of letting the lead vampire get a club to the head, they had to have Becca show her fangs. Just let the damn movie end. At least the club to the head would be a shocker like a girl getting run over by a car at the end of Scarry Movie. This was just not very well written and was just a \"Let's make some money\" and turn people off to satires completely."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Bob_the_Hobo",
        "review_rating": "4",
        "review_title": "Formula's Dead but the Idea is Undead",
        "review_detailed_main": "We can call \"Vampires Suck\" a guilty pleasure for those of us that have hated or didn't understand the \"Team Edward\" or \"Team Jacob\" fad, and have hated that pale guy with the weird eyes staring at us whenever we went in to a theatre, a book store, a clothing store...just about anywhere, really.\n\nI suppose the plot would make more sense if we had actually seen the \"Twilight\" movies, but I could piece together enough to make it funny. A girl named Becca Crane falls for Edward Sullen, which causes a rift with Jacob White, and chaos falls after that and leads into a rather pointless middle and finally a fulfilling ending with the \"Teams\" battling each other.\n\nI didn't like \"Epic Movie\" or \"Disaster Movie\" because I enjoyed most of the films that were being lampooned. But this is not so in \"Vampires Suck\", so all in all it is a sound bad-summer-comedy that disappoints, but it was made to disappoint.\n\nI'd wait for the rental, and wait for a day where you don't want to think at all."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "j-cherry-630-782328",
        "review_rating": "3",
        "review_title": "all right...could have been WAY better",
        "review_detailed_main": "OK so lets be honest it was never going to be that great considering vampires suck was a spoof based on one of the worst vampire movies ever made. still it could have been better, there were a few funny moments in the film (only recognisable if you watch the twilight films first though)however i found that the majority of the humour was too obvious and crude to be really funny and simply portrayed a sense of immaturity and lack of imagination from both director and writer. however the actors made a commendable effort (especially the girl who mimicked Kirsten Stewarts appalling acting perfectly) its a shame they were considerably let down by the scathing incompetence of the director...the movie had potential...but in the end became obsolete and pointless. a real disappointment"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "churchofsunshine",
        "review_rating": "2",
        "review_title": "Doesn't suck as badly as it could have done, but still dire",
        "review_detailed_main": "Asking me which Aaron Seltzer & Jason Friedberg film I prefer is a bit like asking if I'd rather take a bullet in the brain or in the chest. Until yesterday, my answer would probably have been \"Date Movie\", but as of today, and somewhat surprisingly, my answer would probably change to \"Vampires Suck\". That's not really much of a statement though - it's a bit like saying that Colonel Gadaffi is not quite as evil as Saddam Hussein. It might be true, but neither of them are particularly nice people, and the same theory holds true of Friedberg & Seltzer's works - just because this one is only in the gutter while all their other movies are completely down the drain isn't much of a way to compare them, but its just about the only way I have.\n\nSeltzer & Friedberg seem to be rather elusive characters, and even when it comes to extra features on DVDs, I can't recall ever having seen a picture of them anywhere. I'm beginning to think that like the infamous \"Alan Smithee\", that Friedberg & Seltzer don't really exist. I'd love to see them do an audio commentary for one of their films which is just a continuous loop of \"We're sorry. We're so, so sorry.\" - it would almost make the film worth buying!! To be fair though, they have got at least one thing right this time around. Instead of trying to squeeze in about ten different movie spoofs into one film plus a random pop culture reference every other minute, the writers have taken the wise step of only spoofing one franchise - the popular \"Twilight\" saga. They haven't completely left out the gratuitous pop culture stuff, but it's a step in the right direction - it at least feels like one coherent movie with an actual plot, rather than ten movies shoehorned into one coming out as an incoherent mess. Also presumably, Carmen Electra didn't need rent money the month this was being filmed, as she is thankfully absent from our screens this time around.\n\nI usually give over-promoted franchises a miss - at least until a lot of the fanfare and hoo-ha dies down around them, which is one reason I came very late to \"Friends\" and \"Ally McBeal\" on TV (and still avoid \"Ugly Betty\") and the same reason I avoided \"Lord of the Rings\" and \"Harry Potter\" for a long while and have never really taken to them. Unlike my sister, who has read the Twilight books and watched the films religiously, I barely know who Robert Pattinson is, and I wouldn't recognise Kristen Stewart if she walked down the street and flashed her breasts at me. The Twilight franchise probably is ripe for spoofing, but Seltzer & Friedberg probably aren't the best people Hollywood could have appointed to the role, with the result that this movie isn't half as good as it could have been. Luckily, it's not half as bad as it could have been either. And there is at least one person who deserves at least some credit, and that is lead actress Jenn Proske, although whether she is capable of anything more than Kirsten Stewart impersonations remains to be seen, but if I was to give her one piece of future career advice, it would probably be to stay away from any future Friedberg & Seltzer productions and try something more challenging instead.\n\nI'm not really sure why I continue to fund Seltzer and Friedberg by paying to watch their movies - probably out of morbid curiosity and just to see if they really are getting any worse and whether or not they will ever churn out anything half-decent. \"Vampires Suck\" isn't it, but it is a step in the right direction. 2/10"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mewne0",
        "review_rating": "10",
        "review_title": "Best spoof movie out there right now",
        "review_detailed_main": "I started watching this movie with the same mind frame as most future viewers: \"Oh God, this is going to be like Epic Movie, Meet the Spartans, with the potty humor and endless pop culture references..\" I was pleasantly surprised. There were only about 4 pop culture references and 2 potty jokes. Yes. You read this correctly. I'm thinking the directors learned from their mistakes from the past spoof movies and definitely put some work into this one.\n\nI'm not saying everyone will find this funny. You have to at least know most of the Twilight series, whether you like the series or not. It helps a lot, otherwise you may not get some of the jokes.\n\nThe actress that played Becca (Bella) was spot on - with all of Kristen Stewart's tics (hair touching, blinking) and she sounded almost exactly like her. I loved the jokes about teen angst, cheesy teen romance movies, and..well you'll have to watch it.\n\nYou may think it's dumb but it's funny dumb, which is entertaining to me. Go in with an open mind and you will be entertained."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "7",
        "review_title": "Above average Seltzer/Friedberg effort",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nHaving always displayed a sophisticated sense of humour, I was drawn to Vampire's Suck from the trailer, which cleverly plays like an advert for another unbearable Twilight instalment, only for a fart gag to suddenly break in and hilariously shatter any such illusion. Another blissfully short effort from the modern Proft/Zucker, Vampire's Suck keeps itself moving just by not having any illusions about itself and just being enjoyably silly through-out, without the gross unpleasantness of Disaster Movie or just the lameness of Epic Movie. It keeps itself in the times by the obligatory pop culture references, including a politically incorrect pop at Lady Gaga...I don't want to talk like it's some great masterpiece, but by S & F's standards, you can't complain. ***"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jacobjohntaylor1",
        "review_rating": "1",
        "review_title": "This movie sucks.",
        "review_detailed_main": "This movie really sucks. I am a fan of the early Twilight movies. I am also a fan of Dracula (1931). One of my favorite comedy movies is Dracula dead and loving it. It was funny and did not insult the fans of any Dracula movie. And it did not put down any of the Dracula movies. This movie insulted the fans of the early Twilight movies. And it did put down the early Twilight movies. But the worst thing about this movie is that it is a comedy and it is not funny. If a vampire movie is not going to be funny is should a lest be scary. This movie is not scary. This movie is badly written. Do not wast time and money. Do not see this movie. The girl who played Bella is very pretty, But still the movie is awful. They will have to do a lot more then find a pretty girl to get me to like a movie. This is one of the wort comedies ever."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "the_kingjoker",
        "review_rating": "",
        "review_title": "Review of Vampires Suck (2010)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "ashljac",
        "review_rating": "1",
        "review_title": "Dumb humor and I love dumb humor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "espen_baklid",
        "review_rating": "2",
        "review_title": "Starts good, but dies out quickly",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "shinigami70",
        "review_rating": "3",
        "review_title": "Dislike Twilight? Good Laugh. Otherwise, stay away. Far, far away.",
        "review_detailed_main": "If you dislike the Twilight films, as I have, you will find this movie somewhat enjoyable and funny. However, in all, this movie is just as good as Scary Movie 3 (which, was terrible). Few jokes were truly funny, the rest were poor attempts at it and made almost no sense as to why they were done in the first place.\n\nHowever, where this movie really shines is in its parody of Twilight; it truly copies the style of the Twilight films through and through: starts off a tad interesting, but half an hour in, you're bored and want to turn it off. Of course, it does do good parodies of the insane and completely laughable themes of the first two Twilight movies. In all, if you dislike the Twilight movies, go ahead and give this a go for a few good chuckles. Otherwise, don't bother watching it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "raulfaust",
        "review_rating": "5",
        "review_title": "Give it a chance!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "andrewmckeown3",
        "review_rating": "1",
        "review_title": "Avoid",
        "review_detailed_main": "Spoof movies used to be a bit of a rarity in Hollywood but that certainly isn't the case anymore. In the 2000s we seem to have a new parody film released every week and it is quite common to have a parody film floating around Top 10 box office lists these days.\n\nThe recent popularity in parody films seemed to start with the financially successful Scary Movie franchise. I quit like the first Scary Movie film, a spoof mainly focused on the Scream franchise also parodying other popular 90s movies. The script written by the Wayans' brothers was reasonably well written, entertaining, witty and often silly spoofing 90s movies and pop culture often at the same time. The delivery of this comedy material was also good, in particular from the actress Anna Farris who went on to have a very successful career in comedy films.\n\nThe success of Scary Movie meant we got Scary Movie 2 then Scary Movie 3 and so on. Unfortunately, each sequel was much worse than the film it followed. Now we are up to Scary Movie 5 and the franchise is totally unwatchable. While the Scary Movie films were being released there was a whole bunch of awful spoof films being released across Hollywood with films like Not Another Teen Movie, Date Movie, Epic Movie, Disaster Movie and so on. It makes sense for Movie Studios to make these films, they are cheap to make, get a good return at the box office and it doesn't seem to matter whether they are good or not as people go to see them regardless.\n\nWhen I first heard about Vampires Suck I had very low expectations, after seeing so many of these terrible 2000s spoof films I have lost all faith in the genre. Vampires Suck is a parody based on the Twilight film franchise. I quit like the Twilight films, they are entertaining but at times can be little ridiculous giving a lot of potential for someone to write a funny spoof film. Maybe Vampires Suck could be this film, unfortunately it was not.\n\nIt was an incredibly painful experience watching Vampires Suck. It's lazily written as the plot is very closely based on the first two twilight films almost copying rather than parodying, occasionally slipping I the odd pop culture reference for a cheap laugh which fails miserably every time. The only small positive from this film I could give was Jenn Proske's performance as she did a good job parodying Kristen Stewart's awkward performance as Bella Swan in the Twilight films.\n\nVampires Suck is supposed to be a comedy and I can honestly say I never laughed once through the entire 82 minutes. With a lot of bad comedy films these days the only funny lines are used up in the trailer. Having just watched the trailer for Vampires Suck I can say that there wasn't anything funny in there either, the only joke was on me because if only I had seen the trailer for Vampires Suck first I would have known it was terrible as originally thought and would not have wasted 82 minutes of my life watching this nonsense.\n\nWith this current stream of terrible 2000s spoof films, Vampires suck is probably the worst one so far which is a hell of a statement in its own right. There are 644 words in this review and it would take the average reader 4 minutes to read that many words. By reading my review you will now be well aware that this is a shockingly terrible film and certainly one to avoid. Vampires Suck is 82 minutes long and by avoiding this film, misusing the 4 minutes it has taken you to read this review, I have saved you 78 minutes of your life and for that all I have left to say is your welcome."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "atinder",
        "review_rating": "4",
        "review_title": "Vampires Suck (2010)",
        "review_detailed_main": "Vampires Suck (2010) This yet another spoof, this time it a spoof of Twilight' movie.\n\nI do seem to like a lot Spoof movies, such as all the scary movies, Shriek If You Know What I Did Last Friday the Thirteenth, Not another teen movie, Superheor movies, i did enjoy those movies\n\nI did not like date movie, Epic Movie, Disaster Movie or Stan Hellsing and i have not seen Meet the Spartans.\n\nHowever for Vampires Suck, I did not hate and I did not love it and I did enjoy the movie.\n\nThe movie start of really poor, some of the jokes are way over the top and do not work, but after 20 mins of the movie.\n\nIt did get a bit better then were some okay jokes scenes which made me laugh few times but it's much better then the god awful Disaster Movie and StanHellsing put together but not as good as any of the Scary movies or even Superhero movie.\n\nIf you don't like spoof, skip it, and if you liked Shriek If You Know What IDid Last Friday the Thirteenth, then you might like this too .\n\ni going this 4 and half out 10 lol"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mikehpwin",
        "review_rating": "1",
        "review_title": "Boring plot",
        "review_detailed_main": "This movie seems a parody of twilight. I think the plot is boring. I'm also tired of seeing Asian guys appearing on film just for a few seconds as sort of targets to create fun with. This movie, whether intentionally or not, again stereotyped asian guys as marginalised group to create humor with."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "zacpetch",
        "review_rating": "8",
        "review_title": "It mocks Twilight, therefore it is technically perfection.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "nikki1282",
        "review_rating": "6",
        "review_title": "Enjoyed it better than actual Twilight",
        "review_detailed_main": "i saw this for free so no i didn't pay to see it. but what do you expect from a spoof movie? just mindlessly watch it with the crowd and laugh along. laughing is good for you. i found this more entertaining than the actual twilight movie (i don't like twilight). overall, there were about 2 really funny scenes with some obvious jokes thrown in throughout. some people really laughed hard though all the way through. also, the actor playing jacob in this is way better than taylor lautner and i feel like taylor should have been in the spoof (sorry, had to say it). the main actress has kristen stewart's mannerisms down to a T to the point where it actually started annoying me like when stewart does them. the ending is particularly funny. good luck."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "lisafordeay",
        "review_rating": "5",
        "review_title": "If you hate Twilight this one's for you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Enchorde",
        "review_rating": "3",
        "review_title": "Not that good..",
        "review_detailed_main": "A spoof movie that focuses, as you have already guessed, on the recent flood of vampire movies. Of course it revolves around a teenage girl that has crush on the mysteriously pale boy in the same class as her. A lot of jokes and puns evolve around that central story, but a few other movies get a kick too.\n\nIt is tricky to do a real good and successful spoof, and Vampire Sucks don't really come close to that target. It does got a few jokes that are quite fun, but too many are of poor quality and the movie is just too diluted to really work. I guess that to make this really work you've got to either really love or really hate the vampire franchises..."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "timhartland",
        "review_rating": "1",
        "review_title": "Shocking - just cringeworthy and lame",
        "review_detailed_main": "This is up there with the worst movies in the history of mankind, so many ridiculous scenes that failed to make you laugh and lots of really crude humour and lines that just aren't appropriate in modern society. Love a good comedy, and really like movies like flying high, which this is trying to be. But is epically bad.\n\nThe police Sergeant Dad comments on his daughters breasts, there's closely related siblings, making out and more toilet, humour and ridiculous nonsense than a 10-year-old could dream up. It blows my mind that this movie was created, but it was an area. A real shocker. Make sure you don't watch this."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "JamesMitchell451",
        "review_rating": "1",
        "review_title": "To those who like this movie: Go to hell",
        "review_detailed_main": "To Jason Friedberg and Aron Seltzer: Please stop making movies. Your films are not funny, they never were funny, they never will be funny! If you can't even do a spoof of Twilight right then you are a horrible disgrace to the art of film making. It's not that the jokes in this film grew old months ago, they grew old years ago! You still have the stupid door in your face joke, the poop joke, and constant unfunny references to things like shows and other movies. For example, there is one scene where the girl ask who the Edward spoof guy is (His acting is even worse than Robert Pattison's look like Leonardo DiCaprio) and her friend list a bunch of names, the Bella spoofer says \"No, not the douchebags from the Jersey Shore\". Do you understand how insulted I felt to be watching this bs? If anyone you know thinks that this is a funny, well made film you have my permission to smack them with a baseball bat."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "alzewgaming",
        "review_rating": "5",
        "review_title": "I Didn't quite watch this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "bhernandez2216",
        "review_rating": "2",
        "review_title": "This movie stinks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "namob-43673",
        "review_rating": "3",
        "review_title": "dumb, juvenile, and not funny",
        "review_detailed_main": "The point of a spoof movie is that it is supposed to make fun of other movies and make you laugh. Although Vampires Suck sort of succeed on the first, they utterly fail on the second. This is not funny.\n\nIn the entire movie there are like 2 or 3 jokes that land, and I think I smiled once or twice. That is it. The only thing that works with this movie is Jenn Proske and her demeanour which is dead-on and exactly like Kirsten Stewart's wooden lack of talent. Jenn is clearly a much better actress than Kristen, and her character is the only one that work in this entire movie. The rest are badly acted, badly written, badly directed, or a combo of all three.\n\nThis is not the worst movie ever. In fact this is almost watchable, but since it fails on delivering on the laughs, and since camera work, sound design and a lot of other factors also fail, I think a 3/10 seem very reasonable.\n\nIts a shame really. Making fun of Twilight and similar should be a slam dunk, and as mentioned Jenn is excellent in her role, so this could have easily been a great fun movie. But sadly another failure in a long line of failed spoof movies. Aren't people in Hollywood funny anymore?"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "brosensanke",
        "review_rating": "3",
        "review_title": "A strange comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mjlower-28991",
        "review_rating": "9",
        "review_title": "Great parody/lampoon is better than reviewed",
        "review_detailed_main": "From the opening 5 minutes this film sets its theme. In my opinion there are several laugh out loud scenes and subtle jokes that make this film a wonderful time filler for pure enjoyment. No stress no mess.\n\nI can't understand why some people are so hateful. It's not as though there were uncouth jokes about sensitive subjects. The film focuses strictly on parodying the \"Twilight\" films.\n\nI'm just saying... lighten up."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "evolinag",
        "review_rating": "6",
        "review_title": "Funny parody of an over-hyped movie",
        "review_detailed_main": "First of all, the movie is from the creators of \"Spy Hard\", \"Scary Movie 1\", \"Date Movie\", \"Epic Movie\", \"Meet the Spartans\" and \"Disaster Movie\". So, if you didn't liked these films, you won't like this one, either. If you liked them, you'll have your fun with this spoof.\n\nI want you to know, that you have to see the movies \"Twilight\" and \"New Moon\" first, before you watch this one. You may get some jokes, but most of them will seem odd to you.\n\nThe thing is, the movie is not intelligent or something, and the gags are very simple.\n\nMost of the jokes are vulgar, gross or violent. The movie doesn't push the PG-13 rating, however. All of it is done in a comic fashion and, especially for the violence, it is that comical and unrealistic that every teenager will handle the film.\n\nIf you liked the writer's previous works, you'll like this one, too. Don't expect something like Mel Brook's movies - rather something like \"Epic Movie\".\n\nI watched this movie in theater and i laughed quite a lot.\n\nI recommend the movie for children 14 and up. It has some violent scenes but the scenes are quite unrealistic. The movie also has some rather strong sexual content, such as a SM scene, a sex doll and frequent sexual talk. The unrated version actually isn't much stronger."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jason-mcavoy",
        "review_rating": "3",
        "review_title": "This film is daft in every respect!",
        "review_detailed_main": "Oh my God... This movie has literally got to be one of the worst films I have ever seen in my life! Just the plot of doing a comedic remake of the brilliant (Twilight Saga) it just makes me sick to see it being re-made in a way that just doesn't suit the theme for the film. I kind of get the fact that some people may have actually wanted to see this film come out or even here about it being made. When I heard I was so excited for it! Then I watched and thought to myself 'Well this is the stupidest adaptation I have ever seen!' I eventually got to the end of the movie and then turned off the TV as soon as possible! I would not suggest this film to big time Vampire Movie Fans."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "capone666",
        "review_rating": "4",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "Vampires Suck\n\nWhy would a girl ever love a vampire? With all those pointy planks, they could never build her a picket fence. And if they could, when would they build it...at night?\n\nUnfortunately, the chaste chick in this Twilight Saga spoof did not heed said advice.\n\nWhen an introverted youth, Becca (Jenn Proske), moves to a small-town to live with her father (Diedrich Bader), she finds herself immersed in a bizarre love triangle with a vampire, Edward Sullen (Matt Lanter), and a werewolf, Jacob (Christopher N. Riggi). To make matters worse, the local vampire clan and wolf pack are at odds with one another, leaving Becca torn.\n\nBy only lampooning the Twilight series, and not referencing every other movie, the makers of these insipid spoof movies–along with their comedic cameos–have finally done a so-so job.\n\nRegardless, though, of whomever Becca chooses, breast-feeding their offspring will be a bitch. (Yellow Light)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "trashgang",
        "review_rating": "3",
        "review_title": "story okay, jokes really bad",
        "review_detailed_main": "Finally a spoof of one of my top 5 worst movies ever, Twilight. Normally I don't do American spoofs because mostly I can't laugh with their jokes. I'm more into British humor. But my children gave it to me for my birthday and noticing that it was made by the Scary Movie franchise guys I thought to give it a try.\n\nYes, Scary movie. Everybody loved part 1 but it was downhill from their on. And this one wasn't good at all. The jokes are so stupid that toddlers will have fun with it but my face moved only for a few times. I never had any tears in my eyes from laughing. As a spoof on Twilight that is okay, it's even recognizable. It follows the same lines but the jokes just didn't work. And they all looked like the Twilight people but the acting itself wasn't that good after all, they exaggerated sometimes that it really got annoying. The sleepwalking scene didn't work for me. Or when Edward is going to bite Becca she has written on her neck, bite here. Really, is this a joke? I even tortured myself by watching the extended version, sadly it just didn't work. I guess teenagers who hate Twilight will have a big laugh with it, some jokes were mediocre, the others really bad. If I had a closer look towards the title I should have known enough...\n\nGore 0/5 Nudity 0/5 Effects 1/5 Story 2/5 Comedy 1/5"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "expect the hits",
        "review_detailed_main": "Becca Crane returns to live with her sheriff father in her childhood home in Sporks, Washington. It's a spoof of the Twilight movies. She falls for the sparkling vampire Edward Sullen.\n\nSome may say Twilight is too awful to be spoofed. I sympathize but I don't think bad movies are unspoofable. In fact, bad genre can be great spoof. Jason Friedberg and Aaron Seltzer are responsible for the series of recent bad spoof movies. This one won't win any great awards. There is something strange about this one. It follows the Twilight movie quite closely and I wonder who this movie is written for. With non-fans who never saw the Twilight franchise, they would never understand the comparison. With Twilight fans, they wouldn't want to laugh at their own fandom. So it's stuck in no-man's land. As for the lead Jenn Proske, she plays it as a demur Bella which is fine but she's not actually that funny. She's not big enough. She's basically an actress who normally plays the lead's quiet friend. She's cute but lacks the big charisma to fill the screen. There are some passable attempts at jokes but nothing that really hits. Without a big lead or something imaginative, this spoof lacks the armor to deflect the expected slings and arrows."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "tammyshadowkilljoy",
        "review_rating": "2",
        "review_title": "vampires suck sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Prismark10",
        "review_rating": "3",
        "review_title": "Toothless",
        "review_detailed_main": "From the makers of the feeble Disaster Movie and Epic Movie comes Vampires Suck that spoofs the Twilight saga and is a step up from Jason Friedberg and Aaron Seltzer's previous efforts.\n\nBecca Crane (Jenn Proske) shows up in a gloomy town to live with her overly protective sheriff father Frank (Diedrich Bader). At her new high school, Becca is torn between two guys, the brooding ashen faced Edward Sullen (Matt Lanter) who is a vampire, and hairy handed Jacob White (Chris Riggi) who seems to be a shaggy werewolf.\n\nWhat the movie gets right is following the template closely of Twilight and New Moon with the actors Lanter, Proske and Riggi channelling their original counterparts closely. Lanter's Edward really looks spooky close to Robert Pattinson. The set design and atmosphere again makes you think that the directors have put an effort in getting the look right before sending up the films.\n\nWhat lets it down are the scatter-gun jokes and sight gags with random pop culture jokes which ages the film quickly and you might not even understand them if you live outside of the USA. The jokes are thrown about in the hope the audience might find some of them funny.\n\nThe Jacob dog jokes are mildly amusing such as him suddenly chasing cats and urinating on a fire hydrant but many of the gags miss their mark.\n\nThe Airplane and The Naked Gun films established the benchmark for parody films and they have also shown that they are not easy to replicate. In that regard Vampires do suck."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "mamadunn09",
        "review_rating": "5",
        "review_title": "Not a Good Movie, But I Still Got Some Laughs",
        "review_detailed_main": "Of course it is immature and not worth spending an atrocious amount of money on at a big theater, but it can still give ya some laughs. It's not over the top horrible like Date Movie or anything like that and it's a heck of a lot funnier. I was unfortunately in a theater with loads of little middle-schoolers and they found the film hilarious and I felt like it was appropriate for their ages. Even I, who is 20, had a few laughs at some of the parts and was pleasantly surprised that it wasn't the worse movie I had seen or even close.\n\nI still prefer it over the actual Twilight movies. The acting is the exact same, but at least I get a few laughs this way."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "gartley95",
        "review_rating": "9",
        "review_title": "Well worth the price",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "dwpollar",
        "review_rating": "7",
        "review_title": "Funny spoof of the Twilight saga...",
        "review_detailed_main": "1st watched 9/11/2011 – 7 out of 10 (Dir-Jason Friedberg & Aaron Seltzer): Funny spoof of the Twilight saga that tried to emulate much of the first movie and does a good job of that plus adds in humor and gags that keep you laughing almost throughout. It does get a little lacking in the last half hour and ends too abruptly, in my opinion, but otherwise is pretty successful at what it was trying to accomplish. It starts out with a scene, that is later repeated and skipped(because we already saw it once) that is showing us what Becca, the young mis-understood girl, would do to save the hunky, albino vampire, Edward and then we are shown her moving in with her dad to a small town in Washington(like the Twilight movie). The gags start at the very beginning with the dad saying in-appropriate things to the daughter and don't stop til the end – where young girls fighting over the main characters end the movie with the last laugh. There are a few homages to other movies like \"Buffy the Vampire Slayer\", and believe-it-or-not \"Alice In Wonderland\", but mostly this is about the Twilight saga. I liked the first Twilight movie, and I liked this spoof of that movie. This talented writing/directing team of Jason Friedberg & Aaron Seltzer surprised me with this very good comedy effort and I hope to see more from them."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sketchatron",
        "review_rating": "5",
        "review_title": "Fulfills its purpose fairly well",
        "review_detailed_main": "As can be expected, this spoof has some slapstick cheesy humor, B-list actors, and a plot that jumps around to get in as much it can in less than 90 minutes (because no one wants to watch these types of movies for that long). It even takes stabs at other vampire shows and real-life recent events. But it does plainly tell every Twilight watcher (especially towards teenage girls) what's so silly about those movies. Oddly enough Jen Proske as \"Becca Crane\" does a better job spoofing Kristin Stewart than K Stew can do \"Bella\". It would have been better if there were more laughs, which is why I recommend you watch the unrated version as at least it gets a couple more laughs due to vulgarity. Every teenage girl who watched the Twilight series should be forced to watch this movie....it might help snap them back to reality....before it's too late."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Norman_French",
        "review_rating": "4",
        "review_title": "Most of the gags will induce eye-rolls not laughs",
        "review_detailed_main": "TL/DR: The film is knowingly campy (and not in a good way). The zany attempts at humor feel forced. It's borderline schlock.\n\nI think the jokes would have been funny in a Mad Magazine format (with their satirical artwork style). They don't work that well in this live-action parody. While Jenn Proske does a fine job, WAY too much of the humor is just lame. Most of the cast hails from Smarmsville, the worst being Ken Jeong in a cringe-worthy performance. While there ARE a few LOL moments, one would have to be a dedicated B-movie fan to want to sit through the entire film.\n\nPart of the problem is that if one removes some of the over-the-top absurdity, aspects of the film become disturbing. Take the rampant bullying of Becca Crane (Jenn Proske) for example. While the film isn't overtly mean-spirited, it does contain some characters that may cause you to wince instead of laugh.\n\nI give this 4.5 stars for mild (but uneven) entertainment, MINUS half a star for Ken Jeong. That's four (4) stars total."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "anaconda-40658",
        "review_rating": "4",
        "review_title": "This Film Sucks.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "napcan-46197",
        "review_rating": "10",
        "review_title": "This is so funny",
        "review_detailed_main": "Even in 2023, i still laugh at it. I dont know why its rate are so low... YOU MUST WATCH IT. It's a parody of Twilight. And it's hilarious. Cast are so good. The references are well and if you are bored and you want to watch something funny this will be one of the best choices for you to watch. (It still says my review is so short so i'll add something stupid to fill this... so you don't have to read this part... I don't even know what else to add. JUST LET ME SUBMIT IT... OKAY SO HOW ARE YOU? IF YOU STILL READING THIS YOU DESERVED TO BE ASKED HOW YOU ARE. ANYWAY FROM NOW I CARE FOR YOU CUZ YOU STILL READING THIS...)(FINALLY IT'S OVER...)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "hu675",
        "review_rating": "6",
        "review_title": "Oddly watchable mess.",
        "review_detailed_main": "Becca Crane (Jenn Proske) moved to Sporks to live with her clueless father (Diedrich Bader), who is the sheriff as well. Becca slowly realized that there is Vampires in Sporks. Becca finds herself falling in love with Edward Sullen (Matt Lanter), who happens to be a vampire as well going to her high school. She becomes friends with Jennifer (Anneliese van der Pol), a fast talking teen slut. Becca is also in danger, when three vampires (Arielle Kebbel, Charlie Weber and B.J. Britt) are after her. Edward saved her from one of the vampire attacks and Jacob (Christopher N. Riggi) also saved Becca from those attacks. But Jacob is a werewolf, who changes into a Chihuahua (!). But Jacob is in love with Becca. Now Becca has to choose between Edward and Jacob.\n\nDirected by Jason Friedberg and Aaron Seltzer, who are the infamous writers and directors of such low-brow comedic disasters most of the time, laugh-less spoof such as \"Date Movie\", \"Epic Movie\", \"Meet the Spartans\" and the worst of all \"Disaster Movie\". Although Friedberg and Seltzer wrote an slightly more coherent script. The best thing about \"Vampires Suck\" is Jenn Proske as Becca, she captures Kristen Stewart performance as Bella from the \"Twilight\" movies. Proske is dead on in the movie. Bader is well-cast as her dad. Anneliese van der Pol is amusing as Jennifer, she makes fun of Anna Kendrick's role as Jessica quite well.\n\nThe DVD rental exclusive has no special features. The DVD is the original theatrical version. DVD has an good anamorphic Widescreen (1.85:1) transfer and an good Dolby Digital 5.1 Surround Sound. The worst thing is Friedberg and Seltzer's script. Sometimes their jokes starts as amusing, then so-so and then unfunny. Their visual gags and as well as dialogue doesn't help at all. But at least, \"Vampire Suck\" is more watchable mess than \"Disaster Movie\". Proske has one surprisingly sexy sequence with Latner, when she tries to seduced Edward by wearing sexy lingerie (A clever reference of \"Naked Gun 33 1/3:The Final Insult). Perphas the best thing about \"Vampire Suck\" is the end-title sequence with a music track by Marilyn Manson titled \"If I Was Your Vampire\" is a good touch. Otherwise, \"Vampire Suck\" is watchable but just don't expect much from the Friedberg and Seltzer team. (** ½/*****)."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "angell-an-wright",
        "review_rating": "9",
        "review_title": "Very funny, really doesn't deserve the low votes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "johnstonjames",
        "review_rating": "7",
        "review_title": "Pretty Much Does What It Professes To Do",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "neithie",
        "review_rating": "8",
        "review_title": "A staggering work of genius.",
        "review_detailed_main": "Okay. Maybe it wasn't quite that fantastic. But if you're one of those long suffering people who are mother of/lover of/husband or wife of/sibling of/father of/friend of/distant relation of/connected to a Twilight fan then you will fully appreciate this movie. To you long suffering people, Vampires Suck is probably as good (and as close to getting) as a hug from Stephanie Meyer who then goes on to beg for her devil writing before going on to promise that she will rewrite the entire series.\n\nYes. There are some bad jokes. There are some awful jokes! There's some moments where you'll cringe, or you might exclaim 'Oh my god!' out loud, and some where you'll laugh your head off.\n\nThe film follows Twilight and New Moon. 'Becca', Edward and Jacob are three angst ridden teenagers with love on their minds, hormones in their bodies, as they try to find true love and overcome true obstacles. Becca suspects something is strange with both Edward and Jacob. Edward and Jacob have their own problems to deal with.\n\nThis might be a parody but the creators of the film have realized something very important that Twilight fans have not yet realized- Twilight doesn't need the characters, scenes or plot changed to make it funny. It is one big joke on all on its very own. There's a few changes here and there, a few bad jokes (and good ones!), but the thing that is funniest about this film is that it IS Twilight. All actors really do a good job in this film but the three who play Bella, Edward and Jacob are stand out performers as they accurately mimic the characters of the original series.\n\nSo go see it. Have a laugh! It's therapy for you long suffering 'somehow connected to a Twilight fan' people. And if you're very badly off, I recommend you shout your Twi-fan to this film. \"Hey, I heard there was a great vampire movie about misfit teenagers in love! We should go see it. I'll even pay for your ticket.\" Good luck. :) (And for the love of sanity; do not take it too seriously.)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "shroyertour",
        "review_rating": "6",
        "review_title": "Good - would watch it again sometime.",
        "review_detailed_main": "What is it with folks who clearly do not like the Comedy/Spoof/Parody movie genre, then watch one, and write a review about how much they disliked it? I'm reminded of a comment Abraham Lincoln once made when asked about a book he was unfamiliar with, something to the effect that if that's the kind of book you like then you'll like that kind of book.\n\nSome of the best such movies ever made are only good for a chuckle here and there and a couple of healthy laughs, and only if you are familiar with the spoofed stuff. Imagine watching the Austin Powers movies or Johnny English having never watched a James Bond film. How about seeing Galaxy Quest having never seen a Star Trek movie or TV episode. Or watching Spaceballs without having ever viewed Star Wars and Darth Vader.\n\nIf you haven't seen the Twilight trilogy then don't watch this movie; you just won't get most of it. No, this movie is not as good the those previously mentioned (which are all excellent and I would definitely watch any of them anytime), but it is good, more on the level of Epic Movie, one that I would watch again sometime.\n\nThe formula for the humor is familiar, exaggeration and opposition. If a situation seems somewhat incredible, then exaggerate it until it is silly. If a moment is supposed to be warm and touching, then make it inappropriate and uncomfortable.\n\nThis movie does a pretty good job with this kind of humor. If this is the kind of movie you like, then you'll like this kind of movie."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "frogjunkmunk",
        "review_rating": "10",
        "review_title": "oh come on guys... i laughed the whole time",
        "review_detailed_main": "i honestly thought it was extremely funny. I've read all the books multiple times and seen all movies multiple times and have posters of the cast. its not a simple comedy.. its a mockery. mockery is SUPPOSED to be stupid thats why its funny i you don't think little stupid things are funny don't see it, but if you are amused by anything then you would really like it. everyone i know has liked it and the entire theater was cracking up the whole time and it was not just filled with giggly teenage girls: there were guys and adults of all ages and almost all of them were smiling and laughing. its stupid humor is not a stupid brainless humor like napoleon dynamite... its actually legit mockery.. like when u think 'oh it'd be funny if they did this!' i recommend you see it!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "jw-jessen",
        "review_rating": "6",
        "review_title": "Acceptable spoof of the Twilight saga",
        "review_detailed_main": "I went to see this film with a friend of mine a couple of hours ago, hoping for a good spoof if the twilight saga. Being quite a fan of the Twilight saga, having seen the films Twilight, and Twilight: New Moon (still haven't seen Eclipse).It was okay, in my opinion better than the scary movie series, epic movie, disaster movie, and the other spoofs of films the directors of this film has made.\n\nIt's quite funny to see how every character in the film is copied right off Twilight, with only minor changes in name, (some names not even changed), and the extreme over-playing of the original characters characteristics. Beccas (in Twilight Bella) expressions reminds one of the ones of Bellas in Twilight. It's not a masterpiece, but it's undoubtedly the best film if you should choose from the scary movie series, or as far as I know any other films made by James Friedberg and Aron Seltzer.\n\nI've seen Twilight, and I knew what Vampires Sucks made fun of, but my friend, who hadn't seen any of the Twilight films also found the film entertaining. Vampires suck was is good laugh, as long as you don't expect more than that."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sum123",
        "review_rating": "10",
        "review_title": "A shockingly underrated barrage of ridiculous hilarity",
        "review_detailed_main": "I'm giving this movie a 10 not because it is perfect, but because it is shockingly underrated and just like probably countless fanatic Twilight Saga fans gave it a 1 just out of spite, I'm giving it a 10 partially to spite them back. If it wasn't for this shockingly underrated reception, I would've given it a minimum of 8 anyway.\n\nThis movie seriously has scenes where there is continuous, non-stop hilarity for several minutes in a row, where many people should be laughing non-stop until their stomach muscles ache.\n\nDon't get me wrong; I'm not even a Twilight Saga hater! On the contrary, I very much enjoy watching the Twilight Saga movies, but I'm not a rabid fan either. In order to enjoy this movie, just do not expect it to overwhelm you with witty lines of humor or cute humor, no, this movie is ridiculous humor and sarcasm all the way, with the odd witty part here and there. However, the sarcasm and ridiculousness is oozing with creativity.\n\nI honestly haven't laughed at a comedy as much (and as hard) as I laughed at Vampires Suck. If sarcastic or ridiculous humor isn't your type, or you're a completely fanatic TS fan who reveres the series like it's something sacred, then simply move on and don't rate the movie. Otherwise, if you have the faintest interest in sarcasm, and if you can understand why it is OK to laugh at something completely ridiculous, then you simply must watch this movie! =)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Davi_Silva",
        "review_rating": "7",
        "review_title": "Surprisingly good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "haris_manda",
        "review_rating": "10",
        "review_title": "Enjoyable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "JStiles85",
        "review_rating": "7",
        "review_title": "Good Parody",
        "review_detailed_main": "Most of the time when we judge a film, we rate it based on its own merits, but in the case of Vampires Suck, there are two very important prerequisites to potentially enjoying the film:\n\n1. The viewer is familiar with the source material being parodied. In this case: the Twilight series.\n\n2. The viewer understands parody and satire.\n\nIf you understand parody, and are familiar with the Twilight series (as in you've at least seen the movies or read the books), then this film does a wonderful job as parody of the original source material. It criticizes some of the largest weak points of the source material, without too much inane crude humor.\n\nI have read Twilight (but avoided the films like the plague) and found the film to be quite entertaining as parody, but not as a film in it's own right. Where this movie could have really grown would have been to work more on a plot capable of standing on its own. So, I would recommend this movie, but first go pick up the Twilight books, read them and have your own critical opinion of the source material before seeing this movie.\n\n(I can't believe that I just told people to go read Twilight...)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "pookiendk522",
        "review_rating": "8",
        "review_title": "Not nearly as bad as everyone is saying...",
        "review_detailed_main": "Pretty much every other review says this movie is terrible, but my friends and I all thought it was hilarious! The only thing I suggest is watching the real Twilight movies if you haven't already seen them, otherwise a lot of the references wont make sense. I am the typical Twilight-hating teenager, so if you're like me you would think it's a good movie. No, the plot isn't original, but that's kind of the point of a spoof... The actress who plays Becca is PERFECT! She has all the awkward mannerisms exactly the same as Kristin Stewart. If you're the kind of person who doesn't like stupid-funny movies, then this may not be for you, but I personally thought it spoofed Twilight perfectly and it was really really funny."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "heathernugent17",
        "review_rating": "7",
        "review_title": "For lovers and haters",
        "review_detailed_main": "I'm one of the biggest twilight fan and my friend she told me i should watch this movie so when it came out on DVD i watched it with my friend a twilight hater and i love it.\n\nThis could just be cause my friend and i are younger and there for the joke are more aimed at use but we couldn't stop laughing. I also even though i'm a twilight fan found all the joke and stabs it took at twilight and all the jokes about pop culture made my laugh so hard. Also we both agreed that Jenn Proske was a perfect mirror of Kristen Stewart and Matt Lanter was so much hotter then Robert Pattinson.\n\nSo if you are either a twilight lover or a twilight hater you will enjoy this film."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "zardoz-13",
        "review_rating": "8",
        "review_title": "Hilarity at First Bite!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "juneebuggy",
        "review_rating": "6",
        "review_title": "Lost sight of the fact that it was meant to be a parody but it still made me laugh",
        "review_detailed_main": "So despite all the horrible reviews I quite liked this. I think any true 'Twilight' fan will at least appreciate it, although in saying that it did try too hard and lost sight of the fact that it was meant to be parody; essentially just remaking the first two movies down to the smallest of details including location, dialogue, similar music and even the clothing worn.\n\nJenn Proske as Bella/Becca does give a pretty brilliant impersonation of Kristen Stewart though, nailing her annoying ticks. And the wolf pack in their tiny shorts doing a rendition of \"its raining men\" really made me laugh. Jacob was probably the most entertaining character in this movie, going through his shirtless, cat chasing changes.\n\nIn the end I'm sure I've seen equal content on 'Funny Or Die' but as a (closeted) Twilight fan I did get a kick out of this. 10.13"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "dawnkytty",
        "review_rating": "10",
        "review_title": "Pretty Good",
        "review_detailed_main": "This was probably the best one of the \"spoof\" movies that have been made. A more accurate title for the movie would be \"A Giant Twilight Spoof\". I don't care much for the series, so this movie was hilarious to me. If you really watch this movie expecting a great plot, with moments that are touching, then you are being too uptight. It's a spoof. It's made for little moments to make fun of current events that are popular. I would say that if you don't care about the Twilight series (or don't mind laughing at it) than you should see this movie. But keep in mind that it is just a spoof. Not anything extremely original."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "snakey97",
        "review_rating": "7",
        "review_title": "My guilty pleasure... because I found it funny",
        "review_detailed_main": "I don't care everyone else's hate for it... I thought this film was quite funny in places. Like when Edward Sullen is on a dare-way. Or when the werewolves are dancing to 'It's raining men'. The film is quite pretty and crisp, and the storyline isn't all that bad. If they were to ATTEMPT a sequel, I would pay good money to see it, I assure you all that.\n\nBella Crane (Jenn Proske) is an awkward anti-social teenager moving from the sun to the dismal town of Sporks to spend some \"quality time\" with her dad, Frank Crane. Whilst at her high school, she meets the beautiful Edward Sullen (Matt Lanter) an equally isolated teenager who is more than he seems.\n\nAn enjoyable laugh, perfect for beating the blues."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "dim-berbatov",
        "review_rating": "9",
        "review_title": "A funny movie",
        "review_detailed_main": "This movie turned out to be funnier than I expected. I laughed at least 15-20 times during the movie (:\n\nThe movie, as you can see from the title, parodies vampires and other things that are used in the entertaining industry and are fully orientated to the insecure and impressionable teenage girls and bore the other regular people to death.\n\nI don't know why people in this site don't like spoofs, but I think some of them are really funny(especially Scary Movies) and in my opinion deserve more than the user rating given by the people here.\n\nSo I recommend you to watch the movie and if you like comedies, you gonna like it too!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "GiraffeDoor",
        "review_rating": "6",
        "review_title": "It may suck but it doesn't blow.",
        "review_detailed_main": "OK, I'm not a super fan but this is so not the 46th worst movie ever.\n\nAs someone who neither loves nor hates the Twilight Saga, I found this to be an agreeable send up of this culturally significant franchise.\n\nA dumb movie by premise, it delivers what it promises as well as we could expect it to.\n\nYou know what these movies are like and this is one of the relatively better ones. About Date Movie standard I'd say."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "zane_deen",
        "review_rating": "8",
        "review_title": "Just what i expected it to be...hilarious!!!",
        "review_detailed_main": "I personally hated every movie from the Twilight Saga and was dearly pleased when news came of a spoof of it and eagerly anticipated it. I must say I really enjoyed the Vampires Suck solely for the fact that it is a spoof of Twilight. I was pleased with the typical stereotype of vampire...burns to death in sunlight, can be killed with a stake through the heart, doesn't like garlic. But Stephenie Meyer's new fabricated vampires truly suck eggs. I mean, a vampire glittering like diamonds in the sunlight is just pathetic. Maybe Stephenie could have added that they crap out gold too.\n\nWhat made the movie great was the fact that the actors portrayed their characters so perfectly. Jenn Proske as Becca was apt in Bella's shoes. I usually found Bella to have been suffering from constipation every time she said a line and Jenn was good in bring that out. Matt Lanter (screen name Edward Sullen) as Edward Cullen was equally convincing. Anyone can be Jacob as long as they have a tan and a six pack!\n\nI personally cannot stomach another Twilight saga movie and this was the perfect antidote to the torture It would bring. As the punch line says, \"From the guys who couldn't sit through another vampire movie!\", I guess I am another addition to that list of guys.\n\nTo all the guys out there who truly do not like the Twilight Saga, I recommend you watch Vampires Suck and get some justice done to yourself. To all the lovers of Twilght, also Team Edward and Team Jacob and all you other wannabes, i guess you can just suck it."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "RoyJohnson490",
        "review_rating": "6",
        "review_title": "Watch it with an open mind and a pure hatred towards the Twilight franchise",
        "review_detailed_main": "Episode #4 of Lionheart490's IMDb Movie Reviews\n\nNow I will admit that I hate Friedberg-Seltzer films, I watched Epic Movie and I thought it was just stupid. I, literally, was capable of watching Meet the Spartans for only 10 minutes on DirecTV before I changed the channel. And I'm not even going to bother to watch Date Movie or Disaster Movie. But the recent Friedberg-Seltzer film that just came out on DVD is certainly one that caught my eye. The movies that the Friedberg-Seltzer crew decided to rip-off a film series that I personally hate: the Twilight film series. Now, Twilight I feel has disgraced vampires everywhere, there was a time where vampires were scary and children couldn't sleep because they believed their blood was going to be drained from plain-skinned demons. Now, they apparently have smooth sparkly skin that fan girls just can't resist. So I believed that maybe these idiots are going to do something right and use they're sickish film-making to benefit us Twilight-haters and that is why for once, I wanted to see this Friedberg-Seltzer film. Now, when this film got into theaters, it, to me, had gotten mixed views. But I'm not going to listen to them, instead, I'm going to watch Vampires Suck with an open mind and a pure hatred towards Twilight on my mind and then, I'll tell you which sucks more: vampires or this movie?\n\nAnd to my surprise, I liked it. I mean it isn't the funniest film I ever saw and I shouldn't be, but I will say this may be the best Friedberg-Seltzer film ever. I never laughed out loud but I sure had a lot of chuckles, which is more than I could say for the other Friedberg-Seltzer films. I think the reason I liked this movie is unlike the other Friedberg-Seltzer films that simply just took the main plot of a certain movie (ex: The Chronicles of Narnia: The Lion, the Witch and the Wardrobe, 300) and added it with a bunch of stupid movie references to it. This film mainly focused on the Twilight film series, they might some pop culture and film references but not enough to ruin what this film is mainly doing: mocking the Twilight franchise. The jokes aren't half-bad either, it's not laugh-your-ass-off funny, but it gave me more chuckles than I expected. For once, the FS crew actually made a spoof film, not a giant ugly wad of crappy movie references like the other films. Their references to Twilight were really funny (ex: like how nobody relies that the Sullens were vampires). I must say maybe the FS crews were getting BETTER at their jobs (AHHHHHH!!!!!)\n\nOverall, I think this is the best FS film ever. Just watch it with an open mind and a pure hatred towards Twilight, and you'll surely enjoy it. I give this movie 6/10 stars."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "the_wolf_imdb",
        "review_rating": "8",
        "review_title": "Finally! The movie for us who HATE Twilight!",
        "review_detailed_main": "Let's say it straight: I think the Twilight saga is both the most pathetic and the most brain dead teenage series. It is insult both to horror genre and the general intelligence as well. Its only excuse is that it is basically just a red book library intended for emo / metrosexual teenage generation.\n\nThe Twilight fans will hate this comedy deeply! The \"Vampires Suck\" comedy actually shows the naked truth about the Twilight. It does not differ much from the Twilight saga, it shows the stupidity of the original plot and makes the fun of every inch of it - from the bizarre Becca character to the both metrosexual doggie and battie clans. But the parody does not stop here - the authors do make fun from the American puritans, the celebrities and even the Twilight fans as well.\n\nThe movie is silly because the original series is silly. The Twilight series deserved this treatment so much! At least the score is settled! I had to suffer the Twilight, now I have laughed the way through its parody which was way more enjoyable. Seriously good fun!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "aj-sigmaprojects",
        "review_rating": "7",
        "review_title": "Much better than a 3.3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Zerbey",
        "review_rating": "8",
        "review_title": "It didn't suck",
        "review_detailed_main": "Let me first say, I'm not a Twilight fan. But, since most of the women in my family are obsessed with it I've been forced to watch all of the Movies several times. They do suck!\n\nVampires Suck seemed like it would be a fun movie, parodies are a favourite of mine. It did not disappoint. Although it was supposed to be a parody the acting was actually BETTER than the acting in Twilight (not a big stretch, I know). Jenn Proske absolutely nailed the \"Bella\" character, right down to the silly mannerisms - I was in tears of laughter during every scene. Maybe the produces of the Twilight saga should do some recruiting?\n\nIf I had one complaint, the movie was basically a run through of the Twilight saga. I was hoping to see parodies of more Vampire movies and some other pop culture references."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "sjmutchie",
        "review_rating": "7",
        "review_title": "Great for laughs; even for fans",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "applegrew",
        "review_rating": "8",
        "review_title": "One of the best spoof.",
        "review_detailed_main": "It's funny, that it is rated so low. It is one of the best spoofs. Everything that is ridiculous about this franchise is very much highlighted and exaggerated in this movie. Well maybe exaggerated too much, but hey, this is a spoof. One more brownie point about this movie, is its cast. They all look so, out of the real movie. You will be forgiven if you mistaken this movie for the real one if had a fleeting glance.\n\nOne thing I hate about the spoof genre in general is the unnecessary gore. I don't find gore funny. This movie is not so gory, but I wish it didn't have any.\n\nAll in all, this is must see movie, if you are tired of this ridiculous franchise. If your girlfriend made you sit through these movies, then this is the perfect payback for them. Enjoy!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "rsmall1806",
        "review_rating": "6",
        "review_title": "A watchable vampire movie spoof",
        "review_detailed_main": "I find myself watching this film again when come across it on my movie channel. I think Jen Proske's impersonation is excellent. The film is outrageous and violent but entertaining. Vampire movies are all violent. I suspect vampire film aficionados are offended when this genre is spoofed. The fact that there are relatively few reviews does not mean it's a bad movie. I realize the sparse reviews can mean a dud. Vampires Suck is not a great movie but I believe the movie is significantly better than its IMDb rating. I could be wrong. I notice there is not a large number of reviews. The fact that the movie is not popular speaks for itself. However it probably did not get much promotion. I notice box office income is double it's production cost. I suspect this movie did not have much promotion.\n\nTo IMDb staff: Please remove MD from my name on your site. I am a physician but I prefer to keep my movie interest separate from professional activities."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "iliqna-35637",
        "review_rating": "10",
        "review_title": "Still a better love story than Twilight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "nickkarcher1",
        "review_rating": "10",
        "review_title": "'Vamprires Suck' is a spoof, take it for what it is.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Safecove_",
        "review_rating": "7",
        "review_title": "So cringe its good",
        "review_detailed_main": "Vampires Suck is a silly parody movie that I watched in theaters at WAY to young of age because of me & my mom both being twilight fans. I was either 9 or 10 when this came out lol, I was both confused and amused by its funny changes to the original films, particularly the intensely exaggeration of certain scenes or like when they took the wold back & made Jacob a tiny little pup lmao. The film is undeniably dumb and cringey, but that's where its charm lies. From exaggerated characters to over-the-top scenarios that all parodies have, it serves up a delightful dose of absurdity and camp vibes while being still standable to find entertaing."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "megggymag",
        "review_rating": "10",
        "review_title": "I liked this movie",
        "review_detailed_main": "When I saw Twilight I got so disappointed by the actors and the movie itself that I just got totally mad every time I met any kind of news about it. It is insane how they could ruin the whole with \"writing over\" every single scene making it more depressive than it should be and how irritating the actors played their characters (except one or two like Alice and Emmett...) so I decided to watch the comedy version. I strongly believe if Jenn and Matt played Bella and Edward they would have done a way better performance than Kristen and Robert - sorry from the ones loving them... I could also laugh loud on the jokes and I bet the director did a better job on this - at least copied the same method which with better jokes made it more enjoyable."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "A Dream Come True!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "alonate",
        "review_rating": "7",
        "review_title": "Guilty Pleasure",
        "review_detailed_main": "I'm not gonna lie. This movie made me bust out laughing. I know, I know.... It's cheesy, It's queasy, and it's down right dumb. But man did I enjoy it. My wife made me sit through those horrible Twilight movies, so knowing that this was a spoof of the sparkly vampire teen romance garbage, I loaded the movie on one of our streaming services and made her watch without her knowing what it was about. I thought this would be my sweet revenge upon her. Much to my surprise, she thoroughly enjoyed it and was laughing harder than it was! She thought it was a great send-up of characters. Anyway, If you've seen the Twilight movies, I highly recommend (Whether you did or did not like them doesn't matter.)"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "lizdawizz",
        "review_rating": "10",
        "review_title": "I laughed!",
        "review_detailed_main": "So it was bad...really bad. But isn't that the point of \"Spoof Movies\"? Lol I had to turn Epic Movie off after like 20min because it was THAT bad...but I don't think this was THAT bad! I laughed more than I could count on my fingers and it did what it set out to do...MAKE FUN OF TWLIGHT!!!! And that, I give a 10/10.\n\nEveryone is giving reviews as if this was supposed to be a serious movie, but it wasn't. It's a SPOOF! Chill people...\n\nI wouldn't pay 8$ to see it again...but I would watch it online. It's worth seeing if you totally dislike Twlight like a bunch of people do (Even teens, I'm 17...)."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "syang-17861",
        "review_rating": "7",
        "review_title": "Decent Parody Very Good Jokes Hot Actors",
        "review_detailed_main": "The original Twilight has many many problems but the vibe and music was actually not bad. (Not a fan anymore since I was 11.) Vampires Suck is absolutely hilarious and the actors are actually really hot. They captured the acting style of the original Twilight super well. The soundtrack and editing is not bad either. Worth the watch for a cheesy fun little comedy. Not a masterpiece but still decent. The other thing really nice about this one is that the pacing is so much better than the original film given that it cramped everything in two films into one. Its sequel Breaking Win is also very funny. Recommend that too if you like this one."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "kressckerl",
        "review_rating": "8",
        "review_title": "Great silly movie",
        "review_detailed_main": "The movie was really funny, especially when you get all the references. The movie tries to be silly and it does that successfully and has great humor.\n\nIt also has funny 4rth walk breaks, I love 4rth wall breaks(when a character talks like he is watching the movie with us)\n\nMinor spoiler: But towards the end, it seemed more serious with and less fun.\n\nAll in all, it is a great parody"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "GouramiWatcher",
        "review_rating": "8",
        "review_title": "Perfect for those who love comedy and hate Twilight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "gianmarcoronconi",
        "review_rating": "9",
        "review_title": "Funny",
        "review_detailed_main": "This is not a real review, it should be taken more as a collection of impressions on the film.\n\nObviously a parody film of Twilight which completely nails the intrinsic stupidity of the original film, the film undoubtedly makes you laugh and perfectly follows the trend of all parody films like this. So the film is obviously not a masterpiece but it makes you laugh a lot and this is its only purpose so let's say that for its purpose it hits the target squarely. The advantage of films like this is that they are definitely not boring because they are so stupid that they make you double over laughing every second of viewing. So ultimately the film is terrible but it wants to be so on purpose and therefore it is a masterpiece."
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "dennissuryana",
        "review_rating": "10",
        "review_title": "I think these people who badly review this movie are butthurted Twilight fans",
        "review_detailed_main": "I think the people who gave this movie bad reviews are just butthurt Twilight fans who can't take a joke. Vampires Suck is a parody, and it does exactly what it promises-makes fun of the absurdity of Twilight in an over-the-top, silly way. It's not meant to be a cinematic masterpiece; it's for those who want to laugh at the ridiculousness of sparkly vampires, melodramatic love triangles, and cringe-worthy teen angst. The humor might not be for everyone-it's immature, goofy, and sometimes gross-but that's the point! If you go in expecting clever, highbrow comedy, you're in the wrong place. But if you've ever rolled your eyes at Edward's brooding or Bella's endless stares, this movie is for you. It's self-aware, ridiculous, and full of gags that hit the mark if you know the source material. Honestly, I laughed so much, especially at how they exaggerated the most ridiculous moments from Twilight. Not every joke lands, but overall, it's hilarious. 10/10!"
    },
    {
        "movie_id": "tt1666186",
        "movie_name": "Vampires Suck",
        "movie_rating": "3.4",
        "review_username": "estebangonzalez10",
        "review_rating": "",
        "review_title": "The Worst Movie of 2010...It just sucks",
        "review_detailed_main": ""
    }
]