[
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "kdedhia7",
        "review_rating": "8",
        "review_title": "Gabbar Is Back",
        "review_detailed_main": "Saw #GabbarIsBack in single screen. I swear it was a thunderous experience. People were clapping and whistling and all. Nothing new in the content, it has action romance emotions comedy message and great dialogue's. If you loved Singham, Rowdy Rathore, Dabangg then you Just Cannot miss #Gabbar its a Typical Masala muvie with great message. There is one Hospital scene before the intermission which is EPIC. THAT scene is beyond exceptional. Akshay Kumar as usual is Brilliant. Classic performance by him. Sunil Grover(Guthi) is impressive. Shruti Hasan looks hot. Kareena Kapoor looks beautiful in her cameo (Teri Meri Kahani) Chitrangda is quite seductive in Kundi mat. Overall a good entertainer and this can be the first movie of 2015 to cross 100 crore. Go watch and enjoy."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "gourav09071994",
        "review_rating": "7",
        "review_title": "A masala movie that is no non-sense!",
        "review_detailed_main": "Gabbar is Back is a common man's fight against corruption. The movie justifies its name as Gabbar has been the biggest villain in Indian Cinema history. But this time Akshay Kumar adopt this name to fear the corrupts. He starts his own mission to destroy them and his way of doing so is brutal.\n\nMovie is a bit slow in parts especially in first half but it doesn't boar you to core. We feel convinced with the proceedings and can actually feel the anger against the protagonist. This is what makes this movie different from other routine mass entertainers that audience get connected to the plot. Second half is solid with some really action packed sequences. Climax is ample and we feel convinced while coming out of the theater. There are minuses in the movie as every movie has but they don't irritate you. Slow pace and loud BGM are two drawbacks.\n\nAkshay Kumar again plays the lead role quite brilliantly and after Baby , he has given another commendable job. His dialog delivery is just rocking. Action is always a plus in his movies. Shruti Haasan is cute and does her part good. The villain played by Suman is convincing. Sunil aka Gutthi is a bonus as Police officer. Kareena looks stunning in cameo while Chitrangadha is ravishing in item number.\n\nDirection by Krish is good. Story and Dialogues are apt and support the movie a lot. Editing could've been better. Music is average with loud BGM. Cinematography is good. Action is OTT but looks good played by Akshay.\n\nOverall, GIB is a convincing movie with a storyline that would connect audience and that's where it hits bulls' eye. It would be loved by one and all as it is a true entertainer. Go for it because there are very few no Nonsense masala movies made in Bollywood and GIB is one of them. Enjoy guys!"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "Indian_Joker",
        "review_rating": "8",
        "review_title": "Need more of movies like this!",
        "review_detailed_main": "Akshay Kumar is making so much sensible movies nowadays. Holiday, Baby and now \"Gabbar Is Back\" with a bang. This is a story of Aditya/Gabbar (Akshay Kumar), a lawyer's assistant and the hero's romantic interest Shruti (Shruti Haasan), a lowly but ambitious constable Sadhuram (Sunil Grover), a swaggering CBI officer Kuldeep Pahwa (Jaideep Ahlawat) and a villainous real estate tycoon Digvijay Patil (Suman Talwar).\n\nIn era of HNY, KICK like nonsensical movies, we have some of these gems. Watch it definitely 1 time watch!\n\nAkshay Kumar is making so much sensible movies nowadays. Holiday, Baby and now \"Gabbar Is Back\" with a bang. This is a story of Aditya/Gabbar (Akshay Kumar), a lawyer's assistant and the hero's romantic interest Shruti (Shruti Haasan), a lowly but ambitious constable Sadhuram (Sunil Grover), a swaggering CBI officer Kuldeep Pahwa (Jaideep Ahlawat) and a villainous real estate tycoon Digvijay Patil (Suman Talwar).\n\nIn era of HNY, KICK like nonsensical movies, we have some of these gems. Watch it definitely 1 time watch!"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "gurmeet2970",
        "review_rating": "10",
        "review_title": "Awesome Entertainer with a very strong message..... Akshay Kumar as GABBAR Rocks",
        "review_detailed_main": "The best movie of the year after BABY Fabulous performances, awesome dialogues, & good music. Its a complete entertainer with a very strong message. Akshay Kumar has again proved that he is the most versatile actor of the last 2 decades.\n\nInterval & Climax scenes are one of the best ever. Akshay Kumar is in top form & gives a memorable power packed performance, Shruti is good too, Sunil Grover surprises with a superb act, Jaideep & Suman has done a great job in their roles. Direction by Krish is very good, he has shown Akshay Kumar as GABBAR in the best way. And special credit for the Stunt Director Stunt Shiva for his amazing work in Action. The Action is so real that u can feel the punches & kicks & Akshay Kumar have performed the Action scenes effortlessly at this age.\n\nSo, if you are a fan of good cinema then This GABBAR will make you Happy with his take on corruption.\n\nMAIN HOON GABBAR"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Full-On Masala Entertainer!",
        "review_detailed_main": "A remake of the 2002 Tamil film Ramanaa, 'Gabbar is Back' is A Full-On Masala Entertainer! Its not an amazing film, but an engaging watch, nonetheless. Here's a film that's sure to work big time with the masses!\n\n'Gabbar is Back' Synopsis: A grief-stricken man takes the law into his own hands when he begins to kidnap and murder corrupt public servants.\n\n'Gabbar is Back' is high on entertainment & that honestly, does the trick. Sure, there are flaws here. The second-hour does get a bit tedious & the dialogue are unintentionally funny at times, but overall, this commercial pot-boiler hits higher on pluses than on minuses.\n\nThe storyline is simple, but the treatment is crisp & interesting. The protagonist's journey to punish the evil within our society, has moments of power. I'd like to single out that terrific sequence at a hospital in the first-hour & also the nicely done climax, which delivers a message with honesty.\n\nRajat Arora's Adapted Screenplay moves on a very fast-pace & offers some great moments. But, the second-hour isn't as good as the first-hour. Its a bit tedious & acts as a deterrent in the narrative. Even some of the dialogue, are unintentionally funny. Krish's Direction is pretty decent. Cinematography could've been better. Editing is pretty tight. Action-Sequences are excellent. Music by Various Artists, is alright.\n\nPerformance-Wise: Akshay Kumar as Gabbar, is in serious from. Its so good to see the superstar donning a part, that we often don't see him in. He enacts the protagonist with admirable conviction. Shruti Haasan is wasted. Sunil Grover is a pleasant surprise here. The TV phenomena essays an important part with great energy. Suman Talwar, as the antagonist, is loud. Jaideep Ahlawat is first-rate. Ishita Vyas is sincere in a brief role. Kareena Kapoor Khan & Chitrangda Singh appear in cameos.\n\nOn the whole, 'Gabbar is Back' has the potential to become a winner commercially. Go, have fun!"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "rowdyassassin",
        "review_rating": "9",
        "review_title": "Excellent movie !! A must watch for all !!!!!!!",
        "review_detailed_main": "What sets \"Gabbar is Back\" apart in the genre is its unabashedly massy tone. Here is a film about a man who decides to take charge of a social order on the brink of anarchy when all the formal faculties fail. He doesn't believe in reprimanding the corrupt. He believes in punishing them with death. Yup, this Gabbar means business. And to the character's good fortune, he is played by the very watchable Akshay Kumar. For my money and time, Akshay is by far the most complete star-actor package among contemporary A-lister heroes in Bollywood. With due respect, none of the other A-lister superstars of Bollywood have the power to sway the masses with idealistic rhetoric. It's in his eyes. Akshay makes you sit up and listen without raising his voice. Shruti Haasan, who plays a lawyer, doesn't have much to contribute. She pouts perfectly and has an unhealthy dependence on Google search. Her introductory scene in which she swoops in to deliver a baby in the backseat of Gabbar's car based on her internet research (long story\u0085 has no particular relevance to the film) is roll-your-eyes funny. Kareena Kapoor Khan in her role as Gabbar's first love isn't a knock-out portrayal, but the good news is that she just had a song cameo and was freed from mouthing any corny lines. Despite everything, the film survives to tell-a-tale that is relevant today. 'Gabbar Is Back' knocks the bottom off the action genre with a breathless ode to Swachh Bharat. P.S. Use 9xbuddy to download videos from you tube , IMDb and many more sites online :)"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "Ansango",
        "review_rating": "6",
        "review_title": "An action film with a social theme.....",
        "review_detailed_main": "Gabbar is back is an action film with a social theme.But if you compare this film with previous Akki's social action films like Holiday and Baby then it is inferior to them.The theme of the movie is noble but its presentation is weak.The biggest problem here is the impuissant and predictable plot which has not been developed nicely.The movie raises the topic of corruption but the script of this movie itself is corrupt and heavily borrows from various movies of the genre.The script is not good enough to sustain this movie and its serious and thought provoking content.The plot also contains some loopholes.Still the entertainment quotient of the film is high,so it manages to engage you for 2 hours.The scene in the hospital,kidnapping of villain etc. are some scene which has been executed nicely.\n\nAkshay is a dynamite and if you want to know why then just watch this movie.His look and dialogue delivery is unblemished.He looks very agile in action scenes and due to his friskiness the beyond belief action sequences looks so persuasive and reliable.Shruti dances well but has nothing to do in this movie.Kareena is unexceptional in a small cameo.Sunil grover was superb.I liked his acting as he acts so believably.Jaideep was ordinary.Suman does the same things he had done before.\n\nDirection of the movie is nothing special and is ordinary.While watching the movie,i felt like i am watching a dubbed south Indian movie.Music of the film is good.The item song is sizzling.Action choreography is awesome as the action sequences are very good.Editing is also good.If a little attention was paid to the script,then the movie would have been more sharper and tenser.\n\nThe climax of the movie looks like a forced one.Still the movie manages to convey the message to the audience while not being too preachy.\n\nGabbar is nothing new but is passable flick due to its well choreographed action scenes,Akshay's amazing acting and its fast paced screenplay.If you are a fan of Akki then its a MUST WATCH for you.Otherwise its just an above average action flick which is a treat for mas-ala and hardcore action lovers.The movie was supposed to be a hard hitting social drama but fizzles due to its feeble writing.\n\n6.3 out of 10 is enough."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "srivastavagaurav",
        "review_rating": "10",
        "review_title": "Excellent lesson from this new GABBAR",
        "review_detailed_main": "Awesome movie with very good lesson... Especially the climax and ending of the movie was great. \"MAIN HU GABBAR\". Akshay was superb, dialogues were also great. We need this kind of movies in bollywood which actually spread good and positive lesson to country. At least we can learn from them. Akshay is doing really good work, after \"Oh My God\", \"Holiday\", and \"Baby\" he is \"back with GABBAR\"...\n\nAll are meaningful and sensible thoughts in them. Happy to watch these kind of movies in bollywood.\n\nAll I can say that Manoj Kumar is back with new style named Akshay Kumar"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "yasubmj",
        "review_rating": "6",
        "review_title": "Time pass entertainer, no real depth.",
        "review_detailed_main": "Akshay Kumar's Gabbar feels very much like the popular and loved Rajanikanth movies, where he finds and punishes corrupt people in unique and enjoyable to watch, ways. He pretty much succeeds in doing just that. If you are looking for cerebral cinema, this is not for you. This one is for those who like light straight forward on the face easy to decipher entertainment. Can watch, not a must watch."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "0U",
        "review_rating": "",
        "review_title": "Not impressed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "nairtejas",
        "review_rating": "3",
        "review_title": "Been There, Done That. ♦ 33%",
        "review_detailed_main": "I could bet this is the nth time a film based on the theme of a common man turning into a city vigilante is made. Although I am not quite sure of the purpose of creating such movies, Gabaar is Back is no different from its previous/similar versions.\n\nA good guy who tried to fight with the bad guy ends up almost dead after his pregnant wife is also killed in an unrelated incident. Years later, the good guy, now convalesced and fit and fine, starts an underground vigilante group, hiring fellow students who he thinks has the ability to change the way the bureaucracy works (in India). Plus, a girl who had been roaming around the studio (while the film shooting) for a role was given to play the character of a girl who I have not yet been able to fathom the necessity of.\n\nThe protagonist constantly repeats \"Gabbar is back!\" so as to reiterate the fact, which may be to wake up the audience if the ennui had rendered them dead asleep. The plot is straight preachy and deals with giving us superficial pleasure to know that corruption has finally been wiped off the tables. But once you get out of the theater, you may still get anxious that tomorrow you have that police verification for the issue of passport where you will need to grease few hands. Unfortunately, Gabbar is fictitious and will stay that way. If one fails to realize that, the film is a definite 10 on 10.\n\nEven a fourth grader could guess who plays the characters I have mentioned above, so I won't go over it. Their performances were fine, and there's nothing much to talk about, except maybe Kumar; he does a better job and the three stars are for him. Shruti Haasan acts like she was handed a textbook and asked simply to read.\n\nBOTTOM LINE: Gabbar is Back uses the same old formula where the common man turns into a rebellious smart-Aleck who suddenly has the skills of a martial artist-wrestler crossover and brains of a genius. The only difference is he's trying to eradicate corruption this time; its sequel will deal with attacks on women, and betel-nut- chewing Bhansali tells my sources that \"Gabbar will be back after he makes love with his Girlfriend (2034)\" will deal with selfie stick abuse and android sex. 3/10 - avoidable.\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "anikanigam",
        "review_rating": "9",
        "review_title": "Very good movie which will make you think..every youth should watch it.Its what we need to think , its what we need to watch ..in present scenario.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "jogeshwarjan",
        "review_rating": "7",
        "review_title": "Go for it but don't expect too much",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "dineshprakash",
        "review_rating": "4",
        "review_title": "That Gabbar was filmy but looked real, this Gabbar pretends to be real but is typical filmy",
        "review_detailed_main": "Story line is simple but I support the motto and message behind this movie. Screenplay lacks intelligence. Screenplay only passes the information without any emotion. Dialogues by Rajat Arora, are good at places. Main protagonist character has been introduced as a common person but he always behaved and reacted like extra ordinary. Hanging a person or even a dead body in public place, which requires crane to bring down, is not an easy job. Kidnapping also requires some intelligence with trick but here it has to be happen so happened. Kidnapping of DCP is just assumed. If ones life is on threat then why did he allow persons to come in his birthday with mask, even mask has his own face? Film lacks thrill. Investigation about Gabbar looks fake. Female protagonist is lawyer but just for bailing out few persons in pre climax!! Main Villain does not stand out in front of Hero. Film gives typical south Indian movie feel, where a dead body used to come back with some miracle, is very common. Songs slows down further to the already slow movie. Akshay Kumar is very good. Shruti Haasan is fine. Sunil Grover surprisingly never gives any glimpse of his type cast image. He is good."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "ahmedsaqib",
        "review_rating": "9",
        "review_title": "Excellent movie",
        "review_detailed_main": "The movie was simply superb. The acting of each individual actor along with the fantastic message provided to us in the shape of gabbar is just too good. This movie is a must watch if you are tired of a corrupt government and while you see the government being rectified, you will get some solid entertainment and a laugh every now and then too. It is an inspirational movie too. Overall a must watch if your an akshay kumar fan and also a fan to see an end of a corrupt government in 2 hours and 10 minutes.\n\n.\n\n."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "ahwaan_padhee",
        "review_rating": "6",
        "review_title": "Gabbar is Back",
        "review_detailed_main": "Akshay Kumar is indubitably the undisputed king of 'zimbly' south remakes which have been raking in the dough in Bollywood.And producer like Sanjay Leela Bhansali who tasted a giant dash of success with Rowdy Rathore,leaves no stone unturned to make his venture a money spinner with the action star in the lead.With a title that alludes to Bollywood's most remembered antagonist, this film stages the dashing Kumar as an undercover vigilante, punishing the corrupt officials in our society.\n\nA remake of the 2002 Tamil super-hit film Ramanna, Gabbar is back's premise feels a bit outdated mostly because of its semblance with films like Ungli and Kick.Here is a common man with a death wish, who is remorselessly wronged by the establishment. Akshay is professor Aditya in the daylight who teaches his student the five forces (and applies them on the goons too!) and the elusive Gabbar in the dark who punishes the bribe seekers to death.As he tag-lines his name himself \" Naam Villain Ka, Kaam hero ka\",Gabbar has an efficient underground army who kidnap the corrupt guys from every department , causing a predictable unrest among the policemen.In his long drawn modus to reform the system, Gabbar locks horns with a very powerful industrialist,Digvijay(Suman Talwar) who apparently has a notion that he is a big brand and can manipulate anybody and anything.\n\nDirector Krish forays into Hindi cinema and crafts 'Gabbar' with all the solid ingredients of a commercial potboiler, but everything about the movie feels a lot exaggerated.The back-story which involves the gorgeous looking Kareena with only a song sequence lacks the emotional punch and the constant bullying of Sunil Grover, who does a sincere job, by his seniors is overwhelming.Equally disappointing is the way in which the leading lady, Shruti Haasan is positioned a dim-wit lawyer who spends half of her time rattling off google trivia.Yet, its a decent fare constantly watchable because of its leading hero,Akshay, and his inimitable energy and persona.Though he looks bit exhausted with that salt-n-pepper beard, the clap-trap one-liners(Rajat Arora) do the trick.Each dialogue is a punchline, paying homage to the cult character of Sholay.Another shortcoming is the strong counterpoint that Gabbar's nemesis , played by Suman Talwar , fails to offer.Challenged by the script, he doesn't exude the menacing vibe that Akshay needed to combat.\n\nThe treatment obviously resonates a highly outrageous and impragmatic solution, and the message that it disseminates is risky to fathom.It is okay if you don't take them very seriously and enjoy it as a classy masala flick.\n\nFans of Akki - this one is for you !\n\nRating : 3/5"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "ajaydhiman4991",
        "review_rating": "9",
        "review_title": "Nice movie..or we say bollywood movie",
        "review_detailed_main": "Story of movie is quite good.. But not the direction.. It could be made better..but that better doesn't earn much from it.. Its a typical bollywood directed movie.. few songs with item no... It gives a great message..and of course..Akshay is fabulous in his role.. Although a much better movie ca be made with this good story.. Action of movie is up top.. But if you like bollywood masala movie..then its for you.. i'm little disappointed with he direction of movie..but overall its a good movie..don't judge this on direction scale..see the message in the movie.. and we love akshay as gabbar..he proved that he is one of the finest actor in bollywood."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "ketgup83",
        "review_rating": "7",
        "review_title": "Gabbar Is Back has right intention with Akshay Kumar ruling the roost",
        "review_detailed_main": "Akshay Kumar is one such star who has been entertaining the Bollywood film industry for 25 years and yet his choice of selecting films has been subjective with classic thuds like Once Upon in Mumbai Dobara, Joker , Khiladi 786, Its Entertainment and The Shaukeens to name few. Fortunately, Holiday and BABY were breath-taking. The good news is Gabbar Is Back , though follows the trend of 90's potboilers which comprises of action, melodrama , routine song and dance, has right intention with raw-punching dialogues, commendable action scenes and of course Akshaye Kumar.\n\nGabbar ( Akshay Kumar) is a fearless social activist with depressing past who bumps off corrupted elements of the society to bring justice to the innocent and helpless people\n\nFirst time director in Hindi cinema , Krish gives a popcorn masala entertainment with a good message. At the beginning, you are greeted with unnecessary insertion of characters and half-baked romantic track. The movie unravels the moral story and it starts making sense with each scene.The second half is extremely intense with punching dialogues and melodrama taking over. Few scenes do stand out - the hospital scene is brilliantly executed , the climax is impacting. The screenplay does have loopholes but few to be remembered once you leave the theater. These kind of cinemas are generally adored by the masses who loves to whistle to introduction scene of their hero, clap to the item songs and shout as their hero punches the villain. Similarly, Gabbar has everything going in its favor. The humongous entry by Akshay Kumar, the brilliant fight sequence captured in slow motion ( though sometimes larger-than- life) and good storyline. Songs are the major disappointment. Art direction is plain and cinematography is ordinary. Gabbar completely belongs to Akshay Kumar and the actor does not leave any stone unturned. He gives his best and proves his mettle with good performance. Shruti Hassan over-acts and should work on her expressions being in the industry for so many years.\n\nOverall, Gabbar Is Back has right intention with Akshay Kumar ruling the roost. Good 3/5"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "abdowalid",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": "a very entertaining movie with a powerful message.\n\ni would recommend this movie to all the people i know.\n\nthe story is 10/10.\n\nacting is 10/10.\n\ni just skipped some of the songs xD.\n\nthe looks and the sound of gabbar was well chosen the girls also was dressed up well. i hope every one in this world would watch the movie.\n\nthat message must spread all over the world just imagine if we lived in a world free of bribe :).\n\nwatch that movie i know you will enjoy it.\n\nthere is only one thing that i wanted to see, but i cant say what is it lol :)."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "binducherungath",
        "review_rating": "6",
        "review_title": "'Gabbar is Back' can be watched only because the message is loud, clear, and very relevant. The screenplay falters. Dedicated to Swachch Bharat.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "silvan-desouza",
        "review_rating": "4",
        "review_title": "Yet another South remake but quite entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "amrzoro",
        "review_rating": "10",
        "review_title": "a great touching movie",
        "review_detailed_main": "This action movie show you a great powerful massage which is how government is bad and how Gabbar hate corruption ,deviation,cant and bribe .and how much he like to spread peace and love in the country"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "haseebguru",
        "review_rating": "7",
        "review_title": "\"GABBAR\" Is BACK but this time not as Villain but as a Superhero",
        "review_detailed_main": "First of all i would like to say that this movie is not like the typical Bollywood Masala Entertainers. So if you have mistakenly or deliberately watched movies like Bodyguard, Dabang 2, Singham 2 than please at least watched this one which is different and way better.\n\nit's based on Crime, Corruption. A very popular subject but i think they missed the chance by not making it a superhero franchise. Actually i think they not even intended to make it on a larger level.\n\nThe subject is classy if they would have give it more proper time on writing, it could have been much better. The pace is fast and story will remind you many times of Hollywood's Dark knight trilogy but it's not smarter and well scripted like dark knight and that's the problem. Many things are not realistic and seems stupid.\n\nThey made \"Gabbar character\" a Brand. Yes, Gabbar is solid and powerful and Akshay Kumar did fully justice to his role. He back to back gave two very classy movies.\n\nI don't want to discuss about the story or other characters because i don't like writing spoilers but for entertainment purpose, must watch this movie. Your money and time will not be wasted.\n\nAt the end i would like to say that the fear of \"GABBAR\" Is BACK but this time not as villain but as Superhero. I hope they will bring him somehow back in future with a sequel but with Smarter and flawless writing."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "rajeshsoami",
        "review_rating": "1",
        "review_title": "Tried to use 'Retarded' as my user-name",
        "review_detailed_main": "Yes, I/me/myself decided to watch this film. Now you guys can laugh as much as you want. For the better part of the film, we were torn between sitting inside and pulling our hair out or going out in the 41+ degrees Delhi heat. Finally we could bear it no more and stepped out. So this review is only for a part of the film.\n\nEvery single scene is unadulterated 100% pure nonsense. The director has worked very diligently to ensure that sanity is squeezed out from every scene. A Professor, who teaches physics in open air wearing vest and jeans, police officials who deliberately act like morons or miss Haasan whose only responsibility in the film is to torment the audience with foolish humorless utterances.\n\nThis was supposed to be similar to the 'Wanted', 'Dabangg' and 'Rowdy Rathore' series which have hit a nerve with the common masses in India. This one though misses its mark so often and so wildly that we wish the marksman had turned around and shot us instead.\n\nGabbar is dangerous and ruthless as ever. This time though, the audience are the target."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "danielmcluckie170",
        "review_rating": "8",
        "review_title": "Surprisingly good",
        "review_detailed_main": "One of the first Bollywood movies I've watched. And I was highly impressed. Granted there is the OTT action and the escapism from the reality that seems to be in these genre of movies. But the plot and story have. Strong message that resonates throughout the film. Ive highly recommended this to others to watch."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "The intentions are noble but the content is all stale except the hospital sequence, few dialogues and two key performers.",
        "review_detailed_main": "Following a 13 years old hit (RAMANAA/2002) revolving around the same 'all seen before' crusade against corruption in films such as HINDUSTANI, A Wednesday, HOLIDAY, JAI HO, UNGLI and many more, GABBAR IS BACK has nothing fresh in the name of subject matter and thus isn't able to win over the viewers wholeheartedly as Akshay's SPECIAL 26 or BABY. Moreover using the name of the most famous villain of Hindi cinema in its title and main dialogues, the team simply tries to make a fool of their audiences gaining some instance attention since the project has nothing to do whatsoever with the evil dacoit of SHOLAY and his infamous persona.\n\nGABBAR IS BACK begins with a few kidnappings shown in its opening sequences only giving you a feeling of 'Deja-Vu' as something similar seen before in Akshay's HOLIDAY (that was also written by A. R. Murugadoss). So its first 40 minutes are strictly routine with many clichéd and unconvincing scenes served with some good action along with a catchy love song having some hilariously written lines.\n\nHowever, just when the viewers are about to give up, the director comes up with a terrific hospital sequence, revealing the shameful truth behind the exploitation practiced by the hospitals and their pressurized doctors. The particular sequence wins over the viewers in a big way despite the fact that an exactly similar scene was earlier there in GOD TUSSI GREAT HO (2008) having Priyanka Chopra in the place of Akshay Kumar. But obviously no one is expected to remember that forgettable sequence, not given much mileage in that non-performing project as a comedy.\n\nAnyway getting back to GIB, the film impressively pulls in the viewers just before the interval and then again falls back to all routine stuff like a typical Hindi film made on the ages old formula with only one fresh side-angle of Sunil Grover. For instance in the second half, we have an expected tragic background of the hero where he loses his family, gets humiliated and then decides to change the social system taking the bloody path. There is a well shot song depicting his love life and then later a 'must-have' item song too featuring Chitrangda Singh, who was once considered with a lot of respect as a talented actress. As usual, there are mentally lost police officials who strangely know nothing about GABBAR (not even his appearance) whereas the loud, hamming villain more concerned about his 'brand image' than his own son's life, can easily get\n\nAkshay's picture from the CC camera footage of his hospital. Adding to the inspirational angle, a particular sequence of the politician being hidden in his own house is straight taken from Sunny Deol's GHAYAL and the finale crowd scenes look like something highly overused, preachy and unrealistic. In addition the last scene forcibly incorporating the line \"Tera Kya Hoga Kaaliya\" fails to make any impact due to its weird placement. In other words, the absurd insertions keep coming one after another without caring about the logic, but the tightly written script progressing at a good pace with a pulsating background score doesn't let you raise a question putting it honestly.\n\nNot treating its women well, the film has a completely silly role given to Shruti Hassan which she also chooses to perform half- heartedly and then we have the cameo of stunning Kareena Kapoor who is strangely there to provide more glamour and not any (much needed) emotional support to the film playing the victim lady. The supporting cast has its own share of annoying actors like the noisy villain, shouting police officers and the over-reacting doctors in the hospital. Plus though GABBAR has a big team of 'comrades' working with him for the cause, but the viewers do not really know even one of them properly by name or face.\n\nIn straight words, the film is largely saved by only two names considering the performances. And those are of Akshay Kumar playing the cool revolutionary professor with a winning smile and Sunil Grover as the enthusiastic hawaldaar investigating the case on his own. Akshay remains a pleasing and fit figure on screen delivering all the well written dialogues and action sequences with a charming ease. Whereas Sunil Grover, surprises one and all with his sincere act, coming out of his famous image of a funny women popularly known as 'Guthhi'.\n\nMusically, the title track of \"Gabbar Aa Jayega\" is enjoyable, two love songs have catchy compositions (but strange lyrics) and the item song is lifted from a Pakistani number \"Kundi Na Kharka Sohneya, Sidha Andar Aa\".\n\nSumming up, GABBAR IS BACK directed by Krish (from South) has an okay cinematography, clever editing, some powerful dialogues and an uplifting background score, collectively pointing towards a relevant theme of corruption with all noble intentions and two key performances to enjoy. But since its content matter more or less remains the same with nothing fresh or innovative to offer lacking a lot on the logical grounds, the film doesn't turn out to be anything more than a one- time watch and that too preferably in a single screen theater to have a better entertaining experience.\n\nBesides the fact to be considered seriously is that since the 80s, films have been made featuring a personal mission undertaken against the corrupt system, but this demon of corruption is still haunting us all with no major change seen in the last few decades. May be because we widely consider such attempts made just for our three hours of entertainment alone and the message is not to be taken along while moving out of the theatres contributing in the social drive. So if possible just think about it too in case you enjoy watching the typical masala entertainer looking forward towards a better society ahead for the coming generations."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "mohdhussain1993",
        "review_rating": "9",
        "review_title": "Gabbar Is Still Ruthless!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "A Good Package of Akshay Kumar's Stardom and Bollywood's Action-Masala Formula",
        "review_detailed_main": "Reviewed by: Dare Devil Kid (DDK)\n\nRating: 3.4/5 stars\n\nPositives\n\nAkshay Kumar – absolutely incredibly in such roles! Charisma, superstar screen-presence, he's got it all! He's the headlining act of \"Gabbar is Back\", and rightly so, because he's indubitably the heart and soul of the movie. By the end of the film, you won't be able to think of anyone better suited for this role. He doesn't overplay his role and keeps it subtle in spite of having powerful scenes and over-the-top dialogues to deliver. Akshay showcases a complete exhibition of why his aura is still so strong after 2 decades in the movie business.\n\nSunil Grover is good, too. He seamlessly merges into his character of the intellectual constable, Sadhu, and ensures that you forget his popular Gutthi act from television. In future, we hope to see more of this talented actor in film roles.\n\nThe issue of corruption is tackled in a commercial yet topical manner.\n\nThe action scenes leave a strong impact and the climax is good.\n\nThe editing and cinematography suits the nature of the film.\n\nThe movie is largely entertaining, fast-paced, and flows well.\n\nKrish, the big shot South Indian director, who makes his Bollywood debut with Gabbar is Back, does a decent job of bringing all aspects of the story together without losing its pace. It is a commendable effort to keep the essence of the original Tamil film while managing to adapt it to Bollywood tastes so that the context doesn't feel too alien for the Hindi speaking audience.\n\nNegatives\n\nThe music and Shruti Haasan are the biggest disappointments.\n\nSuman Talwar is monotonous as the lead villain and doesn't bring anything new to the film.\n\nThe production design gives the film a dated appearance.\n\nThe dialogues are quite bland and invoke a sense of 90's Bollywood potboilers.\n\nConclusion\n\nMust-watch if you're an Akshay Kumar fan, and love commercial entertainers. If you are in the mood for a full-blown commercial Bollywood entertainer, then \"Gabbar is Back\" is a safe bet with guaranteed entertainment. Plus, it's always nice to see Akshay Kumar in form."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "richard-41652",
        "review_rating": "10",
        "review_title": "do something for us and our country...be youth power",
        "review_detailed_main": "Just excellence....but i give 9.5star bcz of gabbar faansi...if a person who fight for us n our country...our reward is just faansi..thats bot fair.. as a Indian an individuals give him full support. . I must say that every student have to see dis movie..be youth power guys..do something for our country..our India...i know its just movie but we all have to perform this in real life..if we stand then India stand guys..we choose modi ji for better India but only single person can't do all of this ..he need us support specially youth support...we choose him now its time to do again something good for us ..support him..gabbar said when a single stand against wrong thong instead of underestimate the wrong thing he or she is gabbar...only we have power and right to change our life and ultimately our India...jay hind...love you akki...hope you doing same thing in real life as u perform in movie...😉😍😚😎"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "toxicrajya-84021",
        "review_rating": "7",
        "review_title": "It Has its moments....Both Good and Bad",
        "review_detailed_main": "This movie is an unrealistic piece of work which marks the debut of Krish in the bollywood film industry.I found Shruti Hasan annoying But the way Akshay Kumar and other youngsters act is Truly appreciable. I'll say the film has its moments which make the film a mediocre entertainer. Akshay kumar, the power house makes the film worth a watch and if you are a fan of vigilante films and akshay kumar then this is a must watch. I'll say this film is enjoyable and if you are looking for a Sunday holiday picnic, this is a better choice. With this plot , this film could not be better.Some may find it good, some may find it annoying but i'll say you cannot find it ground breaking."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "bluedracoon63",
        "review_rating": "5",
        "review_title": "Not so Good or Bad.",
        "review_detailed_main": "Watched \"Gabbar\" Again, movie which is an eye opener, an ideal dream is produced. Nowadays, producing this type of movies has become fashion for gaining millions of money and publicity. For Example, movies like Singham, Singham 2, Jai ho, and blah blah... the list goes on. these are Non-realistic Movies in which you can put your \"The India You want To see as a Dream\" thing, your own views and make quite good money. Remember this, Movies like Madras Cafe {still a copy, but too much better}, baby, Special 26 are Down to earth, realistic and pure optimized movies where Audience or watcher feels the all type of emotions, where every emotion is balanced when they are watching these movies undisturbed. So let's talk about this movie \"Gabbar\" I think these could have been much better movie if past and present case were played simultaneously. not like past just bombarded in present situation. The movie could have been better if Overacting done by Shruti Hassan, and Akshay Kumar {at some scenes} balanced. The Action sequences were as usual non sense and unrealistic. I mean they don't have visualized it in a better way like.. For example, when Akshay Kumar at the end of the movie kills the villain, the villain gets killed after two bounces in surface and one direct dip in water. Does it makes any sense\" I can bring out out this type of silly mistakes in minutes. The Idea was much better but the implementation was not so bad. Please don't take this review to your heart it was just my point of view. If you use to watch Hollywood movies now and then , than this movie is just an worm up movie. Please forgive me for my grammatical mistakes,,,"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "maulin5",
        "review_rating": "8",
        "review_title": "Gabbar is a good man, and this is a very good movie!",
        "review_detailed_main": "\"50-50 kaus Dur jab koi rishwat Leta hai, to sab kehte hai, Mat Le, Warna GABBAR AA Jayega!!!\" With some rowdy action scenes and clap worthy dialogues, GabbarIsBack, starring Akshay Kumar & directed by Krish, has been released today. Bollywood has seen many movies on the topic- Corruption. Every time, the story remains as it is. One man, who lost his family, because of some corrupted politicians, is taking his revenge, and doing a worthy thing and that is - to clean the country from the corruption. Though, he is a good man, doing in favor of the public, but, his path is wrong. So, he describes himself as Gabbar - Kaam Se Hero, Naam Se Villain! Akshay Kumaar is back in action genre. This film is somehow the mixture of Holiday-RowdyRathore. But, subject is unique in compare with those two. The presentation is also very different. This is for all class audience - Masses as well as classes. Cinema halls are going houseful in the very first day of its release. Akshay gives, as usual, fantastic performance. His look is too good. The dialogues of him, or even every dialogues, written by Rajat Arora, are really clap worthy. In OUATIM Dobaara, he gave too much load through his dialogues. But, this time, dialogues are impact full and become one of the plus points. Shruti has a very small role. She only speaks 4-5 lines, and doing 1 song. Even I felt that that song should not required in the film. Sunli Grover steals the show. He is doing comedy, also speaking some serious lines. He is damn good in this as Akki said in the show of Kapil. Jaideep Ahlawat as a CBI officer also does his part very well. The villain of this film, Mr. Patil, played by Suman Talwar, looks like Prakash Raj, and acts like him, too. But, overall good performances by everyone. Kareena Kapoor Khan is doing a cameo as Gabbar's wife. Doing one song 'Teri Meri Kahani', too. She looks really beautiful and gorgeous. While watching her, the boy sitting next to me, was saying 'Wowwww Yaar'!!! That means, she genuinely looks awesome! Compare to her, Chitrangada looks average in the song Aao Raja. This song is the biggest minus point of this film. Krish is debuting as a director through this movie. He can able to engage the audience with comedy, action, drama and some serious matter situations. The whole Hospital scene is outstanding. But, after the movie, all viewers should be recognizing and talking about the heart touching, very well written & absolutely perfect climax. The collection of day 1 will be sent to Nepal for the cause. So, if possible, go today and join the cause. Else, you can watch this Gabbar anytime, because 'Gabbar is a good man' and this is a very good movie!!! With this flick, Box Office ke achhe din aayenge..."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "anupapu8",
        "review_rating": "6",
        "review_title": "Novel Concept , Stupid Screenplay....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "dabanggk-86503",
        "review_rating": "1",
        "review_title": "Bad Remake Of Tagore",
        "review_detailed_main": "Does Not Justify the original telugu movie tagore."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "bdhagia",
        "review_rating": "10",
        "review_title": "Overall A Good Movie With New Concept But It MUST Have Been Made More Sensible, Connecting And Appealing.....#AlwaysAnAKKIFan",
        "review_detailed_main": "Being A Die Hard Akshay Kumar Fan, You Expect A Good Fighting Sequence From His Movies With Good Punching Dialogues And Everything Else, Especially After Seeing His Previous Two Films- Baby And Holiday...\n\nGabbar Contains A Good Story Line With Good Actors And Good Direction, Only Two Songs In Movie Which Is Very Rare For An Indian Movies, Also The Affection Everyone Can Feel Throughout The Movie, The Rage Audience Feels During Some Good Anti-Corruption Sequences And Way Gabbar Treats The Corrupt People May Seems Little Offending But Its The New Way Of Disagreeing With What You Oppose, Well The Most Often, Also The Ideas Are Very Nicely Summed Up The Concept Of Everyone Following The Gabbar...\n\nOn The Other Hand, The Villain Portrayed As Larger Than Life Character, Scenes Have Been Manufactured Rather Than Created, Continuity Should Have Been There Between Each Scenes..."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "kundansaha",
        "review_rating": "7",
        "review_title": "A decent Indianization of Hollywood saga...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "fahadking07",
        "review_rating": "10",
        "review_title": "No words to say... It's just amazing",
        "review_detailed_main": "It's a movie with good lesson and full of Entertainment. I didn't feel even a single scene in this film as boring or useless. Script really amazed me. And dialogs were just Woow...... Akshay Kumar did not amaze me with his performance, because he is always just \"Awesome\", no words to say for him. Story was also amazing and good. My rating for film is 10/10 and for Akshay Kumar 11/10. Akshay Kumar really did amazing job, I just can't stopping this film again and again, this movie is emotional too, I was in tears in the last scene... Anyways, I just enjoyed watching this movie and I recommend others too to watch this amazing movie. Good Job Akshay Kumar and the team. Best of luck for your future films."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "akshay-ranganathan",
        "review_rating": "6",
        "review_title": "Preachy yet fun, better than 'Ungli'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "kritikagupta26",
        "review_rating": "8",
        "review_title": "A fine watch with family & friends...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "jay-techie2007",
        "review_rating": "7",
        "review_title": "A good entertainer, preachy but leaves a lot to be desired",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "harishgadappa",
        "review_rating": "4",
        "review_title": "Not a worthy Remake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "ankurlkw",
        "review_rating": "10",
        "review_title": "A movie for the Indian Youth",
        "review_detailed_main": "Gabbar is a movie which tells us what strong Law can do to stop Corruption practices which prevails in India today.\n\nIt's a movie which touches and reminds us the power that each one of us has to stop the wrong in the society.\n\nAt one point Gabbar, played by Akshay Kumar, talks about Swami Vivekanada's message - the power of youth and how it can be tapped.\n\nThe second half is engaging and the performances are commendable.\n\nIn the end Gabbar belongs to Akshay Kumar. His intention and honesty of portraying the character of Gabbar.\n\nWtach this movie to get inspired and to do your bit to make our Country a better place."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "Vivekmaru45",
        "review_rating": "7",
        "review_title": "Don't Forget To Also See Ungli(2014) If You Haven't Already.",
        "review_detailed_main": "This film contains a powerful message to the public as a whole. One man can make a difference if he stands up to his IDEALS. Mahatma Gandhi was one such man. Also Swami Vivekananda is another good example. These two people preached non-violence and love towards your fellow man. Jesus Christ himself said that Love your enemies, bless them that curse you, do good to them that hate you, and pray for them which despitefully use you, and persecute you. But times have changed so much, that a man cannot do anything by principles and non-violence alone. Sometimes he has to use plain force to make a statement to others.\n\nIn this film Aditya's(Akshay Kumar) life is shattered by an unforeseen tragedy. The cause of his grief is linked to a tycoon called Digvijay Patil(Suman), who has allowed construction of a tenement building on soil which was deemed unfit for construction by a survey team. He bribes certain government officials to look the other way and allow construction of the building. When the building collapses, Aditya's pregnant wife is killed instantly along with numerous residents.\n\nAs Aditya struggles to recover his wife's body from the rubble, he makes a vow to bring Digvijay Patil to justice...\n\nWatch the film to see what happens next.\n\nIn the film, a message is given to the youth of India. They are the future and they are the ones to bring about change. As a wise man once said, \"United We Stand, Divided We Fall!\".\n\nOther films you may like: Yeshwant(1997), Main Azaad Hoon(1989), Bhrashtachar(1989), Ab Insaf Hoga(1995), Shahenshah(1988), Veergati(1995), Prahaar: The Final Attack(1991), Yeh Aag Kab Bujhegi (1991), Kurukshetra(2000), Shiva(1989), Jalwa(1987), Ghayal(1990), Ghatak: Lethal (1996), Gardish(1993), Aakhri Adaalat, Falak (The Sky).\n\nThere are many more films, but these are a good start. Thank you for having the time to read my review, may you live long and prosper."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "heartmak",
        "review_rating": "4",
        "review_title": "Fight against corruption",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "In this MASS entertainer Akshay ROARS LIKE A LION!!! TIME TO JOIN GABBARS REVOULTION...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "anka-190-284357",
        "review_rating": "6",
        "review_title": "One Time Watch",
        "review_detailed_main": "Story : Gabbar Singh Rajput (Akshay Kumar) Creates his own military network called the Anti-Corruption Force that eliminates the most corrupt person's individual s,in a systematic manner. As pressure builds on Police and Government to track down the man who masterminds these killings, Balbir Singh (Sonu Sood) is specially summoned to head the task. He is aided by Suryam (Prakash Raj) who, though being just a constable in the mammoth Police force, is compelled by his instincts to see through the underlying design\n\nActing :\n\nAkshay kumar did his job very well.His acting is awesome in this movie . Whereas Sunil Grover played a roll of Constable Sadhuram , he did his job brilliantly and rest of the actors were irritating for the audience specially the Jagdish Rajpurohit (Sub Inspector Yadav) and Raj Singh Arora(Govind). Suman Who plays the role of Digvijay Patil in this movie , he looks good in some scene.\n\nDirection : Radha Krishna Jagarlamudi (director) , Direction of this movie is not good , its average. Some scene seems useless , and annoying .\n\nOverall : It's one time watch , if you are a huge fan of a Akki , then you must see this movie , otherwise , there is nothing new in this movie."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "adityamestry16",
        "review_rating": "9",
        "review_title": "Not only Massy but also Classy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "Puroo",
        "review_rating": "6",
        "review_title": "This film was most probably made to \"cOnNeCt WiTh ThE yOuTh\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "vishalshah",
        "review_rating": "10",
        "review_title": "Main Hoon Gabbar",
        "review_detailed_main": "I was tired of watching Akshay Kumar's tiring comedy movies but I can happily say that after some non sense movies like HNY, you get to see a movies full of action, lovely music, awesome dialogue delivery and Sunil Grover as Constable Sadhu PERFECT he was more like a detective then a cop he worked every detail of this case like he was investigating from every single angle. After watching and loving Akshay Kumar's performance in BABY get to see him in a good serious role as GABBAR at total Paisa Vasool Masala Movie everything is perfect. These are the kind of movies that Akshay Kumar needs to do, Serious Movies with a message \"Corruption mat lena nahin to Gabbar aajega."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "ahegde3149",
        "review_rating": "4",
        "review_title": "Generic clichéd story with forced message, saved only by Akshay Kumar.",
        "review_detailed_main": "Gabbar is Back! Yeah. But this time only villain by name and hero by his deeds. Already, a remake of some South Indian film, the plot of common man turning vigilant is nothing new. Only the difference here is his aim is to eliminate corruption. The message is hammered hard onto you, without any subtlety.\n\nAkshay Kumar plays Gabbar, a lecturer in college who under the hood runs a elite gang of enthusiastic and non-corrupt people. They kidnap corrupt officials and hang one who tops the most corrupt list. The police are trying to track him down as the gang continues to kidnap corrupt people. All the strings get tied towards the main villain Digvijay Patil, who calls himself a 'brand' of corruption. There is past history involved between Gabbar and the villain, and the stage gets set for a showdown. Unlike, A Wednesday where the script backs up the message it tries to deliver aptly, here we have brute force and hard dialogue delivery to smashed onto your heads.\n\nThe premise is entirely fictitious. It tries to show that almost 99 people out of 100 are corrupt and the police and CBI seem to have complete lack of skills here. If you don't care about all that you mind end up loving it. Acting wise, Akshay Kumar pulls another great act after Baby this year. He gives the character of Gabbar the requisite depth perfectly. Shruti Hassan plays a role of an unnecessary and forgettable character, plus Kareen Kapoor appears in a Cameo. Amidst the rest, Sunil Grover, as a police driver was quite good. The pacing is good, the two hours don't feel much and time to time action and hard-on message dialogue delivery keeps you engaged. There are 2-3 songs which felt completely unnecessary.\n\nIn the end, Gabbar is Back is a totally formulaic film, which will be liked by audience preferring so called 'masala' entertainment not caring much about the script. Its not unbearable, but still you wont regret missing it out.\n\nRATING: [2/5]"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "Dark_Lord_Mark",
        "review_rating": "9",
        "review_title": "Pretty Good Heroic Vigilante Film",
        "review_detailed_main": "Grabbar is an Indian movie with some nice flair.\n\nThe action is nice, not the best I have seen but nice.\n\nThe action takes a back seat to the message. Corruption needs to be punished. Grabbar is he friend or foe? Good or bad? It is a Bollywood film with a good message and anyone who is a true fan of hero movies, 80's action movies, guy movies will like it.\n\nI wanted to rate it a 10, but I settled on 9. The film might not be for everyone as it is in Hindi and somethings may not translate to English very well.\n\n9 out of 10. Very enjoyable.\n\nGrabbar is not the hero we want, but the hero we need!"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "sameira",
        "review_rating": "2",
        "review_title": "Disrespectful",
        "review_detailed_main": "This movie is a big threat to our society. It has made an unsuccessful attempt to highlight a sensitive topic of 'corruption' and in doing so ,it has affected self respect of many other professions. More importantly, they have left out their own . what new change they expect out of criticism? Also, it showed utter disrespect to professions such as Medical, Civil Services and even for auto rickshaw drivers.\n\nMedical profession holds very high respect and dignity for a dead person.Doctors fight for the life of a patient until his last heart beat stops. What has been depicted in the movie ,is a sheer disrespect to the noble and selfless service given by Doctors towards our society. These kind of baseless scenes will also serve to dishearten many new hearts wanting to pursue golden career in medical profession and nevertheless, what about the prestige of those bright minds working currently in different hospitals across the country. Wont they feel like giving up early if we wrongly highlight such issues?. According to me, a common man cannot equalize and comment on technical advise given by doctors.Can an hour of google search beat the doctors knowledge and experience of so many years? We all know that change is the rule of life and so, variations are expected to occur in biology.\n\nI express similar concern for other professions like civil services , police and judiciary.I hold a big sense of respect for all professionals who work day in and day out to make our life easy and beautiful. I feel sorry for them when I come out of theatre after watching this movie."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "vishnudahatonde",
        "review_rating": "8",
        "review_title": "Movie no one should miss.",
        "review_detailed_main": "Need to accept that this is not one of those great entertainers. But for sure, It is the movie no one should miss, specially when you have not watched 'Ramana' movie earlier. Everyone has acted to their capacity,Akshay kumar showing why he is known as 'Khiladiyo ka khiladi'. People who love to watch movie which make sense should definitely watch this movie. Corruption in public and private sector is exposed beautifully and I am sure you will feel the theme from within you, because that's what you go through everyday. It won't be good if I reveal the story. Go and watch the movie. Go with family, you will feel better."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "darshanbilala",
        "review_rating": "10",
        "review_title": "Excellent Movie , Really Great",
        "review_detailed_main": "Movie Is Awesome , Gabbar Is Back, has the iconic Gabbar stamp all over it but is also so very contemporary. It is ironic that someone could adapt the iconic name of Gabbar, to a south remake and come up with such an all Indian Massey, zany, adrenalin rushing film, which will also making your think, react and make you want to pick up the mantel of an activist.\n\nSuperstar Akshay Kumar has reintroduced Gabbar to Bollywood, and to the world, and I think only he could. Akki is in one word brilliant . The audience is going to love him. The hospital scene or the climax or for that matter through out he stands out.\n\nOther than him credits should be given to many\u0085movie making is a collective job. The tight-on- the- leash direction by Krish, the taut editing, music, background music and also the production of Sanjay Leela Bhansali and Shabina Khan. Shruti Hassan is is convincing. Sunil Grover has done a great job.Suman Talwar and Jaideep Alahwat are also fantastic. Even Chitrangada Singh is very sensual. Kareena Kapoor believe me has never looked so beautiful recently. Songs are good. Action is super. On the whole a tight, Massey, contemporary, patriotic, timely and fantastic, entertaining movie\u0085 Team Gabbar\u0085 you guys have a winner on your hands."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "doctorchandank",
        "review_rating": "8",
        "review_title": "story of GABBAR",
        "review_detailed_main": "Gabbar attitude, yet with a heart this time.\n\nAkshay Kumar stands out alone in the film. The story is bit related to Ungli only The Basic plot is same but it's actually better. The villain (Suman) is a total mismatch for the character he's playing. Sunil Grover is Good. Kareena's Screen presence (her Cameo) is Charming. Rest of the cast is neutral.\n\nThe direction is weak at parts. The movie could have been a lot better if the direction,Screenplay,Cinematography was taken care of.\n\nThe characters sometime acts too filmy.It's difficult to connect with reality at times.\n\nAkshay's Dialogues, is the Backbone of this film.\n\nSince there's No one that could pull off \"Gabbar\" like Amjad Khan. But Still, nevertheless Askhay Kumar definitely,will be remembered for this role"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "yasiru1991",
        "review_rating": "4",
        "review_title": "Only a Feel Good Movie",
        "review_detailed_main": "Intended to give a good message related to eliminating the corruption but fails to deliver it with a strong and impactful story line.\n\nPoor Camera and Direction. Camera work is poor as we can see some sudden not matching changes happening background while same scene is going on. Director has failed to materialize a realistic story, direction etc. And hence viewers feel that this is just a movie.\n\nYou can watch it to spare your free time but do not expect anything more than a feel good commercial movie. Akshay has done pretty good movies than this and bit sad to see his personality contributing to this kind of movies."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "trishsuraj",
        "review_rating": "9",
        "review_title": "Akki 🔥",
        "review_detailed_main": "Want this type of movie form akki sir. Very good concept"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "npdeo18",
        "review_rating": "4",
        "review_title": "An upgraded version of mindless salman khan movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "jogendra-42350",
        "review_rating": "10",
        "review_title": "Lovely lesson & moto.Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "anubhavtechie",
        "review_rating": "10",
        "review_title": "Nice concept.... good family movie",
        "review_detailed_main": "Nice concept.... good family movie...... worth watching."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "sonariyaankit",
        "review_rating": "8",
        "review_title": "Salute for the south Indian thinktank",
        "review_detailed_main": "I watched it,don't ask where. I just watched it. When the film started there was what i expected classic GABBAR dialogues with new age RAP by raftaar. I was like, okay, title is 'honoured' enough. Movie has a good start portraying Aditya aka Gabbar teaching physics as expected good post, honest man and strength. There i expected bad experience with system. I thought another remake with same plot. But , then there comes a twist when they show that hospital incident displaying doctors cheating for money. I didn't expected something like that , even when i know it really happens . Sadhoo story has been conveyed so well. He is not heard by seniors. I thought there will come a time when he will play a cameo. But for my surprise, unexpected move he starts his investigation. Story goes well kidnapping and killing, influence on others. One thing i expected still hadn't come close relative to be introduced in negative role. There comes kidnapping of sheriff i mean ACPs (getting Hollywood). Climax is good enough, the message at end is so so so well delivered ' the most imp thing'. Lets come to performances. Akshay as Gabbar as always rocks when it comer to action for nation. Shruti is OK. Kareena stands her own as per a cameo song showing a big part. Karan 'gutthi' grover is adorable. Others do well specially cbi officer bava. Overall movie is predictable. But, it stands millions of miles away from expected. The new way to think, deliver message, seriously awesome."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "prasannjeetsingh",
        "review_rating": "4",
        "review_title": "Good story, but imperfect.",
        "review_detailed_main": "In a line, the movie shows a very unrealistic way of fighting against corruption by a group of few intellectual people. The story feels really motivating and the movie gets 9 out of 10 for that, but overall, we see the same old not-so-perfect picturization. Audio-Visual sync is something not taken care of at many scenes, and I think this should very well be considered in a movie review.\n\nFurthermore, I felt that the character of \"Shruti\" played by Shruti Hassan was forcefully inserted in the movie. Being the Female Lead, there is nothing significant the character does or contributes to affect the main plot/story. A truly androcentric movie, could have been better without a female lead: less masala minutes and more focused on the plot. In a separate story-line, the movie also describes an honest but ambitious constable. The character was also not justified. The movie can be described as motivating with a good story-line completely wrapped with the same old unneeded masala, such as dialogs with purposeless echoes, traditional and non-essential item song, single man fighting with ten or more goons at the same time and winning, dream song sequence, etc.\n\nI personally feel that this story could have been told in a lot, lot better way, but for Akshay Kumar fans, the movie can be seen in Theater, because he has done justice with the character. People who liked Kick, Singham and similar masala flicks should not miss it as well. Others looking for a little finesse, can wait for the TV broadcast, in my opinion."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "zoyahso",
        "review_rating": "10",
        "review_title": "Best Of Bollywood",
        "review_detailed_main": "There was no intentions to go to the movie, no plans as well. I had went for More like a time pass but I MUST say it was WORTH a watch. A very inspirational movie. If you find sometime this week, I think you should definitely go for it.\n\nThe director took a good concept and completely ruined it with crass south Indian stunts, shitty dialogues and an even shittier villain. Everybody seems to be overacting in this film as if they payment was subject to the quantity of emotions displayed on the face! (even if not required). Sunil Grover's performance as a sincere constable is the only saving grace of the film. I should have rather watched Fast & Furious 7 again rather than wasting time on this crap.\n\nExcellent watch. Another good release by Akshay Kumar. The overall handling and screenplay was very good. A fast paced movie. Awesome acting by AK. good movie, you can watch second time. superb an amazing film. hope India changes before someone really does this."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "MuviFan73",
        "review_rating": "4",
        "review_title": "trailer actually seduced me",
        "review_detailed_main": "OMG such a high rating(8.9/10), really make's me doubt intelligence of rating audience. The scene from trailer, addressing audience.. was something I was looking for around interval, sadly it happens to be in the end. The script is weak. The idea to challenge corruption seems nice, but the movie has got unnecessary scenes, and hyper delivery of drama.\n\nThe CBI level enquiry that is addressed in movie is hardly shown, perhaps more enquiry done by hawaldar driver Sunil Grover is shown. Information about the people working under Gabbar is hardly shown which appear as weak actors. Rather than creating a national issue and executing it in such a poor manner, a revenge story rotating around the character would have been nice. I did felt like walking away most of the time.\n\nrating: 6/10"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "khansameullah",
        "review_rating": "10",
        "review_title": "I look gabbar movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "mayurbeek",
        "review_rating": "8",
        "review_title": "Baby hero",
        "review_detailed_main": "He was a nice amazing actor. He was going great he good fighter. Someone special about it SHUTHI beautiful actress. This movie made money little it's fine. Akshay best actor forever."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "kichdi",
        "review_rating": "2",
        "review_title": "Suman Talwar (Telugu superstar) Vs Akshay Kumar",
        "review_detailed_main": "Gabbar is watchable only in parts, the movie is so bad & repetitive Bollywood fare against corruption. This movie could have been professional but the director messes the few good patches also with extreme masala.\n\nShruti looks decent in this movie but does not seem to be dubbing her own voice, she is mouthing but voice is not in sync in many of her dialogues. The biggest plus is Akshay Vs Suman Talwar's dialogues, apart from that the movie is not worth watching. All said, this movie is way more watchable than Happy New Year, Kick, Ek Tha Tiger & also the stupid PK. Suman Talwar should be roped in as a main villain in Hindi movies as Prakash Raj looks to be repetitive & boring with every film. Akshay Kumar is also not in his best, he was better in Holiday. His forte nowadays seems to be patriotic stories, he is following the footsteps of Sunny deol & Mr. Bharat (Manoj Kumar). My 1 star for Akshay & 1 star for Suman Talwar. Nothing for the story & other casts."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "theshoaib-mughal",
        "review_rating": "1",
        "review_title": "What an excuse for a movie",
        "review_detailed_main": "I mean seriously guys you can do better, Hell you have done better. What gone into you to make this movie and bring it out for public to even see. Come on guys don't stain your name. Okay you have a good story going on there but the making of this film can do better. You have cast Akhshay Kumar, one of the best actors you have got but for a perfect cog to work better you must have a better machine as well. You have paired him up with actors who either don't know what acting is or those who know it TOOOOOOOO much..if you know what i mean :)) Shruti K. Haasan is a good actress she is good looking and also a new addition to the media but she must wait while her skills hones :)"
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "Insane_Man",
        "review_rating": "2",
        "review_title": "2 Star for the Hospital Scene otherwise 0.5 star.",
        "review_detailed_main": "Gabbar is Back!! Why the name is Gabbar is Back!! Nobody knows. Why he is a professor, and why he have no revenge for her ex, but only he knows Anti-Corruption. meh!!! A typical Indian movie, about corruption. But ruined very very ruined for over heroism, unreasonable and idiotic scenes. The heroine, wander, why the heroine taken for acting in the movie. Does she have any role or any importance? The theme is good, very good, But presentation is in a worst way. And the ending. I didn't see this kind of endless ending. The worst ending in the era. If anyone want to see the movie, see but don't expect a great or even a good movie."
    },
    {
        "movie_id": "tt2424988",
        "movie_name": "Gabbar Is Back",
        "movie_rating": "7.0",
        "review_username": "Cinephilia1508",
        "review_rating": "",
        "review_title": "Boring Movie",
        "review_detailed_main": ""
    }
]